{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 9, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "What a terrific thriller: a true page turner which you won't be able to put down until the very end. Timely and important. Grab it!!"}, {"review_sentiment": 5.0, "review_text": "Very good read, especially if you like both a good mystery and a good turn of phrase. Interesting perspective on the world as well in the tale of an executive head hunter who gives that term a new twist."}, {"review_sentiment": 5.0, "review_text": "In his provocative new novel \"The Headhunter\" the author depicts a universe rife with corporate and political corruption and malfeasance, where the worst criminals get away with murder,The author, who was an international headhunter for over 30 years and conducted many high-level search assignments for U.S. and European corporations, knows this world inside out. Too few of the worst criminals are ever brought to justice, and the protagonist joins a small group of philanthropists whose mission it is to bring justice to those most deserving of it.Woven into the story are the shenanigans of a notorious Swiss bank with global reach, the nefarious doings of the Vatican, and the merciless iron fist of the Israeli military. The end of the friendship between the German protagonist and his best friend, a Jewish anarchist, adds a personal dimension to the story.The book is a prescient commentary on the sense of disgust with corrupt politics and corporate greed that has settled over wide swaths of the U.S. and Europe. It makes for deeply satisfying reading, because here the worst evildoers are identified, tracked down, and delivered to their richly deserved fates. Bravo!"}, {"review_sentiment": 5.0, "review_text": "I don't usually like \"mystery\" or \"suspense\" novels, but this book took me by surprise and proved impossible to put down. The plot is not \"overlong and overwrought\". In fact, Findley builds the story meticulously. Right from the first page a sense of forboding and horror pervades the book, very much as in the model, Conrad's \"Heart of Darkness\" (also used by Coppola in \"Apocalypse Now\"). Perhaps not a \"successor\" to Conrad's novel, but certainly a very worthwhile development from it and one which does not owe its genius to the original. Certainly the reader will get more out of this book having read Conrad.This book should please suspense readers as well as those after something a little more substantial. I am very surprised the book is not better known and am curious to read more by Timothy Findley."}, {"review_sentiment": 5.0, "review_text": "Headhunter is a complex novel which combines images from Conrad's Heart of Darkness (the escape of Mr. Kurtz) and Fitzgerald's The Great Gatsby (Jay Gatz, the lady in white) into a superb psycological novel.  Findley is a  master of the screw-with-your-head type of novel, and he has proved it with  Headhunter.The novel has countless dimensions that cannot be revealed  through one reading.  I look forward to reading it again (when I get it  back from the last person I told \"You HAVE to read  this!\").It's lengthy, but definitly worth  the time.  Enjoy the  book!"}, {"review_sentiment": 5.0, "review_text": "Findley updates the distrubing images and symbolism of Conrad's classic Heart of Darkness, in this riveting epic.  The character development is incredibly precise and leaves the reader with a true sense of being invloved with the characters.  It is much easier to comprehend if you have read and studied Conrad's book, but a must for anyone who enjoyed the classic.  Headhunter is book that will stay with you for the ages."}, {"review_sentiment": 5.0, "review_text": "The Headhunter was good. I laughed, I was amazed, I was scared, I was glad. What more could you ask for. Good job Timothy Findley. Keep up the good work."}, {"review_sentiment": 5.0, "review_text": "This is a superb literary thriller, the thinking person's antidote to hip, but mind-numbing, pop culture referencing. It helps to have some stored up memories of Heart of Darkness, as well as other works such as The Great Gatsby, but its chills do not extend only to the bookish. Warning: This book reveals what \"the horror, the horror\" means to a late 20th c. audience. It's not for the squeamish, but it is worthy of attention"}, {"review_sentiment": 5.0, "review_text": "Timothy Findley weaves the ultimate in psychological tales, and brings to life a collage of the most twisted and believable characters.  A must for any Torontonian looking for a 21st century dark slant to the city.  One of the best books of the decade.  You can't put it down.  Appleals to the darkness and the psychologist in us all"}]}, "authors": ["Timothy Findley"], "isbn": "0006485324", "longitude": -79.387207, "periods": ["1900s"], "title": "Headhunter", "word_cloud": "terrific thriller true page turner able important very good especially good mystery good turn phrase perspective world well tale executive head hunter give term new twist provocative new author depicts universe rife corporate political corruption malfeasance worst criminal get away murder author international year conduct many search assignment european corporation know world worst criminal ever bring justice protagonist join small group philanthropist mission bring justice deserve story shenanigan notorious swiss bank global reach nefarious doings merciless iron fist military end friendship german protagonist best friend jewish anarchist add personal dimension prescient commentary sense disgust corrupt politics corporate greed settle wide swath make deeply satisfying read worst evildoer identify tracked deliver richly deserve fate usually like mystery suspense novel take surprise prove impossible put plot overlong overwrought fact build story meticulously first sense forebode horror pervades much model also use now perhaps successor certainly worthwhile development owe genius original get please suspense reader well something little substantial surprise better know curious complex combine image escape lady white superb psychological master type prove countless dimension reveal reading look forward read get back last person tell have lengthy definitely worth time update disturb image symbolism classic rivet epic character development incredibly precise leave true sense involve character much easier comprehend studied anyone enjoy classic stay age good laugh amaze scar glad good job good work superb literary thriller think person antidote hip pop culture reference help stored memory well work chill extend bookish reveal horror horror mean late audience squeamish worthy attention weave ultimate psychological tale bring life collage twist believable character look century dark slant city best decade darkness psychologist", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "It all starts when Lilah Kemp - librarian, spiritualist, schizophrenic - inadvertantly lets Kurtz out of page 92 of Heart of Darkness and is unable to get him back in.\r\n\r\nWhile Kurtz is stalking the streets of Toronto, Lilah frantically begins her search for Marlow to help her deal with the literary villain\r\n\r\nMeanwhile, the city is becoming increasingly chaotic and terrifying. The rich and powerful are engaged in a web of depravity, a new and horrifying disease called sturnusemia has swept the city, and severly traumatized children are turning up at the local psychiatric institutes. Kurtz seems to be at the centre of it all.\r\n\r\nLilah, witness to events tearing the very fabric of her society, seeks solace as always in the great works of literature and prays for Marlow to find an capture Kurtz - before it's too late.", "asin": "0006485324", "rank": "3814767", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51YiHyV3JjL.jpg", "country": "Canada", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}