{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 37, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I had such a long wait for this book but I have to say it was most definitely worth it.Being a born and bred Londoner I really enjoyed seeing it through someone else’s eyes.It was great to see Angela go back to London. It was nice to see her with her family and Louisa oh and little Grace.I loved the scenes with Mark, it was nice to see Angela putting him in his place.In a strange way I actually enjoyed Jenny and Craig’s relationship maybe she can stop him being a ‘slutbag’.Also I would love to see James and Graham together in the future. I think my favourite part was the date with Alex. The day at the Zoo and then the picnic on the hill. It was so romantic, obviously apart from ‘Solene baby gate’.I loved all the ideas for the garden wedding the fairy lights, the flowers, little cupcakes for the wedding cake, I have to say I was pretty upset when it didn’t work out but I think the real wedding in New York was perfect. How could Angela get married anywhere else? With the NY skyline and that dress! Just perfect.I really hope there’s another book, and soon."}, {"review_sentiment": 5.0, "review_text": "Another fabulous book in the I Heart series by Lindsey Kelk. I just cannot get enough of these books! This book sees Angela return to London and I loved that fact that this book is set in both New York and London, both great cities. And we also have Angela staying back with her parents so we get the whole 'I've been away and now I'm back in small town England' type of thing too. This just mixed so well with the story line of these novels. I honestly think that the cities these books are set in contribute so well to the plot and the character development so of course London was going to be fabulous!Obviously we have an amazing cast of characters in this novel. Angela's mum plays a much bigger part than she usually does and I loved her character in this book. I also loved the way Alex's character changes quite a lot during this novel compared to the previous novel. This is probably because Angela is in denial for a lot of this book, about a lot of things. She reverts back to childhood behaviors when she comes back home, thank goodness Jenny is there to sort her out, although Jenny may have a few issues of her own-I guess Alex to the rescue it is-I loved that!There are some hilarious moments in this book, as there are in the others in this series, but I think it is made even more funny by the fact that we have some American's in England and some Brits trying to accommodate those Americans. There are also some hilarious moments of people jumping to conclusions they shouldn't. Obviously this is not always a good thing, but what would an I Heart book be without a little drama?I loved this read and it was a great sequel and a great addition to the series. If you are a Brit who has been living in America too and knows what it is like to go back home, this is definitely the book for you! You don't HAVE to read the other books in the series to read this one, you will get to love the characters either way but I would definitely recommend reading them all-what are you waiting for?"}, {"review_sentiment": 1.0, "review_text": "The characters are shallow, self-absorbed, egocentric ---- the exception is Alex and I have no idea what he sees in Angela"}, {"review_sentiment": 5.0, "review_text": "Can't wait for a new book."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this book very much. Well written, very true Brit chatter, actually all characters were true to form. And I say this as someone who lived with a lovely, successful UK rock and roll drummer for many years."}, {"review_sentiment": 4.0, "review_text": "Plenty of humor. Funny characters. Maybe one or two characters are a bit too bizarre."}, {"review_sentiment": 4.0, "review_text": "Very easy and lighthearted read."}, {"review_sentiment": 4.0, "review_text": "Get a glimpse of Britishness here! Author Lindsey Kelk flies her readers to London, immersing them into life in the metropolis, offering an experience that can only be enjoyed by being there.Descending into Heathrow, Angela, our guide and central character describes the approach, through champagne bleary eyes and this is what she sees:.... \"And then it appeared. The opening titles of Eastenders* rolled out underneath me, the ribbon of river curling up and stretching out across the landscape, punctuated by large patches of green. My stomach slipped when I spotted the Houses of Parliament, the London Eye...\" And more....Magic FM and drizzle. Primrose Hill and London Zoo. Mahiki and Harvey Nicks.The Gherkin (Angela likes it!). And finally, the decision where to have the quintessential English afternoon tea? Should it be the Ritz or the Wolseley? Angela and her team are quite clear on this one but you will have to read the book to find out! This book really is a case of \"seeing a place through an author's eyes\" Enjoy!"}, {"review_sentiment": 5.0, "review_text": "Fantastic!"}, {"review_sentiment": 5.0, "review_text": "Loved it! Have fun reading it!"}]}, "authors": ["Lindsey Kelk"], "isbn": "0007462271", "longitude": -0.12574, "periods": ["2000s", "Recent Releases"], "title": "I Heart London", "word_cloud": "long wait say definitely worth bear bred really enjoy see someone else great see back nice see family oh little loved scene nice see put strange way actually enjoy relationship maybe stop slut bag together future think favorite part date day picnic hill romantic obviously apart baby gate love idea garden wedding fairy light flower little cupcake wed cake say pretty upset work think real wed perfect marry anywhere else skyline dress really hope soon fabulous series get enough see return love fact set great city also stay parent get whole away back small town type thing mixed well story line novel honestly think city set contribute well plot character development course go fabulous obviously amaze cast character mum play much bigger part usually love character also love way character change quite lot compare previous probably denial lot lot thing revert back childhood behavior come back home thank goodness sort issue rescue love hilarious moment others series think make even funny fact american try accommodate also hilarious moment people jump conclusion obviously always good thing little drama love great sequel great addition series living know back home definitely have series get love character way definitely read wait character shallow egocentric exception idea see angela wait new enjoy much write true chatter actually character true form say someone live lovely successful rock roll drummer many year humor character maybe character bite bizarre very easy lighthearted glimpse fly reader immerse life metropolis offering experience enjoy guide central character describes approach champagne bleary eye see appear opening title roll underneath ribbon river curl stretch landscape punctuate large patch green stomach slip spot drizzle like finally decision quintessential afternoon tea team quite clear find really case see place author eye fantastic love have fun reading", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "The perfect London read for summer. Angela's back on home turf - and in her biggest romantic scrape yet...Angela Clark has fallen in love with New York - and it's starting to love her back. But when she's summoned home to London, she's at risk of losing her shiny new life to never-ending English rain, warm beer and bad memories. \r\n\r\nTalk about stepping back in time There's Mark, the ex-boyfriend - who she ran to New York to get away from. There's Louisa, her best friend, with her terrifying new baby. And there's her mum, still talking to her as though she's fifteen. Now there's a wedding in the offing - and everyone remembers how well Angela behaved at the last one...Can the arrival of boyfriend Alex and best friend Jenny save her from a re-run of her old self?", "asin": "0007462271", "rank": "1389414", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51bC7I6A6fL.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}