{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 18.4801972, "ratings": {"num_ratings": 47, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "purchased for a friend who said it was a good book about Porfirio."}, {"review_sentiment": 5.0, "review_text": "inspirational perspective of an alternative life style plus interesting historical sidelights of that era .  he my man!!!"}, {"review_sentiment": 3.0, "review_text": "Fine book about a contemptible character.  Nice overview of history of the period."}, {"review_sentiment": 5.0, "review_text": "what a life and interesting read..."}, {"review_sentiment": 4.0, "review_text": "Nice surprise. History, celebrity, sex and comedy. Easy, fun read."}, {"review_sentiment": 5.0, "review_text": "Awesome"}, {"review_sentiment": 5.0, "review_text": "good and I enjoyed it"}, {"review_sentiment": 5.0, "review_text": "A legend of my country the Dominican Republic, he knew how to approach every opportunity he was given in the best way. Well written book with even history of the Dominican island, would recommend to everyone who wants to learn a thing or two about history and tiguerismo."}, {"review_sentiment": 5.0, "review_text": "Interesting piece of history that is not talked about."}, {"review_sentiment": 4.0, "review_text": "An interesting read about an interesting man sand time."}]}, "authors": ["Shawn Levy"], "isbn": "0007170602", "longitude": -69.942111, "periods": ["1900s"], "title": "The Last Playboy: The High Life of Porfirio Rubirosa", "word_cloud": "purchase friend say good inspirational perspective alternative style interesting historical sidelight era man contemptible character overview history period interest nice surprise celebrity sex comedy fun good enjoy legend country know approach opportunity give best way write even history island everyone want learn thing history tiguerismo interest piece history talk interesting interesting man sand time", "genres": ["Biography", "History"], "summary": "At one gilded moment in history, his fame was so great that he was known the world over by his nickname alone: Rubi. Pop songs were written about him. Women whom he had never met offered to leave their husbands for him. He had an eye for feminine beauty, particularly when it came with great wealth: Barbara Hutton, Doris Duke, Eva Perón, and Zsa Zsa Gabor. But he was a man's man as well, polo player and race-car driver, chumming around with the likes of Joe Kennedy, Frank Sinatra, Oleg Cassini, Aly Khan, and King Farouk. \r\n\r\nHe was also a jewel thief, and an intimate of one of the world's most bloodthirsty dictators. And when he died at the age of fifty-six—wrapping his sports car around a tree in the Bois de Boulogne—a glamorous era of white dinner jackets at El Morocco and celebrity for its own sake died along with him.\r\n\r\nHe was one of a kind, the last of his breed. And in The Last Playboy, author Shawn Levy brings the giddy, hedonistic, and utterly remarkable story of Porfirio Rubirosa to glorious Technicolor life.", "asin": "B001PO65KO", "rank": "2879959", "city": "Santo Domingo", "image": "https://images-na.ssl-images-amazon.com/images/I/21VuEvOL3pL.jpg", "country": "D.R.", "story_arc": ["Tragedy", "Things only get worse"]}