{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 36.1662859, "ratings": {"num_ratings": 25, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "I am a self confessed Angela/Lindsey Kelk fan. As always Lindsey did not disappoint with the latest instalment of the I Heart Series.So Angela was living the perfect life and then bam she looses her job which then means she will lose her visa  and must return to London. Jenny’s solution to this problem….Girls trip to Vegas!I really went through the wringer with this one. Lindsey you had me on edge. Keeping the deportation issue a secret from Alex was well a dumb thing to Angela, it did however cause some interesting scenes.The return of James Jacob was definitely something I welcomed. He’s a great character and a great friend to Angela.The big question is will Angela get Alex to marry her so she can stay in NYC….This is a must read!"}, {"review_sentiment": 5.0, "review_text": "I absolutely loved re-reading this book. Aside from New York, this is my favourite book in the I Heart Series. I also just love the setting for this book. Not only is Angela in plenty of drama, she is in plenty of drama in Las Vegas. The first time I read this book I hadn't been to Las Vegas, but now I have and I loved visiting it again through Angela and Jenny's eyes. The description of Las Vegas and the description of the kind of things that Angela and Jenny do in Las Vegas is just spot on and so if you haven't been to Vegas but want to then this is definitely the read for you!Of course I loved seeing these characters again and I loved the fact that Angela, Jenny and Alex were all in the same city at the same time. I was really pleased that Jenny was back in the picture in this one, she really is the most fun to read and I think we should all have bracelets with the WWJD but the J stands for Jenny, the best J Lo! James Jacobs is also back in this book and I loved seeing him again, I really wish he was my GBF! Angela has some seriously silly moments in this book, just like in Hollywood and she really frustrated me when it came to her visa storyline but I LOVED the way she and Alex interacted in this book. It felt just like my friends' relationships and so they were very welcome in my little mind story!I have already mentioned the visa storyline. This storyline surround Angela and her need to renew a visa which would allow her to stay in the states. I myself am in the middle of visa issues and this made me a little anxious to read but it was a real proper storyline, something that is really happening to real people and so I was a big fan of this storyline. There are also some really really hilarious moments when it comes to Angela and Jenny on The Strip, of course. I don't want to spoil any of those particular mishaps but they were just as funny, if not more the second time around.This is a great installment in the series, you definitely need to read these books in order but I really do think that, aside from the first in the series, this is my favourite!"}, {"review_sentiment": 2.0, "review_text": "Jenny and angela have really started to bore the sh1t out of me.FYI - there is no way Angela would be on an L1 visa."}, {"review_sentiment": 5.0, "review_text": "I Heart Vegas is the fourth installment in Lindsey Kelk's chick-lit series titled: I Heart. I took a hiatus from this series after the third book...sometimes you have to do that when your connection seems to be stalling out. Apparently that was the right choice for me because I loved I Heart Vegas! All the humor really hit the spot and that's what attracted me to Ms. Kelk's storytelling in the first place. It makes up for the heroine's inability to communicate and ask for help and all the other things that make you want to roll your eyes. I'm a happy reader right now and have once again found my excitement for this fun series ♥My favorite quote:\"If I ever met a woman who claimed to understand what went on inside men's tiny minds, I would punch her in the face for lying.\"The I Heart series includes the following installments as of May 2016:#1-I Heart New York#2-I Heart Hollywood#3-I Heart Paris#4-I Heart Vegas#5-I Heart London#6-I Heart Christmas"}, {"review_sentiment": 5.0, "review_text": "Love the series, love the author."}, {"review_sentiment": 5.0, "review_text": "fantastic once again. but you have to read the I heart series in order to make the most of these books."}, {"review_sentiment": 4.0, "review_text": "Fun, fun, fun.Angela has no job so she can't stay in nyc. She is trying to find a way to avoid deportation. In the middle she has a girls trip to Las Vegas. Great for beach time"}, {"review_sentiment": 4.0, "review_text": "If you think Justin Bieber deserves to be in the same circle of Hell as Adolf Hitler, you do not deserve a five-star-rating from me!If you think Justin Bieber should go to Hell, you don't deserve a 5-star rating from me. Period.Now, when I made myself clear, here's the actual review:It has been years since I read I Heart Paris. I still remember how fun it was and what mostly happened, but I was afraid I forgot a lot of things.It turned out, I didn't have to worry at all. Lindsey Kelk reminded me about everything important that happened in the last three books and I was right on track.I really enjoyed reading about Angela and Jenny. They are the kind of characters that I like. They are likeable with all of their flawes, they make mistakes and they are aware of that and they want to make things right, even though they sometimes don't know how.Emotions were a really important part of the story. Here, I don't think of swoon worthy moments, but of character's emotions. I really, really like how the author showed us how emotions sometimes just take over our mind and actions and sometimes, because of them, we can loose control when it comes to our actions.I have read a quite pile of chick-lit in my life and what I learned from my experience is that you can't be mad if a book is predictable. The actuall thing is, there are more predictable books then unpredictabe ones.This book wasn't predictable as I expected for it to be. It didn't have some big A-HA moment, but the plot wan't going in the direction I tought it would be going, and I'm not going to lie, sometimes I was even afraid of what could happened.This book is full of popular refrences, hot guys and hot girls, casinos, swimming pools and litres of alcohol.But hey, it's Vegas! And that's how Vegas should be, right?"}, {"review_sentiment": 5.0, "review_text": "Love love these books."}, {"review_sentiment": 3.0, "review_text": "After a promising serie's beginning, its rather sad to read about a girl who only drinks and vomits."}]}, "authors": ["Lindsey Kelk"], "isbn": "0007345623", "longitude": -115.149225, "periods": ["2000s", "Recent Releases"], "title": "I Heart Vegas", "word_cloud": "self confessed fan always disappoint latest installment living perfect life ban loose job mean lose visa solution trip really go wringer edge deportation issue secret well dumb thing however cause interest return definitely something welcome great character great friend big question get marry stay absolutely love favorite also love set not plenty drama plenty drama first time love visit eye description description kind thing spot want definitely course love see character love fact city time really please back picture really think bracelet stand best also back love see really wish seriously silly moment really frustrate come visa story line love way interact felt friend relationship welcome little mind story already mention visa story line story line surround need renew visa state middle visa issue make little anxious real proper story line something really happen real people big fan story line also really really hilarious moment come course want spoil particular mishap funny second time great installment series definitely need order really aside first series favorite angela really start bore way fourth installment series title take hiatus series third sometimes connection seem stall apparently right choice love humor really hit spot attract storytelling first place make heroine inability communicate ask help thing make want roll eye happy right find excitement fun series favorite ever meet woman claim understand go men tiny mind face lie series include follow installment series love author fantastic series order make fun job try way avoid deportation middle girl trip beach time think deserve circle think go deserve rating make clear actual review year still fun mostly happen afraid forget lot turn worry remind everything important happen last right really enjoy reading kind character like likable flawed make mistake aware want make thing right even sometimes know really important part story here think swoon worthy moment character emotion really really author show emotion sometimes take mind action sometimes loose control come quite pile life learn experience predictable actual thing predictable unpredictable predictable expect big moment plot wa go direction tough go go lie sometimes even afraid full popular reference hot guy hot girl casino swim pool liters hey right love promise aerie begin rather sad girl drink vomit", "genres": ["Fiction & Literature", "Romance", "Women's Fiction"], "summary": "A sparkling and romantic novel in the bestselling I Heart series.\r\n\r\nAngela Clark loves her life in New York. She a Brit who’s conquered the Big Apple. Unfortunately, she’s also a Brit who’s lost her job. And when, just a couple of weeks before Christmas, the immigration department gets wind of this, Angela needs to find a new job urgently. Or a husband. And she doesn’t think her boyfriend Alex will be keen.\r\n\r\nA girls’ weekend in Vegas with her best friend Jenny seems the perfect way to forget her troubles. From the minute they arrive Angela is swept up in a whirl of cocktails, outrageous outfits, late nights and brushes with the chapel of love. But rather than escaping trouble, Angela is up to her neck in it….\r\n\r\nBut what happens in Vegas stays in Vegas – right?\r\n\r\nFourth in the bestselling series.", "asin": "0007345623", "rank": "1125298", "city": "Las Vegas", "image": "https://images-na.ssl-images-amazon.com/images/I/51hBtdvQs2L.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}