{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 19, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "As soon as I finished I Heart Hollywood I just had to pick up I heart Paris.Alex proposes a very romantic trip to Paris where it also happens that his band are playing. But unknown to Angela Alex’s ex is there…the one who turned him into a slutbag.Bob Spencer also proposes that Angela write a piece for Belle, a prestigious fashion magazine, on Paris and the best places to shop, drink and generally spend your vacation.After a very long plane journey Angela arrives in Paris only to discover that her suitcase was blown up at JFK, with all the lovely clothes that Jenny gave her as well as her beloved Louboutin’s.After this things only get worse. She spends the week trying to write an article as well as stopping Solene (the ex) trying to jump into Alex’s pants.Angela has such a rough time in this book. Being screwed over by Cici causing her career to be on the line, believing that her relationship was in tatters because of Solene all caused Angela to really question why she was still living in New York and should she just go home?This book has a very dramatic and exciting resolution."}, {"review_sentiment": 5.0, "review_text": "Ok confession time: if I had to pick one, I mean really had to, I think that this would be the least favourite of the I Heart series for me, but I still loved re-reading it and I would never have left it out and I still love Angela. But i don't heart Paris and I think that might be why I didn't love love love it. Plus there are so many nasty things that happen to lovely Angela and lovely Alex in this book, it was a little on the stressful side! Nevertheless I would still highly highly recommend reading this one because otherwise you will miss out on all the Angela drama and miss out on spending time with the beautiful Alex.So I think that this books is where Angela really learns to stand on her own two feet. She doesn't have Jenny with her all of the time, because of Jenny's new Job and Angela being in Paris for work, there aren't even a ton of interactions between them in the middle part of this book. I would have loved to have seen Jenny more obviously because Jenny is amazing, but she needed to take a little step back to allow Angela to see that she could deal with every crisis that comes her way on her own. I loved the way Angela handled a lot of the things that happen in this book, not all of them and I did shout at her a couple of times about not being able to see what was right in front of her face, but then we can't always see things when we are in certain situations can we?From the way I am talking about these characters you can tell just how well written they are. These people feel like real friends of mine, like if Angela was to tweet something, I would definitely re tweet it for her. Alex is fairly independent in this book too and I didn't always like the way he handled things either, I love you Alex, but I didn't always like you! It is great for Alex and Angela to have some time on their own away from New York dramas to work on their relationship but the storyline meant that there was drama for them every step of the way and that is one of the things that I really liked about this book, the drama. There is so much drama in this book, drama over so many different areas as well and so it definitely meant for a fast read. Having re-read it I had forgotten some of the finer details as well and the way Lindsey Kelk has crafted this story is pretty impressive and must have been hard to map out-bravo!Obviously I wasn't thrilled about the setting of this one and did keep asking if Angela was going to get a plane back to New York, but it is very well-described. I could definitely picture myself on the Parisan streets with Angela and the shopping she does is pretty immense. There is also a lot of wine drinking in this book, it being Paris and all and I really loved that about it. Unfortunately I listened to this book in audio form, which was incredibly well done, but meant I couldn't be drinking wine because most of the time I was in the car!Needless to say, despite the setting, this is a great addition to the I Heart Series. The drama, the relationships and the fashion was absolutely on point and whether this is a re-read for you, or a first time, what are you waiting for? Get stuck in!"}, {"review_sentiment": 4.0, "review_text": "Lighthearted chick lit set in Paris. I really enjoyed this book. It was funny and an easy read."}, {"review_sentiment": 5.0, "review_text": "Quick shipment! Package arrived as described."}, {"review_sentiment": 5.0, "review_text": "Love this authors line of books...currently waiting for \" I Love Vegas\" to arrive...my new favorites!"}, {"review_sentiment": 4.0, "review_text": "Very good, worth reading"}, {"review_sentiment": 5.0, "review_text": "I am really loving this entire series of books 😍😍😍I can't believe the amazing life this chick has......I also cannot believe how much trouble and how naive she is also.......but it would not be the same, laugh out loud book the characters were any different.I must say that this book was especially wonderful as it allowede to reminisce and relive my trip to Paris a couple years ago.....where Angela went, I had been also. Brilliant book, loved every minute of it.I am off to Las Vegas with Angela and the gang now 😍 so Bon Voyage Paris, until we meet again 😉"}, {"review_sentiment": 2.0, "review_text": "I bought this in the Charles De Gaulle airport in Paris of all places. This was the first and only I Heart book that I will be reading. I had so many problems with this book. Most importantly,  I had a hard time believing that the main character was a grown woman. She had the emotional intelligence and self esteem of the average twelve year old. I found Angela Clark to be really annoying and kind of sad. Perhaps suffering from an undiagnosed mental illness. Considering the physical fights, her insecurity, irresponsibility, and immaturity, this made for a frustrating read. The plot seemed really drawn out. Her relationship did not seem realistic at all.  How can you move in with a guy when you can't even talk to him about important matters in your relationship? I didn't find there to be a lot of Paris in this book either. I've been to Paris and I've read books that capture the city and this book does not. I'm so glad I didn't run into the \"hipster\" bars in the guide in the back of the book. What is with all the hipster worship? There was a lot of filler in the book too. For example, having to go pee is referenced three times. What? I did like the character Virginie though. She was probably the most three dimensional and interesting character in the book. Readable but not necessarily enjoyable if you are stuck on an airplane for 8 hours."}, {"review_sentiment": 4.0, "review_text": "2013:I Heart Paris is the third book in Lindsey Kelk's I Heart series. The series includes:#1-I Heart New York#2-I Heart Hollywood#3-I Heart Paris#4-I Heart Vegas#5-I Heart London#6-I Heart ChristmasI read books one and two in 2012 and loved them! I lost interest in the third book, I Heart Paris. Thinking it was just poor timing, I picked it back up a year later and finished it. Out of the three that I have read, I Heart Paris is my least favorite but it's not bad. I gave it 3.5 stars, rounding up to 4.The heroine in the I Heart series is Angela Clark, a British broken-hearted girl who runs away from her drama in London to America. Her adventures are so funny, classic chick-lit humor but unfortunately, I Heart Paris didn't offer much of that humor until the end. I think that's why I lost interest. I'm glad I finished it though because the ending was good, with a few laugh out loud moments. I already own the fourth book (prematurely buying the series after loving the first two) so I will likely continue the series.My favorite quote:It was only just after ten but people were already lining up for the show. For a moment, I forgot how pissed off I was with Alex and just felt incredibly proud. I couldn't imagine how it must feel to see people queuing to see you do something you loved. No one was ever likely to stand in line to watch me inhale a tub of Phish Food and settle in for a three-hour America's Next Top Model marathon. I made a mental note actually to get around to doing something relevant with my life. Or at least have a think about it.\"(less)2012:I adored the first two books in the I Heart series but I lost interest in this one quick. Her trust issues are getting old and in my opinion there wasn't enough other plot to make up for it. I was so excited about this series but I don't think I'll continue."}, {"review_sentiment": 4.0, "review_text": "I couldn't resist buying this book when I saw it in my local supermarket for the bargain price of £1! I had already read I Heart Vegas by the same author and I didn't realise that this was a series so I'm afraid I haven't read them in order.  The big question is would it affect my enjoyment?I guess it affected my reading pleasure a bit because I didn't really feel connected to the characters as I probably would have done if I had read the first books beforehand.  However, it didn't affect the storyline itself because everything was explained clearly.  I think I would recommend reading the series in order though and I really want to read those books now even though my to read list is already far too long!The beginning was all about Angela before she went to Paris with her boyfriend Alex, it took a while to fully capture my interest but once it did I couldn't stop turning the pages - it definitely got better as the story progressed.  My feelings towards Alex changed regularly throughout the book, alternating between very negative thoughts and `aww isn't he sweet' thoughts.  Angela was such a funny character, she was awkward, clumsy and very unlucky but this meant she was also very entertaining!  I particularly enjoyed her honest blog posts and her struggles to get where she needed to go.There were so many laugh out loud moments throughout the book, some of my favourites were:  an amusing flight to Paris which also included `suitcase gate', a dangerous nighttime trip to the loo, talkative teenagers on a train, a pickled onion problem and a hugely entertaining fight scene near the end.The writing was clear and gave me a real sense of actually being in Paris, I definitely shared Angela's enthusiasm for the city even as she wandered from one disaster to the next (I think the beauty of Paris did ease some of her frustrations though).This was an enjoyable read full of all things girly - bags, shoes, boys and travel, what more could a girl want?"}]}, "authors": ["Lindsey Kelk"], "isbn": "0007288417", "longitude": 2.3514992, "periods": ["2000s", "Recent Releases"], "title": "I Heart Paris", "word_cloud": "soon finish pick propose romantic trip also happen band play unknown turn also propose write piece prestigious fashion magazine best place shop drink generally spend long plane journey arrive discover suitcase blow lovely clothe give well beloved thing get worse spend week try write article well stop try jump rough time screw cause career line believe relationship tatter cause really question still live go home dramatic exciting resolution confession time pick mean really think favorite series still love never still love think many nasty thing happen lovely lovely little stressful side still highly highly read otherwise miss drama miss spending time beautiful think really learn stand foot time new even ton interaction middle part love see obviously amaze need little step back allow see crisis come way love way handle lot thing happen shout couple time able right front face always thing certain situation way talk character tell well write people feel real friend mine something definitely fairly independent always like way handle thing love always great time away drama work relationship story line meant drama step way thing really like drama much drama drama many different area well definitely mean fast forget finer detail well way craft story pretty impressive map obviously thrill set keep ask go plane back definitely street shop pretty immense also lot wine drinking really love unfortunately listen audio form incredibly well do meant wine time car say set great addition drama relationship fashion absolutely point first time wait stuck lighthearted chick lit set really enjoy funny easy quick shipment arrive described author line currently wait arrive new favorite very good worth read really love entire series amazing life chick also believe much trouble naive also loud character especially wonderful allowed reminisce relive trip couple year ago go also brilliant love minute gang meet buy airport place first read many problem most importantly hard time believe main character grow woman emotional intelligence self esteem average twelve year old find really annoy kind sad perhaps suffer diagnosed mental illness physical fight insecurity irresponsibility immaturity make frustrate plot seem really draw relationship seem realistic move guy even important matter relationship find lot capture city glad run hipster bar guide back hipster worship lot filler example go pee reference time like character probably dimensional interest character necessarily enjoyable stuck airplane hour third series series include love lose interest third poor timing pick back year later finish least favorite bad give star round heroine series girl run away drama adventure funny classic humor unfortunately offer much humor end think lose interest glad finish end good laugh loud moment already fourth prematurely buy series love first likely continue favorite quote ten people already line show moment forget piss felt incredibly proud see people queue see something love one ever likely stand line watch inhale tub marathon make mental note actually something relevant life least think le adore first series lose interest quick trust issue get old opinion enough plot make excited series think continue buy saw local supermarket bargain price already author realist series afraid order big question enjoyment guess affected reading pleasure bit really connected character probably do first beforehand however affect story line everything explain clearly think read series order really even list already far long beginning go boyfriend take fully capture interest turn page definitely get better story progress feeling towards change regularly alternate negative thought sweet thought funny character awkward clumsy unlucky meant also entertain particularly enjoy honest blog post struggle need many laugh loud moment favorite amuse flight also include gate dangerous nighttime trip loo talkative teenager train pickled onion problem hugely entertaining fight scene write clear give real sense actually definitely share enthusiasm city even wander disaster think beauty ease frustration enjoyable full thing girly bag shoe boy travel", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "Angela is in the city of love – but romance is taking a nose-dive…\r\n\r\nWhen Angela Clark’s boyfriend Alex suggests a trip to Paris at the same time as hip fashion mag Belle asks her to write a piece, she jumps at the chance.\r\n\r\nBut even as she’s falling for the joie de vivre of Paris, someone’s conspiring to sabotage her big break. And when she spots Alex having a tête-à-tête with his ex in a local bar, Angela’s dreams of Parisian passion all start crashing down around her.\r\n\r\nWith London and her old life only a train journey away, Angela can’t decide if should stay and face the music or run away home…", "asin": "0007288417", "rank": "1154756", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51MupVKr2JL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}