{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 25.2683521, "ratings": {"num_ratings": 111, "rating": 3.2, "reviews": [{"review_sentiment": 5.0, "review_text": "A fantastically good satire on the contemporary world. Brilliantly written and funny as hell. No aspect of self delusion is left unexplored."}, {"review_sentiment": 4.0, "review_text": "O'Neill is a brilliant writer. This book is brilliant in style and story, but suffers from narcissism, self-indulgent pontificating, self-destruction, and excessive navel gazing."}, {"review_sentiment": 5.0, "review_text": "O’Neill presents a light satire of the contemporary social scene brilliantly, but the fun covers layers of more serious subtext. If the reader is not tuned in to the underlying social criticism, the ending comes as a shock. It is an uncomfortable ending as it is clearly intended to be.  We get to kind of like this narrator.  His explanations for what he does seem to make sense.  His excuses for inaction are plausible.  He seems like everyman just trying to get along in the world.  But there is no system of values beyond his immediate comfort. O’Neill underscores this void just before the conclusion by having the narrator recall little quotations from John Kennedy and George Washington and Anna Julia Cooper from his mother’s kitchen, which he denigrates as sixth grade wisdom.  X is too cynical to take comfort or meaning from this past.  The blank, white wall he ends up facing is like a dissolution of his personhood, a horrific image.In the beginning, however, we seem to be embarking on a fun sendup of silly expats in Dubai. Before he gets to Dubai, there is a great parody of the online community analyzing and eventually belittling an act of spontaneous bravery by a citizen.  We can all experience the shock of recognition in that presentation.  This is what the public discourse has become.  You do start to pick up on X’s unusual lack of real human relationships though.  His sexual relations go a fraudulent pretense of intimacy, to soft porn, to hard porn, to a massage chair.  In the end his lover is a massage chair.  The chair, Pasha, becomes a chilling metaphor for the complete depersonalization of relationships.X’s sin is not corruption but complacency.  His dishonesty consists in his failure to call out the cruelty that surrounds him.  The deferral of all responsibility in the gibberish of user agreements seems so clever to X.  But power relationships will always rule when the rule of law does not apply.  The situation (also the name of his living quarters); the situation in Dubai is unacceptable.  It violates in every respect the wise and honest standard humanity aspires to. The imagined emails that X does not send are exactly what he ought to have been sending if he were an honorable person.  And, of course, at the heart of his inaction is Jenn, the woman whose future he stole because it was convenient.  This novel has so many great sentences in it, but the one about Jenn is so right:“There was always a chance she’d change her mind, and there was nothing to stop me from telling her that come what may I would not have a child with her because our quasi-marriage was a living death for me—surely a pretty significant piece of information that is absolutely one’s obligation to communicate to one’s partner in a timely fashion.  Jenn, I’m so sorry.))”We don’t really understand this about X until well into the novel. It comes as something of a shock.  And then the rest of it starts to fit the pattern.  Jenn’s retribution speaks of her loss.  Her continuing, energy eating, enmity.  She did not move on.  The novel is ultimately an apt portrayal of the thing we have most to fear.  If we don’t insist on those sixth-grade values, and fight to the death to defend them, Dubai is the future."}, {"review_sentiment": 5.0, "review_text": "Wonderfully written satire. Some sentences remind me of Keith Waterhouse but ONeill is deeper, darker, humourous at times and mostly not."}, {"review_sentiment": 1.0, "review_text": "Absolute garbage. From the 1st run-on sentence I found this to one of the worst novels I've attempted to read. I read about 50 novels a year and do enjoy good literature, not just the \"flash- bang\" stuff. In fact, I gave up at page 70. Basically a stream of consciousness with run on sentences, disjointed subplots, made-up words, weak/shallow characters, and poor construction all the way around. I  believe this is an attempt to glorify \"modern literature\" which is basically crap. My wife is getting a masters in English and the \"modern\" guys would love this book while anything written before 1960 is disregarded as \"dead white guys\" and irrelevant. If you are looking for good prose, clarity, interesting people and plots this book is not for you."}, {"review_sentiment": 3.0, "review_text": "While there were some situations that were masterfully satirized the novel as a whole did not add up to much."}, {"review_sentiment": 4.0, "review_text": "A tasty little satire."}, {"review_sentiment": 5.0, "review_text": "Really a remarkable book.  Its main character is a expatriate American lawyer who has fled his life in New York to work as a highly-paid factotum for a wealthy Lebanese family in Dubai, where he scuba dives, drinks, engages prostitutes, has pedicures, all at great expense, and becomes even more alienated from other people than he was to begin with.  The \"story,\" per se, doesn't exist: the novel is made up mainly of the nameless first person narrator's observations (about inequality, about relationships, about internet culture, about contemporary life as an oasis of pleasure seeking amid a hostile, arid environment), his self-justifications, and his quasi-legalistic, quasi-philosophical formulations, composed of gorgeously long sentences punctuated by parenthetical (and intraparenthetical) asides, that serve to illuminate both, all bound together by a loose set of stories concerning his past relationship and his escape from it, the outrageous privilege of the family for whom he works, and the disappearance of one Ted Wilson, a fellow diver and expat who manages literally to lose himself in Dubai.I may be one of those perverse people who admires unsung followups more than the books that have made their authors' reputations, but I thought this was a considerably superior book to NETHERLAND."}, {"review_sentiment": 5.0, "review_text": "Excellent book - the author wrote a character that was totally authentic to me."}, {"review_sentiment": 3.0, "review_text": "Joseph O'Neil's \"The Dog\" is a well-written novel with some very interesting interior monologue from our unnamed narrator.The setting - mostly in Dubai with brief flashes of New York and London - is one that perhaps readers in the United States are not overly familiar with.  Professor O'Neil paints a none too flattering picture of post-financial crisis Dubai and especially of its expatriate western residents.  His description of the treatment of  non-citizens (some 85% of the population) some of whom have lived in Dubai for generations is particularly disturbing.I hope that I never find myself feeling so despondent that I need to make the alarming personal choices of Professor O'Neil's attorney / narrator and flee friendly New York for a relentlessly depressing job in the Gulf.In spite of the great writing, I am compelled to award only three stars here; to be very blunt the book was simply too much of a bummer for me.  I am not certain I could identify one character who was not either overly self-loathing or loathsome at some level."}]}, "authors": ["Joseph ONeill"], "isbn": "0007583095", "longitude": 55.2961962, "periods": ["2000s", "Recent Releases"], "title": "The Dog", "word_cloud": "fantastically good satire contemporary world write funny hell aspect self delusion leave unexplored brilliant writer brilliant style story suffers narcissism pontificate excessive navel gazing present light satire contemporary social scene brilliantly fun cover layer serious subtext tune underlie social criticism end come shock uncomfortable end clearly intend get kind narrator explanation seem make sense excuse inaction plausible seem every man try along world system value immediate comfort underscore void conclusion narrator recall little quotation mother kitchen denigrate sixth grade wisdom cynical take comfort mean blank white wall end face dissolution person hood horrific begin however seem embark fun send up silly expats get great parody online community analyze eventually belittle act spontaneous bravery citizen experience shock recognition presentation public discourse become start unusual lack real human relationship sexual relation go fraudulent pretense intimacy soft porn hard porn massage chair end lover massage chair chair become chill metaphor complete depersonalization sin corruption complacency dishonesty consist failure call cruelty surround deferral responsibility gibberish user agreement seem clever x power relationship always rule rule law situation also name live quarter situation unacceptable violate respect wise honest standard humanity aspire imagined email x exactly send honorable person course heart inaction woman future stole convenient many great sentence right always chance change nothing stop tell come live death pretty significant piece information absolutely obligation partner timely fashion sorry really understand well come something shock rest start fit pattern retribution speak loss continue energy eat enmity move ultimately apt portrayal thing fear insist value fight death defend future wonderfully write satire sentence remind deeper darker humorous time mostly absolute garbage sentence find worst novel attempt novels year enjoy good literature bang stuff fact give page stream consciousness run sentence disjoint subplots word character poor construction way believe attempt glorify modern literature basically wife get master modern guy anything write disregard dead white guy irrelevant look good prose clarity interest people plot situation masterfully satirized whole add much tasty little satire really remarkable main character expatriate american lawyer flee life work factotum wealthy family scuba dive drink engage prostitute pedicure great expense become even alienated people begin story exist make mainly nameless first person narrator observation inequality relationship internet culture contemporary life oasis pleasure seek hostile arid environment formulation compose gorgeously long sentence punctuate parenthetical intraparenthetical aside serve together loose set story concern relationship escape outrageous privilege family work disappearance diver expat manages literally lose perverse people admire unsung followup make author reputation think considerably superior excellent author write character totally authentic interesting interior monologue unnamed set mostly brief flash perhaps reader overly familiar paint none flatter picture crisis especially expatriate western resident description treatment population live generation particularly hope never find feeling despondent need make alarm personal choice attorney narrator flee friendly relentlessly depress job spite great write compel award star blunt simply much bummer certain character overly loathsome level", "genres": ["Fiction & Literature", "Mystery & Suspense", "Satire"], "summary": "A NEW YORK TIMES NOTABLE BOOK\r\n\r\nThe author of the best-selling and award-winning Netherland now gives us his eagerly awaited, stunningly different new novel: a tale of alienation and heartbreak in Dubai.\r\n \r\nDistraught by a breakup with his long-term girlfriend, our unnamed hero leaves New York to take an unusual job in a strange desert metropolis. In Dubai at the height of its self-invention as a futuristic Shangri-la, he struggles with his new position as the “family officer” of the capricious and very rich Batros family. And he struggles, even more helplessly, with the “doghouse,” a seemingly inescapable condition of culpability in which he feels himself constantly trapped—even if he’s just going to the bathroom, or reading e-mail, or scuba diving. A comic and philosophically profound exploration of what has become of humankind’s moral progress, The Dog is told with Joseph O’Neill’s hallmark eloquence, empathy, and storytelling mastery. It is a brilliantly original, achingly funny fable for our globalized times.\r\n\r\n“With consummate elegance, The Dog turns in on itself in imitation of the dreadful circling and futility of consciousness itself. Its subplots go nowhere, as in life. But, unlike life, its wit and brio keep us temporarily more alive than we usually allow ourselves to be.” The New York Times ", "asin": "0007583095", "rank": 0, "city": "Dubai", "image": "https://images-na.ssl-images-amazon.com/images/I/41oyH31WMTL.jpg", "country": "United Arab Emirates", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}