{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 28, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Following I Heart New York, I just had to read the next in the series. This book is full of love and laughter. .Every girl can identify with Angela Clark. Who wouldn't want an all expenses paid trip to Hollywood to spend a week with a HOT movie star, and your best friend.I love James Jacobs. Him and Angela had the funniest conversations and he definitely showed her the best of what Hollywood has to offer.It was also really great to see Alex getting so jealous.I really loved the development of Jenny's character in this book. Watching her trying to get over Jeff was hard but essential.Just like the readers of her blog in the book I enjoyed living vicariously through Angela. I can't wait to start I Heart Paris."}, {"review_sentiment": 5.0, "review_text": "Ok so this was a re-read for me but I didn't post a review of it when I first read it because, unlike Angela, I didn't have a blog back then. I can still remember what it felt to read it the first time though and so I can mix this together with my feelings this time and come up with this great review for one of my all time favourite series reads!Firstly it was amazing to catch up with Angela after the triumph that was I heart New York, but not just Angela, all the other characters too! I love love loved getting to hear more about Jenny and Alex and new character James Jacobs. These characters all feel so real and because I've already travelled through this series with them it was great to see them again. Angela gets herself into so many awkward and stupid situations in this book and yet I still love her and still want everything to be ok for her! And Jenny, as always helps her out of these situations in ways that only Jenny can. I also loved catching up with Alex in this book, he starts to become his own person, doing his own thing and isn't JUST Angela's love interest, which was great!Obviously the setting of this book is great. It was fab watching someone from the UK who has fallen in love with New York navigate LA because they are SUCH different places and so it was good to see this from an outsider's point of view. Too often you read books set in LA or Hollywood itself and they are from people who have grown up there or who have moved there from smaller towns and not from someone who has come from another major city, one where you can walk everywhere, to this city filled with traffic. I loved that fact that Chateau Marmont features in this book as well because it is such an intriguing place, somewhere I have seen but never been in.As a re-read this book was great, there were so many small details I had forgotten because when I read this book it was 2010 and it had just come out so it was wonderful to pick up on those little nuances again, especially knowing what I know now about this group of characters. If you haven't read this series yet, I heartily recommend you do. And if you are a fan of this series and toying with the idea of re-reading them, I heartily recommend doing what I did and downloading the audio version because it will give you a whole new perspective and the narrator is great at switching between the accents."}, {"review_sentiment": 1.0, "review_text": "I have read \"I love New York\" etc. and it is utter bulls***! No depth, no nothing, She can absolutely write and engage this woman and gosh, are you wasting your talent! I recommend these books to teenagers. You can not read this without feeling sick! It is the most superficial books I have ever read. The best written s***ty books :)"}, {"review_sentiment": 5.0, "review_text": "Love love her books."}, {"review_sentiment": 5.0, "review_text": "Love, Love, Love this series of books. Love the authors writing style. Currently waiting for \" I Love Vegas\"."}, {"review_sentiment": 3.0, "review_text": "For an extended review of this book and more, please visit http://fortheloveoftheread.blogspot.comThis is the second in the \"I Heart\" series by this author. This book is a UK import as she is published in the UK and not in the US.Even though this is a second installment, it is not necessary for the first to be read before this one is. It may enhance the reading experience, but the author does enough of a recap in this second book to cover all necessary bases.My largest disappointment with this book was actually the character of Jenny Lopez, which is surprising because she seems to be a fan favorite and was a great character in the first novel. She is Angela's best friend, but I thought she was the worst character in the book. She was extremely temperamental with everyone, especially Angela, and she came across as being quite selfish. Angela and Jenny have many confrontations throughout the book, and each time I found myself getting more and more frustrated with Jenny. I also can't understand why Angela puts up with Jenny. I found the entire friendship frustrating and I don't understand why they are friends.That being said, the other characters in the book are great. Angela is a bit of an airhead and makes some bad choices, but she is lovable anyway. She is funny and humble and endearing, despite the fact that there were many times when I just wanted to shake her. Her boyfriend, Alex, is less developed in this novel, which is one reason why reading the first would enhance this one. I could see why she cares for him, but I don't think his charm came through as well in this one. The Hollywood star of the novel, James Jacobs, spends most of the book seeming just that little bit too good to be true. In the end, he is shown to be human like the rest of us, which I really appreciated.I enjoyed reading about the different hot spots in LA and the experiences Angela had. There was a bit too much partying and drinking for my taste, but that's only a personal preference. Overall I thought the book was pretty cute. I just hope that, throughout the series, Jenny's character will get some redeeming qualities."}, {"review_sentiment": 5.0, "review_text": "This is the second book in the I Heart series by Lindsey Kelk; I really liked the first book and couldn't wait to pick up the second one, which I loved even more than the first!  I think this is such a cute series!  The characters are super cute and very likable.  The plot is a little predictable, but very similar to Sex and The City, which I did enjoy.  I would definitely recommend this book for a light summer read, perfect for the beach!For a more in-depth review, check out my book blog, A Nook of Blankets and Books!http://anookofblanketsandbooks.blogspot.com/2014/09/i-heart-hollywood-book-review.html"}, {"review_sentiment": 5.0, "review_text": "Again, praise for this book series. I am loving it and can't stop reading them 😊Ang and her adventures are brilliant, and this one in particular had me yelling at her, laughing out loud and plainly giggling like a school girl (while people looked at me strangely on the train journey to and from work).Doesn't seem to matter where Ang and Jenny end up, there are always great adventures to be had, new friends to be made and AMAZING shoes, clothes & handbags for all!"}, {"review_sentiment": 4.0, "review_text": "Like the other books in the series this is entertaining, had good character development and keeps you addicted. I love that the characters continue to develop but the story line changes with each location change. I'll continue reading the series!"}, {"review_sentiment": 5.0, "review_text": "My friend from the UK recommended this series, and after reading I Heart New York, I decided to try I Heart Hollywood.  I had to wait for the book to come from the UK since there isn't a Kindle edition.  I read this one in two days, and in my opinion, it was better than I Heart New York, which says a lot!  The main character, Angela, is really lovable, and I feel like the author does a great job of making her believable and bringing her to life.  I enjoyed this so much that I bought the rest of the series, and I know I'll feel a little disappointed when I get to the last one.  If you enjoy good chick lit, you'll love Lindsey Kelk."}]}, "authors": ["Lindsey Kelk"], "isbn": "0007288409", "longitude": -118.244476, "periods": ["2000s", "Recent Releases"], "title": "I Heart Hollywood", "word_cloud": "follow next series full love laughter girl expense pay trip week movie star best love funniest conversation definitely show best also really great see get really love development character watch try hard reader blog enjoy live vicariously start post review first blog back still felt first time mix together feeling time come great time favorite series read firstly amazing catch triumph character love love love get hear new character character feel real already travel series great see get many awkward stupid situation yet still love still want everything ok always help situation way also love catch start become person thing love interest great obviously set great fab watch someone fall love navigate different place good see outsider point view often set people grow move smaller town someone come major city walk everywhere city fill traffic love fact feature well intriguing place somewhere see never great many small detail forget come wonderful pick little nuance especially know know group character series yet heartily series toy idea heartily download audio version whole new perspective narrator great switching accent love etc utter depth nothing absolutely write engage woman gosh waste talent recommend teenager feel sick superficial ever best write love series author write style wait extend review please visit http second series author import publish second installment necessary first read experience author enough recap second cover necessary largest disappointment actually character surprising seem fan favorite great character first best friend think worst character extremely temperamental everyone especially come quite selfish many confrontation time find get frustrated also put find entire friendship frustrating understand say character great bit airhead make bad choice lovable anyway funny humble endear fact many time want boyfriend develop reason reading first care think charm come well star spend seem little bit good true end show human rest really enjoy read different hot spot experience bit much party drinking taste personal preference think pretty cute hope series character get redeeming quality second series really like first pick second love even first think cute series character super cute likable plot little predictable similar sex enjoy definitely light summer perfect beach review check blog praise series love reading adventure brilliant particular yell laugh loud plainly giggle school girl people look strangely train journey work seem matter end always great adventure new friend make shoe clothes handbag series entertain good character development keep addict love character continue story line change location change continue read series friend recommend series reading decide try wait come edition day opinion better say lot main character really lovable feel author great job make believable bring life enjoy much buy rest series know feel little disappointed get last enjoy good chick lit love", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "I Heart series book 2. Celebs, sunshine and beautiful boys…enough to lead a girl astray?\r\n\r\nAngela Clark can’t believe her luck… she’s an English girl living in New York with a dream job at hip magazine The Look and a sexy boyfriend.\r\n\r\nHer latest assignment takes her to Hollywood to interview hot actor and fellow Brit James Jacobs. Thrown in at the deep end she heads west with best friend Jenny dreaming of Rodeo Drive and Malibu beach.\r\n\r\nSoon Angela discovers that celebrity life in Hollywood is not all glamour, gloss and sunshine. Despite his lady-killer reputation, the only person who seems genuine is James.\r\n\r\nThen a paparazzi snaps them in an uncompromising position and suddenly Angela is thrust into the spotlight for all the wrong reasons…\r\n\r\nCan she convince all those close to her – especially her boss and her boyfriend – not to believe everything they read? And will Hollywood ever win Angela’s heart?", "asin": "B0015AOJG0", "rank": "16068680", "city": "Los Angeles", "image": "", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}