{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 28, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "great, thank you!"}, {"review_sentiment": 4.0, "review_text": "Delightful and classic Wharton. Wonderful look into old NY, just as the title says. I loved it."}, {"review_sentiment": 4.0, "review_text": "Old New York is my first experience reading Edith Wharton but it won’t be my last. These four short novellas are set in New York society, each giving the reader a glimpse of the conventions and conduct of “polite society” during the last half of the 19th century (not always polite and frequently unkind). Even in these relatively short works, Whaton’s characters are people we come to know and understand and the writing is nuanced. Each story comes to a very satisfying conclusion. I’m putting Wharton’s House of Mirth and Ethan Frome on my “must read” list."}, {"review_sentiment": 5.0, "review_text": "If you are familiar with Wharton, this is typical of her work. I am not a big fan of the short story, but these novellas hit just the right length."}, {"review_sentiment": 5.0, "review_text": "I especially liked the cameo appearance of John Ruskin as a young fellow developing his taste in art, whose writings and powerfully expressed radical opinions (at the time) which were to become the Bible and Gospel of Great Art rolled into one, later on in the 19th century - as he influenced the taste and already romantically deviating outlook on the field of art, developing in the mind of our protagonist, young Lewis Raycie.  It struck me that here Wharton was inserting real historical characters into her fiction long before Doctorow was doing it.  Anyway, a masterful tale of the ongoing ignorance of one generation as it tries to fathom the next generation's taste in art; initially rejecting it with howls of rage and derision, and then as both it's aesthetic (and of course, economic) value begins to take hold - that generation is forced to change it's mind, etc,. etc.  Well, Caveat Emptor - but then, Tempus Fugit, and the cycle starts anew.  The small tragedies that accompany this cycle are the backbone of this novella, and will always be worth remembering."}, {"review_sentiment": 5.0, "review_text": "Edith Wharton never leaves her theme of independent women and the costs they pay in life, love and society for being honest. But each story carries a different shading, New complexities of plot and characters...so that we learn, again, the price of integrity in living."}, {"review_sentiment": 4.0, "review_text": "I loved reading this book written in the 1800s about the way New York and its society was at that time"}, {"review_sentiment": 5.0, "review_text": "I ordered this by accident (I already have a copy). This book is a wondeful book about social class and the barriers that woman faced in the era in which it was writte. Fast forward, I often see similar barriers today.I love the complexity of these short stories. Even if you are familiar with the author's writings, you will be glad you read this small book."}, {"review_sentiment": 5.0, "review_text": "Edith Wharton's stories are always excellent, well considered, illuminating human nature."}, {"review_sentiment": 4.0, "review_text": "A book for fans of Edith Wharton.  It includes the story \"Old Maid\" which is the basis for both a play and a movie with Betty Davis.  Although melodramatic in some way it surprises in others."}]}, "authors": ["Edith Wharton"], "isbn": "0020383142", "longitude": 0.0, "periods": ["1800s"], "title": "Old New York", "word_cloud": "great thank delightful classic look title say love first experience reading last short novella set society give glimpse convention conduct polite society last half century always polite frequently unkind even relatively short work character people come know understand write nuanced story come satisfy conclusion put familiar typical work big fan short story novella hit right length especially like cameo appearance young fellow develop taste art writing powerfully express radical opinion time become bible roll later century influence taste already romantically deviate outlook field art develop mind protagonist young strike insert real historical character fiction long masterful tale ongoing ignorance generation try fathom next generation taste art initially reject howl rage derision aesthetic course economic value begin take hold generation force change mind etc cycle start small tragedy accompany cycle backbone novella always remember never leave theme independent woman cost pay life love society honest story carry different shade complexity plot character learn price integrity living love read write way society time order accident already copy wonderful social class barrier woman face era write forward often see similar barrier love complexity short story even familiar author writing glad small story always excellent well consider illuminate human nature fan include story basis play movie melodramatic way surprise others", "genres": ["Fiction & Literature"], "summary": "The four short novels in this collection by the author of The Age of Innocence are set in the New York of the 1840s, '50s, '60s, and '70s, each one revealing the tribal codes and customs that ruled society, portrayed with the keen style that is uniquely Edith Wharton's. \r\n\r\nOriginally published in 1924 and long out of print, these tales are vintage Wharton, dealing boldly with such themes as infidelity, illegitimacy, jealousy, the class system, and the condition of women in society. Included in this remarkable quartet are False Dawn, which concerns the stormy relationship between a domineering father and his son; The Old Maid, the best known of the four, in which a young woman's secret illegitimate child is adopted by her best friend -- with devastating results; The Spark, about a young man's moral rehabilitation, which is \"sparked\" by a chance encounter with Walt Whitman; and New Year's Day, an O. Henryesque tale of a married woman suspected of adultery. Old New York is Wharton at her finest.", "asin": "0020383142", "rank": "266745", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/510M08NAlrL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}