{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 20, "rating": 4.2, "reviews": [{"review_sentiment": 1.0, "review_text": "It is ok. Nice attempt to sounds original."}, {"review_sentiment": 5.0, "review_text": "This book was in pretty good conditions and it was a really good read too!!"}, {"review_sentiment": 5.0, "review_text": "I received a copy of One City, One Story ('Karma', one of the stories in the Karma book collection) as part of the Cape Cod Writers Center annual conference and was privileged to hear her read this story out loud.  I can only rate 'Karma' (the entire book) based on this one story (Karma, the story), so please take my review with a grain of salt, but as somebody who has both lived and worked in Boston, and also spent 8 years of my life married to an immigrant (a marriage which failed), I must say Ms. Reddi's poignant story about a displaced man who finds meaning and integration through unexpected avenues and opportunities to be especially poignant.  While my prior experience was not an India experience, but another immigrant population, I thought Ms. Reddi hit the problem (and solution) head-on.  Thank you for the little 'One City, One Story' booklet and live reading.  I enjoyed it.  I enjoyed re-reading the story seven months later, which is why I am only now leaving a review."}, {"review_sentiment": 5.0, "review_text": "Rishi Reddi is such a meticulous master of dialogue and inspired painter of scene throughout this collection. These stories convey Indian and Indian American culture with a touch that is both illuminating for outsiders and honoring to those they portray. What is it to have a culture, to be of a place? Where does one's culture live? Is it transportable? Translatable? Sustainable across space and through time? Bequeath-able?The tethers connecting one generation to the next in these families both nourish and grasp, strengthen and thin when tradition is pressured to change and the future is asked to remember.Reddi plays the tensions of these strings clearly, honestly, with a sweetness that is complicated, and a compassion that doesn't take sides. Each character arrives at his or her own unique cultural identity, a blend in proportions that is personal, landing somewhere on the spectrum between there and here. They are every one of them real people, people a reader can care about and sympathize with and respect.Reddi's collection is beautiful."}, {"review_sentiment": 5.0, "review_text": "Rishi Reddi is a great short storyteller. Her characters are so fully developed that I feel like I know them. I wanted to know about the characters in each story when I was done.  What happened to their lives, how did they cope and survive? I'd love to read a full novel from Ms Reddi, and I hope soon!"}, {"review_sentiment": 5.0, "review_text": "Karma and Other Stories by Rishi Reddi is a beautiful book in every way -- starting with the cover and extending to the lovely prose. I recently purchased multiple copies for friends who I believe will enjoy these stories that so skillfully explore the Indian American experience."}, {"review_sentiment": 5.0, "review_text": "I lived in the Winchester/Lexington/Boston area for a while which made this book even more enjoyable.  However, I think I would have still enjoyed these captivating short stories even if I had not lived in this area.Karma and Other Stories really sums up the situations and lives of the people in these stories.  I bought further copies of this book and sent them to friends to read.  I hope you get the opportunity to read this book."}, {"review_sentiment": 5.0, "review_text": "It's unusual for me to read every story in a collection, but I did with this one. The characters seemed very authentic to me. I grew up among an Indian-American community in northeastern Ohio, and although Reddi's stories are set in the Boston area, I recognized these people, and I enjoyed learning about them.The stories are inter-linked, with the same characters appearing in different stories, which makes this feel almost like a novel. You see a glimpse of a character in one story, and in the next you read about that person in more depth."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed this book so far. I'm about 2/3 done, and I can't wait to finish. Reddi's writing is extremely accessible and gripping. Her prose is very calm; I read this book every night with a cup of chamomile tea, and the combination is very fitting. \"The Validity of Love\" is an absolutely wonderful story.My one question would concern the setting. Does the immigrant experience differ in various regions across America? From simple anecdotal experience, I think it does. Jhumpa Lahiri and Reddi both write from New England settings and I wonder how this dominates and obscures a more variegated Indian American experience?Of course, both writer's deal with much more than that simple trope. Read this collection for a wonderful examination of the human condition."}, {"review_sentiment": 5.0, "review_text": "Written with imagination and sensitivity, this book of short stories is quite outstanding.  Paticularly noteworthy is the first story of the anthology, \"Justice Shiva Ram Murthy.\""}]}, "authors": ["Rishi Reddi"], "isbn": "0060898828", "longitude": -71.0595678, "periods": ["2000s", "Recent Releases"], "title": "Karma and Other Stories", "word_cloud": "sound original pretty good condition really good receive copy collection part annual conference privilege hear story loud rate entire base story story please review grain salt somebody live worked also spend year life marry immigrant marriage fail poignant story displace man find mean integration unexpected avenue opportunity especially poignant prior experience experience immigrant population think hit problem solution little booklet live reading enjoy enjoy story month later leave review meticulous master dialogue inspire painter scene collection convey indian indian american culture touch illuminate outsider honor portray culture place culture live be transportable translatable sustainable space time tether connect generation next family nourish grasp strengthen thin tradition pressure change future ask play tension string clearly honestly sweetness complicate compassion side character arrive unique cultural identity blend proportion personal landing somewhere spectrum real people people care sympathize collection beautiful great short storyteller character fully develop feel know want know character story do happen live cope survive love full hope soon beautiful way start cover extend lovely prose recently purchase multiple copy friends believe enjoy skillfully explore indian american experience live area make even enjoyable however think still captivate short even live really sum situation live people buy copy send friend hope opportunity unusual story collection character seem authentic grow community northeastern set area recognize people enjoy learn character appear different make feel almost see glimpse character story next person depth really enjoy far do finish write extremely accessible grip prose calm night cup chamomile tea combination fit absolutely wonderful question concern setting experience differ various region simple anecdotal experience think write setting wonder dominates obscures variegate indian american experience course writer deal much simple trope collection wonderful examination human condition imagination sensitivity short quite outstanding noteworthy first story anthology", "genres": ["Fiction & Literature"], "summary": "In this sparkling collection, award-winning writer Rishi Reddi weaves a multigenerational tapestry of interconnected lives, depicting members of an Indian American community struggling to balance the demands of tradition with the allure of Western life.\r\n\r\nIn \"Lord Krishna,\" a teenager is offended when his evangelical history teacher likens the Hindu deity to Satan, but ultimately forgives the teacher against his father's wishes. In the title story, \"Karma,\" an unemployed professor rescues birds in downtown Boston after his wealthy brother kicks him out of his home. In \"Justice Shiva Ram Murthy,\" which appeared in The Best American Short Stories 2005, an irascible retired judge reconnects with a childhood friend while adjusting to a new life with his daughter and her American husband. In \"Devadasi,\" a beautiful young woman raised in the United States travels back to India and challenges the sexual confines of her culture. And in \"Bangles,\" a widow decides to return to her native village to flee her son's off-putting American ways.\r\n\r\nSet mostly in the Boston area, with side trips to an isolated immigrant community in Wichita, Kansas, and the characters' hometown of Hyderabad, India, Karma and Other Stories introduces a luminous new voice.\r\n\r\n“Reddi’s understated prose and her choice of detail give her revelations a quiet power.” The New Yorker\r\n", "asin": "0060898828", "rank": "1150595", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/51fHg-iNzzL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}