{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 2716, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "Orwell and Huxley, dystopian future prophecies, elements of both authors becoming closer to modern reality than ever. A must read along with Orwell's 1984, if for no other reason than for the reminder humanity has not evolved much, however quickly we change the world with technology and our ever changing culture(s). Are we past the point of heeding their warnings? Are we doomed to live the nightmares so long ago imagined?"}, {"review_sentiment": 5.0, "review_text": "I read this book along with 1984 by George Orwell and I enjoyed this novell much more! I think it is a much more realistic vision of the future."}, {"review_sentiment": 5.0, "review_text": "The mass baby electrocution scene was epic.  ZAP! That's what you get for looking at books!"}, {"review_sentiment": 4.0, "review_text": "Huxley has a different and at times philosophical take on a dystopian future. An enjoyable and challenging read for anyone interested in such subjects."}, {"review_sentiment": 5.0, "review_text": "Works great."}, {"review_sentiment": 5.0, "review_text": "A classic book that I bought for my son and wanted him to read this along with \"1984\"."}, {"review_sentiment": 5.0, "review_text": "I enjoyed it.  Interesting look into how some people saw the future.  You can see a lot of this in whats happening in the world today."}, {"review_sentiment": 3.0, "review_text": "Talking about putting you right in the middle of a dystopian universe. Little hard to follow but a very interesting read. Kinda of a truncated ending I thought.Now let me have a soma and ponder some more on it."}, {"review_sentiment": 5.0, "review_text": "I LOOOOVVVEEEE THIS BOOK!!!. I am a bit of a dystopian fan, but this went a bit deeper in identifying a warning of sorts on where we could be heading in the future as a consumer in an industrial world with a never ending appetite for happiness. I would recommend this book to anybody who sees the world as slowly being engulfed in addictive time-wasting activates. Huxley beautifully portrays where the world might lead if people get accustomed to drugs, electronic screens, and sex as their daily activities.For a brief look at what you have to look forward to in this book; God is absent, people are no longer born, they are produced on assembly lines, all books with any philosophy or emotion are burned or put in a vault, families have gone extinct, and everyone gets around in helicopters. Their role in society is dictated before they were born and are constantly fueled with sex and drugs (provided for by the government) to be happy. From a young age, children are conditioned to not fear death, to hate books, and anything colorful. This book kept my attention because of the uncanny resemblance to some of the same ways that we fall into these types of addictive traps in our own lives. Huxley was a true visionary to be able to make this book and predict how humans would slowly obtain a reliance on activities that provide artificial happinessAt times, the book is tough to follow due to the unique dialog, but it is definitely worth the read, especially if you want an experience in thinking through the grand question of ‘better to be happy or free’."}, {"review_sentiment": 5.0, "review_text": "It was a really advanced lecture for its age, and I would recommend it because it gave a view of what might be coming in our society."}]}, "authors": ["Aldous Huxley"], "isbn": "0060850523", "longitude": -0.12574, "periods": ["1900s"], "title": "Brave New World", "word_cloud": "dystonia future prophecy elements author become closer modern reality ever along reason reminder humanity evolve much however quickly change technology ever changing culture past point heeding warning doom live nightmare long ago imagine along enjoy novel much think much realistic vision future mass baby electrocution scene epic get look different time philosophical take dystonia future enjoyable challenge anyone interested subject work great classic buy son want along enjoy interest look people saw future see lot whats happen today talk put right middle dystonia universe hard follow interest truncate end let some ponder loooovvveeee this bite dystonia fan go bit deeper identify warning sort future consumer industrial never end appetite happiness anybody see slowly engulfed addictive activates beautifully portray people get accustom drug electronic screen sex daily brief look forward absent people longer bear produce assembly line philosophy emotion burn put vault family go extinct everyone get helicopter role society dictate bear constantly fuel sex drug provide government happy young age child condition fear death hate anything colorful kept attention uncanny resemblance way fall type addictive trap live true visionary able make predict human slowly reliance activity provide artificial happiness at time tough follow due unique dialog definitely worth especially want experience think grand question better happy free really advanced lecture age give view come society", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "Brave New World is a novel written in 1931 by Aldous Huxley and published in 1932. Set in London in the year AD 2540 (632 A.F.—\"After Ford\"—in the book), the novel anticipates developments in reproductive technology, sleep-learning, psychological manipulation, and classical conditioning that combine profoundly to change society. Huxley answered this book with a reassessment in an essay, Brave New World Revisited (1958), and with Island (1962), his final novel.\r\n\r\nIn 1999, the Modern Library ranked Brave New World fifth on its list of the 100 best English-language novels of the 20th century. In 2003, Robert McCrum writing for The Observer included Brave New World chronologically at number 53 in \"the top 100 greatest novels of all time\", and the novel was listed at number 87 on the BBC's survey The Big Read.\r\n\r\nWikipedia", "asin": "0060850523", "rank": "1477", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41le8ej-fiL.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}