{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 504, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Paulo makes me realize a lot of things that i had forgotten for too long. This book was read when the time was just right for me personally."}, {"review_sentiment": 5.0, "review_text": "Insightful, riveting and so timely for my life right now!  A must read."}, {"review_sentiment": 5.0, "review_text": "Loved it!"}, {"review_sentiment": 4.0, "review_text": "Entretenido y con algunas reflexiones interesantes"}, {"review_sentiment": 4.0, "review_text": "Good read, there are lot of times a reader can relate to. Spiritual religious love life balance is what i loved most about it. Faith is the best way to serve God"}, {"review_sentiment": 3.0, "review_text": "Didn’t love the story. Well it’s very clever, I don’t think I could get into it, or into this author"}, {"review_sentiment": 5.0, "review_text": "Very imaginative! Enjoyed every minute! An easy read!"}, {"review_sentiment": 5.0, "review_text": "I read The Alchemist and wanted to see if Cuehlo's other books were as good.  Oh my this was just wonderful...it was such a beautiful work."}, {"review_sentiment": 4.0, "review_text": "I am a huge fan of Coelho, but this novel is not one of my favorites. I guess I'm used to protagonists who are on a search for a reason to live. This protagonist seems to not be able to accept that his wife left him, mainly because he wasn't true to himself. He wasn't happy with his life as an author & his wife did not want to \"settle down\" into a life with him.She had more of the world to explore & seems to want some spiritual enlightenment. It seems he only wanted his wife when she no longer wanted him as he had an affair & kept seeing that woman after his wife left.The man seems shallow. His wife seems like someone who wants to spend her life learning about LIFE & LOVE!"}, {"review_sentiment": 5.0, "review_text": "I believe Paulo Coelho has mastered the art of “writing between the lines” not being burdened by the weight of too many descriptions. The way he did this was by staying close with the energy and by portraying the characters in-side-out.The woman almost died. Her lover relinquished his mystical energy for a concept of love familiar. Curiously, he did not understand that it was his unique gift of love that nourished his lover. This became a demonstration of his human frailty.It ends well with a promise of what was relinquished would be attainable again.Those who are interested in the depth of religious faith will be moved by Paulo’s ability to “write between the lines”."}]}, "authors": ["Paulo Coelho"], "isbn": "0060832819", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Zahir: A Novel of Obsession", "word_cloud": "make lot thing forget long time right personally insightful rivet timely life right love con algunas reflexive interesantes good lot time relate religious love life balance love best way serve love story clever think author very imaginative minute easy want see good wonderful beautiful work huge fan favorites guess use protagonist search reason live protagonist seem able accept wife leave mainly true happy life author wife want settle life world explore seem want spiritual enlightenment seem wanted wife longer want affair keep see woman wife man seem shallow wife seem someone want spend life learn believe master write line burden weight many description way stay close energy portray character woman almost die lover relinquish mystical energy concept love familiar understand unique gift nourish lover become demonstration human end well relinquish interested depth religious faith move ability write line", "genres": ["Fiction & Literature"], "summary": "The narrator of The Zahir is a bestselling novelist who lives in Paris and enjoys all the privileges money and celebrity bring. His wife of ten years, Esther, is a war correspondent who has disappeared along with a friend, Mikhail, who may or may not be her lover.\r\n\r\nWas Esther kidnapped, murdered, or did she simply escape a marriage that left her unfulfilled? The narrator doesn’t have any answers, but he has plenty of questions of his own. Then one day Mikhail finds the narrator and promises to reunite him with his wife. In his attempt to recapture a lost love, the narrator discovers something unexpected about himself.\r\n\r\nIf you are a fan of Paolo Coelho and planning to head to Central Asia, Zahir will give you a taste for the empty steppes. Easy to read with a clear message, Zahir is great for those long train rides through the endless green flatlands of Kazakhstan.", "asin": "0060832819", "rank": "129091", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41uuBJMucwL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}