{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 19, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Anything by Hijuelos is great."}, {"review_sentiment": 4.0, "review_text": "Best compared to the author's novel Mambo Kings, in its focus on music, this one details the life of famous Cuban composer Israel Levis in the first half of the 20th century, primarily in Cuba and Paris, with an unfortunate detour to the Buchenwald concentration camp.  The author's usual themes are at play-- love, lust, religion, and family--and the writing is as usual elegant and eloquent."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed this book - the central character was very human, and his story was interwoven beautifully with the history of Cuban music."}, {"review_sentiment": 4.0, "review_text": "It is a wonderful rare treat when an author keeps me anxiously, deliciously turning the pages.  Page turners are usually associated with action or horror novels.  What a treat to find such a wonderful lyrical tale.  Now I must read \"The Mambo Kings\"  Bravo, Mr. Hijuelos!"}, {"review_sentiment": 5.0, "review_text": "I like this novel much more than any other done by the author.  At times its sloppy, at times its slow and plodding.  I tend to like these type of 'mistakes' by an author because it adds some dissonance to otherwise consonant writing.  The main character is kind of cerebral, pitiful and lonely, but those are themes I understand and appreciate, so its okay.  Actually, I kind of think of this novel as a re-write of Mambo Kings, it employs many of the same novelistic devices, especially, an artist's relationship to his or her own song lyrics or music.  Its not a novel where I 'felt' for any of the characters, I've already outgrown that, I'm more interested in character development, plot development, themes and use of voice.  One thing I'd like to ask the author is why his Cuban protagonists are always so ehm...well endowed, and why discuss so much what they do with it?  Does size matter?"}, {"review_sentiment": 5.0, "review_text": "The \"Simple Habana Melody\" of the title of this book is a song and rumba called \"Rosas Puras\" (Pretty Roses) that the main character, a fictitous composer named Israel Levis, dashes off in 1928 in the space of about 20 minutes in a bar in the company of his friend and lyricist, Manny Cortez.  The song was written for the love of Levis's life, a singer named Rita Valladares.  The relationship between Levis and Valladares is at the heart of this story.  Levis's song makes both him and Valladares famous.  The song becomes ubiquitous and it does much to shape the remainder of the lives of both Levis and Valladares.Throughout his novel, Hijuelos contrasts the simplicity and immediate attractiveness of Levis's song with the difficult character of Levis's life.Born to a physician father, who is also an amateur musician and student of nature, Levis quickly shows prodigious gifts at the piano and an astonishing facility for composition, both popular tunes and more classical works such as concertos, operas and symphonies.  Levis displays a large appetite for food, liquor, cigars, and paid sex together with his efforts as a composer. Much of his life is superficially sensual and lusty.Yet there is much more to Israel Levis.  For all his devotion to the senses, Levis is a devout Catholic. And the novel pivots perhaps too readily on his name, which, while Levis is living in Paris during the Nazi occupation, makes the Germans take him as Jewish and send him to Buchenwald where he barely survives his 14 month imprisonment. Levis is attached to his mother with whom he lives until his middle age.  And Levis has difficulty with his own large sexuality.  Throughout the book he appears to be attracted to men, but he remains unwilling to acknowledge this to himself.  Beyond commercial sex, he has the greatest difficulty establishing a love relationship with a woman.  Despite  Rita Valladares's lifelong and obvious interest, Levis does not pursue the relationship beyond the level of friendship, rationalizing to himself that he is too old and too obese for Rita. Levis does establish a brief romantic and physical relationship  in Paris with a Jewish woman named Sarah Rubenstein which comes to an end with the Nazi occupation.Hijuelos's book begins late in Levis's life, after he returns to Habana in 1947, a thin and broken man resulting from his internment in Buchenwald and a further year of recuperation in a hospital in Spain. The central portions of the book describe Levis's life during his apparently happier and fuller younger days, which are themselves marred by death of family members, repressive politics in Cuba, and, most importantly, by Levis's inability to have a sexual relationship with Rita.  Upon his return to Habana, Levis is unable to compose or even play the piano.  He has become skeptical of religion, although he does not lose his faith entirely. He seems a lost and lonely man who, as he tells Rita in a letter, is deeply afraid of dying alone.Hijueleos shows Levis both as he lives his life during his active years and then reflecting upon his life when he returns to Habana in 1947 to gain a measure of redemption.  Levis comes to see his life, in the title of the final chapter of the novel, as \"The Loveliness of a Dream.\"  Levis is able to recognize the failures and lost opportunities of his life, especially his relationship with Rita. But he comes to terms with himself and is able to embark on new important projects in his last years.  He is able to come to a feeling of peace, while recognizing his disappointments.Hijuelos's novel is filled with the love of music and with the sights and sounds of Hababa in the 1920's and 30s. His book also explores in a poignant way,the issues of religion and sexuality and self-knowledge that trouble his hero, Israel Levis. The book is a complex, many-voiced fugue beneath a deceptively simple melody.Robin Friedman"}, {"review_sentiment": 2.0, "review_text": "We read this novel for Book Club, and all agreed that it did not live up to the glowing reviews.  The characters were flat and unbelievable, the plot contrived.  It's not that the situation could not have happened, but rather that the author wrote it clumsily, so that it did not come across as believable.  In fact the heavy and clumsy writing detracted considerably from enjoyment of the book.  The \"subtitles\" and translations in parentheses were quite annoying.  None of us felt that there was any literary quality to the novel; it seemed more that Hijuelos was coasting on his reputation.  If you want to read it, try the library first--I wouldn't recommend spending money on it."}, {"review_sentiment": 5.0, "review_text": "I read \"The Mambo Kings Play Songs of Love\", and although I was impressed with the obvious writing skills of Hijuelos, I was also put off by the nearly brutal pervasiveness of its sexual content.Still, I was willing to give Hijuelos another chance.  I'm glad I did.This is a quiet, thoughtful, subtle book.  It captures the human condition in a way that raises the mundane successes and failures of life to the level of art.  Not easy to do, since we tend to like characters in literature who go, boldly or not, to places and situations we will never see with our own eyes.  By contrast, Israel Levis lives a life like all of us--marked not only by successes, but by the regrets of chances not taken and love not lived.  Imagine a book where the character marks his life by the things he *doesn't* do--a book that devotes much of its time to...nothing.  Now imagine that it all works.Although it probably won't work for young readers.  There's not enough \"stuff\" happening, and when it becomes clear that all that moodsetting is the actual story, I would guess a lot of young people will put it down and switch back to their television sets.  But for those who are approaching middle age (or older), coming to grips with their own mortality, and starting to wonder how the great final slide will play out in their own lives, this is a book with hidden gifts.  A fine book."}, {"review_sentiment": 4.0, "review_text": "To this point I've found it difficult to separate Hijuelos's novels, all of which burst at the seams with humanity, sublime imagery, raw sensuality, and entrancing prose. HABANA MELODY does all these things too, but for the first time I found elements repetitive and digressive, even poorly edited. So while it still stands as one the best books of the year, I have to rate it a notch below the author's preceding and inseparable classics ... a small bump on Hijuelos's path to the Nobel Prize."}, {"review_sentiment": 3.0, "review_text": "The best I can say about this book is that it is wonderfully written. Hijuelos definitely is one of the best contemporary writers in America. Yet in this book he lacks his usual pace. Having read every one of his books, I must say this one was a bit disappointing. It has great lengths which could have been avoided. The fictous life story of Israel Levis also paints a picture of Cuba before Castro, which very few of us know about. Nevertheless it lacks a lot of substance. On some occasions - unfortunately - I had to drag myself through this book. I would not read it again, which I did several times with \"Mambo Kings\"."}]}, "authors": ["Oscar Hijuelos"], "isbn": "0060928697", "longitude": -82.3658671, "periods": ["1900s"], "title": "A Simple Habana Melody", "word_cloud": "anything great best compare author focus music detail life famous composer first half century primarily unfortunate detour concentration camp author usual theme play lust religion family write usual elegant eloquent really enjoy central character human story interweave beautifully history music wonderful rare treat author keep anxiously deliciously turn page turner usually associate action horror novel treat find wonderful lyrical tale now like much do author time sloppy time slow plodding tend type author add dissonance otherwise consonant write main character kind cerebral pitiful lonely theme understand appreciate kind think employ many novelist device especially artist relationship song lyric music character already outgrow interested character development plot development theme use voice thing like ask author protagonists always hem well endow discus much size matter title song rumba call main character fictitious composer name dash space minute bar company friend lyricist song write love life singer name valladares relationship heart story song make famous song become ubiquitous much shape remainder live contrast simplicity immediate attractiveness song difficult character physician father also amateur musician student nature quickly show prodigious gift piano astonish facility composition popular tune classical work concertos opera symphony display large appetite food liquor cigar pay sex together effort composer much life superficially sensual much devotion sens pivot perhaps readily live occupation make german jewish send barely survive month imprisonment attach mother life middle age difficulty large sexuality appear attracted men remain unwilling acknowledge commercial sex greatest difficulty establish love relationship woman lifelong obvious interest pursue relationship level friendship rationalize old obese brief romantic physical relationship woman name come nazi begin late life return thin break man result internment year recuperation hospital central portion describe life apparently happier fuller younger day mar death family member repressive politics importantly inability sexual relationship return unable compose even piano become skeptical religion lose faith entirely seem lose lonely man tell letter deeply afraid dying show live life active year reflect life return gain measure redemption come see life title final chapter able recognize failure lose opportunity life especially relationship come term able embark new important project last year able come feeling peace recognize fill love music sight sound also explore poignant way issue religion sexuality trouble hero complex fugue beneath deceptively book agree live glowing review character flat unbelievable plot contrive situation rather author write clumsily come believable fact heavy clumsy write detract considerably subtitle translation parenthesis quite annoy none felt literary quality seem coast reputation want try library first spending money impress obvious write skill also put nearly brutal pervasiveness sexual willing give chance glad quiet thoughtful subtle capture human condition way raise mundane success failures life level art not easy tend character literature boldly place situation never see eye contrast live life mark success regret chance take love lived character mark life thing devote much time nothing now imagine probably young reader enough stuff happen becomes clear mood setting actual story lot young people put television set approach middle age older come grip mortality start wonder great final slide play live hidden gift fine find difficult separate novel burst seam humanity sublime imagery raw sensuality entrance prose thing first time find element repetitive digressive even poorly edit still stand best year rate notch author precede inseparable classic small bump path best say wonderfully write definitely best contemporary writer lack usual pace have bit disappointing great length fictous life story also paint picture know nevertheless lack lot substance occasion unfortunately drag several time mambo king", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "It is 1947, and Israel Levis, a Cuban composer whose life had once been a dream of music, love, and sadness, returns to Cuba after being mistakenly imprisoned during the Nazi occupation of France.\r\n\r\nWhen Levis arrives back in Habana, his mind returns to an unrequited romance with the alluring Rita Valladares, a singer for whom Levis had written his most famous song, \"Rosas Puras.\" This 1928 composition became the most famous rumba in the world and changed American and European tastes in music and dance forever.\r\n\r\nA love story—of art, family, and country—A Simple Habana Melody is a virtuoso performance from one of our most important writers.", "asin": "0060928697", "rank": "624034", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51e6lNZ86BL.jpg", "country": "Cuba", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}