{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 760, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Interesting plot. Excellent writing. It was like walking in Venice again. Likable characters. I guessed the solution, but was not too sure. I'll continue reading the next books in this series."}, {"review_sentiment": 4.0, "review_text": "I enjoyed the setting as I was visiting Venice while I read this.  Brunetti reminded me of Louise Penny's Gamache. Penny and Leon share many storytelling techniques.  The plot was predictable, however, all in all, a fun read."}, {"review_sentiment": 4.0, "review_text": "This is the first entry in this series, and the first by this author that I’ve read.  I enjoyed it thoroughly, especially the atmospheric evocation of Venice through the eyes of a native.My only complaint was with the map in the Kindle edition. The author uses real places extensively, making following the action on the map part of the enjoyment. But the map provided had 2 issues: 1) It was spread across 2 pages, which made it hard to use, but that is perhaps forgivable to provide greater size. 2) This is the big one: the original map was apparently badly scanned, as if from a bound book, so there is a large vertical slice which is simply missing: the left and right sides meet, but the area between (several blocks at least across) is gone, making it impossible to follow many of the detective’s movements.Since that problem is down to the Kindle production, not the author, I didn’t take any stars off for it; if there was a separate Kindle rating, it’d be 2 stars, because of the map and the numerous typos."}, {"review_sentiment": 3.0, "review_text": "Ok..I've read better murder mysteries."}, {"review_sentiment": 5.0, "review_text": "A well-crafted mystery: Who done-it ?And where else than in Venice ?  Not the Venice seen by the tourist.  I've been there as a tourist, but I've also been there as a guest of \"locals\" who cannot change the color schemes of their houses from how they were painted when depicted in \"classic\" paintings.  One sees Venice and the mystery from a natives point-of-view."}, {"review_sentiment": 4.0, "review_text": "This is Donna Leon's first  mystery with Commissario Brunetti.  Here he investigates the murder of a renowned opera conductor that occurs during the show's intermission.  The case establishes him as a keen observer of human nature and a lover of his native Venice.  I look forward to reading more stories in the series."}, {"review_sentiment": 1.0, "review_text": "Not my type of mystery. Thank you"}, {"review_sentiment": 5.0, "review_text": "Excellent read!  Kept me on my toes until the end when I was shocked!  Loved it!"}, {"review_sentiment": 4.0, "review_text": "A good mystery and a look at life in Italy..fun read!"}, {"review_sentiment": 5.0, "review_text": "I loved this book!  It has been many years since I visited Venice and this book brought back many happy memories.  The characters were great too."}]}, "authors": ["Donna Leon"], "isbn": "006074068X", "longitude": 12.3345898, "periods": ["2000s", "Recent Releases"], "title": "Death at La Fenice: A Commissario Guido Brunetti Mystery", "word_cloud": "interest plot write walk likable character guess solution sure continue read next series enjoy set visit remind share many storytelling technique plot predictable however fun first entry series first enjoy thoroughly especially atmospheric evocation eye complaint map edition author use real place extensively make follow action part enjoyment map provide issue spread page make hard use perhaps forgivable provide greater size big original map apparently badly scan large vertical slice simply miss leave right side meet area several block least go make impossible follow many detective problem production author take star separate rating star map numerous typo better murder mystery else not see tourist tourist also guest local change color scheme house paint depicted classic painting see native first here investigate murder renowned opera conductor occur show intermission case establish keen observer human nature lover native look forward read story series not type thank excellent toe end shock good look life love many year visit bring back many happy memory character great", "genres": ["Fiction & Literature", "Mystery & Suspense", "LGBT"], "summary": "Book 1/24 in the Commissario Brunetti Series\r\n\r\nDeath at La Fenice is the first novel in Donna Leon’s internationally best-selling Commissario Guido Brunetti series. During intermission at the famed La Fenice opera house in Venice, a notoriously difficult conductor is poisoned, and suspects abound. Brunetti, a native Venetian, sets out to unravel the mystery behind the high-profile murder. To do so, he he calls on his knowledge of Venice, its culture, and its dirty politics. Revenge, corruption, and even Italian cuisine play a role. The novel that started it all, Death at La Fenice is an entrancing mystery, rich in atmosphere.\r\n\r\n“Few detective writers create so vivid, inclusive and convincing a narrative as Donna Leon, the expatriate American with the Venetian heart. . . . One of the most exquisite and subtle detective series ever.” The Washington Post\r\n", "asin": "006074068X", "rank": "21930", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51J3wPcjpcL.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}