{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 32.7762719, "ratings": {"num_ratings": 923, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "One of my all-time favorite novels is Joseph Heller’s seminal World War II satire Catch-22, a vicious, funny, trenchant take on the insanity of war. So when I heard numerous comparisons between Ben Fountain’s Billy Lynn’s Long Halftime Walk and Heller’s masterpiece, it would be safe to say that my interest was piqued. I’m fascinated by portraits of war with a satirical bent – it’s no accident that so much of my bookshelf is filled with writings about and from the Vietnam War – and the idea of finding a modern take on all of that was super up my alley.Having read Billy Lynn finally, I totally understand those comparisons; while Billy Lynn is very different from Catch-22, there’s much of the same DNA to be found there: a horror at the violence of war and the way it kills part of us; the conflict between a desire to support your friends and a disgust at the war as a concept; an unflinching look at the way war changes those who fight in it. But Billy Lynn has a very different primary target than Catch-22; while Heller was primarily focused on the insanity of war, Fountain wants to question American “patriotism,” with its easy platitudes, empty cliches, and pointless grandstanding that has little bearing or meaning on the conflict and those who fight in it.Set entirely during a Dallas Cowboys football game, Billy Lynn’s Long Halftime Walk follows our title character and his fellow grunts from Bravo Platoon as they are theoretically being honored for wartime valor. Survivors of a battle that was captured on video that became a viral hit, especially on Fox News, Lynn and his platoon mates are on a “victory tour” around the country, which mainly means that they’re used in photo ops, forced to endure awkward handshakes and congratulatory ceremonies, and deal with an agent who’s in the midst of attempting to turn their story into a film. Meanwhile, Bravo Platoon is dealing with their own issues: an inability to fit back into the home front, a rapidly growing disgust at the disconnect between themselves and those who they’re protecting, and their increasing unease at their impending return to Iraq and the battle front.All of which sounds like heavy fare, and in lesser hands, it could be. But in Fountain’s hands, Billy Lynn is rapid-paced, funny, moving, and just plain incredible. From the pitch-perfect depiction of every platitude every soldier hears to his capturing of the vulgar, violent repartee of the soldiers, Fountain gives us a picture of barely controlled anarchy, as Bravo jeers at the civilians who don’t understand them, leers after the members of Destiny’s Child (from a distance, of course), comments on politics, and find a way to make peace with their largely symbolic role in everything around them. Plunging us into the title character’s running commentary, Fountain gives everything a perfectly arched approach, both understanding the awkwardness of all of these events but also the distance between Billy and a world that only loves the idea of him, not the reality. Lynn isn’t some warrior poet, some complex philosopher; he’s a roughneck, albeit one smart enough to see through the pomp and circumstance and roll his eyes at the ridiculously contrived patriotism on display, and see how it’s all about theater, not true love of country.But more than that, Fountain never lets his themes and ideas overtake the characters and the emotional rhythms of the story. Yes, this is a book about how American patriotism has become a political necessity, and a ticket for grandstanding; yes, it’s a book that’s entirely focused on how soldiers are often only thought of in theory, of how we cope with war by imagining it as a movie, and of how we so often forget our wars or only think of them in abstract terms. But even with all of that, what sticks out in Billy Lynn’s Long Halftime Walk are the small moments – the trauma as the PTSD kicks in for our soldiers during an absurd halftime show, the rhythms the soldiers have developed in dealing with older men who have their own stories, the profane but hilarious banter between men who have long since quit caring about social norms, the dead-on capturing of every single cliche (my favorite is Fountain’s repurposing of 9/11 as “nina leven,” a meaningless phrase without clear impact anymore)…it’s these moments that make Billy Lynn so effective. Like Catch-22, its targets are clear, its humor sharp, its chaos perfectly controlled – but more than that, it’s the book’s humanity and heart that makes it so great."}, {"review_sentiment": 3.0, "review_text": "Rather a strange book not what I was expecting. Can't always be pleased though so 'nothing ventured nothing gained' as my old Irish Gramps would say. God I miss him...."}, {"review_sentiment": 3.0, "review_text": "Ben Fountain is spot on in his portrayal of the military football entertainment complex.  It exists and the Department of Defense (DOD) pays upwards of 6-million dollars per National Football League (NFL) game to have its fighting forces displayed therein as marketing for a crop of new recruits.  The setup of Bravo Company, the \"heroes\" of a battle at a canal in Iraq, is spot on for the NFL/DOD marketeers.  Fountain is also spot on in his portrayal of the classes which divide the United States (the business ownership class and the working class/fighting class of which PVT Billy Lynn is a part).  The interludes regarding his working class/disabled family are classic.  There are so many phony patriots in this book that I laughed out loud.  Fountain goes out of his way to tie Iraq to 9/11 which was a common refrain at the time.  I have one critique:  I had a hard time determining what point of view the novel was told from because the author often broke into vocabulary that no 18-year old private could fathom having and introduced critiques (while accurate) that somewhat pulled the reader out of the story.  The challenge would be to make Billy Lynn say these critiques in his somewhat limited Everyman vocabulary.  The point of view is a somewhat omniscient third person that dives more often than not into Billy Lynn's stream of consciousness.  I could have dealt with this and not had the overly Ph.D. level critiques of contemporary American society intruding as much. Also, as former US Army soldier for ten years, I have a critique of the author's knowledge of military structures in this novel.  I do not understand why a Major, the first staff officer in the chain of command, would be accompanying this group of young men.  You would think that their Platoon Sergeant, or Platoon Leader (a Lieutenant) would be accompanying them.  It would be understandable if that was their company commander (a Captain) who was recently promoted to Staff Officer (Operations Officer, XO of a Battalion, etc).  That is a minor critique, but to a former U.S. Army soldier, it was quite glaring to me."}, {"review_sentiment": 1.0, "review_text": "What was the point? Switch from here to there with out a period"}, {"review_sentiment": 5.0, "review_text": "Very entertaining book.  Well written story!"}, {"review_sentiment": 4.0, "review_text": "Like most books centered around war, this book just made me sad.  Billy is a sympathetic and likeable character, which is good as most of the book consists of his thoughts and reactions. This story made me feel for all soldiers in wars everywhere and everywhen. And harsh thoughts for those who profit from conflict."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed reading this well-written book.  The characters and the storyline are both interesting.  You get a clear sense of Billy's dilemma and what he has experienced in war and at home."}, {"review_sentiment": 5.0, "review_text": "This is an exceptionally well written book....energy, insight, and great use of language.Michael Leon lewis"}, {"review_sentiment": 5.0, "review_text": "Bravo, a squad of eight Army infantry, distinguishes themselves in Iraqi combat. The one event at a canal, is filmed in real time by FOX NEWS. Pvt. Billy Lynn, is a hero; rescues his sergeant who succumbs to his wounds, but not before Billy and the rest of his squad  mete out some true battlefield justice to the insurgents. Billy wins the Silver Star, the Army award for gallantry in combat.  The owner of the Dallas Cowboys, Norm Oglesby, senses an opportunity here for a hit war movie starring - \"The Bravos.\" They are shippped, mid-tour from Iraq at Thanksgiving for a two week \"Victory Tour,\" like the tours in WWII to sell War Bonds and drum up homefront support for the war. At the end of the two week tour and time with his family, Billy and his squad mates go to Cowboy stadium for a Thanksgiving Day game and celebratory lauding of the nation's newest heroes.  The Bravos experience at the game, in the middle of a sleet and ice storm, is one where they see how this microcosm of society treats and thinks of it's heroes. They meet sincere and some scripted reactions to their actions. Seen through Pvt. Lynn's eyes, a nineteen year old Texan, we go though the gamut of emotions a combat soldier feels upon suddenly being whisked out of dangerous combat to the entirely different galaxy of Home.  During the game, they sweat out Mr. Oglesby's promise of a movie deal to net the Bravos some serious money; but it turns out not to be the case - not even the $5,500.00 promised to each of the eight Bravos as an \"advance.\"  In the interim, Billy experiences a \"mutual crush\" with a Cowboy Cheerleader named Faison, daydreams of love, and coming home from the war to spend countless hours of lovemaking with her. They exchange emails, cell numbers, and a passionate \"good bye\" embrace at the end.  The book is powerful in its portrayal of the love of Billy's sister for him. She wants to get him out of the war; arranges for a \"peace group\" to get him out of the war and spirit him AWOL to a ranch, but his bond to his buddies is too strong. The trip was almost a tease for Billy, who learned some important life lessons in addition to the knowledge and experience gleaned on the battlefields of the War In Iraq.  The end of the book has you rooting for Billy and his squad mates to make it home alive and well; and have a shot at \"the good life\" they see everyone else enjoying that they are fighting to preserve."}, {"review_sentiment": 2.0, "review_text": "My daughter said this book sucked!"}]}, "authors": ["Ben Fountain"], "isbn": "0060885610", "longitude": -96.7968559, "periods": ["2000s", "Recent Releases"], "title": "Billy Lynn's Long Halftime Walk", "word_cloud": "favorite novel seminal satire vicious funny trenchant take insanity war hear numerous comparison masterpiece interest pique fascinate portrait war satirical bent accident much bookshelf fill writing idea find modern super finally totally understand comparison different much find horror violence war way kill part conflict desire support friend disgust war concept unflinching look way war change fight different primary target primarily focus insanity war want question american patriotism easy platitude empty cliche grandstand little bear mean conflict fight entirely football game follow title character fellow grunt theoretically honor wartime valor battle capture video become viral hit especially platoon mate victory tour country mainly mean used photo ops force endure awkward handshake congratulatory ceremony deal agent midst attempt turn story film meanwhile deal issue inability fit back home front rapidly grow disgust disconnect protect increase unease impend return battle sound heavy fare lesser hand hand funny move plain incredible depiction platitude soldier hears capture vulgar violent repartee soldier fountain give picture barely control anarchy jeer civilian understand leer member distance course comment politics find way make peace largely symbolic role everything plunge title character run commentary give everything perfectly arch approach understand awkwardness event also distance world love idea reality warrior poet complex philosopher roughneck smart enough see pomp circumstance roll eye ridiculously contrive patriotism display see theater true love never let theme idea overtake character emotional rhythm story yes american patriotism political necessity ticket grandstand yes entirely focus soldier often think theory cope war imagine movie often forget war think abstract term even stick small moment trauma kick soldier absurd show rhythms soldier develop deal older men story profane hilarious banter men quit care social norm capture single cliche favorite re purposing nina even meaningless phrase clear impact moment make effective target clear humor sharp chaos perfectly control humanity heart make great rather strange expect always please ventured nothing gain old irish miss spot portrayal military football entertainment complex exist pay upwards dollar game fight force display therein marketing crop new recruit setup heroes battle canal spot marketeers also spot portrayal class divide business ownership class work class part interlude regard work family classic many phony patriot laugh loud go way tie common refrain time critique hard time determine point view tell author often break vocabulary old private introduced critique accurate somewhat pulled story challenge say critique somewhat limited vocabulary point view somewhat omniscient third person dive often stream consciousness overly level critique contemporary american society intrude much also former soldier year critique author knowledge military structure understand major first staff officer chain command accompany group young men accompany understandable company commander recently promote etc minor critique former soldier quite glare point period very entertaining write story center war make sad sympathetic likable character good consist thought reaction story make feel soldier war everywhere every when harsh thought profit conflict really enjoy read character story line interest get clear sense dilemma experience war home exceptionally well write insight great use lewis squad infantry distinguishes combat event canal film real time hero rescue sergeant succumbs wound rest squad mete true battlefield justice insurgent win award gallantry combat owner sense opportunity hit war movie star ship week tour sell drum home front support war end week tour time family squad mate go stadium game celebratory laud nation newest heroes experience game middle sleet ice storm see microcosm society treat think hero meet sincere script reaction action eye nineteen year old go gamut emotion combat soldier feel suddenly whisk dangerous combat entirely different galaxy game sweat promise movie deal net serious money turn case even promise advance interim experience mutual crush name daydream love come home war spend countless hour lovemaking exchange email cell number passionate good bye embrace end powerful portrayal love sister want war arranges peace group get war spirit ranch bond buddy strong trip almost learn important life lesson addition knowledge experience glean battlefield end root squad mate make home alive well shot good life see everyone else enjoy fight preserve daughter say sucked", "genres": ["Fiction & Literature", "Politics", "Satire"], "summary": "Winner of the National Book Critics Circle Award for Fiction and a finalist for the National Book Award!\r\n\r\nFrom the PEN/Hemingway Award-winning author of the critically acclaimed short story collection, Brief Encounters with Che Guevara, comes Billy Lynn's Long Halftime Walk (\"The Catch-22 of the Iraq War\" —Karl Marlantes).\r\n\r\nA razor-sharp satire set in Texas during America's war in Iraq, it explores the gaping national disconnect between the war at home and the war abroad.\r\n\r\nBen Fountain’s remarkable debut novel follows the surviving members of the heroic Bravo Squad through one exhausting stop in their media-intensive \"Victory Tour\" at Texas Stadium, football mecca of the Dallas Cowboys, their fans, promoters, and cheerleaders.\r\n\r\n“[An] inspired, blistering war novel…Though it covers only a few hours, the book is a gripping, eloquent provocation. Class, privilege, power, politics, sex, commerce and the life-or-death dynamics of battle all figure in Billy Lynn’s surreal game day experience.” New York Times", "asin": "0060885610", "rank": "61618", "city": "Dallas", "image": "https://images-na.ssl-images-amazon.com/images/I/51vuGBmqxYL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}