{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 278, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Very interesting story, especially because the author uses a lot of towns and landmarks from my hometown or close by."}, {"review_sentiment": 5.0, "review_text": "The writing style of this novel is a bit odd, but Banks is consistent with it throughout the book. It's a kind of coming-of-age story for a more modern age and it just works. If you are a fan of literary fiction, I would definitely recommend this book to you."}, {"review_sentiment": 3.0, "review_text": "This is an interesting novel, though it gets a bit repetitious at times."}, {"review_sentiment": 5.0, "review_text": "makes me remember when I was that age, and realize I had a great childhood compared too his...Ps my nick name is BONE!"}, {"review_sentiment": 5.0, "review_text": "I absolutely loved this book. It was easy to follow along with and inspirational for a new author."}, {"review_sentiment": 4.0, "review_text": "First read this book in high school and re-read it at 25. It was just as great then as now."}, {"review_sentiment": 5.0, "review_text": "Reminiscent of Catcher in the Rye. A bittersweet coming of age story."}, {"review_sentiment": 5.0, "review_text": "One of my all-time favorite books, I've re-read this one many times. Should be more popular than The Catcher in the Rye (which sucks, imo). Really beautiful writing style."}, {"review_sentiment": 1.0, "review_text": "Read this for a book club or otherwise I wouldn't have read it.  Writing very simple and seemed aimed at shock value.  A coming of age compilation that included disparate stereotypes of a dysfunctional upbringing.  No redeeming adults ultimately.  Has been compared to Tom Sawyer and A Catcher in the Rye which is unfair to those books.  Sorry, just would look for other books for inspiration or understanding of the human dilemma."}, {"review_sentiment": 5.0, "review_text": "I loved every word. I remember just the first chapter and gen years later I finally found the book and it's called rule of the bone. And lives up to that awesome name. It's brutal."}]}, "authors": ["Russell Banks"], "isbn": "0060927240", "longitude": 0.0, "periods": ["1900s"], "title": "Rule of the Bone", "word_cloud": "very interesting story especially author us lot town landmarks hometown close writing style bit odd consistent kind story modern age work fan literary fiction definitely interesting get bit repetitious time make remember age realize great childhood compare nick name absolutely love easy follow inspirational new author first high school great bittersweet come age story favorite many time popular suck imo beautiful writing style club otherwise write simple seem aim shock value coming age compilation include disparate stereotype dysfunctional upbringing redeeming adult ultimately compare unfair inspiration understand human dilemma love word remember first chapter gen year later finally find call live awesome name brutal", "genres": ["Fiction & Literature"], "summary": "In the tradition Huckleberry Finn and The Catcherin the Rye, Russell Banks’s quintessential novel of a disaffected homeless youth living on the edge of society “redefines the young modern anti-hero. . . . \r\n\r\nRule of the Bone has its own culture andlanguage, and Bone is sure to become a beloved character for generations” (SanFrancisco Chronicle). With a compelling, off-beat protagonist evocative of Holden Caulfield and Quentin Coldwater, and a narrative voice that masterfully and naturally captures the nuances of a modern vernacular, Banks’s haunting and powerful novel is an indisputable—and unforgettable—modern classic.", "asin": "0060927240", "rank": "130553", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/51-6OXBHAgL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}