{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 57, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "Here's a simple summary of the book. A bunch of people lived, then they died. The end... There was no real plot and it felt like the story went nowhere. It was like a book version of reality TV in the 19th century. I hated it so much I actually burned it."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this novel a lot. Very well written."}, {"review_sentiment": 4.0, "review_text": "Nature writer Annie Dillard has given us a sweeping historical novel about the settlement of Bellingham, WA on the shores of Puget Sound, and the hills and mountains behind it. Dillard takes us through the forty years from the first permanent European settlements in the 1850s to the coming of the railroads, Statehood, and the Alaska gold rush in the 1890s. Her settlers suffer heartbreaking toil and loss along with moments of exuberance and exhilaration. Her characters' travails and triumphs remind us that life is for \"The Living.\" This novel's strong sense of place should attract especially readers interested in the Pacific Northwest. Read more at bookmanreader.blogspot.com ."}, {"review_sentiment": 4.0, "review_text": "Beautiful colorful language and setting.  Pours through the history of the PNW settlers.  The incredibly difficult challenge the primitive forest presented and how those forests were slowly beaten back in fits and starts set against the broader economic history of the country and the impact 19th century capitalism had on people. Character development somewhat lacking."}, {"review_sentiment": 4.0, "review_text": "Artistry with words, Annie Dillard does not hide her hopeless despair with the fancy title \"the living.\"  A morose view on a world beautifully portrayed in liquid letters, The Living is laid bare as the earth: fatalism. You live. You die. Its Over. All that lives on are the generations after you.While I completely disagree with Annie Dillard's perspective, her thinking draws you in. The portrayal of the history of my home state of Washington is why I read the book and is valuable. I did put the book down because of how depressed it leaves you. While it's the longest I ever took to finish a book, the language of Annie Dillard will stay with me.It seems like people have given ratings based on the haunting she casts versus the quality or thinking behind her words. I understand. Mine is based on the latter and the brilliance behind the diverse characters and threads to the story. She move seamlessly from the rapture of creation to the various despairs of the living."}, {"review_sentiment": 5.0, "review_text": "Lyrical prose.  A book that takes you outside of yourself so that you may look within."}, {"review_sentiment": 4.0, "review_text": "Wonderfully written, poetic novel about the westward migration in the mid-to-late 19th c."}, {"review_sentiment": 3.0, "review_text": "Not an easy or light hearted read. Better jot down the characters and their relationships. If you don't' it will be very confusing and you will miss the majority of the story."}, {"review_sentiment": 3.0, "review_text": "I've read all of Annie Dillard's books of prose and \"The Living\" is my least favorite by far.I slogged through this novel because I'm a huge fan of Dillard's writing style. Fortunately, she doesn't disappoint on that level. The gorgeous imagery is dispensed by means of carefully constructed sentences that are full of rich language and clever juxtapositions. I highlighted her well-phrased insights and laughed out loud multiple times, but not often enough considering the novel's size and pace—both of which are comparable to the gigantic, old growth trees that the book painstakingly describes.Alas, \"The Living\" is underwhelming as a story—even by the standards of literary fiction. The summary on the book jacket describes all the action you can expect to see. The story might appeal to those who enjoy sprawling epics—emphasis on \"sprawl\" rather than \"epic.\" In my opinion, there are far too many characters, few of whom are proactive enough to truly come alive or meet a surprising end. If you were to ask me \"What's it about?\" the best answer I could give would be, \"It's about some settlers living in Washington during the 19th century.\"After finishing this book, I'm left with some knowledge about the time period, an appreciation for the value of cookie-cutter Hollywood story structure, and a feeling of relief. I can only recommended \"The Living\" to readers who are fans of Dillard or atmospheric historical fiction.If you've never read Annie Dillard before, I recommend starting with \"Teaching a Stone to Talk,\" whose concise essays will quickly give you a taste of what she does best."}, {"review_sentiment": 5.0, "review_text": "One of the finest books I have ever read."}]}, "authors": ["Annie Dillard"], "isbn": "006092411X", "longitude": -122.3300624, "periods": ["1800s"], "title": "The Living: A Novel", "word_cloud": "here simple summary bunch people live die end real plot felt story go nowhere version reality century hat much actually burn enjoy lot very well write nature writer give sweep historical settlement shore hill mountain take year first permanent european settlement come railroad gold rush settler suffer heartbreaking toil loss moment exuberance exhilaration character travail triumph life strong sense place attract especially reader interested read colorful language set history settlers incredibly difficult challenge primitive forest present forest slowly beat fit start set broader economic history country impact century capitalism people development somewhat lack artistry word hide hopeless despair fancy title live morose view world beautifully portray liquid letter laid bare earth fatalism live die life generation completely disagree perspective think draw portrayal history home state valuable put depressed leaf longest ever take finish language stay seem people give rating base haunt cast versus quality thinking word understand base latter brilliance diverse character thread story move seamlessly rapture creation various despair live lyrical take outside wonderfully write poetic westward migration c not easy light heat jot character relationships confusing miss majority story prose least favorite slog huge fan write style fortunately disappoint level gorgeous imagery dispense mean carefully construct sentence full rich language clever juxtaposition highlight insight laugh loud multiple time often enough consider size comparable gigantic old growth tree painstakingly underwhelming standard literary fiction summary jacket describe action expect see story sprawl sprawl rather epic opinion far many character proactive enough truly come alive meet surprising end ask best answer settlers live century finish leave knowledge time period appreciation value story structure feel relief recommend reader fan atmospheric historical never recommend start concise essay quickly taste best finest ever", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In a town near Washington's Puget Sound, fishermen, loggers, surveyors, miners, farmers, shopkeepers, and others struggle to survive as the town is born, grows, and enjoys a financial boom. \r\n\r\nThe Living is American author Annie Dillard's first novel, a historical fiction account of European settlers and a group of Lummi natives in late 19th century Washington, published in 1992. The main action of the book takes place in the Puget Sound settlements of Whatcom, Old Bellingham, Sehome, and Fairhaven, which would later merge to form the city of Bellingham, Washington.\r\n\r\nAs research for the novel, Dillard lived for five years in the Bellingham area, much of that time in 19th century era accommodations\r\n\r\n\"An august celebration of human frenzy and endurance [and]...an invigorating, intricate first novel. Annie Dillard [shows a] tremendous gift for writing in a genuinely epic mode.\" The New York Times", "asin": "006092411X", "rank": "283085", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/31yta9m2UXL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}