{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 946, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "It has been a long time since I read a novel this engaging, this moving, this beautifully written. Kingsolver wields the English language like a maestro. One finds on nearly every page a phrase, a sentence, a passage, that brings the story of writer/cook/stenographer/artist’s assistant Harrison William Shepherd alive in living, breathing, heart rending color. In so doing, Kingsolver manages to render one man’s life as if it were a mosaic made all the more beautiful for the various and mysterious missing pieces. Supporting players include renowned artists Frida Kahlo and Diego Rivera, as well as Russian revolutionary, Leon Trotsky. The novel is set in Mexico during the 1930s and early 40s, and later in the U.S.A. during the House Un-American Activities Committee hearings of the late 40s/early 50s. “The Lacuna” truly is a modern classic."}, {"review_sentiment": 1.0, "review_text": "This is not my style of book so I can not give it a good rating.  I always finish books but I could no get half way thru this one."}, {"review_sentiment": 4.0, "review_text": "If you are familiar or are interested in learning more about Mexican culture and history you will love this book.  Some of the parts were drawn out and some characters not fully developed."}, {"review_sentiment": 5.0, "review_text": "A favorite of Kingsolver's books."}, {"review_sentiment": 5.0, "review_text": "I've enjoyed every minute of this book.  I especially have appreciated the insight into Freda Kahlo and Diego Rivera."}, {"review_sentiment": 5.0, "review_text": "Another gem from the great Barbara Kingsolver. I only wish she had written more books!"}, {"review_sentiment": 3.0, "review_text": "Because I can never just leave a book unfinished. So long and drawn out and a strange story. Yet, Kingsolver still has a way with words."}, {"review_sentiment": 5.0, "review_text": "In spite of the length of this book, I thoroughly enjoyed it.  I am very familiar with the art and a big Kingsolver fan.  I loved the added ending.  I was in tears and then hope came shining through.  I would recommend this book to any serious reader."}, {"review_sentiment": 5.0, "review_text": "excelelnt and engaging."}, {"review_sentiment": 1.0, "review_text": "So affordable price to buy such a practical product, very value, I'm going to buy a friend gave me as a birthday present.  Got this as a present for my Mom & she loves it.  The price is perfect!! Thank you  Couldn't be happier with the results  Super product and easy to work with  Get these, you won't be disappointed."}]}, "authors": ["Barbara Kingsolver"], "isbn": "0060852585", "longitude": -99.1333416, "periods": ["1900s"], "title": "The Lacuna: A Novel", "word_cloud": "long time engage move beautifully write wields english language find nearly page phrase sentence passage bring story assistant alive living breathe heart rend color manage render man life mosaic make beautiful various mysterious miss piece support player include renowned artist well revolutionary set early later hearing late truly modern classic style give good rating always finish half way familiar interested learning mexican culture history part draw character fully develop favorite king solver enjoy minute especially appreciate insight gem great wish write never leave unfinished so long drawn strange story yet still way word spite length thoroughly enjoy familiar art big fan love add end tear hope come shin serious excellent engage so affordable price practical product value go friend give birthday present present love price perfect happier result product easy work", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In The Lacuna, her first novel in nine years, Barbara Kingsolver, the acclaimed New York Times bestselling author of The Poisonwood Bible and Animal, Vegetable, Miracle: A Year of Food Life, tells the story of Harrison William Shepherd, a man caught between two worlds—an unforgettable protagonist whose search for identity will take readers to the heart of the twentieth century’s most tumultuous events.\r\n\r\nThe Lacuna contains two very distinct parts. One features a vibrant Mexican landscape with the equally colorful personalities of Rivera, Kahlo, and Trotsky. The other centers more on Harrison's reclusive existence in small-town America and his battle with the House Un-American Activities Committee. Despite the prodigious research that both parts exhibit, critics clearly preferred the former, marveling at Kingsolver's lyrical passages and her expert recreation of 1930s Mexico. A few reviewers also noted instances of sermonizing and inaccurate history. However, the novel's compelling, engrossing story certainly outweighed these minor complaints, and in the end, Kingsolver has created a convincing \"tableau vivant of epochs and people that time has transformed almost past recognition\" \r\n\r\nNew York Times Book Review", "asin": "0060852585", "rank": "73666", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51gtCK-hTiL.jpg", "country": "Mexico", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}