{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 47, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent novel."}, {"review_sentiment": 3.0, "review_text": "For a school project. Weird book. Interesting look into a different world."}, {"review_sentiment": 4.0, "review_text": "It was an enlightening book about  Communism in Vietnam and how political views and personal beliefs can affect relationships. Specifically family relationships."}, {"review_sentiment": 5.0, "review_text": "This is an excellent novel. I enjoyed it so much. The relationships between mothers and daughters parallel with the setting of Vietnam as the home country and Russian the Communist motherland was an interesting look on how devoted the two could be and how easily that devotion can be used against one another. I enjoyed this novel so much. It's the story of a young girl and her family that had been torn apart during the division of Vietnam during the Communist's reformation of the north and her adaption to the various places she lives. Her life is torn between the traditions that have been in her family for generations and the appeal of Western freedom and indolence."}, {"review_sentiment": 4.0, "review_text": "BOOK club selection"}, {"review_sentiment": 4.0, "review_text": "I ordered this book because it was one needed for a class. I was surprised though when I like the book as I don't usually waver from my YA romance books so it was nice to read something new.  At times though I was confused as to when this was happening as we kept being pulled from the past only to be still in her past just steadily closer.Throughout the book you start to feel for the main character and if you're like me you will wonder (sort of SPOILERS) why her uncle is such a jerk and treats her and her mother like they are inconvenient.To be honest I didn't actually finish the book but I do plan to(eventually). There was nothing wrong with the book, I only stopped because I completed the class assignments for this book and then had to start a new book."}, {"review_sentiment": 3.0, "review_text": "I love this story. It's wonderful."}, {"review_sentiment": 4.0, "review_text": "Duong Thu Huong’s Paradise of the Blind covers the impact of the Communist regime on a family with an effective portrayal of family strife that doesn’t get didactic.  Hang is the central character, a North Vietnamese woman we see initially as an “exported worker” in the Soviet Union living in a Spartan dormitory.  She receives a communication from an uncle in Moscow, a party official, which leads to her decision to take a rail cross-country to visit him.The novel alternates between that trip and the sundering of her family.  Hang’s story has three centers of gravity; her almost inhumanly self-sacrificing mother, Que; her full-of-himself maternal uncle, Chinh; and her paternal aunt, Tam.  Her family being torn asunder by those centers began when her maternal uncle, a soldier who had returned from the war and became a local political leader, turned on her father on the grounds that the latter came from a landlord family and forced her mother to denounce him.  The uncle is in charge of local political discipline during a disastrous period of land reform after the end of what the Vietnamese called the American War.  When policies are changed and the uncle is disgraced, the village’s enmity focuses on the mother.Chinh’s nature is revealed early on when he complains to his sister about her meeting with Tam, her sister-in-law.  Although ostensibly an issue of political rectitude, he then complains about the impact it could have on his career.  He does this a few times.  Han’s reaction to that is to blame herself for not raising him right (she was the elder sibling); nothing that Chinh does shakes that loyalty.  When he falls on harder times, she devotes herself to his children even above Hang, which causes one of the main conflicts of the plot.  Part of that choice is because of her issue with Hang’s relationship with Tam.The embitterment of Tam against Chinh (and to some extent Que) because of what he did to her brother is balanced out by an attempt to claim the loyalty of Hang.  Tam, despite having been deprived of everything as a class enemy, was able to work her way back up to a measure of prosperity and takes Hang under her wing, supporting her financially and exhorting her to make the most of herself.  Since Tam is childless and Hang her only sibling’s only child, Tam regards Hang as her family’s last gasp.The characterizations are vivid and well-drawn.  Although Que’s self-sacrifice could have seemed unreal in the hands of a less skilled author, the portrayal of the mix of wanting to hold on to her remaining family and her resentment of the influence on Tam makes her tendency to accord a higher priority to Chinh’s children not unrealistic.  Tam’s story shows her indomitable will and one almost gets the sense that her anger at what had been done her family had much to do with keeping her going.Even the minor characters are well-drawn.  For example, the portraits of the people promoted as political commissars in the village who were no-accounts prior to their promotion have back stories that are rich and engaging."}, {"review_sentiment": 3.0, "review_text": "It is rather slow and the translation seems unusual."}, {"review_sentiment": 4.0, "review_text": "I bought this book for my Contemporary World Fiction class but I didn't hate reading it. I don't know if I would have read it on my own and I don't think I will read it again."}]}, "authors": ["Duong Thu Huong"], "isbn": "0060505591", "longitude": 0.0, "periods": ["1900s"], "title": "Paradise of the Blind: A Novel", "word_cloud": "excellent school project different world enlighten political view personal belief affect relationship specifically family relationship excellent enjoy much relationship mother daughter parallel set home country motherland interest look devote easily use enjoy much story young girl family tear apart division reformation north adaption various place live life torn tradition family generation appeal western freedom indolence club selection order need class surprise like usually waver romance nice something new time confuse happen kept pull past still steadily feel main character wonder sort uncle jerk treat mother honest actually finish plan eventually nothing wrong stop complete class assignment start new love story wonderful cover impact regime family effective portrayal family strife didactic central character vietnamese woman see initially export worker living dormitory receive communication uncle party official lead decision rail visit alternate trip sunder family story center gravity almost inhumanly mother maternal uncle paternal aunt family torn asunder center begin maternal uncle soldier return war become local political leader turn father ground latter come landlord family force mother denounce uncle charge local political discipline disastrous period land reform end call policy change uncle disgrace village enmity focus nature reveal early complains sister meet ostensibly political rectitude complains impact time reaction blame raise right elder sibling nothing shake loyalty fall harder time devote child even cause main conflict plot choice issue relationship embitterment extent brother balance attempt claim loyalty deprive everything class enemy able work way back measure prosperity take wing support financially exhort childless sibling child regard family last characterization vivid unreal hand le skilled author portrayal mix want hold remain family resentment influence make tendency accord higher priority child unrealistic story show indomitable almost get sense anger do family much keep minor character example portrait people promote political commissar village prior promotion back stories rich engage rather slow translation seem unusual buy class hate read know think", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Paradise of the Blind is an exquisite portrait of three Vietnamese women struggling to survive in a society where subservience to men is expected and Communist corruption crushes every dream. \r\n\r\nThrough the eyes of Hang, a young woman in her twenties who has grown up amidst the slums and intermittent beauty of Hanoi, we come to know the tragedy of her family as land reform rips apart their village. When her uncle Chinh‘s political loyalties replace family devotion, Hang is torn between her mother‘s appalling self–sacrifice and the bitterness of her aunt who can avenge but not forgive. Only by freeing herself from the past will Hang be able to find dignity –– and a future.", "asin": "0060505591", "rank": "124317", "city": "Hanoi", "image": "https://images-na.ssl-images-amazon.com/images/I/51Bk7gz-htL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}