{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 51, "rating": 3.6, "reviews": [{"review_sentiment": 2.0, "review_text": "Filthy and sex obsessed.  Really not much good."}, {"review_sentiment": 1.0, "review_text": "Just one gratuitous chapter after another. The story never progresses and never seems to achieve a purpose other than rubbing our noses in the misery and sexual exploits of the main character."}, {"review_sentiment": 5.0, "review_text": "Great book, but if you speak Spanish I suggest reading it in original language. A lot is lost in translation"}, {"review_sentiment": 5.0, "review_text": "Vivid. Reader is transported to the underbelly of Castro's Cuba. A close-up look at life in Havana complete with the sights, sounds and smells of the city and its colorful inhabitants. Contemporary urban poetry. A must read."}, {"review_sentiment": 5.0, "review_text": "I like this author.  Interesting stories showing how Communist Cuba has failed her people and what daily life is like.  Really graphic sexual scenes (some of you are a little prudish and may be offended by his writing).."}, {"review_sentiment": 5.0, "review_text": "amazing bookmust read for Cubaphiles"}, {"review_sentiment": 4.0, "review_text": "We’re in Havana during the economic crisis of the early 1990’s when people appear with buckets to ask for slices of meat off of a dead horse. The political situation has changed to the point where police come by to see rafters off and wish them good luck on their dangerous trip to Florida. We follow the main character, a man in his early 40’s -- he constantly reminds us how old he is. He used to be a journalist who traveled in Europe with a former artist wife but he’s ended up divorced, back in Havana and working hand to mouth to survive. What does he do? When he can find work, it is in slaughterhouses, garbage collection and factories. He also picks up cans from trash, deals drugs and fishes by floating in an inner tube along the beach. He captures pigeons for sacrifice in santeria ceremonies – there’s a job description for you. Often he lives off his women and even acts as a pimp. He’s spent time behind bars.Housing is atrocious: sewers back up into the first floors; water and electricity operate sporadically; elevators never work, so people walk up 9- and 12-story buildings daily, lugging buckets of water. He has an eye for the women, whether they are married or not, and there is a lot graphic sex to the point where some will find the book pornographic. Up to a dozen families share a bathroom and some folks don’t bother waiting, so they use the stairway, the elevator or the roof. It’s not a pretty picture. Daily life is a constant struggle to get food and basic necessities such as soap. And in our narrator’s case, his necessities include beer, rot-gut rum and cigarettes. The crowded conditions lead to social dysfunction, spousal abuse, murders, alcoholism and suicides.Our narrator tells us he is mulatto, “but nearly white,” and he loves to make politically incorrect statements; a less kind assessment would say he is racist, homophobic and misogynistic. The story is spiced with black humor. A kindred mystery novel covering the same down-and-out crowd at about the same point in history is Cold Havana Ground by Arnaldo Correa, which I have reviewed."}, {"review_sentiment": 1.0, "review_text": "Couldn't finish it- it was like reading a porn novel written by a 15 year old that had visions of being Hemingway & misses by a mile. In fact, I noticed it today and I'm trying to figure out how to dispose of it. A waste of time and money."}, {"review_sentiment": 5.0, "review_text": "Excellent -- though a bit too raunchy at times for my taste. I've been to Havana, and the reality of life depicted in this book rings true and jives well with my own impressions: terrible misery and hopelessness lurking behind the facades of beautiful buildings.As for raunchiness: sex is the only outlet for happiness for those living in what is in essence a police state."}, {"review_sentiment": 5.0, "review_text": "Cuba is a place I have always wanted to visit.  Unfortunately, our government has forbidden ordinary Americans from traveling to Cuba for over five decades, and although there has been talk of that policy changing for several years now, it seems to be just talk.  Agricultural and trade missions can come and go to Cuba with relative ease, and some people are allowed to go there for educational reasons -  but for the average tourist the trip still can't be made legally.  Rich Americans (for whom the rules are always different - or at least enforced differently) have floated their yachts in and out of the island's harbors for years, and many skirt the law going to Montreal or Mexico and then flying to Havana.There appear to be no military or secret concerns that would warrant keeping Americans away from Cuba other than the fact that the Cuba lobby in Florida, an extremely powerful political force, doesn't want to legitimize Castro by normalizing relations with the island nation.  They still see him as a \"temporary\" leader who will one day fall, allowing them to return home and reclaim their confiscated property.  Castro has been in power in Cuba since the Eisenhower administration, and most of these angry Cuban-Americans were born in the United States after the revolution.It is because some of the younger Cuban-Americans are beginning to accept reality that our government is finally talking about normalizing relations with our largest neighbor in the Caribbean.Fifty years of saber-rattling and boycotts by the United States have had a harsh impact on the economy of Cuba and the lives of its people.  The Soviet Union subsidized the island to a great extent until the mighty Soviet Bear collapsed in 1991.  It was at that point that things went from bad to worse for the people struggling to survive in Cuba.I have recently finished reading Dirty Havana Trilogy by Cuban journalist and writer Pedro Juan Gutierrez. It is a lengthy volume of vignettes about life and poverty in Cuba during the early 1990's, the period just after the collapse of the Soviet Union.  All of the very short stories in the book describe the lives and living conditions of the common people, and most involve Gutierrez himself and the denizens of the building in which he lives.Pedro Juan Gutierrez portrays himself in terms of being an ex-journalist who is barely surviving in one of many shacks that occupy the roof of a decaying old apartment house along the Malecon - Havana's famous sea wall.  He makes a meager living by selling produce that he brings in illegally from the countryside, trafficking in various black market items, encouraging his girlfriends to go out and \"hustle\" along the Malecon, and fishing from an inner-tube for days at a time in the dirty water that is Havana's harbor.  At one point during this time Gutierrez is prostituting himself (to women only) and is arrested and imprisoned for two-and-a-half years.The author describes life in Cuba in stark and very tragic terms.  Most of his tales revolve around sex, usually involving people living in squalor and who have no sanitation or means of keeping clean, and decaying buildings.  People and buildings fall apart after years of neglect, day-by-day or sometimes all at once.  Gutierrez describes suicides, people sleeping twenty to a room on floors - with some having sex in the dark while the rest listen or try not to listen, and hallways and stairwells littered with human excrement because a water shortage has made the toilets useless.Yet, almost amazingly, Gutierrez weaves his way through all of the suffering and filth and makes sense of it. He is describing people who are intent on getting by, despite their circumstances, just like people everywhere.  His account of life in Cuba in the 1990's is just that - a depiction of life.  His tales are well crafted and powerful, and their power comes from the author's ability to understand his own experiences and express them with brutal honesty.And with all of that, I still want to visit Cuba.  The island was a leading force in the shaping of 20th century American history with its splendid casinos built and run by Meyer Lansky and other infamous figures of  the American mob, the Hemingway connection, the successful revolution led by a small boatload of young brave hearts with names like Castro and Guevara, the failed Bay of Pigs Invasion, the Cuban Missile Crisis, the numerous failed attempts by our government to kill Castro - and his possible retaliation by having some mysterious involvement in the assassination of President Kennedy, the Mariel Boat Lift, and the refugees who continue to try to reach the shores of the United States on small boats, rafts, and inner-tubes.The world is changing.  Americans and their dollars are now welcome in many places where they would have once been banned - by our own government.  Today we can travel to Russia, China, and even Vietnam.  It is well past time for the government of the United States to quit protecting us from ourselves and allow unfettered humanitarian and tourist travel to Cuba.The Cold War is over."}]}, "authors": ["Pedro Juan Gutierrez"], "isbn": "0060006897", "longitude": -82.3658671, "periods": ["1900s"], "title": "Dirty Havana Trilogy: A Novel in Stories", "word_cloud": "sex obsess really much good just gratuitous chapter story never progress never seem achieve purpose rub nose misery sexual exploit main character speak spanish suggest read original language lot lose translation transport underbelly look life complete sight sound smell city colorful inhabitant contemporary urban poetry like author show fail people daily life graphic sexual scene little prudish offend write amaze book must cubaphiles economic crisis early people appear bucket slice meat dead horse political situation change point police come see rafter wish good luck dangerous trip follow main character man early constantly remind old use journalist travel former artist wife end divorce work hand mouth survive find work slaughterhouse garbage collection factory also pick can trash deal drug fish float inner tube beach capture pigeon sacrifice santeria ceremony job description live woman even act pimp spend time atrocious sewer back first floor water electricity operate sporadically elevator never work people walk building daily lug bucket water eye woman married lot graphic sex point find pornographic dozen family share bathroom folks bother wait use stairway elevator roof pretty picture life constant struggle food basic necessity soap narrator case necessity include beer rum cigarettes crowded condition lead social dysfunction spousal murder alcoholism narrator tell mulatto nearly white love make politically incorrect statement le kind assessment racist homophobic misogynistic story spice black humor kindred mystery cover crowd point history review read porn write year old vision miss mile fact notice today try figure waste time money excellent bit raunchy time taste reality life depict ring true jive well impression terrible misery hopelessness lurk facade beautiful raunchiness sex outlet happiness live essence police state place always want visit unfortunately government forbidden ordinary travel decade talk policy change several year seem talk trade mission come go relative ease people allow go educational reason average tourist trip still legally rich rule always different least enforced differently float yacht island harbor year many skirt law go fly appear military secret concern keep away fact lobby extremely powerful political force want legitimize normalizing relation island nation still see temporary leader day allow return home reclaim confiscate property power administration angry bear younger begin accept reality government finally talk normalize relation largest neighbor year boycott harsh impact economy live people subsidize island great extent mighty soviet collapse point thing go bad worse people struggle survive recently finish read journalist writer lengthy volume vignettes life poverty early period collapse short describe live living condition common people involve denizen build portray term barely survive many shack occupy roof decay old apartment house famous sea wall make meager live sell produce brings illegally countryside traffic various black market item encourage girlfriend go hustle along fish day time water harbor point time prostitute woman arrest imprisoned author describe life stark tragic term most tale revolve sex usually involve people live squalor sanitation mean keep clean decaying building building fall apart year neglect sometimes describe suicide people sleep twenty room floor sex dark rest listen try listen hallway stairwell litter human excrement water shortage make toilet almost amazingly weave way suffer filth make sense describe people intent get circumstance people everywhere account life depiction life tale well craft powerful power come author ability understand experience express brutal still want visit island lead force shaping century american history splendid casino build run infamous figure american mob connection successful revolution lead small boatload young brave heart name fail numerous fail attempt government possible retaliation mysterious involvement assassination refugee continue reach shore small boat raft world change dollar welcome many place government travel even vietnam well time government quit protect unfettered humanitarian tourist travel", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Banned in Cuba but celebrated throughout the Spanish-speaking world, this picaresque novel in stories chronicles the misadventures of Pedro Juan, a former Cuban journalist living from hand to mouth in the squalor of contemporary Havana, half disgusted and half fascinated by the depths to which he has sunk. \r\n\r\nLike the lives of so many of his neighbors in the crumbling, once-elegant apartment houses that line Havana's waterfront, Pedro Juan's days and nights have been reduced by the so-called special times - the harsh recession that followed the Soviet Union's collapse - to the struggle of surviving the daily grit through the escapist pursuit of sex. Pedro Juan scrapes by under the shadow of hunger - all the while observing his lovers and friends, strangers on the street, and their suffering with an unsentimental, mocking, yet sympathetic eye.", "asin": "0060006897", "rank": "658525", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51kFEIjQ3ZL.jpg", "country": "Cuba", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}