{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 318, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "It’s so much more and different than the review title, but the themes of pleasure and pain, conformity and rebellion are there... just well-written and with full rich characters."}, {"review_sentiment": 5.0, "review_text": "Great book mixing sex and spirituality. If you have seen my reviews, I love everything everyone writes. You should not judge others people creativity if you have none."}, {"review_sentiment": 5.0, "review_text": "I was not a big fan of the Alchemist but this book spoke to me. It was recommended by a friend and is a must read."}, {"review_sentiment": 5.0, "review_text": "Amazing book with similar principles as The Alchemist, but from the insight of a motivated prostitute.  Wonderful hearing how a young girl ends up in such a profession, the thoughts on it from a worldly view, and an overall good read.  I would recommend!"}, {"review_sentiment": 1.0, "review_text": "Totally disappointed with this book. Not what I expected to read from Paulo Coelho. Had to stop reading it. I practically threw the book into trash. I even did not want it to be included in my library or anyone I know read it."}, {"review_sentiment": 5.0, "review_text": "This is a pretty good book, I was pleasantly surprised. It's well written, fun to read, and there is a message that you can take away from the book if you so choose to do so.I'll definitely be on the lookout for other books by the same author."}, {"review_sentiment": 5.0, "review_text": "Another great read. I recommend."}, {"review_sentiment": 5.0, "review_text": "Coelho brings together body, mind, and spirit in ways that surprise until the last page of the novel. Love triumphs simply and profoundly."}, {"review_sentiment": 5.0, "review_text": "Love this book!"}, {"review_sentiment": 5.0, "review_text": "Great purchase"}]}, "authors": ["Paulo Coelho"], "isbn": "0060589280", "longitude": 0.0, "periods": ["1900s"], "title": "Eleven Minutes: A Novel", "word_cloud": "much different review title theme pleasure pain conformity rebellion full rich character mix sex spirituality see review love everything everyone write judge others people creativity none big fan speak recommend friend amaze similar principle insight motivate prostitute hearing young girl end profession thought worldly view overall good totally disappointed not expect stop reading practically throw trash even want include library anyone know pretty good pleasantly surprise well write fun message choose definitely author great recommend bring together body mind spirit way surprise last page triumph simply profoundly great purchase", "genres": ["Fiction & Literature"], "summary": "Eleven Minutes is the story of Maria, a young girl from a Brazilian village, whose first innocent brushes with love leave her heartbroken. At a tender age, she becomes convinced that she will never find true love, instead believing that “love is a terrible thing that will make you suffer. . . .” \r\n\r\nA chance meeting in Rio takes her to Geneva, where she dreams of finding fame and fortune.\r\nMaria’s despairing view of love is put to the test when she meets a handsome young painter. \r\n\r\nIn this odyssey of self-discovery, Maria has to choose between pursuing a path of darkness—sexual pleasure for its own sake—or risking everything to find her own “inner light” and the possibility of sacred sex, sex in the context of love.", "asin": "0060589280", "rank": "28162", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/51ISPaKVWeL.jpg", "country": "Geneva", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}