{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 31.2253441, "ratings": {"num_ratings": 58, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "Great survey history of a fascinating city."}, {"review_sentiment": 5.0, "review_text": "Shanghai: the Rise and Fall of a decadent City by Stella Dong is a fantastic book! Honestly, the negative reviews I found here made me hesitate before buying it, but after I got the book, I could hardly put it down. It is NOT confusing, nor bombastic. It is also NOT antiseptic academic history, not clinical notes from the autopsy of a bygone era, but a motion picture of life in Shanghai from 1842 through 1949. In a lively, journalistic style, Ms Dong writes of the situation on the ground in the city at the time. She provides adequate background and context for the reader to get a clear sense of the developments and their meaning. Indeed, even though it is a Shanghai history, Ms. Dong provides considerable information on the events taking place within China that had an impact on the City of Mudflats. So although it concentrates of Shanghai the narrative is not myopic; more a Shanghai-centric history of modern China. Such a perspective is more than reasonable, considering that Shanghai was the city that largely set the tone for the whole country's epic advance into the modern world. This is a sweeping history that covers more than a century of dramatic development, change and great turmoil. If you want details about the rise and fall of the Taiping Heavenly Kingdom or a blow-by-blow account of the convoluted feuds between warlords in China's provinces the 1910s and 1920s, seek out some more narrowly focused books. But even if you ARE seeking details of one or other specific facet of China's post-1840 history, this volume would be, I think, an excellent place to acquire a general picture of events in that crucial century."}, {"review_sentiment": 5.0, "review_text": "Admire Sally Dong's ability to give such a detailed, faithful and interesting account of the rise and fall of Shanghai before China's liberation. A Shanghai born and Shanghai bred person myself, I enjoyed reading the book all the way through to the last page."}, {"review_sentiment": 5.0, "review_text": "A great book for those of us that never knew thetrue story of Shanghai."}, {"review_sentiment": 2.0, "review_text": "I cannot give this book anything but a mediocre review, for that is how it strikes me in its writing style and research which consists of skimming other people's (secondary) resources.Stella Dong is particularly skewed in her portrayal of foreigners as all living in luxury with no knowledge of the local language. Thousands of foreigners, working for banks, businesses and the Shanghai Municipal Council, lived in modest circumstances with the servants required by the Chinese Land Regulations governing foreigners, and spoke the local language as part of heir jobs.This is a poorly written book and researched book which does not reflect well on the publisher. Its sales will be due to its interesting subject and publisher's advertising."}, {"review_sentiment": 3.0, "review_text": "Seems like a good book, but I hate that it has no research of primary sources and no footnotes/endnotes at all. If you are reading this for fun and general knowledge, it is a good book. If you are a historian and want to quote this... it's not a very reputable book to do so (in the sense that it does not follow the typical academic format where every claim is justified with quotations). Still, I think the author does a good job in portraying Shanghai and the book is full of insights and colorful stories. Fun read."}, {"review_sentiment": 4.0, "review_text": "I appreciated the backstory this book provided on Shanghai and it was a fantastic pre-trip read. The writing gets bogged down in the details of the various revolutions, but the overall writing is well done and paints a bewitching picture of a fast-moving and ever-evolving city from the mid 1800's onward."}, {"review_sentiment": 4.0, "review_text": "Too much detail.  I have no idea who some of the characters are. If I was Chinese and had known the history of China I would have a better understanding of the complete story."}, {"review_sentiment": 4.0, "review_text": "Read it after I had spent a summer living there, nice to know the history, presented well."}, {"review_sentiment": 5.0, "review_text": "Fantastic piece of history and well written. Love this."}]}, "authors": ["Stella Dong"], "isbn": "0060934816", "longitude": 121.4888922, "periods": ["1800s", "1900s", "Recent Releases"], "title": "Shanghai : The Rise and Fall of a Decadent City 1842-1949", "word_cloud": "survey history fascinating fantastic negative review find make hesitate buying get hardly confuse bombastic also antiseptic academic history clinical note bygone era motion picture life lively journalistic style write situation ground time provide adequate background context get clear sense development mean indeed even history provide considerable information event take place impact concentrate narrative myopic history modern such perspective reasonable consider largely set tone whole country epic advance modern world sweeping history cover century dramatic development change great turmoil want detail account convolute feud warlord province seek narrowly focus even seek detail specific facet history volume excellent place general picture event crucial century ability give detail faithful interesting account liberation born breed person enjoy read way last page great never know the true story give anything mediocre review strike write style research consist skim people secondary particularly skew portrayal foreigner live luxury local language thousands foreigner work bank business live modest circumstance servant require chinese govern foreigner speak local language part poorly write research reflect well publisher sale due interesting subject publisher advertising seems good hate research primary source reading fun general knowledge good historian want quote reputable sense typical academic format claim justify quotation still think author good job portray full insight colorful story appreciate backstory provide fantastic write get bogged detail various revolution overall write well do paint bewitch picture mid onward too much detail idea character chinese known history understand complete story spend summer living nice know history present well fantastic piece history well write", "genres": ["History", "WWII"], "summary": "Transformed from a swampland wilderness into a dazzling, modern-day Babylon, the Shanghai that predated Mao′s cultural revolution was a city like no other: redolent with opium and underworld crime, booming with foreign trade, blessed with untold wealth and marred by abject squalor.\r\n\r\nJournalist Stella Dong captures all the exoticism, extremes, and excitement of this legendary city as if it were a larger-than-life character in a fantastic novel.", "asin": "0060934816", "rank": "862670", "city": "Shanghai", "image": "https://images-na.ssl-images-amazon.com/images/I/41Zt9ccVjUL.jpg", "country": "China", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}