{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 320, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "This is an amazing accounting of these historical events that almost defies belief that they actually occured. I have been exceedingly rewarded for this purchase."}, {"review_sentiment": 5.0, "review_text": "Good book"}, {"review_sentiment": 4.0, "review_text": "This book is a very interesting and in depth review of medieval crusades and the powerful men who wielded the swords. I found it quite complicated in following the timelines and locations so using a historical map (included in the book) helpful. I also tracked the major event dates by building a diagram of sorts. This seemed make the reading flow better. All in all, it is a fascinating time and illustrates the tumultuous growth of the Christian church. Be prepared to take your time."}, {"review_sentiment": 5.0, "review_text": "Well written account of the crusades, very good narrative at times make you feel you are reading a thriller. Very enjoyable and realistic approach."}, {"review_sentiment": 4.0, "review_text": "Well done - excellent narration, extensive look at the subject matter. Outstanding detail, good background into “cause & effect”. A bit of repetition, but overall, a very good book!"}, {"review_sentiment": 3.0, "review_text": "Entertaining popular history but has some shortcomings that deprived it of a star. The first 500 pages or so cover the first three Crusades. This is where the book really excels. It goes into great detail about these Crusades, not just the military movements but the political, social and religious factors and personalities that influenced the events. And it pays attention to both sides of the conflicts in a fair and even-handed way. If it had continued on in this fashion, it would have rated 4 to 4.5 stars but unfortunately the later Crusades and collateral conflicts aren't dealt with in the same way. The Fourth Crusade gets a few pages, the anti-heretic \"Crusades\" in Europe are brushed off in a paragraph or two, interesting side tales like the Children's Crusade get a sentence. The short treatment of some of these topics also derails some of the author's sweeping pronouncements. For example, he mentions several times that Pope Gregory (I forget which one) had an outsize impact on crusading and changed the way it was viewed, but after one or two pages of hearing about how this Pope would change the historic nature of the Crusades, we are told that he died before his envisioned crusade was even launched. Similar sweeping pronouncements are made about other people and events without the details to back these claims up. It reads as if the author wanted to write a comprehensive one-volume history but realized that the book would run too long so he cut the second half to make it fit."}, {"review_sentiment": 5.0, "review_text": "One of the best presentations of the facts, conditions, motivations and insights of an historical period and perhaps it's defining central 200 year event.  The rationale for the Crusades certainly were a contributing factor to the Reformation theologically.  And getting the facts unvarnished, without self-serving propaganda, is a vitally needed consideration in analysis of today's Christian-Islam relationships and on-going conflicts here and in the Near & Middle East."}, {"review_sentiment": 3.0, "review_text": "Very informative but dry reading."}, {"review_sentiment": 5.0, "review_text": "Without exception this was the best book I have ever read about the Crusades, and one of the best medieval history I have read. It was informative and easy to follow.  There was an entertaining balance of deep history and personal details. The characters were alive in their stories, and military details always related to the people involved - making everything easy to follow.  Entertaining and educational, I would recommended this book to anyone interested in the history of the Crusades."}, {"review_sentiment": 5.0, "review_text": "The author conveyed the many facets of the crusades in perspective and in a manner that was both objective and most entertaining."}]}, "authors": ["Thomas Asbridge"], "isbn": "0060787295", "longitude": 31.243666, "periods": ["Recent Releases", "500-1400s"], "title": "The Crusades: The Authoritative History of the War for the Holy Land", "word_cloud": "amazing accounting historical event almost defies belief actually occur exceedingly reward purchase good interesting depth review medieval crusade powerful men wield sword find quite complicate follow timeline location use historical map include helpful also track major event date build diagram sort seem make reading flow better fascinating time illustrate tumultuous growth church prepare take time well write account crusade good narrative time make feel read thriller enjoyable realistic approach well do excellent narration extensive look subject matter detail good background cause effect bit repetition overall good entertain popular shortcoming deprive star first page cover first really excel go great detail military movement political social religious factor personality influence event pay attention side conflict fair way continue fashion star unfortunately later collateral conflict deal way get page brush paragraph interesting side tale sentence short treatment topic also derail author sweeping pronouncement example mention several time forget outsize impact crusade change way view page hear historic nature tell die envision crusade even launch sweep pronouncement make people event detail back claim read author want write comprehensive realize long cut second half make fit best presentation facts condition motivation insight historical period perhaps define central year event rationale certainly contribute factor theologically get fact unvarnished propaganda vitally need consideration analysis today relationships conflict very informative dry reading exception best ever best medieval informative easy follow entertain balance deep personal detail character alive story military detail always relate people involve make everything easy follow educational anyone interested crusade author convey many facet crusade perspective manner objective entertaining", "genres": ["History"], "summary": "The Crusades is an authoritative, accessible single-volume history of the brutal struggle for the Holy Land in the Middle Ages. \r\n\r\nThomas Asbridge—a renowned historian who writes with “maximum vividness” (The New Yorker)—covers the years 1095 to 1291 in this  big, ambitious, readable account of one of the most fascinating periods in history. \r\n\r\nFrom Richard the Lionheart to the mighty Saladin, from the emperors of Byzantium to the Knights Templar, Asbridge’s book is a magnificent epic of Holy War between the Christian and Islamic worlds, full of adventure, intrigue, and sweeping grandeur.", "asin": "0060787295", "rank": "17042", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51c32NYZEbL.jpg", "country": "Egypt", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}