{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 90, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "One more that I'll add to my Kundera favorites"}, {"review_sentiment": 5.0, "review_text": "Book was recommended after I liked 100 years of solitude.  Very creative and introspective. Good pacing with separate stories. Read it on vacation."}, {"review_sentiment": 5.0, "review_text": "It is impossible to describe what this book is about, but if life were a book, this would be it. Seemingly unrelated, unconnected stories are somehow woven together in a masterful, witty, and unparalleled commentary on what it feels like to live as a human being. After finishing the book the first time, I felt compelled to re-read it immediately (which I had never done before) in order to savor the verbalized described of my own emotions."}, {"review_sentiment": 5.0, "review_text": "A great read the characters are interesting and the story is great."}, {"review_sentiment": 4.0, "review_text": "Quirky, humane, insightful, unpredictable, human. In other words, classic Kundera."}, {"review_sentiment": 2.0, "review_text": "What a piece to get through. Some pieces I loved, and some pieces I was like ok MILAN I get it you're trying to be controversial and Im not buying it."}, {"review_sentiment": 4.0, "review_text": "Decent!"}, {"review_sentiment": 5.0, "review_text": "great read"}, {"review_sentiment": 4.0, "review_text": "good read"}, {"review_sentiment": 5.0, "review_text": "Kundera is a narrative genius."}]}, "authors": ["Milan Kundera"], "isbn": "0060932147", "longitude": 14.4212535, "periods": ["1900s"], "title": "The Book of Laughter and Forgetting", "word_cloud": "add favorite recommend like year very creative introspective good pacing separate story read vacation impossible describe life seemingly unrelated unconnected story somehow woven together masterful witty unparalleled commentary feel live human finish first time felt compel immediately never do order savor verbalize described emotion great character interest story great humane insightful unpredictable human word classic piece piece love piece like ok get try controversial buying decent great good narrative genius", "genres": ["Fiction & Literature"], "summary": "Rich in its stories, characters, and imaginative range, The Book of Laughter and Forgetting is the novel that brought Milan Kundera his first big international success in the late 1970s. Like all his work, it is valuable for far more than its historical implications. In seven wonderfully integrated parts, different aspects of human existence are magnified and reduced, reordered and emphasized, newly examined, analyzed, and experienced.", "asin": "0060932147", "rank": "24619", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51m7o7i%2BrSL.jpg", "country": "Czechia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}