{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1111, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 5.0, "review_text": "👍🏼"}, {"review_sentiment": 5.0, "review_text": "You will love this book and know that it's deserving of the national book award. I never knew or heard of Robert or Patti but feel a kindred spirit to them now. I was born in the same era and loved the same music and love of art. What a great story teller Patti is. Her writing makes you feel you are there. A must read!"}, {"review_sentiment": 5.0, "review_text": "As the title says, it's a bit uneven but still a worthy read.  I've read other comments that the author name-drops continuously, but how else was she to tell this story?  She comes to NY at the exact time that other artists are coming into their own. They were part of her story.As for her relationship with Maplethorp, well, it's just beautifully and lovingly told. This was as remarkable and enduring relationship as any other in the arts. Reading about it was a privilege."}, {"review_sentiment": 5.0, "review_text": "I've read this book so many times.  First in print.  Then I bought the Kindle edition for my phone so I could have it with me always.  Then I saw that there was an unabridged Audible edition that was read by Patti Smith herself.  Her reading is sublime.  And its on my phone and always with me too.  I wish more authors read their own work.  (Toni Morrison has read nearly all of her own books on Audible.)"}, {"review_sentiment": 5.0, "review_text": "Like the blue star that lit their way, Patti and Robert were destined to shine in the heavens with their greatness and celestial beauty. Their story is one of timeless love. A memorable, exquisite read."}, {"review_sentiment": 5.0, "review_text": "This memoir by Patti Smith of her time as a starving artist in New York in the 1970s and her friendship with photographer Robert Mapplethorpe is both surprisingly tender and quite matter of fact.  From listening to her music, I expected this to be much different, more political, more cynical, more philosophical and more \"in your face.\"  Like punk music.  Instead, she has written a tender memoir of her time in New York City at the beginning of her career, and Mapplethorpe's.  The book is also a love story regarding Patti and Robert, despite their conflicting sexual choices. Both had their own  intense artistic vision, but protected the other's work.  Highly recommended, especially to those with an interest in Smith, Mapplethorpe, the punk music scene, or New York in the 1970s."}, {"review_sentiment": 5.0, "review_text": "A beautiful book. Patti Smith tells it like it was. Thank you."}, {"review_sentiment": 5.0, "review_text": "This book was so beautiful"}, {"review_sentiment": 5.0, "review_text": "EASY READ LOVE IT"}]}, "authors": ["Patti Smith"], "isbn": "0060936223", "longitude": 0.0, "periods": ["1900s"], "title": "Just Kids", "word_cloud": "great love deserve national award never know heard feel kindred spirit bear era love music art great story teller writing make title say bit uneven still worthy comment author continuously else story come exact time artist come part relationship well beautifully lovingly tell remarkable enduring relationship art read privilege many time first print then buy edition phone always then saw unabridged audible edition reading sublime phone always wish author work nearly audible blue star lit way destine shine heaven greatness celestial beauty story timeless memorable exquisite memoir time starve artist friendship photographer surprisingly tender quite matter fact listen music expect much different political cynical philosophical face punk music instead write tender memoir time begin career also love story regard conflict sexual choice intense artistic vision protect work recommend especially interest punk music scene beautiful tell beautiful", "genres": ["Memoir"], "summary": "In Just Kids, Patti Smith’s first book of prose, the legendary American artist offers a never-before-seen glimpse of her remarkable relationship with photographer Robert Mapplethorpe in the epochal days of New York City and the Chelsea Hotel in the late sixties and seventies. An honest and moving story of youth and friendship, Smith brings the same unique, lyrical quality to Just Kids as she has to the rest of her formidable body of work—from her influential 1975 album Horses to her visual art and poetry.", "asin": "0060936223", "rank": "8456", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/31PUlcP-LQL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}