{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 21, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "The characters are hard to follow and they don't mesh.  Bellow does to a good job describing Romania during the communist regime, though."}, {"review_sentiment": 4.0, "review_text": "Bellow doesn't do narrative that well; his brilliance is in big ideas. The parts of this novel that deal more with big ideas (ie Chicago setting) are engaging and enjoyable. The parts concerned more with scenes and relationships (ie Romania setting) are a bit tedious. The writing is always excellent, though, if a little pedantic.Dean's December is lower-tier Bellow. For big ideas, I'd recommend Mr. Samler's Planet and Herzog over this one. For simply gorgeous writing, go with Seize the Day. (I haven't read Augie March yet.)"}, {"review_sentiment": 5.0, "review_text": "A brilliant and sensitive man, suffers the slings and arrows of life, and keeps his composure while shepherding his wife through a devastating event. That’s how I would sum up, The Dean’s December, by Saul Bellow. I’ve been a fan of Bellow since reading Mr. Sammler’s Planet in a college American Literature course.  I’ve also read Seize the Day, and his first novel, The Victim. For anyone unfamiliar with Bellow’s work, or who has not read much ‘literary’ fiction, I would recommend starting Bellow with any one of these last three.The Dean’s December is a more complicated read, long on meditative ruminations and short on action, with much of that related in conversations or letters, after the fact. That, however, takes nothing away from this novel. Some writers are sketchy and vague on description, letting the reader fill in the blanks. Some writers provide snapshots, some x-rays, to help us understand the minds of their characters. Bellow does the literary equivalent of a cat scan, thousands of slices, a life examined from 3,000 different angles. The reader feels there, appended to Corde, Dean of an Ivy League Chicago college, as he deals with his wife, who is dealing with her mother’s death, in a repressive Soviet Bloc country (Romania). And if that wasn’t enough, while on his breaks from that, he sits in a poorly-heated room, in a broken down house, dealing long distance with a literary brouhaha he’d brought on himself, over a magazine article he’d written about a young man pushed through a window by a black drug dealer in Chicago. The final complication is provided by an old friend from Corde’s youth, now a word-renowned journalist and interviewer who covers foreign and domestic leaders and pontificates on Sunday afternoon news shows. Spangler provides a little diversion for Corde, but soon after publishes a ‘hit piece’ on him, taking him to task.Through it all Corde put’s his wife’s health and feelings first.Bellow gives us a wonderful story of a moral man and a relationship and some thoughtful insights to what things, in life, are truly important."}, {"review_sentiment": 5.0, "review_text": "Even more than 20 some years after reading it, some of the images remained so vivid for me (the cyclamen as symbol for the soul - go read it to see!) that I still yearn for cyclamen in winter and think of his words. This year, I gave a copy of this book and a cyclamen plant as a Christmas gift to a dear friend, with an explanatory note.Ok - not a literary review, but Bellow's writing gets under one's defenses into one's pysche on that deep a level. We feel the grey chill in eastern Europe, the lines on the faces, in particular, those of the main character's. A very visceral book."}, {"review_sentiment": 4.0, "review_text": "“The Dean’s December” is a nicely constructed novel of breadth and depth.  The Dean is a moral, sensitive character whose various kinds of loves are portrayed:  love for his wife, for his sister, for his childhood friend.  As sort of a counter balance to the Dean’s spirituality, Bellow delights in depicting the details of his aging, unattractive body.  The Dean practices self control, but his moral outrage escapes in his long magazine article about Chicago – its corrupt leadership, and an intelligentsia which does not really take to heart the shortcomings of a society which treats its underclass as expendable.  Sadly, while the novel was published in 1982, the problems of the underclass persist, although there are perhaps more voices drawing attention to this. I suspect I would have been bored by parts of  the Dean’s article, but did enjoy the excerpts in the novel.  The Dean is more impressive as observer and critic than as the source of a coherent philosophy.  Bellow’s prose is often eloquent, but less commonly elegant; there are inspired passages, but it is for character development, ideas, and relationships that I would recommend this novel, and at times  I wished for more editing."}, {"review_sentiment": 5.0, "review_text": "A nightmare of two cities. Bucharest and Chicago are the two hellholes that share our attention in Saul Bellow's novel of 1982. One is the centre of an oppressive police state, the other is troubled by crime, corruption, race conflict, lawyers, the income gap.We see the world with Albert Corde, a journalist and college dean. His wife is a Rumanian scientist. The couple is visiting Rumania because her mother is dying. It happens to be Christmas time. Corde is not the average Bellow protagonist, being of Huguenot and Irish descent.In Chicago, Corde has gotten himself involved in a media brawl over crime and punishment. While hanging out uncomfortably in a cold Bucharest apartment, Corde thinks through his problems at home.He may have acted unwisely by writing articles on a pending murder trial. Without clear reasons, Corde has taken the side of the prosecution. The case is strictly speaking none of Corde's business, even considering that the victim was a student at his school, but now he has put his foot in it. The accused are two black people, and defense has blown things up to political meaning.From this one case, Corde's articles had branched out to other race related stories, involving other crimes, but also other social subjects like run down slum areas and political corruption. He makes enemies all over the spectrum. He offends his sources.Now he is considering a cooperation with a scientific genius who wants him to popularize his environment related findings. His wife encourages him. He is skeptical. Shall he harness himself to a tale that he can't evaluate, that may be nonsense and expose him as a fool?Though the novel doesn't entirely lack Bellow's usual dry humor in many details of speech or description, the plot is as unfunny as the author ever was. In that sense too, it is an unusual Bellow novel. It is also one of his best.The attention to the two locations is divided roughly by half. The chapters dealing with communist reality are as depressing as expected, but I will not make many words about them here. No need to kick a corpse. It wasn't a corpse yet in 1982.Apart from the big cities with their ugliness, a dominant theme is 'family'. The dean and his wife have a curious relationship. They barely have a shared language. She is a stranger in more than one sense. Her mother and other relatives are exotic and distant, despite best intentions. (Since this couple is obviously based on Bellow and one of his wives, it is interesting to compare this Mrs. Corde to the Rumanian ex-wife in Ravelstein!)The dean has a sister, who is the widow of an obnoxious man and the mother of an obnoxious son. Now she gets married again, to a dubious character.The dean doesn't understand himself very well, so how can I? He is a verbose man, who can't express himself clearly, invented by a virtuoso of words, whose ideas are often obscure to me, but who impresses me often with his elaborate constructions. This is one of his best."}, {"review_sentiment": 4.0, "review_text": "The Dean's December is a surprisingly old-fashioned story of East and West.  Corde, the protagonist, is caught between the horrors of living for just a while in Communist Romania and his feelings for home-town Chicago.  Most surprising is his point of view as he observes rather than condemns conditions in this tale of two cities.  While The Dean's December has been called one of Bellow's most depressing works, I found it strangely optimistic. There's a wonderful scene at the end as the couple stares at the heavens at the Palomar observatory.  What could be more positive than that!"}, {"review_sentiment": 2.0, "review_text": "... tapping this scurvy keyboard and getting myself in trouble by criticizing an American icon. Oh well, nasty work but somebody has to etc etc...The simple thing is that Saul Bellow doesn't write very well. He doesn't compose brilliant sentences. He doesn't construct tight plots or taut narratives. By simple stylistic criteria, he's no better at wordsmithing than the average purveyor of pulp fiction by the cartload. He maunders and muses self-indulgently, as if his readers would give him all the time in the world as they might a beloved grand uncle with a failing memory, in honor of his Nobel Prize. In his youthful novels about his useless self, he was charmingly crass and brash. A youthful reader could read himself comfortably into Augie March and be tolerantly self-abusive. This novel, The Dean's December, is anything but youthful. The title tells most of it. This is a weary old dude's meandering epitaph for his own energy, a novel about Death interspersed with jeremiads about a society - two societies really, America and Romania - hardly lively enough to sustain a worthwhile Life. The narrative elements include an old woman's death in a 'communist' hospital, a young man's death by murder in seedy South Chicago, the metaphorical death of the Dean's self-expectations, and the deadly friction of the Dean's relationships with the bureaucracies both of his school in Chicago and his Romanian wife's society.Somewhere in this sprawl of words there is probably a novel, or perhaps a couple of well-crafted novellas. Was Bellow too prominent by 1982 for Harper and Row to assign him an editor? And somewhere among Bellow's jabs and jibes at class warfare in Chicago and America, there are probably some pointed needles, but they are lost in the haystack."}, {"review_sentiment": 2.0, "review_text": "The dialogue and endless introspection offered in this book gets tiresome quickly.  Bellow's best work came before his Nobel Prize and this is an example of his weakening powers -- when his ideas outweighed action to create tedious novels."}, {"review_sentiment": 2.0, "review_text": "If you have not read anything by Saul Bellow, don't start with this book.  It is pedantic and involves characters about whom it is difficult to care very much."}]}, "authors": ["Saul Bellow"], "isbn": "0060148497", "longitude": 0.0, "periods": ["1900s"], "title": "The Dean's December", "word_cloud": "character hard follow mesh good job describe communist regime narrative well brilliance big idea part deal big idea ie set engage enjoyable part concern scene relationship ie set bit tedious writing always excellent little big idea recommend simply gorgeous write go angie yet brilliant sensitive man suffers sling arrows life keep composure shepherd wife devastate event fan bellow read college american course also first anyone unfamiliar work much literary fiction start last complicate long meditative rumination short action much related conversation letter fact however take nothing away writer sketchy vague description let fill blank writer provide snapshot help mind character literary equivalent cat scan thousand slice life examine different angle feel append college deal wife deal death repressive soviet country enough break sits room break house deal long distance literary brouhaha bring magazine article write young man push window black drug dealer final complication provide old friend journalist interviewer cover foreign domestic leader pontificate afternoon news show provide little diversion soon publish hit piece take put wife health feeling give wonderful story moral man relationship thoughtful insight thing life truly important even year read image remain vivid cyclamen symbol soul go see still yearn cyclamen winter think word year give copy cyclamen plant gift dear friend explanatory literary review write get defenses psyche deep level feel grey chill eastern line face particular main character visceral nicely construct breadth moral sensitive character various kind love portray wife sister childhood friend sort counter balance spirituality delight depict detail age unattractive body practice self control moral outrage escape long magazine article corrupt leadership intelligentsia really heart shortcoming society treat underclass expendable sadly publish problem underclass persist perhaps voice draw attention suspect part article enjoy excerpt impressive observer critic source coherent philosophy prose often eloquent le commonly elegant inspire passage character development idea relationships time wish edit nightmare city hellhole share attention center oppressive police state trouble crime corruption race conflict lawyer income see world journalist college wife romanian scientist couple visit mother die happen time average protagonist get involve medium brawl crime punishment hang uncomfortably cold apartment think problem unwisely write article pending murder trial clear reason take side prosecution case strictly speak none business even consider victim student school put accuse black people defense blown thing political case article branch race related story involve crime also social subject run slum area political corruption make enemy offend consider cooperation scientific genius want environment relate finding wife encourage skeptical harness tale expose fool entirely lack usual dry humor many detail speech description plot unfunny author ever sense unusual also attention location divide roughly chapter deal communist reality depress expect make many word need kick corpse yet big city ugliness dominant theme dean wife curious relationship barely share language stranger sense mother relatives exotic distant best intention couple obviously base wive interest dean sister widow obnoxious man mother obnoxious son now get married dubious dean understand well verbose man clearly invented virtuoso word idea often obscure impress often elaborate construction best surprisingly story protagonist catch horror live feeling most surprising point view observe rather condemns condition tale city call depress work find strangely optimistic wonderful scene end couple stare heavens observatory positive tap scurvy keyboard get trouble criticize american icon well nasty work somebody etc etc simple thing write well brilliant sentence construct tight plot taut narrative simple stylistic criterion better wordsmithing average purveyor pulp fiction cartload maunder muse reader time world grand uncle fail memory honor youthful novel useless charmingly crass youthful comfortably tolerantly anything youthful title tell weary old dude meander epitaph energy intersperse jeremiad society society really hardly lively enough sustain worthwhile narrative element include old woman death hospital young man death murder seedy metaphorical death deadly friction relationship bureaucracy school wife sprawl word probably perhaps couple novella be prominent assign editor somewhere jab jibe class warfare probably point needle lose haystack dialogue endless introspection offer get tiresome quickly best work come example weaken power idea outweigh action create tedious novel anything pedantic involve character difficult care much", "genres": ["Fiction & Literature"], "summary": "After being widely portrayed as a virulent racist and a traitor to his city, Professor Albert Corde, dean of the faculty of Journalism, is forced to leave Chicago. Corde is ill-equipped to handle the outrage that faces him, both as the author of several articles on Chicago’s endemic corruption, and as an outspoken figure in the controversial trial of two black men charged with killing a white student. \r\n\r\nTravelling to Bucharest to visit his ailing mother-in-law, he is unable to escape the comparisons in his mind between the corrupt and dehumanizing aspects of the communist regime, and the abandoned streets of his home city. \r\n\r\nMeditating on the juxtaposition between two distant worlds, and obsessing over events that begin to unfold both in Chicago and Bucharest, he begins to concede defeat. In this tormented tale, amid the swirling forces that threaten to drown his humanity, Corde slides ever closer to the brink of desolation.", "asin": "0060148497", "rank": "1589388", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51FJcDTqJJL.jpg", "country": "Bucharest", "story_arc": ["Tragedy", "Things only get worse"]}