{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 195, "rating": 3.4, "reviews": [{"review_sentiment": 3.0, "review_text": "This is a peculiar story, but I rather liked it. It's well written, and the characters are well defined.  I always wanted to turn the next page, which, I guess is the definition of a good book.  It's actually a tad depressing, but not too bad.  I'm the final analysis it's probably the innovative story line that makes this work."}, {"review_sentiment": 5.0, "review_text": "This is like reading two books, one very funny and easy to relate to if you you grew up in the late 70's or 80's. The one book is quite profound. The book is from 1998 but it is more relevant now Than it was even then.Richard and Karen 2 high school students have sex for the first time on a ski outing and later that night now pregnant Karen goes into a 17 year coma.In the 17 years how did her boyfriend and best friends cope, and what did they do with their lives? Once she comes out of the coma, what is Karen's take on the world, and her friends? Is it good, bad, or worse?Then the apocalypse hits and this band six friends and Richard and Karen's daughter live through a year apocalypse, do they make the changes and sacrifices needed to evolve, or do they have a melt down? And what does the way they behave have to do with the future.The authors books are almost always funny, and slightly profound, but this book is amazing."}, {"review_sentiment": 2.0, "review_text": "I was liking the book OK for awhile until about midway when I just got very tired of the constant, forced, not-so-witty banter between these annoying friends who are the book’s central focus. And while I could put up with that in short doses of reading, it all became so ridiculous towards the end with the reintroduction of the ghost narrator who I think Douglas wanted to use as some sort of prescriptive Jesus-like force to teach the vapid friend team how to live correctly (or something like that). It’s truly unbearable at the end. This book was snarky, pretentious and hardly landed a single poignant observation besides pretty obvious stuff like we’re all too into our gadgets, movie rentals, drugs and jobs. What we should be into is apparently striving to “clear a land for a new culture”. Oh no, not this group. Seriously not them. I’d rather have Armageddon forever."}, {"review_sentiment": 4.0, "review_text": "A little far fetched but Coupland always comes up with a good story and a decent cast of characters so this is worth reading, although not up to Hey Nostradamus in my book."}, {"review_sentiment": 4.0, "review_text": "Uggh, the book took forever to read. It would've been better to have read the story in 1997 as originally planned.Douglas Coupland has a way with words, very clever. The plotting and characterization in this book does not live up to his phrasing. It can't be easy to write a book about nihilistic characters because their very nature is dull. He succeeded in some parts, and I wouldn't say failed, but something in that family, in other parts (Well, that was a messy sentence. Apologies).I loved the opening chapters, for that he gets a full five stars. The rest is uneven.I'm very happy I finally got around to reading it, and I would definitely read his other books (the current ones at least)."}, {"review_sentiment": 4.0, "review_text": "I liked this book, but I did not love it and I expected to as I have enjoyed many of Douglas Coupland's books. I expected it to be a lot better, a lot more interesting but it lacked something. Overall it was good, and I like the message, but the book was missing something and I can't quite pinpoint what. If you like his work you will still like this book, but I definitely wasn't as into it as I had hoped and mostly kept reading because I was waiting for something more."}, {"review_sentiment": 1.0, "review_text": "I don't know if it's fair to do a review when my kindle says I'm only 79% in but I don't think I can carry on. If you can go on alone, or have already gone the distance, forget about me; you'll just have to leave me behind to die. I bought this because my son is studying it for A level general studies and I thought I'd have a quick look and try and say something interesting, or at least informed, about it when he came back from school. I have to say, I raced into and through part 1 and then stumbled through part 2 before falling face down and immobile just into part 3. It was just after the book finally became a jumble of random words and I lost consciousness. Now, I have humility in me and every reason to feel it. I haven't written a book. If he's put a shift in, written proper books about deep things and got published and all that, and is famous to boot, who am I to criticise? I could start writing now, I suppose. \"He felt the rough hand clutch his throat tightly before all grew dim...\" No, er, \"It was a dark and stormy night...\" No, been done. \"Imogen  felt his gentle touch skimming down her naked back like a dove's feather..\" No, that's rubbish. See. I shouldn't criticise, I can't do it. Whether Coupland can or not is a moot point, it seems, judging by the reader ratings I can see. This divides its readership rather like the Smiths it references divided audiences. There are those for whom Morrissey is an icon and those for whom he is a pretentious !!!!!! (I'm in the latter camp). Incidentally, I would like Amazon to arrange it for every reader of a one-star rated book to get a refund or the life they've lost back."}, {"review_sentiment": 2.0, "review_text": "Not good really didn't like this book at all. I wouldn't recommend to anyone not even my wicked stepmother. Awful"}, {"review_sentiment": 3.0, "review_text": "The book was very interesting, but the ending feels ..... incomplete... It looks like the author suddenly got bored of the book and just wanted to finish it."}, {"review_sentiment": 5.0, "review_text": "Probably Coupland's best book. It captures perfectly the sense of emptiness and purposelessness that typified the early 90s and is almost a Gen X horror show. The book follows a group of friends who, in different ways, waste all most of the talents and advantages they were gifted with for reasons they can't seem to understand. As time moves on and technology advances they reflect the atomisation of western society as it unfolds. The characters are not unsympathetic but they find themselves adrift playing at roles they are not committed to. Not to spoil it but the book ends very audaciously turning sharply to the metaphysical. That Coupland can do this with with blunt honesty, no excuses or apologies speaks to his confidence and skill as a writer.Lunar Park, by Brett Easton Ellis, manages a similar feat IMO."}]}, "authors": ["Douglas Coupland"], "isbn": "0060391782", "longitude": -123.11554, "periods": ["1900s"], "title": "Girlfriend in a Coma", "word_cloud": "peculiar story rather like well write character well define always want turn next page guess definition good actually tad depress bad final analysis probably innovative story line make work like reading funny easy relate grow late quite relevant even high school student sex first time ski out later night pregnant go year year boyfriend best friend cope live once come world friend be good bad worse then hit band friend daughter live year apocalypse make change sacrifice need evolve melt way behave author almost always funny slightly amaze like ok midway get tire constant force banter annoy friend central focus short dos read become ridiculous towards end reintroduction ghost narrator think want use sort prescriptive force teach vapid friend team live correctly something truly unbearable end snarky pretentious hardly land single poignant observation pretty obvious stuff gadget movie rental drug job apparently strive clear land new culture group rather forever little far fetched always come good story decent cast character worth read take forever story originally way word clever plotting characterization live phrase write nihilistic character nature dull succeed part fail something family part well messy sentence love open chapter get full star rest happy finally get reading definitely current one least like love expect enjoy many expect lot better lot interest lack something overall good like message miss something quite like work still definitely hop mostly kept reading wait something know fair review kindle say think carry alone already go distance forget leave die buy son study level general study think quick look try say something interesting least inform come back school say race part stumble part fall face part finally become jumble random word lose consciousness now humility reason feel write put shift write proper deep thing get publish famous boot criticism write suppose felt rough hand clutch throat tightly grow dim er dark stormy night do felt gentle touch skimming naked back dove rubbish criticism moot point seem judge rating see divide readership rather like reference divide audience icon pretentious latter camp arrange rat get refund life lose back not good really anyone even wicked stepmother awful interesting end feel incomplete look author suddenly get bore want finish probably best capture perfectly sense emptiness purposelessness typify early almost horror show follow group friends different way waste talent advantage gift reason understand time move technology advance reflect atomisation western society character unsympathetic find adrift play role commit not end audaciously turn sharply metaphysical blunt honesty excuse apology speak confidence skill manage similar feat", "genres": ["Fiction & Literature", "Historical Fiction", "Pop Culture"], "summary": "After making love for the first time, high school senior Karen Ann McNeil confides to her boyfriend Richard of the dark visions she's been recently suffering. It's only a few hours later on that snowy Friday night in 1979 that she descends into a coma. Nine months later she gives birth to a daughter, Megan, her child by Richard, the protagonist of this disturbingly funny novel.\r\n\r\nKaren remains comatose for the next seventeen years. Richard and her circle of friends reside in an emotional purgatory throughout the next two decades; passing through careers as models, film special effects technicians, doctors, and demolition experts, before finally being reunited on a conspiracy–driven supernatural television series.\r\n\r\nUpon Karen's reawakening, life grows as surreal as their television show. With apocalyptic events occurring, Karen, Richard, and their friends explore the essential mysteries of life, faith, decency, and existence. Amid the world's rubble they attempt to restore their own humanity.", "asin": "0060391782", "rank": "2534670", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/51MFG83KHNL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}