{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 111, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "This is an excellent, well-written and very readable book about the White Nile, the longer branch that merges with the Blue Nile in Khartoum to firm the Nile River. It starts off with Burton and Speke, Stanley & Livingstone....but then spends too much time (IMO) discussing Gordon, the battles at Khartoum & Omdurman, etc. I felt like the book strayed from its original intent of discussing the exploration of the Nile, so I am k ocking off a star for that."}, {"review_sentiment": 5.0, "review_text": "What a superb book!  Everybody knows \"Dr. Livingston I presume,\" but very few know the circumstances or the overall history of the area we now know as Kenya, Tanzania, and Uganda, and what a spine-chilling history it was! The author writes in beautiful and compelling prose as only the  British can do."}, {"review_sentiment": 4.0, "review_text": "Great history"}, {"review_sentiment": 4.0, "review_text": "This author's in depth descriptions and research we're seamless in their presentation and made me feel a part of his travel.  And with today's internet access to place and people images truly made the history come alive."}, {"review_sentiment": 4.0, "review_text": "Exploration, colonialism and a British disaster in the Sudan. The British defeat in, and re-invasion of, Sudan offer a parallel to the British defeat and re-invasion in Afghanistan decades earlier. It is a good, intense book, but the dense writing style sometimes lost my attention."}, {"review_sentiment": 5.0, "review_text": "Super author; great vocabulary and obviously he did his research."}, {"review_sentiment": 4.0, "review_text": "I read the companion piece, The White Nile, some time back.  The Blue Nile is a story, basically, of the three military actions that conquered the region of this tributary.  There are also a few customary eccentric explorers thrown in.  I wish some pictures of the ancient ruins mentioned throughout and of the  tribesmen, cities, geography and even military forces mentioned had been included."}, {"review_sentiment": 5.0, "review_text": "Rereading Alan Morehead`s  Blue Nile rekindles my interest in an an exciting period  of exploration., and characters presented in such a readable manner. As a follow up to his masterpiece The White Nile it make s an excellent addition  to my library"}, {"review_sentiment": 4.0, "review_text": "look under \"Blue Nile 1972\" and \"White Nile 1972\" on Amazon, for the best editions of these books, which include many color plates, in thesame oversize format as the many histories and biographies published by Hamish Hamilton/Harper during the sixties and seventies. If you like Moorehead, you'll want these editions if you intend to reread these titles. His \"Darwin and the Beagle\" is available in the same format."}, {"review_sentiment": 4.0, "review_text": "I will later. I have not read it yet but I am looking forward to the read..Excellent service nice looking book..thanks, Birte H."}]}, "authors": ["Alan Moorehead"], "isbn": "0060956402", "longitude": 31.243666, "periods": ["1800s", "1900s"], "title": "The Blue Nile", "word_cloud": "excellent readable longer branch merges firm start spend much time discuss battle felt stray original intent discuss exploration k coke star superb everybody know presume know circumstance overall history area know history author write beautiful compel prose british history author depth description research seamless presentation make feel part travel today internet access place people image truly make history alive colonialism british disaster british defeat offer parallel british defeat decades earlier good intense dense write style sometimes lose attention author great vocabulary obviously research companion time story basically military action conquer region tributary also customary eccentric explorer throw wish picture ancient ruin mention tribesman city geography even military force mention include reread rekindle interest excite period character present readable manner follow masterpiece excellent addition library look best edition include many color plate the same oversize format many history biography publish famish sixty seventy want edition intend reread title available format later yet look forward service nice look", "genres": ["History"], "summary": "In the first half of the nineteenth century, only a small handful of Westerners had ventured into the regions watered by the Nile River on its long journey from Lake Tana in Abyssinia to the Mediterranean-lands that had been forgotten since Roman times, or had never been known at all. \r\n\r\nIn The Blue Nile, Alan Moorehead continues the classic, thrilling narration of adventure he began in The White Nile, depicting this exotic place through the lives of four explorers so daring they can be considered among the world's original adventurers -- each acting and reacting in separate expeditions against a bewildering background of slavery and massacre, political upheaval and all-out war.\r\n\r\n\"An Exciting and Unusual Book.\" New York Times", "asin": "0060956402", "rank": "205407", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/61HWKFluEYL.jpg", "country": "Egypt", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}