{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 57, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Excellent overview , bearing in mind things get a bit dated."}, {"review_sentiment": 5.0, "review_text": "Love this book. You are always going to get great quality writing from Simon Winchester. The question with Winchester is  whether or not the story he is telling is of interest to you specifically. This one shifts gears so many times that there is no question but that there will be something of great interest to you. Also, the story of the journey itself is inherently interesting. One thing that I would love to have from Winchester, that he hints at toward the beginning, is a full blown book on Northern Ireland."}, {"review_sentiment": 4.0, "review_text": "Good book, expected a bit more from him after reading his other works, but still, not bad."}, {"review_sentiment": 4.0, "review_text": "Much as I love Simon Winchester he is a bit of a bleeding heart. Did the British Empire do more harm than good? Simon says yes!"}, {"review_sentiment": 5.0, "review_text": "You can hardly go wrong reading a book by Simon Winchester. He is that good."}, {"review_sentiment": 5.0, "review_text": "This was a gift for my husband, and he is spellbound. For him it is fascinating learning about all these remote sites from the past. Most are located in the South Atlantic between South America and Africa, an area that is not frequently covered."}, {"review_sentiment": 5.0, "review_text": "Anything by Mr. Winchester is worth reading. He has rare talent. Great read."}, {"review_sentiment": 5.0, "review_text": "Places I would like to have seen the world over.  Prompt delivery."}, {"review_sentiment": 5.0, "review_text": "Best yet!"}, {"review_sentiment": 5.0, "review_text": "No problems. Great Service."}]}, "authors": ["Simon Winchester"], "isbn": "0060598611", "longitude": 0.0, "periods": null, "title": "Outposts: Journeys to the Surviving Relics of the British Empire", "word_cloud": "excellent overview bear mind thing get bit dated always go great quality write question story tell interest specifically shift gear many time question something great interest also story journey inherently interest thing hint begin full blown good expect bit read work still bad much love bit bleed heart harm good say hardly go wrong reading good gift husband spellbound fascinate learn site most locate area frequently cover anything worth read rare talent place see world delivery best yet problem", "genres": ["History", "Travel Writing"], "summary": "The reissue of a Simon Winchester classic\r\n\r\nIn 1985 Simon Winchester, struck by a sudden need to discover exactly what was left of the British Empire travelled 100,000 miles back and forth from Antarctica to the Caribbean to visit the far-flung islands that are all that remain of what once made Britain great. His adventures in these distant and forgotten ends of the earth make compelling and often funny reading.\r\n\r\nWith a new introduction and additional material in many of the chapters, this revised edition tells us what has happened while the author's been away.", "asin": "0060598611", "rank": "451672", "city": "Cayman Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/51WdbAhr6jL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}