{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 90, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "Let’s start with the unusual epilogue: “Knowledge of the facts of Bob’s life and death changes nothing in the world. Our celebrating his life and grieving over his death, however, will. Good cheer and mournfulness over lives other than our own, even wholly invented lives – no, especially wholly invented lives – deprive the world as it is of some of the greed it needs to continue to be itself. Sabotage and subversion, then, are this book’s objectives. Go, my book, and help destroy the world as it is.”Bob, our main character, is a young man (late 20’s) growing up in New Hampshire, who, although he doesn’t know it yet, is surrounded by examples to avoid – his father, his older brother, his best friend. He repairs oil burners in a dying town in the dead cold of New Hampshire’s winters. He has a wife, two daughters, a crappy car, a crappy house, but a nice boat, (almost paid off) and a woman on the side.But Bob has a white guy problem: it’s just not enough. His older brother appears to be living the good life in Florida. Both Bob and his money-obsessed older brother seem overly or unrealistically influenced by ads on TV for tropical vacations and Mercedes.Thus begins the two threads of the story: two families seeking better lives in Florida – one family in New Hampshire and one in Haiti. We know from the beginning they will meet in tragedy of almost unimaginable proportion. As hard as it is to believe, we are told that Bob, in his late 20’s, has previously had “no interaction with black people” even though he’s been in the service.Fast-forward to Florida. Bob works for his brother and lives in a one-bedroom dilapidated trailer. Later he runs sport fishing boats for his best friend and, unlike his best friend, he won’t smuggle drugs on the side but the thinks he’s helping people out by smuggling in illegal Haitian immigrants. A big and tragic mistake.The novel becomes almost a catalog of the financial holes the unsuspecting pursuers of the American Dream can fall into. And the way we get sucked into stereotypes of how the grass is greener over the state line. Just two weeks ago I read an article about a small community of 100 people in Florida who have unsafe water and whose average annual income is $10,000 – try living on that in sunny Florida!Some quotes I liked:“When you seek to acquire the love of someone who resembles you, in gender, temperament, culture or physical type, you do so for love of those aspects of yourself, gender, temperament, culture, etc.; but when you seek the love of someone different from you, you do so to be rid of yourself.”After a white guy shows up waving a gun in the home of a black family, threatening the father and daughter who live there: “She and her father never speak of the event again, not to each other and not to anyone else. There’s nothing to say about it to each other that is not already fully understood, so they remain silent about it, almost as if it never happened.”Bob reflects on the role of luck in life: “And luck can’t last a lifetime, unless you die young.”When this book was published in 1985, James Atlas, a writer and editor for the Atlantic, called it “The most convincing portrait I know of contemporary America.” Maybe it was then.This is my first Russell Banks. I found it a very good read but bit overdone with some of the characters bordering on stereotypes. Bob’s ignorance of black people seems extreme; his callousness and nonchalance about his extra-marital affairs seems overdone; his brother’s ties with Mafia-type guys and his profanity seem melodramatic as does the way the poverty and the docility of the Haitian immigrants are portrayed. I don’t know exactly what it was but it was almost a \"did not finish\" for me about a third of the way through. Yet I stuck with it and in the end I was glad I did and I gave it a 4."}, {"review_sentiment": 4.0, "review_text": "Thought provoking but very long.  I reread the last chapter.  Some of the writing was very poetic.  If you are looking for light reading, this isn't it."}, {"review_sentiment": 5.0, "review_text": "Love Russell Banks' books and this one did not disappoint."}, {"review_sentiment": 4.0, "review_text": "Catches the deep cords of humanity."}, {"review_sentiment": 2.0, "review_text": "I love Russell Banks, however, this is the one I couldn't get through. Just couldn't get into the characters or the trajectory of the story."}, {"review_sentiment": 1.0, "review_text": "Started to read it and didn't care for main character . I skipped ahead to see if it got better , story didn't appeal to me at all so I didn't go forward . Too many other books I'm interested in to read ."}, {"review_sentiment": 5.0, "review_text": "I read Kindle books on the elliptical at the gym, so I judge any book first by how well it keeps my attention. Continental Drift did that, and made me look forward to reading another installment every day.The story is told by a third-person, detached narrator. The story itself is chock full of emotion, mostly anger and sadness. It could not have been told as well from any one character's point of view. It charts the paths of two seemingly very different characters, who actually have similar dark tragic lives. Then it invites the reader to think about the human condition and their own life in the same light.It sounds like something one would want to avoid, but the skill of the writer at deciding what to focus the narrator on, and the beauty of the writing itself was worth it. It didn't even matter to me that the climax is apparent at about the half-way point in the book.  I will seek out more works by Russell Banks."}, {"review_sentiment": 5.0, "review_text": "So glad that I finally got around to reading Continental Drift and seeing what all the Russell Banks fuss was about!  I admit to being annoyed when the New Hampshire contingent was replaced by the Haitians-- maybe I've just read one too many shifting point of view novels lately.  But I grew to care about both sets of characters and their respective plights and realized that somewhere they would converge.  Banks's fine ear for dialogue and unflinching examination of the dark side of the American Dream create characters and plot developments that ring all too true."}, {"review_sentiment": 4.0, "review_text": "Wonderful modern classic. Russell Banks may not be for everyone (as the reviews here indicate), but I thoroughly enjoyed this book."}, {"review_sentiment": 5.0, "review_text": "Great read--tells the story of being lost in America from two completely different life experiences."}]}, "authors": ["Russell Banks"], "isbn": "0060854944", "longitude": -80.1936589, "periods": ["1900s"], "title": "Continental Drift", "word_cloud": "unusual epilogue facts life death change nothing world celebrate life grieve death however cheer mournfulness live even wholly invented life especially wholly invented life deprive world greed need continue subversion objective help world main character young man late grow yet surround example avoid father older brother best friend repair oil burner die town dead cold winter wife daughter crappy car crappy house nice boat almost pay woman white guy problem older brother appear live good life older brother seem overly unrealistically influenced ad tv tropical vacation begin thread story family seek better life family know begin meet tragedy almost unimaginable proportion hard believe tell late previously interaction black people even work life dilapidate trailer run sport fish boat best friend best friend smuggle drug side think help people smuggle illegal haitian immigrant big tragic become almost catalog financial hole unsuspecting pursuer american fall way get suck stereotype grass greener state line week article small community people unsafe water average annual income try live sunny quote like seek someone resembles gender temperament culture physical type love aspect gender temperament culture seek love someone different rid white guy show wave gun home black family threaten father daughter live father never speak event anyone else nothing say already fully understood remain silent almost never reflect role luck life luck last lifetime die publish writer editor call convincing portrait know contemporary first find good bit overdone character border stereotype ignorance black people seem extreme callousness nonchalance affair seem overdone brother tie guy profanity seem melodramatic way poverty docility haitian immigrant portray know exactly almost finish third way stick end glad give provoke long reread last chapter writing poetic look light read disappoint catch deep cord humanity love however character trajectory story start care main character skip ahead see get better story appeal go forward many interested elliptical gym judge first well attention make look forward reading installment story tell detach story chock full emotion mostly anger sadness well character point view chart path seemingly different character actually similar dark tragic life then invite think human condition life sound something avoid skill writer decide focus narrator beauty write even matter climax apparent point seek work bank so glad finally get read see fuss admit annoyed contingent replace maybe one many shift point view novel lately grow care set character respective plight realize somewhere fine ear dialogue unflinching examination dark side american create character plot development ring true wonderful modern classic everyone indicate thoroughly enjoy tell story lose completely different life experience", "genres": ["Fiction & Literature"], "summary": "A powerful literary classic from one of contemporary fiction's most acclaimed and important writers, Russell Banks's Continental Drift is a masterful novel of hope lost and gained, and a gripping, indelible story of fragile lives uprooted and transformed by injustice, disappointment, and the seductions and realities of the American dream.\r\n\r\n\"Russell Banks...explores the themes of good and evil, fate and freedom, success and failure, love and sex, and racism and poverty through alternating chapters focusing on dual protagonists: Bob Dubois, 30, who forsakes his deadend job as an oil-burner repairman in New Hampshire to begin a new life in Florida, and Vanise Dorinsville, a young, illiterate Haitian mother who seeks refuge from poverty by fleeing to America...Original in conception, gripping in execution.\" Newsday \r\n", "asin": "0060854944", "rank": "175402", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51Al65JjZ3L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}