{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 479, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Native Son is a masterpiece of naturalism and art. I teach it along with Dostoevsky's Crime and Punishment as two literary visions of wrong choices in societies given over to contrary wrongs. The meanings hover between condemnations: individual choice, freedom, depersonalization - but as the title tells us, Bigger Thomas is a product of the United States. Poignant in literary excellence, devastating in transmitting pain . . ."}, {"review_sentiment": 5.0, "review_text": "In the beginning, I disliked the main character and found his actions despicable. When the reality of his life circumstances became more apparent, I saw him in a different way and grew to understand him and viewed him on a totally different level. Much to digest and reflect upon how society has changed since this was written, yet how much it has not. A very powerful and enlightening work. Highly recommend!"}, {"review_sentiment": 5.0, "review_text": "Written in early 40s, explains a lot of what's going in Civil Rights today."}, {"review_sentiment": 5.0, "review_text": "loved it!"}, {"review_sentiment": 4.0, "review_text": "In 1940, Richard Wright published the literary cannon blast ‘Native Son’. Like a cannon, the novel is messy in its destruction and somewhat scattershot with its targets. One thing that critics of the time (and subsequently) could not do was to ignore this vitriolic outburst.Wright grabs in his arsenal not only the Jim Crow racism that propels its protagonist, Bigger Thomas, in his extreme actions, but those reliable targets anti-Semitism and Red paranoia. Although some have criticized the novel for resorting to a sentimental slant in the conclusion, I contend that Bigger Thomas is presented as a violent, fearful, brutish young man who would probably continue this behavioral pattern even if he had not committed the abhorrent crimes in the novel. He is not alone in his poverty; thousands of others in late-1930’s Chicago live in circumstances just as dire, if not more so, than his but they don’t all do what he does.Bigger is fueled by a pent-up rage that erupts at random targets: his friends from the pool hall Jack, Gus, and G.H., his girlfriend Bessie, even his mother, sister, and brother to a certain extent.When he is actually given an opportunity that his mother is thrilled for him to get, as a chauffeur for the Dalton family, Bigger is terrified. Mr. Dalton owns the company that rents the property where his family live, so in essence his landlord is offering to hire him. He is suspicious of kindness from affluent white people. It throws his entire world off balance. He is asked to drive Mr. Dalton’s daughter Mary to a school meeting. However, Mary instead orders him to pick up her Communist boyfriend Jan and take her to a restaurant/club with which Bigger is familiar and where his girlfriend Bessie works.  When Mary wants to sit next to him and have him join her and Jan AS AN EQUAL, he can only react with fear and rage.The circumstances as Wright presents them contain an inevitability, not necessarily as a rigid predestination but as a natural order of things in this young man’s life. Once the fateful act has been committed, Bigger is severed from humanity. In a sense the act has liberated him:“He had murdered and created a new life for himself. It was something that was all his own, and it was the first time in his life he had had anything that others could not take away from him. Yes; he could sit here calmly and eat and not be concerned about what the family thought or did. He had a natural wall from behind which he could look at them. His crime was an anchor weighing him safely in time; it added to him a certain confidence which his gun and knife did not.”Wright’s literary cannon is not particularly subtle. The investigator, assorted policemen and state’s attorney are all presented as unapologetic racists that consider Bigger subhuman. The attorney refers to him as that “black ape” and considers him a vile, vicious animal. The Daltons are affluent whites who ease their consciences by acting benevolent toward Negroes and feel that they are doing their race a service; offering Bigger a job as their family chauffer is a prime example; yet at the same time Mr. Dalton’s company rents to the Thomas’s and other black families in substandard dwellings in segregated ghetto districts. Mary’s boyfriend Jan is a sincere Communist who adheres to his ideals even if he is a bit too aggressive and short-sighted in his attitude toward Bigger. Bigger sees him as well as the entire Dalton family as privileged whites whose benevolence masks a condescension toward him and his people. His socialist defense attorney Mr. Max is an eloquent, wise, and idealistic Jewish liberal who is akin to Atticus Finch in his crusade for justice.There are times when plausibility is tossed aside in behalf of a platform in which varying points of view are exhibited simultaneously. Wright acknowledges this himself in his lecture/essay, “How “Bigger” Was Born,” referring specifically to a scene in which Bigger’s jail cell is occupied by him, a black preacher, Jan, Max, the State’s Attorney, Mr. and Mrs. Dalton, Bigger’s mother, brother, and sister, and Bigger’s friends Al, Gus, and Jack. Even if that many people could fit into such a tiny cell, it is unlikely that so many visitors would be admitted at once. Wright felt that the dramatic impact of Bigger confronting so many different voices and attitudes outweighed realism.In some respects, ‘Native Son’ is structured like ‘Crime and Punishment’. Both novels set the stage for a protagonist contending with outer and inner forces and circumstances that compel him to act as he does. In both, we enter the minds of these extremely desperate and frustrated young men, leading up to the murders, the internal struggle of evasion transforming into acceptance and resignation. Both characters continue to consider themselves to be apart from the mass of humanity. In Raskolnikov’s case, on the last page of the novel, he begins to realize that he does belong to the large sea of humanity.However, Bigger, while not denying the horror of what he did, sees that his transgression is the defining act of his life:“I didn’t want to kill!” Bigger shouted. “But what I killed for, I AM! It must’ve been pretty deep in me to make me kill! I must have felt it awful hard to murder…”“What I killed for must’ve been good!” Bigger’s voice was full of frenzied anguish. “It must have been good! When a man kills, it’s for something…I didn’t know I was really alive in this world until I felt things hard enough to kill for ‘em…It’s the truth, Mr. Max. I can say it now, ‘cause I’m going to die. I know what I’m saying real good and I know how it sounds. But I’m all right. I feel all right when I look at it that way…”There is nothing sentimental about Wright’s conclusion. By presenting a tragic hero that is not a meek Uncle Tom, his novel contained an abrasive power that the white literary establishment could not dismiss easily. That is the pioneering accomplishment of Wright’s novel.Bigger’s realization gives him a stature resembling Shakespeare’s tragic heroes Hamlet, Macbeth, Lear, and Othello. He faces the consequences of his actions because he has seized a freedom that his society has denied him. Such an extreme stance has continued to be taken in our current society where racism is unfortunately just as virulent as it was in the 1930’s of Bigger Thomas and Richard Wright."}, {"review_sentiment": 5.0, "review_text": "great literature endures.sadly, as relevant todayas ever."}, {"review_sentiment": 5.0, "review_text": "The book is clearly used but not torn nor defaced. It serves its purpose...The words are driving home a point of misdirected anger, due to disenfranchisement, in the mindset of the \"Negro\" without an avenue for identifying and  channeling such a powerful emotion into something productive because with constant scrutiny, the protagonist's insecurity of his place in the world prevents him from accepting validation even when it is sincere."}, {"review_sentiment": 5.0, "review_text": "Book was supposed to be \"Like New\", but it was more like brand new. This is a very good book to read and many students have to read it in school. Easier to read when you're not being forced. Lol. A book to keep in the house."}, {"review_sentiment": 5.0, "review_text": "I was definitely not expecting to be as into this book as I was. I don't know what I expected, but I was in for so much more, in a good way. Bigger's story was a common one during his time, but the choices he made saddened me, especially when things started to look up for me. It was very eye opening. Definitely as worthy read."}, {"review_sentiment": 4.0, "review_text": "Great so far. Love this author"}]}, "authors": ["Richard Wright"], "isbn": "006083756X", "longitude": -87.6244212, "periods": ["1900s"], "title": "Native Son", "word_cloud": "masterpiece naturalism art teach along literary vision wrong choice society give contrary wrong meaning hover condemnation individual choice freedom depersonalization title tell product literary excellence devastate transmit pain begin dislike main character find action despicable reality life circumstance become apparent saw different way grow understand view totally different level much digest reflect society change write yet much powerful enlighten work early explains lot go today love publish literary cannon blast cannon messy destruction somewhat scattershot target thing critic time subsequently vitriolic grab arsenal racism propels protagonist extreme action reliable target paranoia criticize resort sentimental slant conclusion contend present violent fearful brutish young man probably behavioral pattern even commit abhorrent crime alone poverty thousand others live circumstance dire fuel rage erupts random target friends pool hall girlfriend even mother sister brother certain actually give opportunity mother thrill chauffeur family terrify own company rent property family live essence landlord offering hire suspicious kindness affluent white people throw entire world balance ask drive daughter school meeting however instead order pick boyfriend familiar girlfriend work want next join react fear circumstance wright present contain inevitability necessarily rigid predestination natural order thing young man life fateful act commit sever humanity sense act liberate murder create new life something first time life anything others calmly eat concerned family think natural wall behind crime anchor weigh safely time add certain confidence gun knife literary cannon particularly subtle investigator assort policeman state attorney present unapologetic racist consider subhuman attorney refers black ape considers vile vicious affluent white ease conscience act benevolent race service offering job family chauffeur prime example yet time company rent black family substandard dwelling segregate ghetto district boyfriend sincere adheres ideal even bite aggressive attitude see well entire family privilege white benevolence mask condescension people socialist defense attorney eloquent wise idealistic jewish liberal akin crusade time plausibility toss aside behalf platform vary point view exhibit simultaneously acknowledge refer specifically scene jail cell occupy black preacher mother brother sister friends even many people tiny cell unlikely many visitor felt dramatic impact confront many different voice attitude outweigh respect structure novel set stage protagonist contend outer inner force circumstance compel act enter mind extremely desperate frustrate young men lead murder internal struggle evasion transform acceptance resignation character continue apart mass humanity case last page begin belong large sea deny horror see transgression define act life want kill shout kill be pretty make kill awful hard kill voice full frenzied anguish man kill know really alive world felt thing hard enough truth say cause go die know say real good know sound right feel right look nothing sentimental conclusion present tragic hero meek contain abrasive power white literary establishment easily pioneer accomplishment realization give stature resemble tragic hero face consequence action seize freedom society deny such extreme stance continue take current society racism unfortunately virulent great literature relevant today's ever clearly use torn deface serve purpose word drive home point misdirect anger due disenfranchisement mindset avenue identify channel powerful emotion something productive constant scrutiny protagonist insecurity place world prevent accept validation even sincere suppose brand new good many student school force keep house definitely expect know expect much good way story common time choice make sadden especially thing start look eye open worthy far author", "genres": ["Fiction & Literature"], "summary": "Right from the start, Bigger Thomas had been headed for jail. It could have been for assault or petty larceny; by chance, it was for murder and rape. Native Son tells the story of this young black man caught in a downward spiral after he kills a young white woman in a brief moment of panic. \r\n\r\nSet in Chicago in the 1930s, Wright's powerful novel is an unsparing reflection on the poverty and feelings of hopelessness experienced by people in inner cities across the country and of what it means to be black in America.", "asin": "006083756X", "rank": "10718", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/5138YNpFqNL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}