{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 156, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "I first read this novel over 10 yrs ago before taking a trip to Egypt.  I re-read it recently and again found it to be an excellent read, with memorable, vivid characters set in a conflict of life, religion, greed, and corruption."}, {"review_sentiment": 5.0, "review_text": "The precursor to the \"Arab Spring\" itself!"}, {"review_sentiment": 5.0, "review_text": "I know it wasn't the author's intention but this book made me afraid to go to Cairo as a woman. His description of the plight of women was deeply distressing. The corruption he describes in the government, explains the Egyptians revolt. In light of recent reversals, it would seem that things are going back to the way they were under Mubarak."}, {"review_sentiment": 4.0, "review_text": "Somewhat heavy and slow start, almost gossip then engrossing as one becomes attached to and is touched by the characters, their traps and tragedies while the pace picks up to a tragic then sudden and sweet end on what may be intended as the next precipice,"}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "A thrilling and interesting book. Complex and realistic characters and settings."}, {"review_sentiment": 4.0, "review_text": "The story seems like a reasonable depiction of life in an Egyptian apartment building, one whose occupants have changed over the years with the changing economic condition of the people. it depicts well how young Muslim men get radicalized and also how the young women are treated as objects for the advancement of the men and then killed if they are perceived as a danger to the status and wealth of the men, even to the extent of forcing an abortion on one girl. I couldn't help but conclude that it was a society rotten to the core, a case for gender equality if ever I heard of one."}, {"review_sentiment": 4.0, "review_text": "It is interesting but I feel it ended a bit too abruptly and most unexpectedly"}, {"review_sentiment": 5.0, "review_text": "Such a great book. Explores many issues inflicting Egyptian society today. Very relevant. The author is very gifted."}, {"review_sentiment": 5.0, "review_text": "Wonderful. A piercing analysis of the social and political panorama of post revolution Egypt. Historical fiction at its best."}]}, "authors": ["Alaa Al Aswany"], "isbn": "0060878134", "longitude": 31.243666, "periods": ["2000s"], "title": "The Yacoubian Building", "word_cloud": "first yrs ago take trip recently find excellent memorable vivid character set conflict life religion greed corruption precursor spring know intention make afraid woman description plight woman deeply distress corruption describes government explains revolt light recent reversal thing go back way somewhat heavy slow start almost gossip engross become attach touched character trap tragedy pace pick tragic sudden sweet end next precipice excellent thrill interesting realistic character setting story seem reasonable depiction life egyptian apartment occupant change year change economic condition people depict well young men get radicalize also young woman treat object advancement men kill perceive danger status wealth men even extent force abortion girl society core case gender equality ever hear interest feel ended bit abruptly unexpectedly such great explores many issue inflict egyptian society today relevant author gift piercing analysis social political panorama post revolution fiction best", "genres": ["Fiction & Literature"], "summary": "This controversial bestselling novel in the Arab world reveals the political corruption, sexual repression, religious extremism, and modern hopes of Egypt today.\r\n\r\nAll manner of flawed and fragile humanity reside in the Yacoubian Building, a once-elegant temple of Art Deco splendor now slowly decaying in the smog and bustle of downtown Cairo: a fading aristocrat and self-proclaimed \"scientist of women\"; a sultry, voluptuous siren; a devout young student, feeling the irresistible pull toward fundamentalism; a newspaper editor helplessly in love with a policeman; a corrupt and corpulent politician, twisting the Koran to justify his desires.\r\n\r\nThese disparate lives careen toward an explosive conclusion in Alaa Al Aswany's remarkable international bestseller. Teeming with frank sexuality and heartfelt compassion, this book is an important window on to the experience of loss and love in the Arab world.\r\n\r\n“Captivating and controversial .. . .an amazing glimpse of modern Egyptian society and culture.” New York Review of Books", "asin": "0060878134", "rank": "85155", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/512a1zQ0DDL.jpg", "country": "Egypt", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}