{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 50, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "We placed a sizable order and who do think was first to arrive. Great service!"}, {"review_sentiment": 5.0, "review_text": "This is my second Milan Kundera book and I have noticed that he has a distinct way of telling stories. I picture his narrative as cinematic, as it takes you back and forth between characters and time. This book is beautiful and it explores nostalgia, home and displacement. His origins are definitely prominent in the story and the characters are so great to connect to. This book is both philosophical and alluring, definitely recommend to read it!"}, {"review_sentiment": 2.0, "review_text": "pura fantasia"}, {"review_sentiment": 3.0, "review_text": "Ignorance is a 20th century tale of emigration and return. Although the personal circumstances of leaving and returning were dictated by the historical events in 20th century Europe, the experience of long absence is at least as old as Odysseus, and he alludes to Odysseus a number of times to connect this yearning from home as part of the human condition. Kundera is a master of his craft, but the story was more of a sketch than a satisfying tale. We only get a hint of the characters. For example, we know that Josef is a veterinarian, and Gustaf is a businessman but their careers are inconsequential to the tale. Similarly, Irena has done domestic work, and her mother is similarly skilled, but that is the past, and they seem to be persons of leisure, dependent on the work of others. Does Kundera care about his characters, or are they only vehicles for exploring his wonderings about memories, identity and language? His indifference in particular towards women is palpable. The unattractive ones he finds repugnant, and the beautiful ones have character flaws that make them eventually unattractive. And ultimately, this is our dilemma with Kundera: much as we wish to nod approvingly at his intelligence and insights, we feel left out and uninvited. Our own story is part of his, but we dare not insist, because our organs are not the same as his."}, {"review_sentiment": 3.0, "review_text": "Kundera weaves a few characters and the barest of plots around his extended musing on the emigrant experience of returning ‘home’. Storyline is largely incidental to Kundera’s reflections, which I think are in pretty much equal parts perceptive and projection.At some points his characters seem childishly egocentric, unaware of the irony of their constant lament, “No-one will listen to me. No one is really interested in what I have to say,” as they, themselves, show not a shred of interest in anyone else. This is particularly applied to the returning Czech émigrés:The worst thing is, [the locals who had not emigrated] kept talking to me about things and people I knew nothing about. They refused to see that after all this time, their world has evaporated from my head. They thought with all my memory blanks I was trying to make myself interesting. To stand out. It was a very strange conversation: I’d forgotten who they had been; they weren’t interested in who I’d become. Can you believe that not one person here has ever asked me a single question about my life abroad? Not one single question! Never!Where Kundera goes, perhaps, beyond this is in presenting this as a human condition thing. In response Irena’s complaint about the indifference of her erstwhile compatriots, fellow émigré Josef asks of her adopted country:“And what about in France? Do your friends there ask you any questions?”She is about to say yes, but then she thinks again; she wants to be precise, and she speaks slowly: “No, of course not! But when people spend a lot of time together, they assume they know each other. They don’t ask themselves any questions and they don’t worry about it. They’re not interested in each other, but it’s completely innocent. They don’t realise it.”OK, sure, there’s stuff to mull over here (and Kundera is a definitive writer for mulling things over). Moreover he bolsters his case with suggestions that we can’t really interact – our perceptions and, particularly, our memories - even of the same events - are so unavoidably disparate. This particular issue is recurring for him – or, at least, there are real shades of it in this line from The Book of Laughter and Forgetting:The invention of printing originally promoted mutual understanding. In the era of graphomania, the writing of books has the opposite effect: everyone surrounds himself with his own writings as with a wall of mirrors cutting off all voices from without.Perceptive.But, perhaps, blind projection – look at that wonderful generalisation of ‘everyone’. How far is Kundera presuming his experience – honestly and articulately expressed – is uniform? Take just the example from this extract: when people return or arrive from other countries, even other cities, in my experience it’s enormously common to hear them plastered (or, if it’s you, to be plastered) with questions about the experience, even to the point of the visitor getting tired of responding to similar questions. Sure some are just enquiring at a shallow, etiquette level, but many are genuinely interested in detail. I could be completely wrong – Kundera’s friends would know – but from this book I wouldn’t be surprised if much of these thoughts come from his own experience as an émigré, and that he wasn’t that interested in the experience of those who stayed, and was surprised at how little interest was shown in him. Many readers would be able to relate to this, but I don’t know how much of this is more about personality than humanity.Other elements that make this sound more profound than whiny are: his assured prose style; educated description of subtleties of how different languages deal with the term ‘nostalgia’; and the classical motif of Odysseus. But I think this sort of thing is intellectually neutral, and, in itself, shows more about class than insight (cf. Fry’s The Liar). And even though he must have been in his seventies, he still had his trademark adultery (cf. Lodge) – also seen as European sophistication in an SBS sort of way. It doesn’t rule the whole book – it’s more of a coda – but I just don’t get how casually it’s viewed – like someone deciding to try out a new hairstyle or something. I did, however, relate to Joseph’s cringing at reading his old diaries, and Kundera is highly adept at evoking specific resonances like this. If you read him it might be something else, but it will probably leap off the page at you. That being said, overall this was a pretty meandering book – probably just as well it was more of a novella than a novel."}, {"review_sentiment": 5.0, "review_text": "This is an excellent novel.  Initially I bought this book in Prague and I did like it so much that I ordered for a friend."}, {"review_sentiment": 4.0, "review_text": "This was my first Milan Kundera book and I was very pleased with my selection. Quite a straightforward and easy to read book, Ignorance is a novel that delves into the lives of refugees. Two, to be exact.How their lives have changed when they left their country, in this case the Czech Republic during the Russian invasion, and moved to neighbouring countries to make a new life for themselves. What it feels like to go back to their country of origin after so many years, how the memories they had of their past lives have become distorted by time.It was very interesting to go through this journey with Irena and Josef, and very personal as well. Both of them have come home only to feel like they did not belong any more. That their lives are elsewhere now, and that their memories as well as those of the people around them don't even match. Upon their return, they are haunted by memories they had of a time gone, they find themselves unused to this life that was once theirs, having to adjust to certain aspects and old acquaintances.Home was no longer home.I found it very interesting on a personal level, because I always wonder to myself what it would be like to return to my homeland, Palestine, and how it would feel to be back to a place I always thought I belonged to after living close to 26 years in another country that I now call home.Definitely a thought-provoking book, with many great and profound moments. I look forward to reading more of Kundera's books."}, {"review_sentiment": 1.0, "review_text": "I have suffered through three or four of Kundera titles and after Ignorance I decided to actually express my views of his work.With Ignorance as with most of his late works - I can't help but think that Kundera is strapped for cash. Like with few other titles I read before Ignorance is also written in large font with huge margins on bottom, top, left and right and the typesetting is also somewhat off.Kundera talks yet again of nothing else but sexual desires and communism - which he seems to have an ongoing love & hate relationship that dictates the tone in most of his books.His description of nostalgia in couple of different languages is unnecessary since we have advanced into the internet age decades ago (which the author either didn't notice or decided to ignore) but similar descriptions and \"explanations\" (normally found in Webster dictionary) have almost always a permanent spot in each of Kundera's work which, to me it seems, serves only to fill up empty pages.Kundera views are often presented as an advice perhaps in hopes that he too will be once remembered and  respected as was Jan Amos Komensky or other great teachers? If this was the case such advise could be compressed into 2 pages and the rest of this book can be scrapped. No one will cry over it.In my opinion - Kundera is one of the most over rated author of our time. A victim of his own nostalgia about country he once decided to leave and about his sexual desires whether fulfilled or not. It may be somewhat interesting to read once but all of his books are practically the same, so you will find yourself just flipping through the pages and skipping most of the text to read few sentences that may on may not be worth reading and than you will most likely just keep on skipping pages and \"read \" the entire book within an hour."}, {"review_sentiment": 4.0, "review_text": "In this \"Homeric tale of exile, memory, and homecoming,\" as described in The Guardian, Kundera manages to explore the nostalgia, I repeat, the nostalgia of the homeland. Alongside also exploring the concepts of memory and forgetting. Kundera describes nostalgia as \"the suffering caused by an unappeased yearning to return.\" Now if we look further back and ask what causes this yearning for return, there is the spirit and the roots of the individual to the place which gave him/her existence. \"What happens to people when they have to emigrate their native country? Is it true that emigration causes artists to lose their creativity?\" Perhaps the yearning to return stems from \"no longer having the roots of their native land to nourish\" their inspiration for living. Recollections, in turn, allow the emigres to hold in memory those specificities that still link them to their homeland in that fashion of life, and possibly forget all others.Nostalgia and memory do not have a one-to-one relationship, so says Kundera. \"Whereas Odysseus did suffer nostalgia, and remembered almost nothing.\" \"For nostalgia does not heighten memory's activity, it does not awaken recollection; it suffices unto itself, until its own feeling, so fully absorbed is it by its suffering and nothing else.\" Irena is consumed by memories but feels very little nostalgia to return. In fact, it is only by her friend's persuasion that she decides to visit the homeland. She feels as though her 20 years in France, having raised her own family and made her own life, is her actual homeland. She feels she has no more ties to her homeland, no more ties even to the mother she left behind. But her memories randomly and by surprise haunt her every day life, and it is through these memories that she is pushed to return, ultimately. Josef, on the other hand, \"had neither reason nor occasion to concern himself with recollections bound to the country he no longer lived in,\" yet yearns to return and in fact does. What a complex dynamic between memory and nostalgia.Sometimes while reading this book it feels like rugged terrain, struggling to keep pace or a grasp on ideas. It seems too much in a much too convoluted sense. It feels like there are two dichotomous personalities to the book (much like memory and nostalgia come to think of it). This is especially the case when Kundera shifts from social relationships to the inner relationship within the main character with their own selves. And then much like nostalgia and memory, the novel is very interconnected, weaving a root system through the book to link the components of what makes us human as a whole. Ultimately, formulating a vision of the complexity of the human spirit.There is a special part in the novel that needs recording. It goes above and beyond the premise of nostalgia and memory. It will make you think about what truly makes us human, and why nostalgia most likely exists in the first place. This part of the book is also the link between our relationships to people and to ourselves. It also shows how very little we know, or even begin to understand, of our own makeup as human beings.  The Excerpt can be found at \"Book Reviews, Fiction Reflections, N' More\""}]}, "authors": ["Milan Kundera"], "isbn": "0060002107", "longitude": 14.4212535, "periods": ["1900s"], "title": "Ignorance", "word_cloud": "excellent place sizable order think first arrive service second notice distinct way tell story picture narrative cinematic take back forth character time beautiful explore nostalgia home displacement origin definitely prominent story character great connect philosophical allure definitely pure fantasia century tale emigration return personal circumstance leave return dictated historical event century experience long absence least old allude number time connect yearn home part human condition master craft story sketch satisfy tale get hint character example know veterinarian businessman career inconsequential tale do domestic work mother similarly skilled past seem person leisure dependent work others care character vehicle explore wondering memory identity language indifference particular towards woman palpable unattractive one find repugnant beautiful one character flaw make eventually unattractive ultimately much wish nod approvingly intelligence insight feel leave uninvited story part dare insist organ weave character barest plot extend muse emigrant experience return home largely incidental reflection think pretty much equal part perceptive point character seem childishly egocentric unaware irony constant lament listen one really interested say show shred interest anyone else particularly apply return emigres worst thing local emigrate talk thing people know nothing refuse see time world evaporate head think memory blank try interesting strange conversation forget interested become person ever ask single question life abroad not single question go perhaps present human condition thing response complaint indifference erstwhile compatriot fellow emigre ask adopt country friends question say think want precise speaks slowly course people spend lot time together assume know ask question worry interested completely innocent realist ok sure stuff mull definitive writer mull thing moreover bolster case suggestion really interact perception particularly memory even event unavoidably disparate particular issue recur least real shade line forget invention print originally promote mutual understanding era graphomania write opposite effect everyone surround writing wall mirror cut voice perhaps projection look wonderful generalization everyone far presume experience honestly articulately express uniform example extract people return arrive country even city experience enormously common hear plaster plastered question experience even visitor get tire respond similar question sure inquire shallow etiquette level many genuinely interested detail completely wrong friend surprise much thought come experience emigre interested experience stay surprised little interest show many reader able know much personality element make sound whiny assure prose style educate description subtlety different language deal term nostalgia classical motif think sort thing intellectually neutral show class insight cf even seventy still trademark adultery cf also see european sophistication sort way rule whole coda get casually view someone decide new hairstyle something however relate cringe read old diary highly evoke specific resonance something else probably leap page say overall pretty meander probably well novella excellent buy like much order friend first please selection straightforward easy delve life refugee life change left country case invasion move neighboring country make new life feel go back country origin many year memory past live become distorted interesting journey personal well come home feel belong live elsewhere memory well people even return haunt memory time go find unused life adjust certain aspect old longer find interesting personal level always wonder return homeland back place always think belong live close year country call many great profound moment look forward read suffer title decide actually express view late work strap cash title also write large font huge margin bottom top left right typeset also somewhat talk yet nothing else sexual desire communism seem ongoing hate relationship dictate description nostalgia couple different language unnecessary advanced internet age decade author notice decide ignore similar description explanation normally find dictionary almost always permanent spot work seem serf empty view often present advice perhaps hop remember respected great teacher case advise page scrap one cry opinion rat author time victim nostalgia country decide leave sexual desire fulfil somewhat interest practically flipping page skip text sentence read likely skip page entire hour tale exile memory homecoming describe manage nostalgia repeat nostalgia homeland also explore concept memory forget describe nostalgia suffering cause appeased yearn return now look back ask cause yearn return spirit root individual place give existence happen people emigrate native country be true emigration cause artist lose creativity perhaps yearn return stem longer root native land nourish inspiration live turn allow emigre hold memory specificity still link homeland fashion life possibly memory relationship say suffer nostalgia remember almost nothing nostalgia heighten memory activity awaken recollection suffices feel fully absorb suffer nothing else consume memory feel little nostalgia return fact friend persuasion decide visit homeland feel year raise family make life actual homeland feel tie homeland tie even mother leave memory randomly surprise haunt day life memory push return ultimately hand reason occasion concern recollection country longer live yet yearns return fact complex dynamic memory reading feel rugged terrain struggle keep pace grasp idea seem much much convolute sense feel dichotomous personality much memory nostalgia come think especially case shift social relationship inner relationship main character self much nostalgia memory interconnect weave root system link component make human whole ultimately formulate vision complexity human special part need record go premise nostalgia memory make think truly make human likely exists first place part also link relationship people also show little know even begin understand makeup human be find more", "genres": ["Fiction & Literature"], "summary": "A New York Times Notable Book\r\n\r\nIrena and Josef meet by chance while returning to their homeland, which they had abandoned twenty years earlier. Will they manage to pick up the thread of their strange love story, interrupted almost as soon as it began and then lost in the tides of history? The truth is that after such a long absence \"their memories no longer match.\"\r\n\r\n“Erudite and playful...An impassioned account of the émigré as a character on the stage of European history.” The New York Times \r\n", "asin": "0060002107", "rank": "159272", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/41U-7OyP9XL.jpg", "country": "Czechia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}