{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 13, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "The dialogue between the characters was exceptional. The time period was one of interest to me because it gave me insight into the thinking of those who considered themselves the elite of Washington, DC during that time period."}, {"review_sentiment": 5.0, "review_text": "A great find!  A wonderful window into another era . . . ."}, {"review_sentiment": 5.0, "review_text": "Fascinating look at early 20th century upper middle class African American life.  Thoroughly enjoyed it and have read at least three times."}, {"review_sentiment": 5.0, "review_text": "I found the story fun to read and very interesting.. It tells the story of the middle and upper class  Afro -merican community in Washington DC during the 1920's.  It is very well written and tells the story of a community that experienced a great deal of prejudice, but was able to endure and celebrate life and maintain a strong sense of community. that perhaps spent a great deal of time going to parties.It is interesting also in that all of characters in the book at Afro-American. It shows that Harlam was not the only place that had a rich cultural life during the 1920's.."}, {"review_sentiment": 5.0, "review_text": "The book arrived in record time, in great shape and the price was right. It's a wonderful account ofBlack Washington D.C. social life during the twenties. Extremely well written, in that you canvisualize the scenes, and the characters."}, {"review_sentiment": 5.0, "review_text": "I love this book. My son gave it to me. So light, so wonderfull. A joy to read.  I just wish we still spoke like that, it's music to the ears. African Americans,living a life, going to parties, traveling, socializing, dining in the 20's. No violence, Hate. Just a good time. Mr.Davvy Carr is a true gentlemen, the likes of which we have not seen today. I'd like to see it made into a movie, it would be great with Jeffrey Rush as Mr.Carr and for Caroline an unknown black actress. But who would go see it, no one gets shot or blown up, or nude. I say read this book, you may learn something, I know I did."}, {"review_sentiment": 5.0, "review_text": "I fell in love with the characters as they love, party, study, fight, and simply live as successful African Americans in the roaring 20's. I couldn't put it down."}, {"review_sentiment": 5.0, "review_text": "Reading WHEN WASHINGTON WAS IN VOGUE you will feel young again, even if the protagonist, Davy Carr, isn't as young as he used to be before the Great War, in which he served honorably.  His letters to his friend Bob reveal, step by step, how he entered an uppermiddle class world of black society in Washington during the days of the 1920s, during Prohibition, and how he found acceptance in the household of a beautiful widow and her two exquisite daughters--one of them, Genevieve, ladylike and stunning, the other, Caroline, a true product of the Jazz Age, flirtatious, fun, and slightly scandalous.  Davy's growing interest in Caroline is concealed even from himself, he seems like he's the last person in DC who can figure it out.  Is it because she is so much younger than he is?The editor, Adam McKible Ph.D., hints that this state of affairs parallels Williams' own interests in much younger women, coeds in the great universities in which he served as a librarian, and he quotes from Zora Neale Hurston's memoirs of him flirting like crazy back and forth with young girls.  McKible seems a little too taken with his own discovery of this novel, which is no masterpiece by any means, but let him pat himself on the back if he feels like he deserves it, he certainly has given us all some amusing moments and some poignant ones too.  I'd like to see a movie version of this book, perhaps with Beyonce as the flirty Caroline and with Angela Bassett as the older and more dignified sister, Genevieve, and to play Captain Davy, who else but Samuel Jackson?"}, {"review_sentiment": 3.0, "review_text": "I liked this novel, originally published in a black journal from 1925 through 1926.  The details of Davy Carr's middle class existence were sometimes too tedious for my liking, but for anyone who is interested in the daily lives of African Americans during the Roaring Twenties, this book is a must read.I've read a lot of Edith Wharton and WHEN WASHINGTON WAS IN VOGUE fits nicely with Wharton's insider look at polite society and its pitfalls.  There was a lot of discussion in this book about \"passing\" and \"light skinned\" girls, but the story didn't shed much light on the real issues of race.  Instead the reader learned about dazzling dinner parties, week-ends in the country and late night card games.There is a love story buried in the book, too.  Although there's no real conflict or struggles in the novel, it's worth a few afternoons of your time.Enjoy."}, {"review_sentiment": 3.0, "review_text": "Originally published anonymously at the height of the Harlem Renaissance, WHEN WASHINGTON WAS IN VOGUE is a great example of literature of that time period.  The story is told with letters composed by Davvy Carr, a former army soldier, to his friend Bob in New York.  Davvy, a recent transplant to Washington, DC becomes a student of the life and times of high society there.Davvy takes up residence in the boarding house of Margaret Rhodes and there he makes the acquaintance of many interesting people, including Caroline Rhodes.  She is feisty and demanding, her very presence screams for attention.  Caroline does her best to try to capture Davvy's interest by forceably inviting herself into his room and perusing his personal belongings.  Unbeknownst to Davvy, Caroline is interested in him, however he does not consider her as a love interest because she is many years his junior.  Through the letters, the story is revealed.  Much to his surprise, Davvy develops feelings for Caroline.  At this time of realization Davvy must discover whether it is too late for or will Davvy and Caroline be able to overcome their difference and succumb to the possibility that love holds for them?This novel is unique in its portrayal of boy meets girl.  It provides an interesting glimpse into the 1920's.  The book speaks to inter-race and societal issues.  It captured my attention through its use of vivid details and genuineness, yet it was not a major page-turner that compelled me to want to read on. I think it is a decent read that offered a refreshing twist on the unfolding of a relationship.Reviewed by Nedineof The RAWSISTAZ Reviewers"}]}, "authors": ["Edward Christopher Williams"], "isbn": "0060555467", "longitude": -77.0366456, "periods": ["1900s"], "title": "When Washington Was in Vogue: A Lost Novel of the Harlem Renaissance", "word_cloud": "dialogue character exceptional time period interest give insight thinking consider elite time period great find wonderful window era fascinate early century middle class african american life enjoy least time find story fun tell story middle upper class community well write tell story community experience great deal prejudice able endure life maintain strong sense community perhaps spend great deal time go interest also character show place rich cultural life arrived record time great shape price right wonderful account of black social life twenty extremely well write can visualize scene character love son give so light wonderful joy wish still speak music ear african live life go party travel socialize din violence good time true gentleman like see today see make movie great unknown black actress get shot nude say something know fell character love party study fight simply live successful african roar read feel young even protagonist young use serve honorably letter friend reveal step step enter upper middle class world black society day find acceptance household beautiful widow exquisite daughter ladylike stun true product flirtatious fun slightly scandalous grow interest conceal even seem last person figure be much younger editor hint state affair parallel interest much younger woman coeds great university serve librarian quote memoirs flirt crazy back forth young girl mckinley seem little take discovery masterpiece mean let back feel deserves certainly give amuse moment poignant one like see movie version perhaps flirty older dignify sister play else like originally publish black journal detail middle class existence sometimes tedious like anyone interested daily life african roar fit nicely insider look polite society pitfall lot discussion pass light skin girl story shed much light real issue race instead learn dazzling dinner party country late night card story bury real conflict struggle afternoon originally publish anonymously height great example literature time period story tell letter compose former army soldier friend recent transplant become student life time high society take residence boarding house make acquaintance many interesting people include feisty demand presence scream attention best try capture interest force ably invite room peruse personal belonging interested however consider love interest many year junior letter story reveal much surprise develop feeling time realization late able overcome difference succumb possibility love hold unique portrayal boy meet girl provide interesting glimpse speaks societal issue capture attention use vivid detail genuineness yet major compel want think decent offer refresh twist unfold", "genres": ["Fiction & Literature"], "summary": "Nearly lost after its anonymous publication in 1926 and only recently rediscovered, When Washington Was in Vogue is an acclaimed love story written and set during the Harlem Renaissance. When bobbed-hair flappers were in vogue and Harlem was hopping, Washington, D.C., did its share of roaring, too.\r\n\r\nDavy Carr, a veteran of the Great War and a new arrival in the nation's capital, is welcomed into the drawing rooms of the city's Black elite. Through letters, Davy regales an old friend in Harlem with his impressions of race, politics, and the state of Black America as well as his own experiences as an old-fashioned bachelor adrift in a world of alluring modern women -- including sassy, dark-skinned Caroline.\r\n\r\nWith an introduction by Adam McKible and commentary by Emily Bernard, this novel, a timeless love story wonderfully enriched with the drama and style of one of the most hopeful moments in African American history, is as \"delightful as it is significant\" (Essence).", "asin": "0060555467", "rank": "1363498", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51EGpTVbKHL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}