{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 42, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "for my husband, Amazing customer service and a great product. fine. good product with high quality. Satisfied."}, {"review_sentiment": 2.0, "review_text": "This book was a very good idea, but somewhat of a missed opportunity. The book includes some interesting and telling stories and the author relates them well.  Unfortunately, it is overly peppered with her extreme feminism, revulsion with religion, and her anti-westernism, which ends up being criticized almost as much as the communist system itself.  Still, if you can tolerate those aspects, some of the stories of daily life under communism are worth a look, especially those of chapters 1-5."}, {"review_sentiment": 5.0, "review_text": "A great window into every day life under communism. A fantastic historical narrative that focuses on things not normally covered in history class, like communist toilet paper, sharing apartments, talking with the man who listens to all your phone calls, etc."}, {"review_sentiment": 5.0, "review_text": "Nice copy. Wish there had not been stickers right in the middle of the cover. Pls put in a less conspicuous place."}, {"review_sentiment": 1.0, "review_text": "I don't think this book is that well written. Sometimes one gets the impression that the author derives pleasure from painting a picture that was never that bad in old Yugoslavia. Why insist on comparing countries that were so different even in those days? Why dwell on unsavoury details about Golub loo-paper or the communist version of Tampaxes? They do nothing to help the reader understand the bygone era of so-called Communism. As for all the feminism, give us a break.....!"}, {"review_sentiment": 5.0, "review_text": "Everything I expected it would be and fast shipping."}, {"review_sentiment": 3.0, "review_text": "Gets a little repetitive but I do recommend it to many people -- even if they read only a few chapters now and then,  there are lessons to be learned"}, {"review_sentiment": 4.0, "review_text": "Easy, accessible account of living under communism during the 80s. This book mostly struck me with details like toilet paper being difficult to procure, things like that. It's something that you don't necessarily need a lot of context to read, so as a casual history book I'd recommend this."}, {"review_sentiment": 5.0, "review_text": "Informative"}, {"review_sentiment": 5.0, "review_text": "A great combination of first hand experiences and interviews by a woman, mother and journalist.  Copyright date of 1991 I found is a real plus since experiences were very recent."}]}, "authors": ["Slavenka Drakulic"], "isbn": "0060975407", "longitude": 13.3888599, "periods": ["1900s"], "title": "How We Survived Communism & Even Laughed", "word_cloud": "husband customer service great product fine good product high quality satisfy good idea somewhat missed opportunity include interesting tell story author relate well unfortunately overly peppered extreme feminism revulsion religion end criticize almost much communist system still tolerate aspect story daily life worth look especially chapter great window day life fantastic historical narrative focus thing normally cover history class communist toilet paper share apartment talk man listen phone call etc copy wish sticker right middle cover put le conspicuous place think well write get impression author derive pleasure paint picture never bad old insist compare country different day dwell unsavory detail communist version nothing help bygone era feminism give everything expect shipping get little repetitive recommend many people chapter lesson learn accessible account live mostly strike detail toilet paper difficult procure thing something necessarily lot context casual history recommend informative great combination first hand experience interview woman journalist date find real experience recent", "genres": ["Memoir", "Essay", "Politics"], "summary": "This essay collection from renowned journalist and novelist Slavenka Drakulic, which quickly became a modern (and feminist) classic, draws back the Iron Curtain for a glimpse at the lives of Eastern European women under Communist regimes. Provocative, often witty, and always intensely personal, How We Survived Communism and Even Laughed cracks open a paradoxical world that through its rejection of capitalism and commoditization ends up fetishizing both.\r\n\r\nExamining the relationship between material goods and expressions of happiness and individuality in a society where even bananas were an alien luxury, Drakulic homes in on the eradication of female identity, drawing on her own experiences as well as broader cultural observations. Enforced communal housing that allowed for little privacy, the banishment of many time-saving devices, and a focus on manual labor left no room for such bourgeois affectations as cosmetics or clothes, but Drakulic’s remarkable exploration of the reality behind the rhetoric reveals that women still went to desperate lengths to feel “feminine.”\r\n\r\nHow We Survived Communism and Even Laughed also chronicles the lingering consequences of such regimes. The Berlin Wall may have fallen, but Drakulic’s power pieces testify that ideology cannot be dismantled so quickly; a lifetime lived in fear cannot be so easily forgotten.", "asin": "0060975407", "rank": "38101", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/41cnHIHX33L.jpg", "country": "Germany", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}