{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 17, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "The Four-Gated City (1969) concluded Doris Lessing’s semi-autobiographical Children of Violence series of novels , which she had begun almost two decades earlier. The previous four installments were of fairly standard novel length but this last book is elephantine without, frankly, any real justification other than that Lessing must have felt self-indulgent.The biggest problem is that Martha Quest, the central character of the series, is, frankly, a dud. She had shown early promise in the first couple books with her interest in radical politics and her affiliation with those working for racial equality in “Zambesia,” the fictional stand-in for Rhodesia, Lessing’s home during her early years. Martha’s early struggles between leading a conventional life—she had married a dull but amiable man in book two, A Proper Marriage—and her interest in pursuing social justice issues as well as developing her own talents, gave the series a strong narrative arc in the early going, but by the fourth book (Landlocked), her character had regressed to prosaic self-indulgence, whiling away the time on a sexual dalliance while her political activities ground largely to a standstill. This might have been interesting, but Lessing never seemed to be able to raise it above the commonplace.The Four-Gated City follows Martha from her coming to England at around age 30 in 1949 through the end of her life in the 1990s, or about 30 year’s in the future when the book came out. She spends most of that time in a rather nontraditional household worthy of an Iris Murdoch novel of that period, serving as live-in amanuensis/maid/mistress for the eccentric author and aristocrat Mark Coldridge, and as companion/mother-confessor for his family.Martha ends up spending several decades in the Coldridge household, where not much really happens despite the radical changes that go on in the world around them. The family does dabble in politics but little of it seems to touch Martha, the former leftist firebrand. Lessing then throws a curveball down the stretch by slanting the narrative into a sci-fi-ish paranormal direction (though it could also be taken that Martha is simply going mad) capped with a dystopian conclusion that serves as an object lesson in why serious novelists should stay away from predicting events into any future near enough for readers to call them on it. I found the ending not so much shocking as desperate and I was very disappointed by how Lessing’s tale of Martha’s life spun off into such long-winded entropy. The Four-Gated City is an overlong bore of a book."}, {"review_sentiment": 5.0, "review_text": "This was one of my all-time favorite books when I first read it almost forty years ago, and it still is. It has everything: wonderful characterization, interaction with the politics of that time and all times, astute observations about mental illness, and beautiful intimations of spirituality, of what is beyond our everyday mundane lives.My only criticism is not of Lessing, but of the Kindle version. This book is FULL of typos: McArthy, missing words, numbers where there should be letters. If I were Doris Lessing, I would be really pissed at the lack of proofing."}, {"review_sentiment": 5.0, "review_text": "This is still a wonderful read, but I liked the science fiction parts much less now than I did the first time around.Besides, we are all still here!"}, {"review_sentiment": 5.0, "review_text": "The greatest English writer of this century.  Not comfortable but showing again and again what it is to live a genuinely reflective life within engagement.  Quite a feat.  Amazingly having read it twice before, over a long period admittedly, I found chunks that previously I had not absorbed at all - highly recommended if you don't mind thinking about life the universe and everything"}, {"review_sentiment": 2.0, "review_text": "I read this book, made into a Kindle version by Harper Collins. There were so many mistakes! I was able to get through the story, but there were so many errors it gives this publisher a horrible reputation. Multiple times an \"I\" was rendered as a numeral 1. So many problems like this plagued the book I am not sure I got the whole story.THAT aside, this book is a magnificent story. I used kindle to underline dozens  of passages and may very well begin to read it again right away."}, {"review_sentiment": 5.0, "review_text": "The Four-Gated City closes Doris Lessing's Children of Violence series.  It is a marvelous finale to Martha Quest's story.  Born after World War I to settlers in South Africa, Martha is the daughter of a veteran who had fought for the British (and never got over it) and a woman whose great love died for the same cause.  The child of settlers who are never quite at home in their world and who have settled for less than happiness, Martha spends her life actively addressing the questions of who exactly she is and where she belongs.  Her sense of herself as living on the fringes of her own life and her keen and clear sense of the pretenses that feed a false sense of identity for the people around her make her an exasperating character.  So often, I just wanted Martha to settle, to take what was offered and run with it.  I wanted Martha to be me.  But she wasn't inasmuch as she pushed the question of identity--and value and worth--to the very end, where there is no happiness but there is the disconcerting truth that we are children of violence, and we are undoing our world left and right by failing to own up to this truth and undo it.  It's a brilliant, painful story.The Four-Gated City (Children of Violence)"}, {"review_sentiment": 5.0, "review_text": "In The Four-Gated City, Nobel winner Doris Lessing ends her massive Children of Violence series with a whopper. Martha Hesse (nee Quest) is newly arrived in London from her disappointing life in Africa. She meanders around, trying to find herself through the city, friends, and lovers, and quickly settles down in Marc Coldridge's large house. The house itself is almost a character, as it is slowly filled with people from the same social class but with widely divergent personalities. Martha, ever the sensible one, works and keeps house, but the gradual influence of the Coldridge family morphs her throughout the course of the book into a fully self-aware person, with a disenchanted but oddly hopeful view of England's new, post-WWII society. The four-gated city of the title could be London, as it was a world into itself, trying to come to grips with recuperation. However, I think the title is also an allusion to the Coldridge house on Radlett Street, as 95% of the book happens within those four walls that challenges, enlightens, and stymies our Martha.In my opinion, this is Lessing's best novel. It starts off as a conventional story, but the deeper you get the more becomes a statement on the dangerous times facing Europe. Lessing's strengths are in her ability to weave themes and portents throughout the story, but this comes at the expense of some frequently faulty characterization. It is stunning in its psychoanalysis- Lessing writes in a very distinct, almost-too-complex manner Martha's gradual foray into insanity where she faces something in herself which is not the soul, but a subconscious wavelength that makes her privy to all the poisoned thinking around her. It is this thinking that is the impetus for the novel's last part, where the story turns on a futuristic cant (but subtle enough that it shouldn't turn away anyone who doesn't like the genre), and the fabled England is annihilated by a Catastrophe created by centuries of hatred, fear, and negative thinking wrought by history. From this era is borne the eponymous Children of Violence, subtly bringing the series (and perhaps Lessing's view of history) full-circle.Again, this is a masterful ending to a series that was heretofore distinguished but not particularly urgent. The great majority of it is entertaining, and really sharpens the way you think and view the world. Even its slower moments have a common sophistication rare in fiction but frequent in Lessing's works. Plus it could easily be read on its own, as it really is heads and shoulders above the rest of the series. Highest recommendation."}, {"review_sentiment": 5.0, "review_text": "Martha Quest Hesse is a new arrival in London.  After staying with people at the docks, in a cafe, and with her friend Jack, she comes upon the Mark Coldridge establishment-- an involving situation.  Martha has discovered that hysteria is rehearsal.  In the Coldridge household she uses her knowledge of human behavior.  As Martha prepares to leave the house of Mark Coldridge, (she never did leave, this was an attempt), Mark tells her that she is seeking a mythic city.  Mark and Martha discuss how shantytowns are the shadows of cities.Mark's brother Colin, a physicist, leaves England, fleeing it for the Soviet Union.  His wife kills herself with gas.  There is a child, Paul.  Martha stays at the house with Mark and Paul.  The house is surrounded by journalists.  Lynda, Mark's hospitalized wife, wants to return and live in the basement flat with her friend Dorothy.  Dorothy's rent payment is sure money for Mark who is faced with school fees for both his own son, Francis, and for his nephew, Paul.Part Two of the book begins with a quotation from A MAN WITHOUT QUALITIES by Robert Musil.  When Martha learns that her mother is planning to come to England, she takes to her bed.  In anticipating the visit, Martha sees that both she and her mother fear pain.  Martha knows that to make a book, for instance, one has to remove the things that are violent, emotional, protesting. In Africa Mrs. Quest had a child servant, Steven.  Initially she was unkind to him and came to regret that and the memory hurt her conscience.  Mrs. Quest told him stories from Kipling.  In the end her visit to England is cut short basically by mutual consent.  After her mother leaves, Martha collapses.The year 1956 is a climactic year given the events of Hungary and the Suez.  During the emergencies encountered in the patched-together Mark Coldridge family Martha is able to identify the machinery pertaining to mental illness and juvenile delinquency services.  Mark propounds a theory of scapegoating in a matter involving his stepfather.  He suggests that friends work quietly to alleviate the problem.  Taking political and public stands are not necessarily useful, he argues.Martha uses a particular personality when dealing with Paul.  By the time Francis and Paul are teenagers, Martha is able to hear the thoughts of others.  (Lynda has always had this ability.)  The mature Paul develops the capacity to be an effective trader.  After the children are grown, Martha has little to do as Mark's secretary.Doris Lessing's blend of realism and fantasy is unusual.  This novel is the fifth of a series and provides an amazing and unusual end for the heroine.  The improbable conclusion of the political and psychological strands of the story appear in a section called appendix.  This is on par with, although more controlled than, THE GOLDEN NOTEBOOK.  It is a masterpiece."}, {"review_sentiment": 5.0, "review_text": "Doris Lessing shows her mastery of Sufi story telling methods in this science fiction writing, as well as cleverly embedding Sufi themes about dreams and self remembering.  The main character lives in an apocalyptic world in great change.  It reflects the \"quest\" (my main character is Martha Quest) of all of us during this time of change.  It is part of a series of writings, but I read it as a stand alone book and enjoyed it a lot.  I was less concerned with the plot and more how the character experienced life and the situations she moved through, and how she got in touch with her experience and flowed with her feeling sense of what was going on.  I liked the way the situations helped bring out a different kind of psychology that has the Sufi path as its source.  The maturity of such themes does reflect the growth of the author on this path."}, {"review_sentiment": 5.0, "review_text": "This was the first book by Doris Lessing that I ever read, nearly thirty years ago.  At the time I read it, one part of it in particular had a profound effect upon my life, namely her description of Martha's encounter with the Self-hater.  For Martha, meeting her internal Self-hater was like plugging into 10,000 volts of hatred.  After the encounter she says she understands how it is possible for a man to rape and murder a young girl, and how the holocaust was possible.  She speculates that perhaps Hitler had been taken over by the Self-hater.  This was so pertinent to me because I was then going through a very similar experience.  (I describe this in my book, \"Captain California Battles the Beelzebubian Beasts of the Bible).  Reading Ms. Lessing's book gave me a much-needed new perspective on what I was experiencing, and increased my confidence that I would get through it all right.Since then I have read most of Ms. Lessing's other books, and have reread several of them at least twice.  I believe that the common motif of all of them is her conviction that human evil is primarily caused by a lack of human self-awareness, and is therefore something that can be overcome.  Her books represent a determined effort to make people more aware of themselves.  Ms. Lessing's genius as a writer is such that I can hardly imagine anyone reading her books without being profoundly changed, without becoming significantly more mature."}]}, "authors": ["Doris Lessing"], "isbn": "0060976675", "longitude": -0.12574, "periods": ["1900s"], "title": "The Four-Gated City", "word_cloud": "conclude series novel begin almost decade earlier previous installment fairly standard length last elephantine frankly real justification biggest problem central character series frankly dud show early promise first couple interest radical politics affiliation work racial equality fictional home early year early struggle lead conventional married dull amiable man proper interest pursue social justice issue well develop talent give series strong narrative arc early go fourth character regress prosaic whiling away time sexual dalliance political activity ground largely interest mess never seem able raise follow come age end life year future come spend time rather nontraditional household worthy period serve eccentric author aristocrat end spend several decade household much really happen radical change go world family dabble politics little seem touch former leftist firebrand throw stretch slant narrative paranormal direction though also take simply go mad cap dystonia conclusion serf object lesson serious novelist stay away predict event future enough reader call find end much shocking desperate disappoint mess tale life spun entropy overlong bore favorite first almost forty year ago still everything wonderful characterization interaction politics time time astute observation mental illness beautiful intimation spirituality everyday mundane criticism mess version typo miss word number letter doris mess really pissed lack proofing still wonderful like science fiction part much le first time still greatest english writer century not comfortable show live genuinely reflective life engagement feat twice long period admittedly find chunk previously absorb highly recommend mind think life universe everything make version many mistake able story many error give publisher horrible reputation time render numeral many problem plague sure get whole aside magnificent story use kindle underline dozen passage well right away close series marvelous finale story settlers daughter veteran fight british never get woman great love die child settler never quite home world settle le happiness spend life actively address question exactly belong sense living fringe life keen clear sense pretense fee false sense identity people make exasperate character so often want settle take offer run want inasmuch push question identity value worth end happiness disconcert truth child violence undoing world leave right fail truth brilliant painful winner end massive series whopper nee newly arrive disappointing life meander try find friend lover quickly settle large house house almost character slowly fill people social class widely divergent personality ever sensible work keep house gradual influence family morphs course fully person disenchant oddly hopeful view new society title world try come grip recuperation however think title also allusion house happen wall challenge enlightens stymy opinion mess best start conventional story deeper get become statement dangerous time face strength ability weave theme portent story come expense frequently faulty characterization stun mess writes distinct manner gradual foray insanity face something soul subconscious wavelength make privy poison think think impetus last part story turn futuristic cant subtle enough turn away anyone genre fabled annihilate create century hatred fear negative thinking wrought history era borne eponymous subtly bring series perhaps view history masterful end series heretofore distinguish particularly urgent great majority entertain really sharpens way think view world even slower moment common sophistication rare fiction frequent mess work easily really head shoulder rest series recommendation new arrival stay people dock cafe friend come establishment involve situation discover hysteria rehearsal household use knowledge human behavior prepares leave house never leave attempt tell seek mythic discus shantytown shadow brother physicist leaf flee wife kill gas child stay house house surround journalist hospitalize wife want return live basement flat friend rent payment sure money face school fee son nephew begin quotation man learn mother planning come take bed anticipate visit see mother fear pain know make instance remove thing violent emotional protesting child servant unkind come regret memory hurt conscience tell story end visit cut short basically mutual consent mother leaf year climactic year give event emergency encounter family able identify machinery pertain mental illness juvenile delinquency service propound theory scapegoating matter involve suggest friend work quietly alleviate problem take political public stand necessarily useful us particular personality deal time teenager able hear thought others always ability mature develop capacity effective trader child grown little blend realism fantasy unusual fifth series provide amazing unusual end heroine improbable conclusion political psychological strand story appear section call appendix par control masterpiece show mastery story tell method science fiction write well cleverly embed theme dream remember main character live apocalyptic world great change reflect quest main character time change part series writing stand alone enjoy lot le concerned plot character experience life situation move get touch experience flow feeling sense go like way situation help different kind psychology path source maturity theme reflect growth author path first ever nearly thirty year ago time part particular profound effect life namely description encounter meet internal plug volt hatred encounter say understand possible man rape murder young girl holocaust possible speculate perhaps take pertinent go similar experience describe read mess give new perspective experience increase confidence mess reread several least twice believe common motif conviction human evil primarily cause lack human therefore something represent determine effort make people aware mess genius writer hardly imagine anyone reading profoundly change become significantly mature", "genres": ["Memoir", "Fiction & Literature", "Science Fiction"], "summary": "Dorris Lessing's classic series of autobiographical novels is the fictional counterpart to Under My Skin. In these five novels, first published in the 1950's and 60s, Doris Lessing transformed her fascinating life into fiction, creating her most complex and compelling character, Martha Quest.\r\n\r\nThe Four-Gated City published in 1969, is the fifth and concluding novel, in British Nobel Prize-winning author Doris Lessing's five-volume, semi-autobiographical series The Children of Violence, which she began, in 1952, with Martha Quest. The series Children of Violence follows the life of protagonist Martha Quest, from age fifteen in Southern Rhodesia, now Zimbabwe, through adolescence and a marriage shaped by the Second World War. In the The Four-Gated City Lessings moves the setting from Southern Rhodesia, southern Africa, to London, and this novel has a science fiction, dystopian ending, with Martha dying in 1997.\r\n\r\nWhen published it created a stir with claims that it promoted communism. The Four-Gated City is one of Lessing's most important works. Lessing had moved to London, from southern Africa, with her son Peter in 1949, after divorcing her second husband Gottfried Lessing.\r\n\r\nWikipedia", "asin": "0060976675", "rank": "1352765", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/413fAGS5wAL.jpg", "country": "England", "story_arc": ["Tragedy", "Things only get worse"]}