{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": -12.0621065, "ratings": {"num_ratings": 35, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent discussion of how to create a Christian environment in the classroom. Not preachy, down to earth, can be used for secular classrooms. Very progressive tips."}, {"review_sentiment": 4.0, "review_text": "delivery so quickly. comfortable,nice . my sister, This is a gift for someone that is studying to become a chef. I did take it out of the box and it is a very nice product. The weight and handle are very good for cutting and even my smaller hands felt comfortable with the size. very recommend ."}, {"review_sentiment": 5.0, "review_text": "Vargas Llosa, equally adept, insightful, and authentically advanced in both essay and novel form, an utterly unique voice in many registers."}, {"review_sentiment": 1.0, "review_text": "Interesting but not as good as his other work."}, {"review_sentiment": 5.0, "review_text": "This is a most unique book.  In the beginning, I found it hard to follow as the plot jumped around from one time period to another and then back again.  But once I became accustomed to this literary contrivance, I found the book fascinating.  The book condemns the political landscape in Peru which appears unredeemable.  Llosa, who himself was an unsuccessful candidate for President of Peru, well understands the political machinations of his country.  I would recommend this book - it was a literary masterpiece."}, {"review_sentiment": 5.0, "review_text": "educational"}, {"review_sentiment": 1.0, "review_text": "I bought it because he won the Nobel Prize.  The selection criteria of the Nobel committee are beyond my comprehension."}, {"review_sentiment": 1.0, "review_text": "Silly story"}, {"review_sentiment": 4.0, "review_text": "A classic!  Thanks for prompt delivery."}, {"review_sentiment": 4.0, "review_text": "Mario Vargas Llosa didn't make it easy. I read chapters 2 (rather disturbing) and 3 three times.  I finally got my bearings by reading another reviewer's review.It doesn't take long to figure out the Cathedral is a bar, but figuring out that Santiago Zavilita (also called Skinny by his family) and Ambrosio are the speakers takes a bit longer. Longer yet is the placing the other characters and getting used to the format.  The best way to envision the conversation is thinking of a movie with the participants speaking while the action with its own dialog, not always related to the conversation, is in progress.The setting is Peru of the 1950's and the characters are supporters and detractors of Manuel Odria. Through the conversation, you them stage rallies, control news, make deals, jail and release opponents, and have parties with fun loving mistresses.  What the conversationalists have in common is their connection to  Don Fermin, a wealthy businessman dependent on government contracts. Santiago is his oldest son who wants to distance himself from his family and Ambrosio was his chauffeur who, despite reasons not to, admires Don Fermin.There are a number of good depictions, the complexity of relationships in families, the limited options and vulnerability of single women in lower class families, and how elections were likely staged and government business done in Peru in the Odria years.Upon finishing the book I went back and did a browse of chapters 2 and 3 and saw, even knowing the story, how difficult this story is to piece it together.  My advice to anyone reading this book, is to stay with it. Don't back track.  Sometimes the answers are ahead, sometimes the character or issue disappears.I recently read The Autumn of the Patriarch which has a format that is even more challenging than this for the reader. I gave it 5 stars because the metaphor was powerful and worth wading through the long sentences and paragraphs. This novel is longer, but not as dense.  While it may have more meaning for those more closely attuned to the politics of Peru, for me, the message is not equal to the effort."}]}, "authors": ["Mario Vargas Llosa"], "isbn": "0060732806", "longitude": -77.0365256, "periods": ["1900s"], "title": "Conversation in the Cathedral", "word_cloud": "excellent discussion create environment classroom not preachy earth use secular classroom very progressive tip delivery quickly comfortable nice sister gift someone study become chef take box nice product weight handle good cut even smaller hand felt comfortable size recommend equally adept insightful authentically advanced essay form utterly unique voice many register interest good work unique begin find hard follow plot jump time period back become accustomed literary contrivance find fascinate condemns political landscape appear nonredeemable unsuccessful candidate well understand political machination country literary masterpiece educational buy selection criterion committee comprehension silly story classic prompt delivery make easy chapters rather disturb time finally get bearing read reviewer long figure bar figure also call family speaker take bit longer yet place character get use best way envision think movie participant speak action dialog always relate set character supporter detractor stage rally control news make deal jail release opponent party fun love mistress conversationalists common connection wealthy businessman dependent government contract oldest son want distance family chauffeur reason admires number good depiction complexity relationship family limit option vulnerability single woman lower class family election likely staged government business do finishing go back browse chapter saw even know story difficult story piece together advice anyone read stay back answer ahead sometimes character issue recently format even challenge give star metaphor powerful worth wad long sentence paragraph longer dense mean closely attuned politics message equal effort", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A Haunting tale of power, corruption, and the complex search for identity.\r\n\r\nConversation in The Cathedral takes place in 1950s Peru during the dictatorship of Manuel A. Odría. Over beers and a sea of freely spoken words, the conversation flows between two individuals, Santiago and Ambrosia, who talk of their tormented lives and of the overall degradation and frustration that has slowly taken over their town.\r\n\r\nThrough a complicated web of secrets and historical references, Mario Vargas Llosa analyzes the mental and moral mechanisms that govern power and the people behind it. \r\n\r\nMore than a historic analysis, Conversation in The Cathedral is a groundbreaking novel that tackles identity as well as the role of a citizen and how a lack of personal freedom can forever scar a people and a nation.", "asin": "0060732806", "rank": "357103", "city": "Lima", "image": "https://images-na.ssl-images-amazon.com/images/I/51QWhCTqr8L.jpg", "country": "Peru", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}