{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1445, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Loved this book. Very powerful story and I especially appreciated  the authors' skill in delivering it all in a first person narrative without  succumbing to the need to explain things that the main character understands intuitively.  The Bell Jar reminds me of Catcher in the Rye in that regard.  But I feel even more bruised by how strong her delivery was of dramatic events. Also liked how well the story depicted the social conventions of a male-dominant, wildly doctored era."}, {"review_sentiment": 3.0, "review_text": "It's more of a 3.5. I really liked it but I didn't love it. And I can't even explain why I liked it."}, {"review_sentiment": 5.0, "review_text": "Having read a number  of classics, and also as a person with depression, I can say this book is excellent, probably the best I have eve  read. It captures the essence of what if feels like to be at your best and worst, and how we all deal with the reality of ourselves. Very satisfying."}, {"review_sentiment": 5.0, "review_text": "This book is incredible. I loved it so much when I first read it that I immediately re-read it. I imagine that there is a lot to connect with for any person at any life stage, but as a young women beginning to think about her place in the world it really resonated with me. I would highly recommend it, it's one of my favorite books."}, {"review_sentiment": 5.0, "review_text": "Good read. Different than I expected it would be. Starting the book I never thought mental illness would appear. This book made me realize how mental illness can start. But not only how it starts but the progression and how there are many different endings.  Good light read!"}, {"review_sentiment": 4.0, "review_text": "This was an interesting book which is supposedly a fiction book but it really is about author, Sylvia Plath's, life. She had a very promising career ahead of her but her battle with mental illness changed her course in life.  I think she is a brilliant writer and it is a shame her life ended to soon."}, {"review_sentiment": 5.0, "review_text": "I felt more in touch with the main character of this book than practically any other. Some of the outdated terms and cultural references are hard to follow, but that's what Wikipedia is for."}, {"review_sentiment": 5.0, "review_text": "Beautiful"}, {"review_sentiment": 4.0, "review_text": "I liked it but I don't know why.  It was difficult but it gave me a look inside her head.  She is disconnected and maybe wants a connection but goes into strange imaginings rather than deal with the reality around her..  She wants to love, I think, but finds it confusing.  I will read it again, someday."}, {"review_sentiment": 4.0, "review_text": "For a nineteen-year-old, Esther Greenwood has much to brag about. Brilliant and hardworking, she’s earned excellent grades as a student, won a full scholarship to a prestigious college, and has been selected as one of twelve young women to participate in a month-long prestigious New York internship. So what’s wrong with Esther?She’s slowly going mad.Towards the end of her internship, Esther begins to show evidence of emotional instability. When her mentor inquires about her future plans, Esther (who really has no concrete future ambitions) reacts as though she has been emotionally assaulted. During a photo interview, she inexplicably breaks down into tears. On her last night in the city, she fends off the unwanted advances of a “woman-hater.” She tells no one of the physical attack and returns to her hotel room. How does she react? By throwing every piece of clothing she owns from the hotel’s rooftop; she also leaves blood-stained finger marks on her face. Over the course of these events, Esther’s world becomes exceedingly internal and her logic questionable. Upon returning home, Esther receives another devastating blow to her person—this time in the form of a letter announcing that she has been not accepted into the writing program she’d been hoping to attend.The double-shock of first sexual assault and then vocational rejection catapult Esther over the edge. Sleep deprived, depressed, and delirious, Esther begins to contemplate suicide.The Bell Jar is a fascinating work. At first glance, it’s a typical slice-of-life piece about a young girl’s novel experiences in a big city. Flashbacks slow the pacing, but Plath throws in enough foreshadowing to keep the reader wanting to flip the pages. Esther’s candid observations about the goings on around her gradually shifts from entertaining to irritating—but for good reason. Esther is depressed. She is disoriented. She can’t think clearly. Her inward thoughts and outward actions reflect her madness. As Plath painstakingly illustrates to the reader, one should not blame the mentally ill person for their callousness or cruelty but the illness itself. Esther’s experience feels so authentic, that it is easy to believe that the novel is semi-autobiographical. Reading The Bell Jar is a bit like falling down Alice’s rabbit hole, but without the fun and whimsy.The novel’s open-ended conclusion reflects the reality that there are no sure answers for the mentally ill—the author herself committed suicide at the youthful age of thirty-one. “How did I know that someday—at college, in Europe, somewhere, anywhere—the bell jar, with its stifling distortions, wouldn’t descend again?” Plath’s novel is commendable for its psychological depth and recommended for its insightfulness regarding depression and suicide. Those who have struggled with depression (or know friends/family who have), however, may find it difficult to read."}]}, "authors": ["Sylvia Plath"], "isbn": "0060837020", "longitude": 0.0, "periods": ["1900s"], "title": "The Bell Jar", "word_cloud": "love very powerful story especially appreciate author deliver first person narrative succumb need explain thing main character understand intuitively remind regard feel even bruise strong delivery dramatic event also like well story depict social convention wildly doctor era really like love even like have number classic also person depression say excellent probably best eve capture essence feel best worst deal reality satisfying incredible love much first immediately imagine lot connect person life stage young woman begin think place world really resonate highly favorite good expect start never think mental illness make realize mental illness start start progression many different ending good light interesting supposedly fiction really author life promise career ahead battle mental illness change course life think brilliant writer shame life end soon felt touch main character practically outdated term cultural reference hard follow beautiful like know difficult give look head disconnect maybe want connection go strange imaginings rather deal reality want think find confuse someday much brag hardworking earn excellent grade student full scholarship prestigious college select twelve young woman participate prestigious internship wrong slowly go end internship begin evidence emotional instability mentor inquire future plan really concrete future ambition react emotionally assault photo interview inexplicably break tear last night city fends unwanted advance tell physical attack return hotel room react throw piece clothing own hotel rooftop also leave finger mark face course event world become exceedingly internal logic questionable return home receive devastate blow time form letter announce accept write program hoping first sexual assault vocational rejection catapult edge deprive depressed delirious begin fascinate work first glance typical piece young girl experience big city slow pace plath throw enough foreshadow want flip page esther candid observation going gradually shift entertain good reason depress disorient clearly inward thought outward action reflect madness painstakingly illustrate blame mentally ill person callousness cruelty illness experience feel authentic easy believe read bit fall rabbit hole fun conclusion reflect reality sure answer mentally author commit suicide youthful age know college somewhere stifle distortion descend commendable psychological depth recommend insightfulness regard depression suicide struggle depression know however difficult", "genres": ["Fiction & Literature"], "summary": "The Bell Jar chronicles the crack-up of Esther Greenwood: brilliant, beautiful, enormously talented, and successful, but slowly going under -- maybe for the last time. Sylvia Plath masterfully draws the reader into Esther&#039;s breakdown with such intensity that Esther&#039;s insanity becomes completely real and even rational, as probable and accessible an experience as going to the movies. \r\n\r\nSuch deep penetration into the dark and harrowing corners of the psyche is an extraordinary accomplishment and has made The Bell Jar a haunting American classic.\r\n", "asin": "0060837020", "rank": "4317", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51v-zo8SXkL.jpg", "country": "Boston", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}