{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 87, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I wondered about the title and now I understand. A page turner and a interesting plot. Read and understand !"}, {"review_sentiment": 4.0, "review_text": "Like most of her books this is a suspenseful page turning story.  I do like her other books better, but this was a solid read"}, {"review_sentiment": 5.0, "review_text": "Amanda Eyre Ward is a gifted writer. I'm in a book club in Austin and this is definitely on our list. I enjoyed the specific settings that were mentioned  in the book in the Austin area. I could picture them clearly. It was a hard one to put down. The characters are rich and well defined. I really appreciated the compassion and relentless commitment by Karen's lawyer and ultimately Dr Wren. Although a sad situation, I felt grateful that the characters came together in the end the way they did. Looking forward to reading another of Amanda's books."}, {"review_sentiment": 5.0, "review_text": "This book took a while to grab me but when it did I couldn't put it down.  The characters and plot line are interesting and well-developed.  Excellent read!"}, {"review_sentiment": 3.0, "review_text": "Too many coincidences"}, {"review_sentiment": 5.0, "review_text": "Very different . I liked the other book she wrote better. Can'tthink of the title right now. Will definitely read her again."}, {"review_sentiment": 5.0, "review_text": "Thoroughly enjoyed the book."}, {"review_sentiment": 3.0, "review_text": "My least favorite Amanda Ward book.  All others have been 5 stars, but this one falls short."}, {"review_sentiment": 5.0, "review_text": "What a beautiful and sensitive book.  The characters are so well drawn and so human in their flaws and their strengths.  The only good word I can think of for this well written book is illuminating.  I read a lot and I know this is a book I will remember for years to come.  My extreme gratitude to the author for creating these people who will live in my mind for a long time."}, {"review_sentiment": 3.0, "review_text": "While this book could be thought provoking. I don't think I left it with the empathy for the death row inmate that the author intended.I never really liked any of the characters which really clouds the book. I realize prisoners are vulgar but the language was a bit much and I felt it did nothing to add to the story.  Our book club read it and none of us really liked the story."}]}, "authors": ["Amanda Eyre Ward"], "isbn": "0060582294", "longitude": 0.0, "periods": ["2000s"], "title": "Sleep Toward Heaven", "word_cloud": "wonder title understand page turner interesting plot understand suspenseful page turn story like better solid gift writer club definitely list enjoy specific setting mention area clearly hard put character rich well define really appreciate compassion relentless commitment lawyer ultimately sad situation felt grateful character come together end way look forward read amanda take grab character plot line interesting excellent too many coincidence very different like write better title right definitely thoroughly enjoy least favorite others star fall short beautiful sensitive character well human flaw strengths good word think well write illuminate lot know remember year extreme gratitude author create people live mind long time provoke think leave empathy death row inmate author never really liked character really realize prisoner vulgar language bit much felt nothing story club none really like story", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Amanda Eyre Ward's debut novel is an intimate portrait of three women whose lives collide during a brutal Texas summer.\r\n\r\nIn Gatestown, Texas, twenty-nine-year-old Karen Lowens awaits her execution with a host of convicted serial killers on death row. In Manhattan, Dr. Franny Wren, also twenty-nine, tends to a young cancer patient, and resists the urge to run from her fiancé and her carefully crafted life. In Austin, Texas, brassy Celia Mills, a once-vibrant librarian, mourns her murdered husband.\r\n\r\nOver the course of the summer, fate pushes these eerily recognizable women together, culminating in a revelation of the possibility of faith, the responsibility of friendship, and the value of life. Sleep Toward Heaven is a luminous story of murder and desire, solitude and grace -- a rare literary page-turner where redemption seems perpetually within arm's reach.", "asin": "0060582294", "rank": "1205971", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41mM9JFrbfL.jpg", "country": "Austin", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}