{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 16, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "my sister, Sturdy, well balanced, great value very nice . good product with high quality. very patient and helpful."}, {"review_sentiment": 5.0, "review_text": "Purchased to practice my Spanish. It's a real challenge"}, {"review_sentiment": 5.0, "review_text": "Wonderful stories."}, {"review_sentiment": 4.0, "review_text": "Leaf Storm (1955 as La Hojarasca – The Newcomer) is set in the fictional town Macondo. It is 2:30 pm on Wednesday, 12 September 1928. It is the funeral of the foreign doctor – ‘the most hated man in town.’ Only Colonel Aureliano Buendia, his 30-year-old daughter Isabel, and ‘the child’ who is almost 11 years old, attend the funeral; the rest of the town would rather let the old doctor rot. Isabel wonders how they will treat her now.The 60-years-old doctor arrived in Macondo 25 years earlier, in 1903, and lived for the first eight years with the Colonel. Through the three narrators (three generations of the Buendia family) we learn of Isabel’s husband who abandonned her nine years ago, never to return, when ‘the child’, the boy, was two-years-old. We learn of the Colonel’s wife, Adelaida, and ‘Pup’ the priest. And we learn why the townfolk despise the foreign doctor so much.Leaf Storm is about abandonment, loss, betrayal, rejection, solitude, reclusion and isolation, and the rituals of death. The writing of Gabriel Garcia Marquez is succinct, evocative, and sensory. This novella is the precursor to One Hundred Years of Solitude (1967, published in English in 1970) set in the same fictional town, with some of the same characters. Although I am reading this novella many years after reading the novel, it nevertheless excels as a stand-alone short story by the Colombian winner of the 1982 Nobel Prize in Literature. And it makes me want to read One Hundred Years again."}, {"review_sentiment": 4.0, "review_text": "Good book."}, {"review_sentiment": 5.0, "review_text": "Brilliant author and great set of short stories. The short stories make fun campfire tales."}, {"review_sentiment": 5.0, "review_text": "... which was actually the initial prelude. I've read a number of the works of Gabriel Garcia Marquez, most notably, his classic One Hundred Years of Solitude (Harper Perennial Modern Classics) as well as Love in the Time of Cholera (Oprah's Book Club). I first read \"Leaf Storm\" a few decades ago, and decided it needed a re-read. Like William Faulkner, who found a seemingly inexhaustible source of material in that small postage-stamp size of earth that is Lafayette Co., Mississippi, which he fictionalized as Yoknapatapa Co., so too Marquez produced story after story based on his own town of Aracataca, Columbia, which he would fictionalize as Macondo. Both Faulkner and Marquez would win the Nobel Prize, separated by a bit more than four decades.\"Leaf Storm\" was published twelve years before \"One Hundred Years...\" It is a novella which sets the stage for his later work. All the familiar elements are there: the town itself, of Macondo. Always in the background is the Civil War, which tore Columbia apart, dating from the 19th Century. The Civil War provides so much of the impetus for current actions. And there is the \"magical realism\" that is the hallmark of Marquez' style... those seemingly impossible events that just happen.Marquez draws the reader in with the death of a doctor that the town hated. The search for the \"why\" carries the reader through the first half of the novella. As Marquez describes the town's feelings, in a style reminiscent of Faulkner : \"...satisfied rather at seeing the longed-for hour come, wanting the situation to on and on until the twirling smell of the dead man would satisfy even the most hidden resentments.\" In fact, the authorities deliberately delay burying him... so that the town can smell the odor of his dead flesh. Now, that is hatred, in a classic sense.  So, what did the doctor do to merit this? It is actually what he did NOT do: he refused to treat wounded soldiers during the Civil War.  Hum. Proving that there are many disparate threads that seem to tie together, I had to reflect upon the various administrators of VA hospitals who denied medical care to veterans. As the priest in Marquez' story posits it: their burial should be conducted by the sanitation department.In this early novella of Marquez, his narrative powers are quite apparent. He tells the story from three different points of view, which span three generations. There is Colonel Aureliano Buendia, who, as a point of honor, originally decided to shelter the doctor, and is determined to see that he has a proper burial, despite the town's feelings. The other two narrators are Buendia's daughter, Chabela, and her child. And always, there is how Marquez describes Macondo, and its founding: \"Arriving there, mingled with the human leaf storm, dragged along by its impetuous force, came the dregs of warehouses, hospitals, amusement parlors, electric plants; the dregs made up of single women and men who tied their mules to hitching posts by the hotel, carrying their single piece of baggage, a wooden trunk or a bundle of clothing, and in a few months each had his own house, two mistresses, and the military title that was due him for having arrived late for the war.\"The publisher of my copy, issued in 1979, was Picador. They tacked on six short stories, of varying quality, as it always seems, to fill out their offering.  \"The Last Voyage of the Ghost Ship\" is five pages long, but only one sentence.  Take a deep breath.  It is a stylistic precursor to The Autumn of the Patriarch.  And I found the story \"Blacaman the Good, Vendor of Miracles\" a riff, between Lawrence Ferlinghetti and Thomas Pynchon.I was going to originally rate it 4-stars, since I found the ending somewhat unsatisfactory, but upon further reflection, decided it was simply an excellent prelude for \"100 years...\", thus, 5-stars."}, {"review_sentiment": 4.0, "review_text": "Cut to the Chase:The stories that work in this novel are powerful and enthralling… the first line, spoken by a young boy, is “I’ve seen a corpse for the first time.”  Each of the stories in this collection is dense, seeming to reach beyond the dramas of each character’s individual events and tragedies, but it is the title story which most diligently holds and mesmerizes us. Though the other stories in the collection are well-written and constructed, I have to admit that they didn’t pull me in the same way – many are fable-like: a man with wings, a vicious miracle-seller swindler whose child assistant becomes a true miracle-worker, an unidentified drowned man who seems to have such fantastical proportions that he eventually changes the way the villages think as well as how they construct and design their houses. The pacing also slows down after the title story, and while the passages are often quite poetic and beautiful, there is often very little action to push the story forward. The stories are still entertaining, just less involving, depending more on lyrical language than compelling or realistic characters.Greater Detail:“Leaf Storm” is short and covers only 30 minutes in the lives of three protagonists, a young boy, his mother, and his grandfather, as they each separately prepare for the funeral of the dead doctor. Through our changing narrators we learn about the history of the town – how the leaf storm brought a banana company which transformed Macondo, at least temporarily, into a thriving, prosperous town.  We learn how the doctor, unnamed throughout the piece, first arrived to the colonel’s family and set up his practice, only to be forgotten when the banana company’s physicians replaced him.  We’re told that the doctor locked himself into his room, receiving no patients and seeing no visitors for years afterwards – not even Meme, who worked as a servant within the colonel’s household and eventually became the doctor’s mistress.  The stories unfold slowly and mysteriously – we start at the end, when the doctor is dead, when the town has already collapsed, become abandoned, and we are taken slowly through the past, so that each of the little mysteries are answered: what happened to the young boy’s father, why the doctor is hated, as well as why the colonel seems determined to secure a respectable burial for the doctor.Other selected synopses:“A Very Old Man with Enormous Wings” – an old man who speaks an unintelligible language (which a priest quickly concludes is not Latin) and has enormous (though tattered) wings is found hurt and kept in the chicken coop, where an enterprising couple decide to sell admission“The Handsomest Drowned Man in the World” – a fable-like tale about how the discovery of a very large, very handsome drowned man captures the hearts and imaginations of a small fishing village.“Blacaman the Good, Vendor of Miracles” — a fable-like tale about a charlatan who sells miracles and restorative ointments and buys a local boy to be his apprentice/accomplice.“Monologue of Isabel Watching It Rain in Macondo” – the only one that is linked back to the title story, has Isabel, the middle generation representative from our title story, recalling a large rain storm while her husband was still living with them, she was pregnant, and the doctor (though unmentioned) was still alive.“Nabo” – another fable-like tale about a man who is kicked in the head by a horse and afterwards lives in total seclusion and isolation, so that the only reason people know he is still alive is because the food they prepare for him is taken and eaten, three times a day, for years.Comparisons to Other Authors:I’ve mostly just read Marquez’s older works, and this is a much quicker introduction to a master writer. Though it veers from fantastical to real throughout the collection, and I think that not all of the stories are as tightly wound as the first, it’s a good set of stories. In terms of other short story collections that tie together as a connected series of short stories, I can’t think of examples that are older, but it seems increasingly common in newer works (Melissa Bank’s The Wonder Spot, the last few stories in Lahiri’s Unaccustomed Earth — though I would probably pick this collection over either of those)."}, {"review_sentiment": 5.0, "review_text": "I especially loved the \"A Very Old Man with the Enormous Wings.\" It smacked of surrealism and was simply and beautifully written. Very melancholic in tone and narrative, as expected of Gabriel Garcia Marquez."}, {"review_sentiment": 5.0, "review_text": "What can I say?There is a reason that Gabriel Garcia Marquez is a master. He didn't just have a unique and powerful way of writing, he also had a unique and powerful way of seeing the world around him. I am also reading Gabriel Garcia Marquez, A Life by Gerald Martin. It has been a fascinating journey, reading Leaf Story as I read about the early years of his life in Colombia and traveling in Europe, what used to be the U.S.S.R., the United States, and Cuba.It was easy to give this book 5 stars. A Very Old Man With Enormous Wings may still be my favorite story, but the entire book got under my skin.\u2028The brilliance is this: The leaf storm is the arrival of--for lack of a better term--industry to the small town of Macondo. The leaf trash are the elements of the population that the storm blows into town, leaving the residents already there feeling like outsiders.This is presented in the prologue. What follows is so unique. It is not factual, it is like watercolor bleeding on a wet canvas. The stories sprawl into the psyches of the imagined citizens. We get their hearts and souls.I've written about each of the stories on my blog [...] on the entries between October 18, 2012 and November, 19, 2012.It is really unfortunate that this treasure has not become available for ereaders."}]}, "authors": ["Gabriel García Márquez"], "isbn": "006075155X", "longitude": 0.0, "periods": ["2000s"], "title": "Leaf Storm: and Other Stories", "word_cloud": "sister well balance great value nice good product high quality patient helpful purchase practice spanish real challenge wonderful set fictional town pm funeral foreign doctor hat man only daughter child almost year old attend funeral rest town rather old doctor rot wonder treat doctor arrive year earlier live first year narrator generation family learn husband abandon year ago never return child learn wife priest townsfolk despise foreign doctor abandonment loss betrayal rejection solitude preclusion isolation ritual death write succinct evocative sensory novella precursor year publish set fictional town character read novella many year read nevertheless excels short story colombian winner make want year good brilliant author great set short short make fun campfire tale actually initial prelude number work notably classic well first decade ago decide need find seemingly inexhaustible source material small size earth fictionalize produce story story base town separate bit decade publish year year novella set stage later work familiar element town background tear apart date provide much impetus current action magical realism hallmark style seemingly impossible event draw death doctor town hat search carry first half novella describe town feeling style reminiscent satisfy rather see hour want situation twirl smell dead man even hidden resentment fact authority deliberately delay bury town smell dead flesh now hatred classic sense doctor merit actually refuse treat wound soldier many disparate thread seem together reflect various administrator hospital deny medical care veteran priest story posit burial conduct sanitation early novella narrative power quite apparent tell story different point view span generation point honor originally decide shelter doctor determine see proper burial town feeling narrator daughter child always describe found mingle human storm drag along impetuous force come dreg warehouse hospital amusement parlor electric plant dreg make single woman men tie mule hitch post hotel carry single piece baggage wooden trunk clothe month house mistress military title due arrive late war publisher copy issue tack short vary quality always seem fill offer last page long sentence deep breath stylistic find story riff go originally rate find end somewhat unsatisfactory reflection decide simply excellent prelude year thus work powerful first line speak young boy see corpse first collection dense seem reach drama character individual event tragedy title story diligently hold mesmerizes collection construct admit pull way many man wing vicious swindler child assistant become true unidentified drown man seem fantastical proportion eventually change way village think well construct design house pacing also slow title story passage often quite poetic beautiful often little action push story forward still entertain le involve depend lyrical language compel realistic short cover minute life protagonist young boy grandfather separately prepare funeral dead doctor change narrator learn history town storm bring banana company transform least temporarily thrive prosperous town learn doctor unnamed piece first arrive colonel family set practice forgotten banana company physician replace tell doctor locked room receive patient see visitor year afterwards even work servant colonel household eventually become doctor mistress unfold slowly mysteriously start end doctor dead town already collapse become abandon take slowly past little mystery answer happen young boy father doctor hat well colonel seem determined secure respectable burial select synopses very old man speak unintelligible language priest quickly conclude enormous tattered wing find hurt kept chicken coop enterprising couple decide sell admission tale discovery large handsome drown man capture hearts imagination small fishing tale charlatan sell miracle restorative ointment buy local boy watch link back title story middle generation representative title story recall large rain storm husband still live pregnant doctor unmentioned still tale man kick head horse afterwards live total seclusion isolation reason people know still alive food prepare take eaten time day mostly older work much quicker introduction master writer veers fantastical real collection think tightly first good set term short story collection tie together connect series short think example older seem increasingly common newer work last probably collection especially love wing smack surrealism simply beautifully write melancholic tone narrative expect say reason master unique powerful way write also unique powerful way see world also read fascinate journey read early year life travel use easy give star very man enormous wing still story entire get brilliance storm arrival lack better term industry small town trash element population storm blow town leave resident already feel present prologue follow unique factual watercolor bleed wet canvas sprawl psyche imagine citizen get heart write entry really unfortunate treasure become available reader", "genres": ["Fiction & Literature"], "summary": "For Garcí a Má rquez the world contains mysteries that we need and can easily live with, but also miracles that we cannot understand, that speak for forces unknown to men. \r\n\r\n'Leaf Storm,' then, brings together both García Márquez's early and late styles. The former deserves our respect; the latter requires our celebration.\r\n\r\n", "asin": "006075155X", "rank": "99198", "city": "Aracataca", "image": "https://images-na.ssl-images-amazon.com/images/I/617AHZhDksL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}