{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1552, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "One Hundred Years of Solitude is difficult to understand. The only reason why I was able to comprehend the book was because I would write a small summary of each page in the margins, which was very time consuming.The novel is very negative. The characters in the book are \"solitary\" because of their inability to emotionally connect with others. Márquez presents several types of solitude throughout the novel by telling the story of the Buendía family. Despite giving the reader heavy \"truths\" about human nature in One Hundred Years of Solitude, he gives no hope. Unlike other books like Of Mice and Men and The Little Prince, Márquez compares love to diesease and even says that love can cause loneliness.It is a good book with a deep message, I just did not personally like the fact that there was no uplifting parts of it."}, {"review_sentiment": 5.0, "review_text": "Love this author"}, {"review_sentiment": 3.0, "review_text": "This book tells the stories of several generations of a founding family of a remote Colombian village. Their lives are filled with strange, magical happenings presented as though they were ordinary. It is a confidently contained world that presents various themes often found in South/Central American history. I enjoyed it. I marveled at the world and the characters and the fantastic events, but, after a while, I didn't care as much.  I didn't gather any insights into human nature (I suppose that is not a requirement) or learn anything about more ordinary societal forces (also not a requirement). It was an entertaining and well-crafted story, but it doesn’t give you anything to take with you. I don’t think that it is a book that I’ll think much about again or want to return to. But reading is personal. I can understand why others find the world so engrossing and memorable."}, {"review_sentiment": 5.0, "review_text": "Love it."}, {"review_sentiment": 5.0, "review_text": "Great content. Punctual delivery.Thanks"}, {"review_sentiment": 5.0, "review_text": "Many of the negative reviews here find this book 'boring' and 'dense'. Those who are looking for a light page-turner, in a style of Like Water for Chocolate (which is not to say that LWFC is worse - just very different) will be bored and will not appreciate the richness of the experience that is One Hundred Years of Solitude. This masterpiece is hard to describe in its multilayered complexity, the poetry and the rhythm of style, the symbolism and the many themes that run through it: love, death, oblivion, war, the havoc wrought by progress and fate. Yes, this book is fatalistic, especially as it observes Latin American history flow. Written at a time when Colombia was just emerging from another very violent period (only to be thrown head first into yet another), it seems Colombia, no, Latin American, no, world story as rather hopeless. We, as Colombians, Latin Americans, humans are doomed to walk in circles, repeat the same mistakes despite of our best efforts. One should be a little bit familiar with Colombian history to fully appreciate it, but one can still relate regardless as the voice that speaks through this work does not have a country."}, {"review_sentiment": 4.0, "review_text": "One Hundred Years of Solitude is the story of seven generations of a prominent Colombian family living in the fictional town of  Macondo which was founded by the family patriarch, José Arcadio Buendía.  Initially, the town is isolated from the rest of the world, but with the arrival of the railroad, it becomes connected.  Among the many family characters, there are themes of inherited traits, incest, selfishness and licentiousness.  In keeping with the style of magical realism, there are some startling events: five years of non-stop rain and one year of contagious insomnia, for example, which are presented as unremarkable in a laconic tone.  There are many references to real events in Colombian history: a long-drawn-out civil war, colonization by an American fruit company and the cover-up of the massacre of workers.  Each of the characters is distinctive and memorable, principally for their actions, which, in some cases, are outrageous, rather than their beliefs.  Life is not presented as a happy, constructive experience, and memory in not to be trusted.This is clearly a great classic in its innovative style, its extraordinary imagination, fluid writing, and in the complexity of the human issues on which it touches.  Paradoxically, while I found it difficult to read – to follow the thread of the author’s imagination, I could not put the book down: I had to find the conclusion.  (The family and the town die out.)  At over 400 pages, it is not a short book, but it is also intense and dense.  Often, the novel is written in stream-of-consciousness style, with breathless transitions from one event to the next.  There is very little dialogue to relieve the narrative, and the narrative itself can be quite complicated.  There is one sentence in the book which goes on for a page and a half.  To do One Hundred Years of Solitude its due, one needs to be in a position to read it deliberately, without distraction, so that the dots – or at least most of them – are connected."}, {"review_sentiment": 2.0, "review_text": "Sorry, I don't get it."}, {"review_sentiment": 5.0, "review_text": "I am quite the avid reader, and I like to ask people for book recommendations. This book was recommended to me by my economics professor, and I read it when I got the chance.Out of the dozens of books I've read this year, this has stuck out as among my favorites I've ever read. The story is moving, thought provoking, and challenging. The way the characters are depicted changed the way I see how people interact with the world. The theme of solitude is strong in the book, and it has changed the way I think about changes in the world. I fully recommend that everyone read this book."}, {"review_sentiment": 1.0, "review_text": "I found it boring and pointless. Tried my hardest to finish it but quit with a 50 paged left and just read a summary of the end. I’m glad I did because I probably would have thrown my book at the wall at the end.The author can’t decide if he wants to be realistic or fantastical, and leaves itself in a state where it is difficult for me to suspend my disbelief and often just mumbled wtf.."}]}, "authors": ["Gabriel García Márquez"], "isbn": "0060883286", "longitude": 0.0, "periods": ["1800s", "1900s"], "title": "One Hundred Years of Solitude", "word_cloud": "difficult understand reason able comprehend small summary page margin time character solitary inability emotionally connect others present several type tell story family give heavy truth human nature give hope compare love disease even say love cause good deep message personally fact uplifting part author tell stories several generation found family colombian village life fill strange magical happening present ordinary confidently contain world present various theme often find american history enjoy marvel world character fantastic event care much gather insight human nature suppose requirement learn anything ordinary societal force also requirement entertain story give anything think think much want return read personal understand others find world engross memorable content many negative review find look light style say worse different bore appreciate richness experience masterpiece hard describe multilayered complexity poetry rhythm style symbolism many theme run love death oblivion war havoc work progress fate fatalistic especially observe latin american history flow time emerge violent period head first yet seem american world story rather hopeless human doom walk circle repeat mistake best effort little bit familiar colombian history fully appreciate still regardless voice speaks work country story generation prominent colombian family live fictional town found family patriarch town isolate rest world arrival railroad becomes connect many family character theme inherited trait incest selfishness licentiousness keep style magical realism startle event rain year contagious insomnia example present unremarkable laconic tone many reference real event colombian history civil war colonization american fruit company massacre worker character distinctive memorable principally action case outrageous rather belief present happy constructive experience memory clearly great classic innovative style extraordinary imagination fluid write complexity human issue touch paradoxically find difficult follow thread author imagination find conclusion family town die page short also intense dense write style breathless transition event little dialogue relieve narrative narrative quite complicate sentence go page half due need position deliberately distraction dot least connected get quite avid ask people recommendation recommend economics professor get dozen year stick favorite ever story move think provoke challenge way character depict changed way see people interact world theme strong change way think change world fully recommend everyone find bore pointless hardest finish quit page leave summary end glad probably wall author decide want realistic fantastical leaf state difficult suspend disbelief often mumble", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "One Hundred Years of Solitude tells the story of the rise and fall, birth and death of the mythical town of Macondo through the history of the Buendia family. Inventive, amusing, magnetic, sad, and alive with unforgettable men and women -- brimming with truth, compassion, and a lyrical magic that strikes the soul -- this novel is a masterpiece in the art of fiction.\r\n\r\nThe story follows the epic of the foundation, greatness and decline of the fictitious village of Macondo (based on the real town of Aracataca) and its pioneering and most illustrious family, the Buendias, who live their lives struggling against failings of the Colombian republic and the ordeals of fate, time and existence. \r\n\r\nOne Hundred Years of Solitude is a work of giant, epic theatre, where myths engender men who in turn generate myths, like in Homer, Cervantes and Rabelais. It is a chronicle of an isolated microcosm of life and society, with its fabulous genesis and apocalypse. The story of the village and the descendants of the Buendias, from foundation to extinction, is the heart of a wonderfully magical and poetic tale, one that is almost unparalleled in both its unbridled fantasy and the captivating style of its extraordinary author. \r\n\r\nMacondo is the ultimate example of the modern world, a world of infinite possibilities for both enrichment and destruction, and one in which time passes in a peculiar, cyclical way. Until the end its characters appear inextricably complicit in this process, because of “facts which nobody believes but had affected their lives so that they were both drifting on the surf of a bygone world that lived only nostalgia.\"\r\n\r\n“More lucidity, wit, wisdom, and poetry than is expected from 100 years of novelists, let alone one man.” Washington Post ", "asin": "0060883286", "rank": "3087", "city": "Aracataca", "image": "https://images-na.ssl-images-amazon.com/images/I/51tkcSAhSDL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}