{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 57, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "Not my favorite Kunder's piece but very interesting story."}, {"review_sentiment": 4.0, "review_text": "His first novel and I think it's one of his best. Kundera really gets to the core what it means to be human, IMO."}, {"review_sentiment": 5.0, "review_text": "Fantastic. Kundera's ability to evoke raw emotion is unparalleled. Reading his novels always stir up anger, passion, desire, sadness and more. This is no exception. 10/10 would recommend if you want to read a compelling novel that mixes fiction with philosophy."}, {"review_sentiment": 5.0, "review_text": "Good book"}, {"review_sentiment": 5.0, "review_text": "Less philosophical than Kundera's second book, more of a criticism of Communism.  It's the second best prose I've ever read."}, {"review_sentiment": 5.0, "review_text": "This book is brilliant. Kundera is of course a fine writer. What I find distinctively wonderful about this book is the intensity of both thought and feeling throughout, reminiscent of Dostoevksy's \"The Brothers Karamazov.\" Both characters and plot are secondary.The book switches from one narrator to another and back again. Here it is not so convincing to me as truly different characters. Different stereotypes and voices, yes. And the book therefore maintains its intellectual drive. But the overall perspective seems to be that of the protagonist Ludvik. Also, the male characters seem to be better developed than the female characters. A high (or low!) point is the almost unbearably exquisite depiction of Ludvik's experience of unrequited young love.The title of the book is itself interesting to contemplate. There is an explicit joke early in the book that sets the plot (or more like a series of episodes) in motion. But clearly the notion of a joke is meant to apply more broadly in the book. I'm not quite sure the book has a \"moral,\" but if it does, one candidate for that moral would surely be that life -- romantic, political, religious -- is a joke. (And it's on us.)"}, {"review_sentiment": 5.0, "review_text": "One of my all-time favorite books. The complexity of the characters combined with the events of the era bring this book to life. By the end of the book you feel like you were a part of the story."}, {"review_sentiment": 5.0, "review_text": "Milan Kundera's second best to The Unbearable Lightness of Being."}, {"review_sentiment": 4.0, "review_text": "sometimes hard to read but delightful"}, {"review_sentiment": 4.0, "review_text": "Published in 1967, and yet it is painfully relevant to the sense of fragility, lack of continuity in the identity of self and nation.  The book has four main characters--Ludvik, Jaroslav and Helen and Pavel Zemanek--all of them trying to decipher the meaning of being an individual in Czach history.  The adversities, as absurd as nightmarish jokes, fall on them, and all of them, at one time of another, become somebody's victim or perpetrator in the whirlpool of extreme vigilance for political witch hunt. In the end, the author expresses the bottom line, simple human denominator that can bring them together. \"What had suddenly destroyed the old barriers....?\", referring to his returning to folk music, \"I could love it because this morning I had found it in its forlornness; in its forlornness and in its abandonment; it was abandoned by pomposity and publicity, abandoned by political propaganda, abandoned by social utopias, abandoned by the swarms of cultural offcials, abandoned by the affected adherence of my contemporaries, abandoned.....this abandonment had purified it; purified it like someone with not long to live; illuminated it with an irresistible ultimate beauty; that abandonment was giving it back to me.\"  The stories of these characters are dark and tragically comedic as well, and in the classic Kundera style, complex, deeply philosophical and thought provoking as well as entertaining."}]}, "authors": ["Milan Kundera"], "isbn": "006099505X", "longitude": 14.4212535, "periods": ["1900s"], "title": "The Joke", "word_cloud": "not favorite piece interest story first think best really get core mean human fantastic ability evoke raw emotion unparalleled novel always stir anger passion desire sadness exception want compelling mix fiction philosophy good philosophical second criticism second best prose ever brilliant course fine writer find distinctively wonderful intensity think feel reminiscent character plot switch narrator back here convince truly different character stereotype voice yes therefore maintains intellectual drive overall perspective seem protagonist also male character seem better develop female character a high low point almost unbearably exquisite depiction experience unrequited young title interesting contemplate explicit early set plot series episode motion clearly notion mean apply broadly quite sure moral candidate moral surely life romantic political religious favorite complexity character combine event era bring life end feel part story second best unbearable sometimes hard delightful publish yet painfully relevant sense fragility lack continuity identity nation main character try decipher mean individual history adversity absurd nightmarish joke fall time become somebody victim perpetrator whirlpool extreme vigilance political witch hunt end author express bottom line simple human denominator bring together suddenly destroy old barrier refer return folk music morning find forlornness forlornness abandonment abandon pomposity publicity abandon political propaganda abandon social utopia abandon swarm cultural official abandon affected adherence contemporary abandon abandonment purified purify someone long live illuminate irresistible ultimate beauty abandonment give story character dark tragically comedic well classic style complex deeply philosophical thought provoke well entertain", "genres": ["Fiction & Literature"], "summary": "All too often, this brilliant novel of thwarted love and revenge miscarried has been read for its political implications. Now, a quarter century after The Joke was first published and several years after the collapse of the Soviet-imposed Czechoslovak regime, it becomes easier to put such implications into perspective in favor of valuing the book (and all Kundera 's work) as what it truly is: great, stirring literature that sheds new light on the eternal themes of human existence.\r\n\r\nThe present edition provides English-language readers an important further means toward revaluation of The Joke. For reasons he describes in his Author's Note, Milan Kundera devoted much time to creating (with the assistance of his American publisher-editor) a completely revised translation that reflects his original as closely as any translation possibly can: reflects it in its fidelity not only to the words and syntax but also to the characteristic dictions and tonalities of the novel's narrators. The result is nothing less than the restoration of a classic.", "asin": "006099505X", "rank": "102347", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/41RRcwzzC3L.jpg", "country": "Czechia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}