{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 22, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "I am reluctant to review this book because I do not like historical fiction,,,,and I especially dislike historical fiction wth a focal point of romance.  I read this for  book club.  When I reconciled myself to reading this type book I got with it and  found it interesting.  I liked Annette Vallon.  Although the  beginning time period was 1821, Annette was a \"today girl\".  She was unashamedly a single mom, educated, intelligent, and reckless .  She expertly  rode her beloved horse, could shoot , and hunt with the best.  These traits did not endear her to  mom who was interested in living only for the judgements of society.  Annette's lover was William Wordsworth, a  poet and an Englishman who was in France at the beginning of the French Revolution.Tipton does a fine job of writing the French Revolution and the brutality of the war years.  Annette is an underground terrorist and is a folk hero of this period.  I became a bit frustrated with the love between Annette and Wordsworth.  Due to war the lovers  rarely saw each other, Annette  remained true to Wordsworth, however his love diminished with time.  The narrative was informative about the French Revolution.  Tipton writes well and tells a good story."}, {"review_sentiment": 2.0, "review_text": "Set during the French Revolution. This is a story of Annette Vallon – William Wordsworth’s mistress and muse. “Born into a world of wealth and pleasure, she enjoys the privileges of aristocracy. Spoiled by the novels of Rousseau, she refuses to be married unless it is for passion.”This story was supposed to “capture the courage and fearlessness of a woman whose dramatic story illuminates a turbulent and fascinating era.”I did not feel her courage or the atmosphere of the French Revolution. This book reads as an encyclopedia. If you are looking for a book, which gives a vibrant picture of that era, I recommend Madame Tussaud by Michelle Moran."}, {"review_sentiment": 4.0, "review_text": "If you think the French revolution is just about the rich and off with their heads you're mistaken. The French revolution was really ugly and affected everyone. This book portrays it accurately down to what happened to the Butcher the baker the candlestick maker all were affected with prison and death and the guillotine. Well written and will appeal to history buffs an avid readers alike"}, {"review_sentiment": 4.0, "review_text": "James Tipton is a fine writer and his portrayal of Wordsworth's liason with Annette Vallon has to be commended.The story, which is set against the backdrop of The French Revolution is well written and one that needed to be told.Writing historical fiction must be a difficult chore indeed and Tipton does a fine job with his research and the portrayal of Wordsworth and Vallon.I have to admit I did find it a bit slow at times but I am so glad I persevered because I have more knowledge of this period now and of Wordsworth's relationships of which I had no knowledge whatsoever.It was interesting to me that Annette Vallon had been previously described by British writers as someone rather loose and vapid.Might I suggest that Wordsworth may have been the more vapid of the pair as Annette accomplished incredible acts of bravery during the upheavals in France whilst Wordsworth had to call upon two women to assist him with his various trials and tribulations which were small beer when compared to his former lover and mother of his child.Since reading this book there is no doubt Annette Vallon will remain in my heart as a brave and compassionate soul whose real story deserved to be told.Congratulations to James Tipton for an intelligent and fascinating story."}, {"review_sentiment": 5.0, "review_text": "I met James Tipton at Lilys restaurant in Mount Shasta, CA, where I am a server.  During that encounter I learned of this novel and its content.  I bought it as a summer read.  I am well into the novel now and I am enjoying it.  I like a historically based novel and this one has amazing descriptions that take me right in the Annette Vallon's life.  Worth reading.  Thanks James for the recommendation."}, {"review_sentiment": 5.0, "review_text": "James Tipton’s Annette Vallon must be savored sentence by sentence. The novel is founded on history, but extra-literary: a tale recounting events in William Wordsworth’s life as recorded in the letters of the poet and his lover Vallon.  A poet himself, Tipton instills poetry in a tale that seems to follow faithfully the events of those lives.  His prose is appropriately and constantly lyrical; the force of the poetic line appears throughout, a fact that propels a long, complex story without slackening for nearly five hundred pages."}, {"review_sentiment": 5.0, "review_text": "The story started out a bit slow for me, but I'm glad I read on because I found myself being spirited away with Annette on some very tense adventures during the Fresh Revolution. I was never particularly interested in the French Revolution prior to reading this book and was astounded by the brutality and the vacillating loyalties inherent during that period of time. I now want to learn more. Annette was far more brave than I would have imagined considering her background and the fact she was a woman in a man's world. She was also far more patient that I would have ever been under the circumstances. A remarkable woman brought to life again by James Tipton. I highly recommend this book on many levels."}, {"review_sentiment": 2.0, "review_text": "This book, written from the perspective of a woman does not ring true.  I know the male author probably thinks he did a brilliant job - but I was expecting something on the level of Balzac.  Instead, this reads more like a Harlequin Romance novel.  The story is ponderous - the dialogue is laughable.  I was never captivated while reading it and it took an effort to finish it.  Read, \"Dangerous Liaisons\" instead - it's a genuine masterpiece."}, {"review_sentiment": 5.0, "review_text": "I was looking for an interesting novel to read about France while we traveled there this summer.This novel provided just what I was looking for. History of the French Revolution told by a woman who became stronger still because of the times and circumstances she was placed in. Love, mystery and memorable characters. It will probably be a reread for me."}, {"review_sentiment": 5.0, "review_text": "I have always thought this story should be told, but I was imagining it from Wordsworth's side.  I discovered Tipton's novel to see if my idea had been done, and if so, done well.  It has been.  And I think this is stronger for being told from Annette's side.  It is an adventure story but I do like the theme, of the value of young, passionate feeling and the tragedy of its loss; of life lived well in difficult times.  Highly recommended."}]}, "authors": ["James Tipton"], "isbn": "0060822228", "longitude": 2.3514992, "periods": ["1700s", "1800s"], "title": "Annette Vallon: A Novel of the French Revolution", "word_cloud": "reluctant review like historical fiction especially dislike historical fiction wt focal point romance club reconcile read type get find interest like begin time period today girl unashamedly single mom educate intelligent reckless expertly ride beloved horse hunt best trait endear mom interested living judgment society lover poet begin fine job write war year terrorist folk hero period become bit frustrated love war lover rarely saw remain true however diminished time narrative informative write well tell good story story mistress muse world wealth pleasure enjoy privilege aristocracy spoil novel refuse married story suppose capture courage fearlessness woman dramatic story illuminates turbulent fascinate feel courage atmosphere read encyclopedia look give vibrant picture era recommend think rich head mistake really ugly affect everyone portray accurately happen baker candlestick maker affect prison death guillotine write appeal history buff avid reader alike fine writer portrayal liaison story set well write need historical fiction difficult indeed fine job research portrayal admit find bit slow time glad persevere knowledge period relationship knowledge interest previously describe british writer someone rather loose suggest wordsworth pair accomplish incredible act bravery upheaval whilst woman assist various trial tribulation small beer compare former lover mother read doubt remain heart brave compassionate soul real story deserve intelligent fascinate story meet restaurant server encounter learn content buy summer well enjoy like historically base amazing description right life read recommendation sentence sentence founded history tale recount event life record letter poet lover poet instill poetry tale seem follow faithfully event live prose appropriately constantly lyrical force poetic line appear fact propels long complex story slacken nearly hundred page story start bit slow glad find spirit away tense adventure fresh never particularly interested prior read astound brutality vacillate loyalty inherent period time want learn far brave consider fact woman man world also far patient ever circumstance remarkable woman bring life highly recommend many level write perspective woman ring true know male author probably think brilliant job expect something level instead read story ponderous dialogue laughable never captivate read take effort finish instead genuine masterpiece look interest travel provide look tell woman become stronger still time circumstance place mystery memorable character probably reread always think story tell imagine wordsworth side discover see idea do do well think stronger tell side adventure story like theme value young passionate feeling tragedy loss life live well difficult time recommend", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Born into a world of wealth and pleasure, Annette Vallon enjoys the privileges of aristocracy, but a burning curiosity and headstrong independence set her apart from other women of her class. Spoiled by the novels of Rousseau, she refuses to be married unless it is for passion. Her stubborn devotion to her romantic principles bears the sweetest fruit when William Wordsworth, a young English poet, enters her life. She will be his mistress, his muse, his obsession. But theirs is a love that will test Annette in unexpected ways, bringing great joy and gravest peril in a dark time of chaos, upheaval, and death.\r\n\r\nSet amid the terror and excitement of the French Revolution, Annette Vallon is an enthralling and evocative tale that captures the courageous spirit of a remarkable woman who, for too long, has been relegated to the shadows of history.", "asin": "0060822228", "rank": "1472796", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51NBDPw0X5L.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}