{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.1494512, "ratings": {"num_ratings": 226, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent story."}, {"review_sentiment": 5.0, "review_text": "Fast moving and historically accurate.  One of Cornwell's best books."}, {"review_sentiment": 5.0, "review_text": "I love it"}, {"review_sentiment": 5.0, "review_text": "Another great one with great historical references"}, {"review_sentiment": 4.0, "review_text": "Haven't read a Sharpe in awhile. Great battle descriptions, and a girl. What else do you need in a Cornwell book?"}, {"review_sentiment": 5.0, "review_text": "This is historical fiction at its best!  The books are well written and show the tragedy,brotherhood, emotions, and the physical and death that this type of brings!"}, {"review_sentiment": 5.0, "review_text": "Great read."}, {"review_sentiment": 5.0, "review_text": "AS ALWAYS EXPECTED"}, {"review_sentiment": 5.0, "review_text": "I have enjoyed reading the entire series over the years.  The series offers clever plots framed within the confines of the British / Indian wars and the campaign of Napoleon to capture Spain and Portugal.  There are great characters, both heroes and villains, all firmly grounded in the confines of the times and circumstances."}, {"review_sentiment": 5.0, "review_text": "Excellent series of historical fiction based on British military history."}]}, "authors": ["Bernard Cornwell"], "isbn": "0060566701", "longitude": -8.6107884, "periods": ["1800s", "Recent Releases"], "title": "Sharpe's Havoc: Richard Sharpe & the Campaign in Northern Portugal, Spring 1809", "word_cloud": "excellent story move historically accurate best love great great historical reference awhile battle description girl else need historical fiction well write show tragedy brotherhood emotion physical death type brings great enjoy read entire series year series offer clever plot frame confines british indian war capture great character hero villain firmly ground confines time circumstance excellent series historical fiction base british military history", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Richard Sharpe's Adventure Series #7\r\n\r\nSoldier, hero, rogue—the man you always want on your side. Born in poverty, he joined the army to escape jail and climbed the ranks by sheer brutal courage. He knows no other family than the regiment of the 95th Rifles, whose green jacket he proudly wears.\r\n\r\n\"The best battle scenes of any writer I've ever read, past or present. Cornwell really makes history come alive.\" George R.R. Martin", "asin": "B00EQ41IFM", "rank": "4307912", "city": "Porto", "image": "https://images-na.ssl-images-amazon.com/images/I/31VoJ83P5gL.jpg", "country": "Portugal", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}