{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 2330, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "I ended up reading it twice. I love his writing style; keeps you hooked. Definitely leaves you wanting to believe in magic."}, {"review_sentiment": 5.0, "review_text": "Incredible story telling set in a marvelous London. Fusion of creative fantasy and compelling characters I won’t soon forget. Read it!"}, {"review_sentiment": 5.0, "review_text": "I love this book, and this edition is beautiful. Neil Gaiman is such a favorite author of mine I would almost call him a friend. My nine year old son was fascinated by this book, and while he is currently too young, I look forward to sharing this story with him. The artwork is lovely and the book feels substantial in your handsz"}, {"review_sentiment": 3.0, "review_text": "Sometimes it's origin as a TV series shows through, but ultimately entertaining in its own quirky way (what would you expect from the author of Vertigo's Sandman series ?). I haven't read any of Gaiman's other prose work, but I'm more than willing to try now."}, {"review_sentiment": 4.0, "review_text": "Rich characters woven into a fun story! I certainly would not be disappointed if a sequel were to come along soon!"}, {"review_sentiment": 5.0, "review_text": "Entertaining. Especially the little short story at the end. Highly recommend. Great character development. Also liked American gods by the same wU bor"}, {"review_sentiment": 4.0, "review_text": "A beautiful world. Sufficient lore to give the story reason. Great characters."}, {"review_sentiment": 5.0, "review_text": "Great Novel"}, {"review_sentiment": 5.0, "review_text": "I loved the book.. very inventive, adventurous, and fast paced! I loved characters! I’d recommend the book to anyone who likes adventure with a little darkness!"}, {"review_sentiment": 5.0, "review_text": "Great book and interesting drawings"}]}, "authors": ["Neil Gaiman"], "isbn": "0060557818", "longitude": -0.12574, "periods": ["1900s"], "title": "Neverwhere", "word_cloud": "end read twice love write style keep hook leave want magic incredible story tell set marvelous creative fantasy compel character soon forget read love edition beautiful favorite author mine almost friend year old son fascinate currently young look forward share story artwork lovely feel substantial hand sometimes origin tv series show ultimately entertaining quirky way author series prose work willing try rich character weave fun story certainly sequel come soon entertain especially little short story end recommend character development also like american god w bro beautiful world lore give story reason character love inventive adventurous fast pace love character recommend anyone like adventure little darkness interesting drawing", "genres": ["Fiction & Literature", "Science Fiction", "Fantasy"], "summary": "The #1 New York Times bestselling author's ultimate edition of his wildly successful first novel featuring his \"preferred text\"—and including his special Neverwhere tale \"How the Marquis Got His Coat Back\".\r\n\r\nPublished in 1997, Neil Gaiman's darkly hypnotic first novel, Neverwhere, heralded the arrival of a major talent and became a touchstone of urban fantasy. Over the years, a number of versions were produced both in the U.S. and the U.K. Now Gaiman's preferred edition of his classic novel reconciles these works and reinstates a number of scenes cut from the original published books.\r\n\r\nNeverwhere is the story of Richard Mayhew, a young London businessman with a good heart and an ordinary life, which is changed forever when he discovers a girl bleeding on the sidewalk. He stops to help her—an act of kindness that plunges him into a world he never dreamed existed.\r\n\r\nSlipping through the cracks of reality, Richard lands in the Neverwhere—a London of shadows and darkness, monsters and saints, murderers and angels that exists entirely in a subterranean labyrinth. The Neverwhere is home to Door, the mysterious girl Richard helped in the London Above. Door, a noblewoman whose family has been murdered, is on a quest to find the agent that slaughtered her family and thwart the destruction of this underworld kingdom. If Richard is ever to return to his former life, he must join the journey to save Door's world—and find a way to survive.\r\n\r\nA hallucinatory fantasia of mystery, mythology, and terror that \"draws equally from George Lucas, Monty Python, Doctor Who, and John Milton.\" USA Today", "asin": "0060557818", "rank": "172877", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41zlKce4q0L.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}