{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 137, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "If only I could give these books to my younger self. I really needed them at the time."}, {"review_sentiment": 5.0, "review_text": "I started with Tales of the City - a book that was on the bookshelf at a cottage we were renting.  I am now hooked on the 7 book series - I have made it to the 3rd book, Further Tales of the City."}, {"review_sentiment": 5.0, "review_text": "I love the plot, the intrigue and the characters. Mary Ann Singleton is a classic character. I also like the mystery subplot and the somewhat happy ending. Armistead Maupin is the kind of writer that I aspire to be."}, {"review_sentiment": 5.0, "review_text": "Great continuation of the series"}, {"review_sentiment": 5.0, "review_text": "This book holds up over time.  Fast paced read, makes you feel like your in San Francisco in the 70s."}, {"review_sentiment": 5.0, "review_text": "Maupin's  characters really come to life.  I feel like I know them and they are friends.  The books are great!  I love them and want to continue \"hanging out\" with them."}, {"review_sentiment": 5.0, "review_text": "ALL of Armistead Maupin's \"Tales of the City\" books are remarkable.  I read them when they first came out, and am now re-reading them, more for nostalgic reasons.  Maupin knows how to write characters, and he gives them each their own voice:  from the young, green Maryann Singleton from Ohio, to the fabulous over 50 year old Anna Madrigal.  The stories bring you to a time before the AIDS epidemic, but also before marriage equality, where many homosexuals were still hiding who they were ~ although not as much in San Francisco!  I would recommend these books to anyone who loves a good, quick read, but a book with substance and a good story."}, {"review_sentiment": 5.0, "review_text": "As Entertaining as it was 20 years ago when I first read the book."}, {"review_sentiment": 5.0, "review_text": "absolutely fantastic. Better than the first, even."}, {"review_sentiment": 5.0, "review_text": "My favorite of his series."}]}, "authors": ["Armistead Maupin"], "isbn": "0060929383", "longitude": -122.4192363, "periods": ["1900s"], "title": "More Tales of the City", "word_cloud": "younger self really need time start cottage rent hooked series make love plot intrigue character classic character also like mystery subplot somewhat happy end kind writer aspire continuation series hold time pace make feel character really come life feel know friends great love want continue hang remarkable first come nostalgic reason know write character give voice young green fabulous year old story bring time epidemic also marriage equality many homosexual still hide much anyone love good quick substance good story year ago first absolutely fantastic first even favorite series", "genres": ["Fiction & Literature", "LGBT", "Humour"], "summary": "Book 2/9 in the Tales of the City Series\r\n\r\nThe tenants of 28 Barbary Lane have fled their cozy nest for adventures far afield. Mary Ann Singleton finds love at sea with a forgetful stranger, Mona Ramsey discovers her doppelgänger in a desert whorehouse, and Michael Tolliver bumps into his favorite gynecologist in a Mexican bar. Meanwhile, their venerable landlady takes the biggest journey of all—without ever leaving home.", "asin": "0060929383", "rank": "227991", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51geeObeoSL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}