{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 218, "rating": 3.8, "reviews": [{"review_sentiment": 1.0, "review_text": "Prose is inventive, writes beautiful elaborate sentences, and structures her books cleverly.  However, I lost interest in all the characters because they seem embodiments of a theme, or thesis, or a cliche (and the starving newspaperman in Paris who is aware that he is a cliche or the lively countess with her many lovers is not more thrilling because of that awareness, or because their self-conception is the opposite of the public persona they project).  I didn't care what happened to anyone in the book and also lost believe that any persons experienced the setting and era of the book in the way the characters did."}, {"review_sentiment": 4.0, "review_text": "Social commentary of fascinating times, Paris in the 20's, Berlin later and the horrible forming of Hitler's era.exciting, shocking, sometimes romantic"}, {"review_sentiment": 3.0, "review_text": "Not historical enough, easy read, would have loved if Violette Morris was given greater depth. It is sad the writer agreeably made her a monster rather than develop on more of how she actually was as a person in a positive light. There is always good behind the evil, of which I would have liked to hear more about. It only shed the depressing side of Violette.(Lou)"}, {"review_sentiment": 5.0, "review_text": "Fantastic book. Francine Prose puts you so deeply in the world of Paris before and after the Nazi occupation that whenever I had to put this book down I had to shake myself back into my world. This is story telling at its best---a beautifully written page turner."}, {"review_sentiment": 2.0, "review_text": "I have always been fascinated by this era.  I was sorely disappointed in this book.  Too wordy, no substance.  I did not finish it."}, {"review_sentiment": 4.0, "review_text": "My wife & I i liked the talking book version. I did not read it but she did &  preferred the talking book."}, {"review_sentiment": 5.0, "review_text": "Compelling story, creative multiple narrators, and new insights into France in the 1930's and its own winds of war."}, {"review_sentiment": 5.0, "review_text": "Read it. I liked it very much!"}, {"review_sentiment": 1.0, "review_text": "didn't finish"}, {"review_sentiment": 5.0, "review_text": "Really fun book to read"}]}, "authors": ["Francine Prose"], "isbn": "0061713805", "longitude": 2.3514992, "periods": ["1900s", "Recent Releases"], "title": "Lovers at the Chameleon Club, Paris 1932: A Novel", "word_cloud": "inventive writes beautiful elaborate sentence structure cleverly however lose interest character seem embodiment theme thesis cliche starve newspaperman aware cliche lively countess many thrill awareness opposite public persona project care happen anyone also lose believe person experience set era way character commentary fascinate time later horrible form shock sometimes romantic not historical enough easy give greater depth sad writer agreeably make monster rather actually person positive light always good evil like shed depress side fantastic put deeply world occupation put shake back world story tell best beautifully write page turner always fascinate era sorely disappoint wordy substance finish wife like talk version prefer talk compel story creative multiple narrator new insight wind war read like much finish really", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "A richly imagined and stunningly inventive literary masterpiece of love, art, and betrayal, exploring the genesis of evil, the unforeseen consequences of love, and the ultimate unreliability of storytelling itself.\r\n\r\nParis in the 1920s shimmers with excitement, dissipation, and freedom. It is a place of intoxicating ambition, passion, art, and discontent, where louche jazz venues like the Chameleon Club draw expats, artists, libertines, and parvenus looking to indulge their true selves. It is at the Chameleon where the striking Lou Villars, an extraordinary athlete and scandalous cross-dressing lesbian, finds refuge among the club’s loyal denizens, including the rising Hungarian photographer Gabor Tsenyi, the socialite and art patron Baroness Lily de Rossignol; and the caustic American writer Lionel Maine.\r\n\r\nAs the years pass, their fortunes—and the world itself—evolve. Lou falls desperately in love and finds success as a race car driver. Gabor builds his reputation with startlingly vivid and imaginative photographs, including a haunting portrait of Lou and her lover, which will resonate through all their lives. As the exuberant twenties give way to darker times, Lou experiences another metamorphosis—sparked by tumultuous events—that will warp her earnest desire for love and approval into something far more.", "asin": "0061713805", "rank": "584253", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51Vr-T4%2Bn%2BL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}