{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 163, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "I just finished reading Stiltsville for the third time (full disclosure: the author is a friend of a friend) and I liked it even more than the first two. An ode to Miami and the lush life of a family living near the water, the characters are so fully drawn that I thought about them in my off hours - wondering how they were. Even though I had a vague memory of what happens at the end of the novel, it still touched me. Very well done, Ms Daniel. I'm sure there will be a fourth reading some time in my future."}, {"review_sentiment": 5.0, "review_text": "This is a lovely novel.  When I read the first few chapters it I wasn't sure if I would like it, but I decided to hold on and I am so glad I did.  Stiltsville is the story of a marriage.  How simple, and how wonderful, is that.  The main character through whose eyes we see the action is Frances, first a girlfriend then a wife.  She is a lovely creation - I liked her so much.  And I liked her husband, Dennis.  It might sound odd for me to say this is a page-turner, but it is.  You just want to see what is going to happen to them as they go through life.  The ending was deeply moving.  You believe so fully in the marriage that it's hard to see it coming to an end.  But Frances is a strong woman.  We should all be as strong and gracious and thankful as she is when tragedy strikes."}, {"review_sentiment": 2.0, "review_text": "While this novel was sweet and loving, it was very disconnected and as one reviewer said boring at times. I read the whole book and was not sure at times why the author would move back and forth in time to explain stuff, and she tended to almost repeat herself. None of the characters were fully developed and in some cases no explanation on how events were resolve. A perfect example was Bette, she runs off on her wedding day to be with an woman. Next thing you know all are happy and Bette is living with a woman,  this was the 1970s.Oh I kept on waiting to see what would happen next, and the last part of the book was very sad and I wish the author would have in the end explained how she researched all her information on the deadly disease."}, {"review_sentiment": 5.0, "review_text": "extremely well written book and I love the premise....would highly recommend it. I love the characters."}, {"review_sentiment": 5.0, "review_text": "There is a strong suspense in this calm book--the suspense of ordinary life--embodied in the fragile stilt house that the characters inhabit in times of leisure and pleasure in Biscayne Bay, a boat ride away from their home in Miami. The suspense only builds as you come to respect, and fear for, the narrator's decency and endurance, as it is threatened by life's hazards and by her own natural desires. She is strong, sensuous, competent, and practical, and yet the author makes us see her, and her familiy's, fragility at every turn. The shells we build for ourselves like sea creatures will someday wash away, without us in them. But that does not dull the shine and wonder of our efforts."}, {"review_sentiment": 5.0, "review_text": "Excellent read and love story"}, {"review_sentiment": 2.0, "review_text": "dark and depressing. wouldn't recommend this read."}, {"review_sentiment": 4.0, "review_text": "As a person interested in Miami as a character, and the stilt houses in Biscayne bay being part of Miami's history, I was happy to finally read this book.  There is a sequel about other characters in a stilt house that I had read first, but the two novels stand alone.  This is a story of a marriage over time and the challenges of having a \"vacation home\" that is only reachable by boat.  Enjoyed it immensely."}, {"review_sentiment": 4.0, "review_text": "I met the author at a writers conference and bought her book based upon her warm personality.  The first thing I noticed while reading it was how consistently interesting the writing was, even when there was little \"action\" occurring.  I'd read 25 pages and never be bored, anxious for the next 25.This is the story of the seasons of a woman's life, from meeting, courting and marrying her husband, Dennis,  through child rearing,  the empty nest, job changes,  middle age, and finally, the sudden onset of her husband's ALS.I'm glad to have spent the time with it, and am glad to recommend it, particularly to women,  who will identify the Frances, the narrator."}, {"review_sentiment": 4.0, "review_text": "The last half of the book , I couldn't put down. It was so real and so sad at the same time."}]}, "authors": ["Susanna Daniel"], "isbn": "0061963089", "longitude": -80.1936589, "periods": ["1900s", "Recent Releases"], "title": "Stiltsville: A Novel", "word_cloud": "finish read third time full disclosure author friend friend like even first ode lush life family live water character fully draw think hour wonder even vague memory happens end still touch very well do sure fourth reading time future lovely first chapter sure decide hold glad story marriage simple wonderful main character eye see action france first girlfriend wife lovely creation like much like husband odd say want go life end deeply move believe fully marriage hard see come strong woman strong gracious thankful tragedy strike sweet love disconnect reviewer say boring time whole sure time author back forth time stuff tend almost repeat none character fully develop case explanation event perfect example run wed day woman next thing know happy live woman keep wait see last part sad wish author explain researched information deadly disease extremely well write love premise highly recommend love character strong suspense calm suspense ordinary life embody fragile stilt house character inhabit time leisure pleasure boat away home suspense build come respect fear narrator decency endurance threaten life hazard natural desire strong sensuous competent practical yet author make family fragility turn shell build sea creature someday away dull shine wonder effort excellent love story dark depress person interested character stilt house part history happy finally sequel character stilt house first novel stand alone story marriage time challenge vacation home reachable boat immensely meet author writer conference buy base warm personality first thing notice read consistently interest write even little action occur page never bore anxious next story season woman life meeting court marry husband child rear empty nest job change middle age finally sudden onset husband glad spent time glad recommend particularly woman france narrator last half real sad time", "genres": ["Fiction & Literature", "Romance", "Historical Fiction", "Women's Fiction"], "summary": "Against a vivid South Florida background, Susanna Daniel’s Stiltsville offers a gripping, bittersweet portrait of a marriage—and a romance—that deepens over the course of three decades. \r\n\r\nCalled “an elegantly crafted work of art and a great read” by Curtis Sittenfeld, Stiltsville is a stunningly assured debut novel sure to appeal to readers of Anita Shreve, Sue Miller, and Annie Dillard, or anyone enchanted by the sultry magic of Miami.\r\n\r\n", "asin": "0061963089", "rank": "734572", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/41GeY3rVztL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}