{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 37.8044557, "ratings": {}, "authors": ["Michael Chabon"], "isbn": "006149335X", "longitude": -122.2713563, "periods": ["2000s", "Recent Releases"], "title": "Telegraph Avenue: A Novel", "word_cloud": "", "genres": ["Fiction & Literature"], "summary": "As the summer of 2004 draws to a close, Archy Stallings and Nat Jaffe are still hanging in there, long-time friends, bandmates and co-regents of Brokeland Records, a kingdom of used vinyl located in the sketchy yet freewheeling borderlands of Berkeley and Oakland. Archy and his wife, Gwen, are expecting their first baby; Nat and Aviva have a teenaged son, Julius. Cranky, flawed and loving each other with all the fierceness we’ve come to expect of Chabon characters, Archy and Nat have worked to construct lives and livelihoods that have a groove, looking to connect across barriers of race and class, and clinging to a sense of order and security through their stubbornly old-school ways.\r\n\r\nWhen ex-NFL quarterback Gibson Goode, the fourth-richest black man in America, announces plans to construct his latest Dogpile megastore on a nearby neglected stretch of Telegraph Avenue, Nat and Archy fear it means certain doom for their vulnerable little enterprise. What they don’t know is that Goode’s announcement marks the climax of a decades-old secret history encompassing a forgotten crime of the Black Panther era, the tragedy of Archy’s own deadbeat father—a long faded Blaxploitation star—and the perpetual shining failure of American optimism about race.\r\n\r\n“An amazingly rich, emotionally detailed story….[Chabon’s] people become so real to us, their problems so palpably netted in the author’s buoyant, expressionistic prose, that the novel gradually becomes a genuinely immersive experience—something increasingly rare in our ADD age.” New York Times", "asin": "006149335X", "rank": "106465", "city": "Oakland", "image": "https://images-na.ssl-images-amazon.com/images/I/61013ifm9qL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}