{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 1128, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "This book will twist your mind and make you shake your head!!! Great read, highly recommend it."}, {"review_sentiment": 5.0, "review_text": "Everything fine"}, {"review_sentiment": 5.0, "review_text": "Love this story!  Wonderful with twists and turns and shocks that keep you reading!"}, {"review_sentiment": 2.0, "review_text": "I didn't like the story...  good acting by DiCaprio though."}, {"review_sentiment": 5.0, "review_text": "Jesus christ. I lived this book. Yes, I’ve seen the movie, but I only half-watched it ages ago & had forgotten much of it. Either way, my foreknowledge didn’t effect the emotional impact of the story. I highly recommend it."}, {"review_sentiment": 5.0, "review_text": "I don’t read a lot, but this is one of those books that I will continue to read, and will forever make time to read whenever I have the chance. I wish I could count the amount of times I have argued over the ending with my friends. I was enticed from the beginning and found myself reading this book whenever I had the chance, even skipping out on a good nights sleep to read a few more chapters. I had seen the movie before I read the book (DiCaprio makes a good Teddy Daniels) but the movie does not do this book justice. This is one of those books that you will want to (not have to, but actually want to) re-read to see if you missed anything. Overall, a simply terrific book. An easy 5 out of 5 stars."}, {"review_sentiment": 4.0, "review_text": "As a huge fan of the movie, staring Leonardo Dicaprio, I was so excited to read the book. I didn’t even realize it was a novel, until this past summer when a cousin of mine was reading it on our beach vacation. As soon as I got home, I ordered my copy from Thriftbooks and waited for it to arrive.The book offers vastly more insight into Teddy’s mind and how his brain operates throughout the story. The reader experiences his thought processes more so than the movie can portray. This allows the reader to delve into Teddy’s mind and formulate opinions and theories based on the information given to them. Since I have seen the movie, I was unable to come up with my own theories as to the ending, which did take some of the suspense and thrill out of the experience. This is the main reason why I gave the book a 4 instead of a 5. I love trying to predict the ending of a story, and because I already knew the ending, I was unable to do that. I was able to see all the clues the author leaves the reader though, and that was a completely different experience.Dennis Lehane uses thought-provoking descriptions in his novel that prompts the reader to question their own psychology. For me, I wanted to research more into pysch institutes and methods from the past to see the progression of treatments and theories. It made me realize that one of the most powerful things a book can do is make you want to learn more for the sake of learning for fun. Books can show a person what interests them and prompt them to read and learn more about a certain topic. No one is forcing it upon them, nor making them learn a concept because it’s required. Learning and reading for fun are two concepts that I think the world is losing, but are two things the world desperately needs."}, {"review_sentiment": 1.0, "review_text": "I saw the following evaluation, everybody says this is a good product and receive it after use, I think they said is right, I am very happy.  I couldn't find another product that with a better quality. Also, I like its price, cheap.  Thumbs up.  This is actually a great product  Seems well built and good quality  Very good condition for the price"}, {"review_sentiment": 5.0, "review_text": "Wonderful book. Lehane is a fabulous storyteller and writer.  Kept me entertained and on the edge of my seat while I sat out Hurricane Irma:). Well done!"}, {"review_sentiment": 1.0, "review_text": "I don't know whether this book should be called science fiction or fantasy. But I do know it's a terrible book with a terrible ending."}]}, "authors": ["Dennis Lehane"], "isbn": "0061898813", "longitude": -71.0595678, "periods": ["1900s"], "title": "Shutter Island: A Novel", "word_cloud": "twist mind make shake head highly recommend everything fine story twist turn shock reading like story good acting christ live see movie age ago forget much way foreknowledge effect emotional impact story highly recommend lot continue forever make time chance wish amount time argue end friend entice begin find read whenever chance even skip good night sleep chapter see movie make good movie justice want actually want see miss anything overall simply terrific easy star huge fan movie star excite even realize past summer cousin mine read beach vacation soon get home order copy wait offer vastly insight mind brain operate story experience think process movie portray allow delve mind formulate opinion theory base information give see movie unable come theory end take suspense thrill experience main reason give instead love try predict end story already know end unable able see clue author leave completely different use description prompt question psychology want research psych institute method see progression treatment theories make powerful thing make want learn sake learn fun show person interest prompt learn certain topic one force make learn concept require read fun concept think world lose thing world desperately need saw follow evaluation everybody say good product receive use think say right happy product better quality also like price cheap actually great product well built good quality very good condition price wonderful fabulous storyteller writer entertain edge seat sit do know call science fiction fantasy know terrible terrible end", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "The basis for the blockbuster motion picture directed by Martin Scorsese and starring Leonardo DiCaprio, Shutter Island by New York Times bestselling author Dennis Lehane is a gripping and atmospheric psychological thriller where nothing is quite what it seems. \r\n\r\nIn 1954, US Marshal Teddy Daniels and his partner Chuck Aule arrive at Ashcliffe Hospital, a federal mental institution for the criminally insane on a small island in Massachusetts' Outer Harbor. They have come to find an escaped patient, Rachel Solando, who has left a series of encoded clues. The more they investigate, the more they believe that Rachel has summoned them there. As a storm approaches, Teddy and Chuck fear they may have stumbled into a nightmare world of CIA drug trials, eugenics and mind control. And the more they learn, the more they fear that someone is trying to drive them insane...\r\n\r\nThe New York Times calls Shutter Island, “Startlingly original.” \r\n", "asin": "0061898813", "rank": "43387", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/51aPzX7yjvL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}