{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 336, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "not bad"}, {"review_sentiment": 5.0, "review_text": "Good description of the sordid history of the mob's attempt to take over Cuba.  The corruption that preceded Castro helps one understand the public's acceptance of the Castro regime."}, {"review_sentiment": 4.0, "review_text": "This was a very good book which was very insightful and interesting.  The author effectively weaved together the historical, cultural, criminal, and political issues which lead to the rise of Castro."}, {"review_sentiment": 4.0, "review_text": "Thank you."}, {"review_sentiment": 4.0, "review_text": "Great read, I bought it prior to traveling to Cuba and it brought to life what I saw and informed my subsequent reading selections.  I would recommend it to just about anybody, there are enough facts for academics and plenty of fascinating stories about the people of Cuba and the gangsters who operated there.  I read a book about Che Guevara afterwards for more about the revolution."}, {"review_sentiment": 5.0, "review_text": "Who knew!  Great history of the events and circumstances that let Castro winl."}, {"review_sentiment": 4.0, "review_text": "Product as described"}, {"review_sentiment": 5.0, "review_text": "VERY GOOD"}, {"review_sentiment": 4.0, "review_text": "Expected a bit more about Cuba rather than the American mafia, but still a very interesting read, especially about the corruption of the Batista government."}, {"review_sentiment": 5.0, "review_text": "titillating history of Cuba-American Mafia.  Mr. English brings the subject to life!"}]}, "authors": ["T. J. English"], "isbn": "0061712744", "longitude": -82.3658671, "periods": ["1900s", "Recent Releases"], "title": "Havana Nocturne: How the Mob Owned Cuba and Then Lost It to the Revolution", "word_cloud": "bad good description sordid history attempt corruption precede help understand public acceptance regime good insightful interest author effectively weave together historical cultural criminal political issue lead rise thank buy prior travel bring life saw informed subsequent reading selection anybody enough fact academic plenty fascinate story people gangster operate afterwards know history event circumstance let product describe very good expect bit rather mafia still interest especially corruption government titillate history bring subject life", "genres": ["History", "True Crime"], "summary": "To underworld kingpins Meyer Lansky and Charles \"Lucky\" Luciano, Cuba was the greatest hope for the future of American organized crime in the post-Prohibition years. In the 1950s, the Mob—with the corrupt, repressive government of brutal Cuban dictator Fulgencio Batista in its pocket—owned Havana's biggest luxury hotels and casinos, launching an unprecedented tourism boom complete with the most lavish entertainment, top-drawer celebrities, gorgeous women, and gambling galore. \r\n\r\nBut Mob dreams collided with those of Fidel Castro, Che Guevara, and others who would lead an uprising of the country's disenfranchised against Batista's hated government and its foreign partners—an epic cultural battle that bestselling author T. J. English captures here in all its sexy, decadent, ugly glory.\r\n\r\n“A whiz-bang account of the Mafia’s short-lived romp through 1950s Cuba.” New York Times Book Review", "asin": "0061712744", "rank": "35010", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51JuMV82eyL.jpg", "country": "Cuba", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}