{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 480, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book by a great author"}, {"review_sentiment": 2.0, "review_text": "Ann Patchett’s usual fine writing, but the plot was a little too-too. The coincidences were hard to believe, the relationships shop-worn and the portrayal of this Irish family in particular and Irish Democrats in general was cliche."}, {"review_sentiment": 4.0, "review_text": "Felt like something was missing in the middle of the book.... it jumped significantly between one piece of the story to the future but I felt like I wanted to know more about what happened."}, {"review_sentiment": 5.0, "review_text": "This is an excellent story about two families intermingling and accepting.  There are a couple of twists that make a difference in the story.  Very well written."}, {"review_sentiment": 4.0, "review_text": "A good read, interesting characters and plot.  This was a perfect summer read for me.  Not as challenging as some other books Ann Patchett has written, but we worth the time!"}, {"review_sentiment": 5.0, "review_text": "This is a wonderful book, filled with characters who are good people and who, like all good people, make mistakes. The observations about racism flow naturally from the narrative and make it possible to experience how it permeates our culture, and our neighborhoods. And what parents won't see ourselves in Doyle, who wants so much for his children, but just not what his children want for themselves? I've read this book twice and will read it again."}, {"review_sentiment": 5.0, "review_text": "Another wonderful Ann Patchett novel. The characters were so well developed, and were so believable. I thought the motif of running/run was a clever thread that ran (literally) throughout the book. The interracial family at the center of the story was timely and a relevant twist. I loved this family! Do enjoy this beautiful read."}, {"review_sentiment": 5.0, "review_text": "Ann Patchett is a master story teller.  She puts several characters together who appear to have nothing in common and then weaves a fascinating tale as to how they all connect.Masterful."}, {"review_sentiment": 4.0, "review_text": "Pages a little bit yellow, otherwise good"}, {"review_sentiment": 5.0, "review_text": "Beautifully written with excellent character development."}]}, "authors": ["Ann Patchett"], "isbn": "0061340642", "longitude": -71.0595678, "periods": ["2000s", "Recent Releases"], "title": "Run", "word_cloud": "great author usual fine write plot little coincidence hard believe relationship portrayal irish family particular general cliche something miss middle jump significantly piece story future felt want know happen excellent story family intermingle accept couple twist make difference story very well write good interesting character plot perfect summer not challenge write worth time wonderful fill character good people good people make mistake observation racism flow naturally narrative make possible experience permeate culture neighborhood parent want much child child want twice wonderful character well develop believable think motif clever thread run literally interracial family center story timely relevant twist love family enjoy master story teller put several character together appear nothing common weave fascinating tale page little bit yellow otherwise good beautifully write excellent character development", "genres": ["Fiction & Literature"], "summary": "Since their mother's death, Tip and Teddy Doyle have been raised by their loving, possessive, and ambitious father. As the former mayor of Boston, Bernard Doyle wants to see his sons in politics, a dream the boys have never shared. But when an argument in a blinding New England snowstorm inadvertently causes an accident that involves a stranger and her child, all Bernard Doyle cares about is his ability to keep his children—all his children—safe.\r\n\r\nSet over a period of twenty-four hours, Run takes us from the Museum of Comparative Zoology at Harvard to a home for retired Catholic priests in downtown Boston. It shows us how worlds of privilege and poverty can coexist only blocks apart from each other, and how family can include people you've never even met. As in her bestselling novel Bel Canto, Ann Patchett illustrates the humanity that connects disparate lives, weaving several stories into one surprising and endlessly moving narrative. Suspenseful and stunningly executed, Run is ultimately a novel about secrets, duty, responsibility, and the lengths we will go to protect our children.", "asin": "0061340642", "rank": "67158", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/51xLjWthJKL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}