{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 136, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "very good, I loved it all. strange characters, weird mother"}, {"review_sentiment": 5.0, "review_text": "love it."}, {"review_sentiment": 1.0, "review_text": "Lousy"}, {"review_sentiment": 2.0, "review_text": "I did not like this story but kept on reading in hope's that it would get better but it never did.."}, {"review_sentiment": 5.0, "review_text": "Absolutely a literary masterpiece, written with precision and pure talent by an author who defies description, a writer who can create character, thought, situation, depth, and who has a true sense of time and place. And above all, he can create passion.  He opens the door and lets us \"live\" that passion, along with David.  This is an unusual love story, and it will capture the reader who is tenacious enough to hold on through some very heavy (long and wordy) passages. I was engaged in the author's deep tale of obsessive love.Just the first part of the book's first sentence tells us so much:\"When I was seventeen and  in full obedience to my heart's  most urgent commands, I stepped far from  the pathway of normal life and in a moment's time ruined everything I love...\"  I found this to be one of the most incredibly poetic openings to any story, and I knew that I would read this book through to the very end.As a warning to some readers:  Despite the above, I do have one criticism, and I hope that I don't sound overly prudish when I say WHY I would not recommend this book to a friend without a pre-warning, and WHY I would not suggest this for my Book Club.  That is:  In my opinion, there is one very lengthy and quite repulsive love scene. It  actually made me a bit nauseated.  It is not beautiful, but rather graphic and ugly.  And it went on so long - I would skip ahead a page or two and think: \"Oh, they are still at it,\" and then I'd skip a bit farther ahead. I cannot write specifics here, but I will say that I found the scene repugnant as opposed to sensual, and that about sums it up.Still, I couldn't leave this book, and there is so much to marvel at and enjoy.  There is almost some dark humor during the chapters after the taxi accident, which were so good.A book like this is a gem and a rare one."}, {"review_sentiment": 5.0, "review_text": "Wow, this book. I first read it when I was around 22, after reading an interview with some director (can't remember who), who was on the tails of winning an Academy Award or something and was asked what he wanted his next project to be. He replied that it was a long time passion project of his to do a remake of the 1981 film adaptation of the book. The interviewer and I both had the same response to that, utter confusion, due to the poor reputation of that movie. He responded something like \"regardless of how bad the first one might have been, we're still talking about one of the best books of the 20th century, and it deserves a respectful screen treatment\". (Sadly, it never got one......every now and then through years I'd hear snippets about possible remakes in the works, and when one finally did materialize in 2014, it was so thoroughly detached from it's source material it makes the 1981 version look noble in comparison for at least trying to include some of the original book). Anyway, my parents had an old copy of this hanging around on their book shelf for years (complete the movie poster for the film on the cover) that had somehow gotten mingled with all my other books when I moved out on my own, so one night not long after hearing that endorsement I decided to give it a try when I was having a hard time sleeping. I was completely unprepared for how engrossing the reading experience would be.....I got immediately sucked into the feverish prose and devoured it. I remember finishing it in the early morning hours one night and crying like a baby over the last page.. It was a very unique reading experience....there was something almost hallucinatory about the writing, and the book was unlike anything else I'd read ever. I searched greedily for anything else by Spencer, and while he continues to write well and showcase his remarkable savvy with details and metaphors, he never quite produced anything else this epic and effective. It's not exactly the story itself that's so extraordinary, it's the absorbing quality of the writing and how acutely you feel like you're experiencing these events with the narrator. Every character is so sharply rendered, some with just a few skilled brush strokes, every detail so vivid and exact, and it remained compelling in that throughout the experience as I had no idea where the story was going or how this could possibly all end. On paper, the ending would sound predictable, but then again, these particular words on paper are a whole other story. The last few pages of this book hit like a crushing ton of bricks, even though they shouldn't be particularly surprising given everything that's come before. Readers tied more to the events/moral of a book might have a more difficult time with this one (some of the negative reviews really seem to struggle with likability of the main character and his actions), those who love the written word for it's own sake will rejoice."}, {"review_sentiment": 3.0, "review_text": "This book was slow for most of it. I liked the movie better. It had way too many political references in it. The book took a different direction than the movie."}, {"review_sentiment": 5.0, "review_text": "This is one of my favourite novels of all time. I first encountered it in an intro-level university English course and it's been a staple of my annual readings since. David's obsession with his love, Jade, invokes the kind of sensibility we all have when we're that young. This novel works best when read either as a paean to or a straight-faced satire of the single-minded pursuit of love, depending on whether you choose to be sympathetic to David or to those around him. In either case, it has multiple layers of meaning that only yield themselves through multiple readings. I could've done without the fifty page long sex scene, complete with period blood all over the sheets afterwards, though."}, {"review_sentiment": 1.0, "review_text": "Very monotonous... could not even finish. Disturbing."}, {"review_sentiment": 1.0, "review_text": "BORING ,VERBOSE,AND EXTREMELY REPETITIOUS"}]}, "authors": ["Scott Spencer"], "isbn": "0061926000", "longitude": -87.6244212, "periods": ["1900s"], "title": "Endless Love: A Novel", "word_cloud": "good love strange character weird mother love lousy like story keep read hope better never absolutely literary masterpiece write precision pure talent author defies description writer create character think situation depth true sense time place create passion open door let live passion unusual love story capture tenacious enough hold heavy long wordy passage engage author deep tale obsessive first part first sentence tell much seventeen full obedience heart urgent command step far pathway normal life moment time ruin everything love find incredibly poetic opening story know warn reader criticism hope sound overly prudish say friend opinion lengthy quite repulsive love scene actually make bit nauseated beautiful rather graphic ugly go long ahead page think still skip bit farther ahead write specific say find scene repugnant oppose sensual sum much marvel enjoy almost dark humor chapter taxi accident gem rare first read interview director tail win something ask wanted next project reply long time passion project remake film adaptation interviewer response utter confusion due poor reputation movie respond something regardless bad first one still talk best century deserves respectful screen treatment sadly never get year hear snippet possible remake work finally thoroughly detach source material make version look noble comparison least try include original parent old copy hang shelf year complete movie poster film cover somehow gotten mingle move night long hear endorsement decide give try hard time sleep completely unprepared engross reading experience immediately sucked feverish prose devour remember finish early morning hour night cry baby last unique read experience something almost hallucinatory write anything else ever search greedily anything else continue write well remarkable savvy detail metaphor never quite produce anything else epic effective exactly story extraordinary absorb quality write acutely feel experience event narrator character sharply render skilled brush stroke detail vivid exact remain compel experience idea story go possibly paper end predictable particular word paper whole story last page hit crush ton brick even particularly surprising give everything come tie difficult time negative review really seem struggle likability main character action love write word sake rejoice slow like movie better way many political reference take different direction movie favorite novel time first encounter university course staple annual reading obsession love invokes kind sensibility young work best paean satire pursuit depend choose sympathetic case multiple layer mean yield multiple reading do fifty page long sex scene complete period blood sheet afterwards very monotonous even disturb", "genres": ["Fiction & Literature", "Romance"], "summary": "“Scott Spencer writes about love’s tenacity with passionate intensity….From his remarkable opening sentence he had me in thrall.” Newsweek\r\n\r\nFirst published three decades ago, and hailed as “one of the best books of the year” by the New York Times, here is the classic novel that first established Scott Spencer as “the contemporary American master of the love story”(Publishers Weekly). With more than 2,000,000 copies sold worldwide and translated into more than 20 languages, Spencer’s Endless Love is a breathtaking story of teenage passion and obsession.\r\n\r\nThe Washington Post called this unforgettable reading experience, “akin to the legendary thrill of riding a roller-coaster.” Endless Love is eternal—and as moving and satisfying as ever before.", "asin": "0061926000", "rank": "428174", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51xNCGg%2BruL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}