{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 45.5202471, "ratings": {"num_ratings": 75, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "I picked this book because a review compared it to Huckleberry Finn. I see the connection, the reader seeing parts of society through the eyes of the young protagonist. But I also started seeing elements of \"Of Mice and Men.\" People scrambling to make a place for themselves just to get knocked down by circumstance. The string of bad luck that plagues our young protagonist is depressing. So much so, that by the end of the story, you can't believe that his luck has changed. An interesting, albeit, gritty story."}, {"review_sentiment": 4.0, "review_text": "Charley is a young boy living an old life. Trying to survive in a world made difficult by an alcoholic, hard living father. Always being hungry and constantly moving Charley has seen glimpses of a normal home through friends he has had over the years. When Pete is threatened, Charley takes the horse and starts out to find his aunt. Their journey is long,hard and harrowing but Charley is determined to find the life that he sees through the windows at night."}, {"review_sentiment": 5.0, "review_text": "There's a controlled rawness in this story of a young boy making his own way in the world. Vlautin seems to know whereof he writes, and there's almost a rush to get it all down -- as there would be with a 15 year old boy trying to juggle & figure out the transition from stability to having to fend for himself."}, {"review_sentiment": 1.0, "review_text": "After reading page after page of this poor boys depressing life I couldn't believe the book just ended. Not a book I would reread."}, {"review_sentiment": 4.0, "review_text": "This book really reminded me of Cynthia Voight's book Homecoming. Charley is a great hardworking kid that can't catch a break. I loved his resilience and resourcefulness.  I think this book has several layers that teens would enjoy and relate with. Throughout the book I just wanted him to find one caring adult whom he could trust.  Something every kid needs."}, {"review_sentiment": 5.0, "review_text": "Mr. Vlautin has earned a new fan. Realistic characters, situations, and fine writing have left me wanting to read more of his novels."}, {"review_sentiment": 1.0, "review_text": "This is the most depressing book I have read in a long time.  I don't want to even think that a 15 year old could see such a seamy side of life, or have so many bad experiences.  I don't want to have to feel so depressed while reading a book."}, {"review_sentiment": 5.0, "review_text": "This is a very readable and vivid story about a teenage boy that ultimately finds himself on his own. Although I enjoyed it throughout, the grit really kicks into high gear about a third of the way into the story, when Charley (the teenager) is thrown onto his own resources, and the book became very hard for me to put down thereafter.Taken in isolation, Charley acts (and reacts) very believably in most respects; he exhibits occasional fits of a lack of planning that one might expect from a typical teenager, although he does cope well and is resourceful. His instinctive mistrust of others at key points in his tale is hard to fault, although one wonders where that came from.The main hitch in the picture being painted is that Charley does very little that can be nakedly condemned as bad, even the one outstanding thematic episode involving the horse (Pete). Fortunately, it is not difficult to suspend disbelief, thanks to the writer’s skill in telling the story.I found the other characters in the book quite well painted and believable, and I actually cared about and was curious about what happened to some of them. The story does not concern itself with the others after their intersections with Charley’s orbit pass.Some reviewers found this unremittingly depressing, but there are quite a few people Charley interacts with along the way that give him a pretty fair shake, and he actually experiences less badness than one might expect a homeless teen to encounter.I thoroughly enjoyed this book, and believe the coming movie will be great, if done right."}, {"review_sentiment": 2.0, "review_text": "This story was so depressing to me that I finally skipped to the last few pages to finish the book, The hardships the boy suffered were over the top and more than any youngster could likely survive. I like to read survival stories, but this one was too long coming."}, {"review_sentiment": 4.0, "review_text": "I had difficulty getting anything else done when reading this book.  CharleyIs very likable and interesting to observe as he works through the challenges of his life.  I gave it 4 stars as there is a lot of repetition and much of what Charley goes through just doesn't seem believable.  The well drawn characters, however are the story's strength, and make up for some of the plot's weaknesses."}]}, "authors": ["Willy Vlautin"], "isbn": "0061456535", "longitude": -122.6741949, "periods": ["2000s", "Recent Releases"], "title": "Lean on Pete", "word_cloud": "pick review compare see connection see part society eye young protagonist also start see element scramble place get knock circumstance string bad luck plague young protagonist depress so much end story luck change interesting albeit gritty story young boy live old life survive world make difficult alcoholic hard living father hungry constantly move see glimpse normal home friend year threaten take horse start find aunt journey long hard harrow determine find life see window night control rawness story young boy make way world seem know whereof write almost rush get year old boy try juggle figure transition stability fend read page page poor boy depress life end not really reminded great hardworking kid break love resilience resourcefulness think several layer teen want find caring adult something kid need earn new fan realistic character situation fine write leave wanting novel depress long time want even think year old seamy side life many bad experience want feel depress reading readable vivid story teenage boy ultimately find enjoy grit really kick high gear third way story teenager thrown resource become hard put isolation act react believably respect exhibit occasional fit lack plan typical teenager cope well instinctive mistrust others key point tale hard fault wonder come main hitch picture paint little nakedly condemn bad even outstanding thematic episode involve horse difficult suspend disbelief thanks writer skill tell find character quite well painted believable actually care curious happen story concern others intersection orbit reviewer find unremittingly depressing quite people interacts way give pretty fair shake actually experience le badness one homeless teen thoroughly enjoy believe come movie great do right story depress finally skip last page finish hardship boy suffer top youngster likely survival story long come difficulty get anything else do reading likable interesting observe work challenge life give star lot repetition much go believable well drawn character however story strength make plot weakness", "genres": ["Fiction & Literature"], "summary": "Author Willy Vlautin—a major realist talent who is often compared to Raymond Carver, John Steinbeck, and Denis Johnson—returns with Lean on Pete, the story of a 15-year old boy struggling to make his way to a long lost aunt, who just might give him a home. \r\n\r\n“The writing is spare and straightforward…There is intensity in Vlautin’s narration, and also beauty and power…Vlautin’s major accomplishment lies in posing a damning question: How could we, as a society, have allowed this to happen?” Seattle Times\r\n", "asin": "0061456535", "rank": "546216", "city": "Portland", "image": "https://images-na.ssl-images-amazon.com/images/I/519zbwxlJgL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}