{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2338, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "I wish I had read this book before now.  It was recommended on a Facebook post by many readers.I was brought back in time.  I once took care of a woman who was raised in Brooklyn and reading this brought back the stories she used to tell."}, {"review_sentiment": 5.0, "review_text": "A sweet and slow saga of a young girls growing up,  learning about true wealth and happiness. Truth and love amid grief and joy shape the years of her youth and adolescence."}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 3.0, "review_text": "Its not a good book for a child to do a book report at school because there are curse words"}, {"review_sentiment": 5.0, "review_text": "Wonderful reading this story again after many years. Great book,"}, {"review_sentiment": 3.0, "review_text": "I've been reading this book all summer...and I refuse to quit until I've read the last word!  It's been pretty slow going."}, {"review_sentiment": 5.0, "review_text": "Seeing the world through the eyes of young Francie Nolan in the years just before and during WWI  reveals a much different place than the Brooklyn of today.  She and her brother grow up unsure of any schooling beyond elementary school.  Their father works intermittently as a singing waiter, and their mother as a scrubwoman in the flats near theirs.  Still, they read pages from Shakespeare and the Bible every night, and their mother trades flat cleaning and a supper meal for piano lessons.  Frannie has a gift for writing, but has to contend with a teacher who believes that the only good literature is about beauty, and not true life.  How Frannie  achieves her goals shows us what was available to young girls in the 1910s and what the mindset of the era was."}, {"review_sentiment": 5.0, "review_text": "Finally reading a book I have heard of all of my life. Delightful read."}, {"review_sentiment": 5.0, "review_text": "I read this book for the first time around 1979. It was a favorite book then and while I am not finished with it again as an adult, I am enjoying it all over again. I am hoping my teen aged daughter will read it as well."}, {"review_sentiment": 5.0, "review_text": "This is a true classic. I could not put it down. So emotional and descriptive of life at that time."}]}, "authors": ["Betty Smith"], "isbn": "0061120073", "longitude": 0.0, "periods": ["1900s"], "title": "A Tree Grows in Brooklyn", "word_cloud": "wish recommend post many bring time take care woman raise read bring story use tell sweet slow saga young girl grow learn true wealth happiness love grief joy shape year youth adolescence great good child report school curse word wonderful read story many year great read summer refuse quit last word pretty go see world eye young year reveal much different place today brother grow unsure school elementary school father work intermittently sing waiter mother scrub woman flat still page night mother trade flat clean supper meal piano lesson gift write teacher believe good literature beauty true life achieve goal show available young girl mindset era finally read hear life first time favorite finish adult enjoy hop teen age daughter well true classic emotional descriptive life time", "genres": ["Fiction & Literature"], "summary": "The beloved American classic about a young girl's coming-of-age at the turn of the century, Betty Smith's A Tree Grows in Brooklyn is a poignant and moving tale filled with compassion and cruelty, laughter and heartache, crowded with life and people and incident. \r\n\r\nThe story of young, sensitive, and idealistic Francie Nolan and her bittersweet formative years in the slums of Williamsburg has enchanted and inspired millions of readers for more than sixty years. \r\n\r\nBy turns overwhelming, sublime, heartbreaking, and uplifting, the daily experiences of the unforgettable Nolans are raw with honesty and tenderly threaded with family connectedness -- in a work of literary art that brilliantly captures a unique time and place as well as incredibly rich moments of universal experience.", "asin": "0061120073", "rank": "4765", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51wNikqr4BL.jpg", "country": "Brooklyn", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}