{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": -4.3217055, "ratings": {"num_ratings": 2888, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Exquisitely written book about a family that goes to the Congo in 1960 as missionaries.  Written from the point of view of the mother and her four daughters,  this is a must read."}, {"review_sentiment": 5.0, "review_text": "First book I've read by Kingsolver...thoroughly enjoyed it!!  A great story!"}, {"review_sentiment": 5.0, "review_text": "This book is a heart-wrenching story of the clash of philosophies and religion of Westerners in Africa. Barbara Kingsolver could be a called a literary magician as she weaves together this beautiful story with literacy genius. The spiritual journey of the father that is told through the realities of the daughters amid the backdrop of the Belgian Congo in the 1950s."}, {"review_sentiment": 5.0, "review_text": "The language the author uses is beautiful! The story presents itself from the viewpoints of the daughters and wife. This is a long descriptive read, but worth the time for this one of a kind."}, {"review_sentiment": 5.0, "review_text": "GREAT storyteller!"}, {"review_sentiment": 3.0, "review_text": ". You realy feel like you know these people. The short story format makes it easy for lunchtime reading. She literally paints pictures with her writing."}, {"review_sentiment": 5.0, "review_text": "Eye opening and engaging."}, {"review_sentiment": 5.0, "review_text": "great read"}, {"review_sentiment": 5.0, "review_text": "In Kingsolver's story the contrasts, between the West (U.S.) and central Africa, play out elaborately in the environmental settings, the religions and the socio-political events presented. Using the voices of the characters in the telling is an effective means of heightening these contrasts."}, {"review_sentiment": 5.0, "review_text": "Great book"}]}, "authors": ["Barbara Kingsolver"], "isbn": "0061577073", "longitude": 15.3125974, "periods": ["1900s"], "title": "The Poisonwood Bible", "word_cloud": "exquisitely write family go missionary point view daughter first thoroughly enjoy great story story clash philosophy religion literary magician weave together beautiful story literacy genius spiritual journey father tell reality daughter backdrop language author use story present viewpoint daughter wife long descriptive worth time kind great storyteller relay know people short story format make easy lunchtime read literally paint picture write opening engage great story contrast central play elaborately environmental setting religion event present voice character tell effective mean heighten contrast great", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The Poisonwood Bible is a story told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it—from garden seeds to Scripture—is calamitously transformed on African soil. What follows is a suspenseful epic of one family's tragic undoing and remarkable reconstruction over the course of three decades in postcolonial Africa.", "asin": "0061577073", "rank": "7632", "city": "Kinshasa", "image": "https://images-na.ssl-images-amazon.com/images/I/51IvQ1MrWjL.jpg", "country": "DR Congo", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}