{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 31, "rating": 3.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Captures glimpses of the famous city in the post war international zone. Truly a rich depiction of a man slowly corrupted, with a host of colorful and flawed characters around him."}, {"review_sentiment": 4.0, "review_text": "Haunting Paul Bowles."}, {"review_sentiment": 2.0, "review_text": "WAYY-Y-Y too wordy!"}, {"review_sentiment": 1.0, "review_text": "Unlike able characters"}, {"review_sentiment": 3.0, "review_text": "Reading was very enjoyable. However towards the end characters dropped out to never be seen or heard of again. It seems people and plots were left in limbo."}, {"review_sentiment": 2.0, "review_text": "Granted he is a very good writer (and musician) but this book is so depressing. The leading character is unlikeable and like just about every other character, is alcoholic and on drugs. Most of the writing internalizes each character - you are more aware of their thoughts than who they are...and usually they are drunk or stoned. I found no humor in any of the writing. It might have helped if there was some. When I finished reading I was left rather depressed....."}, {"review_sentiment": 4.0, "review_text": "Well written and a great sense of place and time.  There were a great many typos in the book - it appeared to have been optically scanned into digital format without much proofreading."}, {"review_sentiment": 2.0, "review_text": "Boring.  Too many pages spent on the main characters' mental pondering.  Finished it,  It was a pointless story."}, {"review_sentiment": 2.0, "review_text": "Almost nothing happens in this book, and then when something does, the book ends!"}, {"review_sentiment": 4.0, "review_text": "paul bowles' favorite theme is \"culture clash,\" and this novel is no exception. although it is not as good as THE SHELTERING SKY, it remains a riveting study of mankind's basic nature which, according to bowles, is composed of avarice and depravity."}]}, "authors": ["Paul Bowles"], "isbn": "0061137391", "longitude": 0.0, "periods": ["1900s"], "title": "Let It Come Down", "word_cloud": "capture glimpse famous city post war international zone rich depiction man slowly corrupt host colorful flaw character haunt wordy able character read enjoyable however towards end character drop never see heard seem people plot leave limbo grant good writer musician depress lead character unlikable character alcoholic drug most write internalizes character aware thought usually drink stone find humor write help finish read leave rather depressed well write great sense place time great many typo appear optically scan digital format much proofreading many page spend main character mental ponder finish pointless story almost nothing happen something end paul bowel favorite theme culture clash exception good remain rivet study mankind basic nature accord bowel compose avarice depravity", "genres": ["Fiction & Literature"], "summary": "In Let It Come Down, Paul Bowles plots the doomed trajectory of Nelson Dyar, a New York bank teller who comes to Tangier in search of a different life and ends up giving in to his darkest impulses. \r\n\r\nRich in descriptions of the corruption and decadence of the International Zone in the last days before Moroccan independence, Bowles's second novel is an alternately comic and horrific account of a descent into nihilism.\r\n\r\nPaul Bowles was born in 1910 and studied music with composer Aaron Copland before moving to Tangier, Morocco. A devastatingly imaginative observer of the West's encounter with the East, he is the author of four highly acclaimed novels: The Sheltering Sky, Let It Come Down, The Spider's House, and Up Above the World. In addition to being one of the most powerful postwar American novelists, Bowles was an acclaimed composer, a travel writer, a poet, a translator, and a short story writer. He died in Morocco in 1999.", "asin": "0061137391", "rank": "640516", "city": "Tangiers", "image": "https://images-na.ssl-images-amazon.com/images/I/51zrR9aqTaL.jpg", "country": "Morocco", "story_arc": ["Tragedy", "Things only get worse"]}