{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": -26.205, "ratings": {"num_ratings": 48, "rating": 4.4, "reviews": [{"review_sentiment": 3.0, "review_text": "This book is good, but there is a major problem...I took this book out from the library before I went to South Africa, thinking I would learn more about Apartheid and the culture of the country. I found myself shocked that there was a time in South Africa's history when just being photographed with a black person was enough to ruin your life. I had read that this book is brave, and it is. There are some indelible scenes, especially in the last chapter, and for this enlightenment into this dark period in South Africa's history, I am grateful.The characters in this book are well-written, as many other reviewers will say...Stanley, in particular, is a fantastic character. They're all good, in fact—except for the women characters.I am not sure if this is just due to the time when this book was published, 1979, or that the author is completely dismissive of women, but the female characters in this book are not given any justice. They are simply there to be foils against the main character, Ben, and have no contribution to the book other than two-dimensional figures bent on ruining him.In this book, women are either described as \"bitchy\" or \"large\" and \"shapeless\" or \"old\" and that's pretty much all the detail they get. Whereas the men characters get funny characteristics and interesting stories, it's obvious the author didn't think that women could be much more than the sum of their physical characteristics.I don't typically read books looking for these kinds of flaws, but this book sets you up to hate women, from the very start. This book IS worth reading and the author WAS brave for writing it, but you will have to hold your nose to make it through. And just don't bother reading the forward. It sets you up to hate the whole book and really doesn't have any bearing on the main story.Some spoilers below...Even the main character's wife, who has one of the larger female roles in the story, is never given due justice. She's portrayed as prudish, selfish, unsympathetic, shallow, and materialistic at every opportunity. She is used only as a tool to prove that the main character has to suffer in every way. She never shows up in the book to be kind to her husband, only to nag at him and whine. I think the author should have made her more interesting, she was worth more than that.I also felt sorry for her, alone, neglected, trying to live a normal life while you can tell from a mile away the main character is letching for some side action from the younger female character.There's a scene in the book where he looks at a photo of his and his wife's wedding, describing her as young and pretty in the photo, and then lamenting that she had turned old and ugly. Soon after he runs into the arms of the younger, pretty female character. And can you blame him, after all? His wife was old and ugly, so she obviously wasn't worth loving anymore. And he uses THIS rationale to cheat on her?The entire time he's describing the younger female character, the descriptions make my skin crawl. You can tell he's trying to hump her leg the whole time. Sure, the younger female character seems to be intelligent and kind, but she's just....a distraction, a vessel for him to pour his sexual energy into, then she's whisked away and discarded from the story.The last chapter, where his daughter decides to be kind and help him...I was surprised to see a woman character be kind in the book AND all the while not offering him sex. But THEN, she betrays him at the end. That part made me guffaw because, of course, the author couldn't let a perfectly good nonsexual relationship with the main character go unpunished.Ugh...I'm glad I read it, but I won't read any more of his books."}, {"review_sentiment": 5.0, "review_text": "The kind of book that stays with you. Makes you ask hard questions. Makes you need to know more. A must read."}, {"review_sentiment": 5.0, "review_text": "This was an absolutely beautiful book. I read it quite awhile ago, but still remember it well - a testament to how wonderful it was. So moving to see how this ordinary man changes into an extraordinary man, how the brutality of apartheid South Africa came home to him personally, so that he was unable to stop himself from doing what he had to do, even though it led to his own self-destruction."}, {"review_sentiment": 3.0, "review_text": "This is supposed to be one of the classics of South African literature, so I was eager to get acquainted with it. It's set during the time of the Soweto riots, during apartheid. I got about a third of the way through it, and then had to give up. The violence was too vivid and sickening. The cruelty was too upsetting. No matter how brilliant the writing, I just couldn't bear the graphic details of horror enough to continue. I thought the Nazis were bad. Learning just a tiny bit of what took place during those troubled times in South Africa makes Nelson Mandela's pardoning of his torturers an act of unbelievable grace."}, {"review_sentiment": 3.0, "review_text": "This book was an assignment for my english class and it was a bit slow paced but still  very informative The book did pick up speed once I was a few chapters in so I would still recommend it. You just have to be ancient and power though the beginning."}, {"review_sentiment": 4.0, "review_text": "This novel is so greatly executed. It's gotten me into reading; unfortunately I struggle to find anything that comes close to the being literary fiction of this book, while expressing as much care for a well-paced plot. I will read this for many more years to come. (4 times is not enough.)"}, {"review_sentiment": 4.0, "review_text": "In many ways a sequel to Cry, the Beloved Country, this book is grittier and in some ways gratuitously graphic for my taste.  It picks up 30 years after Apartheid was introduced in South Africa. Like Cry, A Dry White Season chronicles the experience of an innocent bystander to South Africa's cultural drama.  Great story, well-written, but I give it four stars instead of five because of the issues mentioned."}, {"review_sentiment": 4.0, "review_text": "Excellent portrayal of an Africanns family as they struggle with the inequalities between whites and blacks and how the government that they worked so hard to put into place was choosing to deal with the problems. The stresses and strains within families as each member struggles to come to terms with the issues according to their own conscious."}, {"review_sentiment": 4.0, "review_text": "Brink is a brilliant observer and writer on South Africa.  He seamlessly recalls the tragedies of past times at the personal and national levels."}, {"review_sentiment": 5.0, "review_text": "Having recently learned of Andre Brink's death at the age of 79, I found myself once again reading his potent condemnation of apartheid--Brink's courageous novel \"A Dry White Season.\" Initially published in 1980, it still remains apparent to any reader that Mr. Brink was appalled by the horrific events that transpired only four years earlier; that bloody student uprising in Soweto when black school children protested against the authoritarian and dehumanizing strictures of apartheid. The level of the violence applied by the authorities was untenable--armored vehicles, police dogs, tear gas, firearms, truncheons were mustered against school children and other protesters.So awful was the conflict, and so overwhelming were the forces applied to suppress the uprising, that it is difficult to contemplate the full scope of the mayhem. And that must be why Mr. Brink chose to write a more intimate, personal story. By drawing it down to scale and by humanizing the protagonists (both good and evil) in relatable terms I found it all the more shocking. For a second time I read about a privileged white schoolteacher and the sudden disappearance and \"suicide\" of a black janitor working at his school; and the subsequent obsession by this quiet chess-playing teacher to get at the truth, and tear away at the illusion of righteousness propagated by his government.More intriguing is that English is not Andre Brinks mother tongue; it is Afrikaans, the language of those that perversely created the apartheid paradigm. As an Afrikaner Brink placed himself at great personal risk when he wrote and published this book.  Having chosen to shine a spotlight on the horrors that his people had inflicted on the vast majority of black South Africans would not have been taken lightly by the authorities. The possible sanctions he faced extended well beyond mere censorship; he could have been jailed under the onerous security laws without even the courtesy of due process.Despite the intervening years, and the end of apartheid in 1994, I found myself still challenged and moved by Andre Brink’s words. The sad truth is that humans remain intolerant of each other and are frequently brutal to those unlike themselves to this very day. As such “A Dry White Season” remains a cautionary tale for the 21st Century. Hence \"A Dry White Season\" is more than great writing, it is also prescient writing.Review by Mark Fine, author of \"The Zebra Affaire: An Apartheid Love Story\" THE ZEBRA AFFAIRE: An Apartheid Love Story (The Sub-Saharan Saga Book 1)"}]}, "authors": ["Andre Brink"], "isbn": "0061138630", "longitude": 28.049722, "periods": ["1900s"], "title": "A Dry White Season", "word_cloud": "good major problem take library go thinking culture country find shocked time history photograph black person enough ruin life brave indelible scene especially last chapter enlightenment dark period history character many reviewer say particular fantastic character good woman sure due time publish author completely dismissive woman female character give justice simply foil main character contribution figure bent ruin woman described bitchy large shapeless old pretty much detail men character get funny characteristic interest story obvious author think woman much physical typically look kind flaw set hate woman start worth read author brave write hold nose make bother read set hate whole really bear main spoiler even main character wife larger female role story never give due justice portray prudish selfish unsympathetic shallow materialistic opportunity use tool prove main character suffer way never show kind husband nag whine think author make interesting worth also felt sorry alone neglect try live normal life tell mile away main character leching side action younger female scene look photo wife wed describe young pretty photo lamenting turn old ugly run arm younger pretty female character wife old ugly obviously worth love anymore use rationale cheat entire time describe younger female character description make skin crawl tell try hump leg whole time younger female character seem intelligent kind distraction pour sexual energy whisk away discard last chapter daughter decide kind help surprise woman character kind offering sex betray end part make guffaw course author perfectly good nonsexual relationship main character go glad kind stay ask hard question need absolutely beautiful quite awhile ago still well testament wonderful so move see ordinary man change extraordinary man brutality come home personally unable even lead suppose classic south african literature eager acquaint set time riot apartheid get third way give violence vivid sicken cruelty upset matter brilliant write graphic detail horror enough continue think bad tiny bit take place troubled time make pardon torturer act unbelievable grace assignment english class bit slow pace still informative pick speed chapters still ancient power begin greatly execute gotten read unfortunately struggle anything come close literary fiction express much care plot many year come time enough many way sequel grittier way gratuitously graphic taste pick year introduce chronicle experience innocent bystander cultural drama story give star instead issue mention excellent portrayal family struggle inequality white black government work hard put place choose deal problem stress strain family member struggle come term issue accord conscious brilliant observer writer seamlessly recall tragedy time personal national level have recently learn death age find read potent condemnation apartheid courageous publish still remain apparent appal horrific event transpire year earlier bloody student uprise black school child protest authoritarian dehumanizing stricture apartheid level violence apply authority untenable armored vehicle police dog tear gas firearm truncheon muster school child awful conflict overwhelm force apply suppress uprising difficult contemplate full scope mayhem choose write intimate personal story draw scale humanizing protagonist good evil repeatable term find shock second time privilege schoolteacher sudden disappearance suicide black janitor work school subsequent obsession truth illusion righteousness propagate intriguing mother tongue language perversely create apartheid paradigm place great personal risk write publish choose shine spotlight horror people inflict vast majority black take lightly authority possible sanction face extend well mere censorship onerous security law even courtesy due intervene year end apartheid find still challenge move word sad truth human remain intolerant frequently brutal day remain cautionary tale great writing also prescient", "genres": ["Fiction & Literature", "Politics"], "summary": "As startling and powerful as when first published more than two decades ago, André Brink's classic novel, A Dry White Season, is an unflinching and unforgettable look at racial intolerance, the human condition, and the heavy price of morality.\r\n\r\nBen Du Toit is a white schoolteacher in suburban Johannesburg in a dark time of intolerance and state-sanctioned apartheid. A simple, apolitical man, he believes in the essential fairness of the South African government and its policies—until the sudden arrest and subsequent \"suicide\" of a black janitor from Du Toit's school. Haunted by new questions and desperate to believe that the man's death was a tragic accident, Du Toit undertakes an investigation into the terrible affair—a quest for the truth that will have devastating consequences for the teacher and his family, as it draws him into a lethal morass of lies, corruption, and murder.", "asin": "0061138630", "rank": "116073", "city": "Johannesburg", "image": "https://images-na.ssl-images-amazon.com/images/I/41IJhN9dikL.jpg", "country": "RSA", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}