{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 59.9132694, "ratings": {"num_ratings": 710, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Nesbo's character could certainly use some help around his drinking problem and how it screws up his life. It's excellent work."}, {"review_sentiment": 4.0, "review_text": "I have read all the Harry Hole books.  I don’t like the language but I keep coming back to read the next when it comes out.  There is something that I like about this fallen man and his story."}, {"review_sentiment": 4.0, "review_text": "Starts out a little slow but but snowball's toward climax so you can't put down.  Never saw what was coming!"}, {"review_sentiment": 5.0, "review_text": "Flawed hero,a plot you'll never figure out too soon,what's not to love?  Jo has that wonderful talent to make his stories real in what is a unbelievable setting and plot."}, {"review_sentiment": 1.0, "review_text": "Spends 90 percent of the time on the detective/Harry's alcoholism problem, although it was so bad I didn't finish the book. I buy mysteries for a good mystery, not to wallow in the main characters personal problems."}, {"review_sentiment": 5.0, "review_text": "As you read pay close attention cause there  many twists and turns.  But it turns out very satisfactory in the end as all his work does."}, {"review_sentiment": 5.0, "review_text": "completed beginning series to Harry Hole novels"}, {"review_sentiment": 4.0, "review_text": "Detective Hole manages to be brilliant, while  being self destructive. The vast array of character's can become difficult to manage near the end of the book. Dark and foreboding at times, with enough twists to hold your attention"}, {"review_sentiment": 5.0, "review_text": "Have always loved Harry Hole.  One of Nesbo',s best.  I don't know Oslo, but the descrptions in this book have made it come alive for me."}, {"review_sentiment": 5.0, "review_text": "Harry Hole is a great, very human, character.  I have loved all the books featuring him.  Like all of them this one is graphic and dark, but so intriguing.  I highly recommend it"}]}, "authors": ["Jo Nesbo"], "isbn": "0061133981", "longitude": 10.7391112, "periods": ["2000s", "Recent Releases"], "title": "The Devil's Star: A Harry Hole Novel", "word_cloud": "character certainly help drinking problem screw life excellent work like language keep come back next come something like fall man story start little slow snowball climax saw come hero plot never figure soon wonderful talent make story real unbelievable setting plot percent time alcoholism problem bad finish buy mystery good mystery wallow main character personal problem pay close attention cause many twist turn turn satisfactory end work complete begin series novel detective manage brilliant self destructive vast array character become difficult manage end forebode time enough twist hold attention always love best know description make come alive great human character love feature graphic dark intrigue highly recommend", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "‘Nesbo sets a cracking pace... A series of spectacular plot twists leads to a thrilling finale.' The Guardian \r\n\r\nTHE MARK OF THE DEVIL, THE SIGN OF A KILLER...\r\n\r\nA young woman is murdered in her flat and a tiny red diamond in the shape of a five-pointed star is found behind her eyelid. \r\n\r\nDetective Harry Hole is assigned to the case, alongside his long-time adversary Tom Waaler, and initially wants no part in it. \r\n\r\nBut Harry is already on his final warning and has little alternative but to drag himself out of his alcoholic stupor when it becomes apparent that Oslo has a serial killer on its hands.", "asin": "0061133981", "rank": "27101", "city": "Oslo", "image": "https://images-na.ssl-images-amazon.com/images/I/51OFo8N-zBL.jpg", "country": "Norway", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}