{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 443, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "A pretty good book...didn't care for the ending too much...but after giving it more thought, it probably couldn't have been any differently."}, {"review_sentiment": 5.0, "review_text": "A wonderful, gripping tale (like all of Crichton books). Lots of interesting science, not to mentionfiction. One of his better novels."}, {"review_sentiment": 5.0, "review_text": "Great action book"}, {"review_sentiment": 5.0, "review_text": "Classic Crichton page turner kept me up too late!"}, {"review_sentiment": 4.0, "review_text": "A  fine adventure set in 1979 Congo. No one should doubt that Michael Crichton had great fun putting this somewhat incredulous novel together. Demonstrating influences from fictional works such as H R  Haggard's, Alan Quartermain and A Conan Doyle's Professor Challenger from\" Lost World\" {need I say more?} this story works. A bit of whimsy but could Philo Beddoe and Clyde have had any influence in the creation of Peter Elliot and Amy? {chuckle chuckle} You'll have to decide on your own. Regardless, this is enjoyable reading and fits well into my, and probably your own, readings while wandering Africa from the armchair."}, {"review_sentiment": 3.0, "review_text": "Was excited to find it, then saddened to play it. New recording of some chick...Really wanted the old one, by Bob Askey... hos voice is so good for this..."}, {"review_sentiment": 4.0, "review_text": "It was OK. Kind of dated...but I knew that."}, {"review_sentiment": 2.0, "review_text": "The first 100 pages seemed useless and the rest of the book read like a scientific paper. I could not get into the story."}, {"review_sentiment": 5.0, "review_text": "In my humble opinion Michael Crichton was the second-best novelist of his time and Congo was Crichton’s fourth-best novel. The references listed in the post-epilogue are impressive. “Congo by Crichton is so gripping that you almost expect Amy the gorilla… to bound into the room,” wrote The Christian Science Monitor. Without a doubt, Crichton was a better author than Tim LaHaye, Ayn Rand, and Margaret Mitchell. As a pop culture icon and intelligent storyteller, Crichton was the Fritz Lang of his day.In 1897, Sydney Hinde wrote that “nearly all the tribes in the Congo Basin either are, or have been, cannibals; and among some of them the practice is on the increase.” In the Congo, cannibalism was not associated with ritual or religion or war; it was a simple dietary preference (pg. 210). The pygmies were the earliest human inhabitants of the Congo rainforest… More than four thousand years ago, an Egyptian commander named Herkouf entered the great forest west of the Mountains of the Moon; there he found a race of tiny men who sang and danced to their god. Herkouf’s amazing report had the ring of fact and Herodotus and later Aristotle insisted that these stories of the tiny men were true, and not fabulous. The Dancers of God inevitably acquired mythical trappings as the centuries passed (pg. 237).But the hippo was essential to Africa’s river ecology. His fecal matter, produced in prodigious quantities, fertilized the river grasses, which in turn allowed river fish and other creatures to live. Without the hippopotamus African rivers would be sterile, and where they had been driven away, the rivers died (pg. 253). “Something happens to the man who discovers a new species of animal,” wrote Lady Elizabeth Forstmann in 1879. “At once he forgets his family and friends, and… in short, he abandons all who knew him prior to his insensate lust for fame at the hands of the demon called Science.” Lady Forstmann understood, for her husband had just left her after discovering the Norwegian blue-crested grouse in 1878 (pg. 345).Conspecific teaching occurs among primates… Washoe, the first primate in history to learn sign language, taught ASL to her offspring. Language-skilled primates freely taught other animals in captivity; for that matter, they would teach people, signing slowly and repeatedly until the stupid uneducated human person got the point. So it was possible for a primate tradition of language and behavior to be carried on for generations… In 1964, chimpanzee kidneys were successfully transplanted into men; blood transfusions were also possible (pgs. 350-352).In 1975, the mathematician S.L. Berensky reviewed the literature on primate language and reached a startling conclusion… On both sides of the bars primates can be observed making faces at each other. It is too facile to say that man is superior because he has made the zoo. We impose our special horror of barred captivity–a form of punishment among our species–and assume that other primates feel as we do. Berensky likened primates to foreign ambassadors. “Apes have for centuries managed to get along with human beings, as ambassadors from their species. In recent years, they have even learned to communicate with human beings using sign language. But it is a one-sided diplomatic exchange; no human being has attempted to live in ape society, to master their language and customs, to eat their food, to live as they do. The apes have learned to talk to us, but we have never learned to talk to them. Who, then, should be judged the greater intellect?” Berensky added a prediction. “The time will come,” he said, “when circumstances may force some human beings to communicate with a primate society on its own terms. Only then human beings will become aware of their complacent egotism with regard to other animals” (pgs. 354-355)."}, {"review_sentiment": 2.0, "review_text": "Good storyline but too fragmented by little research papers Crichton interjected as background material that distracted from the narrative. I give the book a C+ for readability and a B- for action.  It was too cumbersome to read through the minutia."}]}, "authors": ["Michael Crichton"], "isbn": "0061782556", "longitude": -122.4192363, "periods": ["1900s"], "title": "Congo", "word_cloud": "pretty good care end much give thought probably differently wonderful gripping tale interest science mention fiction better novel great action classic page turner keep late fine adventure set doubt great fun put somewhat incredulous together demonstrate influence fictional work need say story work bit whimsy influence creation chuckle chuckle decide regardless enjoyable read fit well probably reading wander armchair excite find sadden play record chick want old ho voice good date know first page seem useless rest scientific paper story humble opinion novelist time reference list impressive grip almost room write christian doubt better author pop culture icon intelligent storyteller write nearly tribe cannibal practice cannibalism associate ritual religion war simple dietary preference pg pygmy earliest human inhabitant more year ago egyptian commander name enter great forest west mountain find race tiny men sing danced god amaze report ring fact later insist story tiny men true fabulous inevitably acquire mythical trapping century pass pg hippo essential river ecology fecal matter produce prodigious quantity fertilize river grass turn allow river fish creature live hippopotamus african river river die pg happen man discover new specie animal write forgets family friends short abandon know prior insensate lust fame hand demon call understood husband leave discover norwegian grouse pg teach occurs first primate history learn sign language teach offspring primate freely taught animal captivity matter people sign slowly repeatedly stupid uneducated human person get point possible primate tradition language behavior carry chimpanzee kidney successfully transplant men blood transfusion also possible pg mathematician review literature primate language reach startle side bar primates observed make face facile say man superior make zoo impose special horror bar form punishment assume primate feel liken primate foreign ambassador century manage human being ambassador specie recent year even learn communicate human being use sign language diplomatic exchange human attempt live ape society master language custom food live ape learn never learn talk judge greater intellect add prediction time come say circumstance human being communicate primate society term only human being become aware complacent egotism regard animal pg good story line fragment little research paper interject material distract narrative give readability action cumbersome minutia", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Deep in the African rain forest, near the legendary ruins of the Lost City of Zinj, an expedition of eight American geologists are mysteriously and brutally killed in a matter of minutes.\r\n\r\nTen thousand miles away, Karen Ross, the Congo Project Supervisor, watches a gruesome video transmission of the aftermath: a camp destroyed, tents crushed and torn, equipment scattered in the mud alongside dead bodies—all motionless except for one moving image—a grainy, dark, man-shaped blur.\r\n\r\nIn San Francisco, primatologist Peter Elliot works with Amy, a gorilla with an extraordinary vocabulary of 620 \"signs,\" the most ever learned by a primate, and she likes to finger paint. But recently her behavior has been erratic and her drawings match, with stunning accuracy, the brittle pages of a Portuguese print dating back to 1642 . . . a drawing of an ancient lost city. A new expedition—along with Amy—is sent into the Congo, where they enter a secret world, and the only way out may be through a horrifying death . . ", "asin": "0061782556", "rank": "304299", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51LbdIhDsxL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}