{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 528, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Sad. Brutal. Well-written. Heart-breaking. Another in the great Patrick Kenzie and Angela Gennaro series. The movie was good also. But the book was great."}, {"review_sentiment": 2.0, "review_text": "After reading Mystic River years ago and enjoying it, I was a little underwhelmed with Gone, Baby, Gone. Lehane obviously poses some serious moral issues and themes in this book, but the way he goes about pursuing and presenting such issues were less than stellar.For one thing, the characters were lacking and flat, in my opinion. The dialogue between the police/detectives seemed to ring artificial and forced, often in the form of them speaking in this way where they are trying to one up each other with smart aleck responses. They were also lacking in any emotional depth (I really felt zero connection to the main character, or any other ones, for that matter), and often were hard to distinguish from each other. Their interactions, dialogue, conflicts came across as a big cliché or stereotype given their roles.Not only that, but Gone, Baby, Gone goes way over the top in various ways. The absurd amount of violence and language seemed a bit overreaching. I know the author is trying to make it “realistic” but he takes it too far and seems to be going for “shock” value points. Additionally, the plot goes in such a direction in the second half that is quite improbable and unrealistic. Couldn’t really buy it.Anyhow, this was overhyped, and failed to deliver. More summer beach reading than anything else."}, {"review_sentiment": 4.0, "review_text": "I am a huge fan of Dennis Lehane's Kenzie/Gennuaro novels - which have some of the best writing found anywhere. His \"A Drink Before the War\" is one of the greatest detective/crime fiction books ever written.This one fits in with the others, but whereas they all involve the darker side of society, Gone Baby Gone, at times, went too far. Parts of this were so depressing, made you wonder if we should survive. But I will keep reading the author's books; they are too good to miss."}, {"review_sentiment": 2.0, "review_text": "Another in a confusingly plotted and violent series by Dennis Lehane, who I think is vastly overrated. This time, he wrote a book describing the most vile, sickening child abuse. I am done with his books."}, {"review_sentiment": 5.0, "review_text": "A great read as are all Lehane's  novels!"}, {"review_sentiment": 5.0, "review_text": "Totally engaging. Lehane is a gifted story teller. I read the story through in one weekend. But, the story is very dark and depressing. Not exactly my style of reading/entertainment. Still, a very gifted story teller."}, {"review_sentiment": 4.0, "review_text": "A 4-year-old girl disappears without a trace from her Sagamore Street home in Dorchester. Amanda McCready’s mom had left her alone to go next door to watch TV with her friend or so that was her story to the detectives and others later involved with the case. The child was kidnapped that night.Lieutenant Jack Doyle of Crimes Against Children (CAC) founded the unit and brought over Officers Poole and Broussard to assist the squad in their mission. Lt. Doyle was immediately brought in to investigate the missing child disappearance.Beatrice, Amanda’s aunt, contacted private eyes she’d seen in the media who worked to find kidnapped kids. She would do whatever it took including bankrupting the family to hire Angela Gennaro and Patrick Kenzie to find Amanda.Lieutenant Doyle tried to warn them away on their first meeting indicating that he had leverage from an unsolved murder he could dump into their laps. Then he played to their soft side to not take the case for it could end badly for the family and them.Angie and Patrick really didn’t want to take the case for it brought back painful memories of an unsolved case. But, there was something about this one and the constant pleading from Beatrice that made them finally agree to the case. They informed Lieutenant Doyle of their plans and he warned them not to release info to the media and other ground rules that would keep just the CAC and them in the loop.Then things began to unwind as they uncovered Amanda’s mom had stolen $200,000 from a drug dealer just before her child disappears. Strung out, Helene McCready finally owned up to stealing the money when a drug deal turned bad. Now it appeared that Amanda McCready was kidnapped because of her mom’s involvement.The private eyes and Detective Broussard met with Cheese at the prison. He was the drug kingpin who supposedly got robbed. They planned to strike a deal where they would return his drug money for the little girl. Cheese would have nothing to do with it and told the PI’s they weren’t seeing things clearly.That didn’t stop the detective and private eyes from finding someone within the organization to make the swap. It seemed while Cheese was in the tank his top man was making a run with his competition for his business. The detectives and private eyes would do anything to bring the little girl home. Their plan fell into place when they received a call to meet at the quarries to swap the $200,000 for Amanda McCready.The police force had blocked all the routes out of the quarry and the two detectives and private eyes were instructed where to go. The older detective, Poole, had an apparent heart attack climbing the treacherous path to the location. He told everyone to go on and call in the emergency once the little girl was found safe. The detectives were instructed by the kidnappers to go one way while the PI’s went another up the quarry wall.The PI’s found the little girl’s doll floating in a deep murky water filled gorge. Angie immediately stripped and dove into the cold water to find Amanda McCready. She came up empty-handed after several dives while being rocketed by bullets from automatic weapons. The helicopter the police brought in couldn’t reach her. She met Patrick and the others later at the pick-up location down the hill and found the two competing drug dealers dead in a car.  Police combed the area all night and the next day for the little girl. She wasn’t found. Detective Poole was taken to the hospital where he was listed in critical condition.The private eyes, Angie and Patrick, realized they’d reached a dead-end going that route. They made another attempt to rescue Amanda McCready by visiting Cheese, the drug dealer in prison. They had new ammunition since Bubba Rogowski, their friend, had gotten hit over the head while acting as their backup at the quarry. Although Cheese was a mighty big man, Bubba scared him to death whether on the inside or out. He knew he’d get him and the PI’s wanted to use that in their favor. It kind of worked only he wouldn’t give up the name/s of the kidnappers immediately. He had something to do or someone he needed talk to first. The Cheese didn’t live another 24 hours. He slipped on a wet floor and fell 40 ft. to his death. They were back to square one without a clue to Amanda McCready’s location.Angie and Patrick, the private eyes questioned themselves and one another about continuing the case. They rehashed everything they knew until their old friend Bubba asked Patrick to play backup on one of his deliveries. It was a small neighborhood where everyone knows everyone - cops, PI’s, drug dealers, addicts, prostitutes – you get the picture! The Dorchester boys/girls never forget the good or bad.Bubba had his reasons for asking Patrick’s backup for his delivery. But, that could wait until later. He had high-powered firearms to deliver and collect the cash. On delivery, the buyer wanted the firing clips immediately that went with the guns. Bubba wouldn’t let him have them until he counted his money and that took a while for he was constantly interrupted and had to begin counting again. Finally, the buyer’s woman came out with her gun and this didn’t stop Bubba’s counting his money either. In the end, there was gunfire from the woman and others who found hidden weapons stashed in unlikely places to shoot at them. Bubba made an opening where the door once was and they got away. Bubba didn’t leave them the clips for the automatic weapons he sold them.After getting safely away from the firepower, Patrick realized why Bubba had asked for him to ride along. There was something about the man that struck a memory. He had seen that face in one of the mug shots Detective Broussard had shown him of a perpetrator that did ungodly things to children. This might be a new lead in the case of finding the missing Amanda McCready and arresting her kidnappers.Patrick’s hunches began to unravel unseemly things about the investigators and the case. His doubts were verified by an agent from the Justice Department who had already figured it out. He warned he and Angie about their safety now that they knew too. This realization made him take a new look at himself, his friends, cops, and his relationship with Angie. He wondered if they could stand the testing this case had placed on them.Was there any way the private eyes and detectives from the CAC could work together now to solve the mystery and bring Amanda McCready home? Was there any way this little girl could come out a winner from her unfit mother and kidnappers? Gone, Baby, Gone: A Novel (Patrick Kenzie and Angela Gennaro Book 4)"}, {"review_sentiment": 4.0, "review_text": "I'm a fan of Lehane and probably like some of his other books better. I had not seen the movie before reading this, and would like to say the book is much better (isn't it always). There were a few twists, and I didn't expect the ending - although some of the end left me feeling unfulfilled but I guess that's part of Lehane that I love/hate. I enjoyed the main character Patrick and he felt genuine. There were slow parts but I think it was well worth getting through those for all the better parts of the book. Would recommend this book."}, {"review_sentiment": 5.0, "review_text": "Good story!"}, {"review_sentiment": 5.0, "review_text": "great appreciator of Dennis Lehane , I read and was run over by Mystic River , A novel of tragic importance , a talent of substance and style which I read with intense pleasure ........why was I  not surprised when artists like Sean Penn and Clint Eastwood were drawn to it's fantastic vision with visions of their own........What it put me in mind of was Thomas Wolfe's OF TIME AND THE RIVER . DEFINITELY , by the way WORTH REREADING .  and luckily enough LOOK at all  these other books by Dennis lehane............I AM ONLY A BOOK OR TWO SHORT OF THE WHOLE COLLECTION . I HAVE GIVEN UP COLLECTING BOOKS , FOR SURE AND REALLY...so many times.... And its always rewarding when a writer you like and admire meets up with success and good fortune and his career swells up like  Dramatic movie Soundtracks and his years as a crazy WRITER coalesce into recognition , appreciation , and whatever  rewards are his.............and if you like his work you now have the pleasant glow of looking forward to more books by Dennis Lehane . If you attempt even something as simple as a fan letter or a book review you will know and remember WRITNG is HARD WORK..........."}]}, "authors": ["Dennis Lehane"], "isbn": "0061336211", "longitude": -71.0595678, "periods": ["2000s", "Recent Releases"], "title": "Gone, Baby, Gone: A Novel (Patrick Kenzie and Angela Gennaro Series)", "word_cloud": "great series movie good also great read year enjoy little underwhelmed obviously pose serious moral issue theme way go pursue present issue le thing character lack flat opinion dialogue seem ring artificial force often form speak way try smart alack response also lack emotional depth really felt connection main character one matter often hard interaction dialogue conflict come big cliche stereotype give go way top various way absurd amount violence language seem overreach know author try realistic take far seem go shock value point additionally plot go direction second half quite improbable unrealistic really fail deliver more summer beach read anything else huge fan novel best write find anywhere greatest fiction ever fit others involve darker side society time go far depress make wonder survive keep read author good miss confusingly plot violent series think vastly overrate time write describe sicken child abuse do great novel totally engage gift story teller story weekend story dark depress not exactly style still gift story teller girl disappear trace home mom leave alone next door watch tv friend story detective others later involve case child kidnap found unit bring assist squad mission immediately bring investigate miss child aunt contact private eye see medium work kidnapped kid take include bankrupt family hire find try first meeting indicate leverage unsolved murder lap then play soft side case badly family really want take case bring back painful memory unsolved case something constant pleading make finally agree case inform plan warned release info medium ground rule thing begin unwind uncovered mom steal drug dealer child disappear finally own steal money drug deal turn bad now appeared kidnap mom private eye meet prison drug kingpin supposedly get rob plan strike deal drug money little girl nothing tell see thing stop detective private eye find someone organization make swap seem tank top man make run competition business detective private eye anything little girl home plan fell place receive call meet quarry swap police force block route quarry detective private eye instruct go older detective apparent heart attack climb treacherous path location tell everyone call emergency little girl find safe detective instruct kidnapper way go quarry find little girl doll float deep murky water fill gorge immediately strip cold water find come several dive rocket bullet automatic weapon helicopter police bring reach meet others later location hill find compete drug dealer dead car comb area night next day little girl find take hospital listed critical private eye realize reach go route make attempt rescue visit cheese drug dealer prison new ammunition friend gotten hit head act backup quarry mighty big man scar death know want use favor kind work give kidnapper immediately something someone need talk first live hour slip wet floor fell death back square clue private eye question continue case rehash everything know old friend ask play backup deliveries small neighborhood everyone know everyone cop drug dealer addict prostitute get never good reason ask backup delivery later firearms deliver collect cash delivery buyer want fire clip immediately go gun let count money take constantly interrupt begin count buyer woman come gun stop count money end gunfire woman others find hidden weapon stash unlikely place shoot make open door get away leave clip automatic weapon sell get safely away firepower realize ask ride along something man strike memory see face mug shot show perpetrator ungodly thing child new lead case find miss arrest hunch begin unravel unseemly thing investigator case doubt verify agent already figure warn safety know realization make new look friends cop relationship wonder test case place way private eye detective together mystery bring home way little girl winner unfit mother kidnapper fan probably better see movie read much better always twist expect end end leave feeling unfulfilled guess part enjoy main character felt genuine slow part think well get better part good story great appreciator run mystic tragic importance talent substance style intense pleasure surprise artist drawn fantastic vision vision put way luckily enough lehane be only have give many time always reward writer admire meet success good fortune career swell movie year crazy coalesce recognition appreciation reward work pleasant glow look forward attempt even something simple fan letter review know", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "In Gone, Baby, Gone, the master of the new noir, New York Times bestselling author Dennis Lehane (Mystic River, Shutter Island), vividly captures the complex beauty and darkness of working-class Boston. \r\n\r\nA gripping, deeply evocative thriller about the devastating secrets surrounding a little girl lost, featuring the popular detective team of Patrick Kenzie and Angela Gennaro.\r\n\r\n“Chilling, completely credible….[An] absolutely gripping story.” Chicago Tribune\r\n \r\n", "asin": "0061336211", "rank": "55690", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/51yk8OyZROL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}