{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 49, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "An amazing body of work. I am a Haitian American and I can tell you that the author has answered questions that my 81 year old father had been plagued with forever. Zora Neale Hurston really dived in deep and came out with results. A spectacular read!!!"}, {"review_sentiment": 5.0, "review_text": "The book came with little to no imperfections. As for the story, Zora Neale Hurston is an amazing author and doesn't disappoint. She knows how to use her voice and transform literary writing. The story itself was engaging and a learning experience for me."}, {"review_sentiment": 3.0, "review_text": "Great little business. Lovely, friendly follow-up. Awesome bread product. Go get yourself one. great. Very well. it is a very useful tool, Satisfied."}, {"review_sentiment": 5.0, "review_text": "I AM A BIG FAN OF MS. HURSTON.  HER WORK DOES NOT DISAPPOINT.  SHE IS A MASTER IN GENRE OF AFRICAN AMERICAN LITERARY TRADITION."}, {"review_sentiment": 5.0, "review_text": "Fascinating.  A must read!"}, {"review_sentiment": 4.0, "review_text": "Interesting"}, {"review_sentiment": 5.0, "review_text": "Good book well written to suck you in to island ways..."}, {"review_sentiment": 5.0, "review_text": "This book entranced me with it's wonderful tone and detail. Zora Neale Hurston was an incredible woman."}, {"review_sentiment": 5.0, "review_text": "Necessary...not scholarly, but very vivid"}, {"review_sentiment": 3.0, "review_text": "Lengthy but informative"}]}, "authors": ["Zora Neale Hurston"], "isbn": "0061695130", "longitude": 0.0, "periods": ["1900s"], "title": "Tell My Horse: Voodoo and Life in Haiti and Jamaica", "word_cloud": "amazing body work haitian american author answer question year old father plague forever really dive deep come result spectacular come little imperfection story amaze author disappoint know use voice transform literary write story engage learn experience little business lovely friendly bread product great very well useful tool satisfy be be master fascinate interest good well write suck island way entrance wonderful tone detail incredible woman necessary scholarly vivid informative", "genres": ["Travel Writing", "Social & Cultural Studies"], "summary": "Based on acclaimed author Zora Neale Hurston's personal experiences in Haiti and Jamaica—where she participated as an initiate rather than just an observer during her visits in the 1930s—Tell My Horse is a fascinating firsthand account of the mysteries of Voodoo. \r\n\r\nAn invaluable resource and remarkable guide to Voodoo practices, rituals, and beliefs, it is a travelogue into a dark, mystical world that offers a vividly authentic picture of ceremonies, customs, and superstitions.", "asin": "0061695130", "rank": "73248", "city": "Haiti", "image": "https://images-na.ssl-images-amazon.com/images/I/51s4db9Oc6L.jpg", "country": "Jamaica", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}