{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 18, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "So well written I thought I was living the book!"}, {"review_sentiment": 5.0, "review_text": "Very enjoyable book! Great family saga and also a look back at the Jamaica of some time ago. Congratulations to the author."}, {"review_sentiment": 5.0, "review_text": "Wonderful memoire! Lorna Goodison writes evocatively and poetically. I was born in Jamaica a few years after she was, but being a city-dwelling youngster living in Kingston, of British parents, I was sadly isolated from the true Jamaica, and left at age 14 when my parents returned to England. I craved, but was never given any clear understanding of  the reality for real Jamaicans, their country life, nor of the dynamics and history  which resulted in what was happening at that time on this beautiful island. Indeed what I observed and experienced was nonetheless filtered through my parents' and their friends' superficial and certainly biased interpretations.She describes her family's lives and history with a poetic yet pragmatic style. The language, expressions, perfumes, colours, nature, philosophy and so much more brought my childhood experiences and vague memories back to life and enabled me to understand and relive them from an adult's perspective.We must have both been in the same theatre on the same night that Emlyn Williams read poetry to hundreds of school pupils! That I was sharing the same physical space, breathing the same air, as someone who would become such a talented and respected writer thrills me to the core!"}, {"review_sentiment": 4.0, "review_text": "A story I enjoyed and brought back many memories of my childhood in the interior of Jamaica. A vanishing Jamaican way of life."}, {"review_sentiment": 5.0, "review_text": "Easy read and so engaging, finished in one week, could not put it down. Thank you Lorna for cover to coverImagery"}, {"review_sentiment": 5.0, "review_text": "Good read"}, {"review_sentiment": 5.0, "review_text": "A prose poem that incorporates both a lyrical magic-realist celebration of rural island life, and a clear-eyed chronicle of the family's struggles in the city. Country and town, colonial and post-colonial life, race relations, emigration, love and loss are vividly portrayed in unforgettable Jamaican voices and images."}, {"review_sentiment": 4.0, "review_text": "Not necessarily for family historians but an interesting look at post-slavery life in the Carribean and successful mixed marriages. Little hint of racism."}, {"review_sentiment": 1.0, "review_text": "Barely humorous in some parts and mostly boring. Too much past & present references making it difficult to follow and enjoy."}, {"review_sentiment": 5.0, "review_text": "Apparently a very similar experience of the another review \"Lorraine R\" but this book was a gift from a friend who knows the author and sent to me while I was living abroad. The review below is a cut and paste of my email thanking her for the gift. Was not meant to be a review but it was an authentic record of how enjoyable a read it was. It read as follows....For lack of skills like Lorna’s I cannot explain how what a wonderfully gratifying read that novel has been. I been going slow because I don’t want it to end. I keep taking breaks to rejoin the Christmas festivities and go back largely cuz I wanna stretch it. When I am away from it I have to remind myself it was a book as I find myself thinking about what I am probably missing….just for a few seconds you forget these events are not taking place. But that’s just a testament of how much it reels me in where I feel like I am there with the Harvey’s and in a way I swear I am.These stories are the ones I have always wanted to be told to me, the ones I had wished from my Grandparents (they were never that type). Those are the stories that explain my love for old Caribbean architecture…this is what I dream of as I walk thru the old structures, or when I visit downtown, or see old photos, or read the history books…in my head I recreate stories of what happened in these rooms and who lived there and as I touch the walls I think of all those who touched it before and I dream on and on. It’s not so much the architecture most times but what the architecture evokes. I feel as if these stories are also mine because part of me thinks that this novel reflects not just Lorna’s but the story of the Walkers and the Calders that was never shared, that I thought I lost out on and now I can fill in the missing gaps….wrong or right I just feel like Lorna’s story mirrors many a Jamaican family living in that era. Her ancestors were Irish mine were Scottish but I treat those as semantics.I had always been grossly disappointed by the holes in my past….the dots that I cannot connect and its like she’s not only provided the dots but connected them and I can see shapes emerging. She uses phrases and words I have not heard in decades and it brings back the most wonderful of memories. When she spoke of her first journey from Kingston to Harvey’s River, a 14 hour trek….my heart expands with the memory of my 4 hour trips between Copse, Hanover and Kingston…. Mom stuffing my brother’s shirt with newspaper for car sickness etc etc. just like hers. She used words I never saw in print but remember my mother using them…lawks it sweet. When she talks of Harvey River I remember my Great River jaunts, I was never able to catch jangas no matter how I tried but the stories of the duppies by certain spots that suck you in ….it goes on and on. The setting here for this novel is providentially perfect and just what I thought it would be and I am blissfully grateful for this gift of yours. I am at 204 of 288 pages and feeling wistful regret at the inevitable end. The opportunity will quicker come your way than mine, when it does will you tell the author I am in her debt."}]}, "authors": ["Lorna Goodison"], "isbn": "0061337560", "longitude": 0.0, "periods": ["1800s", "1900s"], "title": "From Harvey River: A Memoir of My Mother and Her Island", "word_cloud": "so well write think live very enjoyable family saga also look back time congratulation author wonderful memoir write evocatively poetically bear year youngster live british parent sadly isolate true leave age parent return crave never give clear understanding reality real country life dynamic history result happen time beautiful indeed observe experienced nonetheless filtered parent friends superficial certainly bias describes family live history poetic yet pragmatic style language expression perfume color nature philosophy much bring childhood experience vague memory back life enable understand relive adult night poetry hundred school share physical space breathe air someone talented respected writer thrill core story enjoy bring back many memory childhood interior vanish jamaican way life easy engage finish week cover cover imagery good prose poem incorporate lyrical celebration rural life chronicle family struggle city town colonial life race relation emigration loss vividly portray unforgettable jamaican voice image not necessarily family historian interesting look life successful mixed marriage little hint racism barely humorous part mostly bore much present reference make difficult follow enjoy apparently similar experience review gift friend know author send live abroad review cut paste email thank gift mean review authentic record enjoyable follow lack skill explain wonderfully gratify go slow want end keep take break rejoin festivity go back largely cuss wan away remind find think probably second forget event take place testament much reel feel way swear stories one always want told one wish never type story explain old dream walk thru old structure visit downtown see old photo history head recreate story happen room live touch wall think touch dream much architecture time architecture evokes feel story also mine part think reflect story never share think lose fill miss right feel story mirror many family live era ancestor mine scottish treat always grossly disappointed hole dot connect provide dot connect see shape emerge use phrase word hear decade brings back wonderful memory speak first journey hour heart expand memory hour trip stuff brother shirt newspaper car sickness use word never saw print use sweet talk remember jaunt never able catch jangle matter try story guppy certain spot suck go set providentially perfect think blissfully grateful gift page feel wistful regret inevitable end opportunity quicker way mine tell author debt", "genres": ["Memoir", "Biography", "History"], "summary": "When Doris Harvey's English grandfather, William Harvey, discovers a clearing at the end of a path cut by the feet of those running from slavery, he gives his name to what will become his family's home for generations. For Doris, Harvey River is the place she always called home, the place where she was one of the \"fabulous Harvey girls,\" and where the rich local bounty of Lucea yams, pimentos, and mangoes went hand in hand with the Victorian niceties of her parents' house. It is a place she will return to in dreams when her fortunes change, years later, and she and her husband, Marcus Goodison, relocate to \"hard life\" Kingston and encounter the harsh realities of urban living in close quarters.\r\n\r\nIn Lorna Goodison's luminous memoir of her forebears, we meet a cast of wonderfully drawn characters, including George O'Brian Wilson, the Irish patriarch of the family who marries a Guinea woman after coming to Jamaica in the mid-1800s; Doris's parents, Margaret and David, childhood sweethearts who become the first family of Harvey River; and Margaret and David's eight children.\r\n\r\nIn lush, vivid prose, textured with the cadences of Creole speech, Lorna Goodison weaves together memory and mythology to create a vivid tapestry. She takes us deep into the heart of a complete world to tell a universal story of family and the ties that bind us to the place we call home.", "asin": "0061337560", "rank": "1104168", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZXu1LIA%2BL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}