{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 179, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "Interesting story but seems to drag on and on"}, {"review_sentiment": 4.0, "review_text": "Very familiar with this story. A most interesting read."}, {"review_sentiment": 3.0, "review_text": "I enjoyed this book as I am from Boston and have been going to that museum all of my life and know about all of the characters involved. It was very readable too, but somehow I was hoping for something more in the matter of \"whodunnit\"."}, {"review_sentiment": 4.0, "review_text": "An amateur sleuth becomes emotionally involved with the Gardner art heist. Travels the world to learn about the world of art thieves but in the end, he really learns more about his self.Well done"}, {"review_sentiment": 2.0, "review_text": "This book was too much conjecture and not enough facts.  The author goes on and on at length about all sorts of leads, many of them bogus, from all sorts of shady characters, but it the end, the book doesn't really reveal much.  You'll get more information about the infamous theft by Googling the theft and reading articles posted by the Boston Globe over the years.In one chapter, the author takes it upon himself to fly to Ireland to search for Whitey Bulger in hopes that he may lead to the stolen artwork.  This is just as ridiculous as it sounds.  What are the chances that someone will just simply run into Whitey Bulger in some remote village in the Irish countryside?  And let's say, by some enormous stroke of luck (bad luck?), that he DID actually encounter Bulger in Ireland.  Does the author really think that Bulger would simply hand over the artwork?  You'd be a million times more likely to be killed than to be given the artwork.In another chapter, the author wrote an imagined conversation between himself and the fictitious holder of the artwork in some dark room, fantasizing about the things he would say and the responses he would get from this phantom character.  Why am I reading this?  I want facts, not fantasies.The author had another chapter where he writes about some character named Turbo who just-might-possibly-maybe-but-not-really have clues about the theft.  Then later he dismisses Turbo as being a habitual liar, rendering his far-fetched babbling no credence.  Why fill pages of a book with false leads?  Why pad the duration of the book with conjecture?  I don't want to hear false information. I want the facts of the case and credible leads.I gave it two stars because the hardcover has some nice color pictures in it."}, {"review_sentiment": 5.0, "review_text": "Caught the Gardner bug.  The book was published in 2008 and the mystery has still not been solved.  I find it hard to believe that the  FBI never interviewed a witness that saw the two robbers that night or didn't interview the witness on a timely basis. A good resource for someone still hunting and hoping for the reward.  Fascinating story real!y.  I'd vote that David Turner was the culprit.  I wish I could write the tell all story of his life!"}, {"review_sentiment": 3.0, "review_text": "This book starts off very interesting. If you are an art afficiando you've heard of the Gardner museum heist,  but you won't learn anything here. I've read a dozen or more magazine and news articles about the case over the years and this author really offered nothing new. That, and the fact that this book is nearly 10 years old  means that the info it contains is just outdated. One glaring example: the author spends chapters tying the heist to a famous Boston mobster who has since been captured and is now in prison. IF this gangster had ANYTHING to do with the heist, he would have bargained with the stolen artworks for a lighter sentence. He didn't, so, obviously, had nothing to do with the theft.  I do have to say the beginning chapters discussing the world of art theft and recovery were quite informative."}, {"review_sentiment": 4.0, "review_text": "Fascinating book. The author tells the story of the theft and the investigation that have taken place. There is no good ending though, this is an unsolved case."}, {"review_sentiment": 5.0, "review_text": "As an Art History student interested in the role of plunder in recent history, it was a great read. However I can understand how this could be a little bit boring as it is very dense. It does provide a very thorough insight into the heist though and is a great read for anyone interested in such subjects."}, {"review_sentiment": 5.0, "review_text": "True story. Excellent"}]}, "authors": ["Ulrich Boser"], "isbn": "0061451843", "longitude": -71.0595678, "periods": ["2000s", "Recent Releases"], "title": "The Gardner Heist: The True Story of the World's Largest Unsolved Art Theft", "word_cloud": "interest seem drag very familiar interesting enjoy go museum life know character involve readable somehow hop something matter whodunit amateur sleuth become emotionally involved heist world learn world thief end really learn do much conjecture enough facts author go length sort lead many bogus sort shady character end really reveal much get information infamous google reading article post chapter author take fly search hop steal artwork ridiculous sound chance someone simply remote village irish countryside say enormous stroke luck bad luck actually encounter really think simply hand artwork time likely kill give chapter author write imagined conversation fictitious holder artwork dark room fantasizing thing response phantom character read want fact chapter write character name clue then later dismisses habitual liar render babble credence fill page false lead pad duration conjecture want hear false information want fact case credible give star hardcover nice color picture bug publish mystery still solve find hard believe never interview witness saw robber night interview witness timely basis good resource someone still hunt hop reward real vote culprit wish life start interest heard museum heist anything dozen magazine news article case year author really offer nothing new fact nearly year old mean info contains outdated glare example author spend chapter tie heist famous mobster capture prison gangster heist steal artwork lighter sentence obviously nothing say begin chapter discuss world recovery quite informative fascinate author tell investigation take place good end case student interested role plunder recent history great however understand boring dense provide insight heist great anyone interested subject", "genres": ["Art & Architecture", "History"], "summary": "Shortly after midnight on March 18, 1990, two men broke into the Isabella Stewart Gardner Museum in Boston and committed the largest art heist in history. They stole a dozen masterpieces, including one Vermeer, three Rembrandts, and five Degas. But after thousands of leads—and a $5 million reward—none of the paintings have been recovered. Worth as much as $500 million, the missing masterpieces have become one of the nation's most extraordinary unsolved mysteries.\r\n\r\nAfter the death of famed art detective Harold Smith, reporter Ulrich Boser decided to take up the case. Exploring Smith's unfinished leads, Boser travels deep into the art underworld and comes across a remarkable cast of characters, including a brilliant rock 'n' roll thief, a gangster who professes his innocence in rhyming verse, and the enigmatic late Boston heiress Isabella Stewart Gardner herself.\r\n\r\nBoser becomes increasingly obsessed with the case and eventually uncovers startling new evidence about the identities of the thieves. A tale of art and greed, of obsession and loss, The Gardner Heist is as compelling as the stolen masterpieces themselves.\r\n\r\n“Boser has produced a captivating portrait of the world’s biggest unsolved art theft.” Wall Street Journal", "asin": "0061451843", "rank": "38592", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/51VjU%2BTkCcL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}