{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 463, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "It's a cute book but all the character are dumb as h***. I think this book well written by a author who clearly has a psychology background and would recommend it to people who are interested in psychology and for people who just want to have a good read, just a warning though characters are very unlikeable especially to me"}, {"review_sentiment": 5.0, "review_text": "The Unbearable Lightness of Being is one of the great books of the last century.  It's both a novel and a work of philosophy.  The narrator presents his characters in action and then speculates on the meaning and motivation of said actions and characters, using metaphors and anecdotes drawn from literature and history.  Sometimes the speculations seem like unrelated digressions, but eventually the narrator ties them into the story, and frequently the result is a startling revelation for the reader.  There are many \"a-ha!\" moments in the book, and they are very rewarding.  You would think that with all the philosophizing that the story would drag and even have a wooden, puppet-show feel.  This is not the case.  Tomas, Tereza, Sabina, Franz, and even Karenin the dog are \"real\" flesh-and-blood creatures--complex, fallible, contradictory, noble, weak, compassionate, etc--just like us.  In the end, Kundera proves himself a great understander of the human condition, up there with Tolstoy and Dostoevsky.  Read this book carefully and patiently and you will leave it with a better understanding of people, relationships, and even society (for example, Kundera's thoughts on kitsch seem more timely today than when he first penned them).  Highly recommended."}, {"review_sentiment": 5.0, "review_text": "What a nice volume!"}, {"review_sentiment": 5.0, "review_text": "Perfect"}, {"review_sentiment": 5.0, "review_text": "Truly an amazing book. I was a bite thrown off by the cover. Don’t let the appearance stop you from reading this book!"}, {"review_sentiment": 5.0, "review_text": "Highly recommend this captivating story"}, {"review_sentiment": 5.0, "review_text": "Very good"}, {"review_sentiment": 5.0, "review_text": "Excellent read!"}, {"review_sentiment": 3.0, "review_text": "good book but the low quality"}, {"review_sentiment": 5.0, "review_text": "gift for my son"}]}, "authors": ["Milan Kundera"], "isbn": "0061148520", "longitude": 14.4212535, "periods": ["1900s"], "title": "The Unbearable Lightness of Being", "word_cloud": "cute character dumb think well write clearly psychology background people interested psychology people want good warning character unlikable especially great last century philosophy narrator present character action speculate mean motivation say action character use metaphor anecdotes drawn literature history speculation seem unrelated digression eventually narrator tie story frequently result startle revelation many moment reward philosophize story even wooden feel case even dog real creature complex fallible contradictory noble weak compassionate etc end prove great under stander human condition carefully patiently leave better understanding people relationship even society example thought kitsch seem timely today first pen recommend nice volume perfect truly amazing bite thrown cover let reading recommend captivate story very good excellent good low quality gift son", "genres": ["Fiction & Literature", "Cold War"], "summary": "When The Unbearable Lightness of Being was first published in English, it was hailed as \"a work of the boldest mastery, originality, and richness\" by critic Elizabeth Hardwick and named one of the best books of 1984 by the New York Times Book Review. It went on to win the Los Angeles Times Book Prize for Fiction and quickly became an international bestseller. Twenty years later, the novel has established itself as a modern classic. To commemorate the anniversary of its first English-language publication, HarperCollins is proud to offer a special hardcover edition.\r\n\r\nA young woman in love with a man torn between his love for her and his incorrigible womanizing; one of his mistresses and her humbly faithful lover -- these are the two couples whose story is told in this masterful novel.\r\n\r\nControlled by day, Tereza's jealousy awakens by night, transformed into ineffably sad death-dreams, while Tomas, a successful surgeon, alternates loving devotion to the dependent Tereza with the ardent pursuit of other women. Sabina, an independent, free-spirited artist, lives her life as a series of betrayals -- of parents, husband, country, love itself -- whereas her lover, the intellectual Franz, loses all because of his earnest goodness and fidelity.\r\n\r\nIn a world in which lives are shaped by irrevocable choices and by fortuitous events, a world in which everything occurs but once, existence seems to lose its substance, its weight. Hence we feel, says the novelist, \"the unbearable lightness of being\" -- not only as the consequence of our private acts but also in the public sphere, and the two inevitably intertwine.\r\n\r\nThis magnificent novel encompasses the extremes of comedy and tragedy, and embraces, it seems, all aspects of human existence. It juxtaposes geographically distant places (Prague, Geneva, Paris, Thailand, the United States, a forlorn Bohemian village); brilliant and playful reflections (on \"eternal return,\" on kitsch, on man and animals -- Tomas and Tereza have a beloved doe named Karenin); and a variety of styles (from the farcical to the elegiac) to take its place as perhaps the major achievement of one of the world's truly great writers.", "asin": "0061148520", "rank": "7759", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/41wW6tCBu4L.jpg", "country": "Czechia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}