{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 76, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Well-written. Interesting for New Orleans fans."}, {"review_sentiment": 4.0, "review_text": "We'd seen it all before,  the menacing radar images, the Weather Channel reporters braced against the driving rain and howling wind. What we weren't prepared for were the images of people stranded on their own rooftops.  Like so many others, I wondered aloud, \"Why didn't those fools evacuate?\" After reading this book, I understand and am more than embarrassed by my naive opinions. Mr Piazza weaves a bittersweet story about every day people living their lives in the exotic climate of New Orleans. Katrina roared ashore and took so much from so many yet could not destroy the binds that keep families together. With determined spirits, they endured and returned to rebuild not only their city, but also their lives."}, {"review_sentiment": 5.0, "review_text": "Loved this story of two families in the aftermath of Katrina.  I found it compelling reading."}, {"review_sentiment": 5.0, "review_text": "I have never lived or even visited New Orleans and certainly never lived through the devastation of a hurricane. Piazza has made all of what is at the heart of NO today come alive and real for me. Beyond that this book has so many levels of meaning--family dynamics and the importance of them in our lives; career and personal choices and the paths they cause us to walk; the internal strength a person can have; and how the best friends we have may be the strangers who live near us."}, {"review_sentiment": 5.0, "review_text": "Great book! Enjoyed!"}, {"review_sentiment": 4.0, "review_text": "This book tells the story of Hurricane Katrina from two different families' perspectives.  Very well written and an eye opener."}, {"review_sentiment": 4.0, "review_text": "It is hard to get into, but good book about New Orleans."}, {"review_sentiment": 5.0, "review_text": "I've read many books about Katrina and the aftermath and tho this one is a work of fiction it reads like a true story. I quickly became invested in the characters and their situations, and knowing what was ahead for them made  it a suspenseful experience. The way things played out for them, with all the emotional turmoil and tough decisions they faced, was very satisfying, and I would recommend this book to everyone!"}, {"review_sentiment": 5.0, "review_text": "We lost a 15 unit apartment complex in Katrina. I knew about NO, but reading this brought all the emotions back. This is a beautifully written book, from someone who was there. If you are from the south, this is an awesome book. If you are from the north, you will get a great glimpse of the southern heart."}, {"review_sentiment": 5.0, "review_text": "Great Read! I loved the characters who made the experience real again."}]}, "authors": ["Tom Piazza"], "isbn": "0061673617", "longitude": -90.0701156, "periods": ["2000s", "Recent Releases"], "title": "City of Refuge", "word_cloud": "interest fan see menace radar image reporter brace drive rain howl prepared image people strand rooftop many others wonder aloud fool evacuate read understand embarrassed naive opinion weave bittersweet story day people live life exotic climate roar ashore take much many yet bind family together determined spirit endure returned rebuild also live love story family find compel reading never live even visit certainly never live devastation hurricane make heart today alive real many level mean family dynamic importance live career personal choice path cause walk internal strength person best friend tell story different family perspectives very well write eye opener hard good many aftermath tho work fiction read true story quickly become invested character situation know ahead make suspenseful experience way thing play emotional turmoil tough decision face satisfying everyone lose unit apartment complex know read bring emotion beautifully write someone south awesome north get great glimpse southern heart love character make experience real", "genres": ["Fiction & Literature"], "summary": "In the heat of late summer, two New Orleans families—one black and one white—confront a storm that will change the course of their lives.\r\nSJ Williams, a carpenter and widower, lives and works in the Lower Ninth Ward, the community where he was born and raised. His sister, Lucy, is a soulful mess, and SJ has been trying to keep her son, Wesley, out of trouble. Across town, Craig Donaldson, a Midwestern transplant and the editor of the city's alternative paper, faces deepening cracks in his own family. New Orleans' music and culture have been Craig's passion, but his wife, Alice, has never felt comfortable in the city. The arrival of their two children has inflamed their arguments about the wisdom of raising a family there.\r\n\r\nWhen the news comes of a gathering hurricane—named Katrina—the two families make their own very different plans to weather the storm. The Donaldsons join the long evacuation convoy north, across Lake Pontchartrain and out of the city. SJ boards up his windows and brings Lucy to his house, where they wait it out together, while Wesley stays with a friend in another part of town.\r\n\r\nBut the long night of wind and rain is only the beginning—and when the levees give way and the flood waters come, the fate of each family changes forever. The Williamses are scattered—first to the Convention Center and the sweltering Superdome, and then far beyond city and state lines, where they struggle to reconnect with one another. The Donaldsons, stranded and anxious themselves, find shelter first in Mississippi, then in Chicago, as Craig faces an impossible choice between the city he loves and the family he had hoped to raise there.\r\n\r\nRanging from the lush neighborhoods of New Orleans to Texas, Missouri, Chicago, and beyond, City of Refuge is a modern masterpiece—a panoramic novel of family and community, trial and resilience, told with passion, wisdom, and a deep understanding of American life in our time.\r\n\r\n\"City of Refuge is an old-fashioned, realistic novel of New Orleans, with all the sensuousness, all the flash-point tumult, the easy-yet-hard-won virtue of the city, as well all the forthrightness, the deftness and affirming intensity of the form. People ask me when will Katrina begin to inform our art, when will imagination become essential to tell what the raw facts can't. Well, here's an answer: now. City of Refuge speaks eloquently into that silence.\" Richard Ford", "asin": "0061673617", "rank": "661784", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51NE67Li1-L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}