{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 82, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "A beloved classic from my youth. To read it is to fall in love again."}, {"review_sentiment": 4.0, "review_text": "\"Bonjour Tristesse\"  was a timely book in the 1950's, when rebellious teenagers were a popular concern in the United States.  Written by a teenager, its principal character was a seventeen-year-old girl named Cecile, who could have been a poster child for a style of lax parenting that 1950's America found abhorrent.  The book had the appeal of a cautionary tale.The novel is sparely written,  and author Francois Sagan shows a keen understanding of psychological conflicts.  The triangle of conflict concerns Cecile, her permissive and promiscuous father Raymonde, and  Anne, the woman who hopes to marry Raymonde and provide stability to both of their lives.At its best, the book is like a diary of a teenaged girl's conflicted impulses to become an adult on one hand, but to remain a carefree \"friend\" of her father on the other.  The brittleness of Anne is a threat, and so Cecile sets about destroying her, even as she conceals her motivations from herself.\"Bonjour Tristesse\" was made into a not entirely successful film by Otto Preminger.  Preminger failed to give enough emphasis to the key conflict between Anne and Cecile,  glossing over mistakes made by Anne (such as locking Cecile in her room), and portraying her as a victim.  Because of the mores of the time, Cecile's experiments with sexuality were made to seem more innocent than they were, and Cecile's previous stay in a convent school  isn't made clear.In today's climate of books produced for a youth market, \"Bonjour Tristesse\" probably wouldn't make a dent."}, {"review_sentiment": 4.0, "review_text": "A fine novel, written in easy to understand (french) prose."}, {"review_sentiment": 5.0, "review_text": "Peachy, wonderful, fabulous, couldn't live without it!!!"}, {"review_sentiment": 3.0, "review_text": "This novel by Françoise Sagan is much more than sadness as title implies. It is the story of a young girl living with his father and spending a nice vacation in the Côte d'Azur when someone comes to alter this subtle balance. It is a rather short book but also entertaining and very well written. Characters are complex, as the human relationships depicted by Sagan in the novel. Very recommendable and especially in French since it's not difficult to follow if you have some knowledge of the language."}, {"review_sentiment": 5.0, "review_text": "GREAT BOOK FOR TEENAGE GIRL"}, {"review_sentiment": 4.0, "review_text": "Bonjour Tristesse—Hello Sadness is a 1954 classic that I had just read. It describes the story of 17-year-old Cécile during summer vacation on the Riviera with her 40-year-old widowed father, Raymond, and his 29-year-old, vacuous, but kind mistress, Elsa.Cécile spent ten years in a convent boarding school before returning to her father. Raymond worked in publicity, was charismatic, self-indulgent, and promiscuous. He kept young women for six months before moving on to his next conquest. Cécile, a cynic, loved life with her father who didn’t appear to make a fuss at her failing grades. A positive was Raymond loved his daughter, was approachable and accessible; however, he was too permissive and didn’t set rules and boundaries. Cécile’ enjoyed a whirlwind of adult parties and drinking with Raymond and his friends. He referred to Cécile as his ‘little partner in crime.’The three, Cécile, Raymond and Elsa spent a happy summer on the Mediterranean. Cécile had met passionate Cyril, a college student who appeared enamored of her. Yet Cécile felt the shadow of their peaceful and idyllic summer was invaded when Anne Larsen arrived. Anne worked in fashions in Paris, and was a friend of Cécile’s late mother.Cécile admired 40-year-old, Anne, but felt inadequate in her presence. Anne was intelligent, sophisticated and cultured. She strongly disapproved of Cécile’s behavior and grades. She demanded Cécile’ study for her next exam in the fall.Cécile was not happy with how Anne had begun to rearrange their lives. Anne controlled her relationship with Cyril, and wheedled her way into Raymond’s life. In no time, Anne seized Raymond’s attentions from Elsa. With Elsa gone, love bloomed overnight between Raymond and Anne. Secretly, Cécile became sexually active with Cyril.Raymond announced to Cécile that he and Anne would marry when they returned to Paris.Cécile believed Anne would shatter their life of decadence, fun and merriment for a more controlled and cultured life. Cécile refused to accept this. She became a master schemer at manipulating her father, Cyril and Elsa, which wreaked havoc on what might have been bonjour bonheur.I loved Sagan’s character Anne’s view on serial womanizers: “…they are no longer attractive or in good form. They can’t drink anymore and they still hanker after women. Only then they have to pay heavily and lower their standards, to escape from their loneliness. They grow sentimental and querulous.”I enjoyed this well written, short novel. The characters were well fleshed out and believable. I gave this book four stars."}, {"review_sentiment": 5.0, "review_text": "I don't understand the reviews written by people who didn't enjoy it based on it not being \"shocking\" for their time period.  I have read several saying \"oh it was probably such and such in the 50s but boring to me\" or some-such.  Nonsense.  Is it a product of its time and place?  Naturally.  And naturally our social mores have evolved since the expectations of this novel's contemporary audience.  A good reader, however, recognizes the setting into which the novel was introduced and enjoys it (or doesn't) based on its own merits.Sagan's style has much to recommend it.  It is thoughtful and the protagonism - not just in this book but thorughout her career - is compelling because the characters are complex in their simplicity.  Meaning, they are generally young women un-self-consciously direct about their flaws as well as passions, and betraying themselves when they do not truly comprehend themselves.  It is a tricky thing to accomplish as a writer & Sagan does so deftly.  Her narrative voice intertwines with her characters', leaving the reader with the sense that every novel is really about some element of Sagan herself, but with enough distance to accept that it's not exactly a mirror.Just as a subjective aside, the time/place element is always a treat to me, as I noted above this is to be read as literature, not as a current pop phenomenon.  In a different way:  Anne Bronte's \"The Tenant of Wildfell Hall\" was shocking in its time, and was suppressed because of its bold feminisms.  Sagan was not suppressed, even if history tells us French society was \"shocked\" at the candor with which the female youth expresses her sexual freedom.  One can lay certain credit at the feet of feminists like Bronte and Sagan, for the undeniable ways in which they helped shape their societies."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "A classic that I had somehow never gotten around to and very glad that I finally did; very evocative of a certain era and mindset- (and in some ways an enduring one) as well as simply interesting; the character depictions by the main character are incisive and beautifully drawn, as well as subject to shifts in perspective because, as an adolescent, her maturity shape-shifts as she encounters various challenges.  The intelligence of the main character is never cloying, but rather deeply interesting, (and of course all the more so as much of the immense popularity of the book is the fascination with Sagan's age when she wrote it (the same as the main character).  The story gives one an open door into a certain world, at a certain time, from a certain person.  Highly readable, sensuous and evocative."}]}, "authors": ["Francoise Sagan"], "isbn": "0061440795", "longitude": 0.0, "periods": ["1900s"], "title": "Bonjour Tristesse", "word_cloud": "beloved classic youth timely rebellious teenager popular concern teenager principal character girl name child style lax parent find appeal cautionary sparely write author show understand psychological conflict triangle conflict concern permissive promiscuous father woman hop marry provide stability best diary teenage girl conflict impulses become adult hand remain carefree friend father brittleness threat set destroy even conceals motivation make entirely successful film fail give enough emphasis key conflict gloss mistake make lock room portray victim more time experiment sexuality make seem innocent previous stay convent school make today climate produce youth market probably dent fine write easy understand french prose wonderful fabulous much sadness title imply story young girl live father spending nice vacation someone come alter subtle balance rather short also entertain well write complex human relationship depict recommendable especially french difficult follow knowledge language great classic describe story summer vacation widow vacuous kind mistress spend year convent board school return father work publicity charismatic promiscuous keep young woman month move next conquest cynic love life father appear make fuss fail grade positive love daughter approachable accessible however permissive set rule boundary enjoy adult party drink friend refer little partner spend happy summer meet passionate college student appear enamor yet felt shadow peaceful idyllic summer invade arrive work fashion friend late admire felt inadequate presence intelligent sophisticate cultured strongly disapprove behavior grade demand study next exam happy begin rearrange live control relationship wheedle way life time seize attention go love bloom overnight become sexually active announce return believed life decadence fun merriment control cultured life refuse become master schemer manipulate father wreak havoc love character view serial womanizer longer attractive good form drink anymore still woman only pay heavily lower standard escape grow sentimental enjoy well write short character well flesh believable give star understand review write people enjoy base shocking time period several say oh probably boring product time place naturally social more evolve expectation contemporary audience good however recognize set introduce enjoys base style much thoughtful protagonist career compel character complex simplicity generally young woman direct flaw well passion betray truly tricky thing accomplish writer deftly narrative voice intertwines character leave sense really element enough distance accept exactly subjective aside element always treat note literature current pop phenomenon different way shocking time suppress bold feminism suppress even history tell french society shock candor female youth express sexual freedom lay certain credit foot feminist undeniable way help shape society excellent classic somehow never get glad finally evocative certain era way endure well simply interest character depiction main character incisive beautifully draw well subject shift perspective adolescent maturity encounter various challenge intelligence main character never cloy rather deeply interesting course much immense popularity fascination age write main character story give open door certain world certain time certain person readable sensuous evocative", "genres": ["Fiction & Literature"], "summary": "<i><b>Bonjour Tristesse</b></i> (French: \"Hello Sadness\") is a <a title=\"Novel\" href=\"https://en.wikipedia.org/wiki/Novel\">novel</a> by <a title=\"Françoise Sagan\" href=\"https://en.wikipedia.org/wiki/Fran%C3%A7oise_Sagan\">Françoise Sagan</a>. Published in 1954, when the author was only 18, it was an overnight sensation. The title is derived from a poem by <a title=\"Paul Éluard\" href=\"https://en.wikipedia.org/wiki/Paul_%C3%89luard\">Paul Éluard</a>, \"À peine défigurée\", which begins with the lines \"Adieu tristesse/Bonjour tristesse...\" An English-language <a title=\"Bonjour Tristesse (film)\" href=\"https://en.wikipedia.org/wiki/Bonjour_Tristesse_(film)\">film adaptation</a> was released in 1958, directed by <a title=\"Otto Preminger\" href=\"https://en.wikipedia.org/wiki/Otto_Preminger\">Otto Preminger</a>.<sup id=\"cite_ref-1\" class=\"reference\"><a href=\"https://en.wikipedia.org/wiki/Bonjour_Tristesse#cite_note-1\">[1]</a></sup>\r\n\r\nEndearing, self-absorbed, seventeen-year-old Cécile is the very essence of untroubled amorality. Freed from the stifling constraints of boarding school, she joins her father—a handsome, still-young widower with a wandering eye—for a carefree, two-month summer vacation in a beautiful villa on the French Riviera with his latest mistress, Elsa. Cécile cherishes the free-spirited moments she and her father share, while plotting her own sexual adventures with a \"tall and almost beautiful\" law student. But the arrival of her late mother's best friend, Anne, intrudes upon a young girl's pleasures. And when a relationship begins to develop between the adults, Cécile and her lover set in motion a plan to keep them apart...with tragic, unexpected consequences.\r\n\r\nThe internationally beloved story of a precocious teenager's attempts to understand and control the world around her, Françoise Sagan's Bonjour Tristesse is a beautifully composed, wonderfully ambiguous celebration of sexual liberation, at once sympathetic and powerfully unsparing.", "asin": "0061440795", "rank": "108562", "city": "Cannes", "image": "https://images-na.ssl-images-amazon.com/images/I/51uy6gbbkNL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}