{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 525, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Great series of books, somewhere along the way we lost this one 😐"}, {"review_sentiment": 4.0, "review_text": "glad to read it finally."}, {"review_sentiment": 5.0, "review_text": "Armistead maupin has a rare and beautiful gift for creating an entire cast of characters that he allows his audience to know on the most intimate level. This third installment of Maupin's extended love letter to San Francisco is as engaging and hard to put down as the first two.  Highly recommended!!"}, {"review_sentiment": 4.0, "review_text": "I'm blazing through the Tales of the City series. All of the novels so far have been very engrossing--a great escape, if you need one. The plots are soapy, often crazily implausible, but the characters and dialogue are great.Anyway, I am not really here to write a review of the series but rather to complain about the typos in the Kindle edition of Babycakes. The About the Author section says \"Armisteis Maupin the author\"What happened?"}, {"review_sentiment": 5.0, "review_text": "A classic farce of life in San Francisco as America wrestled with new moralities."}, {"review_sentiment": 5.0, "review_text": "This is one of my favorite series of all time! I love all the books and the mini series is Awesome!!"}, {"review_sentiment": 5.0, "review_text": "\"Mary Ann Singleton was twenty-five years old when she saw San Francisco for the first time.\" And so begins our journey into one of the best series ever written."}, {"review_sentiment": 5.0, "review_text": "Looking forward to finishing it so I can start the 4th book in the series"}, {"review_sentiment": 5.0, "review_text": "After seeing the Miniseries on PBS (and buying it later) I became interested in this book, and then when out and got the rest of the series. I don't even like to read, but I just couldn't put this book down. Well worth getting the entire series to see what happens to all of your favorite characters through the times"}, {"review_sentiment": 5.0, "review_text": "My best friend of 34 years gifted me with the original set of six novels in the 90s. I devoured them. I pull them out again every couple of years. Last July, my friend died. I am reading them again to surround myself with familiar characters and wonderful stories. In every way this is a much needed cathartic experience."}]}, "authors": ["Armistead Maupin"], "isbn": "0061358304", "longitude": -122.4192363, "periods": ["1900s"], "title": "Tales of the City: A Novel", "word_cloud": "series somewhere along way lose glad finally maudlin rare beautiful gift create entire cast character allow audience know intimate level third installment extend love letter engage hard put first recommend blaze series novels far engross great escape need plot soapy often crazily implausible character dialogue really review series rather complain typo edition section say author happen classic farce life wrestle new morality favorite series time love mini series year old saw first time begin journey best series ever write look forward finish start series see buying later become interested get rest series even get entire series see happen favorite character time best friend year gift original set novel devour pull couple year last friend die read surround familiar character wonderful story way much need cathartic experience", "genres": ["Fiction & Literature", "LGBT", "Humour"], "summary": "Book 1/9 in the Tales of the City Series\r\n\r\nFor almost four decades Armistead Maupin’s Tales of the City has blazed its own trail through popular culture—from a groundbreaking newspaper serial to a classic novel, to a television event that entranced millions around the world.\r\n\r\nThe first of nine novels about the denizens of the mythic apartment house at 28 Barbary Lane, Tales is both a sparkling comedy of manners and an indelible portrait of an era that changed forever the way we live.", "asin": "0061358304", "rank": "49246", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/516tatkwItL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}