{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 40, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "She was one of a kind."}, {"review_sentiment": 2.0, "review_text": "The play is great but Amazon Kindle cuts of the third act so you have no clue how it ends just when you were getting into it. Very frustrating"}, {"review_sentiment": 4.0, "review_text": "send it to my grandson, fast and in time, Received as described. Absolutely beautiful, elegant product that works wonderfully. My favorite kitchen utensil by far! These are so great!"}, {"review_sentiment": 5.0, "review_text": "Very funny book."}, {"review_sentiment": 5.0, "review_text": "Very funny reading."}, {"review_sentiment": 4.0, "review_text": "A very interesting book.  Ms Hurston came from the poor rural African-American communities in central Florida, moved north and became well educated, studying anthropology with F. Boas, then returned to her native places with the intention of documenting their language and lifestyle.  It's an uncommon situation -- can you be an objective observer and at the same time a member of the community you're studying?  On the one hand you certainly lose objectivity; on the other you know your subject in a way a stranger never could.  The result is a book unique in its genre, and one I personally recommend."}, {"review_sentiment": 5.0, "review_text": "This is a great book. BUT, I would caution anyone buying the audible version to be aware that, close to fifty pages (whole chapters) were skipped in the recording."}, {"review_sentiment": 5.0, "review_text": "Arrived quickly, in good shape."}, {"review_sentiment": 4.0, "review_text": "Zora Neale Hurston was a true American original.  She preserved a time long past we can never recover.  Her work is priceless."}, {"review_sentiment": 4.0, "review_text": "Thought I was buying the book. Disappointed but appreciated the insights offered."}]}, "authors": ["Zora Neale Hurston"], "isbn": "0061350176", "longitude": -90.0701156, "periods": ["1900s"], "title": "Mules and Men", "word_cloud": "kind play great cut third act clue end get very frustrate grandson fast time describe absolutely beautiful elegant product work wonderfully favorite kitchen utensil far great very funny very funny reading interesting come poor rural community central move north become well educate study anthropology return native place intention document language lifestyle uncommon situation objective observer time member community study hand certainly lose objectivity know subject way stranger never result unique genre personally recommend great anyone buy audible version aware close fifty page whole chapter skip record quickly good shape true original preserve time long past never work priceless thought buy appreciate insight offer", "genres": ["Folklore & Mythology"], "summary": "Mules and Men is a treasury of black America's folklore as collected by a famous storyteller and anthropologist who grew up hearing the songs and sermons, sayings and tall tales that have formed an oral history of the South since the time of slavery. \r\n\r\nReturning to her hometown of Eatonville, Florida, to gather material, Zora Neale Hurston recalls \"a hilarious night with a pinch of everything social mixed with the storytelling.\" \r\n\r\nSet intimately within the social context of black life, the stories, \"big old lies,\" songs, Vodou customs, and superstitions recorded in these pages capture the imagination and bring back to life the humor and wisdom that is the unique heritage of African Americans.", "asin": "0061350176", "rank": "78345", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51X%2BjThWvoL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}