{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 8045, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "This is hands down one of the best books I’ve ever read. There are very few books that can make me cry, but this one was no exception. I recommend this book to anyone who wants to learn a little something about life and humanity. I couldn’t put this book down!!!"}, {"review_sentiment": 5.0, "review_text": "Terrific novel. Highly recommended"}, {"review_sentiment": 5.0, "review_text": "One of my favorite books."}, {"review_sentiment": 5.0, "review_text": "Great Book"}, {"review_sentiment": 5.0, "review_text": "Tears, laughter, wisdom, look into your heart - never be the same,  embrace life and love as Enzo! I don’t believe in reincarnation but I do know God works in mysterious and wonderful ways,,,"}, {"review_sentiment": 5.0, "review_text": "Daughter loved this book"}, {"review_sentiment": 5.0, "review_text": "my fav book in the whole world"}, {"review_sentiment": 5.0, "review_text": "Great Book.  Life through the eyes of a dog."}, {"review_sentiment": 5.0, "review_text": "Great book.  Easy read, but not \"Easy as in Dummied Down.\" I was recommended to me. I was reading it on the beach when a woman walked by and said \"great book.\". It is"}, {"review_sentiment": 5.0, "review_text": "I read this entire book this morning and balled my eyes out at the end.  A must read for dog lovers!"}]}, "authors": ["Garth Stein"], "isbn": "0061537969", "longitude": -122.3300624, "periods": ["2000s", "Recent Releases"], "title": "The Art of Racing in the Rain: A Novel", "word_cloud": "hand best ever cry exception recommend anyone want learn little something life humanity put recommend favorite tear laughter wisdom heart never embrace life believe reincarnation know work mysterious wonderful way love fab whole world eye dog recommend read beach woman walk say great entire morning ball eye end dog lover", "genres": ["Fiction & Literature"], "summary": "Enzo knows he is different from other dogs: a philosopher with a nearly human soul (and an obsession with opposable thumbs), he has educated himself by watching television extensively, and by listening very closely to the words of his master, Denny Swift, an up-and-coming race car driver.\r\n\r\nThrough Denny, Enzo has gained tremendous insight into the human condition, and he sees that life, like racing, isn't simply about going fast. Using the techniques needed on the race track, one can successfully navigate all of life's ordeals.\r\n\r\nOn the eve of his death, Enzo takes stock of his life, recalling all that he and his family have been through: the sacrifices Denny has made to succeed professionally; the unexpected loss of Eve, Denny's wife; the three-year battle over their daughter, Zoë, whose maternal grandparents pulled every string to gain custody. In the end, despite what he sees as his own limitations, Enzo comes through heroically to preserve the Swift family, holding in his heart the dream that Denny will become a racing champion with Zoë at his side. Having learned what it takes to be a compassionate and successful person, the wise canine can barely wait until his next lifetime, when he is sure he will return as a man.\r\n\r\nA heart-wrenching but deeply funny and ultimately uplifting story of family, love, loyalty, and hope, The Art of Racing in the Rain is a beautifully crafted and captivating look at the wonders and absurdities of human life . . . as only a dog could tell it.", "asin": "0061537969", "rank": "1744", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/414ef2JUxvL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}