{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 106, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "The real story behind one of my all time favorite movies, \"Chinatown\".  Very readable recounting about a remarkable individual, and an incredibly  challenging civil engineering project, without which Southern California could not have become the dynamic metropolis it is today."}, {"review_sentiment": 5.0, "review_text": "perfect"}, {"review_sentiment": 5.0, "review_text": "I liked this book, and I loved his book 'Last train to paradise'.  Riviting, fast moving and full of historical details. Read it on ebook, think i'll buy itHardback so others can borrow it!"}, {"review_sentiment": 5.0, "review_text": "Excellent book about a giant of a man in early LA, whose work remains supremely important to this day.  Self-taught genius (something not allowed, almost not politically correct these days - no diploma in..... whatever?  Horrors!), resourceful and clever, he persisted against all odds by being so persuasive that most who worked with (or against) him thought they were getting the last word.  Terrific read, educational without being preachy."}, {"review_sentiment": 4.0, "review_text": "This story, featured in the movie Chinatown, has always fascinated me. It could have happened no where else but California and particularly in Los Angeles. No wonder it was made into a film. No more daring plot could be hatched up in a writer's mind."}, {"review_sentiment": 5.0, "review_text": "Well done! Great history lesson, particularly the contemporary personalities."}, {"review_sentiment": 1.0, "review_text": "Bought the audible version of this book for my kids after searching for educational books on California History for kids. Not more then 5 minutes in and  the term son of a B was used twice. How can I feel safe letting them proceed to listen if this is the into? Bases on this I do not feel this book is geared twords kids. Too bad because I love the idea of learning this part of Los Angeles' history. I'll update after I find the time to screen/listen."}, {"review_sentiment": 5.0, "review_text": "Very well written histography."}, {"review_sentiment": 5.0, "review_text": "Fascinating account of both the man and how the history of LA's growth was linked to water."}, {"review_sentiment": 5.0, "review_text": "This is a fascinating true story about the Irish immigrant who engineered the aqueduct to supply water to Los Angeles. Loved it!"}]}, "authors": ["Les Standiford"], "isbn": "0062251457", "longitude": -118.244476, "periods": ["1900s", "Recent Releases"], "title": "Water to the Angels: William Mulholland, His Monumental Aqueduct, and the Rise of Los Angeles", "word_cloud": "real story time favorite movie readable recounting remarkable individual incredibly challenge civil engineering project dynamic metropolis today perfect like love train paradise fast move full historical detail read book think it hardback others borrow excellent giant man early work remain supremely important day genius something allow almost politically correct day diploma resourceful clever persist odds persuasive work think get last word educational preachy story feature movie always fascinate happen else particularly wonder make film daring plot writer mind well do history lesson particularly contemporary personality audible version kid search educational kid not minute term son use twice feel safe let proceed listen feel geared word kid bad love idea learn part history update find time very well write histography fascinate account man history growth link fascinating true story immigrant engineer aqueduct supply", "genres": ["Biography", "Business & Finance", "Art & Architecture", "History"], "summary": "The author of Last Train to Paradise tells the story of the largest public water project ever created—William Mulholland’s Los Angeles aqueduct—a story of Gilded Age ambition, hubris, greed, and one determined man who's vision shaped the future and continues to impact us today.\r\n\r\nIn 1907, Irish immigrant William Mulholland conceived and built one of the greatest civil engineering feats in history: the aqueduct that carried water 223 miles from the Sierra Nevada mountains to Los Angeles—allowing this small, resource-challenged desert city to grow into a modern global metropolis. Drawing on new research, Les Standiford vividly captures the larger-then-life engineer and the breathtaking scope of his six-year, $23 million project that would transform a region, a state, and a nation at the dawn of its greatest century.\r\n\r\nWith energy and colorful detail, Water to the Angels brings to life the personalities, politics, and power—including bribery, deception, force, and bicoastal financial warfare—behind this dramatic event. At a time when the importance of water is being recognized as never before—considered by many experts to be the essential resource of the twenty-first century—Water to the Angels brings into focus the vigor of a fabled era, the might of a larger than life individual, and the scale of a priceless construction project, and sheds critical light on a past that offers insights for our future.\r\n\r\nWater to the Angels includes 8 pages of photographs.", "asin": "0062251457", "rank": "166979", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/61PBZvukvVL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}