{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 35.7032751, "ratings": {"num_ratings": 291, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Still crazy-sophisticated after all these years... a perfect antidote to all the crazy-banality of our current times."}, {"review_sentiment": 2.0, "review_text": "Actually, the movie was much better."}, {"review_sentiment": 2.0, "review_text": "The Sheltering Sky chronicles a trip into the Sahara by three individuals apparently born of sufficient privilege not to be concerned about matters of money, although this is never explained.  They wander from place to place for no apparent reason other than the wish not to be where they are, and engage in behavior motivated more by almost terminal boredom than by any sense of adventure or intellectual interest.  At the conclusion of the story, there is a long bio of the author, himself an immense talent in a variety of mediums, who appears never to have settled on one.  The reader is left with the impression the novel is a largely autobiographical account of a forerunner of the current generation of Millennials."}, {"review_sentiment": 5.0, "review_text": "Enjoyed this book, did not know the author, turns out it is a famous and great novel."}, {"review_sentiment": 5.0, "review_text": "I read this while visiting Morocco last July. A great read. So well written and engaging. The book really flows. I will read more of his work!"}, {"review_sentiment": 3.0, "review_text": "Great writing, but the story is pretty much a downer."}, {"review_sentiment": 1.0, "review_text": "One of the WORST boos I have ever read...threw it out in the middle...no plot..just aimless wandering through arid, fly-infested lands...hero dies of disease and woman gets lost in world of being abused by men...exitstential crap...at least Sartre did it with some feeling. More lie a terrible photograph of a land, but made by emotionless, vapid, one-dimensional characters. GARBAGE, full of itself, saying NOTHING."}, {"review_sentiment": 5.0, "review_text": "Beautiful book."}, {"review_sentiment": 1.0, "review_text": "Waste of time."}, {"review_sentiment": 3.0, "review_text": "I haven't read it yet, but it was recommended highly by someone whose judgement I trust."}]}, "authors": ["Paul Bowles"], "isbn": "0062351486", "longitude": -0.6492976, "periods": ["1900s"], "title": "Sheltering Sky", "word_cloud": "still year perfect antidote current time actually movie much better chronicle trip individual apparently bear sufficient privilege concern matter money never explain wander place place apparent reason wish engage behavior motivate almost terminal boredom sense adventure intellectual interest conclusion story long bio author immense talent variety medium appear never settle left impression largely autobiographical account forerunner current generation millennial enjoy know author turn famous great visit last great well write engage really flow work write story pretty much downer boo ever throw middle aimless wander arid land hero die disease woman get lose world abuse men existential crap least feel more lie terrible photograph land make emotionless vapid character full say nothing beautiful waste time yet recommend highly someone judgment trust", "genres": ["Fiction & Literature"], "summary": "The Sheltering Sky is a landmark of twentieth-century literature. In this intensely fascinating story, Paul Bowles examines the ways in which Americans' incomprehension of alien cultures leads to the ultimate destruction of those cultures.\r\n\r\nA story about three American travelers adrift in the cities and deserts of North Africa after World War II, The Sheltering Sky explores the limits of humanity when it touches the unfathomable emptiness and impassive cruelty of the desert.\r\n\r\n\"It stands head and shoulders above most other novels published in English since World War II.\" The New Republic", "asin": "0062351486", "rank": "82494", "city": "Oran", "image": "https://images-na.ssl-images-amazon.com/images/I/517fpwSWD3L.jpg", "country": "Algeria", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}