{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 491, "rating": 4.4, "reviews": [{"review_sentiment": 2.0, "review_text": "While the book seems to be well-written and is easy to read, it discusses and spins historical events in a context and manner that is blatantly biased in favor of the author’s ethnic group. This significantly reduces its value as a work of history.In 1918 the victors of WW1 decided that the multi-ethnicity of Austria-Hungary was a “problem” that needed to be resolved by granting “self-determination” to the country’s minorities. What most historians have failed to explain is how the creation of a miniature version of the old Austria-Hungary in the form of a new “Czecho-Slovakia” could possibly have been seen as part of a reasonable solution to this “problem”. Albright’s book also ignores this question.The creation of the new “Czecho-Slovakia” was promoted by a handful of Czech nationalists, in large part through subterfuge and fraud, to the post-WW1 power brokers (France, Britain and the U.S.) who were more than willing to listen to, and sanction, any scheme that would suit their goal of limiting German influence in Europe. It did not seem to matter that the case of “Czecho-Slovakia” would have no effect on Germany itself, but rather only serve to compromise the ethnic German minority of the former Hapsburg empire. It did not seem to matter that it expressly contradicted the principle of “self-determination”. It did not seem to matter that it effectively promoted and supported pan-Slavism, which had contributed much more to the outbreak of WW1 than did pan-Germanism.It is fundamentally significant that the new country was specifically named after its largest (Czech) and third-largest (Slovak) minorities, thereby expressly excluding the second-largest minority (German) from its identity. The country’s revered “founder” Masaryk even referred to this German minority as “colonists”, despite the fact that they had lived on the land as long as the others. In late 1918, long before the decisions of the (1919) “Peace Conference” were made final, Czech militia occupied the German-speaking areas at gun-point to create “facts on the ground”. Peaceful protests were suppressed violently, resulting in dead and wounded. The “Revolutionary National Assembly”, consisting primarily of Czechs and a few Slovaks (German and other minorities were not represented) and lacking any democratic legitimacy, then passed a number of drastic laws that bore heavily on the German-speaking and other non-Czech minorities. It also enacted a constitution which was never subjected to referendum. So, despite the prevailing myth of the country having been a “model democracy”, it had anything but a democratic foundation – and in its 20-year existence the government showed less intent to accept and treat its minorities as unqualified equals than did the former Austria-Hungary.Albright wants us to believe the Prague “uprising” of May 5, 1945 was a justified spontaneous act by the citizens. It was, in fact, a completely unnecessary event instigated by communists for the sole purpose of creating a crisis that would ensure that the American army kept its distance so that Prague would be “liberated” by the Soviets. The Wehrmacht was actually bypassing Prague in its retreat to the west and was in the process of evacuating those of its elements still in the city. The uprising forced it to turn to rescue its rearguard and protect German civilians who were being attacked and murdered in the streets. The resulting destruction and deaths on both sides was therefore the fault of the Czechs, and not yet another desperate German transgression.Probably the most suppressed event in Czech history is the 1945-1946 ethnic cleansing of the indigenous German-speakers of Bohemia and Moravia and the Hungarian-speakers of Slovakia. Albright is to be commended for mentioning it at all, although she should be censured for attempting to minimize it by conspicuously using euphemisms like “banish”, “evict”, “remove”, “expel” and “transfer” in place of the rather more honest, but damning, term “ethnic cleansing”. In rather disingenuous fashion she claims to have “sharply condemned the ethnic cleansing in Central Africa and the Balkans …” while she was in public office, but then implies her support for the 1945-1946 ethnic cleansing because her “parents – whose values I inherited – supported the expulsion policy”. She further suggests that the act “could at least be defended on the basis of extreme circumstances”, that it could be understood as retribution for Nazi atrocities against Czechs during the war. However that doesn’t square with her own reporting that Benes started to “sell” the idea of expulsion to the Allies in 1940, long before the effects of the war were felt by the population. In fact, Benes in his post-war autobiography claimed \"It was clear to me immediately after Munich [1938] that when the annulment of Munich ... came in question in the future ... the problem of our Germans would also have to be solved radically and finally.\"Albright also wants to credit Benes for stopping the initial “wild expulsions”. Not true. They were halted as a result of pressure brought to bear by the US and Britain at Potsdam. The “wild expulsions” were orchestrated by the Czech government in exile and sanctioned accordingly. In fact, one of Albright’s heroes Hubert Ripka, complained in July 1945 that the measures used until then had not been severe enough. In his own words: \"We were too slow and too considerate with the Germans. The people failed to carry out the government's plan during the first two months after liberation.\"Enough said."}, {"review_sentiment": 4.0, "review_text": "A well written account of the author's childhood years, first in Prague, then in England during the years during and after WWII, 1937-1948. Besides being a personal memoir, the book delves fairly deeply into the history of the Czech and Slovak regions that actually became the country of Czechoslovakia after the first world war. A very worthwhile read for anyone interested in history who feels a gap in their knowledge in this area. The situation in Czechoslovakia after the end of WWII is more complex and interesting than one who lived through that time in the US might imagine. Because much of this history, especially that during the second world war, is quite tragic, indeed horrifying, one is left with strong feelings of the \"tragic sense of life\" and a diminished complacency that the world can do much better in the future."}, {"review_sentiment": 5.0, "review_text": "Excellent read before we went to Prague. Recommend it!"}, {"review_sentiment": 5.0, "review_text": "This is a combined history/memoir that was inspired by the discovery of Madeleine Albright’s Jewish heritage during the vetting process for becoming Secretary of State. She deftly weaves information about her parents and family into the historical events in Czechoslovakia prior to and during World War II through 1948. Her parents were intimately involved with the government in exile and she uses her family’s experiences to give a personal touch to a harrowing time, including the post-war period. The book contains personal and historical photographs that point out some of the most poignant times of the war, some of them heartbreaking. A pair of pictures of a cousin show the pre and post concentration camp images of a young girl and brings a personal touch to the horrors of war. The author adds her unique perspective from her government service and historical research."}, {"review_sentiment": 5.0, "review_text": "Very informative. Very long."}, {"review_sentiment": 5.0, "review_text": "Great read; highly recommend."}, {"review_sentiment": 5.0, "review_text": "The content was not only an insight into history, but written in a very personal conversational way.  I loved seeing the pictures in the paper form.  The one I got was personally autographed1"}, {"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 5.0, "review_text": "Loved her writing style."}, {"review_sentiment": 5.0, "review_text": "I liked the book because it was truth that happened to a country told by a woman that grew up in the check republic and the historical facts that happened before and during world war 11 and after world war 11. We should always learn from  history and not repeat the problems. The book was informative and full of history."}]}, "authors": ["Madeleine Albright"], "isbn": "0062030345", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Prague Winter: A Personal Story of Remembrance and War, 1937-1948", "word_cloud": "seem easy discus spin historical event context manner blatantly bias favor author ethnic group significantly reduce value work victor decide problem need resolve grant country minority historians fail explain creation miniature version old form new possibly see part reasonable solution problem also ignore creation new promote handful nationalist large part subterfuge fraud power broker willing listen sanction scheme goal limit german influence seem matter case effect rather serve ethnic german minority former empire seem matter expressly contradict principle seem matter effectively promote support contributed much fundamentally significant new country specifically name largest minority thereby expressly exclude minority german identity country revere founder even refer german minority colonists fact live land long others late long decision make final militia occupy area create fact ground protest suppress violently result dead wound consist primarily german minority represent lack democratic legitimacy pass number drastic law bore heavily minority also enact constitution never subject referendum prevail myth country model democracy anything democratic foundation existence government show le intent accept treat minority unqualified equal former want believe uprising justify spontaneous act citizens fact completely unnecessary event instigated communist sole purpose create crisis american army keep distance liberate actually bypass retreat west process evacuate element still city uprising force turn rescue rearguard protect german civilian attack murdered street result destruction death side therefore fault yet desperate suppress event history ethnic cleanse indigenous commend mention censure attempt minimize conspicuously use euphemism banish evict expel transfer place rather honest damn term ethnic cleansing rather disingenuous fashion claim sharply condemn ethnic cleanse public office implies support ethnic cleansing parent value inherit supported expulsion policy suggest act defended basis extreme circumstance retribution atrocities war however square report start sell idea expulsion ally long effect war felt population fact autobiography claim clear immediately annulment come question future problem also radically finally also want credit benet stop initial wild expulsion not true halt result pressure bring bear wild expulsion orchestrate czech government exile sanction accordingly fact hero complain measure use severe enough word slow considerate people fail carry government plan first month liberation say well write account author childhood year first year memoir delve fairly deeply history region actually become country first world war worthwhile anyone interested history feel gap area situation end complex interest live time much history especially second world war quite tragic indeed horrify leave strong feeling tragic sense life diminish complacency world much better future excellent go combine inspired discovery heritage vet process become deftly weave information parent family historical event prior parent intimately involved government exile use family experience give touch harrowing time include period contains historical photograph point poignant time war heartbreaking pair picture cousin show per post concentration camp image young girl bring touch horror war author add unique perspective government service historical research very informative long highly recommend content insight history write conversational way love see picture paper form one get personally great love writing style like truth happen country tell woman grow republic historical fact happen world war world war always learn history repeat problem informative full history", "genres": ["Memoir", "History", "WWII"], "summary": "“A remarkable story of adventure and passion, tragedy and courage set against the backdrop of occupied Czechoslovakia and World War II.” —Václav Havel\r\n\r\nFrom former Secretary of State Madeleine Albright comes a moving and thoughtful memoir of her formative years in Czechoslovakia during the tumult of Nazi occupation, World War II, fascism, and the onset of the Cold War. An intensely personal journey into the past that offers vital lessons for the future, Prague Winter combines the intimacy of an autobiography with the drama of an exciting and well-told story—all underpinned by the gravity and intelligence of a serious work of history. \r\n\r\nThe result is a highly readable and incisive work filled with tragedy and triumph, a resonant narrative informed by Albright’s remarkable life experience and her characteristic candor in speaking hard truths.\r\n\r\n“A compelling personal exploration of [Albright’s] family’s Jewish roots as well as an excellent history of Czechoslovakia from 1937 to 1948. . . . Highly informative and insightful. . . . I can’t recommend Prague Winter highly enough.” The Washington Post \r\n\r\n", "asin": "0062030345", "rank": "64004", "city": "", "image": "https://images-na.ssl-images-amazon.com/images/I/51N1H6wpANL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}