{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 255, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Great novel with a steady rhythm and a really good writing, a good development of the main character, but also the secondary actors, I really like the detail and closeness to the personality of the main actors, good and bad.I discover the novels after finishing the Justified television series, and was greatly pleased when I find various of the main situations in the best episodes in the series in their original form as parts of the book (and in the second one, which I'm reading now).I strongly recommend this book."}, {"review_sentiment": 1.0, "review_text": "The spine on this book was detached from the cover."}, {"review_sentiment": 5.0, "review_text": "Good read"}, {"review_sentiment": 4.0, "review_text": "Very good"}, {"review_sentiment": 5.0, "review_text": "Great series."}, {"review_sentiment": 3.0, "review_text": "Good book."}, {"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 1.0, "review_text": "The TV show made from it was much better than the book as far as adventure and suspense."}, {"review_sentiment": 4.0, "review_text": "4 1/2 Stars"}, {"review_sentiment": 5.0, "review_text": "Great"}]}, "authors": ["Elmore Leonard"], "isbn": "0062120336", "longitude": -80.1936589, "periods": ["1900s"], "title": "Pronto", "word_cloud": "steady rhythm really good write good development main character also secondary actor really detail closeness personality main actor good discover novel finish television series greatly pleased find various main situation best episode series original form part second read strongly spine detach cover good very good series good great tv show make much better far adventure suspense star great", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 1/4 in Raylan Givens\r\n\r\nHarry Arno was grossing six to seven thousand dollars a week running a South Miami Beach gambling operation. To protect his position, he was forced to cut a deal with the local muscle, Jimmy Capotorto (Jimmy Cap to the likes of Harry), an even fifty-fifty split. For years Harry had been padding his own stake by skimming a grand a week off the top. A couple of local detectives wise to sticky fingers try to bag Jimmy the Cap by putting the squeeze on Harry. Now, the dicks suggest, would be a good time for Harry to rat the mobster out.\r\n\r\nU.S. Marshall Raylan Givens has his own agenda. He has to deliver Harry to a Federal grand jury to testify at Jimmy's drug-running trial. Even though he's a step slower that he used to be, Harry's no fool. When Jimmy Cap's men are a hair too slow gunning him down and Raylan's surveillance slips, Harry's already two steps ahead of them. Years of preparation pay off and Harry slips out of the country pronto. Being on the lam is no time to get soft, but Harry didn't plan on missing his companion Joyce so much. Sneaking her to his hideout could save him from loneliness but Joyce's quick departure tips off his trackers. Jimmy Cap's men follow Joyce while Raylan stays close behind. The three sides end up in Rapallo, Italy, watching their own backs while keeping abreast of Harry's. But it's not until the chase leads back to Miami that the real winners and losers are revealed. Pronto is classic Elmore Leonard\r\n\r\n“Speedy, exhilarating, and smooth. Nobody does it better.”\r\n—Washington Post\r\n\r\n“The man knows how to grab you—and Pronto is one of the best grabbers in years.”\r\n—Entertainment Weekly", "asin": "0062120336", "rank": "41336", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51S%2BflhVWhL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}