{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 1146, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "The plot moves along at a nice pace throwing twists and turns. I found myself unable to put the book down and wanting more at the end."}, {"review_sentiment": 5.0, "review_text": "Jessie Burton has written a historical masterpiece, a feast for an international audience ravenous of excellent writing and storytelling.  This work has left me with a glorious book hangover."}, {"review_sentiment": 5.0, "review_text": "An impressive first novel by Ms. Burton, The Miniaturist is an interesting tale with several unexpected twists & turns.  It took me a little while to get into the rhythm of the story, mostly due to the prologue, which I found to be unnecessary & confusing.  But after wading through the prologue and 1st chapter, the characters were properly introduced and the story started to flow.  I enjoy historical fiction and the description of life in Amsterdam during the late 1600's  was fascinating.  Despite struggling at the beginning of this book, the rest of the story was so good that I would not hesitate to recommend it."}, {"review_sentiment": 5.0, "review_text": "Loved it."}, {"review_sentiment": 5.0, "review_text": "This will be a great book for discussion at my Queen Bees' book club. The Miniaturist is really well written and is truly a window into the daily life and struggles of a 15th century Dutch merchant and his family. Nella the protagonist peers into her miniature doll house catching glimpses of her future; on a parallel track, the  reader is drawn into the novel for an exploration of the deepest aspects of human nature - pride, anger, sloth, envy, greed, lust and ultimately love.  The story is a timeless mirror of ourselves that is quite relevant today."}, {"review_sentiment": 4.0, "review_text": "I found the historical aspects of the book interesting."}, {"review_sentiment": 3.0, "review_text": "Got through it. Not my favorite ... but readable."}, {"review_sentiment": 5.0, "review_text": "Excellent read"}, {"review_sentiment": 2.0, "review_text": "The novel panders to the current popularity of heroic women and disposable men, and the magic never develops into a motive forcé.  I am a retired physician but I was appalled by the detailed and accurate descriptions of very unpleasant events and, to tell the truth, I'm sorry I read this booik."}, {"review_sentiment": 2.0, "review_text": "I’m just not smart enough for this book. Lots of symbolism, etc. did hold my Interest enough to finish the book."}]}, "authors": ["Jessie Burton"], "isbn": "0062306847", "longitude": 4.8936041, "periods": ["1600s"], "title": "The Miniaturist", "word_cloud": "plot move nice pace throw twist turn find unable put want end write historical masterpiece feast international audience ravenous excellent write storytelling work leave glorious hangover impressive first interesting tale several unexpected twist turn take little get rhythm story mostly due prologue find unnecessary confusing wad prologue chapter character properly introduce story start flow enjoy historical fiction description life late fascinate struggle begin rest story good love great discussion club really well write truly window daily life struggle century merchant family protagonist peer miniature doll house catch glimpse future parallel track drawn exploration deepest aspects human nature pride anger envy greed lust ultimately story timeless mirror quite relevant today find historical aspect interest not favorite readable excellent pander current popularity heroic woman disposable men magic never develop motive force retire physician appal detailed accurate description unpleasant event tell truth sorry book smart enough symbolism etc hold enough finish", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Set in seventeenth century Amsterdam—a city ruled by glittering wealth and oppressive religion—a masterful debut steeped in atmosphere and shimmering with mystery, in the tradition of Emma Donoghue, Sarah Waters, and Sarah Dunant.\r\n\r\n”There is nothing hidden that will not be revealed . . .“\r\n\r\nOn a brisk autumn day in 1686, eighteen-year-old Nella Oortman arrives in Amsterdam to begin a new life as the wife of illustrious merchant trader Johannes Brandt. But her new home, while splendorous, is not welcoming. Johannes is kind yet distant, always locked in his study or at his warehouse office—leaving Nella alone with his sister, the sharp-tongued and forbidding Marin.\r\n\r\nBut Nella’s world changes when Johannes presents her with an extraordinary wedding gift: a cabinet-sized replica of their home. To furnish her gift, Nella engages the services of a miniaturist—an elusive and enigmatic artist whose tiny creations mirror their real-life counterparts in eerie and unexpected ways . . .\r\n\r\nJohannes’ gift helps Nella to pierce the closed world of the Brandt household. But as she uncovers its unusual secrets, she begins to understand—and fear—the escalating dangers that await them all. In this repressively pious society where gold is worshipped second only to God, to be different is a threat to the moral fabric of society, and not even a man as rich as Johannes is safe. Only one person seems to see the fate that awaits them. Is the miniaturist the key to their salvation . . . or the architect of their destruction?\r\n\r\nEnchanting, beautiful, and exquisitely suspenseful, The Miniaturist is a magnificent story of love and obsession, betrayal and retribution, appearance and truth.", "asin": "0062306847", "rank": "31257", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/512eQCl4GwL.jpg", "country": "The Netherlands", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}