{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 67, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Written with a painful honesty that is nakedly intense, Baby's story is told using imagery that is so visceral it is difficult to believe this is a work of fiction. While too many children do grow up in such stark and horrible conditions (and worse) I was somewhat relieved to find that Baby's life"}, {"review_sentiment": 5.0, "review_text": "One got the feeling that the author personally suffered the trauma of this story. Reading it caused pain as  Baby goes from one tragic event to the next one. The plight of homeless helpless children is heartbreaking ."}, {"review_sentiment": 4.0, "review_text": "This wasn't my favorite book, but for what it was, it was well written. The cover is oddly deceiving, as this is not a story any child should read. It's a hauntingly sad tale of a little girl's life on the streets, always moving from one nasty hole in the wall to another with her young and moody heroin addict father she calls by his first name. The author did an excellent job of conveying the little girl's odd and interesting inner thoughts and dialogue."}, {"review_sentiment": 4.0, "review_text": "An often dark and somewhat disturbing account of a child living through a terrible childhood. Fortunately, our heroine is bright and finds her way out. But many readers may find it hard to handle what happens during her first 12 years.."}, {"review_sentiment": 5.0, "review_text": "This book was so real it made my stomach clench at one point, and do something entirely foreign to me.  Cheat and peak at the end to be sure I could stand to finish, no matter how fine the writing. It was entirely worth it! I look forward to reading more by this author."}, {"review_sentiment": 5.0, "review_text": "Loved it!"}, {"review_sentiment": 4.0, "review_text": "I thought this would be a comedy. Sorta shallow & glamouring drugs. Bought it on sale. I was wrong!!!! It has heart & depth. The writer treats her subjects w empathy & compassion. We're able to see the heart break coming but unable to warn  her observations on childhood are right on & help us understand!  I want to read more of her stories immediately"}, {"review_sentiment": 4.0, "review_text": "Fascinating view of a child in a world that is common but completely unknown to most of us."}, {"review_sentiment": 4.0, "review_text": "Lullabies for Little Criminals, is an excellent read and a masterfully told story. Lullabies is about the troubled lives of young children under the aegis of their troubled parents. The story is sometimes told from inside the homes, sometimes from the streets, or sometimes within the system. Heather O’Neill really opens the reader’s eyes into the world of these troubled youth who might be considered “little criminals” by some. The story is more than entertaining, it is emotional, thoughtful, and well worth the time to read it. -- Sean Michael"}, {"review_sentiment": 4.0, "review_text": "It's well written (although it has way too many similes). It's a hard topic to read about."}]}, "authors": ["Heather O'Neill"], "isbn": "0062468472", "longitude": -73.6103642, "periods": ["2000s", "Recent Releases"], "title": "Lullabies for Little Criminals: A Novel", "word_cloud": "painful honesty nakedly intense story tell use imagery visceral difficult believe work fiction many child grow stark horrible condition worse somewhat relieve life get feel author personally suffer trauma story cause pain go tragic event plight homeless helpless child heartbreaking favorite well write cover oddly deceiving story child hauntingly sad tale girl life street always move nasty hole wall young moody father call first author excellent job convey girl interest inner thought dialogue often dark somewhat disturb account child live terrible childhood fortunately heroine bright find way many reader hard handle happen first real make stomach clench point something entirely foreign peak end sure finish matter fine write entirely look forward read author love think shallow glamouring drug sale wrong heart depth writer treat subject empathy compassion able see heart break come unable warn observation childhood right want story immediately fascinate view child world common completely unknown excellent masterfully told story trouble life young child aegis troubled parent story sometimes tell inside home sometimes street sometimes system really open eye world trouble youth consider criminal story entertain emotional thoughtful well worth time sean well write way many simile hard topic", "genres": ["Fiction & Literature"], "summary": "A new deluxe edition of the international bestseller by Heather O’Neill, the Giller-shortlisted author of Daydreams of Angels and The Girl Who Was Saturday Night, featuring an original foreword from the author, to celebrate the tenth anniversary of the coming-of-age story that People describes as “a vivid portrait of life on skid row.”\r\n\r\nBaby, all of thirteen years old, is lost in the gangly, coltish moment between childhood and the strange pulls and temptations of the adult world. Her mother is dead; her father, Jules, is scarcely more than a child himself and is always on the lookout for his next score. Baby knows that “chocolate milk” is Jules’ slang for heroin and sees a lot more of that in her house than the real article. But she takes vivid delight in the scrappy bits of happiness and beauty that find their way to her, and moves through the threat of the streets as if she’s been choreographed in a dance.\r\n\r\nSoon, though, a hazard emerges that is bigger than even her hard-won survival skills can handle. Alphonse, the local pimp, has his eye on her for his new girl; he wants her body and soul—and what the johns don’t take he covets for himself. At the same time, a tender and naively passionate friendship unfolds with a boy from her class at school, who has no notion of the dark claims on her—which even her father, lost on the nod, cannot totally ignore. Jules consigns her to a stint in juvie hall, and for the moment this perceived betrayal preserves Baby from terrible harm—but after that, her salvation has to be her own invention.\r\n\r\nChanneling the artlessly affecting voice of her thirteen-year-old heroine with extraordinary accuracy and power, Heather O’Neill’s heartbreaking and wholly original debut novel blew readers away when it was first published ten years ago.  Now in a new deluxe package it is sure to capture its next decade of readers as Baby picks her pathway along the edge of the abyss to arrive at a place of redemption, and of love.", "asin": "0062468472", "rank": "730721", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/41jmN6wAEJL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}