{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 2806, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "This is not a novel about the Vietnam war and draft dodging. This is about the friendship and love between two boyhood friends and the effect the war had on them. The character of Owen Meany is so wonderfully weird. Is he a miracle? The Messiah? I know what I think. His best friend Johnny has his own issues to deal with, and his dependence on Owen, and his need for Owen in his life raises many questions. Joe Barrett does an impressive job with narrating Owen's voice, which is so quintessentially the essence of the book. I really enjoyed listening to A Prayer for Owen Meany, it's a novel written for audio. This is a 5 star, highly recommended story. Fabulous all round"}, {"review_sentiment": 1.0, "review_text": "Never have I wished to be a quitter before this book. It was exorbitantly long and j was told the ending was completely worth it. I would beg to differ. Don't waste your time."}, {"review_sentiment": 5.0, "review_text": "One of the few books that I frequently think about, even a long time after the first reading. Well worth the time spent reading this. The characters are fantastic and believable."}, {"review_sentiment": 4.0, "review_text": "Very good book.  well written. held my attention."}, {"review_sentiment": 5.0, "review_text": "Mind broadening and thought provoking"}, {"review_sentiment": 2.0, "review_text": "I wanted to love it...took it on SEVERAL TRIPS....usually I power through books!  This one...was tedious.  I loved the characters but there was just way too much of the narrator's off-story journalism going on.  Also the big reveal was...almost anti-climatic...*who's your daddy?  I would have liked to have heard a lot more about that.  I found myself scanning a lot to get TO THE STORY.  Also...had a hard time reading the longer ALL CAPS PARAGRAPHS.  It helped to visualize Owen because we watch Brick Heck in The Middle.  I finally finished after scanning through the last hard parts..the language started to bother me and get on my nerves.  I loved the friendship between the two main characters, Dan and the grandmother."}, {"review_sentiment": 4.0, "review_text": "The descriptions are excellent and the narrative flawless. Sometimes you'll wonder where the plot is going but it all comes together in a spellbinding conclusion."}, {"review_sentiment": 4.0, "review_text": "The premise of this book is that there are things in this world that we don't have to understand, we have to have faith. That is what Owen Meant have to John Wheelwright... Faith."}, {"review_sentiment": 4.0, "review_text": "A very thought-provoking read.  I would have given 5 stars - four only because of the wordiness and length of the book - but I suppose you could say that it took that may pages to get the story told.  NOT a novel for below high school level (nature of the story, language and some of the sexual explicitness). I was also a bit turned off by the political overtones of the protagonist as inflicted by the author - but I skimmed through it when he got off on one of those tangents. Recommend."}, {"review_sentiment": 4.0, "review_text": "I almost gave up on this book a few times. It takes a long time for the author to get to his point and there were a lot of details that seemed really irrelevant. I stuck with it though because the reviews were so good and I could tell it was (slowly) leading up to something and I’m really glad I did! The ending was something else and now part of me wants to go back and read it again!"}]}, "authors": ["John Irving"], "isbn": "0062204092", "longitude": -79.387207, "periods": ["1900s"], "title": "A Prayer for Owen Meany: A Novel", "word_cloud": "war draft dodge friendship love boyhood friend effect war character wonderfully be know think best friend issue dependence need life raise many question impressive job narrate voice quintessentially essence really enjoy listen write audio star highly recommend story round never wish quitter exorbitantly long j tell end completely worth waste time frequently think even long time first reading time spent read character fantastic believable very good well write hold attention broaden think provoke want love take power tedious love character way much narrator journalism go also big reveal almost daddy heard lot find scan lot also hard time read longer help watch finally finish scan last hard language start bother get nerve love friendship main character grandmother description excellent narrative flawless sometimes plot go come together spellbinding conclusion premise thing world understand faith give star wordiness length suppose take story tell high school level nature story language sexual explicitness also bite turned political overtone protagonist inflict author skim get tangent almost give time take long time author point lot detail seem really irrelevant stick review good slowly leading something really glad end something else part want back", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "I am doomed to remember a boy with a wrecked voice—not because of his voice, or because he was the smallest person I ever knew, or even because he was the instrument of my mother's death, but because he is the reason I believe in God; I am a Christian because of Owen Meany.\r\nIn the summer of 1953, two eleven-year-old boys—best friends—are playing in a Little League baseball game in Gravesend, New Hampshire. One of the boys hits a foul ball that kills the other boy's mother. The boy who hits the ball doesn't believe in accidents; Owen Meany believes he is God's instrument. What happens to Owen after that 1953 foul ball is extraordinary.", "asin": "0062204092", "rank": "10330", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51mDZGVL5SL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}