{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 301, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "A classic mystery!"}, {"review_sentiment": 5.0, "review_text": "For me...a little known mystery book. I love the writings of Ms. Christie...I somehow missed this one. Really a well turned out mystery. Can't wait for the movie...I think you'll enjoy."}, {"review_sentiment": 5.0, "review_text": "While I was reading this, I found out they made a movie for this. Really looking forward to it. It's releasing on Dec. 22."}, {"review_sentiment": 5.0, "review_text": "And considering how enjoyable even her not so great writing is, that's high praise.  Well drawn characters and a clever plot.  Generally I dislike mysteries that are solved with a confession but this one works because, like the main character, you wonder how you missed all the clues."}, {"review_sentiment": 2.0, "review_text": "Book not as described.  It is full of highlights and ink marks which I find very distracting and not enjoyable to read.  If this had been mentioned in the description I would not have purchased it."}, {"review_sentiment": 4.0, "review_text": "I love Agatha Christie!!"}, {"review_sentiment": 2.0, "review_text": "I know she's the queen of suspense or something, but I find so many of her novels are predictable.  I read this as I saw it's due to be a movie very soon.  Thought it could be fun to read the book in advance.  Didn't quite enjoy it though.  Much too predictable.  (I apologize in advance to all of the Christie lovers out there . . . I concede she's a great author . . . I just didn't particularly like the story)."}, {"review_sentiment": 5.0, "review_text": "Comfortable Agatha with a great surprise ending."}, {"review_sentiment": 5.0, "review_text": "Never read this one before - I'm a Christie fan from way back"}, {"review_sentiment": 4.0, "review_text": "I love most, if not all, of Agatha Christies books but this one didn't live up to the hype. Its a good story but from what I heard I thought it was going to be amazing."}]}, "authors": ["Agatha Christie"], "isbn": "0062073532", "longitude": -0.12574, "periods": ["1900s"], "title": "Crooked House", "word_cloud": "classic mystery little known mystery love writing somehow missed really well turned mystery wait movie think read find make movie look forward release consider enjoyable even great write high praise draw character clever plot dislike mystery solve confession work main character wonder miss clue describe full highlight ink mark find distract enjoyable mention description purchase love know queen suspense something find many novel predictable saw due movie soon advance quite much predictable apologize advance lover concede great author particularly story comfortable great surprise end never fan way back love live hype good story hear think go amaze", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Three generations of the Leonides family live together under wealthy patriarch Aristide. His first wife died; her sister Edith has cared for the household since then. His second wife is the indolent Brenda, decades his junior, suspected of having a clandestine love affair with the grandchildren's tutor. \r\n\r\nAfter Aristide is poisoned by his own eye medicine (eserine), his granddaughter Sophia tells narrator and fiancé Charles Hayward that they cannot marry until the killer is apprehended. \r\n\r\nCharles' father, \"The Old Man\", is the Assistant Commissioner of Scotland Yard, so Charles investigates from the inside along with assigned detective, Chief Inspector Taverner.", "asin": "0062073532", "rank": "9957", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51jEX-W7DAL.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}