{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 54, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "I was impressed with a number of things about this book.It's very emotionally driven with a swath of interesting characters. The change in narrator gives us a chance to see how each person ticks and what they're hiding as they interact with each other and gave the story a lot of depth. Following the struggles of each character there are a lot of triumphs and tragedies that they face that blends into a well written story."}, {"review_sentiment": 3.0, "review_text": "Very hard to follow and depressing"}, {"review_sentiment": 3.0, "review_text": "I think that Migratory Animals might be the type of book that some people would really love, but I am just not one of them. The story centers around a bunch of yuppie (or I guess hipster) friends living in and around Austin Texas during the recession. None of these people are super likable, nor did I relate particularly well to any of them, and I can't say that I was attached to anyone's particular story. It was your typical modern novel about typical modern stuff. Nothing revelatory, though perhaps it was reaching for that."}, {"review_sentiment": 3.0, "review_text": "This book could have been so much more.  Mary Helen Specht can write.  There are passages in this novel that are beautiful and evocative, but the overall novel was bland and did not keep my interest.  I didn't care about the characters, there was no movement of the plot toward any kind of resolution, and I was happy that when I finished reading this book."}, {"review_sentiment": 5.0, "review_text": "I bought this book after the author spoke at a local writers meeting. I didn't know what to expect, but I got into the story quickly and felt compelled to keep reading. This is one of those novels that is hard to describe, but you will enjoy reading it."}, {"review_sentiment": 5.0, "review_text": "a wonderful study of the complexities and challenges of life"}, {"review_sentiment": 4.0, "review_text": "Loved the book.....didn't love the ending...."}, {"review_sentiment": 3.0, "review_text": "This book examines the lives of eight adults, friends since college, who are now entering middle age.  One of the eight, Flannery, has recently returned to the United States from working in Nigeria as a scientist.  She finds herself caught between her Nigerian life, including her work and her Nigerian fiance, and the friends she has returned to in Texas.  Her friends are suffering the various ills of approaching middle age, from the threat of serious illness to relationship drama.  The novel is very well-written, and all of the characters are intricately drawn.  Specht utilizes the kind of interesting work choice that creates memorable images.  I liked the fact that the book is presented from multiple character perspectives.That said, this story didn't really grab me.  I'm not sure why that's the case, possibly because love stories tend not to be my thing, and this is, at its heart, a series of love stories."}, {"review_sentiment": 3.0, "review_text": "This book had some interesting unpredictable twists, and a few long migration references whick seemed too long for my attention span."}, {"review_sentiment": 4.0, "review_text": "\"Migratory Animals: A Novel\" by Mary Helen Specht is an amazing book. The story and characters are well developed and executed with a smooth even flow. The dialogue is as engaging as the story itself and had me completely and utterly captivated  This book takes a look at characters who have reached a point in their lives where they need to make a decision on which direction their lives should go; stay on one road or take a turn and see where that road leads.It's a hard to put down book that pulled me in so deep the world outside this book didn't seem to exist. I lost track of time and found myself finishing the book at 4 am. I had know idea so much time had passed. It's been a while since a book consumed me like this one did.Definitely not a book to miss. And one I'll be re-reading again and again in the future."}]}, "authors": ["Mary Helen Specht"], "isbn": "0062346032", "longitude": -97.7436995, "periods": ["2000s", "Recent Releases"], "title": "Migratory Animals: A Novel", "word_cloud": "impress number thing emotionally driven swath interest character change narrator give chance see person tick hide interact give story lot depth follow struggle character lot triumph tragedy face blend well write story very hard follow depress think animal people really story center bunch yuppie guess hipster friend live recession none people super likable relate particularly well attach anyone particular story typical modern typical modern stuff regulatory perhaps reach much write passage beautiful evocative overall bland interest care character movement plot kind resolution happy finish read buy author speak local writer meet know expect get story quickly felt compelled reading novels hard describe enjoy read wonderful study complexity challenge life love love end examine life adult friend college enter middle age recently return work scientist find caught nigerian life include work nigerian fiance friend return friends suffer various ill approach middle age threat serious illness relationship drama character intricately draw utilizes kind interesting work choice create memorable image like fact present multiple character say story really grab sure case possibly story tend thing heart series love story interesting unpredictable twist long migration reference wick seem long attention span animal amaze story character well developed execute smooth even dialogue engage story completely utterly captivate take look character reach point life need decision direction live go road turn see road hard put pull deep world seem exist lose track time find finish know idea much time pass consume miss future", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "A powerful debut novel about a group of 30-somethings struggling for connection and belonging, Migratory Animals centers on a protagonist who finds herself torn between love and duty.\r\n\r\nWhen Flannery, a young scientist, is forced to return to Austin from five years of research in Nigeria, she becomes split between her two homes. Having left behind her loving fiancé without knowing when she can return, Flan learns that her sister, Molly, has begun to show signs of the genetic disease that slowly killed their mother.\r\n\r\nAs their close-knit circle of friends struggles with Molly’s diagnosis, Flannery must grapple with what her future will hold: an ambitious life of love and the pursuit of scientific discovery in West Africa, or the pull of a life surrounded by old friends, the comfort of an old flame, family obligations, and the home she’s always known. But she is not the only one wrestling with uncertainty. Since their college days, each of her friends has faced unexpected challenges that make them reevaluate the lives they’d always planned for themselves.\r\n\r\nA mesmerizing debut from an exciting young writer, Migratory Animals is a moving, thought-provoking novel, told from shifting viewpoints, about the meaning of home and what we owe each other—and ourselves.\r\n\r\n“Delightfully ambitious. . . . Specht perfectly captures the minute details of contemporary life in a certain social niche. . . . Novels of such scope and ambition, inspecting the way we encounter the wider world today, are rare.” The New York Times ", "asin": "0062346032", "rank": "1175539", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51vX0NI80QL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}