{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 173, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Bravo Anna Funder, for laying bare the corpse of perhaps the nastiest regime in the Soviet bloc, and helping us remember how its people were brought under police control.In my penniless student days (1959) before the Wall went up, I spent a month in Berlin West and East. I put in plenty of time in the eastern sector, then accessible to tourists, since it was a lot cheaper to eat there. Still, it scared the hell outa me. Not much had happened since the \"rubble women\" had swept up and stacked the loose bricks into nice orderly Teutonic piles. But the thing I noticed most was the difference in behavior between the open, friendly, fun-loving Westies and the dour, ill-clad, incurious, uncommunicative East Berliners. The realization that politics and military power could have such a profound effect on people's everyday behavior and their inner spirits made me an enemy of any country's heavy-handed social experiments and use of brute force in dealing with its citizens. Ms. Funder, who haunted the former capital of East German capital for many months a few years after the East Germans themselves attacked the Wall and made it history,tracked down several victims of the utterly nasty East German communist regime.Their stories of treatment at the hands of the \"Stasi\" - the GDR's manically thorough and compulsive secret police -will curl your hair and maybe gives you nightmares.Worse still are her interviews with several former unrepenting Stasi officers who recount, with deadpan accuracy, the many ingenious ways they sought to bend selected GDR citizens to their control. Far too many succumbed, swelling Stasi files until, by Funder's accounting, nearly one GDR citizen in six became a Stasi informant. Nonetheless, says Funder, GDR citizens who simply declined the Stasi's recruitment efforts suffered few ill effects, and fell off the Stasi radar. Despite such non-cooperation, East Germany quicky fell from the Nazi frying pan into the communist fire. Many were burned.Read this book, and remember it for the next time you hear about the police asking for information about perople you know."}, {"review_sentiment": 5.0, "review_text": "As I lived with my family in the \"socialist paradise\" of the GDR (German Democratic Republic) until 1950, when we had to escape, I found this book quite enthralling if not very uncomfortable at times. My father was a classical musician and teacher at a well-known Conservatory of Music and in the attached symphony orchestra through those years. He was arrested for cracking a joke about the president. On his parole we used various means to escape into West Germany, while Dad went via Berlin and the US refugee processing facility in Berlin. Thank God, because we have been able to enjoy a wonderful life in New Zealand, as opposed to friends and relations left behind."}, {"review_sentiment": 5.0, "review_text": "Really good book. Enjoys it alot."}, {"review_sentiment": 5.0, "review_text": "I was a student at FU Berlin 2007-9 and recall visiting the Stasi Museum. What struck me most was the top offices were no better than that of a store manager at J.C. Penny (and JCP prided themselves on no frills). These are great stories and puts into perspective movies like The Lives of Others."}, {"review_sentiment": 5.0, "review_text": "Enjoyed reading both for the content and style.  A study on human nature.  Enjoyed the author's ability to describe personalities, locations, and her analyses of the protagonists."}, {"review_sentiment": 4.0, "review_text": "The Soviets considered the Stasi to be the most efficient and reliable eastern European intelligence service. Here are the stories how how everyday people were affected by its action"}, {"review_sentiment": 3.0, "review_text": "Interesting but not spellbinding"}, {"review_sentiment": 5.0, "review_text": "A great read. I was in Berlin about the same time as the author. When I was in the East seven years after the collapse of the Wall I could still feel the scent of oppression mixed with relief of the people to finally be free of the yoke suppressing them. Anna Funder explains this so clearly in the examples she explores."}, {"review_sentiment": 5.0, "review_text": "True stories that I have experienced 24 years in my life. Highly Recommended."}, {"review_sentiment": 5.0, "review_text": "Former GDR citizens endured life  in a dictatorship with real daily struggles, while living a double life, of not knowing what was fact, truth, false, or wrong.  The GDR was openly watching its citizens via internal surveillance, by the Stasi, the East German secrete police.  While reading this book, I found myself releasing a long held breath from relief, sorrow, pain, confusion, sympathy and empathy.The author successfully explored, while behind the Wall, the GDR citizen needed to compromise and balance one's humanistic values, to survive the false narratives of the one party state (the Socialist Unity Party -SED), while living the reality of survival .  Further, the author explored how the GDR citizen coped with the emotional toll, upon learning of how the Stasi directly or indirectly affected one's personal, professional, social, and familial life.  This book has made me further believe that the human spirit does survive physically, emotionally, and spiritually.  Oh, and there is humor in the book, I could not stop laughing about a plate, which reminds me - life heroes are those who can laugh and carry on."}]}, "authors": ["Anna Funder"], "isbn": "0062077325", "longitude": 13.3888599, "periods": ["1900s"], "title": "Stasiland: Stories from Behind the Berlin Wall", "word_cloud": "lay bare corpse perhaps nastiest regime soviet bloc help people brought police penniless student day go spend month put plenty time eastern sector accessible tourist lot cheaper eat still scar hell not much happen rubble woman sweep stacked loose brick nice orderly teutonic pile thing notice difference behavior open friendly dour incurious uncommunicative realization politics military power effect people everyday behavior inner spirit make enemy country social experiment use brute force deal citizen haunt former capital east german capital many month year attack make history tracked several victim utterly nasty german communist treatment hand manically thorough compulsive secret police curl hair maybe give still interview several former unrelenting officer recount deadpan accuracy many ingenious way seek bend select citizen control many succumb swell file account nearly citizen become informant say citizens simply decline recruitment effort suffer ill effect fell radar kicky fell fry pan communist fire many next time hear police ask information people know live family socialist paradise escape find quite enthral uncomfortable time father classical musician teacher attach symphony orchestra year arrest crack joke president parole use various mean escape go refugee processing facility able enjoy wonderful life oppose friend relation leave really good a lot student recall visit strike top office better store manager pride frill great put perspective movie life others reading content style study human nature author ability describe personality locations analysis protagonist consider efficient reliable eastern european intelligence service here everyday people affect action interest spellbind great time author year collapse still scent oppression mixed relief people finally free yoke suppress explain clearly example explores true experience year life recommend citizen endure life dictatorship real daily struggle live double life know fact truth false openly watch citizen internal surveillance german secrete police read find release long hold breath relief sorrow pain confusion sympathy author successfully explore citizen need compromise balance humanistic value survive false narrative party state living reality survival author explore citizen cop emotional toll learn directly indirectly affect personal professional social familial life make believe human spirit survive physically emotionally spiritually humor laugh plate remind life hero carry", "genres": ["History"], "summary": "In 1989, the Berlin Wall fell; shortly afterwards the two Germanies reunited, and East Germany ceased to exist. In a country where the headquarters of the secret police can become a museum literally overnight and in which one in fifty East Germans were informing on their fellow citizens, there are thousands of captivating stories. \r\n\r\nAnna Funder tells extraordinary tales from the underbelly of the former East Germany. She meets Miriam, who as a sixteen-year-old might have started World War III; she visits the man who painted the line that became the Berlin Wall; and she gets drunk with the legendary “Mik Jegger” of the East, once declared by the authorities to his face to “no longer exist.” \r\n\r\nEach enthralling story depicts what it’s like to live in Berlin as the city knits itself back together—or fails to. This is a history full of emotion, attitude and complexity.", "asin": "0062077325", "rank": "56566", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51bl98U96YL.jpg", "country": "Germany", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}