{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 59.9132694, "ratings": {"num_ratings": 920, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Yet another fascinating book by Jo Nesbo.  This one presents us with a lot of Norwegian WW II history, and some similar names that requires that the reader's brain be always engaged and well-exercised to keep them all straight.  My edition included a map of Olso, which I frequently referred back to to place in my mind exactly where we kept moving around to and from.  Some American readers used to the banality of SK and JKR may most likely find this grey cell stimulus a bit too tiring, but the characters are so alive, the sights and sounds so fresh and real and tactile that this one again kept me burning the midnight oil well past midnight."}, {"review_sentiment": 5.0, "review_text": "Multiple personalities - revenge - for the greater good - who is considered a traitor or hero to an unforgiving nation"}, {"review_sentiment": 5.0, "review_text": "This is a captivating story.  I am new to this author and his writing is addictive.  Great mystery with believable storylines and very believable characters.  No wonder he's a big hit in Europe and I'm grateful he's in the united states.  You won't be ab'e to put him down.  Thank goodness he has such a large body of work."}, {"review_sentiment": 4.0, "review_text": "I started out of order due to my interest in The Snowman Killer from hype it was recieving in podcasts I listen to. Now I am addicted and starting at the beginning!"}, {"review_sentiment": 5.0, "review_text": "I enjoyed the book. I have never liked flashbacks (movies or books) It did stop,so I was okay with that part. I am confused on other reviews. Author is from Norway,book is about a Norwegian detective. Why would some people comment about Cities ,people and places being spelled in its natural language. Sure not easy names. But try and guess and then move on to story.Looking forward to reading The Snowman."}, {"review_sentiment": 3.0, "review_text": "I learned much Norwegian history here--mainly all a the clamor of Norway resisting Nazi occupation was so much hot air.  Norwegians enlisted in Hitler's army, fought for it and after Germany lost the nation tried to sweep this fact under the  carpet.  The plot takes us back in forth in time : WW2, the present and it weaves through people and streets and squares with those long unfamiliar names---great if you're from Oslo not so good if you're from Philly. Snowman was a more compelling read from the Harry Hole series."}, {"review_sentiment": 4.0, "review_text": "The Redbreast is a crime novel taking place during both the second world war and Norway at the turn of the millennium. During the second world war we are introduced to a small group of Norwegian Waffen-SS volunteers; Daniel, Gudbrand, Hallgrim and Edvard fight alongside each other begrudgingly in 1944 until they go their separate ways. Years later with much of what happened in the trenches a hazy jumbled memory their fates are again entwined in a mystery that forces Harry Hole to dive headfirst into the world of neo-nazis and the illegal arms trade.In The Redbreast Nesbo's writing and storytelling ability improve significantly.  The plot is complex and the scope vast. Nesbo masterfully juggles two eras without skipping a beat and manages to pace the two merging stories perfectly. I did struggle with the war scenes as I feel Nesbo assumed that his readers would mainly be Norwegians well acquainted with Norway's history in the war. I also felt that major loose ends were not dealt with towards the end of the book."}, {"review_sentiment": 2.0, "review_text": "I found it extremely difficult to get through. The plot is dense with a lot of flashbacks that just bog the story down.There is a lot of psychobabble which made me want to scream. I skipped the first two books of this author becauseof the suggestion that he was still developing , unfortunately he is still maturing in this book."}, {"review_sentiment": 5.0, "review_text": "Fantastic!! I’ve been working my way through Nesbos Harry Hole series and this is the best one yet!!"}, {"review_sentiment": 5.0, "review_text": "The redbreast wasn't engaging book to read from beginning to end. Harry Hole is an engaging character to get to know."}]}, "authors": ["Jo Nesbo"], "isbn": "0062068423", "longitude": 10.7391112, "periods": ["1900s", "2000s", "Recent Releases"], "title": "The Redbreast: A Harry Hole Novel", "word_cloud": "yet fascinating present lot norwegian history similar name require brain always engage keep straight edition include map frequently refer place mind exactly keep move around american reader use banality likely grey cell stimulus bit tire character alive sight sound fresh real tactile kept burn midnight oil well midnight multiple personality revenge greater good consider traitor hero unforgiving nation captivate story new author write addictive mystery believable story lines believable character wonder big hit grateful united state goodness large body work start order due interest hype receive podcasts listen now addict start begin enjoy never like flashback movie stop okay part confuse review detective people people place spell natural language sure easy name guess forward read learn much norwegian history mainly clamor resist occupation much hot air enlist army fight lose nation tried sweep fact carpet plot take back forth time present weave people street square long unfamiliar name good compel series crime take place second world war turn millennium second world war introduce small group norwegian volunteer fight alongside begrudgingly separate way years later much happen trench hazy jumble memory fate entwine mystery force dive headfirst world illegal arm write storytelling ability significantly plot complex scope masterfully juggle era skip beat manages pace merge story perfectly struggle war scene feel newsboy assume reader mainly well acquaint history war also felt major loose end deal towards end find extremely difficult plot dense lot flashback bog story lot psychobabble make want scream skip first author because of suggestion still develop unfortunately still mature fantastic work way series best yet redbreast engage begin end engage character get know", "genres": ["Fiction & Literature", "Mystery & Suspense", "WWII"], "summary": "“An elegant and complex thriller….Harrowingly beautiful.” New York Times Book Review\r\n\r\nNo disrespect meant to Henning Mankell and Stieg Larsson, but Jo Nesbø, the New York Times bestselling author of The Snowman, is the most exciting Scandinavian thriller writer in the crime fiction business.\r\n\r\nThe Redbreast is a fabulous introduction to Nesbø’s tough-as-nails series protagonist, Oslo police detective Harry Hole. A brilliant and epic novel, breathtaking in its scope and design—winner of The Glass Key for best Nordic crime novel and selected as the best Norwegian crime novel ever written by members of Norway’s book clubs—The Redbreast is a chilling tale of murder and betrayal that ranges from the battlefields of World War Two to the streets of modern-day Oslo.\r\n\r\nFollow Hole as he races to stop a killer and disarm a ticking time-bomb from his nation’s shadowy past. Vogue magazine says that “nobody can delve into the dark, twisted mind of a murderer better than a Scandinavian thriller writer”…and nobody does it better than Jo Nesbø! James Patterson fans should also take note.", "asin": "0062068423", "rank": "42874", "city": "Oslo", "image": "https://images-na.ssl-images-amazon.com/images/I/51p0v6v%2B97L.jpg", "country": "Norway", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}