{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 74, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I loved it!!"}, {"review_sentiment": 4.0, "review_text": "We kick off at Louisa’s wedding. Louisa is Angela’s best friend. The party is well under way but the pain of wearing high heels all night gets to Angela (who of us hasn’t had that issue) so she goes to the car to put on her old trusted flats, she opens the car door only to find her fiancé, Mark, cheating on her with his tennis partner, Katie. At first she has the natural reaction to scream and shout at everyone. She feels like a fool. Even her best friend knew. The next day the only thing she wants to do is get as far away from him and everyone she knows.So she gets on the first plane to an English speaking country and ends up in New York. A sobbing heart-broken mess. Mark was her life. For the last 10 years she’s been building a life with him and now she doesn’t know, well anything really.The first order of business is to find a hotel where, Angela meets Jenny Lopez. Jenny thinks that one day she will be the Oprah. She takes Angela under her wing and she is soon finding her way in the Big Apple.With a new friend, a very gorgeous new Marc Jacobs bag, a blog and two dinners with two hot men, New York soon seems like the perfect place for Angela, but dating two men and writing about them for the whole of New York to see soon becomes a problem….One of the main reasons I love this book is how easy it is to relate to Angela. She’s your typical girl, she loves everything a girl probably shouldn’t; Mr Ben and Mr Jerry, chocolate, cakes, cookies and spending all her money on Marc Jacobs to name just a few.I am DYING to visit New York. It seems so magical. When I do I will definitely be using the guide at the back of the book. One of my favourite parts of this book is when she first arrives in NY and Jenny brings her lots and lots of food via room service, and by food I mean cookies, cakes, chocolate, ice cream.This is a great ChickLit read. Lindsey has you crying, laughing and shopping (lots of shopping)."}, {"review_sentiment": 2.0, "review_text": "The most annoying part of this book was that everyone - including the American characters - spoke like the British main character. I ended up skimming most of the book to get the gist of the story line... but overall, it was not what I would expect from something published by HarperCollins."}, {"review_sentiment": 3.0, "review_text": "The female character in this series is clearly based on Bridget Jones with extra emphasis on the ability to drink copious amounts of alcohol and share great sex all the time inspite of the fact that she seems to spend an inordinate amount of time sitting around on the sofa in her pjs scoffing down huge amounts of junk food.  To try to sell an additional image of someone such a roaring success as a writer and journalist with the minimum of effort in the most competitive and talent-saturated industry is so implausible that it just gets rather boring."}, {"review_sentiment": 5.0, "review_text": "I love Lindey Kelk's books so much! They have just the right amount of humor, fun, and romance to make all chick lit lovers smile! In this book, I Heart New York, readers are taken on a journey with Angela as she runs away from her home town of London to start over after catching her fiance cheating at her best friends wedding. But, what should have been a time of crying an eating her way through Ben and Jerry's in order to get over said breakup, Angela finds herself living the life she always wanted. Two boys to date? Check. A new best friend? Check. A whole new wardrobe AND fabulous purse from Marc Jacobs? Double check. Follow Angela on her journey post breakup in this fantastic novel about starting over and living again. You won't regret it, I know I don't!The heroine of this story (and series - it plays out through a number of books SQUEE) is Angela (as mentioned above) and is a girl that anyone could find themselves easily connected with. She is down to earth (albeit a little naive in the beginning) and a total sweetheart. Had she been a real person, I know I would wish her to be my own best friend.The plot of the story is so much fun! It involves dating, and finding a lot of joy out of life when you didn't think there would be any. I absolutely adored being on the journey with Angela and can't wait to see where she goes next! If you haven't had the chance to visit New York city (I love that city!) you will FEEL like you are there with Angela. The author does a wonderful job describing the shops, the attractions, and all the delicious restaurants that make you drool all over yourself.With that being said, this is a true CHICK LIT novel, and frankly, one of the best ones I have read in quite a while. Sure it was published in 2009, but it is worth the read even if you are one of those who only reads the newer releases. The good news is though that the sixth book in this series (I Heart Forever) is releasing this year! So I vow to read this entire series so I can get my hands on that one as soon as it releases!Fans of chick lit novels and those who enjoy a fun, lighthearted read without all the drama will certainly love this book! I highly recommend it. And, I recommend many of the authors other novels including Always the Bridesmaid and We Were On a BreakPS: If you enjoy the Shopaholic Series by Sophie Kinsella this would be the perfect series for you! It reminded me of Kinsella's novels without all the debt :DRating: 5 stars"}, {"review_sentiment": 4.0, "review_text": "This was by far not my favorite book of all time, but it kept my interest and I enjoyed the writing style used. I've never been to New York but reading this made me imagine being there so vividly. I want to plan a vacation there now. The plot was at times unrealistic, but the characters and events were relatable. At times it reminded me of my younger days and what it was like to date, spend time with friends, go to concerts, etc. It brought a sense of nostalgia to it."}, {"review_sentiment": 2.0, "review_text": "I did not care for this book and I read a lot!"}, {"review_sentiment": 4.0, "review_text": "Nice fun read"}, {"review_sentiment": 5.0, "review_text": "love it"}, {"review_sentiment": 3.0, "review_text": "Much like Angela was drawn to New York with a lust for inspiration, I had been on the hunt for a certain kind of book. I had a craving that I just couldn’t shake for a book that contained the following elements: uplifting and feel good, contained a theme about re-inventing yourself, and contained travel or re-location. I wanted something that would give me a bit of inspiration for something to try in my own life – give me a “kick in the butt” to get out there. This book sounded like it had all of these elements, and for the most part it did! I especially got my fix from the strong beginning. This book is about a young woman who, after finding she is being cheated on by her fiancé at her best friend’s wedding, escapes to New York City. There, she meets some lovely new faces, complete re-invents herself, and embarks on a new and exciting adventure. However, the second half of the book is where I feel we hit a plateau. Some of the elements of the book are over the top cheesy and superficial, but I honestly didn’t mind and could look past that as I was in the mood for something girly and glamorous anyways. However, the second half of the book basically centered around her dating two different guys.  I actually began to get a bit bored and found myself skimming quite often. I generally despise love triangles, however I didn’t even mind really in this novel which is a pretty bad sign. It means I was really bored and had lost a lot of interest. I felt it was too much filler in a way, and like I could skip past 50 pages and not miss anything crucial.  Even though this book didn’t hit home in my heart, and I found myself dragging through a good chunk of it, I still find myself somehow interested in reading another book. It doesn’t make a whole lot of sense to me. Its sort of like Starbucks; I am not particularly a die hard “this is so delicious” fanatic for their drinks, and yet I keep coming back for mediocre content that is somehow rather satisfying. I have a feeling that if each of these books was a different television episode, what with the new city and new adventure in each, it could be a very comforting binge watch.2.5 Stars.Zarriah Rose | Content Creator, Book Blogger & Reviewer, BooktuberThe Owl BurrowYoutube.com/TheOwlBurrow || theowlburrow@gmail.com"}]}, "authors": ["Lindsey Kelk"], "isbn": "0062004352", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "I Heart New York", "word_cloud": "love kick wed best friend party well way pain wear high heel night get issue go car put old trusted flat open car door find fiance cheat tennis partner first natural reaction scream shout everyone feel fool even best friend know next day thing want get far away everyone get first plane speaking country end sob mess life last year build life know well anything first order business find hotel meet think day take wing soon find way friend gorgeous bag blog dinner hot men soon seem perfect place date men write whole see soon becomes main reason love easy relate typical girl love everything girl probably chocolate cake cooky spend money name visit seem magical definitely use back favorite part first arrive bring lot lot food room service food mean cooky cake chocolate ice great cry laugh shop lot shop annoy part everyone include american character speak main character end skim get gist story line overall something publish harper collins female character series clearly base extra emphasis ability drink copious amount alcohol share great sex time inspire fact seem spend inordinate amount time sit around sofa pj's scoff huge amount junk food additional image someone roar success writer journalist minimum effort competitive industry implausible get rather boring love much right amount humor fun romance make chick lit lover smile reader take journey run away home town start catch fiance cheat best friend wed time cry eat way order get say breakup find live life always want boy date best friend whole wardrobe fabulous purse journey post breakup fantastic start living know heroine story series play number mention girl anyone easily connect earth albeit little naive begin total sweetheart have real person know best plot story much fun involve date find lot joy life think absolutely adore journey see go next chance visit city love city author wonderful job describe shop attraction delicious restaurant make drool say true frankly best one quite sure publish worth even read newer release good news sixth series forever release year so vow entire series get hand soon release fan chick lit novel enjoy fun lighthearted drama certainly love highly recommend recommend many author novel include enjoy series remind novel debt star far favorite time keep interest enjoy write style use never reading make imagine vividly want plan vacation plot time unrealistic character event repeatable time reminded younger day date spend time friend go concert etc bring sense nostalgia care lot fun love much draw lust inspiration hunt certain kind crave shake contain following element uplift feel good contain theme contain travel want something bit inspiration something life kick butt sound element part especially get fix strong beginning young woman find cheat fiance best friend wed escape meet lovely face complete embarks exciting adventure however second half feel hit plateau element top cheesy superficial honestly mind mood something girly glamorous anyways however second half basically center date different guy actually begin get bit bore find skim quite often generally despise love triangle however even mind really pretty bad sign mean really bore lose lot interest felt much filler way past page miss anything crucial even hit home find drag good chunk still find somehow interested reading make whole lot sense sort particularly die hard delicious fanatic drink yet keep come back mediocre content somehow rather satisfy feel different television episode city adventure binge theowlburrow", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "The perfect book for Sex and the City fans, I Heart New York by Lindsey K. Kelk truly celebrates the city that never sleeps. \r\n\r\nThe delightful story of a young woman who flees London and her cheating boyfriend to rediscover her sexy, stylish, confident self while building a new life in the greatest city in the world, I Heart New York is funny, sunny, and sexy, a big hearted, Big Apple treat for Sofia Kinsella, Emily Griffin, and Anna Maxted readers.", "asin": "0062004352", "rank": "471705", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51nOSD2tS1L.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}