{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 65, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Truly inspired writing and use of language. The stories are poignant and very touching."}, {"review_sentiment": 5.0, "review_text": "All the short stories in this book are amazing! It's funny because I'm from Washington DC, and am familiar with the locations that Mr. Jones references in the book."}, {"review_sentiment": 5.0, "review_text": "Edward P. Jones done it again."}, {"review_sentiment": 5.0, "review_text": "Without seeing it coming, Davis draws you into his stories and puts you into the skin of his characters.  In some places, I found myself holding my breath, full of feeling  at the end of a sentence.  The settings and addresses are familiar, but his writing infused them with new emotion.  A wonderful writer!"}, {"review_sentiment": 1.0, "review_text": "I got this book because of the great reviews. I was disappointed."}, {"review_sentiment": 5.0, "review_text": "i AM A GREAT FAN OF THE AUTHOR AND READ EVERYTHING I CAN THAT HE HAS WRITTEN.  THIS COLLECTION OF SHORT STORIES WAS REMARKABLE IN THAT EACH STORY MADE ME BELIEVE IN JUST A FEW PAGES, THAT i  REALLY KNEW THE CHARACTERS AND UNDERSTOOD THEM."}, {"review_sentiment": 5.0, "review_text": "great writer"}, {"review_sentiment": 5.0, "review_text": "The characters in these stories come alive on the page. They are complex, brave and flawed, cruel and kind. Like life"}, {"review_sentiment": 5.0, "review_text": "Although I don't normally read short stories, the stories in Lost in the City are so rich and full. In some of the later stories, Jones even weaves in characters from earlier ones as if reintroducing old friends and giving their back story. I enjoyed all of the stories."}, {"review_sentiment": 5.0, "review_text": "It's a gripping collection of stories, not for the weak-hearted. Be ready to meet people you may not like, doing and saying things you probably won't like -- but these stories are real talk. Real stories about real people who aren't like you. Well-written and tight. You must read beyond the printed words to appreciate Edward P. Jones' skills as a writer."}]}, "authors": ["Edward P. Jones"], "isbn": "006219321X", "longitude": -77.0366456, "periods": ["1900s"], "title": "Lost in the City - 20th anniversary edition: Stories", "word_cloud": "truly inspired writing use language poignant touch short amaze funny familiar location reference do see come draw put skin character place find hold breath full feel end sentence setting address familiar write infused new emotion wonderful writer get great review disappoint be great fan great writer character come alive page complex brave flaw cruel kind life normally short rich full later even weave character earlier one reintroduce old friend give back story enjoy grip collection ready meet people say thing probably real talk real people tight printed word appreciate skill writer", "genres": ["Fiction & Literature"], "summary": "“Original and arresting….[Jones’s] stories will touch chords of empathy and recognition in all readers.”\r\n—Washington Post\r\n\r\n “These 14 stories of African-American life…affirm humanity as only good literature can.”\r\n —Los Angeles Times\r\n\r\nA magnificent collection of short fiction focusing on the lives of African-American men and women in Washington, D.C., Lost in the City is the book that first brought author Edward P. Jones to national attention. Winner of the Pulitzer Prize, the National Book Critics Circle Award, and numerous other honors for his novel The Known World, Jones made his literary debut with these powerful tales of ordinary people who live in the shadows in this metropolis of great monuments and rich history. Lost in the City received the Pen/Hemingway Award for Best First Fiction and was a National Book Award Finalist. This beautiful 20th Anniversary Edition features a new introduction by the author, and is a wonderful companion piece to Jones’s masterful novel and his second acclaimed collection of stories, All Aunt Hagar’s Children.", "asin": "006219321X", "rank": "201827", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/41WfSEuH2%2BL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}