{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 113, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Good read"}, {"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 5.0, "review_text": "I'm new to this genre of writing. This sets an awfully high bar for everything else. That story telling, great dialogue."}, {"review_sentiment": 4.0, "review_text": "Jackie Brown was Quentin Tarantino’s third movie, his follow up to Reservoir Dogs and Pulp Fiction.  Whereas Pulp Fiction was shockingly original and, at times, brutally violent; Jackie Brown was based upon the novel Rum Punch by Elmore Leonard.  I’ve read many of Leonard’s works and enjoy his style, which is dialogue heavy.  In Leonard’s later works he brazenly focused on dialogue and let the reader fill in a lot of the blanks around it.  This method might not work for a lessor writer but Leonard was so good at dialogue, and penned such intriguing characters, that books were eminently readable and wonderfully entertaining.  In particular, Leonard has always had a joyful talent for creating mean scumbags and ne’er-do-wells. Rum Punch is a solid outing by Leonard but I wouldn’t put it at the top of his list.  It tells the story of a stewardess caught smuggling money for a drug dealer and how she attempts to extricate herself from the mess.  Tarantino took on the story and did something wonderful with it.  His master stroke was casting Pam Grier and Robert Forster in the leads.  Grier was infamous for the Blaxploitation films of the 70’s but hadn’t been in a major production in years.  Forster had made a lot of fine movies over the years but was “off the radar” as a leading man.  Tarantino wonderfully explores both in their middle ages wrestling with who they’ve turned out to be and what the future might, or might not hold, for each.  He pits them against a Tarantino favorite, Samuel L. Jackson, as Ordell, a happily conniving thug.  The basic characters are Leonard’s and the foundation of the plot is his but Tarantino reels in the story a bit and tightens it up.  Rum Punch is a solid story and worth reading, as is most of Leonard’s stuff.  But Tarantino made it a better story and put together a fantastic movie anchored by impressive performances.  Read the book but don’t dare miss a chance to catch the movie."}, {"review_sentiment": 4.0, "review_text": "Jackie Brown was Quentin Tarantino’s third movie, his follow up to Reservoir Dogs and Pulp Fiction.  Whereas Pulp Fiction was shockingly original and, at times, brutally violent; Jackie Brown was based upon the novel Rum Punch by Elmore Leonard.  I’ve read many of Leonard’s works and enjoy his style, which is dialogue heavy.  In Leonard’s later works he brazenly focused on dialogue and let the reader fill in a lot of the blanks around it.  This method might not work for a lessor writer but Leonard was so good at dialogue, and penned such intriguing characters, that books were eminently readable and wonderfully entertaining.  In particular, Leonard has always had a joyful talent for creating mean scumbags and ne’er-do-wells. Rum Punch is a solid outing by Leonard but I wouldn’t put it at the top of his list.  It tells the story of a stewardess caught smuggling money for a drug dealer and how she attempts to extricate herself from the mess.  Tarantino took on the story and did something wonderful with it.  His master stroke was casting Pam Grier and Robert Forster in the leads.  Grier was infamous for the Blaxploitation films of the 70’s but hadn’t been in a major production in years.  Forster had made a lot of fine movies over the years but was “off the radar” as a leading man.  Tarantino wonderfully explores both in their middle ages wrestling with who they’ve turned out to be and what the future might, or might not hold, for each.  He pits them against a Tarantino favorite, Samuel L. Jackson, as Ordell, a happily conniving thug.  The basic characters are Leonard’s and the foundation of the plot is his but Tarantino reels in the story a bit and tightens it up.  Rum Punch is a solid story and worth reading, as is most of Leonard’s stuff.  But Tarantino made it a better story and put together a fantastic movie anchored by impressive performances.  Read the book but don’t dare miss a chance to catch the movie."}, {"review_sentiment": 5.0, "review_text": "Bought it because I love Jackie Brown"}, {"review_sentiment": 3.0, "review_text": "This copy of \"Rum Punch\" includes a Leonard column from the NYT with his advice on writing, which boils down to \"if it sounds like writing, rewrite it.\" It's not a rule he followed here. The great characters and interesting plot are obscured by the structural, writerly affectations Leonard insists on using in the book, accomplishing nothing that I can see other than amusing himself by doing so.So, this is one of the rare occasions where the movie -- Tarantino's \"Jackie Brown\" -- does Leonard better, by removing those affectations and whose new affectations mirror Leonard's strength with dialogue and character.Sorry, Mr. Leonard."}, {"review_sentiment": 5.0, "review_text": "Everyone knows this is widely regarded as one of Leonard's finest works. The proof is in how Tarantino was able to adapt it to the screen for Jackie Brown. This is Elmore Leonard at his grittiest. It's a page-turner and extremely hard to put down. Characters are well-developed and the dialogue is crisp and authentic. Others would debate about which book is best - but you can pretty much stack this up against anything Leonard has done and it will hold up. Always worth digging in and finding a worn, first edition, too. For writers, this is a must-have, how-to. For Tarantino fans, it'll show you how great the source material was and still is."}, {"review_sentiment": 5.0, "review_text": "Better than the movie, which was very good.  It's E. Leonard at his best, it's easy to read and it's on Kindle.  Enjoy."}, {"review_sentiment": 4.0, "review_text": "The reason I said \"predictable is because it's true Elmore Leonard, and if you read enough of his work, you sort of know how it's all going to play out.  But it's still worth the time."}]}, "authors": ["Elmore Leonard"], "isbn": "0062119826", "longitude": -80.1936589, "periods": ["1900s"], "title": "Rum Punch: A Novel", "word_cloud": "good great new genre write set awfully high bar everything else story tell great dialogue third movie follow shockingly original time brutally violent base many work enjoy style dialogue heavy later work brazenly focused dialogue let lot blank method lessor writer good dialogue pen intriguing character eminently readable wonderfully entertain particular always joyful talent create mean scumbags ne solid out put top list tell story stewardess catch smuggle money drug dealer attempt extricate mess take story something wonderful master stroke cast lead infamous film major production year make lot fine movie year radar lead man wonderfully explore middle age wrestle turned future pit favorite happily connive basic character foundation plot reel story bit tightens solid story worth read stuff make better story put together fantastic movie anchor impressive performance dare miss chance catch movie third movie follow shockingly original time brutally violent base many work enjoy style dialogue heavy later work brazenly focused dialogue let lot blank method lessor writer good dialogue pen intriguing character eminently readable wonderfully entertain particular always joyful talent create mean scumbags ne solid out put top list tell story stewardess catch smuggle money drug dealer attempt extricate mess take story something wonderful master stroke cast lead infamous film major production year make lot fine movie year radar lead man wonderfully explore middle age wrestle turned future pit favorite happily connive basic character foundation plot reel story bit tightens solid story worth read stuff make better story put together fantastic movie anchor impressive performance dare miss chance catch movie love copy include column advice write boil sound write rule follow great character interest plot obscure structural writer affectation insist use accomplish nothing see amuse rare occasion movie better remove affectation new affectation mirror strength dialogue everyone know widely regarded finest work proof able adapt screen grittiest extremely hard put dialogue crisp authentic best pretty much stack anything do hold dig find worn first edition writer tarantino fan show great source material still movie good best easy reason say predictable true enough work sort know go play still worth time", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Rum Punch is classic Elmore Leonard—the electrifying thriller that served as the basis for the acclaimed film Jackie Brown by director Quentin Tarantino. \r\n\r\nLeonard’s story of a not-altogether-blameless flight attendant on the run from her vicious gun-running sometime employer who sees her as a troublesome loose end, Rum Punch is “the King Daddy of crime writers” (Seattle Times) at his sharpest and most ingeniously entertaining. In fact, People magazine calls it, “Leonard’s best work. He brilliantly reaffirms his right to the title of America’s finest crime fiction writer.” \r\n\r\nEnjoy this sensational noir winner from the creator of the character of U.S. Marshal Raylan Givens, lately of TV’s hit series Justified, and see why the great Elmore Leonard stands tall in the company of America’s most legendary crime fiction masters: John D. MacDonald, Dashiell Hammett, James M. Cain, et al. ", "asin": "0062119826", "rank": "54058", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/41rBLHr99EL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}