{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 462, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "It was 1917, and Lady Elizabeth Neville-Ashford wanted to do more for her country’s war effort. Her parents, the Earl and Countess of Cumberland, thought there were ways for a proper lady to help without getting her hands dirty, but for Elizabeth (Lilly) that was not enough, so she enlisted in the WAACS and ended up driving an ambulance at the front in France. After being recognized by a soldier who had been a footman at Buckingham Palace, she was astounded at peoples’ reactions, both good and bad, to finding an aristocrat in their midst. The other WAAC drivers were enthralled with the thought that, as a child, she was one of the children brought to the palace to play with the Prince of Wales. Lilly’s surprise, on the other hand, was the effect that all of this had on her love life."}, {"review_sentiment": 5.0, "review_text": "I enjoyed this book  immensely! I have read many historically-based novels with the romance worked into the facts and this one was perfect"}, {"review_sentiment": 5.0, "review_text": "I thoroughly enjoyed this book.  It is a period novel set at the beginning of World War I.  It involves a privileged British girl who wants more from life than parties and marrying well.  It is historically factual regarding the lives of British royalty and their families.  Women during this time period were considered practically worthless.  Many times they were not educated beyond the basic task of learning to read.  This book focuses on the struggles of women who want more out of their life.  It details the struggles of two particular women, Lilly and Charlotte.  Lilly is a \"lady\" and, as such, is expected to do one thing and one thing only, marry well.  Charlotte is her tutor, a university-educated women, who helps her look outside the box her family is determined to keep her in.  Lilly falls in love with a friend of her brother, Edward.  However, he is not considered suitable or worthy of Lilly by her family.  Edward and his friend, Robbie, enlist and are sent to the front lines of World War I.  What I particularly liked about this book was the the war was pretty thoroughly discussed with no holds barred on the savageness of the first world war.  It made me have a deeper appreciation of the men and women who served in this war to end all wars.  I would definitely recommend this book for your reading enjoyment.  It is a fairly easy read, short chapters, good for reading a little at a time.  However, once I started reading it, I couldn't get back to it fast enough."}, {"review_sentiment": 5.0, "review_text": "Loved it!"}, {"review_sentiment": 5.0, "review_text": "The freedom to choose your own destiny is seeded deeply into our souls. Lille was some one who lived  deeply not just in love, but in life. She was someone we would have all wanted to identify with during the time of this setting. Excellent read if you want to have your heart captivated."}, {"review_sentiment": 4.0, "review_text": "An impeccably paced, compelling tale of love between classes in a fully realized Great War setting. Robson's depictions of the horrors of everyday life as a field surgeon and an ambulance driver on the front are unflinching without crossing the line into gratuitous violence. The romance is handled realistically, deftly, and with great empathy. A great book for readers of historical fiction. I'll note that while this is part of a series, I think the books can be read in any order and each stands on their own."}, {"review_sentiment": 5.0, "review_text": "Very good read -- seemed to captured both female and male characters quite weel with some very realistic discussion of why those who experience war prefer not to speak of it -- primarily, so others will not have to suffer. Nice insight. Well worth the read. Very well rounded protaganist in the upper class lady becoming a centered young woman."}, {"review_sentiment": 5.0, "review_text": "Very informative background of World War I.  Liked the story line and believable characters.  Couldn't put it Down!  Would recommend it."}, {"review_sentiment": 5.0, "review_text": "Well written. Engaging characters in historical setting."}, {"review_sentiment": 5.0, "review_text": "Great war romance. The author did a great job showing the  brutality and constant worry of those involved. Must read if you like war stories and romance."}]}, "authors": ["Jennifer Robson"], "isbn": "0062273450", "longitude": 2.3514992, "periods": ["1900s"], "title": "Somewhere in France: A Novel of the Great War", "word_cloud": "want country effort parent think way lady help get hand dirty enough enlist end drive ambulance front recognize soldier footman astound people reaction good bad find aristocrat midst driver enthral think child child bring palace play surprise hand effect love life enjoy immensely many novel romance work fact perfect thoroughly enjoy period set beginning involve privilege girl want life party marry well historically factual regard life british royalty family time period consider practically worthless time educate basic task learn focus struggle woman want life detail struggle particular woman lady expect thing thing marry well tutor woman help box family determine fall friend brother however consider suitable worthy family friend enlist send front line particularly like pretty thoroughly discuss hold barred savageness first world make deeper appreciation men woman serve end war definitely read enjoyment fairly easy short chapter good read little time however start read back fast enough love freedom choose destiny seed deeply soul live deeply life someone identify time set want heart captivate impeccably pace compelling tale love class fully realize set depiction horror everyday life field surgeon ambulance driver front unflinching cross line gratuitous violence romance handle realistically deftly empathy reader historical fiction note part series think order stand very good seem captured female male character quite week realistic discussion experience prefer speak primarily others suffer nice insight well worth very well rounded protagonist upper class lady become center young woman very informative background like story line believable character well write character historical setting romance author job show brutality constant worry involve story romance", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A daring young woman will risk her life to find her destiny in this atmospheric, beautifully drawn historical debut novel—a tale of love, hope, and danger set during the First World War.\r\n\r\nLady Elizabeth Neville-Ashford wants to travel the world, pursue a career, and marry for love. But in 1914, the stifling restrictions of aristocratic British society and her mother’s rigid expectations forbid Lilly from following her heart. When war breaks out, the spirited young woman seizes her chance for independence. Defying her parents, she moves to London and eventually becomes an ambulance driver in the newly formed Women’s Army Auxiliary Corps—an exciting and treacherous job that takes her close to the Western Front.\r\n\r\nAssigned to a field hospital in France, Lilly is reunited with Robert Fraser, her dear brother Edward’s best friend. The handsome Scottish surgeon has always encouraged Lilly’s dreams. She doesn’t care that Robbie grew up in poverty—she yearns for their friendly affection to become something more. Lily is the most beautiful—and forbidden—woman Robbie has ever known. Fearful for her life, he’s determined to keep her safe, even if it means breaking her heart.\r\n\r\nIn a world divided by class, filled with uncertainty and death, can their hope for love survive. . . or will it become another casualty of this tragic war?", "asin": "0062273450", "rank": "86228", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51Wrttu3XWL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}