{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 273, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "Super quick read. If you want a tiny taste of mystery then go ahead and read this short story. Otherwise, go for the novel with Hercule in it."}, {"review_sentiment": 5.0, "review_text": "I give this rating  to nearly  half  of her novels.Short story's are fun reading  when you are busy with other things."}, {"review_sentiment": 5.0, "review_text": "Great book and love the classic cover art."}, {"review_sentiment": 5.0, "review_text": "I actually thought I downloaded the whole story but only got the short story.  I enjoyed it anyway!"}, {"review_sentiment": 3.0, "review_text": "Entertaining but she always pulls something unexpected out of the hat; a bit unbelievable at times. Still it was entertaining."}, {"review_sentiment": 5.0, "review_text": "Good classic Christie mystery. Poirot is razor sharp!"}, {"review_sentiment": 4.0, "review_text": "The story is classic Poirot and the plot intriguing. Although I don't envy the reader, several of his voices were very nasal and hard to listen to. He also tends to taper off into softer speech from time to time. Since I listen in order to ease sleep, it's annoying to have to raise the volume or repeat a passage I couldn't hear."}, {"review_sentiment": 5.0, "review_text": "Thought I knew who did-was given some miss leads - but I was correct, Yay! for me."}, {"review_sentiment": 5.0, "review_text": "Great quality, good sized lettering and of course, a great story. Great book. Solid feel."}, {"review_sentiment": 3.0, "review_text": "Its fine."}]}, "authors": ["Agatha Christie"], "isbn": "0062073559", "longitude": 31.243666, "periods": ["1900s"], "title": "Death on the Nile", "word_cloud": "quick want tiny taste mystery go ahead short story go give rating nearly half story fun read busy thing love classic cover art actually think download whole story get short story enjoy anyway always pull something unexpected bit unbelievable time still entertain good classic mystery razor sharp story classic plot intrigue envy several voice nasal hard listen also tend taper softer speech time time listen order ease sleep annoy raise volume repeat passage know give miss lead correct say quality good size lettering course great story feel fine", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Book 17/43 in the Hercule Poirot Series\r\n\r\nLinnet Doyle is young, beautiful, and rich. She's the girl who has everything--including the man her best friend loves. Linnet and her new husband take a cruise on the Nile, where they meet the brilliant detective Hercule Poirot. It should be an idyllic trip, yet Poirot has a vague, uneasy feeling that something is dangerously amiss.", "asin": "0062073559", "rank": "1796", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51E0xOL8qeL.jpg", "country": "Egypt", "story_arc": ["Tragedy", "Things only get worse"]}