{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 11, "rating": 3.3, "reviews": [{"review_sentiment": 3.0, "review_text": "I found this book to be a tad dry."}, {"review_sentiment": 1.0, "review_text": "Dull."}, {"review_sentiment": 5.0, "review_text": "The best book ever written about Rome.  For intelligent people who love the city, no other book can really compare for its insight, its thoughtfulness, and gorgeous writing.  As reviews here make clear, the book is not for dumb people who want to reduce Italy to a foodie rom-com.  In this respect the title of the book is now unfortunate.  But if you're headed to Rome with your sketchbook or camera, Clark will make you see things you would never see otherwise."}, {"review_sentiment": 4.0, "review_text": "Your service in getting it to me was good, but the content let me down.  As I read much of her words, I kept thinking, \"Who cares?\""}, {"review_sentiment": 5.0, "review_text": "those who love Rome... no one should visit the Protestant Cemetery without having read EC's pages on that wonderful place..."}, {"review_sentiment": 1.0, "review_text": "I thought this book would be interesting because I love Rome....but it was so boring that I gave up before I reached the end.  I am not sure why Ms. Clark wrote this book.  I gave her one star for effort."}, {"review_sentiment": 5.0, "review_text": "I have been going to Rome for more than fifty years, speak and read Italian, and have many relatives there. Eleanor Clark's essays are by far the most evocative I know of in either English or Italian, and the last three in particular, on Hadrian's Villa, the Protestant Cemetery, and the poet G.G. Belli are deeply moving. Even for the reader has never been to Rome the literary value of these essays makes them extraordinarily rewarding."}, {"review_sentiment": 3.0, "review_text": "While it may be premature to review this book (I am still struggling through it)I can't help myself. The descriptions seem more a game of words than travel writing and I become distracted by the long, complex sentence structures. I have frequently lost track of what she is describing and had to return to the beginning of the sentence. While reading this book do not be tempted to let your mind wander a bit or you will become hopelessly lost! Some captioning would be nice for the illustrations. They are lovely but the reader is not entirely sure what(s)he is looking at. As yet, I have been unable to formulate a firm picture in my mind of places she is describing, except perhaps the chapter on the cats - it was marvelous! I may read this again at some time in the future; right now I just want to finish it and get on into something that isn't quite so much work!!"}, {"review_sentiment": 5.0, "review_text": "\"You walk close to your dreams\"--that's the first sentence of Eleanor Clark's chapter on the fountains of Rome. Her book is lyrical but informative, and for some readers, perhaps too heavy with information, but I have found it indispensible both while in Rome and later back in the US thinking about where I had been. Orignally published as separate articles in The New Yorker magazine, each chapter focuses on a particular subject. One of my favorites is the section on  Protestant Cemetery (actually the cemetery of the non-Catholics), where Keats, Shelley, Gramsci and many other non-Catholic writers, politicians, diplomats, and artists are buried. This is not a typical guidebook, however, and anyone who buys it in order to get maps, pictures, and restaurant tips will be disappointed. Nevertheless, it is an excellent guide to the city--it is thoughtful, it is full of strong opinions, and it is sometimes very funny, too. Eleanor Clark was married to the writer Robert Penn Warren, whose career overshadowed hers.  Those who know his work but do not know the work of Clark may be surprised to find out just how good she is."}, {"review_sentiment": 1.0, "review_text": "this book is deceiving...i admit, some will find it interesting, but clark jumps around with no transitions.  it is more of a journal, or a collection of essays.  she does describe in detail a number of things in rome, yet if you are looking for a novel or a piece of literature which is cohesive this is not the book for you."}]}, "authors": ["Eleanor Clark"], "isbn": "0062363409", "longitude": 12.4829321, "periods": ["1900s"], "title": "Rome and a Villa", "word_cloud": "find tad dry dull best ever write intelligent people love city really compare insight thoughtfulness gorgeous write review make clear dumb people want foodie respect title unfortunate head sketchbook camera make see thing never otherwise service get good content let much word keep think care visit page wonderful place think love boring give reach end sure write give star effort go fifty year speak italian many relative essay far evocative know last particular poet deeply move even never literary value essay make extraordinarily reward review still struggle description seem game word travel write become distracted long complex sentence structure frequently lose track describe return begin sentence read tempt let mind bit become hopelessly lose captioning illustration lovely entirely sure look yet unable formulate firm picture mind place describe perhaps chapter cat marvelous time right want finish something quite much work walk close dream first sentence chapter fountains lyrical informative reader perhaps heavy information find indispensable later back think originally publish separate article magazine chapter focus particular subject favorites section actually cemetery many writer politician diplomats artist bury typical guidebook however anyone buy order get map picture restaurant tip disappoint excellent guide city thoughtful full strong opinion sometimes funny marry writer career overshadow know work know work good deceive admit interesting clark jump transition journal collection essay describe detail number thing yet look piece literature cohesive", "genres": ["Essay", "Travel Writing"], "summary": "Bringing to life the legendary city's beauty and magic in all its many facets, Eleanor Clark's masterful collection of vignettes, Rome and a Villa, has transported readers for generations.\r\n\r\nIn 1947 the young American writer traveled to Rome on a Guggenheim fellowship. But instead of a novel, Clark created a series of sketches of Roman life written mostly between 1948 and 1951. Wandering the streets of this legendary city, Eleanor fell under Rome's spell—its pace of life, the wry outlook of its men and women, its magnificent history and breathtaking contribution to world culture. \r\n\r\nRome is life itself—a sensuous, hectic, chaotic, and utterly fascinating blend of the comic and the tragic. Clark highlights Roman art and architecture, including Hadrian's Villa—an enormous, unfinished palace—as a prism to view the city and its history, and offers a lovely portrait of the Cimitero acattolico—long known as the Protestant cemetery—where Keats, Shelley, and other foreign notables rest.", "asin": "0062363409", "rank": "1068805", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/511LbGzDzJL.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}