{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 448, "rating": 4.3, "reviews": [{"review_sentiment": 2.0, "review_text": "Not as good as the first. Better than the second. A great author ( with an EDITOR ) would have combined the three into a single 600/650 page tome. By the time you make it to this one you’re just tired of the tortures, poisoning, lost loves, and life in general, in Barcelona. My 2 biggest complaints. 1) one single mention of World War One!!?? And 2) For a trilogy named ‘Cemetery of Forgotten Books’ not much really took place in that building. Much, much more could have been written about the cemetery of books forgotten."}, {"review_sentiment": 5.0, "review_text": "Fantastic! The series - Cemetary of Forgotten Books is wonderful!"}, {"review_sentiment": 4.0, "review_text": "Great book - last one I read from the series. I love the characters and the writing style, couldn't let go of the book. It gets 4 stars because the first 2 are better. The ending of the book feels quite rushed."}, {"review_sentiment": 5.0, "review_text": "Ruiz is surely a genius. These books are beautifully written. I was carried away to Barcelona even though I’ve never been there. This is a modern day classic and will surely be in the list of books you must read before you die. I wish I had never read them just so I could read them again!"}, {"review_sentiment": 4.0, "review_text": "Great read. Zafon is always enjoyable. I read this on in two days!!!"}, {"review_sentiment": 5.0, "review_text": "Excellent book, exceptional story line, well written and read."}, {"review_sentiment": 3.0, "review_text": "I was disappointed.  I'd read the first two Zafon novels and hoped this would be of the same caliber.  In my opinion, it was not.  As others have said, the ending was abrupt and enigmatic.  I often prefer a novel or a movie to conclude open-endedly because it puts the task of an ending in my hands (or mind).  In this case, however, Zafon did not offer enough information, at least for me to enjoy working with my own creative conclusions.The author continues to entertain with his humor and horror and mystery.  I enjoyed reading more about Fermin who was introduced in Shadow of the Myst.My recommendation to those who have not read the first two books of the series is this:  Read them and fall in love with this tremendous author. They can each stand on their own.  Above all, don't start reading Zafon with this novel.  Better yet, as another reviewer has said, wait until the author completes The Prisoner of the Wind. It would be a mistake to judge his other work on the basis of this one."}, {"review_sentiment": 4.0, "review_text": "Good Read."}, {"review_sentiment": 5.0, "review_text": "Wonderful story line.  Keeps your interest right from the start.  Characters are full and rich."}, {"review_sentiment": 5.0, "review_text": "Love this series:)"}]}, "authors": ["Carlos Ruiz Zafón"], "isbn": "006220629X", "longitude": 2.1774322, "periods": ["1900s"], "title": "The Prisoner of Heaven: A Novel", "word_cloud": "not good first great author single page tome time make tired torture poison lose love life general biggest complaint single mention trilogy name much really take place building much much write cemetery series wonderful last series love character write style get star first better end feel quite rush surely genius beautifully write carry away even never modern day classic surely list wish never always enjoyable day excellent exceptional story line well write disappoint first novel hop opinion others say end abrupt enigmatic often prefer movie conclude put task end hand mind case however offer enough information least enjoy work creative author continue entertain humor horror mystery enjoy read introduce recommendation first series fall love tremendous author stand start read yet reviewer say wait author complete judge work basis good read wonderful story line interest right start full rich series", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Once again, internationally acclaimed, New York Times bestselling author Carlos Ruiz Zafón creates a rich, labyrinthine tale of love, literature, passion, and revenge, set in a dark, gothic Barcelona, in which the heroes of The Shadow of the Wind and The Angel's Game must contend with a nemesis that threatens to destroy them.", "asin": "006220629X", "rank": "38922", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/516r2r%2BKd3L.jpg", "country": "Spain", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}