{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 8, "rating": 3.4, "reviews": [{"review_sentiment": 4.0, "review_text": "This is a good story about different reactions to the slave trade by a father and son stolen from their home in Africa and brought to Jamaica. The way they respond to their new environments (on 2 different plantations 20 miles apart) are so different. It is interesting to learn what is important to each, and see how they adapt. And it is interesting to make some comparisons between the slave system in Jamaica vs American by reading this. The only problem I had with this book is the lack of chapters. It is just one long story with the occasional break of a blank line between paragraphs. Otherwise this is an excellent relatively short book that presents the fictional lifes of two slaves."}, {"review_sentiment": 1.0, "review_text": "I did not like this book, it was boring. There was no action.I only like Science Fiction books, or non Fiction."}, {"review_sentiment": 4.0, "review_text": "This book is very different and it's not something I would normally read. But it was nice to get out and read different things I don't always think about.  It gives the imagination fuel to burn. And the book was very cultured. I would recommend this book to people that like books with different cultures."}, {"review_sentiment": 3.0, "review_text": "Overall I think that this was an ok book and it was pretty informative and showed people what it was like back when there was slaves. I would recommend this book but probably to a little lower grade level,like fourth or fifth grade since it was so short."}, {"review_sentiment": 5.0, "review_text": "I think the book was interesting because I learned alot more about slavery and what could happen if your not careful."}, {"review_sentiment": 4.0, "review_text": "It was a good book because it showed what life was like for slaves from a slave's point of view."}, {"review_sentiment": 5.0, "review_text": "Imagine you were born a free individual, to one day have your freedom taken away.  As you prepared for your wedding, both you and your father decided to take a gift to the family whose son or daughter you were to marry.  On your way there, both you and your father are captured, seized, and sold into slavery to different slave owners.  Your identity, as well as your family, culture and customs are apprehended.  You are assigned a new name and family.  You are told what to do and when to do it.  Confusion, sadness, and rage overcome you to the point that you contemplate rebellion.  Ajeemah and his son Atu faced these harsh conditions on the plantations of Jamaica, where they were shipped to after they were captured from Africa and sold.  Although Atu did not get the opportunity to experience freedom after being enslaved, Ajeemah persevered and celebrated freedom when he and the rest of the slaves were emancipated.  Through the harsh conditions both Ajeemah and Atu endured, they managed to maintain their dignity and humanity under the cruelest of circumstances.This is an excellent book in which the history of the slave trade is depicted in a very descriptive manner.  For teachers, this book can serve as a means for a reading lesson and integrated into a social studies lesson on the slave trade.  I highly recommend that children of all ages read this book about inner strength, courage, perserverance, family, and culture."}, {"review_sentiment": 5.0, "review_text": "It's difficult, I think, for most modern white people to spend much time considering slavery without feeling some kind of unnamed, innate guilt, or for modern people of African descent to do so without some anger and  resentment. Ajeemah and His Son presents an unflinching look at Caribbean  slavery that makes any reader want to weep at the injustice perpetrated in  the name of colonial profiteering. The writing is quite skillful (the  author has won those awards for a reason, after all), and weaves the two  stories together gracefully. Between Ajeemah and his son Atu, one of them  will assimilate and become part of the new class of African descendants  populating the New World, while one will actively resist assimilation until  his dying day. There is a nice connection made near the end indicating how  future generations will view their African heritage. Aimed at children,  this book might be a hard one for parents to share with their kids...there  is some brutal stuff here. But then, isn't it better to learn about the  mistakes of history so they won't be repeated?"}]}, "authors": ["James Berry"], "isbn": "0064405230", "longitude": 0.0, "periods": ["1800s"], "title": "Ajeemah and His Son", "word_cloud": "good story different reaction slave trade father steal home bring way new environment different plantation mile apart different interest learn important see adapt interesting make comparison slave system read problem lack chapter long story occasional break blank line paragraph excellent relatively short present fictional file slave like bore non fiction different something normally nice different thing always think give imagination fuel burn culture people different culture overall think ok pretty informative show people back slave probably little lower grade level fourth fifth grade short think interest learn a lot slavery careful good show life slave slave point view bear free individual day freedom take away prepared wedding father decide gift family daughter marry way father capture seized sell slavery different slave owner your identity well family culture custom apprehend assign new name family tell sadness rage overcome point contemplate rebellion face harsh condition plantation ship capture sell get opportunity experience freedom enslave persevere celebrate freedom rest slave emancipate harsh condition endure manage maintain dignity humanity cruelest excellent history slave trade depict descriptive manner teacher serve mean read lesson integrate social study lesson slave trade highly recommend child age inner strength courage perseverance family culture difficult think modern white people spend much time consider slavery feel kind unnamed innate guilt modern people african descent anger resentment present unflinching look caribbean slavery make want weep injustice perpetrate name colonial profiteer write quite skillful author award reason weave story together gracefully assimilate part new class african descendant populate actively resist assimilation die day nice connection make end indicating future generation view african heritage child parent share kid brutal stuff better learn mistake history", "genres": ["Fiction & Literature", "Historical Fiction", "Young Adult"], "summary": "In 1807, at the height of the slave trade, Ajeemah and his son, Atu, are snatched by slave traders from their home in Africa while en route to deliver a dowry to Atu's bride-to-be. Ajeemah and Atu are then taken to Jamaica and sold to neighboring plantations never to see one another again. \r\n\r\nReaders will come away with a new sense of respect for those who maintained their dignity and humanity under the cruelest of circumstances.\r\n\r\n1993 Books for the Teen Age (NY Public Library)", "asin": "0064405230", "rank": "245924", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/51brDv-jbjL.jpg", "country": "Ghana", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}