{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 12, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "great story, loved the book and the immersive feel into that era that it has. recommended"}, {"review_sentiment": 3.0, "review_text": "This story was alright. I don't connect to male characters very much, and I didn't really get into this as much as Woman in Berlin."}, {"review_sentiment": 4.0, "review_text": "I've seen the movie a couple of times and read the book (in German) and wanted to share it with friends who didn't speak German. I read through it and the translation kept bothering me, but I feel translations seldom live up to the original. An artful translation, after all, is something that only truly be appreciated by someone who doesn't need it. It would be five stars with a better translation.The book is still great, especially for anybody who has spent any time in Berlin, but if you're giving it as a gift to a Germanophone recipient, buy the original text. The informal style and writing also make the German version suitable for people who are still learning German."}, {"review_sentiment": 5.0, "review_text": "This book is not for everybody -- if you don't have a sense of humor, or if you don't like trying new things, or you're offended by profanity -- you may not like this book.That said, this book is AWESOME.  It'll have you absolutely crying with laughter.  Frank Lehmann is one of the best main characters I've ever read.  His honesty gives him a uniquely interesting perspective and insight.The only problem is that the quality of the translation is not quite what it should be."}, {"review_sentiment": 4.0, "review_text": "For starters, I'm not sure if you need to have some experience with the city itself to fully appreciate the book. My guess from some of the reviews is, it would certainly be helpful. Secondly, it was written in a language that, in some cases doesn't translate fully into English. This in and of itself makes some of the absurdity...well, less absurd (his friends call him Herr, but by his real name only in serious situations!).There is local context, and if you are familiar with the city or its history in regards to those areas, it really helps in appreciation. A fair representation of the dating scene, artists, and the youth culture of the city. A good read in general."}, {"review_sentiment": 3.0, "review_text": "I bought the book in anticipation of an upcoming trip to Berlin.  It takes place in 1980's West Berlin, but doesn't have much local context.  Instead the book is a 20-something bartending narrator's self-absorbed tribulations that will inevitably end in some coming-of-age climax, but I didn't stick around to find out.  If you like this genre, stick with High Fidelity."}, {"review_sentiment": 5.0, "review_text": "I haven't read it.  However, I have read the original German novel and seen the movie. I am reading another book by the same author that would probably be called The Little Brother in English. It is about Herr Lehrmann, the central figure in Berlin Blues,at an earlier time in his life.  I have been laughing constantly. Actually, I haven't laughed so hard since I read Herr Lehrmann (Berlin Blues) last year.I was very pleased to find an English translation and will be ordering it soon to share with my sister and some friends back in the States this summer. If the translation has captured the tone and humor of the original it I am sure they will enjoy it.  In reference to another reviewer's comment about the book being for Berlinophils,  I have to say that it is not necessary to know Berlin to enjoy this book. On the other hand, knowledge of the 70's and 80's; and, an awareness of the type of artistic and somewhat anarchist counter culture one encountered those days would definitely help readers to understand and enjoy this book."}, {"review_sentiment": 4.0, "review_text": "Not much to say. I got this boo for a German Lit class, and I actually liked it. One of the few I did. It's worth a read for anyone who is interested in Germany, or just Historical Fiction."}, {"review_sentiment": 5.0, "review_text": "One of my favorite books. You might get more out of it if you understand a bit about German culture.Calling someone \"Mr.\" and using the informal version of you is a contradiction in German. Combination of formal and informal. When Frank's friends start calling him Mr. Lehmann when he turns 30, it is a bit joke.I highly recommend watching the movie (Herr Lehmann). One of those few examples where the movie really represents the book well. Plus, it has a great soundtrack! Herr Lehmann [ NON-USA FORMAT, PAL, Reg.2 Import - Germany ]"}, {"review_sentiment": 5.0, "review_text": "This Kafka-esque book is a story about love, identity, and the German people. Herr Lehmann's friend Karl has been working in a bar for years, finally lines up a show for his art at a gallery, but has a break-down beforehand. He's freaked out by the possibility of failure to the point where he misses out on this chance for success. There are also numerous funny, philosophical debates."}]}, "authors": ["Sven Regener"], "isbn": "0099449234", "longitude": 13.3888599, "periods": ["1900s"], "title": "Berlin Blues", "word_cloud": "great story love immersive feel era recommend story alright connect male character much really much see movie couple time german want share friend speak german translation bother feel translation seldom live original artful translation something truly appreciate someone need star better still great especially anybody spent time give gift recipient buy original informal style writing also make german version suitable people still learn german everybody sense humor try new thing offend profanity say absolutely cry laughter best main character ever honesty give uniquely interesting perspective problem quality translation quite starter sure need experience city fully appreciate guess review certainly secondly write language case translate fully english make absurdity well le absurd friend call real name serious situation local context familiar city history regard area really help fair representation date scene artist youth culture city good general buy anticipation upcoming trip take place much local context instead bar tending narrator tribulation inevitably end climax stick around find genre stick however original german see movie read author probably central figure earlier time life laugh constantly actually laugh hard last pleased english translation order soon share sister friend back summer translation capture tone humor original sure reference reviewer comment say necessary know enjoy hand knowledge awareness type artistic somewhat anarchist counter culture encountered day definitely reader understand enjoy not much say get boo german class actually like anyone interested favorite understand bit german someone use informal version contradiction german formal informal friends start call turn bit highly recommend watch movie examples movie really represent well great soundtrack story love identity german people friend work bar year finally line show art gallery beforehand freak possibility failure point miss chance success also numerous funny philosophical debate", "genres": ["Fiction & Literature"], "summary": "It's 1989 and, whenever he isn't hanging out in the local bars, Herr Lehmann lives entirely free of responsibility in the bohemian Berlin district of Kreuzberg. Through years of judicious sidestepping and heroic indolence, this barman has successfully avoided the demands of parents, landlords, neighbours and women.\r\n\r\nBut suddenly one unforeseen incident after another seems to threaten his idyllic and rather peaceable existence. He has an encounter with a decidedly unfriendly dog, his parents threaten to descend on Berlin from the provinces, and he meets a dangerously attractive woman who throws his emotional life into confusion.\r\n\r\nBerlin Blues is a richly entertaining evocation of life in the city and a classic of modern-day decadence.", "asin": "0099449234", "rank": "1246183", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51gC8Gz9sSL.jpg", "country": "Germany", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}