{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 5, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Wonderful writing, sweeps you to Istanbul, the Galatea Bridge(s) across time and lives. Just wonderful"}, {"review_sentiment": 3.0, "review_text": "Well written; good translation, about the bridge between E and W."}, {"review_sentiment": 4.0, "review_text": "This was recommended in Norman Stone's \"Turkey: A Short History,\" so I figured he knew what he was talking about. Fluidly rendered from the Dutch by Sam Garrett, this flows like the Golden Horn beneath the Galata Bridge. Geert Mak combines interviews, impressions, and information gleaned from historians (and a poet's verse is included) to illustrate the pull of this symbol between East and West. It can bog down in recitations of facts, but the curiosity Mak shows enables him, like a tour guide, to press on.The results are pleasant. Yet the author tries to get beyond first impressions. The bridge can be shrouded and damp, full of those muttering insults at tourists unable to understand them. Crime abounds and schemes to separate money from strollers abound.During a time of strife, Mak analyses Turkey as caught between the east bank's tradition and the west bank's modernity. Those who fish, hang out, pickpocket, hawk, or work the bridge appear to yearn to emigrate, But as Mak shows, the tension of honor and tradition keep a strong hold even on many who leave Istanbul and the countryside behind for the European destinations.Mak regards the Turkish ingrained sense of honor as \"social currency,\" and \"a matter of black and white, virgin or whore, insider or exile--a completely different world of thought from the subtle, analytical, eternally ambivalent considerations typical of the liberal West.\" (96) Lest you accuse him of Orientalism, reflect on this metaphor. During 1895, Armenian revolutionaries sought to disrupt and take over the capital, and counter-measures were equally violent. \"As old, parochial Islambol fell apart, its citizens sensed the approaching demise and reacted like respectable passengers on a listing ocean liner: discreetly, but with determination, they hopped the railing and boarded the shiny, modern dream that had drawn up aside.\"(63) Fresh images like this enliven The Bridge."}, {"review_sentiment": 5.0, "review_text": "Super insight and understanding of the culture and life at the bridge, the City and the historical/ Modern Turkey. Great book."}, {"review_sentiment": 4.0, "review_text": "\"The bridge\" is the Galata Bridge, across the Golden Horn, connecting the two oldest districts of Istanbul.  In 2006, Dutch journalist and travel-writer Geert Mak spent weeks hanging around the Galata Bridge, mingling with and talking to the flotsam and jetsam of vendors who peddle a gallimaufry of wares there.  THE BRIDGE is a short (145 pages), literate account of what Mak saw and heard on the Galata Bridge, interspersed with an overview of the history of Istanbul and, to a lesser extent, Turkey.I would highly recommend this book to anyone planning on visiting Istanbul in the near or intermediate future (although by no means is it a travel guide).  For someone simply interested in contemporary Istanbul or Turkey, THE BRIDGE probably should be rewarding but I rather doubt that it is the single best book.  As a history, the book is instructive but hardly comprehensive.  The strength of the book is the anecdotal evidence it provides of life among the hoi polloi of Istanbul - here, the peddlars of books, cigarettes, umbrellas, perfume, and insoles - and their views on the contemporary conflicts between West and East (or Middle East), and between the secular Christian world and what in Istanbul at least appears to be a rather secular Muslim world.  Of the vendors with whom Mak visited, only one might be characterized as a fundamentalist, but for all, Islam was \"above all a feeling that binds them in their complicated relationship with the affluent West.\"  \"Anyone who mocks their god * * * is not insulting an institution or even a religious feeling; no, he is dealing a blow to their deepest sense of personal worth, the last bastion against total humiliation.\"In providing such anecdotal evidence, in a readable and literate fashion, the book serves as a building block of a bridge to understanding."}]}, "authors": ["Geert Mak"], "isbn": "009953214X", "longitude": 28.9651646, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s", "500-1400s", "0-500s"], "title": "The Bridge: A Journey Between Orient and Occident", "word_cloud": "wonderful write sweep time live just wonderful well write good translation bridge recommend figure know talk fluidly render flow beneath combine interview impression information glean historian poet verse include illustrate pull symbol bog recitation fact curiosity show enables tour guide press result pleasant author try get first impression bridge shroud damp full muttering insult tourist unable understand abound scheme separate money stroller time strife analyse catch east bank tradition west bank modernity fish hang pickpocket hawk work bridge appear yearn emigrate show tension honor tradition strong even many leave countryside european regard turkish ingrain sense honor social currency matter black white virgin whore insider exile completely different world think subtle analytical eternally ambivalent consideration typical liberal reflect metaphor armenian revolutionary seek disrupt take capital equally violent old parochial fell apart citizen sense approach demise react respectable passenger list ocean liner discreetly determination hop rail board shiny modern dream drawn aside image enliven bridge insight understanding culture life bridge bridge connect oldest district journalist spend week hang around mingle talk flotsam jetsam vendor peddle gallimaufry war short page literate account saw intersperse overview history lesser extent highly anyone plan visit intermediate future mean travel guide someone simply interested contemporary probably reward rather doubt single best history instructive hardly comprehensive strength anecdotal evidence provide life ho poll oi paddlers cigarettes umbrella perfume insole view contemporary conflict secular world least appear rather secular world vendor visit fundamentalist feeling bind complicate relationship affluent anyone mock god insulting institution even religious feel deal blow deepest sense personal worth last bastion total humiliation provide anecdotal evidence readable literate fashion serf build block bridge understanding", "genres": ["History", "Travel Writing", "Social & Cultural Studies"], "summary": "Istanbul’s Galata Bridge has spanned the Golden Horn since the sixth century AD, connecting the old city with the more Western districts to the north. But the bridge is a city in itself, peopled by merchants and petty thieves, tourists and fishermen, and at the same time a microcosmic reflection of Turkey as the link between Asia and Europe. \r\n\r\nGeert Mak introduces us to the woman who sells lottery tickets, the cigarette vendors, and the best pickpockets in Europe. He tells us about the pride of the cobbler and the tea-seller's homesickness. And he describes the role of honor in Turkish culture, the temptations of fundamentalism and violence, and the urge to survive, even in the face of despair. \r\n\r\nThese stories of the bridge’s denizens are interwoven with vignettes illuminating moments in the history of Istanbul and Turkey and shedding light on Turkey’s relationship with Europe and the West, the Armenian question, the migration from the Turkish countryside to the city, and the demise of the Ottoman Empire.", "asin": "009953214X", "rank": "1520671", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/41qD4JdRlhL.jpg", "country": "Turkey", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}