{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": -27.4689682, "ratings": {"num_ratings": 4, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Evocation of a different Australia. Childhood memories of a home lovingly written.Then onto Tuscany and a different life.Why then India? Too brief - or was it necessary?Although personal reminiscences of places, I longed to hear more of David."}, {"review_sentiment": 5.0, "review_text": "Brilliant, as always!"}, {"review_sentiment": 4.0, "review_text": "David Malouf takes the reader on an in-depth journey testing his memory of  his first home, family and friends. An enjoyable experience in which  he not only recalls facts relating to what he had imagined to have taken in as a child (memory can play tricks on the individual) but he recalls facets of social change and challenges as well as amusing details of friends features and habits. This ability to understand culture is taken further when he describes his experience In Italy. Further life experiences are described in great detail and humour. A delightful expose of certain periods of the author's life fascinates the reader to the end."}, {"review_sentiment": 3.0, "review_text": "Oh gosh I was disappointed in this book!  I had to track it down because I was really inspired to read it by my interest in all things Australian recently.  But..... this is not an autobiography in any sense of the word; it consists of bits and pieces of information about places where Malouf has lived over the years, and the writing seems almost flight of fancy....  I guess it's based on truth?  I was very disappointed because of ALL the fabulous autobiographical writing to come out of Australia.  This doesn't measure up by a long shot.  Sorry.  I hate to give poor reviews, but I also hate being disappointed in books...."}]}, "authors": ["David Malouf"], "isbn": "0099273780", "longitude": 153.0234991, "periods": ["1900s"], "title": "12 Edmondstone Street", "word_cloud": "different memories home lovingly different brief necessary personal reminiscence place long hear always take journey test memory first home family friend enjoyable experience recall fact relate imagined take child memory play trick individual recall facets social change challenge well amuse detail friend feature habit ability understand culture take describes experience life experience describe great detail humor delightful expose certain period author life fascinates end gosh disappoint track really inspired interest thing australian recently autobiography sense word consist bit piece information place live year write seem almost flight fancy guess base truth disappoint fabulous autobiographical write come measure long shot hate give poor review also hate disappointed", "genres": ["Memoir", "History", "Literary Theory & Criticism"], "summary": "Each house, like each place, has its own topography, its own lore. A complex history comes down to us, through household jokes and anecdotes, odd family habits, and irrational superstitions, that forever shapes what we see and the way in which we see it.\r\n\r\nBeginning with his childhood home, David Malouf moves on to show other landmarks in his life, and the way places and things create our private worlds. Written with humour and uncompromising intelligence, 12 Edmondstone Street is an unforgettable portrait of one man's life.", "asin": "0099273780", "rank": "10817019", "city": "Brisbane", "image": "https://images-na.ssl-images-amazon.com/images/I/516K7DCApzL.jpg", "country": "Australia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}