{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 19, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "this book is a masterpiece but I didn't finish it"}, {"review_sentiment": 2.0, "review_text": "Too many typos in kindle version."}, {"review_sentiment": 5.0, "review_text": "This is a frightfully beautiful and powerful book. It is the fourth of P.W. novels, the second of his \"canonical\" books and the one that achieved his critical break through as an important writer when it was first published in 1955 in the U.S. and England (Australia, whose only Nobel Prize winner in literature he was to become 18 years later, never seems to have warmed up to it.) The title of the novel is taken from one of A. E. Houseman's poems that deals with the fleetingness and at the same time the resilience of human life. Here it is the life of an Australian farming couple in the early 20th century. The story begins with the homesteading of the young couple, and at first one has the feeling of being faced with another pioneering venture in the wilds (Willa Cather's \"My Antonia\" might come to mind). But after a while one senses a very different trajectory. Stan and Amy Parker are a loving, hard working, robust, and reliable couple--and yet, the more we get to know them, the more we sense the unavoidable loneliness and lack of understanding that surrounds and separates them from each other, from the reality around them, and from a longed-for sense of what their life might actually be about. This loneliness also seems to be the fate of their children (the prim and prissy Thelma and the good-for-nothing Ray) and all of the other characters that transcend the shallowness of middle class Australia, usually the poor, the disadvantaged, and often the mentally retarded.  Stan, the true hero of the novel, is the character most directly in search of that meaning, that answer to the mystery of life and reality. His search is one of simplicity, stillness, and humility, a groping, not an intellectual endeavor. Neither marriage, nor family life, nor moderate farming success, nor old age seem to get him closer to this ever elusive goal. One of my favorite passages late in the novel arises from his sudden desire to go to Sunday church service, accompanied by his wife and grown-up daughter, who are shamed into it. The description of how these three so very different human beings use this church service to search for any sort of grace, belief, deeper meaning, resolution, or at least a momentary fulfillment of sorts is both deeply moving and tragicomic. In the end, none of the searchers--and there are several others of very different caliber and determination--is given the secret code by which to read the meanings of their fates, families, friends, or neighbors. And yet, this is not a gloomy, existentialist novel because the intensely felt lack of ultimate understanding is at the same time experienced as the recognition of such a meaning's necessary existence, just as some desires are so intense that they foreshadow, vouchsafe their fulfillment. It might be worthwhile noting, that White, whose own excursions into established religions proved futile for him, describes in Stan Parker at least part of the religious quest that he himself pursued all his life without assuming any assurance of success."}, {"review_sentiment": 5.0, "review_text": "Although some of the language is archaic this novel remains a masterpiece if you enjoy an exploration of the human condition. This is not plot driven. It follows the lives of a working- class couple eking out an existance in an area near Sydney. During the course of the novel they raise two children and watch the area in which they live turn from rural to outer suburban. White has a magical way with words and some of his characters thoughts on feelings of love failure, success, love, death and the meaning of existance are profound."}, {"review_sentiment": 4.0, "review_text": "a bit slow at times but very interesting"}, {"review_sentiment": 4.0, "review_text": "A very great but ultimately sad book, of hardship. An Australian Classic"}, {"review_sentiment": 3.0, "review_text": "Read for the Book Group. Very densely packed, it had to be read in small doses and slowly. A wealth of characters and minute observations. It traces the life of a husband and wife in the Australian outback as they have children and their isolated community grows into a sizeable village, with the consequent interaction of people.It includes the sterility of their religious experience and their common humanity in times of natural disasters. I didn't have enough patience to give this book all the concentration and the time it required but I shall be interested to see what other people in the group say when it is discussed."}, {"review_sentiment": 4.0, "review_text": "Placid rural saga carved by the axe of Stan Parker. More poetically, the country life of his family may be called a true pastoral symphony. Urban-minded next generation, son and daughter, can no longer follow Stan Parker's quiet way of life."}, {"review_sentiment": 5.0, "review_text": "An important read.  I also recommend The Solid Mandala by Patrick White."}, {"review_sentiment": 2.0, "review_text": "Sad story. No real break in the misery. Well written. It took a long time to finish. Not a page-turner."}]}, "authors": ["Patrick White"], "isbn": "0099324512", "longitude": 151.2164539, "periods": ["1900s"], "title": "The Tree of Man", "word_cloud": "masterpiece finish too many typo kindle version frightfully beautiful powerful fourth novel second canonical achieve critical break important writer first publish winner literature year later never seem warm title take poems deal fleetingness time resilience human life here life australian farm couple early century story begin homestead young couple first feeling face pioneering venture wild mind sense different trajectory love hard work robust reliable couple yet know sense unavoidable loneliness lack understand surround separate reality sense life actually loneliness also seem fate child prim prissy character transcend shallowness middle class usually poor disadvantage often mentally retarded true hero character directly search mean mystery life reality search simplicity stillness humility grope intellectual endeavor marriage family life moderate farming success old age seem closer ever elusive goal favorite passage late arises sudden desire go church service accompany wife daughter sham description different human being use church service search sort grace belief mean resolution least momentary fulfillment sort deeply move tragicomic end none searcher several others different caliber determination give secret code meaning fat family friends neighbor yet gloomy existentialist intensely felt lack ultimate understanding time experienced recognition mean necessary existence desire intense foreshadow vouchsafe fulfillment note excursion establish religion prove futile describes least part religious quest pursue life assume assurance success language archaic remain masterpiece enjoy exploration human condition plot drive follow live class couple eking existence area course raise child watch area live turn rural outer suburban magical way word character thought feeling love failure success death meaning existence profound bit slow time interest great ultimately sad hardship australian classic densely pack small dos slowly wealth character minute observation trace life husband wife australian outback child isolate community grow sizable village consequent interaction include sterility religious experience common humanity time natural disaster enough patience concentration time require interested see people group say discuss rural saga carve ace poetically country life family true pastoral symphony next generation son daughter longer follow quiet way life important also recommend story real break misery write take long time finish not", "genres": ["Fiction & Literature"], "summary": "Stan Parker, with only a horse and a dog for company journeys to a remote patch of land he has inherited in the Australian hills. Once the land is cleared and a rudimentary house built, he brings his wife Amy to the wilderness. Together they face lives of joy and sorrow as they struggle against the environment.\r\n\r\nThe novel is one of three by White included in 1001 Books You Must Read Before You Die. The others are Voss and The Living and the Dead.", "asin": "0099324512", "rank": "835398", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/517c8YSAKEL.jpg", "country": "Australia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}