{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 127, "rating": 3.7, "reviews": [{"review_sentiment": 1.0, "review_text": "I read about half of this book notwithstanding its racism and gore.  The fascination of the abomination I guess.  I finally couldn't take any more of its insane conspiracy theorist plots and wooden characters.  Don't bother with this one it is vile trash."}, {"review_sentiment": 4.0, "review_text": "Not Ellroy’s best but still very good. Female characters are just as complex as the men."}, {"review_sentiment": 2.0, "review_text": "Gave it to our exchange library after reading about 80 pages.  Just couldn't get into Elroy's style.  Too many other really good books to read."}, {"review_sentiment": 5.0, "review_text": "This is a must read if you've read the first 2."}, {"review_sentiment": 5.0, "review_text": "Loved it"}, {"review_sentiment": 2.0, "review_text": "I finally made my way through the Underworld Trilogy. I never bothered reviewing the middle volume, and my review of the third volume will be very similar to my review of the first volume. There are far too many characters, and the characters are not fully developed. As a result the characters all seem to run together. Pete Bondurant = Dwight Holly = Wayne Tedrow. Karen = Celia = ??? And what is it that motivates these characters? I couldn't tell you because they just aren't properly developed.I'm not giving up on Ellroy yet. The next book I read will be his first novel - perhaps the writing style is different (better)."}, {"review_sentiment": 5.0, "review_text": "The brilliant final installment of James Ellroy're remarkable \"American Underworld\" trillogy. This is a mind-blowing work, epic in scope and detail, blending historical fact and fiction from the 1950s and 60s with unforgettable fictional characters. Some people will object to how fast and loose Ellroy plays with historical events like the Kennedy-King assassinations but once you buy into this as a fictional portrait of an American that was a much more dark and violent place than it is often portrayed you may be able to live with that. Or you can just read this as a nonpareil exercise in crime writing, full of familiar cultural references and outlandish - and often VERY funny - characters and episodes. A great accomplishment."}, {"review_sentiment": 5.0, "review_text": "Ellroy is not for everyone. Very dark, very pessimistic, very violent. But if that sounds like you, Ellroy is your man. Aside from anything else, he is an astonishing stylist. His \"telegraph\" style makes Hemingway look like Proust."}, {"review_sentiment": 5.0, "review_text": "Just like Ellroy should be - a hurtling ride, hairpin bends, imagination and real life in the blender...hold on tight; it's worth it."}, {"review_sentiment": 1.0, "review_text": "Does not keep your interest.  He is supposed to be a great writer but his style is choppy, uninteresting and just plain awful.  I think there was a theme to his book but I could not find it.  I do not think I will ever spend another minute reading his books and it makes me wonder who would and why.  I doubt if I could read his books even if I was trapped on an airplane for three days.  A couple of pages and I am beyond done.  This is an author that I just cannot understand.  I would rather be enjoying nature.  He is the pits!"}]}, "authors": ["James Ellroy"], "isbn": "0099537796", "longitude": -118.244476, "periods": ["1900s", "Recent Releases"], "title": "Blood's a Rover", "word_cloud": "half notwithstanding racism gore fascination abomination guess finally insane conspiracy theorist plot wooden character do bother vile trash not best still good character complex men exchange library reading page style many really good love finally make way never bother review middle volume review third volume similar review first volume far many character character fully develop result character seem together motivate character properly give yet next first perhaps write style different better brilliant final installment remarkable american trilogy work epic scope detail blend historical fact fiction unforgettable fictional character people object fast loose play historical event assassination buy fictional portrait american much dark violent place often portray able live exercise crime write full familiar cultural reference outlandish often funny character episodes great accomplishment everyone dark pessimistic violent sound man anything else astonish telegraph style make look just hurtle ride hairpin bend imagination real life blender hold tight worth do interest suppose great writer style choppy uninteresting plain awful think theme think ever spend minute reading make wonder even trap day couple page do author understand rather enjoy nature pit", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Book 3/3 in Underworld USA series\r\n\r\nThe internationally acclaimed author of the L.A. Quartet and The Underworld USA Trilogy, James Ellroy, presents another literary noir masterpiece of historical paranoia.\r\n\r\nA rip-roaring, devilishly wild ride through the bloody end of the 1960's. It's dark baby, and hot hot hot.\r\n \r\nMartin Luther King assassinated. Robert Kennedy assassinated. Los Angeles, 1968. Conspiracies theories are taking hold. On the horizon looms the Democratic Convention in Chicago and constant gun fire peppers south L.A. Violence, greed, and grime, are replacing free-love and everybody from Howard Hughes, Richard Nixon and J. Edgar Hoover to the right-wing assassins and left-wing revolutionaries are getting dirty. At the center of it all is a triumvirate: the president’s strong-arm goon, an ex-cop and heroine runner, and a private eye whose quarry is so dangerous she could set off the whole powder keg. With his trademark deadly staccato prose, James Ellroy holds nothing back in this wild, startling and much anticipated conclusion to his Underworld USA trilogy.", "asin": "0099537796", "rank": "8144437", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51dx0vdmvzL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}