{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 62, "rating": 3.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Celia joslyn.  This of a wonderful book. I agree that the happiest  women are the ones who marry for love."}, {"review_sentiment": 4.0, "review_text": "Delightful read."}, {"review_sentiment": 3.0, "review_text": "Terribly verbose 19th century writing style; dated subject matter, but one perspective on the follies of some in the suffragette movement, and spiritualism in particular.Interesting for it's historical renderings and analyses."}, {"review_sentiment": 4.0, "review_text": "Another book about another time"}, {"review_sentiment": 2.0, "review_text": "Going in I knew that Henry James was wordy and detailed.  It continues in this book.  Inner thoughts and motivations told from the narrator's perspective makes up the style here.  All standard James.  But this story could be used as a means to annoy anyone who is even remotely feminist.  It would work to test the patience and tolerance of most everyone I know.  I won't do a spoiler here but the conclusion is unnecessarily dismal.  However, if you want to improve your vocabulary read this book with a dictionary handy.  Henry James could certainly write and it's worth spending time with him.  But choose a different book."}, {"review_sentiment": 5.0, "review_text": "great read"}, {"review_sentiment": 1.0, "review_text": "print too small to read, was not formatted, rather PDFs of word docs ... gross  I complained, had great experience, told to keep book and look for credit on my credit card."}, {"review_sentiment": 1.0, "review_text": "Too much false ideals.  Hero annoying and heroine too placid and easily manipulated. Tedious ppgs of a character's thought  process"}, {"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 2.0, "review_text": "Although I usually enjoy  some of this author' work , this particular novel is tedious and I forced myself to finish it otvof principle . It has age showing ."}]}, "authors": ["Henry James"], "isbn": "0140437665", "longitude": -71.0595678, "periods": ["1800s"], "title": "The Bostonians", "word_cloud": "roslyn wonderful agree happiest woman one marry delightful terribly verbose century write style date subject matter perspective folly suffragette movement spiritualism historical rendering analysis time go know detail continue thought motivation tell narrator perspective make style standard story use mean annoy anyone even remotely feminist test patience tolerance everyone know conclusion unnecessarily dismal however want improve vocabulary dictionary handy certainly spending time different great print small format rather word doc gross complain great experience tell look credit credit card too much false ideal annoy heroine placid easily manipulate peg character think process excellent usually enjoy author work particular tedious force finish otvof principle age show", "genres": ["Fiction & Literature"], "summary": "‘There was nothing weak about Miss Olive, she was a fighting woman, and she would fight him to the death’\r\n\r\nBasil Ransom, an attractive young Mississippi lawyer, is on a visit to his cousin Olive, a wealthy feminist, in Boston when he accompanies her to a meeting on the subject of women’s emancipation. One of the speakers is Verena Tarrant, and although he disapproves of all she claims to stand for, Basil is immediately captivated by her and sets about ‘reforming’ her with his traditional views. But Olive has already made Verena her protégée, and soon a battle is under way for exclusive possession of her heart and mind. The Bostonians is one of James’s most provocative and astute portrayals of a world caught between old values and the lure of progress.\r\n\r\n“As devastating in its wit as it is sharp in its social critique of sexual politics. No writer in America had dared the subject before. No one has done it so well since.” The New Republic", "asin": "0140437665", "rank": "399670", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/41WzmQYYU1L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}