{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 43, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Great!"}, {"review_sentiment": 4.0, "review_text": "Ah, life in the medieval swamp."}, {"review_sentiment": 5.0, "review_text": "Excellent price. OK translation"}, {"review_sentiment": 5.0, "review_text": "Perfect for our school needs. Price was good for not having to run all over the major metro finding everything we needed."}, {"review_sentiment": 2.0, "review_text": "To be honest, I thought this book would be more about court life, and less about the actual traits of a courtier. Much of what was in this book was not what I was expecting; kind of like expecting a class to teach about courtroom procedures and how to best use them, but then being told all about how to present oneself in court. Of course, looking good, having a nice voice, being of good breeding, knowing how to dress, maybe play music, and education are helpful, but not in this book when one knows those traits are helpful wherever you go. If this was the book on what went on in the courts, and knowing how the condottiere ran the battlefields, no wonder every nation could invade the Italian peninsula!"}, {"review_sentiment": 5.0, "review_text": "This is a book I would recommend young people to read.This describes how to form your behavior,thoughts and outfit in the world,Even todayThis is suitable for young men"}, {"review_sentiment": 2.0, "review_text": "Disappointingly, this is a reprint of a very old translation into English.  I do not recommend it."}, {"review_sentiment": 5.0, "review_text": "as promised."}, {"review_sentiment": 5.0, "review_text": "Good read"}, {"review_sentiment": 5.0, "review_text": "a clasic"}]}, "authors": ["Baldesar Castiglione"], "isbn": "0140441921", "longitude": 12.4829321, "periods": ["1500s"], "title": "The Book of the Courtier", "word_cloud": "great life medieval swamp excellent price translation perfect school need good major metro find everything need think court life le actual trait much expect kind expect class teach courtroom procedure best use told present court course look good nice voice good breeding know dress maybe music education helpful know trait helpful wherever go go court know condottiere ran battlefield wonder nation italian peninsula young people describe form behavior thought outfit world even today this suitable young men disappointingly reprint old translation recommend promise good classic", "genres": ["Essay", "Renaissance"], "summary": "\"The courtier has to imbue with grace his movements, his gestures, his way of doing things and in short, his every action.\"\r\n\r\nIn The Book of the Courtier (1528), Baldesar Castiglione, a diplomat and Papal Nuncio to Rome, sets out to define the essential virtues for those at Court. In a lively series of imaginary conversations between the real-life courtiers to the Duke of Urbino, his speakers discuss qualities of noble behaviour – chiefly discretion, decorum, nonchalance and gracefulness – as well as wider questions such as the duties of a good government and the true nature of love. \r\n\r\nCastiglione’s narrative power and psychological perception make this guide both an entertaining comedy of manners and a revealing window onto the ideals and preoccupations of the Italian Renaissance at the moment of its greatest splendour.\r\n\r\nGeorge Bull’s elegant translation captures the variety of tone in Castiglione’s speakers, from comic interjections to elevated rhetoric. This edition includes an introduction examining Castiglione’s career in the courts of Urbino and Mantua, a list of the historical characters he portrays and further reading.", "asin": "0140441921", "rank": "356689", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51GKz0e6CpL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}