{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 42, "rating": 3.6, "reviews": [{"review_sentiment": 2.0, "review_text": "Doyle seems to be writing movie scripts which he's passing off as novels. All dialogue but it needs something more to flesh out the characters, like thoughts, feelings (or actors)."}, {"review_sentiment": 3.0, "review_text": "my wife started to read it but gave up."}, {"review_sentiment": 1.0, "review_text": "The copy I purchased has the WORST font ever!  The print is thick and messy.  Like the ink is globbed on.  I'd return this book but it's too late.  That teaches me to not open a book immediately when it's delivered."}, {"review_sentiment": 1.0, "review_text": "One you can miss along with all his writings"}, {"review_sentiment": 5.0, "review_text": "Well, Jimmy, tell us about the books. They're grand, absolutely grand.A fan of the movie version of The Commitments, I was drawn to The Guts and fell in love again with the whole cast of characters.All three novels in the trilogy have something unique to offer. With The Guts, the four books represent a lasting accomplishment."}, {"review_sentiment": 5.0, "review_text": "Heart-warming and delightful. This is my second read of this trilogy which focusses on the different members of the Rabbite Family ... The colours are vibrant and true to life, awkward in their truth ... you cannot help but love them and want to know what happens next.  Definitely a 5 star read - definitely helpful to understand some Irish slang as a lot of the gems of the story are intricately wrapped in the lingo =)"}, {"review_sentiment": 5.0, "review_text": "He's a great author. I love all these books."}, {"review_sentiment": 3.0, "review_text": "I wish I loved this trilogy, but it got old about halfway through. I lost interest."}, {"review_sentiment": 4.0, "review_text": "Really enjoyed this trilogy featuring the Rabbitte family from a town outside of Dublin. It was the second and third book in the trilogy which really captured my attention.All of the books are written with humor but important themes such as family ties, self respect and friendship are well expressed.I initially had some difficulty with some of the wording but as I read on it was easy to get the gist of what the author was saying. I laughed out loud in places and even though the trilogy was extremely funny there were pertinent themes addressed.Really enjoyed the trilogy overall."}, {"review_sentiment": 5.0, "review_text": "I love this trilogy. I have read it many times and it always makes me laugh out loud. The stories are touching in an everyday human foible sort of way, but they are told with humor. I would recommend Roddy Doyle to anyone."}]}, "authors": ["Roddy Doyle"], "isbn": "0140252622", "longitude": -6.2602732, "periods": ["1900s"], "title": "The Barrytown Trilogy", "word_cloud": "doyle seem write movie script pass novel dialogue need something flesh character thought feeling actor wife start give copy purchase font ever print thick messy ink globed return late teach open immediately deliver miss writing well tell grand absolutely fan movie version draw fell whole cast novel something unique offer represent last accomplishment delightful second focus different member color vibrant true life awkward truth help want know happen next star definitely helpful understand slang lot gem story intricately wrap lingo great author love wish love get old halfway lose interest really enjoyed feature family town second third really capture write humor important theme family tie respect friendship well initially difficulty word easy get gist author say laugh loud place even extremely funny pertinent theme enjoy overall love many time always make laugh story touch everyday human foible sort way tell humor anyone", "genres": ["Fiction & Literature", "Humour"], "summary": "This volume brings together under one cover Roddy Doyle's three acclaimed novels about the Rabbite family from Dublin. \r\n\r\nThe Commitments traces the rapid rise and even more rapid fall of Jimmy Rabbite Jr's unusual soul band. \r\n\r\nIn The Snapper, Sharon Rabbite's pregnancy sparks off intense speculation among her friends and family, but she is determined to reveal the identity of the father in her own time. \r\n\r\nThe Van, set during Ireland's 1990 World Cup attempt, follows the fortunes of Jimmy Sr and his friend Bimbo as they launch their travelling fish'n'chip shop on an unsuspecting Barrytown, learning much about themselves in the process.\r\n\r\n\"Mr. Doyle has made his own the gritty world of modern Dublin.\" New York Times ", "asin": "0140252622", "rank": "174279", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51Rk0k-2YpL.jpg", "country": "Ireland", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}