{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 438, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "The original trilogy of novels, which cover the rise of Hitler and the war's aftermath, are easily the best of the Gunther books, and are best read together (don't worry about the later additions and following the chronology). This is classic noir fiction, and is doesn't get more noir that Fascist Germany.Gunther is a great character, and the books are reminiscent of the equally strong The Good German by Joseph Kanon. Rumor has it, HBO are looking to make an adaptation. Highly recommended"}, {"review_sentiment": 5.0, "review_text": "In addition to being an entertaining read, this eally brings home what that era was like in Germany."}, {"review_sentiment": 5.0, "review_text": "Compelling and engaging. Nothing changes in this world save the arrangement / technology. Ready for his 4th in this series revolving around the Allied powers. Russia Russia Russia."}, {"review_sentiment": 5.0, "review_text": "Kerr 's language and timing combine to provide interesting word pictures throughout.  I am very happy a friend introduced me."}, {"review_sentiment": 4.0, "review_text": "I enjoyed reading these three novels and might go for the others. The historical context is well-wrought and central to the detective plots. All in all, pretty compelling.  That's the good stuff.  On the down side, some of the 'hardboiled' analogies come off as cheesy. More troubling is the unreconstructed sexism and homophobia. Yeah, I know, it's supposed to take place in the 30s and 40s, so realism, blah blah.  But this stuff, esp. the gay-bashing and stereotyping made me wince. The first two in the trilogy are worse on this score than the third.  That said, these novels are unique."}, {"review_sentiment": 5.0, "review_text": "I am glad I came upon a review of this author's work in a recent New Yorker magazine. It is truly excellent Noir as well as interesting historical fiction that does not require an unrealistic suspension of disbelief. The research is evident and the plotting is excellent. It makes me want to return to my own work and and continue my own hybrid of historical fiction and crime Noir."}, {"review_sentiment": 4.0, "review_text": "Kerr is a good story-teller.  The story moves quickly and is detailed enough to give the reader a feel for pre-world war 2 Berlin with out bogging down.  A fun read."}, {"review_sentiment": 5.0, "review_text": "Engaging, enjoyable and informative, it gives a personal context (fictional) for pre-war, war and post WW II in Berlin and Vienna."}, {"review_sentiment": 5.0, "review_text": "Historical context enhances the story line..very noir but great read"}, {"review_sentiment": 5.0, "review_text": "This trilogy was my introduction to theBernie Gunther series. They make good reading and I learn a lot about 1933-45."}]}, "authors": ["Philip Kerr"], "isbn": "0140231706", "longitude": 13.3888599, "periods": ["1900s"], "title": "Berlin Noir: March Violets; The Pale Criminal; A German Requiem", "word_cloud": "original trilogy novel cover rise war aftermath easily best best together worry later addition follow chronology classic nor fiction nor great character reminiscent equally strong good look adaptation recommend addition entertain wally bring home era compel engage change world save arrangement technology ready series revolve power language time combine provide interest word picture happy friend introduce enjoy read novel others historical context central detective plot pretty compelling good stuff side analogy come cheesy more troubling unreconstructed sexism homophobia know suppose place realism blah blah stuff esp stereotype make wince first trilogy worse score third say novel unique glad come upon review author work recent magazine truly excellent well interest historical fiction require unrealistic suspension disbelief research evident plot excellent make want return work continue hybrid historical fiction crime good story move quickly detail enough give feel war bogging fun engage enjoyable informative give personal context fictional war post historical context enhances story nor great trilogy introduction series make good reading learn lot", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Ex-Policeman Bernie Günther thought he'd seen everything on the streets of 1930's Berlin. But then he went freelance, and each case he tackled sucked him further into the grisly excesses of Nazi sub-culture. And even after the war, amidst the decayed, imperial splendour of Vienna, Bernie uncovered a legacy that made the wartime atrocities look lily-white in comparison . . .", "asin": "0140231706", "rank": "22437", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51DcSGFaXZL.jpg", "country": "Germany", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}