{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 194, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "Good informative book on Basque History. More than you'd ever want to know... Good but long..."}, {"review_sentiment": 3.0, "review_text": "The book offers insight into the complicated Basque history of northern Spain.  I could use more illustrations, otherwise it was an OK read for those interested in regional history."}, {"review_sentiment": 3.0, "review_text": "This is a lengthy and detailed accounting of Basque history, language, culinary arts and culture.  I read it over time for many reasons, one of which it can be so detailed as to become tedious.  Having said that, I learned a lot about the basque way of viewing the world and basque trials and tribulations of fitting into a Spanish/French culture yet not conforming to either.  I would recommend it for those interested in history."}, {"review_sentiment": 5.0, "review_text": "Makes me look forward to the trip to northern Spain this fall. Well written and engaging, with so much background information to make the experience an in depth one."}, {"review_sentiment": 5.0, "review_text": "Very interesting history book. I was amazed to discover how little I knew about the Basque people and their suffering.  I was amazed at their tenacity and will to keep their customs and history alive. I recommend reading this book before visiting Spain."}, {"review_sentiment": 3.0, "review_text": "About half this book comes easily up to the high and entertaining standard of Mark Kurlansky's work.  But a great deal of the modern era gets bogged down in petty details of horrible deeds.  Up to the Carlist wars the tale flows smoothly with loads of interesting tid bits.  This is a fascinating nation, one of the nations of the world which has remained a nation without being able to form a country.I just think he got bogged down in the repression imposed by Spain on Basqueland, the execution, and arrests, the shootings, murders and bombings.  These are all important parts of the Basque history but the history goes back 2,000 years and more.But I am not discouraged.  This is Kurlansky book number three for me.  Going to order out his book on the Caribbean next."}, {"review_sentiment": 3.0, "review_text": "The content of the book is great. However, the narrator in the Audible version (George Guidall) does a poor job pronouncing Spanish names and words, noticeably detracting from Mr. Kurlansky's work. I'm fluent in both English and Spanish and many times I had trouble understanding the narrator. Please consider replacing him with someone who is bilingual."}, {"review_sentiment": 5.0, "review_text": "I completely enjoyed this book. It was very informative."}, {"review_sentiment": 3.0, "review_text": "I greatly enjoyed the history but didn't think the book particularly well-written.  At times, it jumped around with recipes and anecdotes that could have well been left out.  I very much liked Mr. Kurlansky's book: COD and have purchased: SALT to read sometime soon, so in general, I enjoy his books. My travels into Basque Spain prodded me to finish the book, otherwise, I would likely have not finished it."}, {"review_sentiment": 5.0, "review_text": "Amazing"}]}, "authors": ["Mark Kurlansky"], "isbn": "0140298517", "longitude": 0.0, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s"], "title": "The Basque History of the World: The Story of a Nation", "word_cloud": "good informative more ever want long offer insight complicate northern illustration otherwise interested regional lengthy detailed accounting language culinary art culture time many reason detail become tedious say learn lot way view world trial tribulation fitting culture yet conform interested make look forward trip northern fall write engage much background information make experience depth very interesting amaze discover little know people suffer amazed tenacity custom alive recommend read visit come easily high entertain standard work great deal modern era get bogged petty detail horrible deed war tale flow smoothly load interest teed bit fascinating nation world remain able form think get bogged repression impose execution arrest shoot murder bombing important part go back year discourage number go order content great however narrator audible version poor job pronounce spanish name word noticeably detract work fluent english many time trouble understand narrator replace someone bilingual completely enjoy informative greatly enjoy think particularly time jump recipe anecdote well much like purchase sometime soon general enjoy travel prod finish otherwise likely amaze", "genres": ["History"], "summary": "From Mark Kurlansky, the bestselling author of Cod, Salt, Birdseye, and Paper—the illuminating story of an ancient and enigmatic people\r\n\r\nStraddling a small corner of Spain and France in a land that is marked on no maps except their own, the Basques are a puzzling contradiction—they are Europe's oldest nation without ever having been a country. No one has ever been able to determine their origins, and even the Basques' language, Euskera—the most ancient in Europe—is related to none other on earth. For centuries, their influence has been felt in nearly every realm, from religion to sports to commerce. Even today, the Basques are enjoying what may be the most important cultural renaissance in their long existence, as displayed by new cookbooks like chefs Alexandra Raij and Eder Montero's The Basque Book and restaurateur Jose Pizarro’s Basque.\r\n\r\nMark Kurlansky's passion for the Basque people and his exuberant eye for detail shine throughout this fascinating book. Like Cod, The Basque History of the World, blends human stories with economic, political, literary, and culinary history into a rich and heroic tale.\r\n\r\nAmong the Basques' greatest accomplishments:\r\n   • Exploration—the first man to circumnavigate the globe, Juan Sebastian de Elcano, was a Basque and the Basques were the second Europeans, after the Vikings, in North America \r\n   • Gastronomy and agriculture—they were the first Europeans to eat corn and chili peppers and cultivate tobacco, and were among the first to use chocolate \r\n   • Religion—Ignatius Loyola, a Basque, founded the Jesuit religious order \r\n   • Business and politics—they introduced capitalism and modern commercial banking to southern Europe \r\n   • Recreation—they invented beach resorts, jai alai, and racing regattas, and were the first Europeans to play sports with balls.\r\n\r\nEntertaining and instructive… [Kurlansky’s] approach is unorthodox, mixing history with anecdotes, poems with recipes.” The New York Times Book Review", "asin": "B00A2KFZLC", "rank": 0, "city": "Basque Country", "image": "", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}