{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 14, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "A book I have been meaning to read since it came out in the 70's.i still don't know what to think of it. Does success breed happiness?Jake the main character strives, but finds himself lacking."}, {"review_sentiment": 4.0, "review_text": "It's a toss-up as to which one is more enjoyable. Both books are brimming with comic invention. As is Joshua, but to me it's between Duddy and St. Urbain's Horseman. I think St. Urbain wins out narrowly for pure enjoyment. There are complete comic set pieces in the book, and it's a touch less dark than Duddy. Some of the drama in Duddy is untainted by the comedy, and so to me it's a slightly more serious novel. And a better one. I'd give St. Urbain the opposite description: most of its comedy is unsullied by the book's drama.St. Urbain was another Richler foray into ex-pat territory - a territory he mined throughout his career. There are plenty of laughs, lots of stereotyping, but it's much less goofy and adolescent than Cocksure, for example. For some people, it won't be very funny - Richler went out of his way to be at least a little offensive every chance he got, and this book is no exception.Nonetheless, a very good read. Four stars."}, {"review_sentiment": 5.0, "review_text": "This book is a great read.  It is easy to understand and identify with the charactersAnd there life. Richler is a great writer who is under appreciated by the America reader"}, {"review_sentiment": 4.0, "review_text": "One of many excellent books by an author with a unique style. Also try \"The Apprenticeship of Duddy Kravitz\" and \"Barney's Version\"."}, {"review_sentiment": 5.0, "review_text": "I grew up and went to Baron Byng H. S. with \"Mottie\". I was captain of our school soccer team of 1948-1949 when we were City Champions. That year I was center half-back and for 2 free penalty \"kicks\" from mid field I kicked 2 goals. I lived at that time at 4547 Park Avenue around the corner of YMHA and facing the mountain. My name is Jerry (Gerald) Goldman, and I am now 81 yrs.,old, a US Korean veteran (USAF), college grad., in electronics and I live in New Jersey near Atlantic City. The book brought back many memories and some sad moments. Mottie always went everywhere with his scratch pad and pencil, and reading the book brought back many memories."}, {"review_sentiment": 5.0, "review_text": "As a point of reference, I have read all of Richler's major works and a few of his early novellas. This was written after Richler's sexual obsession in his British phase and he tells an interesting story about a young film director from Montreal who has moved to Britain The novel follows from his wildly creative novel Cocksure which as story immersed in sexual obsession. This is a far tamer novel and it is longer and more substantial but less creative. Overall, it is among his best efforts.Following on from the very liberated Cocksure, we see a much more conventional and down to earth Richler who has attempted to integrate British making with biographical elements from his own youth.Modecai Richler (1931 to 2001) grew up in Montreal and that city is the setting for many of his stories - but not all. Many of his novels are about Jews living in Canada and Britain post WWII.He is best known for his tales of life in and around St. Urbain Street. That is an area of three story buildings or walk up row houses located just east of the mountain in Montreal, and north of the commercial center of the city. At one time this was the center of Jewish immigrant life. Many Jews coming to Montreal started there but then moved on to Outrement, Hamstead, and other districts. His father was a scrap dealer and he graduated from a heavily Jewish high school, Baron Byng High School, which has other famous alumni including William Shatner of Star Trek fame. Some of the local establishments such as Schwartz's Deli on St. Laurent are still in business. He uses much of those biographical experiences in the book.His break out novel is the present novel Duddy Kravitz which is still a great read whether you have seen the movie or not. Also, I like his last book, Barney's Vision, which is probably his most balanced and best written piece of work. That novel lacks the edge and drama of Duddy Kravitz. Along the way, he experimented with different themes and the use of sex in the plots, and usually he did that with a lot of humor as in Cocksure.This book is among his best works and there must be a few parallels with Richter's own life. It is about a young and poorly educated Jewish boy (Richler never finished university himself and moved to Britain) who struggles in the Canadian TV business starting off as a stage hand and then eventually becoming a London based movie director. The protagonist, Jacob Hersh, is from the St. Urbain area of Montreal, and he has an unusual relation with his cousin Joey - who is the \"horseman.\" Joey appears only once in the book when he visits Montreal, and spends most of his time traveling the world doing all sort of glamorous things from being a soldier, to actor, to baseball player. In reality, Joey is a bit of a con man but he is held in awe by Jacob.This is an interesting story that gets better as we reach the end of the book.Many of his critics claim that he re-cycles his characters and deals only with one topic, but in general his books are far from the predictable and this book is another example. That being said, Duddy Kravitz and even his father max appear in the novel, and Duddy more than once.This is a good read which leaves the reader satisfied."}, {"review_sentiment": 4.0, "review_text": "Mordecai Richler's novels are always a wild ride.  In St. Urbain's Horseman we have the usual Richler pastiche of paranoid Jewish Montrealers struggling in a gentile world.  As with his other novels, I sense that '..Horseman' has many biographical elements to it.  Although teetering on being pretentious, '..Horseman' is easily salvaged by its fine characterizations and often hilarious prose.'..Horseman' is a very rich, complex novel.  It chronicles a young man who escapes squalor of Montreal and finds himself as a successful family man in swinging London, circa 1965.  Unfortunately he finds himself tormented by the legend of his mysterious cousin (the \"horseman\") who seems to be larger than life (..a Nazi hunter in Paraguay?), and those with whom the cousin comes in contact with.  It's all rather chaotic and often unbelievable.  But thankfully the likes of Mordecai Richler pulls it all together somehow.Bottom line: suspend your disbelief and enjoy this book."}, {"review_sentiment": 2.0, "review_text": "I guess everyone has to start somewhere. This novel used much of the same material as, but is much weaker than, Richler's later excellent novel Solomon Gursky Was Here. St Urbain's Horseman is too long, the characters are too weak, and the story too muddled to justify it's 450 pages. The Montreal sections are much, much stronger than the parts set in London, which I suppose helps explain why Richler moved back to his native city."}, {"review_sentiment": 5.0, "review_text": "A remarkable book, clever, interesting, and so well written that I often stopped just to marvel at how entertained I was.  You'll be glad you got it."}, {"review_sentiment": 5.0, "review_text": "People of my parent's generation will always remember where they were when JFK was assasinated. Likewise, I'll always remember the day when I learned that Mordecai Richler had died. I was standing in the kitchen, making dinner, when it was announced on the CBC. I fell apart, and it's the only time I have ever cried over someone I didn't even know.When people tell me that they've never heard of, or read, Mordecai Richler, I want to rail at the universe. He's simply the best there is - a novelist who was intelligent, comical, introspective, cynical, perceptive, heartfelt, brutally honest, and ultimately, unforgettable. Reading St.Urbain's Horseman saved me from a dismal semester in university. I was taking existentialist philosophy and sinking into gloom when I escaped into a story that was impossible to put down. I laughed out loud - so hard that I couldn't read. I could go on all day. Just read this book - I guarantee that you'll read it again. And then you'll have to read everything else Mordecai Richler wrote.I wish there were more stories to look forward to."}]}, "authors": ["Mordecai Richler"], "isbn": "0140167692", "longitude": -73.6103642, "periods": ["1900s"], "title": "St. Urbain's Horseman", "word_cloud": "mean come still know think success happiness main character strives find lack enjoyable brim comic invention think urban win narrowly pure enjoyment complete comic set piece touch le dark drama untainted comedy slightly serious better give opposite description comedy unsullied foray territory territory mine career plenty laugh lot stereotype much le goofy adolescent example people go way least little offensive chance get good star great easy understand identify characters and life great writer appreciate many excellent author unique style also try grow go captain school soccer team year center free penalty kick mid field kick goal live time corner face mountain name old u korean veteran college electronics live bring back many memory sad moment always go everywhere scratch pad pencil read bring back many memory point reference major work early novellas write sexual obsession british phase tell interest story young film director move follow wildly creative story immerse sexual obsession far tamer longer substantial le creative best liberate see much conventional earth attempt integrate british make biographical element grow city set many story many novel jews live post best know tale life area story building walk row house locate east mountain north commercial center city time center immigrant life many come start move district father scrap dealer graduate heavily jewish high school famous alumnus include local establishment still business use much biographical experience break present still great see movie also last probably balance best write piece work lack edge drama way experiment different theme use sex plot usually lot humor best work life young poorly educate jewish boy never finish university move struggle canadian tv business start stage hand eventually become base movie director protagonist area unusual relation cousin appear visit spend time travel world sort glamorous thing soldier actor baseball player reality bit con man hold awe interesting story get better reach end critic claim character deal topic general far predictable example say even father max appear good leaf satisfy novel always wild ride usual pastiche paranoid jewish struggle gentile world novel sense many biographical element teeter pretentious easily salvage fine characterization often hilarious prose rich complex chronicle young man escape squalor find successful family man swing circa find tormented legend mysterious cousin seem larger life hunter cousin come rather chaotic often unbelievable thankfully like pull together line suspend disbelief enjoy guess everyone start somewhere use much material much weaker later excellent here long character weak story muddle justify page section much much stronger part set suppose help move back native city remarkable clever interest well write often stop marvel entertain glad get people parent generation always assassinated always remember day learn die stand kitchen make dinner announce fell apart time ever cry someone even people tell never hear want rail universe simply best novelist intelligent comical introspective cynical perceptive heartfelt brutally honest ultimately unforgettable read save dismal semester university take existentialist philosophy sinking gloom escape story impossible put laugh loud hard day guarantee everything else wish story look forward", "genres": ["Fiction & Literature", "Humour", "Satire"], "summary": "St. Urbain’s Horseman is a complex, moving, and wonderfully comic evocation of a generation consumed with guilt – guilt at not joining every battle, at not healing every wound. Thirty-seven-year-old Jake Hersh is a film director of modest success, a faithful husband, and a man in disgrace.\r\n\r\nHis alter ego is his cousin Joey, a legend in their childhood neighbourhood in Montreal. Nazi-hunter, adventurer, and hero of the Spanish Civil War, Joey is the avenging horseman of Jake’s impotent dreams. When Jake becomes embroiled in a scandalous trial in London, England, he puts his own unadventurous life on trial as well, finding it desperately wanting as he steadfastly longs for the Horseman’s glorious return.\r\n\r\nIrreverent, deeply felt, as scathing in its critique of social mores as it is uproariously funny, St. Urbain’s Horseman confirms Mordecai Richler’s reputation as a pre-eminent observer of the hypocrisies and absurdities of modern life.", "asin": "0140167692", "rank": "1025440", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/41SLmOHBhOL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}