{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 8, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Why isn't this charming book still in print?"}, {"review_sentiment": 5.0, "review_text": "prompt and efficient ."}, {"review_sentiment": 5.0, "review_text": "For those of you who remember the delight of following the resident's of Cannery Row and Yoknapatawpha County....here's another bunch of self important functionaries,  almost all men, abusing democracy in a scrabbling backwater of Trinidad. You get inside a first attempt at the exercise of elections as locals, outsiders, missionaries (not really people, just part of the background) and animals struggle to the top of the heap while doing what they do best, keeping you laughing. This book is way too good to have gone out of print, so i grabbed several copies as gifts for friends who may not have met this bunch."}, {"review_sentiment": 4.0, "review_text": "Contrary to my expectations, this novel was actually humorous, although it does point out a serious problem. The new democracy of Trinidad is having only its second elections (1950), and Surujpat Harbans, a Hindu, is running for office. To win he must secure the votes of the Hindus, the Moslims, and the Spanish. He has little chance of getting the Negro vote, because his opponent is a Negro. So he courts important men who have influence in the various factions, offering them jobs and favors to help him. Superstitious elements also come into play: two Jehovah's Witnesses ladies and a black dog thought to be an evil spirit. So what does he do? He buys the vote, essentially, with little favors to various segments.Forgive me for translating this story, in my mind, to today's America. We have the Republicans, the Democrats, the Hispanic vote, the Negro vote. In Trinidad, in 1950, the differing religious elements were mostly cultural differences. In America, in 2011, the two political parties seem to be more and more aligned along religious interpretations. And if you don't think superstition comes into play, think again of the reliance some put on the Book of Revelations. And what do most people do? Follow some influential leader of their segment who tells them what to think.Back to the novel. Naipaul's dialogue is excellent; the wheelings and dealings of various factions to gain the most benefits are funny; the conclusion is even funnier, in a dark-humor kind of way. It's a very interesting book to read.Naipaul seems to be making a comments about the pitfalls of democracy, but perhaps I am reading that in, though I think not. I recommend reading this book and thinking about elections in the USA at the same time.This novel has an outstanding first sentence: \"That afternoon Mr Surujpat Harbans nearly killed the two white women and the black bitch.\""}, {"review_sentiment": 4.0, "review_text": "This is the first Naipaul book I've read (following Paul Theroux's \"Sir Vidia's Shadow\", which I highly recommend), and it has spurred me into reading more from Naipaul.  Not to bring anyone into disregard, but I believe it was high time for the Nobel Committee to return to richly satisfying writers of a monumental girth (such as Naipaul, Saramago or Garcia Marquez, to name just some of the more recent ones) when choosing its literature prize winners.To the Suffrage of Elvira, then.  The story is a simple one, very charmingly told.  \"Pat\" Harbans is a man on the verge of old age who, mainly to be in a position to benefit from public works contracts (roadworks)decides to stand as a candidate for MP for the region of Elvira, Caroni District.  It is 1950, the second election after Trinidad's independence from Britain, and in Elvira there are 8,000 voters, of which the majority are of Hindu origin, with a few Muslim, Black and \"Spanish\" ones thrown in.  Mr. Harbans is traveling to the town of Elvira to visit Baksh (a rambunctious tailor who is seen as the leader of the Muslim group) and Chittanrajan (a rich goldsmith, who leads the Hindu faction).  His hope is to get Baksh's and Chittanrajan's support, thus ensuring his final victory in the elections.  During the trip everything seems to go wrong.  Harbans runs over a dog and almost hits two American Jehova's Witnesses on bikes.  He sees these events as an ill omen, and he is not mistaken.  In Elvira he is forced to pay through the nose, as all his future constituents take him for a ride that doesn't end until the end of the book.  He is forced to appoint Baksh's son, Foam, as campaign manager and to agree to his son's marriage to Chittanrajan's daughter.  He is forced to open an account at Ramlogan's run shop for his supporters, and is eventually forced to pay for the privilege of visiting ill Hindu voters, for the burial of a political opponent, and for a motorcade on election day.  Everyone, and not the least Harbans (who is not at all suited for the rigours of a campaign, who hates to talk in public and easily falls into depression) is flawed.  Harbans's main opponent is a black candidate, nicknamed Preacher (who comes across mainly as a religious fanatic), and the chief of Preacher's campaign is a confidence man named Lorkhoor.  I won't tell much more, not to spoil the pleasure of future readers, but suffice to say that even the more appealing characters (Foam and Chittanrajan) are not without their blemishes.  This is small town, third world life, warts and all.  And the election is absolutely true to life, and not only for Trinidad, but also for many other similar regions.  I am not Trinidadian but Colombian, and I could recognize all the characters portrayed.Naipaul is Swiftian, but not as acerbic as would be the case in his future works.  The election (and, indeed, democracy) is a mockery, and, while everyone tries to take advantage of everyone else, the strong prevail whereas the weak fall by the side, not without having inflicted some damage as a price for their destitution.  No one is too weak to spit and bite and even the big beasts sometimes have to retreat (although they win in the end).The book is funny and probably was very difficult to write in spite of its short length.  I regretted not knowing what happened with the Jehova's Witnesses in the end, and I think Naipaul could have given Preacher a bit more of air time.  But otherwise, I have no complaints.  Read this book.  \"Do your part, vote the heart\"."}, {"review_sentiment": 4.0, "review_text": "This is a short book, and the subject matter is fairly commonplace - the book is about an election.  However, Naipaul is such a master of constructing personalities, that the subject becomes completely fascinating  and the lives of the characters that populate the story are as involving as  the plot.  All his characters - Harbans, Chitaranjan, Baksh, and the town  of Elvira - are developed with amazing natural grace and, as always,  Naipaul's conversational style is engaging from start to finish.  The story  itself is consistent with themes he previously explores: provincialism,  tragedy, self-consciousness, and how the individual finds his place in the  world.  I still recommend \"Miguel Street\" as the perfect  introduction to the author, but TSOE is right up there on the list of his  must-reads - not only because it is a heartbreaking story but also because  it is a full display of Naipaul's technique."}, {"review_sentiment": 4.0, "review_text": "V.S. Naipaul presents to us an unassumingly twisted view of a rural Trinidad on the verge of self-government and postcolonialism.  He spins a carnival of motley characters (Hindus, Muslims, Blacks, Creoles, East  Indians) who bite, backbite, and betray each other as their town's first  elections approaches.  While Naipaul once again seems to lampoon a fatuous,  confused Caribbean culture, he makes serious speculations on the  Caribbean's ability to govern itself orderly,effectively and justly in the  wake of colonial control.  His vision is stark and bleak as these  characters grotesquely play out their parts, be it (pseudo)politician,  campaign manager, voter, prophet, pundit, bulge-bellied child.  Coming from  Belize, I can say the impressions are in many ways familiar, but may also  veer into the histrionics of a dispeptic author who has suffered too long  under a stagnating colonial society that has never respected his art and  his worldliness, or understood his need to rise above the mire of  colonialism."}, {"review_sentiment": 4.0, "review_text": "The Suffrage of Elvira, is a novel based on an election that occurs in  rural Trinidad. Being Trinidadian gives me a unique vantage point, there is  a more gratifying appreciation for the truth of this novel. Despite the  shortness of the work, their is an intricate plot that is surprising,  humorous, and tragic in turns. The story generates interest and exicitment  for the reader, and may compel him to consume this marvellous craft in one  sitting."}]}, "authors": ["V. S. Naipaul"], "isbn": "0140029389", "longitude": 0.0, "periods": ["1900s"], "title": "Suffrage of Elvira", "word_cloud": "charm still prompt efficient delight follow resident bunch self important functionary almost men abuse democracy scrabble backwater get first attempt exercise election locals outsider missionary really people part animal struggle top heap best keep laugh way good go print grab several copy gift friend bunch contrary expectation actually humorous point serious problem new democracy second election run office vote little chance get vote opponent court important men influence various faction offer job favor help superstitious element also come play ladies black dog think evil spirit buy vote essentially little favor various translate story mind today vote vote differ religious element mostly cultural difference political party seem align religious interpretation superstition come think reliance put people influential leader segment tell dialogue excellent wheeling dealing various faction gain benefit funny conclusion even funnier kind way interesting seem make comment pitfall democracy perhaps read think recommend read think election outstanding first sentence afternoon nearly kill white woman black bitch first follow highly recommend spurred reading not anyone disregard believe high time return richly satisfy writer monumental girth name recent one choose literature prize story simple charmingly tell man verge old age mainly position public work contract roadworks decides stand candidate region second election independence voter majority origin spanish one throw travel town visit rambunctious tailor see leader group rich goldsmith lead faction hope support thus ensure final victory election trip everything seem go wrong run dog almost hit american bike see event ill omen mistake force pay nose future constituent ride end end force appoint son campaign manager agree son marriage daughter force open account run shop supporter eventually force pay privilege visit ill voter burial political opponent motorcade election day least suited rigor campaign hat talk public easily fall depression flaw main opponent black candidate nickname come mainly religious fanatic chief campaign confidence man name much spoil pleasure future reader suffice even appeal character blemish small town third world life wart election absolutely true life also many similar region trinidadian colombian character swiftian acerbic case work election indeed democracy mockery everyone try take advantage everyone else strong prevail whereas weak fall side inflicted damage price destitution one weak spit bite even big beast sometimes retreat win end funny probably difficult write spite short length regret know happen end think give bit air time otherwise complaint read part heart short subject matter fairly commonplace election however master construct personality subject becomes completely fascinate live character populate story involve plot character town develop amaze natural grace always conversational style engage start story consistent theme previously explore provincialism tragedy individual find place world still recommend perfect introduction author right list heartbreaking story also full display technique naipaul present unassumingly twisted view rural verge post colonialism spin carnival motley character bite backbite betray town first election approach seem lampoon fatuous confused caribbean culture make serious speculation ability govern orderly effectively justly wake colonial control vision stark bleak character grotesquely play part pseudo politician campaign manager voter prophet pundit child come say impression many way familiar also histrionics dyspeptic author suffer long stagnate colonial society never respect art worldliness understood need rise mire colonialism base election occur rural trinidadian give unique vantage point gratify appreciation truth shortness work intricate plot surprise humorous tragic turn story generate interest excitement marvelous craft sitting", "genres": ["Fiction & Literature", "Humour"], "summary": "The Suffrage of Elvira is a comic novel by V. S. Naipaul set in colonial Trinidad. It was written in 1957, and was published in London the following year. \r\n\r\nIt is a satire of the democratic process and the consequences of political change, published a few years before Trinidad and Tobago achieved independence in 1962.\r\n\r\nWikipedia", "asin": "0140029389", "rank": "1818447", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/71M4NYMYRXL.gif", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}