{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 4, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Wonderful!"}, {"review_sentiment": 5.0, "review_text": "Verga captures an Italian, Sicilian essence...in the featues of common life and the sometimes tragic outcomes of peasant life.  This is balanced by some of the comic events and situations that people experience as well.  He explores the cultural constraints that are accepted by the Sicilians of his stories and the influence that the Church (to the point of dominating every action) imposes.This organic, natural style and adherence to the truth of what his subjects experience underlie the themes he chose.  This is a beautiful collection."}, {"review_sentiment": 5.0, "review_text": "To paraphrase Lawrence Ferlinghetti, these stories by Giovanni Verga are \"pictures of a gone world\" by a masterful narrator whose manner is somewhat reminiscent of Turgenev. The title story (source for the opera \"Cavalleria rusticana\") is ironically the least interesting or remarkable in the collection and Verga should not be judged by it. Some contemporary readers might find the melodramatic turns of events and tragic endings heavy-handed, but Verga's close observation and realistic detail shine through and bring nineteenth-century rural Sicily to life. He presents his themes and characters without moralizing or sentimentality. While often tragic or sad, these memorable stories are not lacking in humor either (\"War of the Saints\" is hilarious) and have a way of getting under your skin. \"Wolf-hunt\" is a small masterpiece of suspense. Very much recommended for anyone interested in Sicily who wants to learn more about the Sicilian people, their history and culture."}, {"review_sentiment": 5.0, "review_text": "Verga is one of the 19th Century's greatest writers, and it's a shame he isn't better known in the English-speaking world.  Stories such as Jeli the  Shepherd and the She-Wolf are dazzling, deeply moving stories that rank  amongst the best stories Chekhov ever wrote.  The translation itself is  superb.  It is easily the best version of Verga in English."}]}, "authors": ["Giovanni Verga"], "isbn": "0140447415", "longitude": 0.0, "periods": ["1900s"], "title": "Cavalleria Rusticana and Other Stories", "word_cloud": "wonderful capture italian sicilian essence feature common life sometimes tragic outcome peasant life balanced comic event situation people experience well explore cultural constraint accept influence point dominate action organic natural style adherence truth subject experience underlie theme choose beautiful collection picture go world masterful narrator manner somewhat reminiscent title story source opera ironically least interesting remarkable collection judge contemporary reader melodramatic turn event tragic ending close observation realistic detail shine bring rural life present theme character moralize sentimentality often tragic sad memorable lack humor hilarious way get skin small masterpiece suspense very much recommend anyone interested want learn sicilian people history culture greatest writer shame better know world dazzle deeply move rank among st best ever write translation superb easily best version", "genres": ["Fiction & Literature"], "summary": "The stories of Giovanni Verga (1840-1922) are wonderful evocations of ordinary Italian life, focusing in particular on his native Sicily. \r\n\r\nIn an original and dynamic prose style, he portrays such eternal human themes as love, honour and adultery with rich and colourful language. The inspiration for Mascagni's opera, 'Cavalleria Rusticana' depicts a young man's triumphal return home from the army, spoilt when he learns that his beloved is engaged to another man. \r\n\r\nVerga's acute awareness of the hardships and aspirations of peasant life can be seen in stories such as 'Nedda', 'Picturesque Lives' and 'Black Bread', while others such as 'The Reverend' and 'Don Licciu Papa' show the dominance of the church and the law in the Sicilian communities he portrays so vividly.", "asin": "0140447415", "rank": "987888", "city": "Sicily", "image": "https://images-na.ssl-images-amazon.com/images/I/41CETmSWwdL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}