{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 83, "rating": 3.4, "reviews": [{"review_sentiment": 2.0, "review_text": "There was good character development.  But the last few chapters were just gruesome.  And it began with a nice love story. I did like the spelling of the words when the German people were speaking English."}, {"review_sentiment": 5.0, "review_text": "Bought this because I read it years ago and it is such an amazing book. Sad the author died so early. Gritty."}, {"review_sentiment": 1.0, "review_text": "I just couldn't get into the book"}, {"review_sentiment": 3.0, "review_text": "A story of sorrow and despair.  Not a light read or uplifting story."}, {"review_sentiment": 3.0, "review_text": "I would have rated this classic 4 or 5 stars except for how the main character is shown.. McTeague is a dentist who learns his trade by working with a disreputable practitioner. He is withdrawn, routine-bound and isolated, and brutishly strong. He falls in love with Trina, who is referred to him by one of his few friends, Marcus. Marcus is attracted to Trina, but steps aside so McTeague can woo her. Things change when Trina wins $5,000 in a lottery she entered before her marriage. Marcus is angry at letting her go; McTeague feels Marcus has no rights. Both feel entitled to control money that Trina won as a single person. Once she has money, Trina becomes a miser, lying about money she uses and refusing to turn loose of funds under any circumstances. A secondary story mirrors this; the maid Maria tells anyone who will listen that her family once owned a marvelous set of solid gold dishes and utensils. The local junkman, Zerkow,  marries her, and drives himself to madness trying to find the gold. Both marriages degenerate into truly awful spousal abuse. In both cases, the focus on money leads to greed violence and a desire for vengeance that takes over every relationship. Trina and McTeague cannot weather reversals of fortune; they separate, and McTeague goes on a headlong, ill-fated quest for more money.The only people who escape to a constructive relationship are an older couple that are afraid to court until late in the novel, after the man has sold a patent for binding articles. They are able to finally find love and a supportive partnership. 'McTeague' is a dark but well written novel.  My problem is that Norris constantly refers to McTeague as 'stupid.' If I had a dollar for every time he did, I could buy gold dishes. How stupid could McTeague be if he is a dentist, even a dicey one? Isolated, crude, hidebound and flawed, yes, but the constant use of 'stupid' shows a contempt for the character that he doesn't earn until later in the story.  Modern readers should be aware that the book is open about anti-Semitism toward Zerkow, which reflects how people felt at the time. Also, Trina's family is German, and these characters use an exaggerated German accent every time they speak, which is unnecessary and slows down the pace of the nove."}, {"review_sentiment": 2.0, "review_text": "Don't buy this book if you want to avoid eye strain. The book is not formatted properly, and the letters/words are tiny."}, {"review_sentiment": 5.0, "review_text": "great read"}, {"review_sentiment": 5.0, "review_text": "James Mitchner wrote a book called \"The Novel\" which referenced classics of American literature. On the strength of his recommendation I read McTeague and was impressed with the settings, plot, and character development of the story along with Frank Norris' superb writing style. If you are an English major and/or interested in stretching your mind with quality literature, you will enjoy this book."}, {"review_sentiment": 3.0, "review_text": "The times were different and I fell into the atmosphere of hope held by the less educated in early nineteen hundreds San Francisco.  But personal growth was missing entirely.  It became frustrating that the interesting, but emotionally dull McTeague never learned a single lesson about love."}, {"review_sentiment": 1.0, "review_text": "The novel is excellent, and has been one of my favorites since I read it in high school in 1978.  This edition by Amazing Stories, however, is very difficult to read due to its layout.  The type is small and is set on very wide pages, making it a challenge for the eye to track to the next line as one reads."}]}, "authors": ["Frank Norris"], "isbn": "0140187693", "longitude": -122.4192363, "periods": ["1800s"], "title": "McTeague: A Story of San Francisco (Twentieth Century Classics)", "word_cloud": "good character development last chapter gruesome begin nice spell word german people speak english year ago amaze author die early sorrow despair not light uplift rat classic star main character dentist learns trade work disreputable practitioner withdraw isolated brutishly strong fall refer friend attract step aside woo change win lottery enter marriage angry let feel right feel entitle control money single person money become miser lie money use refuse loose fund circumstance secondary mirror maid tell anyone listen family own marvelous set solid gold dish utensils local junk man marry drive madness try find gold marriages degenerate truly awful spousal abuse case focus money lead greed violence desire vengeance take relationship weather reversal fortune separate go headlong quest people escape constructive relationship older couple afraid court late man sell patent bind article able finally find love supportive partnership dark well write problem constantly refer dollar time gold dish stupid even crude hidebound flaw yes constant use show contempt character earn later reader aware open reflect people felt time also family character use exaggerated german accent time speak unnecessary slows pace do avoid eye strain formatted properly tiny great write call reference classic american literature strength recommendation mcteague impressed setting plot character development superb write style major interested stretch mind quality literature enjoy time different fell atmosphere hope hold le educate early nineteen hundred personal growth miss entirely become frustrate interest emotionally dull never learn single lesson love excellent favorites high school edition however difficult due type small set wide page make challenge eye track next line read", "genres": ["Fiction & Literature"], "summary": "McTeague is the story of a poor dentist scraping by in San Francisco at the end of the 19th century, and his wife Trina, whose $5,000 lottery winning sets in motion a shocking chain of events. Few works have captured the seamy side of American urban life with such graphic intensity.\r\n\r\nFrank Norris’s 1899 novel explores the impact of jealousy and greed on an otherwise typical relationship. McTeague has been adapted twice for film, including the 1924 film Greed, directed by acclaimed auteur Erich von Stroheim.\r\n\r\nThe novelist Frank Norris is almost forgotten today, but in books like \"McTeague,\" published in 1899, he paved the way for a whole generation of American writers--a generation that included Theodore Dreiser and Sinclair Lewis and, less directly, Hemingway and Fitzgerald. McTeague is a dentist saddled with a grasping wife, and the book chronicles his rise and fall in awkward but powerful prose. \r\n\r\nThis type of social realism, so contrary to the uplifting entertainment of the day (and to Mark Twain's more fanciful, comic novels), provided turn-of-the-century America a disturbing mirror in which to view itself.", "asin": "0140187693", "rank": "293603", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51FsMGRth1L.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}