{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 36, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "I read anything Chatwin writes."}, {"review_sentiment": 5.0, "review_text": "A jewel of a book, witty, erudite and entertaining...Belles Lettres at their best."}, {"review_sentiment": 4.0, "review_text": "Maybe a *3.5 for this exquisitely written novella - I read it in one sitting, but didn't really get wrapped up in the characters.The nameless British narrator tells of one Kaspar Utz, a former aristocrat of the Czech republic, whose life revolves around his fabulous collection of porcelain figurines. As the Communist regime takes over, Utz is grudgingly permitted to keep his treasures, though with regular visits from the authorities who insist it's all to be left to the state.And although he manages annual trips abroad, he never absconds, drawn back by the artefacts - and perhaps by his devoted, self-effacing housekeeper, Marta.The narrator only meets Utz briefly, but keeps informed on his life ... and the mystery at the end.There are a number of themes here; how humans devote their lives to unimportant things; obsession; love. Very well written."}, {"review_sentiment": 4.0, "review_text": "A strange, beautifully written shortish story about one man's obsession for porcelain  figurines as seen through the eyes of a young acquaintance. It had me running to Google for images."}, {"review_sentiment": 5.0, "review_text": "Very peculiar and strange story about a collector of porcelain figurines during the Soviet  rule of most of Europe. Beautifully written, and something you cannot put down. Not like anything else you've read before.Belongs on the shelf next to Kafka and Clarice Lispector. A redemptive book"}, {"review_sentiment": 3.0, "review_text": "I really tried to like it but it was hard to get into, and I even like collectibles and antiques.  Not sure what it was, but I'd be reading it...and then at some point realize my mind had wandered off to something else yet again, over and over.  This doesn't usually happen.  I didn't finish but this tiny book took me longer than the giant Game of Thrones one by far.  I'd try another by him though."}, {"review_sentiment": 4.0, "review_text": "Well written book about a person obsessed with collection Meissen."}, {"review_sentiment": 3.0, "review_text": "Fittingly this book about the obsession of collecting, has become something of a collector's piece itself.  I was therefore delighted to have dug up an old copy at a recent book fair, but the thrill of the hunt was not matched by the substance of the find - perhaps a more common experience than one might realise. Bruce Chatwin provides learning and nuanced political insights with a light touch in \"Utz\" providing this reader with an interesting read for the first half of the book.  When he turns his efforts to the absurd, he lost me.  His familarity with much of the subject matter, whether it be rare porcelain or life in Soviet controlled Czechoslovakia, grounded the more fanciful (and later almost grotesque) elements of this short book to a degree, but left a nagging void of disappointment that even fine writing cannot fill."}, {"review_sentiment": 5.0, "review_text": "A perfect little masterpiece. Anyone who has ever collected anything, from baseball cards to antiques, will love the mind of Utz. Beautiful story about staying true to oneself against great odds."}, {"review_sentiment": 5.0, "review_text": "After reading several of Chatwin's books, I have to say I really enjoyed UTZ.  I read it in one day because it's short and very hard to put down.  My only wish is that this young man had lived longer to give us more of his genius."}]}, "authors": ["Bruce Chatwin"], "isbn": "0140115765", "longitude": 14.4212535, "periods": ["1900s"], "title": "Utz", "word_cloud": "anything write jewel witty erudite entertaining best maybe exquisitely write novella sit really wrapped nameless british narrator tell former aristocrat republic life revolve around fabulous collection porcelain figurine communist regime take grudgingly permit keep treasure regular visit authority insist leave manages annual trip abroad never abscond draw artifact perhaps devote housekeeper narrator meet briefly keep informed life mystery number theme human devote live unimportant thing obsession love very well write strange beautifully write shortish story man obsession porcelain figurine see eye young acquaintance run image very peculiar strange story collector porcelain figurine soviet rule write something put not anything else next redemptive really try hard get even collectible antique not sure read point realize mind wander something else yet usually happen finish tiny take longer giant far try well write person obsess collection fittingly obsession collect become something collector piece therefore delight dug old copy recent fair thrill hunt match substance find perhaps common experience provide learn nuanced political insight light touch provide interest first half turn effort absurd lose familiarity much subject matter rare porcelain life control ground fanciful later almost grotesque element short degree leave nagging void disappointment even fine writing fill perfect little masterpiece ever collect anything baseball card antique love mind story stay true great odds read several say really enjoy day short hard put wish young man live longer", "genres": ["Fiction & Literature"], "summary": "Utz collects Meissen porcelain with a passion. His collection, which he has protected and enlarged through both World War II and Czechoslovakia's years of Stalinism, numbers more than 1,000 pieces, all crammed into his two-room Prague flat.\r\n\r\nUtz is allowed to leave the country each year, and although he has considered defection, he always returns. He cannot take his precious collection with him, but he cannot leave it, either. And so Utz is as much owned by his porcelain as it is owned by him, as much of a prisoner of the collection as of the Communist state.\r\n\r\nA fascinating, enigmatic man, Kaspar Utz is one of Bruce Chatwin's finest creations. And his story, as delicately cast as one of Utz's porcelain figures, is unforgettable.", "asin": "0140115765", "rank": "1025837", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/41rIASHxGUL.jpg", "country": "Czechia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}