{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 278, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "There is nothing one can say about this book other than read it, and learn quite a lot about yourself."}, {"review_sentiment": 5.0, "review_text": "This novel is near the top of American novels. The lush descriptions, deep characters, and knowledge of the great northwest set this work in a very select company. Kesey's One Flew Over the  Cuckoo's Nest was a warm up lap for this epic, virile, exploration of family, community, and what drives us forward."}, {"review_sentiment": 5.0, "review_text": "Something of a surprise. This ages very well. It takes a bit of getting used to, since Kesey swaps perspective - third person, first person, omniscient narrator - often. Sometimes even within a single paragraph. But once you get accustomed to that, its a great read."}, {"review_sentiment": 5.0, "review_text": "I am a voracious, eclectic, and wide ranging reader of some sixty years experience, and this is my favorite book. I have read and reread this book over the years since it was published, and find new meaning each time as reflected in the changes in my own life.  Having read the reviews both negative and positive, I have a couple of things to say that might be helpful.To those who have trouble with the fluctuations in time line and character voice, about sixty pages in the author enters the story with a short explanation regarding the true nature of time as more of a river, with whirlpools, eddys, and backwaters,  than a straight geometric line.  When you pay attention to this concept, metaphorically expressed in the description of the actual river that takes up so much of the narrative, the author's intent becomes crystal clear, and reveals itself as much more than a cheap trick, as some have suggested.Also, there were some complaints about it being a very male oriented book (manly tales of manly men).  Kesey himself pointed out at one time that he considered it a women's liberation text, and that the character of Viv, Hank's wife, was the true protagonist.  The fates of the women in the book, Henry's first wife neglected and worn away, his second wife driven to isolation and suicide, Joe Ben's wife widowed and left to raise a family on her own, finally culminating in Viv's rejection of both brother's attempts to use her as an addendum to their own male agendas and her breaking away without an explanation to or the comprehension of the remaining males in the story, add up to quite a story.As I said, I read it at different times from different perspectives, identifying with each character in turn, but it was the story of the women in the book which actually opened my eyes to a perspective different from my own, male, hardworking, striving viewpoint.The best book in American literature since Huck Finn."}, {"review_sentiment": 5.0, "review_text": "One of the all time great works of American fiction. Time and effort well invested. Irresistibly makes you, the reader, a part of the story, as if you yourself lived it."}, {"review_sentiment": 5.0, "review_text": "Captivating story.  Vivid imagery.  Brilliant narration.  I give this book my highest recommendation."}, {"review_sentiment": 5.0, "review_text": "I am not a novel reader, but picked this  up because of the movie (which pales in comparison).  The book is on the masculine side, but my wife is enjoying the book.  The story is long and complicated, but intriguing.  The characters are well drawn, and definitely not cookie-cutter.  I found it engrossing."}, {"review_sentiment": 5.0, "review_text": "In my opinion this is the best novel ever written."}, {"review_sentiment": 4.0, "review_text": "Sometimes a Great Notion is an anti-union manifesto, a work of flowing literature that should be studied in the cloistering halls of higher learning--not as much for its deep meaning, but rather for the structure of its text (I dare a professor to take any one of the 600+ pages and study it for an entire semester), a masterpiece of prose, the second novel by The Great Ken Kesey (1935-2001), a juxtaposition of two brothers that has been unequalled since Tolstoy.Sometimes a Great Notion is many things, including a followup to One Flew Over the Cuckoo's Nest published two years prior in 1962. The latter book is an undeniable classic of literature that has rarely been equaled. Read my review of One Flew Over the Cuckoo's Nest.Sometimes a Great Notion was published in 1964 and Kesey's next novel would not be published until 1984 when Demon Box (a collection of short stories thinly-veiled as fiction) was launched. What was this supremely talented author doing for 20 years? Most would claim it was drugs. Kesey had spent time in clink to prove it. Who knows? And when he finally rid himself of the Technicolor synthetics flowing through his veins, his brain was fried into a pigskin cracklin'. Instead of the psychedelics unlocking fantastic worlds, they seem to have hidden them away from Kesey in a demon box.Sometimes a Great Notion at times becomes a long-winded bore over vast swaths of pages. It makes one wonder if Ken Kesey lost the Oregon forest through the trees on which his characters hack out a living. At times he tries to be too literary. But Kesey pulls it out in the last 200 pages to a wonderful conclusion. A side note on the movie of the same name starring Robert Redford and Henry Fonda--skip over like a rolling log! It's a real Hollywood hack job that treats the novel as though it was a short story.SometimesaGreatNotion, in the hands of a master, is the closest you will ever get to the logging world of Oregon and the real-to-life characters Kesey created.#ReviewSometimesaGreatNotion #KenKeseyBy Andrew Barger - Author of The Divine Dantes trilogy"}, {"review_sentiment": 5.0, "review_text": "Insane..... not sure if Kesey was a right wing nutcase or a communist liberal?.... But his books are worth reading. He has a different outlook than most any other author I have ever read. Warning..... His characters have grit and are a little too realistic as we all know people like them, but rarely ever do we see them on paper unless Kesey is writing about them..... I'm in Oregon and logging is dead, it died in the 80's with the spotted owl, but this story is completely real describing the logic and culture of that age and employment. Kesey tells a story well, and this one is worth reading."}]}, "authors": ["Ken Kesey"], "isbn": "0140045295", "longitude": -122.3300624, "periods": ["1900s"], "title": "Sometimes a Great Notion", "word_cloud": "nothing say learn quite lot near top lush description deep character knowledge northwest set work select company warm lap epic exploration family community drive forward something surprise age well take bit get use swap perspective third person first person omniscient narrator often even single paragraph get accustomed voracious eclectic wide range sixty year favorite reread year publish find new meaning time reflect change life have review negative positive couple thing say trouble fluctuation time line character voice sixty page author enters story short explanation regard true nature time river whirlpool eddy backwater straight geometric line pay attention concept metaphorically express description actual river take much narrative author intent become crystal clear reveals much cheap trick complaint male orient manly tales manly men point time consider woman liberation text character wife true protagonist fate woman first wife neglect worn away second wife drive isolation suicide wife widow left raise family finally culminate rejection brother attempt use addendum male agenda break away explanation comprehension remain male story quite say different time different perspective identify character turn story woman actually open eye perspective different male hardworking strive best american literature time work american fiction effort well invest make part story live captivate story imagery narration give highest recommendation pick movie pale comparison masculine side wife enjoy story long complicate intrigue character well definitely find engross opinion best ever write work flow literature study cloister hall higher learn much deep meaning rather structure text dare professor page study entire semester masterpiece prose second juxtaposition brother unequaled many thing include followup publish year prior latter undeniable classic literature rarely equal publish next collection short story fiction launch supremely talented author year drug spend time clink know finally rid synthetic flow vein brain fry pigskin crackling instead psychedelics unlock fantastic world seem hide away demon time becomes bore vast swath page make wonder lose forest tree character hack living time try literary pull last page wonderful conclusion side note movie name star skip roll log real hack job treat short hand master closest ever logging world character trilogy sure right wing nutcase communist liberal worth reading different outlook author ever warn character grit little realistic know people rarely ever paper write oregon log dead die spotted owl story completely real describe logic culture age employment tell story well worth reading", "genres": ["Fiction & Literature"], "summary": "The magnificent second novel from the legendary author of One Flew Over the Cuckoo's Nest and Sailor Song is a wild-spirited and hugely powerful tale of an Oregon logging clan.\r\n\r\nA bitter strike is raging in a small lumber town along the Oregon coast. Bucking that strike out of sheer cussedness are the Stampers: Henry, the fiercely vital and overpowering patriarch; Hank, the son who has spent his life trying to live up to his father; and Viv, who fell in love with Hank's exuberant machismo but now finds it wearing thin. And then there is Leland, Henry's bookish younger son, who returns to his family on a mission of vengeance - and finds himself fulfilling it in ways he never imagined. Out of the Stamper family's rivalries and betrayals, Ken Kesey crafted a novel with the mythic impact of Greek tragedy.\r\n\r\n\"Sometimes a Great Notion, a big book in every way, captures the tenor of the post-Korea America as nothing I can remember reading . . . Beyond the PTA and the beer commercials, beyond the huge effluvium of the times, exist people who live by the ancient passions, and Mr. Kesey in the fullness of his material discovers them for us.\" The New York Times ", "asin": "0140045295", "rank": "31097", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/51zQuYpAZ4L.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}