{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 163, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "The young-adult children of wealthy Florentines flee to the hills during the Plague and tell each other stories to keep themselves amused.  Boccaccio's classic has stood the test of time for hundreds of years and is still going strong.  A very reasonable price."}, {"review_sentiment": 5.0, "review_text": "Great book from the black plague era"}, {"review_sentiment": 5.0, "review_text": "Good quality and cheap."}, {"review_sentiment": 5.0, "review_text": "Watching medievalists fight is not a pretty sight, even though it is a funny oneTo prompt the brawl, ask a bit too loudly who was the first great national poet.Watch as Green King Abbot Ale and Moretti bottles are smashed, fail to break like in the movies and a bunch of guys in tweed look around for something bigger than a bar napkin to stop the blood flow.  Teaching assistants will enter with towels, bandages, and the hope their mentor lasts long enough for a good letter of recommendation.Once the prof's are stabilized the cases for England and Italy will be phrased.Britain gets Chaucer whose wit, use of irony in irony, is remarkably fresh even today. There is a humanity found in his characters—the most vile prejudice in the work comes from a nun, who given her airs,  reveals the heart of darkness in us all.Italy gets Dante, a writer who appears to have known more even than Borges, who created a new poetic form, and sustained intellect and near perfection in  three volumes.  His effort would be the equivalent of walking into a dojo and fighting every master but downing each in the sequence for mastering each step of the many katas.Nobody is going to  mention Boccaccio and nobody is going to fight for the poet who wrote Sir Gawain and the Green Knight.Sir G’s poet made the mistake in writing in the wrong dialect.Boccaccio wrote the first book made up entirely of short stories.  He pulled together snippets from earlier stories and his efforts were pillaged by later writers (Shakespeare, chief among them).Skillful, occasionally elegant, hilarious, engaging, and with a very high ratio of great to so-so stories, Boccaccio might be viewed as we do Stephen King, a masterful artist who is grotesquely undervalued.Great story tellers of their times often fade more completely than do old soldiers."}, {"review_sentiment": 5.0, "review_text": "A great collection of reviews. There is anything right here for all people, from humor to ancient tidbits to the off-colour. I do know there are lists of which reviews are \"the exceptional,\" but honestly, virtually all of them are worth studying. Makes an nice trip publication, considering that the experiences are most often lovely quick."}, {"review_sentiment": 5.0, "review_text": "I'm not a fan of classical texts, but I was assigned this for a class on Roman Antiquity and the Italian Renaissance. This was by far my favorite we read all semester and, though I have nothing to compare it to, I really enjoyed the translation."}, {"review_sentiment": 5.0, "review_text": "Very beautiful Renaissance prose. If you are into romance novels you will never understand this writing. This is for someone who has the time to think about the writing style. It conveys beautiful thoughts so elegantly."}, {"review_sentiment": 3.0, "review_text": "This reads like a succession of adult-themed fairy tales as most of them involve sex but not in the least graphic.  The 100 stories, 10 told over 10 days in a countryside villa by 10 aristocratic ladies and gentlemen to amuse themselves, are quick reads.  This is not a literary masterpiece by any means but it is fun.  You can read a story or two, put it down for awhile, and lose nothing."}, {"review_sentiment": 4.0, "review_text": "Amazon should not have this under their kindle ebook. I went looking for Decameron in the 1995 Penguin edition to start, I found the physical book, then clicked on \"kindle book\" and it took me to this book. I figured the cover was just different because it's a kindle edition, no. This is a different book all together. This one is far more \"old English\" than the penguin edition and significantly harder to read. That being said, I bought the penguin soft cover and I have to say, I love reading the Decameron. Great read, definite recommend."}, {"review_sentiment": 5.0, "review_text": "Great book with lots of humor in the form of short stories. Would highly recommend to any English teacher or professor that teaches a class."}]}, "authors": ["Giovanni Boccaccio"], "isbn": "0140449302", "longitude": 12.4829321, "periods": ["500-1400s"], "title": "The Decameron", "word_cloud": "child wealthy flee hill tell story keep amused classic stand test time hundred year still go strong reasonable price black plague era good quality cheap watch medievalists fight pretty sight even funny one to prompt brawl ask bit loudly first great national bottle smash fail break movie bunch guy tweed look something bigger bar stop blood flow teach assistant enter towel bandage hope mentor last long enough good letter prof stabilize case get wit use irony irony remarkably fresh even today humanity find vile prejudice work come nun give reveals heart darkness get writer appear know even create new poetic form sustain intellect perfection volume effort walk dodo fight master down sequence master step many go mention nobody go fight poet write poet make mistake writing wrong write first make entirely short story pull together snippet earlier story effort pillage later writer chief occasionally elegant hilarious engage high ratio great story masterful artist grotesquely story teller time often fade completely old soldier great collection review anything right people humor ancient tidbit know list review exceptional honestly virtually worth study nice trip publication consider experience often lovely quick fan classical text assign class italian far favorite semester nothing compare really enjoy translation very beautiful prose romance novel never understand write someone time think write style convey beautiful thought elegantly read succession fairy tale involve sex least graphic story tell day villa aristocratic lady gentleman amuse quick read literary masterpiece mean fun story put lose nothing kindle book go look edition start find physical click kindle take figure cover different kindle edition different together far old english penguin edition significantly harder say buy penguin soft cover say love read definite recommend lot humor short story highly teacher professor teach class", "genres": ["Fiction & Literature"], "summary": "In the early summer of the year 1348, as a terrible plague ravages the city, ten charming young Florentines take refuge in country villas to tell each other stories—a hundred stories of love, adventure and surprising twists of fortune which later inspired Chaucer, Keats and Shakespeare. \r\n\r\nWhile Dante is a stern moralist, Boccaccio has little time for chastity, pokes fun at crafty, hypocritical clerics and celebrates the power of passion to overcome obstacles and social divisions. \r\n\r\nLike the Divine Comedy, the Decameron is a towering monument of medieval pre-Renaissance literature, and incorporates certain important elements that are not at once apparent to today's readers. \r\n\r\nIn a new introduction to this revised edition, which also includes additional explanatory notes, maps, bibliography and indexes, Professor McWilliam shows us Boccaccio for what he is—one of the world's greatest masters of vivid and exciting prose fiction.", "asin": "0140449302", "rank": "42696", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/512ekSdLokL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}