{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 523, "rating": 4.2, "reviews": [{"review_sentiment": 1.0, "review_text": "This is probably the worst short story collection I have ever read - and I've read a lot of them. It may be the era and the local, but I found it difficult to understand what was being said much of the time. And for the most part the subject matter was boring."}, {"review_sentiment": 3.0, "review_text": "Of course the writing is good; just didn't enjoy the stories!"}, {"review_sentiment": 5.0, "review_text": "I had never read James Joyce and this seemed to be the place to start --- short stories. I loved many and my favorite was The Dead."}, {"review_sentiment": 5.0, "review_text": "I read these stories in high school and am glad to have a copy of them again...very reasonably-priced.  Print is quite small, however, for those who need magnifiers."}, {"review_sentiment": 1.0, "review_text": "I researched other sites user reviews find that others have recommended this. I found it really good after the use, it has ordered.  Very Fast Shipping & Economical Price!  Just as described!!  Quality made product,will last for a long time  I am very happy with my purchase  Simple and easy"}, {"review_sentiment": 5.0, "review_text": "Fantastic, I really enjoyed it."}, {"review_sentiment": 5.0, "review_text": "There isn't any thing which can disturb."}, {"review_sentiment": 3.0, "review_text": "I don't usually read this type of novel.  Each story illustrated an event in a  person's life. As lived in 1912."}, {"review_sentiment": 5.0, "review_text": "An excellent edition."}, {"review_sentiment": 1.0, "review_text": "Happy with this product and the service given.  Good quality.  I have yet to use it but it looks very well made.  Brilliantly designed  Convenient, flexible, sturdy  Work for my purpose"}]}, "authors": ["James Joyce"], "isbn": "0140186476", "longitude": -6.2602732, "periods": ["1900s"], "title": "Dubliners", "word_cloud": "probably worst short story collection ever lot local find difficult understand say much time part subject matter boring course write good enjoy story never seem place start short story love many favorite dead stories high school glad copy quite small however need magnifier research site user review find others recommend find really good use order describe make product last long time happy purchase easy fantastic really enjoy thing disturb usually type story illustrate event person life lived excellent edition happy product service give quality yet use look well make design flexible sturdy purpose", "genres": ["Fiction & Literature"], "summary": "A definitive edition of perhaps the greatest short story collection in the English language\r\n\r\nJames Joyce’s Dubliners is a vivid and unflinching portrait of “dear dirty Dublin” at the turn of the twentieth century. These fifteen stories, including such unforgettable ones as “Araby,” “Grace,” and “The Dead,” delve into the heart of the city of Joyce’s birth, capturing the cadences of Dubliners’ speech and portraying with an almost brute realism their outer and inner lives. Dubliners is Joyce at his most accessible and most profound, and this edition is the definitive text, authorized by the Joyce estate and collated from all known proofs, manuscripts, and impressions to reflect the author’s original wishes.", "asin": "0140186476", "rank": "27086", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51cNhnppsmL.jpg", "country": "Ireland", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}