{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 24, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Two Centuries before the Paris of Hemingway's Moveable Feast there was the Rome and Italy of Goethe's Italian Journey."}, {"review_sentiment": 5.0, "review_text": "I just came back from a trip to Italy, completely in love with it, the food, the people, churches, museums, famous cities,  and I bought this book as a way to prolong my italian adventure.  I am enjoying his descriptions so much, that I am already planning my return trip and including the things and places he describes in this book.  It would be wonderful to be able to just travel, with no plans, no reservations, no timetables.The descriptions of the places and the people that the author meet during his journeys are very beautiful and very detailed.  It is a very easy to read book and a very entertaining one. Venice, Rome, Naples and Sicily are beautifully described for you.  Enjoy the virtual tour."}, {"review_sentiment": 5.0, "review_text": "For some reason, I expected the text to be in the original German, but this is a more than satisfactory English translation"}, {"review_sentiment": 5.0, "review_text": "It was very comfortable to order the book, and it arrived very soon at the address. The translation is perfect for the reader."}, {"review_sentiment": 5.0, "review_text": "VERY INTERESTING AND EDUCATING"}, {"review_sentiment": 4.0, "review_text": "From 1786 to 1788, Goethe travelled south across the Alps. At first, his journal is full of geological and botanical detail, as from a glance he could interpret the soils, alluvial conditions, and plant life all around him as it changed, along with the language as he pinpoints where German ended and Italian began. Knowing that language, he is able to converse with the high and the low. Even if this book understandably focuses on the privileged and educated colleagues he meets, and as it is full of discussions that may need plenty of footnotes for us, (more than provided in this translation by W.H. Auden and Elizabeth Mayer), it still shows us how this vastly erudite man of 37 expanded his power. He learns to get beyond his success with Young Werther, and to confidently work on art and Egmont. (Compare my review of Stendhal's slightly later \"Rome, Naples and Florence\" for another European intellectual's encounter with Italy as to one's artistic and aesthetic maturation.)\"When one lives far away, one hears only of the major artists in the galaxy and is often satisfied with merely knowing their names; but when one draws closer, the twinkle of the stars of the second and third magnitude becomes visible until, finally, one sees the whole constellation--the world is wider and art richer than one had hitherto supposed.\" (57) Goethe thus expands his horizons in Verona.Trying to enjoy the art, the absurdity of the subjects and the awkwardness of their poses gets in the way. Constrained by the Church to its themes and also to those of mythology or infamy, artists cannot fully break free of criminals and mannequins, the nude girl or handsome boy in the crowd around the grotesque figure being martyred or hung or dissected. \"First faith ennobled the arts, then superstition took over and ruined them.\" So he complains, if admitting his \"black mood\" towards history. (110)Yet in Rome, he admires the education, and compares its sights to ideas that mature one by their immersion, the force of the sensual encounter akin to being clad as a grown-up rather than swaddled. \"Here the most ordinary person becomes somebody, for his mind is enormously enlarged even if his character remains unchanged.\" (150) The force of the city draws him in. \"Everywhere else one starts from the outside and works inward; here it seems to be the other way around. All history is encamped within us and all history sets forth again from us.\" (154) So it appears to him as \"Everlasting Rome.\"Leaving Naples, where he had often visited the erupting Vesuvius, daring to near its cone, he reflects: \"When a journey is over, the traveller himself remembers it as an unbroken sequence of events, inseparable from each other. But when he tries to describe this to someone else, he finds it impossible to communicate this, for he can only present the events one by one as separate facts.\" (330) His stays in the North of Italy, Venice, Naples, and Sicily enriches the bulk of his time in Rome, and while I found parts of this slow, the lively and unexpected verve of his telling of the success of St. Filippo Neri and of the Carnivale in Rome enlivened this, as his observations of the impact of both Catholicism and conformity contend with his journalistic-anthropological report from the festival."}, {"review_sentiment": 5.0, "review_text": "Excelllent!"}, {"review_sentiment": 5.0, "review_text": "A true classic."}, {"review_sentiment": 4.0, "review_text": "A little dry at times, but I thoroughly enjoyed it when he was describing his travels through the Alps and southern Alpine regions. It makes me want to return to Malcesine and majestic Lago di Garda. Bellissima!"}, {"review_sentiment": 4.0, "review_text": "Excellent book. But specific. I'm not sure I've met anybody I would recommend this book to. It's a lot like Thoreau's Walden, but less directly philosophical/quotable. Like Walden, there's a lot of stuff to weed through that is not immediately interesting. Lots of notes about the topography of the land from Germany to Italy. Very readable though, he doesn't use big words (maybe because it is translated from German?).Like Walden, this is Goethe's summary of a 2 year trip where he left to confront the essential facts of life. To live deliberately.Probably my favorite quote from the book is the following:\"Now let me also say that a thousand times, ay, at all times, do I think of you in the neighborhood of these objects which I never believed I should visit alone. It was only when I saw every one bound, body and soul, to the north, and all longing for those countries utterly extinct among them, that I resolved to undertake the long solitary journey, and to seek that centre toward which I was attracted by an irresistible impulse….Friends and country have once more become right dear to me, and the return to them is a wished-for object…I feel convinced that I bring with me too many treasures for personal enjoyment for private use, but such as through life may serve others, as well as myself, for edification and guidance.\"Maybe if you're on some kind of Walden/Italian Journey esque part of your life, I'd recommend it. Or if you want to go further into what inspired those New England Transcendentalists. That's why I read it.Lots of notes on art criticism here, some unexpected notes on Goethe's protestantism, I am compelled by many of his comments when he is in both the Italian catholic settings and nature.Since I've finished this one, I've begun The Sorrows of Young Werther, which is what Goethe wrote as a 24 year old that propelled him into fame. Napoleon carried it in his coat when he was conquering nations! Thomas Carlyle called it a perfect tragedy I believe. Carlyle said the sequel, Wilhelm Meister's apprenticeship, was the best expression of humanity he knew of. Werther is a novel that most people agree is pretty autobiographical. More interesting than Italian Journey probably, and shorter."}]}, "authors": ["Johann Wolfgang Von Goethe"], "isbn": "0140442332", "longitude": 12.4829321, "periods": ["1700s"], "title": "Italian Journey: 1786-1788", "word_cloud": "century come back trip completely love food people church museums famous city buy way prolong adventure enjoy description much already plan return trip include thing place describe able travel plan reservation description place people author meet journey beautiful detailed easy entertain beautifully describe virtual tour reason expect text original satisfactory translation comfortable order arrive soon translation perfect very interesting educating travel south first journal full geological botanical detail glance soil alluvial condition plant life around change along language pinpoint german end begin know language able converse high low even understandably focus privileged educate colleague meet full discussion plenty footnote provided translation still show vastly erudite man expand power learn success confidently work art slightly later intellectual encounter artistic aesthetic maturation live far away hear major artist galaxy often satisfied merely know name draw closer twinkle star second third magnitude become visible finally see whole constellation world wider art richer hitherto suppose thus expand horizon enjoy art absurdity subject awkwardness pose get way constrain theme also mythology infamy artist fully break free criminal mannequin nude girl handsome boy crowd grotesque figure martyr hung dissect faith ennoble art superstition take ruin so complain admit black mood towards history yet admire education compare sight idea mature immersion force sensual encounter akin clad rather swaddle here ordinary person become somebody mind enormously enlarge even character remain unchanged force city draw else start work inward seem way history encamp history set forth so appear everlasting often visit erupt dare cone reflect journey traveler remembers unbroken sequence event inseparable try describe someone else find impossible communicate present event separate facts stay enrich bulk time find part lively unexpected verve tell success enliven observation impact conformity contend report festival excellent true classic little dry time thoroughly enjoy describe travel southern region make want return majestic di excellent specific sure meet anybody lot le directly lot stuff weed immediately interesting note topography land readable use big word maybe translated german summary year trip leave confront essential fact life favorite quote follow now also time ya time think neighborhood object never believe visit saw bound body soul north longing country utterly extinct resolve undertake long solitary journey seek center attract irresistible country right dear return feel convince bring many treasure personal enjoyment private use life others well edification guidance maybe kind esque part life recommend want inspired transcendentalists note art criticism unexpected note protestantism compel many comment catholic setting finish begin write year old propel fame carry coat conquer nation call perfect tragedy believe say sequel apprenticeship best expression humanity know people agree pretty autobiographical more interesting probably shorter", "genres": ["Memoir", "Travel Writing"], "summary": "Goethe's account of his passage through Italy from 1786 to 1788 is a great travel chronicle as well as a candid self-portrait of a genius in the grip of spiritual crisis.", "asin": "0140442332", "rank": "160429", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51Ok1UmtePL.jpg", "country": "Italy", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}