{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 52.3727598, "ratings": {}, "authors": ["Multatuli"], "isbn": "0140445161", "longitude": 4.8936041, "periods": ["1800s"], "title": "Max Havelaar: Or the Coffee Auctions of the Dutch Trading Company", "word_cloud": "", "genres": ["Memoir", "Fiction & Literature"], "summary": "When Max Havelaar was first published in Holland in 1860, it ignited a major political and social brouhaha. The novel, written by a former official of the Dutch East Indian Civil Service under the pen name Multatuli, exposed the massive corruption and cruelty rife in the Dutch colony of Java. \r\n\r\nMax Havelaar is an undeniably autobiographical novel; like his hero, Multatuli--the pseudonym for Eduard Douwes Dekker--was an Assistant Resident of Lebak in Java; like Havelaar in the novel, he resigned his position when his accusations of corruption and abuse were disregarded by higher authorities, resulting in years of poverty for both author and fictional hero. Max Havelaar is told from several different perspectives; the reader first meets an Amsterdam coffee dealer named Droogstoppel, a man so obsessed with coffee that his every thought and action is governed by it. \r\n\r\nDroogstoppel has come by a manuscript from an old schoolmate who, down on his luck, has asked him to get it published. The schoolmate is Havelaar, and the manuscript relates his experiences as an idealistic and generous young civil servant who tries to protect the poor and bring justice to the powerless.\r\n\r\nThe central part of the novel details conditions in Java, particularly Havelaar's efforts to correct injustices in the face of a corrupt government system. That his efforts will prove futile soon becomes apparent, and there is something almost Greek in the inevitability of Havelaar's declining fortunes. Despite its tragic themes, Max Havelaar is savagely funny, particularly the chapters narrated by Droogstoppel, a character unmatched for his veniality, narrow-mindedness, or singular lack of understanding or imagination. \r\n\r\nThough Multatuli's masterpiece is nearly 150 years old, it wears its age well, and Roy Edwards's excellent translation offers English-speaking readers a wonderful opportunity to experience one of the Netherlands's great literary classics.", "asin": "0140445161", "rank": "492285", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/51379N4xyML.jpg", "country": "The Netherlands", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}