{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 50, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "I was amazed to see that this book, copywrited in 1999, had only 44 reviews on this site.  This book is based on one of the most famous photos of all times, a young naked Vietnamese girl running after being \"napalmed\".  This book is the story of that girl's life before, during, and after.  Phuc led a life experiencing excruciating pain, yet was lucky to receive the immediate medical treatment that she did receive.Phuc's mother, Nu, had grown a successful business cooking and selling her specialties.  She supported her family and extended family with her hard work, but slowly lost everything after the war ended, and the Communists took over.  She was taxed and regulated out of existence.Phuc became famous because of the picture and was forced to become a propaganda puppet for the Communist government.  While originally studying to become a doctor, she was constantly pulled away from her studies for interviews.  She would be picked up by \"minders\" and taken places, but then would have to find her own way home.  She spent time in Moscow before being sent to Cuba to study English since medicine is deemed to difficult for her.The book was a little slow moving, but included a good history of the wars in Viet Nam and the subsequent war with Cambodia after the Americans left.  The book includes pictures, which is always a plus, but they are not the best quality.  It gives a very good feel of how the citizens in the south had to remain neutral while being pressured by both the South Vietnamese armies and the Viet Cong to assist them.I do object to the claim on page 41 of the book that by the time the My Lai massacre occurred, one third or more of American forces were addicted to drugs.  I hear this garbage all the time about drugs in Viet Nam, but where is the proof of the writer's statistic?  My husband was a Marine in Viet Nam and knew no one who was taking drugs or even wanted to.  I'm sure the drugs existed, but to give the image that everyone was drugged up is despicable to me.If you liked this book, I would heartily recommend another, \"When Heaven and Earth Changed Places\" which is actually mentioned in this book.  It is a little more interesting than this book.  I gave my copy of that book to a Marine Corps Viet Nam veteran.  He was so taken by the book that he went to Viet Nam in search of the village."}, {"review_sentiment": 5.0, "review_text": "This is a very informative insiders/civilians view of the Vietnam war.  It is inspiring to read about this amazing and inspiring survivor of the devastation of war."}, {"review_sentiment": 4.0, "review_text": "Very well done with a lot of information about the war. Sad I wasn't more interested at the time to know more of what was going on!"}, {"review_sentiment": 5.0, "review_text": "I have met and heard a lecture by Kim Phuc and her story is one of love and healing.  The book is very informative and enlightened  me who served in Vietnam in Tay Nihn as to the Vietnamese side of the war.  I found I couldn't put this book down once I started reading it.  Her conversion to Christianity is amazing and certainly illustrates the power of the Bible."}, {"review_sentiment": 5.0, "review_text": "Good book from a war survivor point of view.  Well written memoir from an unique perspective of famous war survivor in war torn Vietnam."}, {"review_sentiment": 5.0, "review_text": "With the read."}, {"review_sentiment": 5.0, "review_text": "A few weeks ago I noticed a reference in the paper about the young South Vietnamese girl who was severely burned by napalm in 1972.  Almost everyone older has seen this iconic photograph.  I bought this book to read about the young girl's tragic injuries, her fight to live, and her life since.  Hers is certainly an interesting story and shows the horrors of war.  I'd certainly recommend this book for anyone who has even a passing interest in the Vietnam War.  The book has a lot about the history of Vietnam and one can learn so much."}, {"review_sentiment": 4.0, "review_text": "Facts about post-war Vietnam and about life in rhe communist part of the planet. A heart rending account of the price we pay for war. Told in a matter of factly way. I was moved and intrigued by this book, which I found in a second hand book store."}, {"review_sentiment": 5.0, "review_text": "An amazing work by Denise Chong, just to think about all the research work...I learned so much, not only about live in Vietnam and about the war, but also how this young women was (ab)used from the regimes, her disabilities, after an almost deadly Napalm bomb hit nearby, used for their propaganda.  Until she finally could flee to Canada where she resides now and where Denise Chong the author lives too.Thank you to Kim Phuc for being so brave and thanks also to the author to let the world know about the real story behind \"The Girl in the Picture\".  A MUST-READ for everyone!I received this book as a gift from a friend, and I am delighted she gave it to me."}, {"review_sentiment": 5.0, "review_text": "\"The Girl in the Picture” is about a girl and her family caught in the midst of the war in Vietnam. The girl, Kim Phuc, was the subject of the famous war-time photo of a young girl running naked out of a village that had been hit by napalm.  It is a riveting, page-turning, biography, and gives a good window into what life was like for a normal family before, during, and after the war in Vietnam (not to mention an interesting picture of life in Castro's Cuba). I learned many details about the Vietnam War that I had previously just heard in passing but not really understood (such as the significance of the Tet Offensive).  Interestingly, when Kim grows up she becomes a Christian through a church in Saigon (Ho Chi Minh City), although this part of her experience makes up only a minor part of the narrative.  This book is a biography as well as a cultural and political history, and author Denise Chong gives a sympathetic and well-written account of Kim Phuc’s life and the global events in which she became an unexpected participant.  You definitely learn about Cold War politics in this book, but the author seems to do a good job of telling the facts without turning the book into a political statement.  It is Kim’s story, rather than a political agenda, that drives the narrative."}]}, "authors": ["Denise Chong"], "isbn": "0140280219", "longitude": 0.0, "periods": ["1900s"], "title": "The Girl in the Picture", "word_cloud": "amaze see copywriter review site base famous photo time young naked vietnamese run napalmed story life lead life experience excruciate pain yet lucky receive immediate medical treatment mother grow successful business cook sell specialty support family extend family hard work slowly lose everything war end take tax regulated become famous force become propaganda puppet communist government originally study become doctor constantly pull study interview pick minder take place way home spend time send study medicine deem difficult little slow moving include good history war subsequent war leave include picture always best quality give good feel citizen south remain neutral pressure vietnamese army assist object claim page time massacre occur third american force addict drug hear garbage time drug proof writer statistic husband know take drug even want sure drug exist give image everyone drug despicable liked heartily actually mention little interesting give copy veteran take go search village informative view war inspire amaze inspire survivor devastation war very well do lot information war interested time go meet heard lecture story love heal informative enlighten serve war find start read conversion amaze certainly illustrate power good war survivor point view write memoir unique perspective famous war survivor war torn week notice reference paper young vietnamese severely burn napalm everyone older see iconic photograph buy young tragic injury fight live life certainly interest story show horror war certainly recommend anyone even pass interest lot history learn much fact life the communist part planet heart rend account price pay war matter factly way move intrigue find second hand store amazing work think research work learn much live war also young woman ab use regime disabilities almost deadly bomb hit nearby use propaganda finally resides author live brave thanks also author let world real story everyone receive gift friend delight give family catch war subject famous photo young run naked village hit napalm rivet biography give good window life normal family war mention interest life learn many detail previously hear pass really understood significance grow becomes christian church part experience make minor part narrative biography well cultural political history author give sympathetic account life global event become unexpected participant definitely learn politics author seem good job tell fact turn political statement story rather political agenda drive narrative", "genres": ["Biography", "History", "Photography", "Journalism"], "summary": "The Story of Kim Phuc, the Photograph, and the Vietnam War\r\n\r\nOn June 8, 1972, nine-year-old Kim Phuc, severely burned by napalm, ran from her blazing village in South Vietnam and into the eye of history. Her photograph-one of the most unforgettable images of the twentieth century-was seen around the world and helped turn public opinion against the Vietnam War.\r\n\r\nThis book is the story of how that photograph came to be-and the story of what happened to that girl after the camera shutter closed. Award-winning biographer Denise Chong's portrait of Kim Phuc-who eventually defected to Canada and is now a UNESCO spokesperson-is a rare look at the Vietnam War from the Vietnamese point-of-view and one of the only books to describe everyday life in the wake of this war and to probe its lingering effects on all its participants.", "asin": "0140280219", "rank": "344581", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/41YxT8aUo6L.jpg", "country": "Hanoi", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}