{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 67, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "Wish Gore was still with us today.  i am sure he would have some fabulous comments about Trupm"}, {"review_sentiment": 4.0, "review_text": "an avalanche of dropped names in this venom soaked memoir by the inimitable Gore Vidal.  Some of the dropped names are rather obscure, some more well known, others iconic.This is a memoir as opposed to an autobiography and Vidal helpfully explains the difference within the text of Palimpsest.The material is purportedly a recollection of events occurring in the author's life through the age of 39 (1964).  In fact, there's plenty of commentary concerning events after 1964 all the way up to the time Palimpsest was written in the early to mid 90s.Vidal's acerbic tongue spares few luminaries from the worlds of politics, literature, theater and high society.  Two brief examples.  Evelyn Waugh: \"drunken social climber\", David, Duke of Windsor: \" riveting stupidity\".  By far the recipient of the most vitriol is an alcoholic society matron named Nina who happened to be GV's own mother.  Evidently, the two were at war with each other and ultimately never communicated for the last 20 years of Nina's life.Much attention is given to the Kennedy family.  To say that Vidal did not buy into the Camelot myth would be an understatement.  He depicts Jackie as selfish and money hungry.  He detested Bobby for a number of reasons and Bobby quite apparently returned the favor.Not everything Vidal states as fact is factual.  For example, he asserts that Jackie Kennedy's maternal grandfather, one James Thomas Lee, was in fact Jewish by birth.  If true, this tidbit of information would be a very interesting revelation.  But, alas, a very quick internet search proves this particular claim to be utterly false.Palimpsest is worthy of a 4 star rating.  I learned many things by reading it as would anyone else motivated to make their way through this gossipy Who's Who.  Though, admittedly, some of the revealed inside information would have been better left kept inside."}, {"review_sentiment": 5.0, "review_text": "READ THIS BOOK.If you're interested in the big view of what happened in 20th century America, Gore Vidal had a singular perspective that spanned more worlds than perhaps any other individual in the century. Palimpsest is him at his witty, vindictive, elegant, catty, erudite, expansive, generous, self-involved finest.  His first-hand perspective on the Kennedy Bros (JFK, RFK), growing up with Jackie O; his complicated friendships with titans of 20th century American art (Bernstein, Nureyev, Kerouac, Tennessee Williams), his vast spite and emnity for others (Capote, Anais Nin), his central involvement in the golden age of American cinema, and his place in the grand experiment of American democracy (first openly gay congressional candidate).And if you don't care about all that, but you want to read a funny, scathing, bitchy (can i say that in an amazon review??) book full of one-line zingers that make you want to chuckle and guffaw and let out a DAYYUM GIRL YOU GOT SCHOOLED, then that's a good enough reason to read this."}, {"review_sentiment": 1.0, "review_text": "Boring assemblage of name-dropping. Who cares?"}, {"review_sentiment": 5.0, "review_text": "Something I've read several times over the years. I like Vidal's company in his memoirs. Intelligence and laughter."}, {"review_sentiment": 3.0, "review_text": "It took me awhile- oh, 20 years, is it?- to read Gore Vidal's hodgepodge of memories, insults, and catty comments. He was good at relating the same from other celebrities he encountered, so, to that extent, the book became readable. Had I known him while living, I doubt very much that I would have tolerated his self-loathing homophobia and false sense of superiority."}, {"review_sentiment": 5.0, "review_text": "Tricky book to love...because Gore Vidal is so pompous. But, I loved it."}, {"review_sentiment": 4.0, "review_text": "Great view of a life \"well lived\".& love story unfullfilled.....hindsight memory? maybe, but a fun read just the same."}, {"review_sentiment": 4.0, "review_text": "I tried to read this when it was first published.  I guess I didn't realize that Gore was homosexual at the time.  Now with that knowledge it make more sense.  He does stray off subject to add personal anecdotes. It is still a good read but I wouldn't say a easy read.  You have to stay on top of the reading to keep track of where he is going."}, {"review_sentiment": 1.0, "review_text": "Gore Vidal, for all his brilliance, has no idea what a memoir is, and in this book wanders willy-nilly making mostly superficial gossipy remarks, either negative or oddball, about the people he knew. Gore admits at one point that the deaths of many of those who knew doesn't bother him much, because he prefers solitude. The man's brilliant intellect was asleep as he wrote this wandering text."}]}, "authors": ["Gore Vidal"], "isbn": "0140260897", "longitude": -77.0366456, "periods": ["1900s"], "title": "Palimpsest: A Memoir", "word_cloud": "wish still today sure fabulous comment avalanche drop name venom soak inimitable drop name rather obscure well know others opposed autobiography helpfully explain difference text material purportedly recollection event occur author life age fact plenty commentary concern event way time write early mid acerbic tongue spare luminaries world politics literature theater high society brief example drunken social climber rivet stupidity far recipient vitriol alcoholic society matron name happen evidently war ultimately never communicate last year attention give family myth depict selfish money hungry detest number reason quite apparently return everything state fact factual example asserts maternal grandfather fact birth true tidbit information revelation ala quick internet search prove particular claim utterly worthy star rating learn many thing read anyone else motivate make way gossipy who admittedly reveal inside information leave kept interested big view happen century singular perspective span world perhaps individual century witty vindictive elegant catty erudite expansive generous finest perspective grow complicate friendship titan century american art vast spite enmity others central involvement golden age american cinema place grand experiment democracy first openly gay congressional candidate care want funny scathing bitchy say amazon review full zinger make want chuckle guffaw let good enough reason boring assemblage care something several time year like company memoirs laughter take year hodgepodge memory insult catty comment good relate celebrity encounter extent become readable know live doubt much tolerate homophobia false sense superiority love pompous love view life well live story unfulfilled memory maybe fun try first publish guess realize homosexual time now knowledge make sense stray subject personal anecdote still good easy stay top reading track go brilliance idea wanders make mostly superficial gossipy remark negative oddball people know admit point death many know bother much prefers solitude man brilliant intellect asleep write wander text", "genres": ["Memoir", "LGBT"], "summary": "This explosively entertaining memoir abounds in gossip, satire, historical apercus, and trenchant observations. Vidal's compelling narrative weaves back and forth in time, providing a whole view of the author's celebrated life, from his birth in 1925 to today, and features a cast of memorable characters—including the Kennedy family, Marlon Brando, Anais Nin, and Eleanor Roosevelt.", "asin": "0140260897", "rank": "433127", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/41tylpnHHZL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}