{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 17, "rating": 4.0, "reviews": [{"review_sentiment": 2.0, "review_text": "Not as interesting as some of his other works."}, {"review_sentiment": 5.0, "review_text": "Great story and puts a new perspective on the PBS Masterpiece Theatre production of The Paradise."}, {"review_sentiment": 4.0, "review_text": "Interesting to see the difference and the similarities with the PBS series."}, {"review_sentiment": 4.0, "review_text": "good"}, {"review_sentiment": 4.0, "review_text": "It is difficult to sort through the myriad characters employed in this rising department store. However, I must differ with all those complaining of the long descriptions. It shows ignorance of style and impatience, the desire for a quick read. Some of us, trained in literary criticism, find these descriptions, some very poetic, the best part of the novel, the poetic heart essentially. There is one description of a sale, with \"rivers\" of customers, the islands of clothes, the rippling around obstacles that is fascinating. I recommend that instead of getting bored with this, one should examine the long metaphor and how very cleverly it is sustained."}, {"review_sentiment": 5.0, "review_text": "I'm not an academic but I think the translation is good.  I also like the convenient, portable size of the book.  And I like the cover."}, {"review_sentiment": 5.0, "review_text": "After watching and loving \"The Paradise\" on PBS, I bought this book and thought it was wonderful--especially when all of the staff was in the store."}, {"review_sentiment": 4.0, "review_text": "That's what makes this novel more than a soap opera. The detail about the store construction, merchandise assortments and displays, inventory taking, and other early retail practices is purely fascinating. It's a wonderful view of business history. Before WalMart, the Ladies Paradise drove small tradesmen out of business! How prescient of Zola.I admit the Denise thread gets tedious and predictable toward the end. But she too is a bit unusual for a 19th century heroine. She didn't moon around trying to get a man to support her.Full disclosure: I spent five years working for a mass merchandiser. That's why the business detail is so fascinating to me."}, {"review_sentiment": 4.0, "review_text": "To fill in the gaps of The Paradise BBC tv show, this one is very good. Enjoyed it. Would recommend it for those interested in the \"real story\"."}, {"review_sentiment": 5.0, "review_text": "Domination is the name of the game. Octave Mouret, anti-hero of `Pot Bouille', has made it to the top of the heap. He has exceeded his own wildest dreams. He has invented the department store. His Au Bonheur des Dames rules the retail commerce in the Paris of the 1860s. He has married the woman that he had targeted for himself and is now a happy widower who can seduce and drop as many women as he pleases.This novel is volume 11 of the Rougon Macquart series, and it can really be called a sequel to volume 10, Pot Bouille, in the same way as Nana is a sequel to L'Assommoir. Times and manners of the 2nd Empire under Napoleon III were deeply obnoxious to Zola. His disgust did not blur his vision.Au Bonheur des Dames could serve well as an illustration to contemporary theories of capital concentration, such as the one that Karl Marx, in his London library, developed in his magnum opus Das Kapital. Whatever one thinks of Marx as a philosopher and politician, it can hardly be denied that his economic theory was on to something, despite essential doubts about his value theory. He developed the classical theories inherited from Smith and Ricardo into a different direction than other followers of that school, say the so-called Neoliberals following Hayek a.o. The recent crashes have apparently revived interest in Marx as an economist. Well worth a visit! I am digressing. Zola himself is also interesting as a historian of management.  His Mouret is crafted after some real life business moguls who came up with the department store, mail order sales, supply chain management, sales incentives, staff bonus systems,  innovative sales price strategies, employee shareholding in expanding companies, outrageous salaries for top managers, real estate corruption, and all the other familiar modern day practices.The second main theme of the novel is Mouret's obsession with being victorious with women. Early on, his main business peer predicts that one day a woman will come who will take revenge for all her humiliated sisters.My conclusion: this works for me mainly as a work of history. It is harder to take an interest in the persons of this novel as people. They are pawns in a plan, Zola's plan. That diminishes admiration for the novel as `art' somewhat, but its historical values still merit 5 stars."}]}, "authors": ["Emile Zola"], "isbn": "0140447830", "longitude": 2.3514992, "periods": ["1800s"], "title": "Au Bonheur des Dames", "word_cloud": "not interesting work story put new perspective production interest see difference similarity series good difficult sort myriad character employ rise department store however complain long description show ignorance style impatience desire train literary criticism find description poetic best part poetic heart essentially description sale river customer island clothes ripple obstacle fascinate recommend instead get bore examine long metaphor cleverly sustain academic think translation good also like convenient portable size like cover watch love buy think wonderful especially staff store make soap detail store construction merchandise assortment display inventory take early retail practice purely fascinate wonderful view business history small tradesman business prescient admit thread get tedious predictable end bit unusual century heroine moon try get man support disclosure spend year work mass merchandiser business detail fascinating tv show good interested real story name game make top heap exceed wildest dream invent department store rule retail commerce marry woman target happy widower seduce drop many woman volume series really call sequel volume way sequel manner deeply obnoxious disgust blur well illustration contemporary theory capital concentration library develop magnum opus think philosopher politician hardly deny economic theory something essential doubt value theory develop classical theory inherit different direction follower school say neoliberal follow recent crash apparently revive interest economist visit digress also interest historian management craft real life business mogul come department store mail order sale supply chain management sale incentives staff bonus system innovative sale price strategy employee shareholding expand company outrageous salary top manager real estate corruption familiar modern day second main theme obsession victorious woman early main business peer predict day woman take revenge humiliate conclusion work mainly work history harder interest person people pawn plan plan diminish admiration somewhat historical value still merit star", "genres": ["Fiction & Literature"], "summary": "Through charm, drive, and diligent effort Octave Mouret has become the director of one of the finest new department stores in Paris, Au Bonheur des Dames. Supremely aware of the power of his position, Mouret seeks to exploit the desire that his luxuriantly displayed merchandise arouses in the ladies who shop, and the aspirations of the young female assistants he employs. \r\n\r\nCharting the beginnings of the capitalist economy and bourgeois society, Zola captures in lavish detail the greedy customers and gossiping staff, and the obsession with image, fashion, and gratification that was a phenomenon of nineteenth-century French consumer society. \r\n\r\nOf all Zola's novels, this may be the one with the most relevance for our own time.", "asin": "0140447830", "rank": "867874", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/516iDUakI5L.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}