{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 43, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "BIG fan of Vietnam war novels, never read one from the North Vietnamese perspective. Very interesting."}, {"review_sentiment": 5.0, "review_text": "interesting read---gives some insight to NVA long term strategy, not well written; however, maybe due to translation to English."}, {"review_sentiment": 5.0, "review_text": "This is a very poweful novel. I was assigned this book for my Literature of the Exile class.The story is told by a 28-year old narrator that have spent his entire adult life fighting for the Communist North in the Vietnam war. It gives a very horrific look into the lives of the \"enemy\" side of the war that exposes the reality of war. There are no winners or losers. There's only death and destruction.The narrator faces complex battles with his beliefs in the Communist party, the home he left behind, the life he never got to live, the men he watched die, and the end that seemed nowhere in sight. It's a beautifully written book that I think many American veterans will be able to identify with the narrator who had joined the with the North for no other reason other than he was taught all his life that it was his duty to fight for his country and the people he loved.I defininetly recommend this book."}, {"review_sentiment": 4.0, "review_text": "Decent read. A bit boring as I thought it would relate fighting w/American Soldiers. Still a good read showing the trials & tribulations of a formidable enemy during the VN War."}, {"review_sentiment": 5.0, "review_text": "Great Read"}, {"review_sentiment": 4.0, "review_text": "A good read"}, {"review_sentiment": 5.0, "review_text": "I really enjoy this book. This author clearly loves her country and yet she was kicked out for writing books like this. It is a very enlightening perspective of a warrior serving his purpose to his country but slowly comes to realize the issues with his purpose."}, {"review_sentiment": 3.0, "review_text": "OK book but I think there were alot more to the story then told."}, {"review_sentiment": 5.0, "review_text": "This story by Duong T. Huong is very much worth reading but not for it's details (lack thereof) of the events and tactics of the North Vietnamese Army's (NVA) strategies for winning the war against the South Vietnamese government of which there is very little.  If you read description about her and her life in Vietnam at http://vietnamlit.org/wiki/index.php?title=Duong_Thu_Huong you will get a much better understanding for the motivation for her writing this book and the purpos of many of the stories she relates through the main character, Quan.  It was very obvious to me that the book was meant primarily as a sharp critic of the Vietnamese Communist Party.  In summary, this book is a political assault on the Communist government, the merciless ravages of war on the common soldier, and the suffering of the general populace.  As a \"one year tour\" veteran of the Vietnam War, I gained a better appreciation for the enormous sacrifice of the common North Vietnamese soldier for whom the war was not a \"one year tour\" but a \"for the duration\" war in which many didn't survive.  Many of the NVA  soldiers (bodies) bore tattoos that said \"Born in the North to Die in the South\".  It is not an uplifting story with a happy ending."}, {"review_sentiment": 5.0, "review_text": "Why read a book written by a Viet Cong, our enemy in the Vietnam Conflict? To understand the big picture. To understand the 'enemy'. To get a glimpse of hell on earth brought by humans. Not so very different from today's wars on the planet. I think this is a must read for everyone wanting to understand war. God Bless us All. We need it."}]}, "authors": ["Duong Thu Huong"], "isbn": "0140255109", "longitude": 0.0, "periods": ["1900s"], "title": "Novel without a Name", "word_cloud": "fan war novel never vietnamese perspective interesting interest insight long term strategy well write however maybe due translation powerful assign story tell old narrator spend entire adult life fight war give horrific look live enemy side war expose reality war winners loser death narrator face complex battle belief party home leave life never get live men watch die end seem nowhere sight beautifully write think many american veteran able identify narrator join reason teach life duty fight country people definitely recommend bit bore think fight soldier still good showing trial tribulation formidable enemy read good really author clearly love country yet kick write enlighten perspective warrior serve purpose country slowly come issue ok think a lot story tell story much read detail lack thereof event tactic vietnamese strategy win war vietnamese government little description life http much better understand motivation write purpose many story relate main character yuan obvious mean primarily sharp critic summary political assault communist government merciless ravage war common soldier suffer general populace year tour veteran gain better appreciation enormous sacrifice common war year duration war many survive many soldier body bore tattoo say uplift story happy end write enemy big picture glimpse hell earth bring human not different today war planet think everyone want understand war need", "genres": null, "summary": "“Reminiscent of All Quiet on Western Front and The Red Badge of Courage. . . .  A breathtakingly original work.\"—San Francisco Chronicle\r\n\r\nTwenty-eight-year-old Quan has been fighting for the Communist cause in North Vietnam for a decade. Filled with idealism and hope when he first left his village, he now spends his days and nights dodging stray bullets and bombs, foraging scraps of food to feed himself and his men. Quan seeks comfort in childhood memories as he tries to sort out his conflicting feelings of patriotism and disillusionment. \r\n\r\nThen, given the chance to return to his home, Quan undertakes a physical and mental journey that brings him face to face with figures from his past—his angry father, his childhood sweetheart, his boyhood friends now maimed or dead—and ultimately to the shattering reality that his innocence has been irretrievably lost in the wake of the war. \r\n\r\nIn a voice both lyrical and stark, Duong Thu Huong, one of Vietnam’s most beloved writers, powerfully conveys the conflict that spiritually destroyed her generation.\r\n\r\n“If it is a crime to take an unflinching look at the reality of war and life under a totalitarian regime, and to do it with great art and mastery, then Duong Thu Huong, is gloriously guilty.” The New York Times ", "asin": "0140255109", "rank": "314487", "city": "Hanoi", "image": "https://images-na.ssl-images-amazon.com/images/I/413wRSL3zWL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}