{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 41, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "I like it."}, {"review_sentiment": 3.0, "review_text": "The book is wonderful, so is the translation. My only issue was the lack of numbering in the chapters. It is one continues set of paragraphs with distinctive sections other than what you have in the header on the top of the page. Because the \"lines\" (as they are referred to in the classics, they're basically mini-chapters that Livy organized his story into) are not marked in the page, the indications on the header often skip chapters, which makes it tricky if you're doing academic citations.To conclude, if you need this for schoolwork/academia or like to keep track of chapters, do not get this edition. If you just want the content in one continuous 300 page-paragraph this works perfectly fine."}, {"review_sentiment": 3.0, "review_text": "I had to read it for school."}, {"review_sentiment": 5.0, "review_text": "It's Livy - a classic.  It's excellent.  Great translation as far as I can tell, but I'm not a Latinist."}, {"review_sentiment": 5.0, "review_text": "Really interesting history on the early Roman period, a time period which isn't really as famous or explored as the later Roman eras. It can be a bit dry and dull at points, but it is really interesting to see the rise of Roman politics and beliefs as told by a descendant in the later eras."}, {"review_sentiment": 5.0, "review_text": "Titus Livius (nicknamed Livy by historians) was a Roman historian who lived during the late republic and early imperial era. During his adult life he wrote a massive, 142 book history of Rome starting with the foundation story until the reign of Augustus. Of those books, thirty-five of them have survived history to be with us today. This particular book is a compilation, translated from its original Latin into English, of the first five books that cover the earliest history of Rome. This starts with the foundation myth with the legendary brothers Romulus and Remus and ends with the sack of Rome by the Gauls in c. 390 BCE.Livy did not write in a way that a modern person would expect a historian to write. He instead uses narrative to tell this story of Rome. This has made it frustrating for modern scholars as it is difficult to tell what is historical fact and what was just a fabrication to fill in gaps. After all, most of the historical records of Rome were destroyed during the 390 BCE sack, so one does have to wonder what sources Livy used in writing this.This compilation contains some of the most important stories from early Rome including the reign of the legendary seven kings, the overthrow of the monarchy and the establishment of a republican form of government, disputes between the patricians and the plebeians, and the constant warring between Rome and neighboring tribes. In fact, war takes up a large part of these five books making reading it difficult at times due to its repetitious nature as year after year there is some kind of battle mentioned.Still, this is one of the best records we have today of Rome's early history and it is worth a read for those interested in Ancient Rome."}, {"review_sentiment": 2.0, "review_text": "The kindle ebook does not include section numbers."}, {"review_sentiment": 5.0, "review_text": "Ok."}, {"review_sentiment": 4.0, "review_text": "Gets a bit repetitive... Useful as a reflection of ancient Roman values and culture."}, {"review_sentiment": 5.0, "review_text": "Good book. Livy is a good writer."}]}, "authors": ["Titus Livy"], "isbn": "0140448098", "longitude": 12.4829321, "periods": ["Pre Common Era"], "title": "Livy: The Early History of Rome", "word_cloud": "like wonderful translation issue lack number chapter continue set paragraph distinctive section header top page line refer classic basically organize story mark page indication header often skip chapter make tricky academic conclude need track chapter get edition want content continuous work perfectly fine school classic excellent translation far tell latinist really interesting period time period really famous explore later eras bite dry dull point really interest see rise politics beliefs tell descendant later era nickname historian historian live late republic imperial era adult life write massive start foundation story reign survived today particular compilation translate original first cover earliest start foundation myth legendary brother end sack write way modern person historian write instead use narrative tell story make frustrating modern scholar difficult tell historical fact fabrication fill gap historical record destroy sack wonder source use write compilation contains important story include reign legendary king overthrow monarchy establishment republican form government dispute patrician plebeian constant war neighbor tribe fact war take large part make reading difficult time due repetitious nature year year kind battle best record today worth interested kindle book include section number ok get bite repetitive reflection ancient value culture good good writer", "genres": ["History", "Religion", "Literary Theory & Criticism", "Ancient Rome", "Politics"], "summary": "With stylistic brilliance and historical imagination, the first five books of Livy's monumental history of Rome record events from the foundation of Rome through the history of the seven kings, the establishment of the Republic and its internal struggles, up to Rome's recovery after the fierce Gallic invasion of the fourth century B.C. \r\n\r\nLivy vividly depicts the great characters, legends, and tales, including the story of Romulus and Remus. Reprinting Robert Ogilvie's lucid 1971 introduction, this highly regarded edition now boasts a new preface, examining the text in light of recent Livy scholarship, informative maps, bibliography, and an index.", "asin": "0140448098", "rank": "102905", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/41aLqqrZiYL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}