{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": -4.3217055, "ratings": {"num_ratings": 50, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Well, goshdarnit. I'd just written up an erudite, detailed review of A BURNT-OUT CASE, and the computer ate it. So, what the hell, this books's been around for over fifty years, and in that time it's been acknowledged as one of Graham Greene's best. I'll concur with that, being a Greene fan. I've also read THE POWER AND THE GLORY, THE QUIET AMERICAN and THE HUMAN FACTOR. All were simply superb. And so was this one, set in a leper colony in the Congo, with subtle nods to HEART OF DARKNESS and Father Damien. Here are a couple of my favorite quotes from the book: \"Why did he [God] give us genitals then if he wanted us to think clearly?\" ... and ... \"Sometimes I think God was not entirely serious when he gave man the sexual instinct.\"Yes,there's a lot in here about the Catholic Church and religion, which is true of almost all of Greene's books, but the above quotes indicate that even a great novelist like Greene understood that sometimes even the most intelligent of men are ruled by baser instincts. This is a great book. Greene was at the top of his game. My highest recommendation.- Tim Bazzett, author of the memoir, BOOKLOVER"}, {"review_sentiment": 5.0, "review_text": "Once upon a time Querry was a famous architect renowned for his churches until one day he decided to be the least famous person at an African leper colony.  Unfortunately for him even in the days before social media and cellphone cameras it was apparently hard to stay out of sight without the world eventually figuring it out.  So let the circus commence!I have to preface this by saying I actually liked this book but boy does Greene wield the most subtle sledgehammer in existence in trying to make his point, which seems to be, \"Boy, pious Catholics sure are hypocrites now, ha ha?\"  Frankly, its not the most original point in the world (unless he was the first person to make it, in which case I guess half kudos and half \"what took everyone so long?\") since in this day and age we don't have to go too far or too long to see a person lecturing us on morality from a place of pure devotion revealed to not be the best at following their own advice.  Real life gives us enough ammunition to take down the hypocritical with a barrage of hilarious memes (whether deserved or not, glass houses and all that) so what exactly do we need a novel that basically proves what we already know?Part of me may be the \"oh geez look at these jerks I'm so glad that isn't me\" aspect of it, although in my case I wouldn't go patting myself on the back too often without getting a couple second or third opinions just yet.  For me its his characterizations of Querry and some of the people around him who aren't using him to prove how much more Catholic than thou they are . . . Querry arrives at the colony as a man drained of all interest in anything beyond making it to the next day and thus crossing off one more day until sweet oblivion claims him off his calendar but as he gets more involved with the patients and the day to day he gradually starts becoming more like a person again, while acting like a fairly grumpy person to everyone around him.I think its that gradual shift that interests me the most in what Greene is doing here.  Querry at times reminds me of the architect from \"The Fountainhead\" in his complete confidence that he's right and his complete disinterest in telling you how wrong you are because he's left all his caring behind in England somewhere, probably wrapped in one of those soggy fish and chips papers.  He arrives not interested in architecture any longer and leaves the book as uninterested as when we meet him, for reasons that make complete sense to him.  He's already made his decision and won't be argued or persuaded, there's zero point in trying.  And the people who work the best with him over the course of the book are the ones who understand and let him work within the narrowly defined borders he has sketched out for himself.  There's a steadiness to his reluctance and still plenty of room to move inside that steadiness I find interesting, how minimalist the character is and how acutely affecting Greene makes his \"I don't care about anyone anymore and I don't care if you care\" stance.  There's an honest weariness to it that fits the setting almost too well, the physical mutilations and escalating sense of futility mirroring Querry's internal wreckage and the peace he tries to find for himself.  He's not conflicted at all about his new path (or lack of path), he's made his decision and he's sticking with it, despite everyone else being all too willing to throw in their unwelcome two cents.Of course writing a book where your central character is at a grudging peace with himself and his gradual detachment from the world wouldn't be the most exciting prospect unless you like reading about a man whose every action confirms that his initial decisions were correct.  To that end Greene populates the colony and the surrounding area with various people who can't understand Querry's new stance and attempt to redefine it (and him) in their own terms, creating the rare book where its possible to not like anyone outside of maybe two people.  Is it a coincidence that most/all of them cite their Catholic faith as their reasons for \"helping\" him?  In real life probably not if you go on a church trip and decide that's the best time to expound on your views about the Bible having a terrible plot with no real climax but in most cases no.  Here it subtracts a little from Greene's crafted realism to have nearly every person be pig-headed for reasons that boil down to being Catholic (admittedly, some of those people are priests so its allowable I suppose), especially since being massively hypocritical isn't a trait specific to the very religious (Greene tips his hand a bit too much by making one of the more sympathetic supporting characters, the doctor of the colony, an affirmed atheist).  It provides a nice contrast to Querry's quiet assistance to the colony (I imagine suggesting who is really the most Catholic) but people like Rycker or the reporter Parkinson are so clearly out for themselves (the former having convinced himself otherwise, the latter not caring who knows) when it comes to using made up stuff about Querry to make them feel better about their own lives that you wonder why the book doesn't consist of more scenes of people getting punched in the face.And maybe it would have ended that way if Greene didn't decide to have the slowly closing net of tragedy form itself around Querry.  Its not a development that seems obvious from the beginning of the book but once the ball starts rolling downhill its amazing how quickly we get there.  You can argue that the end result isn't as inevitable as the book seems to think it is but its also very likely you're going to get to a certain point and think to yourself, \"I don't see this ending well.\"  But what I do admire about the book is how when we leave Querry he hasn't regained his old zest for life, he isn't feverishly beginning to design his masterpiece, he hasn't found a love that rekindles his faith in humanity, he's changed in subtle ways but all of them are to bring him to a peace with his own new core.  That's a tricky balancing act, to write a character where the book isn't pulling for a typical redemption storyline and still have him wrapped in an aura of contentment by the time its over.  For me, that's where the power of the book lies and ultimately what it seems to be suggesting.  Querry at one point comments that for all his work on churches (most of which was seemingly ruined by people who wanted it to seem more \"churchy\") the churches that really blew his mind were the medieval ones designed by now anonymous people who didn't care if anyone knew their names as long as the design was able to express the power of their faith.  Everything he made he created for himself and he can't compete with notion of surrendering to the idea of a higher cause.  The best he can do is immerse himself in the crowd.  His reasons for working for the good of the colony are ultimately selfish (he's only doing it to make himself feel better and makes no bones about it) but the results of his actions are expressive in themselves and something worth considering in a world where people often seem to be clawing over one another in an effort to make sure they get credit for any deed, good or bad, to the point where it often obscures how much more needs to be done."}, {"review_sentiment": 5.0, "review_text": "These are each powerful experiences and well presented by the Folio Society."}, {"review_sentiment": 4.0, "review_text": "Neatly plotted story with great characters, the usual moral and religious dilemmas, atmosphere of hot, humid, leprosy-infested west Africa of the time, 1950s? A bit too heavy on the religious viewpoints of the different protagonists but nevertheless a powerful tale."}, {"review_sentiment": 4.0, "review_text": "A man struggles with his doubts or the story of one man's search for peace.  Or as Greene puts it\" He doubts his  doubts."}, {"review_sentiment": 5.0, "review_text": "Graham Greene was one of the finest writers in the last century not to have won a Nobel Prize. I still can't believe that the Lord of the Flies dude won a Nobel and Greene did not. But alas, not much we can do about that. Having read Greene's three very important books, The Power and the Glory, The End of the Affair and The Heart of the Matter I confess that I was unaware that A Burned Out Case was in the same league. I have to say that I read The Heart of the Matter and The End of the Affair while on a climbing expedition in Alaska in 1969 with the writer David Roberts. Everybody on the expedition read the books and we would all be brought to attention when somebody would shout, \"Listen to this\"! and proceed to read some extraordinary insightful prose of Greene describing somebody or circumstance perfectly. I came to A Burnt Out Case by having read Greene's little book, In Search of a Character in which he describes a trip to Africa looking for a leper colony and some hint that would provide the germ of the story he wanted to write. The result was A Burnt Out Case, a marvelous story about art, integrity, love and jealousy."}, {"review_sentiment": 4.0, "review_text": "An interesting novel about existential crises."}, {"review_sentiment": 3.0, "review_text": "I hadn't read Graham Greene in many years. His style takes some getting used to. The reason I sought out this lesser known of his novels was because a church sermon used it as an examples of putting ego aside, and just using one's talents where they are needed. This reference was enough to cause me to seek out the novel. I couldn't find it in my library, so I bought is 'used' on Amazon. As for story line and depth of character, I gave it 3*. However, to gain a fuller understanding of the sermon reference I would give it 5*."}, {"review_sentiment": 4.0, "review_text": "I'm not sure what to make of A Burnt Out Case. I was really looking forward to reading it after having read Graham Greene's previous output, some of which (The Power and the Glory, The Heart of the Matter, The End of the Affair) is fantastic. Here, the early chapters were promising but the drama flagged as the story proceeded. While I like the idea of a man who is awash in spiritual ennui seeking solace at the symbolic end of the world, a leper colony in the jungles of the Congo, and the metaphor of the \"burnt out case,\" a leper who is \"cured\" despite being mutilated, I didn't like the book's ending, which struck me as melodramatic and cliched.The story focuses on Querry, a celebrity architect who leaves, fame, mistress and wealth behind to travel to a remote leper colony in the heart of Africa, where he makes himself useful doing menial chores and eventually helping the priests who run the colony design and build a rudimentary new hospital. Along the way, Querry meets up with Rycker, the owner of a palm oil processing plant who lives nearby, and Rycker's young wife Marie. Rycker is a former seminarian who knows canon law inside out and true Christianity not at all. He treats his wife like a hired whore whose only purpose is to keep him from committing sin (it is better to marry than to burn, per St. Augustine).By contrast, most of the priests and nuns in the colony worry more about easing the suffering of the lepers than strictly toeing the doctrinaire line. They are supported in this by Dr. Colin, the colony's resident physician who is an atheist who has made peace with the religious community, recognizing a common interest in helping the lepers. Hence, the contrast is between those who live in the head and those who live in the heart and, clearly, by-the-book Rycker comes off looking by far the worst. Querry, meanwhile, just wants to be left alone.Just about any Greene is worth reading, and this is too but it's a notch or two below his best work."}, {"review_sentiment": 4.0, "review_text": "Almost one of Greene's greats, but defeats itself with tedious Catholic hand-wringing and an anticlimactic ending."}]}, "authors": ["Graham Greene"], "isbn": "0140185399", "longitude": 15.3125974, "periods": ["1900s"], "title": "A Burnt-Out Case", "word_cloud": "well goshdarnit write erudite detailed review computer ate hell fifty year time acknowledge best concur fan also simply superb set leper colony subtle nod here couple favorite quote genitals want think clearly sometimes think entirely serious give man sexual instinct lot religion true almost quote indicate even great novelist understood sometimes even intelligent men rule baser instinct great top game highest author memoir once upon time famous architect renowned church day decide least famous person leper colony unfortunately even day social medium cellphone camera apparently hard stay sight world eventually figure let circus commence preface say actually like boy wield subtle sledgehammer existence try point seem pious sure hypocrite ha ha original point world first person make guess half kudos half take everyone long day age go far long person lecture morality place pure devotion reveal best follow advice real life give enough ammunition hypocritical barrage hilarious meme deserved glass house exactly need basically prove already know gee look jerk glad aspect pat back often get couple second third opinion yet characterization people use prove much thou arrive colony man drain interest anything make next day thus cross day oblivion claim calendar get involved patient day day gradually start become person act fairly grumpy person everyone think gradual shift interest time remind architect complete confidence right complete disinterest tell wrong leave care somewhere probably wrap soggy fish chip paper arrive interested architecture longer leave uninterested meet reason make complete sense already make decision persuaded point try people work best course one understand let work narrowly defined border sketch steadiness reluctance still plenty room move steadiness find interesting minimalist character acutely affect make care anyone anymore care care stance honest weariness fit set almost well physical mutilation escalate sense futility mirror internal wreckage peace try find conflict new path lack path make decision stick everyone else willing throw unwelcome course write central character grudge peace gradual detachment world prospect read man action confirm initial decision correct populates colony surround area various people new stance attempt redefine term create rare possible anyone outside maybe people be coincidence cite faith reason help real life probably go church trip decide best time expound view terrible plot real climax case here subtract little craft realism nearly person reason boil admittedly people priest allowable suppose especially massively hypocritical trait specific religious tip hand bit much make sympathetic support character doctor colony affirm atheist provide nice contrast quiet assistance colony imagine suggest really catholic people reporter clearly former convince otherwise latter care know come use make stuff make feel better life wonder consist scene people get punched maybe way decide slowly close net tragedy form development seem obvious begin ball start roll amaze quickly argue end result inevitable seem think also likely go certain point think see end well admire leave regain old zest life feverishly begin design masterpiece find rekindles faith humanity change subtle way bring peace new core tricky balancing act write character pull typical redemption story line still wrap contentment time power lie ultimately seem suggest point comment work church seemingly ruin people want seem church church really blow mind medieval one design anonymous people care anyone know name long design able express power faith make create notion surrender idea higher best immerse reason work good colony ultimately selfish make better make bone result action expressive something worth consider world people often seem claw effort make sure credit deed good bad point often obscure much need do powerful experience well present neatly plot story great character usual moral religious dilemma atmosphere hot humid west time bit heavy religious viewpoint different protagonist nevertheless powerful tale man struggle doubt story man search peace put doubt doubt finest writer last century still dude ala much important confess unaware burn league say climb expedition writer expedition attention somebody extraordinary insightful prose describe somebody circumstance perfectly come little describe trip look leper colony hint germ story want result marvelous story art integrity love jealousy interesting existential crisis many year style take get use reason seek lesser know novel church sermon use example put ego aside use talent need reference enough cause seek library buy story line character give however gain fuller understand sermon reference sure really look forward read previous output fantastic here early chapter promise drama flag story proceed like idea man awash spiritual ennui seek solace symbolic end world leper colony jungle metaphor burnt leper cure mutilate end struck melodramatic story focus celebrity architect leave fame mistress wealth travel remote leper colony heart make useful menial chore eventually help priest run colony design build rudimentary new hospital way meet owner palm oil processing plant live nearby young wife former seminarian know canon law true treat wife hire whore purpose keep commit sin better marry burn contrast priest nuns colony worry ease suffer leper strictly toe doctrinaire line support colony resident physician atheist make peace religious community recognize common interest help leper contrast live head live heart clearly come look far worst meanwhile want leave worth read notch best work almost great defeat tedious anticlimactic end", "genres": ["Fiction & Literature"], "summary": "Querry, a world-famous architect, is the victim of a terrible attack of indifference: he no longer finds meaning in art or pleasure in life. Arriving anonymously at a Congo leper village, he is diagnosed as the mental equivalent of a \"burnt-out case\", a leper who has gone through a stage of mutilation. However, as Querry loses himself in work for the lepers his disease of mind slowly approaches a cure. Then the white community finds out who Querry is...", "asin": "0140185399", "rank": "151697", "city": "Kinshasa", "image": "https://images-na.ssl-images-amazon.com/images/I/5141ZAvltyL.jpg", "country": "DR Congo", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}