{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 58, "rating": 3.6, "reviews": [{"review_sentiment": 1.0, "review_text": "Package arrived OPENED AND EMPTY!. I did not receive this book and had to order another one :("}, {"review_sentiment": 4.0, "review_text": "An entertaining tale of a young mixed-race Londoner - father a Muslim Indian, mother English- growing up in the 1970s. When his father is taken up by the artistic Eva, and becomes something of a local celebrity with his yoga seminars, our hero, Karim, sees a new and exciting world opening up, even as he pities his mother, left behind. The whole feel of the era is well-drawn - the craze for the new and exotic, the sex, drugs and music, but also the racism and political discontent.There are some great characters here: the strong-minded Jamila, long-suffering immigrant Changez, and many pretentious types whom Karim encounters through the theatre.Enjoyable read."}, {"review_sentiment": 5.0, "review_text": "One of the best books of its era that I reread recently, grateful to discover that it really does stand the test of time. Funny, original, moving, evocative, plausible, packed full of wry social commentary and tender towards even its most monstrous characters. And such a distinctive voice! A book to relish."}, {"review_sentiment": 4.0, "review_text": "My purchase was good. It was used, and I may have purposely bought it like that, even though I only try to purchase books that are \"like new\" or \"new.\" It was sent on time and I have no issues, besides the quality of the outside of the book.Okay, this book is probably one of the greatest pieces of contemporary literature that is available today. It follows Karim, born in England as a second generation Indian to parents, both with ties back to that country. The mother wants to remain tied, but the father loves the idea of this new, first-world ideals and freedom. Karim goes through life now knowing where he belongs, because of his obvious skin tone and his surroundings. It takes place over many years and you see various things happen to Karim. This book has drug use, sexuality, sensuality, and more, but it is just one of those coming-of-age novels that is BRILLIANT. It is a must-read for those who like to read, have an identity crisis, or anything. It's that good and it is something that should be read by most adults."}, {"review_sentiment": 5.0, "review_text": "This book shocked me, intrigued me, and captivated me.  I will be keeping this hard copy in my permanent collection.  I absolutely loved it!"}, {"review_sentiment": 3.0, "review_text": "This book gives a good view of how much times have not quite changed."}, {"review_sentiment": 4.0, "review_text": "Bought it for my English class. It is interesting to read."}, {"review_sentiment": 2.0, "review_text": "So disappointing that I did not bother to finish the book. Funny? Not to my taste."}, {"review_sentiment": 5.0, "review_text": "One of my favorites."}, {"review_sentiment": 3.0, "review_text": "Well written but not really my type of story. Young male entering adulthood, trying to find himself."}]}, "authors": ["Hanif Kureishi"], "isbn": "014013168X", "longitude": -0.12574, "periods": ["1900s"], "title": "The Buddha of Suburbia", "word_cloud": "package arrive receive order one entertaining tale young father mother grow father take artistic become something local celebrity yoga seminar hero see new excite world open even pity mother leave whole feel era craze new exotic sex drug music also racism political great character immigrant many pretentious type encounter best era reread recently grateful discover really test time original move evocative plausible pack full wry social commentary tender towards even monstrous character distinctive voice relish purchase good use purposely even try purchase new new send time issue quality probably greatest piece contemporary literature available today follow born second generation indian parent tie back country mother want remain tied father love idea new ideal freedom go life know belongs obvious tone surroundings take place many year see various thing happen drug use sexuality sensuality novels identity crisis anything good something adult shock intrigued captivate keep hard copy permanent collection absolutely love give good view much time quite change class interest so disappointing bother finish not favorite well write really type story male enter adulthood try", "genres": ["Fiction & Literature", "Humour"], "summary": "Karim Amir lives with his English mother and Indian father in the routine comfort of suburban London, enduring his teenage years with good humor, always on the lookout for adventure—and sexual possibilities. \r\n\r\nLife gets more interesting, however, when his father becomes the Buddha of Suburbia, beguiling a circle of would-be mystics. And when the Buddha falls in love with one of his disciples, the beautiful and brazen Eva, Karim is introduced to a world of renegade theater directors, punk rock stars, fancy parties, and all the sex a young man could desire.\r\n\r\n A love story for at least two generations, a high-spirited comedy of sexual manners and social turmoil, The Buddha of Suburbia is one of the most enchanting, provocative, and original books to appear in years.", "asin": "014013168X", "rank": "126694", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51TF%2BpVY7fL.jpg", "country": "England", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}