{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 17, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "A sequel to one of Balzac's masterpieces, Lost Illusions, this book unfortunately is unworthy of its role. Although it starts off well, with an exciting pick-up from the events of the predecessor tale in just the first chapter, it meanders for the next 200 pages before things finally start to happen about midway through this book of 553 pages! It also barely accounts for the activities of seven years of Lucien Chardon/Lucien de Rubempré, who occupied nearly every page of Lost Illusions!!Fortunately, it redeems itself in the final act, which follows the activities of Jacques Collin, one of the great characters of literature, describing his genius turnaround of fortune. Initially disappointing, yet somehow satisfying in the end, it still left me wanting more. Bravo!"}, {"review_sentiment": 2.0, "review_text": "A book about a bunch of people with absolutely no ethics.  I guess it was the Always Sunny in Philadelphia of its time.  Was disappoint!"}, {"review_sentiment": 5.0, "review_text": "Balzac at his most scathing: genius"}, {"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 4.0, "review_text": "This is the story of what happens when a psychopath enters your life. Lies, manipulation, deceit, suffering. You are viewed as a tool by the psychopath, to be used towards their ends. Clearly, the character Jacques Collin is a prime example of the psychopath at work. Disguised as a man of the cloth, with a protégé in tow, he enters Paris with plans to conquer society and gain power & money. His methods reveal there is nothing beneath him if it helps him get what he wants. The wreckage he leaves in his wake is astounding to behold. As one character says, men like Collin should dwell in caves and never come out.Balzac is a great one to read if you want to understand how society works, and in this case, how these inhuman humans called psychopaths work."}, {"review_sentiment": 4.0, "review_text": "This novel has the faults of Balzac:  for example, an at times overbearing narrator, a willingness to pause the narrative and provide encyclopedia entries on such matters as the slang of criminals or the structure of the French courts.  But it has the endlessly fascinating hero/villain Vautrin (aka Collin, aka Carlos Herrera), who survives and dominates the world he encounters.  Lucien Chardon and Esther are interesting and at times moving, but they pale before their supreme puppet master.  I picked up this book to find out what would happen to the characters Balzac presented in Illusions perdues, and I wasn't disappointed.That said, I read this book on Kindle and found the text full of annoying typographical errors.  Does anyone proofread the text after it's prepped for Kindle?  Someone should."}, {"review_sentiment": 5.0, "review_text": "This novel tells a dark story about life in Paris during the 19th century.  It is excellent, but not for those who require a happy ending."}, {"review_sentiment": 5.0, "review_text": "The artists journey was an excellent topic for a book and an easy excuse for a sequel.  Balzac turns on his scathing depiction scope on all of society leaving no class unbothered even the most sacred class of them all--the ARTIST class.  This last of a two series is unsuspectingly the most effigial of Balzac for the Human Comedy.  The artist was the catharsis.Some of the more titilating and manic moments of the novel have to be taken with a grain of salt.  Yes, he was one of the fathers of the modern novel but he also had to move units.  If you can sway past the soap opera moments and laugh past the startlingly believable pieces of human stupidity then you will enjoy Balzac.If not, go read Guy de Maupassant for Darwin's sake."}, {"review_sentiment": 1.0, "review_text": "I found this book to be a disappointment. I have read other works by Balzac in various translations (most of them in the Penguin Classics series)but I couldn't finish this one.Why? I just couldn't read another page (I made it to page 259)... The book begins well enough, a typical Balzacian-beginning wherein a figure appears in the midst of a Parisian scene. We are once again in the midst of a stirring ensemble of gossip and curiosity. I enjoyed that part. The reader follows Lucien along, we meet his true love Esther and we meet the dubious Vautrin as well. Everything starts off with grace and intrigue.And then it just dips off into the ridiculous. I found the character of Nucingen far too incredible to be believed. A man with so much money willing to give it all for glimpses of fair Esther (foolish and moronic for a man with so much money...he's more of a buffoon than a banker and I'm sure a banker would have more sense. It was far too unbelievable the ways he was screwed over in the book.) And of course reading the Polish aristocrat's conversation is equally excruciating (imagine someone talking with a stuff-nose and that is how Rayner Heppenstall has rendered the Slavic Baron's speech.)For about two hundred pages, the intrigue begins to wear thin. It borders on farce at times, cartoon-like... two hundred pages of basically scamming money out of a stupid, unsympathetic character so other characters equally uninteresting can pay off their debts. The characterizations are weak, many who started out with three-dimensions begin to falter into two-and-one dimensional personas.Unless you're really a fan of Balzac, I wouldn't bother with this one. Works like Pere Goriot, The Black Sheep, Eugene Grandet, Ursule Mirouet are far superior to this exhausting adventure. The pace of this book is high strung and hardly rewarding which is the main reason why I couldn't follow through with it.Lost Illusions is worth a read but deserves a better sequel than this. I wanted to like this book but forcing myself through it wouldn't have changed my feelings."}, {"review_sentiment": 4.0, "review_text": "Unpardonable to misquote, but Oscar's ran something like \"The saddest thing that ever happened to me was the death of Lucien de Rubempre\"."}]}, "authors": ["Honoré de Balzac"], "isbn": "0140442324", "longitude": 2.3514992, "periods": ["1800s"], "title": "A Harlot High and Low", "word_cloud": "sequel masterpieces lose unfortunately unworthy role start well excite event predecessor tale first chapter meander page thing finally midway page also barely account activity year occupy nearly page lose fortunately redeem final act follow activity great character literature describe genius turnaround fortune initially disappointing yet somehow satisfying end still leave want bunch people absolutely ethics guess time disappoint scathing genius great story happen psychopath enters life lie manipulation deceit suffer viewed tool psychopath use towards end character prime example psychopath work disguise man cloth protege tow enters plan conquer society gain power money method reveal nothing beneath help want wreckage leave wake astound behold character say men dwell cave never come great want understand society work case inhuman human call psychopath work fault example time overbear narrator willingness narrative provide encyclopedia entries matter slang criminal structure french court endlessly fascinating aka aka survive dominate world encounter interest time move pale supreme puppet master pick find character present per dues say find full annoy typographical error anyone proofread text prepped tell dark story life century excellent require happy end artist journey excellent topic easy excuse sequel turn scathing depiction scope society leave class bother even sacred class class last series unsuspectingly effigial artist titillate manic moment take grain salt father modern also move unit sway past soap opera moment past startlingly believable piece human stupidity enjoy go sake find disappointment work various translation penguin series page make page begin well enough typical wherein figure appear midst parisian scene midst stir ensemble gossip curiosity enjoy part follow meet true meet dubious well start grace dip ridiculous find character far incredible believe man much money willing give glimpse fair foolish moronic man much money buffoon banker sure banker far unbelievable way screw course read polish aristocrat conversation equally excruciate imagine someone talk render speech hundred page intrigue begin wear border farce time hundred page basically scamming money stupid unsympathetic character character equally uninteresting pay debt characterization weak many start begin falter dimensional really fan far superior exhaust adventure pace strung hardly reward main reason worth deserve better sequel want force feeling unpardonable misquote run something saddest thing ever happen death", "genres": ["Fiction & Literature"], "summary": "Finance, fashionable society, and the intrigues of the underworld and the police system form the heart of this powerful novel, which introduces the satanic genius Vautrin, one of the greatest villains in world literature.", "asin": "0140442324", "rank": "176615", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51uqt5ls8lL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}