{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "What a special book. As much a study of the psychology of isolation, as the beauty of words, this is a work you don't want to miss out on. Winner of two of Australia's most lauded book awards, it is a highly regarded story of the constant violence between white and black Australians, still alive today. Buy it now."}]}, "authors": ["Thea Astley"], "isbn": "0140267557", "longitude": 0.0, "periods": ["1900s"], "title": "The Multiple effects of Rainshadow", "word_cloud": "special much study psychology isolation beauty word work want miss laud award highly regard story constant violence white black still alive today", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The Multiple Effects of Rainshadow (1996) is Thea Astley's second last novel. It won The Age Book of the Year in 1996, and was shortlisted for the 1997 Miles Franklin Award.\r\n\r\nThe novel is based on a violent event that took place on Palm Island, Queensland (called Doebin in the novel) in 1930, in which the white Superintendent of the settlement, Robert Curry (Brodie in the novel), ran amok, setting fire to buildings and killing his own children in the process. He was eventually shot dead by one of the indigenous inhabitants, Peter Prior (Manny Cooktown in the novel), under orders from the white deputy Superintendent. Astley focuses most of the novel on various white characters who were present on the Island at the time, but intersperses their experiences with briefer passages spoken by the Aboriginal man, Manny Cooktown.\r\n\r\nThe novel spans a long time period, from 1918 when the settlement was established to 1957 when Aboriginal workers went on a strike, but most of the action takes place after 1930.\r\n\r\nWikipedia", "asin": "0140267557", "rank": "7440479", "city": "Palm Island", "image": "https://images-na.ssl-images-amazon.com/images/I/41lEII9omLL.jpg", "country": "Australia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}