{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 84, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Classic French mystery story. Loved it. I saw the show on Broadway when it starred Keira Knightley, but reading the book gets you really into the world of 19th Century Paris."}, {"review_sentiment": 5.0, "review_text": "Zola masterly weaves this sordid psychological story tightly, carefully creating a plot that propels forward until the strings are so taut that he brings it to the climax. Very entertaining."}, {"review_sentiment": 3.0, "review_text": "A classic read, but hard for me to follow."}, {"review_sentiment": 5.0, "review_text": "Zola. That French guy you don’t have to read. Stendahl, check. Balzac, check. Flaubert, check. Zola? Do not pass GO, do not collect $200, proceed without stopping straight to the 20th century. Right? Wrong. No better place to start than this novel labelled as “putrid literature” by the critics. Zola, only 27 when the novel was published, responded to the uproar in his 1868 Preface to the Second Edition:“It is quite evident that my work belongs to my critics, and that they may consider it repulsive without giving me any cause for protest. What I do mind, however, is that not one of the prudish journalists who blushed as they read THERESE RAQUIN seems to me to have understood this novel. If they had understood it, perhaps they would have blushed even more, but I should now be enjoying the private satisfaction of seeing that they were disgusted for the right reason.“I set out to study temperaments, not character. That sums up the whole book. I chose protagonists who were supremely dominated by their nerves and their blood, deprived of free will, and drawn into every action of their lives by the predetermined lot of their flesh. Therese and Laurent are human animals, nothing more. In these animals, I have tried to follow step by step the silent operation of desires, the urgings of instinct and the cerebral disorders consequent on a nervous crisis. The love between my two heroes is the satisfaction of a need; the murder that they commit is the outcome of their adultery, an outcome they accept as wolves accept the slaughtering of a sheep; and finally, what I have been compelled to call their ‘remorse,’ consists in a simple organic disruption, a revolt of the nervous system when it has been stretched to breaking-point. I freely admit that the soul is entirely absent, which is as I wanted it.”Putrid literature? Count me in. Slumming, perhaps, but a slum in which the actions of the protagonists are portrayed with a cold eye for telling details as well as acute psychological analysis of desire, passion, revulsion, hatred. This in a novel that moves with cinematic swiftness, finishing off in under 200 pages. Pity that dull, dreary Dreiser learned so much from Zola without ever learning the very French art and practice of concision. High points include chapters XI Murder, XIII Morgue, XVII Insomnia, XX Wedding, XXI Ghost, XXVI Stroke, XXX Cat, XXXI Vice, and XXXII Oblivion. Only at the end (193-194) do the animals turn, triumphantly, human."}, {"review_sentiment": 4.0, "review_text": "Fascinating plot. Nelson Traquina"}, {"review_sentiment": 4.0, "review_text": "This is a tale of deception, cruelty, immaturity and pain."}, {"review_sentiment": 5.0, "review_text": "Seen Park Chan Wook's film \"Thirst\"? Now read the book and discover why Zola is such an important, controversial and influential writer. Japanese naturalism wouldn't have existed without him"}, {"review_sentiment": 4.0, "review_text": "Zola's characters are twisted and tortured by unimaginable horrors within the narrow confines of a very small world which they cannot escape. This is not a cheerful read, as the setting is grim and dingy, and so are the characters themselves. What is fascinating is just how awful life can get before something - or someone - breaks."}, {"review_sentiment": 1.0, "review_text": "It's linked to the play version of the novel, yet it's not the play version. What a waste of time."}, {"review_sentiment": 3.0, "review_text": "Just dull. Almost fell asleep a couple of times but managed to get through it.Spend your time on something else."}]}, "authors": ["Emile Zola"], "isbn": "0140449442", "longitude": 2.3514992, "periods": ["1800s"], "title": "Therese Raquin", "word_cloud": "classic french mystery story saw star read get really world masterly weave sordid psychological story tightly carefully create plot propels forward string taut brings climax very entertaining classic hard follow guy check check check pas collect proceed stop straight century better start label putrid literature critic publish respond uproar quite evident work belongs critic give cause protest mind however prudish journalist blush seem understood understood perhaps even enjoy private satisfaction see disgust right set study temperament character sum whole choose protagonist supremely dominate nerve blood deprive free drawn action live predetermine lot flesh human animal nothing animal try follow step step silent operation desire urging instinct cerebral disorder consequent nervous crisis love hero satisfaction commit outcome adultery outcome accept wolf accept slaughter sheep finally compel call remorse consist simple organic disruption revolt nervous system stretch freely admit soul entirely absent want literature perhaps slum action protagonist portray cold eye tell detail well acute psychological analysis desire passion revulsion hatred move cinematic swiftness finishing page dull dreary learn much ever learn french art practice concision point include chapter only end animal turn triumphantly human fascinate plot tale deception cruelty immaturity pain film now discover important controversial influential writer japanese naturalism character twist tortured unimaginable horror narrow confines small world escape cheerful set grim dingy character fascinate awful life something someone break link play version yet version waste time just dull fell asleep couple time manage get time something else", "genres": ["Fiction & Literature"], "summary": "Zola's classic novel of turbulent passion, now appearing on Broadway at the Roundabout Theatre starring Keira Knightley\r\n\r\nIn a dingy apartment on the Passage du Pont-Neuf in Paris, Thérèse Raquin is trapped in a loveless marriage to her sickly cousin, Camille. The numbing tedium of her life is suddenly shattered when she embarks on a turbulent affair with her husband’s earthy friend Laurent, but their animal passion for each other soon compels the lovers to commit a crime that will haunt them forever. Thérèse Raquin caused a scandal when it appeared in 1867 and brought its twenty-seven-year-old author a notoriety that followed him throughout his life. Zola’s novel is not only an uninhibited portrayal of adultery, madness, and ghostly revenge, but also a devastating exploration of the darkest aspects of human existence.\r\n\r\nRobin Buss's translation superbly conveys Zola's fearlessly honest and matter-of-fact style, combining fidelity to Zola's idiosyncrasies with easy fluency in English. This edition also includes an introduction discusses Zola's life and literary career and the influence of art, literature, and science on his writing, as well as the preface to the author's second edition of 1868, a chronology, suggestions for further reading, and notes.", "asin": "0140449442", "rank": "254560", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/516-f%2BIKZAL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}