{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 5, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Koestler books are greatest in world"}, {"review_sentiment": 2.0, "review_text": "I suppose that one reason students are force-fed the literature of old, the classics, is to show that human values and human failings have not changed over the years. Human ambitions and failings may not have varied much, but some attitudes have changed significantly.  Western societies, for example, have become much less religious.  Evidence of this is that the best-selling and most widely read novel of the nineteenth century well into the twentieth was Ben-Hur: A Tale of the Christ.With the waning of Christianity among educated people, a new religion took its place. Like Christianity, it was founded by a bearded Jew who was persecuted by an occupying force of Gentiles from the North, and as with Catholic tradition, one confessed one's sins to a priest obscured from view. Christianity has its four Gospels to discuss and analyze, while the new religion has its four case histories.Arrival and Departure is not a disguised autobiography, but Arthur Koestler believed in psychoanalysis (although he actually met and admired Sigmund Freud, he employed the services of a Jungian -- the equivalent of a Lutheran), and much of the novel consists of a psychoanalytic explanation of why he or anyone else would be led astray into communism. That's what makes it such an unsatisfying read for those of us in the twenty-first century. Freudianism was once accepted as scientific knowledge by most literate people, but during my lifetime people have stopped referring to oral fixations and anal retentives. The last time I came across the term \"inferiority complex\" (yes, I know, that's Adlerian) was in a biography of Koestler. Certainly there are yet Freudians in the woodwork, but they are now likely outnumbered by the remaining Swedenborgians or Theosophists.Freudianism was replaced by Scientology, and both religions believe that our problems are caused by forgotten traumatic experiences. Both attempt to go back, back, back into the subconscious memory and haul these *engrams* to the surface, deal with them, and they will be magically eliminated. This novel's hero, Peter Slavek who suffers from a psychosomatic paralysis, has the good fortune to come under the guidance of Dr.Sonia Bolgar, and together they go all the way back to Peter's childhood traumas.  After a few weeks of analysis, not only is his paralysis cured, but he no longer has a desire to be a communist!Well, that's about as silly as the scene in Ben Hur where his mother and sister are cured of leprosy by touching the hem of Jesus' garment, so I don't think you'll like this book, but that's what people believed back then. It was published in 1943, and Koestler obviously deserves credit for accurately depicting what the Germans were doing to Jews and Gypsies at a time when no one either knew or cared, but that information still doesn't make this a great novel.But wait!  Koestler >was< a great writer, so there is one scene that is worth reading. In the last quarter of the novel, after the Freudian mumbo-jumbo is finished and Dr. Sonia leaves the stage, a new character in introduced. It's the suave and persuasive Bernard (Koestler deliberately made him a sympathetic character), and he has a long speech that goes on for thirteen pages!It's always a mistake when an author places a speech in a novel. Speeches, particularly political speeches, should only be given into a microphone, on a balcony or at a podium. Note to aspiring novelists: no thirteen-page monologues, speeches, addresses, lectures, orations, or sermons in a novel. It doesn't work, because then it's no longer a novel, it's a tract. Having said that, let me state that you might want to read Bernard's speech, because it's intense and eerily prescient. It's Koestler at the top of his form, and he's playing devil's advocate. (Curiously, Koestler based the character of \"Bernard\" on \"Edgar,\" his communist handler in Berlin. The real name of \"Edgar\" was Fritz Burde, and during Stalin's purges before the war, Burde, who was then in charge of the secret service of the Red Army in Scandinavia, was recalled to Moscow and liquidated.)One of the odd things about Arrival and Departure is that, other than America, no countries or cities or other proper nouns are used. The entire novel takes place in the absurdly-named Nutria [sic] (which is actually Portugal), and there is no mention of Hitler, Stalin, Nazis or communists, and even the swastika is described but not named. (Was Koestler hedging his bets in case the UK eventually capitulated?)  Although Bernard is certainly a German agent (who eventually boards a boat bound for America), he is not named as such, but he does, in a smug fashion, outline the intellectual foundation of not just the Third Reich but a general manner of thinking that you may recognize. (I wish I could post the entire thing, but I think you'll get the gist from these quotes.)He dismisses all leftists as rebellious losers: jealous younger brothers and homely girls who are embittered because they never were accepted as cheerleaders or models.  \"They all wanted to cut down the tree because the fruit was too high for them.\"Peter is impotent against such observations, but on every page he interrupts Bernard to ask a short question, and off goes Bernard with another stunning reply.  What if they (the Germans) lose?\"The result in the long run would be the same.  . . . National Sovereignty, Balance of Power, Preferential Treaties, and all the rest.  . . . Inside their own countries the forces we set in motion, the forces of the post-liberal era, will assert themselves.  . . .  Even if we lose this war, the spreading of our ideas can no longer be stopped. The West has no vision of the future to set against it; their slogans are those of a decayed tradition -- sentimental hypocrisy, hollow commonplaces.\"This portion of the novel is titled, \"The Future,\" and I'll leave you to reflect on it.  Even at his worst, Arthur Koestler had a brilliant spark and could predict the future. In the 1930s most intellectuals (Koestler among them) were either communists or socialists, but \"Bernard\" was prescient, and the earth subsequently tilted right on its axis; not just the obvious break-up of the Soviet Union and vanishing of communism, but by 1997 the Labour party in the U.K. was far to the right of the policies of Tory Prime Minister Harold Macmillan forty-years earlier. The new religion (and the new crusades) had become the infinite wisdom of free markets."}, {"review_sentiment": 2.0, "review_text": "\"Arrival and Departure\" was written in 1941 and published the following year. Readers who are not at least somewhat knowledgeable about European politics, culture and psychological trends at the start of World War II are likely to feel somewhat lost. Peter Slavek is a 22-year-old radical from the intellectual class who has no true understanding of the oppressed masses for whom he campaigns. His commitment to socialist revolution is swept away into insignificance by the horrors overwhelming Europe. After being tortured, he escapes to the capital of Neutralia (not kidding), where he encounters a female psychiatrist whom he knew as a child. He also meets Odette, a young homeless wanton, and falls in love with her. Torn between his politics and his love, he suffers a mental breakdown and hysterical paralysis of one leg. In a series of informal but very intense analysis sessions, Dr. Bolgar, the psychiatrist, uncovers the \"dynamic roots\" of his radicalism, revealing it to be the sequela of a traumatic incident from his childhood. So his politics aren't real, they're just his way of making lifelong expiation for his imagined sins. Bingo, his neurosis is cured, and he regains the use of his leg. In addition to the psychoanalytical jargon, Koestler devotes considerable space to dialogues between characters about political theories and philosophies fashionable among liberal European intellectuals in the first half of the 20th century. History teaches us that most people either didn't know or didn't care to know about the Holocaust; if that is so, why didn't Koestler's matter-of-fact descriptions of the fate of the Jews in this book attract more attention? These parts of the book read more like a historical novel that was written today than a book published in 1942. \"Arrival and Departure\" was the last of a trilogy that began with \"Darkness at Noon\" and I tend to agree that it is the weakest of the three books. It was one of Koestler's earliest books in English---he had previously written in Hungarian and German---and it shows in this book: Its formal, stylized, rather lofty prose actually does read more like a translation than like a book written in English: Reminiscent of the prose of Joseph Conrad, but a bit flatter. I recommend this book only for the reader who is a fan of Koestler's work or who wants to read what is now essentially a period piece about life among the displaced and refugees in wartime Europe."}, {"review_sentiment": 4.0, "review_text": "Koestler was always facinated by the psychology of imprisonment and torture;what makes a person crack or hold out. Peter Slavek has escaped to Neutralia. He is a left wing agitator in a right wing state where he was tortured but managed to resist.The novel asks why. His childhood demons are explored, but can even this knowledge stop him from an almost pre programmed destiny. Koestler explores his themes well,though perhaps this book is a little dated as its time of supreme relevence have passed. But who knows when those days will return?"}, {"review_sentiment": 5.0, "review_text": "This book shows great incite into the human mind, and is an exciting story of a displaced character's time in a place called Neutralia. A great concept intertwined with an interesting plot, worth checking out."}]}, "authors": ["Arthur Koestler"], "isbn": "0140181199", "longitude": -9.1365061, "periods": ["1900s"], "title": "Arrival and Departure", "word_cloud": "greatest world suppose reason student literature old classic show human value human failing change year ambition failing much attitude change significantly western society example become much le religious widely nineteenth century well twentieth wan educate people new religion take place found beard persecute occupy force tradition confess sin priest obscured view discus analyze new religion case disguise autobiography believe psychoanalysis actually meet admire employ service jungian equivalent much consist psychoanalytic explanation anyone else astray communism make unsatisfying century accept scientific knowledge literate people lifetime people stop refer oral fixation anal retentive last time come term inferiority complex yes know adrian biography yet woodwork likely outnumber remain replaced religion believe problem cause forgotten traumatic experience attempt go back back back subconscious memory haul surface deal magically eliminate hero suffers psychosomatic paralysis good fortune come guidance together go way back childhood trauma week analysis paralysis cure longer desire communist silly scene mother sister cure leprosy touch hem garment think people believe publish obviously deserve credit accurately depict time know care information still great wait great writer scene worth read last quarter finish leave new character introduce persuasive deliberately make sympathetic character long speech go thirteen page always mistake author place speech particularly political speech give balcony podium aspire novelist monologue speech address lecture oration sermon work longer tract say let state speech intense eerily prescient top form play devil advocate base character communist handler real name purge war charge secret service recall liquidate odd thing country city proper noun use entire take place sic actually mention communists even swastika describe name hedge bet case eventually capitulate certainly german agent eventually board boat name smug fashion outline intellectual foundation general manner thinking wish entire thing think gist quote dismiss leftists rebellious loser jealous younger brother homely girl embitter never accept cheerleader model want cut tree fruit high impotent observation page interrupt ask short question go stun reply germans lose result long run rest country force set motion force era assert even lose war spread idea longer stop vision future set slogan decayed tradition sentimental hypocrisy hollow commonplaces portion title future leave reflect worst brilliant spark future intellectual communist socialists prescient earth subsequently tilt right axis obvious vanish communism party far right policy earlier new religion new crusade become infinite wisdom free market write publish follow year least somewhat knowledgeable european politics culture psychological trend start likely feel somewhat lose radical intellectual class true understanding oppress mass commitment socialist revolution sweep away insignificance horror overwhelm tortured escape capital kid encounter female psychiatrist know child also meet young homeless wanton fall love politics love suffers mental breakdown hysterical paralysis leg series informal intense analysis session psychiatrist uncovers dynamic root radicalism reveal sequel traumatic incident childhood politics real way make lifelong expiation imagine sin neurosis cure regains use leg addition psychoanalytical jargon devote considerable space dialogue character political theory philosophy fashionable liberal european intellectual first half century teach people know care description fate attention part historical write today publish last trilogy begin tend agree weakest earliest previously write hungarian show formal stylize rather lofty prose actually like translation write prose bit flatter recommend fan work want essentially period piece life displaced refugee always fascinate psychology imprisonment torture make person crack hold escape leave wing agitator right wing state torture manage asks childhood demon explore even stop almost per program destiny explore theme well perhaps little dated time supreme relevance pass know day show great incite human mind excite story displace character time place call great concept intertwine interesting plot check", "genres": ["Fiction & Literature", "WWII"], "summary": "This was the third novel of Arthur Koestler's trilogy on ends and means - the other two are THE GLADIATORS and DARKNESS AT NOON - and the first he wrote in English. The central theme is the conflict between morality and expediency, and in this novel Koestler worked it out in terms of individual psychology. \r\n\r\nPeter Slavek starts out as a brave young revolutionary, but suffers a breakdown. On the analyst's couch he is made to discover, in Koestler's own words, 'that his crusading zeal was derived from unconscious guilt'.\r\n\r\nWritten during the middle of World War II, Arrival and Departure reflects Koestler's own plight as a Hungarian refugee. Like Koestler, the main character is a former member of the Communist party. He escapes to 'Neutralia', a neutral country based on Portugal, where Koestler himself had gone, and flees from there. \r\n\r\nReflecting Koestler's later life relationship with science, and particularly his disagreement with various movements within psychiatry, the main character emerges from treatment psychically neutered, and the critical question of the novel is how much of his later trauma and political activity is due to a small incident in his childhood.", "asin": "0140181199", "rank": "3367334", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/41p9%2Brk3Y-L.jpg", "country": "Portugal", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}