{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 33.9550905, "ratings": {"num_ratings": 3062, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Lots of details.  Allows the reader to become captivated in the reading."}, {"review_sentiment": 5.0, "review_text": "I read about this new translation in The New York Times, I believe.  I had just recently started rereading The Odyssey and I thought it would be interesting to try this version.  Have just started it so I will have to let you know."}, {"review_sentiment": 5.0, "review_text": "Don't skip the Introduction of this newest English translation of Homer's The Odyssey. It will remind non-scholars of ancient context and the filters with which early audiences would have listened to the poem. And the Translator's Note will introduce current readers to Emily Wilson's point of view and focus as she translated Homer's lines.The poem itself is translated clearly and with the power of a god-inspired bard. Seriously though, it's accessible, interesting, exciting, and it flows as poetry should. The choices Wilson makes throughout, especially in the more dramatic and iconic scenes, seem shocking at first read, but soon they feel natural and clear and obviously true."}, {"review_sentiment": 5.0, "review_text": "60 years of Lattimore's Iliad, and no other English translation blends so beautifully structured English verse, and the original Greek. Lattimore remained faithful to the Greek, and is a joy to read.I tend to pair Lattimore's Iliad with Fitzgerald's translations of the Odyssey (more readable, less precise) and the Aeneid, for the best of the Classical poems (Lattomore's Odyssey next, then Fagles - Mandelbaum's Aeneid a close second)."}, {"review_sentiment": 5.0, "review_text": "I have read and taught the Odyssey at least five times over the past twenty years.  And Emily Wilson's version is a godsend.  It is, by far, the most readable version out there.  It never strains to be \"epic\" the way so many translations do. Instead, she uses today's English while also hewing faithfully to the unrhymed iambic pentameter that Shakespeare, Milton, and Wordsworth established as the epic form in English poetry.  The result is a perfect blend between an Odyssey for today's reader and a \"poetic\" narrative.  I read it all in three sittings because I couldn't put it down.  Who would have thought someone could turn the Odyssey into a page turner? I can't wait to try out this new translation on my students. Hats off to Emily Wilson!"}, {"review_sentiment": 5.0, "review_text": "Wilson rethinks gender roles in the first translation of The Odyssey by a woman. It is written in plain English so while it loses the art of a poem, it is easy to understand."}, {"review_sentiment": 4.0, "review_text": "Not my favorite translation but a worthy one nonetheless.  Flat and plain compared to Fagels,  almost bloodless. Academic prose that highlights the variety of phrasing in the source."}, {"review_sentiment": 5.0, "review_text": "This is the translation that I used in my Comparative Literature class in college.  It is far closer to the original Greek than many of the more recent translations.  It is very accessible.  I've taught to 7th graders using it without any problems."}, {"review_sentiment": 5.0, "review_text": "Enjoyed every page of it. The adventures where great. The story was told in a very special way and understandable"}, {"review_sentiment": 5.0, "review_text": "I had read the Odyssey twice before, often over extended periods of time, and always preferred the Iliad.  Emily Wilson's translation and her wonderful introduction has changed all that.  I read it in four days!  The translation is beautiful, even sensuous in places (the description of the Dawn) and the story flows quickly (even if Odysseus' trip home did not).  She gives flesh to characters (including one of the saddest of all, the dog Argos) that were sometimes stick figures in previous translations.  Many, if not most, of the characters are unattractive or even horrible (including Odysseus much of the time).  But there are notable exceptions, like the faithful slave/swineherd Eumaeus.  Parts of the epic are also horrifying, particularly the murder scene of the twelve slave women. In Wilson's talented hands, the reader feels the full horror of the scene.Wilson has set the bar for all other translators in this incredible work. Bravissimo!"}]}, "authors": ["Homer"], "isbn": "0140268863", "longitude": -83.3881868, "periods": ["Pre Common Era"], "title": "The Odyssey", "word_cloud": "detail become captivated reading new translation believe recently start reread think version start let skip newest english translation ancient context filter early audience poem introduce current reader emily point view focus translate poem translate clearly power bard accessible interest exciting flow poetry choice make especially dramatic iconic scene seem shock first soon natural clear obviously true year translation blend beautifully structured verse original remain faithful greek joy tend pair translation readable le precise best classical poem next close second teach least time past year version godsend far readable version never strain epic way many translation instead use today also hew faithfully rhymed iambic pentameter establish epic form poetry result perfect blend today poetic narrative sitting someone page turner new translation student hat emily rethink gender role first translation woman write plain english loses art poem easy understand not favorite translation nonetheless plain compare almost bloodless prose highlight variety phrase source translation use comparative class college far closer original many recent translation accessible teach grader use problem enjoy page adventure great story tell special way understandable twice often extend period time always prefer translation wonderful introduction change day translation beautiful even sensuous place description story flow quickly even trip home give flesh character include saddest dog sometimes stick figure previous translation many character unattractive even horrible include much time notable exception faithful epic also horrify particularly murder scene twelve slave woman talented hand feel full horror set bar translator incredible work", "genres": ["Fiction & Literature", "Poetry", "Ancient Greece", "Ancient Civilizations"], "summary": "The great epic of Western literature, translated by the acclaimed classicist Robert Fagles\r\n \r\nRobert Fagles, winner of the PEN/Ralph Manheim Medal for Translation and a 1996 Academy Award in Literature from the American Academy of Arts and Letters, presents us with Homer's best-loved and most accessible poem in a stunning modern-verse translation. \"Sing to me of the man, Muse, the man of twists and turns driven time and again off course, once he had plundered the hallowed heights of Troy.\" So begins Robert Fagles' magnificent translation of the Odyssey, which Jasper Griffin in the New York Times Book Review hails as \"a distinguished achievement.\"\r\n\r\nIf the Iliad is the world's greatest war epic, the Odyssey is literature's grandest evocation of an everyman's journey through life. Odysseus' reliance on his wit and wiliness for survival in his encounters with divine and natural forces during his ten-year voyage home to Ithaca after the Trojan War is at once a timeless human story and an individual test of moral endurance. In the myths and legends  retold here,\r\n\r\nFagles has captured the energy and poetry of Homer's original in a bold, contemporary idiom, and given us an Odyssey to read aloud, to savor, and to treasure for its sheer lyrical mastery. Renowned classicist Bernard Knox's superb introduction and textual commentary provide insightful background information for the general reader and scholar alike, intensifying the strength of Fagles's translation. This is an Odyssey to delight both the classicist and the general reader, to captivate a new generation of Homer's students. This Penguin Classics Deluxe Edition features French flaps and deckle-edged paper.", "asin": "0140268863", "rank": "3365", "city": "Athens", "image": "https://images-na.ssl-images-amazon.com/images/I/51cUwb0DUPL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}