{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 381, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Enjoyed this book. Very engaging and well written."}, {"review_sentiment": 5.0, "review_text": "This book is a gem. It's content is as moving as it's writing is tight. Highly recommend. Can't stop thinking about it, now that I'm done."}, {"review_sentiment": 3.0, "review_text": "While the concept of following the painting over the years through the lives of its owners is fascinating, the book did not meet my expectations. The author's writing style was fine; the plot was intriguing. But where I was not so impressed was the lack of depth into the narrative. The concept of the book was very good. I wish the author had spent more time detailing the plot."}, {"review_sentiment": 3.0, "review_text": "Liked historical research surrounding the painting.  Liked the authors ability to put into words how an artist views his subject."}, {"review_sentiment": 5.0, "review_text": "Quick read, but a beautifully written series of stories about the various owners of a painting thoughout history."}, {"review_sentiment": 5.0, "review_text": "A GOOD BOOK, & PRINT/COVER, IS HIGH CL;ASDS"}, {"review_sentiment": 5.0, "review_text": "Delicate, yet powerful, and very satisfying."}, {"review_sentiment": 2.0, "review_text": "This was a difficult read for me.  The history of this painting is described in this book in a reversed sequence.  So many families had cared for this painting throughout it's life and there was little happiness associated with it."}, {"review_sentiment": 5.0, "review_text": "Loved it!"}, {"review_sentiment": 5.0, "review_text": "I have just discovered Susan Vreeland and am enthralled by her works.  Her method of telling the story of this painting by working backwards had me up until the wee hours of the morning.  A worthwhile read for anyone."}]}, "authors": ["Susan Vreeland"], "isbn": "014029628X", "longitude": 4.8936041, "periods": ["1600s"], "title": "Girl in Hyacinth Blue", "word_cloud": "enjoy very engage well write gem content move write tight recommend stop thinking do concept follow paint year live owner fascinate meet expectation author write style fine plot intrigue impress lack depth narrative concept good wish author spent time detail plot liked historical research surround paint liked author ability put word artist view subject beautifully write series story various owner paint history good yet powerful satisfying difficult history painting describe reversed sequence so many family care paint life little happiness associate love discover enthral work method tell story paint work backwards wee hour morning worthwhile anyone", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "This luminous story begins in the present day, when a professor invites a colleague to his home to see a painting that he has kept secret for decades. The professor swears it is a Vermeer—but why has he hidden this important work for so long? The reasons unfold in a series of events that trace the ownership of the painting back to World War II and Amsterdam, and still further back to the moment of the work's inspiration. As the painting moves through each owner's hands, what was long hidden quietly surfaces, illuminating poignant moments in multiple lives. Susan Vreeland's characters remind us, through their love of this mysterious painting, how beauty transforms and why we reach for it, what lasts and what in our lives is singular and unforgettable.", "asin": "014029628X", "rank": "64125", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/41wNlJyDtzL.jpg", "country": "The Netherlands", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}