{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 13, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Arenas is a master."}, {"review_sentiment": 4.0, "review_text": "Book was good condition"}, {"review_sentiment": 5.0, "review_text": "Great read!"}, {"review_sentiment": 2.0, "review_text": "I really don't understand all the great reviews for this book. The writing is so dense, the stream of consciousness style is so extreme that I never feel like I'm reading about characters. I only feel like I'm ingesting words and words and more words. There's no sense of character and the narrator certainly does not feel like a character, but rather, a literary device, a prop to plod the story clumsily along. I'm sorry, but this is not great writing, it's just verbal acrobatics, it's just literary mahsterbashon and over indulgence on the pat of the writer. Sure, he can write, but it seems like the writing is just to please himself.  I really gave this book a chance, but I'm not torturing myself any longer. Farewell, Farewell to the Sea, I refuse to drown in the morass of this mess any longer!"}, {"review_sentiment": 3.0, "review_text": "This book was not what I expected and did not enjoy reading this book. I did not like the style of writing...it may have something to do with the translation."}, {"review_sentiment": 5.0, "review_text": "From the opening of the text:\"The ocean... Blue... Not at first. At first it's sort of sallow. Ashen, you might say... Although it's not ashen either. White, perhaps. But not white meaning transparent. White. And then-though, still, almost at first-it turns gray. Gray for a while. And then dark. Covered with even darker furrows, cracks in the water... Perhaps they're waves. No-just mirages of water, and sun. If they were waves they would reach the shore. That is, the sand. But there are no waves. Just water. That almost clumsily hits the land... But it doesn't hit it. If it did, you'd hear some sound. There is silence. Just water, touching earth. Not hitting it. It comes-white, not transparent, touches it clumsily, and retreats. Not earth; it's sand. When the water rises, without waves, perhaps the sand breathes a sound. Satisfied. From here I don't hear a thing. The water rises, but you can't see it go down. The sand absorbs it. Underneath it goes back to the ocean.. And farther out, it's no longer gray, but dun-colored. Very dark. Almost black. Unfil finally, it really is black. But by then it's very high. It joins the sky. You can't make out where the two as separate things, begin or end. So really, to be precise, it's never blue... Hector drives slowly.\"I picked this book up one day at City Lights and started reading. I couldn't put it down. I like it so much that I started reading it a second time. Then I passed it along to someone else. About seven years later, I was at City Lights again and started reading it again. I couldn't put it down again and I purchased it again.The prose in this book is the most beautiful that I have read in the English language. Major props to the translator Andrew Hurley. Reinaldo Arenas is a poet, but the first half of this text, written in standard prose form, is literally stunning. It's not prose that should be poetry, or fluffy prose, but what I would call true prose poetry. It's not written in the standard \"this happened, then this happened,\" cause and effect form. The narrator articulates what she feels, what she envisions, what she remembers. Time does merely flow from instant to the next. It seamlessly flows through her words to the point that the transitions are surprising. For instance, at one point I am reading and they are at the cabin, and the next thing I know she is writing about the past and I was not even aware of when the transition happened. This is because Arenas writes as it truly happens in the mind, without wasting words on unnecessary clauses like, \"Next,\" or, \"A long time ago.\" It's not that such phrases don't have their uses, this is just not the text for them.As far as the general plot, a young mother travels with her husband to stay at a cabin by the sea where they happen to be staying next to a boy of about seventeen and his overbearing mother. It's clear that something is going to happen between the husband and the boy, but not a lot really happens in the general plot. There are many beautiful passages about the ocean itself, the cicadas, the oleanders, and the disillusionment of what Cuba has become, which to my understanding is the centralized theme throughout the Pentagonia. The interactions between the characters are also intriguing, yet simple, as seen through the eyes of the narrator.Every time I read this book, I am just blown away by the prose. There are also very few paragraph breaks, though ellipses seem to take their place in parts. And one more thing; the second part of the text is actually composed of cantos, with the husband as narrator, though interestingly, they don't feel as poetic as the first part written. I also find it compelling that Arenas had to write this book three times before smuggling it out of Cuba as the first two versions disappeared. One of the great novels of all-time.Here's some random text from p. 96......\"The first stream of water is really cold. But as it falls it grows warmer. Without soaping myself, motionless, I let the water fall over me. The water falls. I feel the water fall. It hits my head; it slides over my shoulders; it rolls down my body, runs down my legs, and slips across the floor. At this moment, I think, it's getting dark. At this moment, time is passing, time is passing. But the water goes on falling. I am taking a bath while night falls. I am bathing. Through the bathroom's high window, through the screen, I can see the sky taking on, as it always does, the intense violet of this time of day. The sky and the smell of time, the smell of leaves, the singed smell of earth that was waiting today too for a cooling shower, for rain. Perfume. The smell of trees that take darkness as a comfort. All the odors of earth wash over my naked body the water is falling and falling on. I look at my dripping body. I look at my body. This is my body, I think. My God, Holy Mother, this is my body. The smells begin to fade. The violet disappears too. I go on bathing, in near darkness. I go on feeling the water falling over me, running over my body, caressing, caressing, caressing. Water.\""}, {"review_sentiment": 5.0, "review_text": "For sure the best of Arena's books, this middle novel of his five-book pentagonia series is brilliant and unwinding.  This is one of my favorite books of all time - if you choose to read any Arenas book I highly recommend this one."}, {"review_sentiment": 5.0, "review_text": "I love each of the books in Pentagonia but this one especially stands out as a masterful work by a truly brilliant talent.  Perfect as a stand alone read or as the center of the five novels, I cannot recommend this enough.Having read them in their intended order, Farewell to the Sea seemed to anchor the five novels perfectly, fusing the stream of consciousness of Singing from the Well and Palace of the White Skunks and paving the way for the absurdity of The Color of Summer and the dystopian horror of The Assault.  Farewell to the Sea places Arenas in the company of Faulkner and Virginia Woolf, but he still manages to forge a niche of his own that is remarkable, stunning and thoroughly rewarding.  Read this book."}, {"review_sentiment": 5.0, "review_text": "In \"Farwell to the Sea,\" Arenas continues his Pentagonia series by departing from the hallucinatory violence presented in the first two books (\"Singing from the Well\" and \"Palace of the White Skunks\") and entering the minds of a young married couple spending a week by the sea. Divided in two parts, the first part is the stream-of-consciousness narrative by the unnamed woman who resents her baby, fears losing her husband, and who feels helpless to cope with the communist society in Cuba. She aches for her husband's love, yet is suspicious of his infidelity, particularly when a handsome and taciturn teen-aged boy arrives with his loquacious mother and moves into the cottage next to theirs. Her dreams are mixed into her daily conscious narrative and reveal her anxiety, torment and fears. In one dream with sexual connotations, she sees visions of Greek warriors slaughtering each other in a violent orgy-like battle. And in another vivid rendition of the ubiquitous cue of the communist life, Cubans stand morosely in line while soldiers standy nearby, gunning down anyone that dares defies them or attempts to alter the cue.The second part is from the husband's, Hector, perspective, but it's primarily told in poetic form and involves often allegorical portrayals of how he sees Cuban life and his own. His resentment underscores much of his tale, even his attraction to the boy next door, which becomes a central conflict during his stay. He longs for the boy and to freely express his homosexuality, yet feels the omnipresent oppression of the communist system as it systematically stifles all that is human. Perhaps one of the most poignant passages is the following poem in which Hector expresses what the communist system has done to his and everyone else's humanity: \"You are no longer a man who calls things by their name -- you blaspheme. You are no longer a man who laughs -- you jeer. You are no longer a man who hopes -- you mistrust. You are no longer a man who loves -- you accept. You are no longer a man who dreams aloud -- you are silent. You no longer sleep and dream -- you are sleepless. You are no longer one who is wont to believe -- you consent. You are no longer a seeker -- you hide.\" And then he adds the line (not 30 yet) to signify how communism has jaded him and turned him into a hopeless cynic while still a young man.Beautifully written, and a tale that will bear repeated readings."}, {"review_sentiment": 5.0, "review_text": "A young Cuban couple gain permission to spend a week at a beach resort.  They spend most of their time sitting by the ocean, silent in private thought. We get inside her head for the 7 days and then into his, receiving  different perspectives and views on the vacation, and on their current  lives.  Arenas does a fantastic job of expressing both her and his  frustrations at their station in life, and in the freedom they feel has  deserted them.  She laments the burden of motherhood and the loss of her  personal sense of self.  He laments his loss of freedom as the Castro  government clamps harder down on writers and artists.  Also, driving his  frustration is his own frustration as a closet homosexual in a straight,  macho world.  Arenas does not overtly state his themes, but reveals  them like one peeling an onion. There is layer after layer to discover..  and the underlying themes of the novel come across through reverie and  daydreams.. hallucinations of the young couple as they stare at the water.  It is this non-linear dual-narrative style of writing that is so effective  as through their private thoughts, we start to understand the true essence  of the lives of this young, but jaded young couple."}]}, "authors": ["Reinaldo Arenas"], "isbn": "0140066365", "longitude": -82.3658671, "periods": ["1900s"], "title": "Farewell to the Sea: A Novel of Cuba", "word_cloud": "arena master good condition great really understand great review writing dense stream consciousness style extreme never feel read character feel ingest word word word sense character narrator certainly feel character rather literary device prop story clumsily sorry great write verbal acrobatics literary mahsterbashon indulgence pat writer write seem write please really give chance torture longer refuse drown morass mess longer expect enjoy read style writing something translation open ocean not first first sort sallow ashen perhaps white meaning transparent still almost turn gray dark even darker furrow crack water perhaps wave mirage water sun wave shore sand wave water almost clumsily hit land hit hear sound silence water touch earth not hit transparent touch clumsily retreat not earth sand water rise wave perhaps sand breathes sound hear thing water rise sand absorb go back farther longer gray dark black finally really black high join sky separate thing begin end so really precise never blue drive slowly pick day start read much start read second time then pass someone else year later start read purchase prose beautiful english language major prop translator poet first half text write standard prose form literally stun prose poetry fluffy prose true prose poetry write standard happen happened cause effect form narrator articulate feel envisions remembers merely flow instant seamlessly flow word point transition surprise instance point read cabin next thing know write even aware transition happen write truly happens mind waste word unnecessary clause long time phrase us far general plot young mother travel husband cabin sea stay next boy seventeen overbear mother clear something go happen husband boy lot really happen general plot many beautiful passage ocean cicada oleander disillusionment become understand centralized theme interaction character also intrigue yet simple see eye time blow away prose also paragraph break ellipsis seem place part thing second part text actually compose canto husband narrator interestingly poetic first part write also find compelling write time smuggle first version disappear great novel random first stream water really cold fall grows warmer soap motionless let water water fall feel water fall hit head slide shoulder roll body run leg slip floor moment think get dark moment time pass time pass water go fall take bath night fall bath bathroom high window screen see sky take always intense violet time day sky smell time smell leave sing smell earth wait today cool shower rain smell tree take darkness comfort odor earth wash naked body water fall fall look drip body look body body think body smell begin violet disappear go bath darkness go feeling water fall run body caress caress caressing sure best pentagonia series brilliant unwind favorite time choose highly recommend love especially stand masterful work truly brilliant talent stand alone center novel recommend intend order seem anchor novel perfectly fuse stream consciousness pave way dystonia horror place company still manage forge niche remarkable stun thoroughly reward continue series depart hallucinatory violence present first sing enter mind young married couple spending week sea divide part first part narrative unnamed woman resents baby fear lose husband feel helpless cope communist society ache husband love yet suspicious infidelity particularly handsome taciturn boy arrive loquacious mother move cottage next dream mixed daily conscious narrative reveal anxiety torment fear dream sexual connotation see vision greek warrior slaughter violent battle vivid rendition ubiquitous cue communist life stand morosely line soldier stand nearby gun anyone dare defies attempt alter second part husband perspective primarily tell poetic form involve often allegorical portrayal see life resentment underscore much tale even attraction boy door become central conflict stay long boy freely express homosexuality yet feel omnipresent oppression communist system systematically stifle human perhaps poignant passages follow poem express communist system do everyone else humanity longer man call thing name blaspheme longer man laugh jeer longer man hop mistrust longer man love longer man dream aloud silent longer sleep dream sleepless longer wont believe consent longer hide add line yet signify communism jade turned hopeless cynic still young write tale bear repeat reading young couple gain permission spend week beach resort spend time sit ocean silent private thought get inside head day receive different perspective view vacation current live fantastic job express frustration station life freedom feel desert lament burden motherhood loss personal sense self lament loss freedom government clamp harder writer artist also drive frustration frustration closet homosexual straight macho world overtly state theme reveals peel onion layer layer underlie theme come reverie hallucination young couple stare water style write effective private thought start true essence life young jade young couple", "genres": ["Fiction & Literature", "LGBT"], "summary": "In this brilliant, apocalyptic vision of Castro's Cuba, we meet a young couple who leave the dreariness of Havana and spend six days at a small seaside retreat, where they hope to recapture the desire and carefree spirit that once united them.\r\n\r\nIn a stunning juxtaposition of narrative voices, the wife recounts the grim reality of her marriage, the demands of motherhood, and her loss of freedom, innocence, and hope; while her husband, a disillusioned poet and disenchanted revolutionary, recalls his political struggles and laments the artistic and homosexual freedom that has been denied him.\r\n\r\nRich in hallucination, myth and fantasy, Farewell to the Sea is a fierce and unforgettable work that speaks for the entire human condition.", "asin": "0140066365", "rank": "732612", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/41E%2BI6zVGsL.jpg", "country": "Cuba", "story_arc": ["Tragedy", "Things only get worse"]}