{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 19, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Thoughtful story but slow, very slow.  There was a great deal of detail and very little action.  I did enjoy how Lodge developed his characters and moved the protagonist toward change and growth."}, {"review_sentiment": 5.0, "review_text": "Such easy reading, I was sorry when it finished.  Will now look for other David Lodge books"}, {"review_sentiment": 4.0, "review_text": "As an aficionado of David Lodge, I was not disappointed ! very good story, albeit Hawaï would not be my first destination  to go on holiday ! but  Lodge has that  tickle of (british ) humor I love,The  story never lets you down ,he describes  very well  the (cultural ) difference between  2 countries, and how people  try to connect  with each other, ,regarding  their personal view  on life = sometimes hilariousChristiane Boone- Belgium"}, {"review_sentiment": 5.0, "review_text": "I can't believe there are only 16 reviews for this book...if you like Nick Hornby for example, you'll love Lodge.  This funny, bittersweet book is about a former minister who comes to life in a trip to Hawaii to help out a terminally sick aunt. Its a touching story that deals with love, sex, death, family ....but like all of Lodge's books its a book that is both \"feel-good\" but also intelligent and insightful."}, {"review_sentiment": 3.0, "review_text": "I loved the Lodge of Changing Places, a truly hilarious work, and good enough to suggest that Tom Stoppard's marvelous play, Arcadia, could be derived from it.  I think it is Changing Places that I mean.  But I was disappointed in Paradise News.  I have been reading Graham Greene , and Lodge was a bit of a comedown, with prose that was much less confident and somehow less fine.  The comedy in Paradise News is no match for the hilarity of Greene's Our Man in Havana, and Lodge's Catholicism is a bore where Greene's can be haunting and beautiful.  Sex that Greene would handle delicately can be cringe-inducing in Paradise News.  The \"ship of fools\" device gives us side characters in the hero's tour group, but few of them are developed well or have anything to do with the plot.  The mechanical use of them as each notices the hero's dad's ambulance has scant relevance to the story. The minutiae of arrangements, travel, money, hospitals, cars, apartments, fills every plodding page.  In short, Paradise News has a pot-boiler quality. It is easy to put down.  Lodge lays on some heavy-handed parallelism between the commercialized Paradise of Honolulu and the Paradise the major religions promise in the hereafter, but the reader gets little enjoyment out of it.  The best feature of the book may well be the experiences it provides of a Brit learning about America and Americanisms in one of America's commercialized playgrounds.  Lodge is refreshingly genial about us, almost as if he is trying to avoid offense to his American readers (something Greene too often fails to do).  I see that everyone reviewing the book gives it four or five stars, but I can't give it more than three."}, {"review_sentiment": 5.0, "review_text": "Simply excellent. Funny, intelligent, touching and insightful musings on religion and the cult of tourism. Lodge is a wonderful intelligent writer who can weave wit and erudition."}, {"review_sentiment": 4.0, "review_text": "I am very pleased to pick it up. The catholic priest background of the main character generates interesting approach to various features of our lives. Almost everything looks different from that perspective, though the book is not an esey but a novel. The other reason for which I like it very much is the author placed cleverly in the book several amazing observations and concepts. Did you think about the contemporary tourist enterprise as a replacement (in kind) for religion? About tourists 'destinations' as pilgrimage sites? Did you think about the tourists behavour? Interesting..."}, {"review_sentiment": 5.0, "review_text": "I just adore this book and can't believe it isn't better known.  I re-read it every few years and it holds up beautifully.  Someone should buy the film rights, it would make for a terrific movie, pursuing the theme of change just when you thought you were stuck in your same-old life forever.  Lodge's other under-appreciated novel is \"Therapy\".  I think these are his two strongest works to date.I often pair this book with Ann Perry's novel, \"Foreign Affairs\", which I think won the Pulitzer.  The two together make for a great gift."}, {"review_sentiment": 5.0, "review_text": "An astonishing work that covers so much territory so well.  Just when you think that there is no salvation for the main character (after all, how can the non-believer believe?) Lodge even manages to find a bit of Paradise in Matthew 25 on a blustery Midlands day.  A work of tremendous humor, some pathos, and infinite beauty."}, {"review_sentiment": 5.0, "review_text": "I used to live in Honolulu, after that Nashville. It was and is so annoying to read those books that seem to have been written so an author--or would-be author could take a trip to either and then take the expenses off of ones taxes.  A few people have succeeded.  Only a few. But some of the losers really stand out--the book that put the snootiest part of Nashville where my neighbor's son-in-law was raising fighting cocks, for instance  Fortunately I've forgotten the title and author of that one.  Some of the Hawaii ones are almost worse, because there really is a cultural mix there that, I'm sorry, you aren't going to get in a two week visit.So when I first picked up David Lodge's Paradise News I was expecting to cringe through it.No no no no no.Lodge is able to work it so that his main character is clueless enough that it doesn't matter if the geography is screwed up.  After all, if you are from England and Ireland, we drive on the wrong side of the road, so that if you start to cross, giving the normal look to the side you normally do, you may be hit by a car.  Which indeed happens to our hero's father. Add to this that Lodge is not at all afraid to talk philosophy and religion, and I was hooked."}]}, "authors": ["David Lodge"], "isbn": "0140165215", "longitude": -157.8556764, "periods": ["2000s", "Recent Releases"], "title": "Paradise News", "word_cloud": "thoughtful story slow slow great deal detail little action enjoy develop character move protagonist change growth such easy reading sorry finish aficionado disappoint good story destination holiday tickle british humor love story never let describes well cultural difference country people try connect regard personal view life sometimes hilariouschristiane belgium review example love funny bittersweet former minister come life trip help terminally sick aunt touch story deal love sex death family also intelligent insightful love truly hilarious work good enough suggest marvelous play think change place mean disappoint read bit comedown prose much le confident somehow le fine comedy match hilarity bore haunt beautiful delicately ship fool device give side character hero tour group develop well anything plot mechanical use notice hero dad ambulance scant relevance story minutia arrangement travel money hospital car apartment fill plodding page short quality easy put lay parallelism commercialize major religion promise hereafter get little enjoyment best feature well provide learn commercialize playground refreshingly genial almost try avoid offense american reader something often fail see everyone review give star excellent intelligent touch insightful musing religion cult tourism wonderful intelligent writer weave wit erudition please catholic priest background main character generates interest approach various feature live everything look different perspective reason like much author place cleverly several amazing observation concept contemporary tourist enterprise replacement kind religion tourist pilgrimage site tourist behavior interest adore better know year hold beautifully film right terrific movie pursue theme change think stuck life forever think strongest work often pair think pulitzer together make great gift astonishing work cover much territory well just salvation main character believe even manage find bit blustery day work tremendous humor pathos infinite beauty use live annoy seem write author author trip take expense one tax a people succeed only loser really stand put snootiest part neighbor raise fight cock instance fortunately forget title author one almost worse really cultural mix sorry go week first pick expect cringe able work main character clueless enough matter geography screw drive wrong side road start cross give normal look side normally car indeed happen hero father afraid talk philosophy religion hook", "genres": ["Fiction & Literature"], "summary": "Paradise, tourist style. It's a very long way from home.\r\nBernard Walsh is in Hawaii on family business, escorting his querulous father to the bedside of a long-forgotten aunt. His mission transports him from quiet obscurity in Rummridge, England, to a lush tropical playground, from cloistered solitude into the unfamiliar company of package tourists: honeymooners; young women looking for Mr. Nice; families nuclear and fissile. \r\n\r\nBut it is the island itself that holds the most astonishing surprises, as an accidental encounter opens up to Bernard possibilities of life, and love, never dreamed of in his normally overcast habitat. Paradise News is an enchanting--and very funny--portrait of the late flowering of an honest man.\r\n\r\n\"Narrative tricks aside, Lodge's Catholicism and his gimlet eye make him the true heir of Evelyn Waugh.\" Kirkus Review.", "asin": "0140165215", "rank": "1295261", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51-CUEcaDVL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}