{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 138, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Not only an ini-depth character novel, but a superb look at French society of the 19th century."}, {"review_sentiment": 4.0, "review_text": "Started off a little slow, had its ups and downs but the second half was great. Really enjoyed this book!"}, {"review_sentiment": 4.0, "review_text": "Interesting period piece"}, {"review_sentiment": 5.0, "review_text": "gift for my daughter"}, {"review_sentiment": 5.0, "review_text": "Very good of how you can be pulled between two opposite choices."}, {"review_sentiment": 5.0, "review_text": "I'm 61 years old and had never heard of this novel until recently. I'm stunned by the candor and depth of psychological insight its author displays. It's hard for me to believe it was first published in 1830. The Red and the Black must have scandalized readers with its exposure of the venality and stark hypocrisy of society and the church in post-Napoleonic France. The protagonist, Julien, is a scoundrel -- a narcissistic psychopath, even -- yet it's hard not to like him, at least a little bit. The female characters, in fact, find him irresistible; the more he mistreats his paramours the more they seem to love him. Julien applies his considerable talents to emulating the aristocrats he detests, in order to rise in society from his humble origins. Do his schemes succeed? Read The Red and the Black to find out."}, {"review_sentiment": 5.0, "review_text": "The major storyline of the Red and the Black is the protagonist's romantic relationships with various women.  Though certain traditionally minded people may find such relationships interesting, I doubt they, and thus the novel as a whole, will resonate with most modern readers because of the dramatic changes in the relationship of the sexes since that era.I personally liked The Red and the Black and will recommend it to people who have an interest in early Modern Europe.  In particular, Stendhal's description of the hypocrisy of the bourgeoisie restorationists will endure as a lasting indictment of French conservatism."}, {"review_sentiment": 2.0, "review_text": "I finally finished this hellish book.  I’ve been reading it since August by sheer force of will.  Trust me.  You don’t want to spend over 600 pages living in the mind of Julien Sorel.  It’s a cramped, sordid, dispiriting place.French novelists like our own Southern Gothic novelists seem endlessly fascinated by human garbage and uninterested in human redemption.I didn’t like this book, but shouldn’t I respect it as a classic?  It does have impressive qualities, but it’s also very flawed.  It’s repetitive, slow and the characters lack depth.  In fact the characters are caricatures who would be boring if they weren’t disgusting.  They’re all soulless, especially Sorel.You might enjoy the seduction and domestic intrigue.  It’s packed to the rafters with these things.  But I was impressed by how much his writing resembled Frank Norris’s in the passages that featured nature or travel.  It had that same calm, distant, pensive quality.  There are also some mildly interesting discussions of 19th century French politics in chapters 52 and 53.However, eighty percent of the book is nothing more than neurotics on parade—a big kerfuffle over nothing.2 stars"}, {"review_sentiment": 1.0, "review_text": "I struggled to get through it."}, {"review_sentiment": 5.0, "review_text": "Stendhal concludes this tale with a dedication: TO THE HAPPY FEW. After we read about Julien Sorel, the protagonist, and the people he encounters, it is an apt way to finish the book because what is missing from the story is happiness. The few times it happens, it is always conditional on something else. Even when Julien experiences love, he is overwhelmed by feelings of triumph, not passion.Because this classic was written in 1830, today’s readers can be forgiven if some of the plot lines, psychological exposition, obvious use of foreshadowing and characters seem a bit familiar. It is easy to envision a young Theodore Dreiser, Erich Maria Remarque, Saul Bellow or Willa Cather holed up in a corner devouring every word as it sowed the seeds for their writing (I found so many parallels with An American Tragedy and Augie March). Stendhal’s story delves deeply into a particular society in a unique period of history. Julien indeed feels a bit lost; he would rather have been marching with his hero Napoleon in an earlier time. At times it seems tedious, which Stendhal comically acknowledges: “The total boredom of the life led by Julien, without real interests, will no doubt be shared by the reader. These are the flatlands of our journey.”Yet the journey takes us to a conclusion that has a lasting effect. I doubt it can be forgotten by anyone once read. Like training for a long race, it makes all the toil that came before it more enjoyable and relevant. I can better understand why, in life, there are but a happy few."}]}, "authors": ["Stendhal"], "isbn": "0140447644", "longitude": 2.3514992, "periods": ["1800s"], "title": "The Red and the Black", "word_cloud": "not character superb look french society century start little slow ups down second half great enjoy interesting period piece gift daughter very good pull opposite choice year old never hear recently stun candor depth psychological insight author display hard believe first publish reader exposure venality stark hypocrisy society church protagonist scoundrel narcissistic psychopath even yet hard least little bit female character fact find irresistible mistreats paramours seem applies considerable talent emulate aristocrat detests order rise society humble origin do scheme find major story line protagonist romantic relationship various woman certain traditionally mind people relationship interest doubt thus whole resonate modern reader dramatic change relationship sex personally like recommend people interest early particular description hypocrisy bourgeoisie restorationists endure last indictment french conservatism finally finish hellish read sheer force want spend page live mind cramp sordid dispirit novelist novelists seem endlessly fascinate human garbage uninterested human respect classic impressive quality also flaw repetitive slow character lack depth fact character caricature bore disgust soulless especially seduction domestic intrigue pack rafter thing impress much write resemble passage feature nature travel calm distant pensive quality also mildly interesting discussion century french politics chapter eighty percent nothing neurotic big star struggle conclude tale dedication protagonist people encounter apt way finish miss story happiness time happen always conditional something else even experience love overwhelmed feeling triumph classic write today reader forgiven plot line psychological exposition obvious use foreshadow character seem bit familiar easy envision young hole corner devour word sow seed write find many parallel american story delf deeply particular society unique period history indeed feel bit lose rather march hero earlier time time seem tedious comically acknowledge total boredom life lead real interest doubt share flatland journey take conclusion last effect doubt forgotten anyone train long race make toil come enjoyable relevant better understand life happy", "genres": ["Fiction & Literature"], "summary": "Charts the rise and fall of an ambitious young social climber in a cruel, monarchical society\r\n\r\nHandsome, ambitious Julien Sorel is determined to rise above his humble provincial origins. Soon realizing that success can only be achieved by adopting the subtle code of hypocrisy by which society operates, he begins to achieve advancement through deceit and self-interest. His triumphant career takes him into the heart of glamorous Parisian society, along the way conquering the gentle, married Madame de Rênal, and the haughty Mathilde. But then Julien commits an unexpected, devastating crime—and brings about his own downfall. \r\n\r\nThe Red and the Black is a lively, satirical portrayal of French society after Waterloo, riddled with corruption, greed and ennui, and Julien—the cold exploiter whose Machiavellian campaign is undercut by his own emotions—is one of the most intriguing characters in European literature. \r\n\r\n", "asin": "0140447644", "rank": "98821", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51IX4%2BIlryL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}