{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 9, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "I find this style of writing hard to really get into. I feel like it's a bit of a chore to read. It doesn't keep me at the edge of my seat wanting more--that's for sure. It's like reading about someone's acid trip and then they go visit the underside of San Fran. It was okay but I a struggling to get through it and won't read anything else by this writer."}, {"review_sentiment": 2.0, "review_text": "What a mess of a short novel"}, {"review_sentiment": 5.0, "review_text": "I must say this novel was far less brutal in it's descriptions of street life than Vollmann's other works but it was not for the faint of heart. It was less complex in it's characterizations but still a decent read and easy to follow. There are times when you wonder just what in the world is the aim of the protagonist who ultimately pays a considerable price for his bizarre obsessions and his delusional living but I won't give too much away here. Another dystopian yarn from Vollmann, meant perhaps for fans only."}, {"review_sentiment": 4.0, "review_text": "Appearing in 1991, this short novel conveys some of the stories Vollmann gathered during his time among the San Francisco Tenderloin, pre-gentrification, around Jones Street. While a familiar topic for this author, and one which his readers will have learned much about given his many stories set in this milieu, this is his first attempt to make a longer work out of episodes. He alludes in the preface that these are true, as told to him by prostitutes, within the fictional framework, typical of Vollmann's blending in much of his books, between fiction and fact.The grittiness is there. You see via Jimmy, a Vietnam vet on disability living in a claptrap hotel, the lesions and bruises on those with whom he mingles, and while he's out for sex, he's also in search of the titular Gloria. Almost like a sister to him as they grew up, he longs for her and whether he makes up these stories for an imaginary character or a real woman he's loved and lost, this impels him to keep paying for sex and for stories from those around him.This reminded me of Holden in \"The Catcher in the Rye,\" and like that novel, this method Vollmann favors does risk familiarity and sentimentality among the proverbial subjects with hearts of gold. They are tarnished and tawdry here, but Vollmann makes the effort and forces us to take the time to hear their tales from past and present, and we see them as fellow human beings. This intention, the ethical motive underlying his career before and especially since this early novel, keeps him readable even when the material, as here for me, is not what I'd gravitate towards, compared to his historical and political themes in his later books (which I've been reading the past few years with pleasure, gradually reviewing here...).\"The light was very red and warm; the girls were beautiful, and everything was beautiful until later when the girls got anxious and started demanding their tips.\" That sums up the mood. He and his pal Code Six, also a vet, watch coverage of the past war, with the sound off to block flashbacks for his friend. \"The long lean bombs went swimming slowly downward like fish, until they came to the towns and became orange flowers.\" Not much happens. Jimmy is going downhill, the city draws him down, and everyone's on the make--as the opening vignette with Laredo, who's undercover, introduces efficiently.His downcast mood permeates this novel. \"He knew life was going to get worse. Maybe stories weren't enough, he thought. But no, they 'have' to be. Stories and hair.\" He collects both, the latter to make some sort of snipped tribute to the elusive Gloria. This all lacks resolution, and stops suddenly, as if to jar the reader out of a stupor shared by Jimmy and those who surround him. It's a low-key narration, but Vollmann captures the feel of the down and out with his typical mix of detachment and compassion."}, {"review_sentiment": 4.0, "review_text": "Whores for Gloria, like its author, takes time to grow on you. Vollman's writing style takes some getting used to, but once you read for a little while, you'll realize just how tight his prose is. His exploration of Jimmy's consciousness is haunting, and the way he rehashes the prostitute's stories and changes them to be about himself is interesting.Another things that is interesting about this book is the ambiguity of Gloria's identity. Gloria is a woman, seemingly a prostitute that Jimmy claims to be married to. He thinks that by collecting stories and hair from other prostitutes he can somehow reconstruct her. The question is whether or not Gloria exists. I came to my own conclusions on that, and I'll let you do the same.I liked that, at the end of the novella, Vollman included an actual account of his experiences with prostitutes, including a diagram of the average street prices for anything you could think of, as of the early 90's.My only complaint about the book is that I wish it had gone more into Jimmy's consciousness. Despite that, it is a good way to introduce yourself to the author, simply because of how short it is.This book is written in a way that reminds me A LOT of Zombie by Joyce Carol Oates, which explores the mind of a psychotic serial killer. I recommend reading that if you like this book, or the other way around."}, {"review_sentiment": 4.0, "review_text": "William T. Vollmann, Whores for Gloria (Pantheon, 1991)Published just as Vollmann was beginning to make a name for himself as a critical darling, Whores for Gloria propelled him into the world of underground literature with a fervor rarely seen. What separates the now-towering Vollmann from his flash-in-the-pan contemporaries is that Vollmann's shock-value work actually has some real meat to it.Whores for Gloria is the story of Jimmy, a drunkard who lives in San Francisco's Tenderloin district and pines for Gloria. We have no idea who Gloria really is, and we often get the idea that Jimmy doesn't, either. In an effort to rebuild his memories of Gloria in his mind, Jimmy begins paying the area's hookers to tell him stories of their childhoods, which Jimmy then maps onto himself and Gloria, attempting to make her (or his vision of her) achieve flesh-and-blood status.As the title is likely to convey, Whores for Gloria is not a suitable-for-all-audiences kind of book. However, one isn't going to get the prurient-interest-for-the-sake-of-prurient-interest writing one finds in such authors as Dennis Cooper or Matthew Stokoe; what Vollmann has penned here is a surprisingly subtle mystery novel disguised as a slice-of-life drama so embraced by the other authors mentioned above. The best comparison I can make to this book is to the better novels of Joyce Carol Oates; it seems to me that those who enjoy Oates' take on the disintegration of the psyche will also get a kick out of Vollmann. This one deserves the hype. *** ½"}, {"review_sentiment": 4.0, "review_text": "I've read that Vollman is the next great American novelist and you can certainly compare him to Pynchon.  I wouldn't go quite so far as that, but he certainly has an evocative, if sometimes difficult to follow prose style, that one will either find very annoying or very gratifying, depending how well you get into his groove.This novel or novella is quite good. Vollman depicts a very gritty, grimy, and sometimes gross Tenderloin district in San Francisco known for it's prostitutes, strip clubs, and other nefarious goings on.  The story is about Jimmy, a low life, down and out, alcoholic who is in love with a prostitute named Gloria.  The catch is Jimmy is so addled by the end of the novel we never really know whether Gloria is real or a figment of Jimmy's imagination.  In some ways Gloria is an amalgamation of a number of street girls that Jimmy congregates with.  Whatever the case, the story is compelling - the way watching a train wreck is compelling."}, {"review_sentiment": 5.0, "review_text": "One of the editorial reviews calls this a \"minor\" work and I can see his point; it's a novella with small ambitions and it's defintely tawdry. (For me, that's a plus, having a weakness for that sort of thing.) However, that's not the reason I've read it dozens of times, and will continue rereading it. There's the description of the Tenderloin, which is lean and evocative; Vollman brings it to life the way Jimmy wants the whores' stories to revive Gloria. There's the compassion I have for Jimmy, who is the sort of stinking, addled drunk you'd walk by while holding your breath. But most of all - and I have no idea if it was intended - \"Whores for Gloria\" becomes this wonderful allegory for the process of writing a novel, if not being a novelist. Jimmy is so deluded that he goes to whores in search of their hair and their stories and their memories, all of which he thinks he can graft on to his memory (invented or not) of Gloria and make her real. It's the same game a novelist plays: there's an ideal vision that exists for reasons only he/she understands. To make it real on paper they have to become an obsessive collector of the world, stealing others' stories and blending them with their own imaginations. Such a strange, crazy-making hobby - and yet every novelist on Amazon.com has indulged in it, which is one more reason that Jimmy becomes a worthy subject. A terrific read(...)"}, {"review_sentiment": 5.0, "review_text": "Jimmy spends his social security checks on booze andprostitutes, whose stories become more important than theirfavors. Minimal, nervous and often funny. What the reader actually see of Jimmy 's life is like a wrinkled piece of saran wrap, stretched over a bowl of something slimey, churning,and threatening to overflow; as, almost against your will, Vollmann's elegant spellbinding prose pulls you closer and closer. Beware --this isn't for everyone. It's impolite, gross, nasty, violent. But author Vollmann,who often writes about prostitutes, is himself a little like the stereotypical \"whore with the heart of gold.\" In his very refusal to turn away from ugliness, he reveals a rare beauty."}]}, "authors": ["William T Vollmann"], "isbn": "0140231579", "longitude": -122.4192363, "periods": ["1900s"], "title": "Whores for Gloria: A Novel", "word_cloud": "find style write hard really feel bit chore edge seat want sure read someone acid trip go visit underside okay struggle anything else writer mess short far le brutal description street life work faint heart le complex characterization still decent easy follow time wonder world aim protagonist ultimately pay considerable price bizarre obsession delusional living much away dystonia yarn meant perhaps fan appear short conveys story gather time familiar topic author reader learn much give many story set milieu first attempt make longer work episode allude preface true tell prostitute fictional framework typical blending much fiction grittiness see vet disability live claptrap hotel lesion bruise mingles sex also search titular sister grow longs make story imaginary character real woman love lose impels pay sex story remind method favor risk familiarity sentimentality proverbial subject heart gold tarnish tawdry make effort force take time hear tale past present see fellow human being intention ethical motive underlie career especially early keep readable even material gravitate towards compare historical political theme later read year pleasure gradually review light red warm girl beautiful everything beautiful later girl get anxious start demand tip sum mood pal also vet watch coverage past war sound block flashback friend long lean bomb go swim slowly downward fish come town become orange flower not much happens go downhill city draw everyone make opening vignette undercover introduces downcast mood permeates know life go worse story enough think hair collect latter sort snip tribute elusive lack resolution stop suddenly jar stupor share surround narration capture typical mix detachment compassion author take time grow write style take get use little realize tight exploration consciousness haunt way rehash prostitute story change thing interest ambiguity identity woman seemingly prostitute claim marry think collect story hair prostitute somehow question exist come conclusion let liked novella include actual account experience prostitute include diagram average street price anything early complaint wish go consciousness good way introduce author simply short write way remind explore psychotic serial killer recommend read way begin name critical darling propel world underground literature fervor rarely see separate contemporary work actually real meat story drunkard live district pine idea really often idea effort rebuild memory mind begin pay area hooker tell story childhood map attempt vision title likely convey kind however go write find author pen surprisingly subtle mystery disguise drama embrace author mention best comparison make better novel seem enjoy oates take disintegration psyche also kick deserve hype next great american novelist certainly compare quite far certainly evocative sometimes difficult follow prose style annoying gratify depend well novella quite good depict gritty grimy sometimes gross district know prostitute strip club nefarious going story low life alcoholic prostitute name catch addle end never really real figment imagination way amalgamation number street girl congregate case story compel way watch train wreck compelling editorial review call minor work see point novella small ambition definitely tawdry weakness sort thing however reason dozens time continue reread description lean evocative bring life way want story revive compassion sort stink addle drunk walk hold breath idea intend become wonderful allegory process write novelist delude go search hair story memories think graft memory invent make real game novelist play ideal vision exist reason understand real paper become obsessive collector world steal others story blend imagination such strange hobby yet novelist indulge reason become worthy subject terrific spend social security check booze and prostitutes story become important their favors nervous often funny actually see jimmy life wrinkled piece saran wrap stretch bowl something smiley churn threaten overflow almost elegant spellbind prose pull closer closer everyone impolite gross nasty violent author often write prostitute little like stereotypical heart gold refusal turn away ugliness reveals rare beauty", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "With his first three works of fiction—the novels You Bright and Risen Angels and The Ice-Shirt, and the collection The Rainbow Stories—William T. Vollmann announced himself as a writer of rare and ferocious talent, with critics comparing him to William Burroughs, Thomas Pynchon, and T.C. Boyle.\r\n \r\nHis new novel is the story of Jimmy, who has been deserted by his lover, a prostitute by the name of Gloria. In the despair of his loneliness, and his drunken grief, he reassembles Gloria’s presence out of whatever he can buy from the hookers on the street—the fragments of their lives and dreams, and locks of hair they are willing to share for a price. In his search for these snatches of intimacy he meets the hustlers, drunks, and prostitutes of San Francisco’s Tenderloin district: Candy, who beats her customers when they ask for it but refuses to let them call her a bitch; Snake, who pimps his wife; Nicole, whose job it is to give men AIDS; Jack, who shoots his woman’s earnings into his arm but still likes Chopin even though he doesn’t have a record player; and Gloria, who may or may not be a figment of Jimmy’s imagination.\r\n \r\nVollmann writes with explosive power of the inner city, unflinching in the way he confronts the solitude of the homeless and unloved, the insulted and the injured of skid-row America. His exhilarating, high-voltage style and lyric language touch the heart and retrieve a jubilant integrity from the harsh struggles of his characters. Here is a world of harrowing truth, beautifully expressed by a writer of prodigious gifts.", "asin": "0140231579", "rank": "1094684", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51bvddNNXiL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}