{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 83, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "The story is good but the writing is redundant and only so so. Maybe it is the translation."}, {"review_sentiment": 5.0, "review_text": "I fell in love with Reinaldo with every page."}, {"review_sentiment": 5.0, "review_text": "I had checked this book out from the library a few years ago.  I wanted to read it again and with rereads I always buy them as if they are that good you should own it."}, {"review_sentiment": 4.0, "review_text": "Although this book was first published in 1993, it came to light again recently as a result of the death of Fidel Castro.  The author of an article I read recommended it highly as a perspective on the realities of Fidel Castro's Cuba.  I have rated this book highly, but I have to admit to a fair amount of skepticism with regard to the factual nature, or lack thereof, of the experiences of Mr. Arenas.  The anecdotes range from disturbing to surreal and on to fantastical.  I simply don't believe much of what was written actually took place.  I have to question if this memoir was actually intended to be taken literally.  My political side wants to believe the worst of Fidel Castro as written, but when I question some of this book, I am left questioning it entirely.  I have searched the internet for any commentary or discussion regarding this book hoping to find some level of confirmation, but maybe it was out too long ago for such scrutiny to be captured on the internet.  However, I have come across other reviews that also question how truthful the anecdotes are.  While most of my own skepticism centers on the sexual escapades of Mr. Arenas, other stories are also hard to accept.I still recommend this book.  If only a fraction of what has been written is true, it's bad enough with regard to the true nature of Castro's Cuba."}, {"review_sentiment": 5.0, "review_text": "It's a book."}, {"review_sentiment": 5.0, "review_text": "Perfect condition."}, {"review_sentiment": 5.0, "review_text": "Loved the movie and my recent trip to Havana made we want to read the source material.  Glad to find it a a fair price and quick delivery."}, {"review_sentiment": 5.0, "review_text": "This book shocked me, comforted me, saddened me and, at the end, disappointed me. After he spends so much of the book covering this misfortune in Cuba, I felt depressed by the way the book ends (and in the city I live in, no less!).Definitely an honest, unadulterated account of one author who lived through many things in his life. I highly recommend reading it."}, {"review_sentiment": 5.0, "review_text": "Thank you"}, {"review_sentiment": 5.0, "review_text": "Unbelievable book.  Quite an eye opener about life in Cuba!  Glad I read it and it provided insight into the Cuban regime and how oppressive it is.Good Read!"}]}, "authors": ["Reinaldo Arenas"], "isbn": "0140157654", "longitude": 0.0, "periods": ["1900s"], "title": "Before Night Falls: A Memoir", "word_cloud": "story good writing redundant translation fell love page check library year ago want rereads always buy good first publish come light recently result death author article recommend highly perspective reality rat highly admit fair amount skepticism regard factual nature lack thereof experience anecdote range disturb surreal fantastical simply much write actually take place question actually intend take literally political side want believe worst write question leave question entirely search internet commentary discussion regard hop level confirmation maybe long ago scrutiny capture internet however come review also question truthful anecdote skepticism center sexual escapade story also hard still fraction write true bad enough regard true nature perfect condition love movie recent trip make want source material find fair price quick delivery shock comfort saddened end disappoint spends much cover misfortune felt depressed way end city live le honest unadulterated account author live many thing life highly recommend read thank unbelievable eye opener life provide insight regime oppressive", "genres": ["Memoir", "LGBT"], "summary": "The shocking memoir by visionary Cuban writer Reinaldo Arenas \"is a book above all about being free,\" said The New York Review of Books - sexually, politically, artistically.\r\n\r\nArenas recounts a stunning odyssey from his poverty-stricken childhood in rural Cuba and his adolescence as a rebel fighting for Castro, through his supression as a writer, imprisonment as a homosexual, his flight from Cuba via the Mariel boat lift, and his subsequent life and the events leading to his death in New York. \r\n\r\nIn what The Miami Herald calls his \"deathbed ode to eroticism,\" Arenas breaks through the code of secrecy and silence that protects the privileged in a state where homosexuality is a political crime. Recorded in simple, straightforward prose, this is the true story of the Kafkaesque life and world re-created in the author's acclaimed novels.", "asin": "0140157654", "rank": "240548", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51KUW8vTesL.jpg", "country": "Havana", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}