{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 136, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "I'm not the biggest DeLillo fan; I thought White Noise was very overrated.  But I've seen the movie JFK at least 25 times and find the JFK assassination fascinating.  And for that reason, and that reason alone, I found this book enjoyable and fulfilling."}, {"review_sentiment": 4.0, "review_text": "Delillo is to be congratulated for digging deep into the life of Lee Harvey Oswald.  I am of the opinion that Delillo was painstaking in his research of Oswald; that it is not fancied or concocted.  However Delillo's vehicle for recounting Oswald's life is unconvincing .  The concept that, at least, rogue agents of the  CIA sought to stage a failed attempt at the President's life so as to spur an invasion of Cuba is more than just farfetched.  This theory that pinning the attempt on JFK's life on Oswald due his pro Soviet activities does serious damage to the lucid studies which establish firm ground thaf the assassination was intended to be successful, and that high government officals were to varying degrees  involved (at least with the massive cover-up).  Simple put, Delillo's attempt to place his stamp on the assassination trivializes the historical record, and is a comfort to those who seek to further confuse the American public as to the manner of a cherished President's death."}, {"review_sentiment": 5.0, "review_text": "A perfect reimagining of the Kennedy assasination with typical DeLillo humor and weirdness."}, {"review_sentiment": 1.0, "review_text": "I might get to the end of this book... Chances are I won't! No character building, no story line... We'll written sentences with no discernable meaning."}, {"review_sentiment": 5.0, "review_text": "This is such a wonderfully written book. But in it DeLillo somehow manages to prophesize the next 20 years of JFK assassination research. This book is published a few months before Jim Garrison's \"On the Trail of the Assassins\" and yet mimics many of the conclusions Garrison himself came to. There is also the question of Oswald and destiny, not in Stephen King's sense, but the question of how long were forces guiding Oswald to his unavoidable fate? And who was Oswald, bother literally and figuratively, something John Armstrong takes up in \"Harvey and Lee.\"Putting aside references to JFK Assassination research, this is a brilliant book of fiction which manages to fill in the mosaic that is the events and people that lead to the death of John Kennedy."}, {"review_sentiment": 5.0, "review_text": "The best piece of writing(fiction or non-fiction) on JFK.  The un-surfable beast of Modern History washes away all the characters in this novel.  No one stood a chance."}, {"review_sentiment": 5.0, "review_text": "DeLillo's finest, most polished novel. Great introduction to his work, before White Noise, The Names, and Underworld."}, {"review_sentiment": 5.0, "review_text": "A book that asks more questions than it answers, leaving a trail of possibilities. A brilliant study of one of the most iconic and troubling events of the 20th century."}, {"review_sentiment": 5.0, "review_text": "A book that asks more questions than it answers, leaving a trail of possibilities. A brilliant study of one of the most iconic and troubling events of the 20th century."}, {"review_sentiment": 5.0, "review_text": "Well done. EXCELLENT...!"}]}, "authors": ["Don DeLillo"], "isbn": "0140156046", "longitude": -90.0701156, "periods": ["1900s"], "title": "Libra", "word_cloud": "biggest fan think overrate see movie least time find jfk assassination fascinating reason reason alone find enjoyable fulfilling congratulate dig deep life opinion painstaking research fancy concoct however vehicle recount life unconvincing concept least rogue agent seek stage fail attempt life spur invasion far fetched theory pin attempt life due soviet activity serious damage lucid study firm ground assassination intend successful high government official vary degree involve least massive put attempt place stamp assassination trivialize historical record comfort seek confuse american public manner cherish death perfect re imagining assassination typical humor weirdness end no build story line write sentence discernible meaning wonderfully write somehow manage prophesier next year assassination research publish month yet mimic many conclusion come also question destiny sense question long force guide unavoidable fate bother literally figuratively something take aside reference research brilliant fiction manages fill mosaic event people lead death best piece write fiction beast wash away character no stand chance finest polish introduction work asks question answer leave trail possibility brilliant study iconic trouble event century asks question answer leave trail possibility brilliant study iconic trouble event century well do", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "From the author of White Noise (winner of the National Book Award) and Zero K\r\n\r\nIn this powerful, eerily convincing fictional speculation on the assassination of John F. Kennedy, Don DeLillo chronicles Lee Harvey Oswald's odyssey from troubled teenager to a man of precarious stability who imagines himself an agent of history. When \"history\" presents itself in the form of two disgruntled CIA operatives who decide that an unsuccessful attempt on the life of the president will galvanize the nation against communism, the scales are irrevocably tipped.\r\nA gripping, masterful blend of fact and fiction, alive with meticulously portrayed characters both real and created, Libra is a grave, haunting, and brilliant examination of an event that has become an indelible part of the American psyche.", "asin": "0140156046", "rank": "66096", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51MhcD-zgtL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}