{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 49, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Great copy."}, {"review_sentiment": 5.0, "review_text": "It's Burrough's - What else can you say. One of a kind!!!"}, {"review_sentiment": 5.0, "review_text": "Get past the title, and realize this is a novel of longing and heartache not as bad as some might  think, give WSB a chance."}, {"review_sentiment": 5.0, "review_text": "This 25th anniversary edition of William Burroughs book Queer arrived in less than 3-days time and is now more like 32years since it was written and that much more a cult classic."}, {"review_sentiment": 3.0, "review_text": "What's worth the price of admission is the prologue where Burroughs elaborates (if I'm not mistaken) about his adventures to South America."}, {"review_sentiment": 4.0, "review_text": "Burroughs is not for the faint of heart. His writing is both whimsical in it's rambling run on sentences, and startling in it's often graphic nature. Queer is essential reading for any fans of the Beat Generation."}, {"review_sentiment": 5.0, "review_text": "I enjoyed reading it."}, {"review_sentiment": 5.0, "review_text": "What a surprise.  After reading almost everything published by Burroughs I finally get to Queer and laugh my stinking head off.  In the closest thing to a real \"novel,\" you know, with a story and character development, etc., this book also has some of the funniest descriptive comments in all of Burroughs, making me laugh out loud very, very frequently!"}, {"review_sentiment": 5.0, "review_text": "Loved this classic"}, {"review_sentiment": 5.0, "review_text": "Have always been a huge fan of Burroughs' work. This is definitely one of his more coherent novels, with an actual plot you can follow all the way through. It is confusing at times but that's to be expected from the mind of Old Bill Lee. The desperate relationship between Lee and Allerton is a true heart jerker, subtle as it may be, and I highly suggest those looking for a challange to read this."}]}, "authors": ["William S. Burroughs"], "isbn": "0140083898", "longitude": -99.1333416, "periods": ["1900s"], "title": "Queer: A Novel", "word_cloud": "copy else say kind past title realize longing heartache bad give chance anniversary edition arrive le time write much cult classic worth price admission prologue elaborate mistake adventure faint heart write whimsical ramble run sentence startle often graphic nature essential reading fan enjoy read surprise read almost everything publish finally stink head closest thing real know story character development also funniest descriptive comment make laugh loud frequently love classic always huge fan work definitely coherent novel actual plot follow way confuse time expect mind desperate relationship true heart jerkier subtle highly suggest look challenge", "genres": ["Fiction & Literature", "LGBT"], "summary": "For more than three decades, while its writer's world fame increased, Queer remained unpublished because of its forthright depiction of homosexual longings. \r\n\r\nSet in the corrupt and spectral Mexico City of the forties, Queer is the story of William Lee, a man afflicted with both acute heroin withdrawal and romantic and sexual yearnings for an indifferent user named Eugene Allerton. \r\n\r\nThe narrative is punctuated by Lee's outrageous \"routines\" — brilliant comic monologues that foreshadow Naked Lunch —yet the atmosphere is heavy with foreboding.\r\nIn his extraordinary introduction, Burroughs reflects on the shattering events in his life that lay behind this work.", "asin": "0140083898", "rank": "620038", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51vyv4v7tWL.jpg", "country": "Mexico", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}