{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 587, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "This novel looks into the conflicting views and opinions in our society today of sexual assault. The main character has sexual issues and takes advantage of women but does not feel guilty for his actions. The novel gives a good description of how these scenarios happen and people have many interpretations of whether the women in his life agreed or disagreed to be a part of the experiences. The novel is better than the book because in the movie you cannot tell what his thoughts are and in the novel you can."}, {"review_sentiment": 5.0, "review_text": "Great novel, many scenes that elicit strong reactions and the conversations between David and the committee, him and Lucy are thoroughly entertaining and very well conceived"}, {"review_sentiment": 5.0, "review_text": "Such an amazing book, I am glad that my professor chose this book for everyone to read"}, {"review_sentiment": 5.0, "review_text": "Such a really good book by Coetzee very strange and exotic but just being able to read about Davids perspective in sex and love and to see him change as a character very good experience reading this book"}, {"review_sentiment": 1.0, "review_text": "Utterly disappointing...the protagonist has no purpose and the author does not give any plausible basis for the protagonist's (or his daughter) stubbornness. You can't insist on something illogical without explaining why that person would find that reasonable."}, {"review_sentiment": 5.0, "review_text": "One of Coetzee's best novels has a dissolute professor, at the end of his career, dealing with the consequences of his sexual abuse and the changing face of South Africa.  A painful ride at times, but beautifully written."}, {"review_sentiment": 5.0, "review_text": "Coetzee's pared-down writing is brilliant. He held my attention on that account from the first pages, and never failed the expectations I developed then of his writing style. Then the layers of the story were all nicely done, and each element shaped up in the same spare fashion and with the most resonant of words and explanations. I think this book is a masterpiece. The second book of his that I've read, and I've become a big Coetzee fan."}, {"review_sentiment": 4.0, "review_text": "David Lurie, a university professor in post-apartheid South Africa, will go to almost any length to satisfy his sexual needs, including the seduction of one of his students.  When she charges him with sexual harassment, he is forced out of his job, partly because he shows no real remorse.  He then moves in with his daughter, a lesbian who lives on a small farm.  A tragic and violent event drives home the vulnerability of women in this society and sheds a different light on David’s role as a predator.  This novel made me uncomfortable, particularly with regard to the role reversal between the blacks and the whites.  The blacks have the power, and the whites now find themselves in a world where they are not the bosses.  David’s daughter is more accepting of the new order of things, particularly the lack of law and order, while her father’s frustration festers.  Their opposing attitudes cause a rift between them, and I have to say that, despite his despicable behavior with regard to women, his point of view seems entirely reasonable with regard to his daughter’s safety.  His daughter becomes depressed but ultimately seems willing to absorb some personal losses in order to maintain her quiet life.  Is she courageous or just plain stubborn?  She basically has three choices:  stand up for her rights, accept the situation as is, or leave.  Standing up for her rights could cost her her life, and I think she feels that the whites deserve the treatment they are getting from the blacks anyway.  Turnabout is fair play."}, {"review_sentiment": 4.0, "review_text": "Good book. Bored me a bit."}, {"review_sentiment": 5.0, "review_text": "This book ensnares you from page one. Don't expect for a second you know what's in store for David Lurie. A man faced with age and the realities of South Africa and fatherhood, this novel could have been quiet and safe while exploring these themes in David Lurie. Instead, the plot bulldozed over my expectations and left my head spinning to the very end. If you can put down Coetzee's crisp, fast-paced prose, you are stronger willed than me."}]}, "authors": ["J. M. Coetzee"], "isbn": "0140296409", "longitude": 18.417396, "periods": ["1900s"], "title": "Disgrace: A Novel", "word_cloud": "look conflict view opinion society today sexual assault main character sexual issue take advantage woman guilty action give good description scenario happen people many interpretation woman life agree disagreed part experience better movie tell thought many scene elicit strong reaction conversation committee thoroughly entertain well conceive such amazing glad professor everyone such really good strange exotic able perspective sex love see change character good experience reading utterly disappointing protagonist purpose author give plausible basis protagonist daughter stubbornness something illogical explain person reasonable best novel dissolute professor career deal consequence sexual change face painful ride time beautifully write write brilliant hold attention account first page never fail expectation develop write style then layer story nicely do element shape spare fashion resonant word explanation think second become big fan university professor go almost length satisfy sexual need include seduction student charge sexual harassment force job partly show real remorse move daughter lesbian live small farm tragic violent event drive home vulnerability woman society shed different light role predator make uncomfortable particularly regard role reversal black white black power white find world boss daughter accept new order thing particularly lack law order father frustration fester their oppose attitude cause rift say despicable behavior regard woman point view seem entirely reasonable regard daughter safety daughter becomes depress ultimately seem willing absorb personal loss order maintain quiet life be courageous plain stubborn basically choice stand right accept situation leave right life think feel white deserve treatment get black anyway fair play good bit ensnare second know store man face age reality fatherhood safe explore theme instead plot bulldozed expectation leave head spin end put crisp prose stronger will", "genres": ["Fiction & Literature"], "summary": "From the author of Waiting for the Barbarians and the Booker-Prize-winning Life & Times of Michael K, a dazzling new novel--his first in five years\r\n\r\nDisgrace--set in post-apartheid Cape Town and on a remote farm in the Eastern Cape--is deft, lean, quiet, and brutal. A heartbreaking novel about a man and his daughter, Disgrace is a portrait of the new South Africa that is ultimately about grace and love.\r\n\r\nAt fifty-two Professor David Lurie is divorced, filled with desire but lacking in passion. An affair with one of his students leaves him jobless and friendless. Except for his daughter, Lucy, who works her smallholding with her neighbor, Petrus, an African farmer now on the way to a modest prosperity. David's attempts to relate to Lucy, and to a society with new racial complexities, are disrupted by an afternoon of violence that changes him and his daughter in ways he could never have foreseen. In this wry, visceral, yet strangely tender novel, Coetzee once again tells \"truths [that] cut to the bone.\" The New York Times ", "asin": "0140296409", "rank": "32822", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/516xcYMIjOL.jpg", "country": "RSA", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}