{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 51, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "un classique a lire ou a relire, mr guy de maupassant possede une plume creatrice et inventive et nous enmenes dans son monde sans detour...."}, {"review_sentiment": 5.0, "review_text": "This slim novel is as concise as it is cynical. Indeed, you're likely to sigh as you read the goings on of a man who lives his life entirely by instinct, without a trace of introspection or self doubt. I will forgo a synopsis of events, as others have distilled the narrative well enough on this site. I'll just add that I think the author has done a splendid job conveying a type of personality--the beguiling charmer who uses cunning and avarice to get what he wants. But the story isn't just about Georges Duroy's bottomless narcissism. The story is also an expose of the shallowness underscored with dread that was the Parisian Belle Epoque. A truly brilliant novel."}, {"review_sentiment": 5.0, "review_text": "Bought it for my sister and her book club. Heard it's a fun, entertaining read. I haven't read it but look forward to reading. My other sister read one of the six,  bought initially while she was on vacation. She liked it."}, {"review_sentiment": 5.0, "review_text": "It came exactly as described from the seller, and was at such a great price!!! I love this version, as it has all these extras to really help you understand the novel, especially for those who aren't native French speakers. Such a wonderful novel in a wonderful presentation at an unbeatable price!"}, {"review_sentiment": 5.0, "review_text": "good book"}, {"review_sentiment": 4.0, "review_text": "An okay book, although I found it boring after reading it once I was into it."}, {"review_sentiment": 4.0, "review_text": "A must read to understand selfishness and egocentrism as the core of psychopathological behaviour. Written more than a 100 years ago, it amazingly depicts today's individualistic culture."}, {"review_sentiment": 5.0, "review_text": "Most excellent"}, {"review_sentiment": 4.0, "review_text": "Maupassant is a master at creating atmosphere and characters who are compelling.  A great expose of the greed and cynicism of French society in the 1880's."}, {"review_sentiment": 4.0, "review_text": "Because, I think the writer should have made George go through more difficulties before the end, otherwise 5. I enjoyed it!"}]}, "authors": ["Guy de Maupassant"], "isbn": "0140443150", "longitude": 2.3514992, "periods": ["1800s"], "title": "Bel-Ami", "word_cloud": "un classique lira oi reline rm guy posse rune plume beatrice et inventive et nous enmeshes sand son mode sans detour slim concise cynical indeed likely sigh going man live life entirely instinct trace introspection self doubt forgo synopsis event others distil narrative well site add think do splendid job convey type personality beguile charmer us cunning avarice get want story bottomless narcissism story also expose shallowness underscored dread truly brilliant sister club fun entertain look forward read sister buy initially vacation like come exactly describe seller great price love version extra really help especially native french speaker such wonderful wonderful presentation unbeatable price good okay find bore reading selfishness ego centrism core psycho pathological behavior year ago amazingly depict today individualistic culture most excellent maupassant master create atmosphere character compel great expose greed cynicism french society think writer make difficulty end otherwise enjoy", "genres": ["Fiction & Literature"], "summary": "Young, attractive and very ambitious, George Duroy, known to his friends as Bel-Ami, is offered a job as a journalist on La Vie francaise and soon makes a great success of his new career. But he also comes face to face with the realities of the corrupt society in which he lives - the sleazy colleagues, the manipulative mistresses and wily financiers - and swiftly learns to become an arch-seducer, blackmailer and social climber in a world where love is only a means to an end. Written when Maupassant was at the height of his powers, Bel-Ami is a novel of great frankness and cynicism, but it is also infused with the sheer joy of life - depicting the scenes and characters of Paris in the belle epoque with wit, sensitivity and humanity.", "asin": "0140443150", "rank": "307352", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41cGzRKOZSL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}