{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 105, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "This is a great work by Shakespeare. However, this specific edition of the play is poorly done. The lines aren't numbered, which is problematic for me as a student who needs to quote specific lines. Otherwise, the font is easy to read and the bold titles of acts and scenes helps differentiate the pages."}, {"review_sentiment": 5.0, "review_text": "So relavent today."}, {"review_sentiment": 5.0, "review_text": "Awsome"}, {"review_sentiment": 5.0, "review_text": "Fast delivery, exactly the book I was looking for"}, {"review_sentiment": 5.0, "review_text": "Coriolanus is not one of the plays by William Shakespeare that everyone reads in high school, but perhaps it should be. Though written sometime between 1605 and 1608, this play is still quite relevant to the world we live in today. Set in ancient Rome, it deals with the double-edged sword of public opinion in the never-ending struggle between the ruling elite and the common man.When the play opens, the citizens of Rome are rioting, claiming that a powerful general, Caius Marcius, is withholding grain from them. When Marcius meets them in the street, he responds to their complaints with open contempt, asserting that the common people, whom he sees as whining babes incapable of governing themselves, have no claim to the grain nor any right to question its distribution. As a military commander, war hero, and member of the patrician class, Marcius sees himself justified in adopting a tyrannical attitude towards the plebeians. When the Volscian army threatens Rome, Marcius leads an attack on the enemy’s city of Corioli. After achieving almost superhuman feats of military prowess, he returns to Rome with even more honor, distinction, and power, along with the honorary appellation of Coriolanus. Along with his military success comes increased popularity, though Marcius scorns the praise and recognition bestowed upon him, as if no one is worthy to judge him but himself. Despite his reluctance, he is put forward as a candidate for Consul, but two populist Tribunes, Brutus and Sicinius, scheme to make him pay for his arrogance by turning the tide of public opinion against him.Since this is one of Shakespeare’s tragedies, it’s not difficult to foresee that Marcius’s pride may be his downfall. Rather than merely spelling out good guys and bad guys in black and white terms, however, Shakespeare explores the dilemma of political power and public opinion. To what extent should competent rulers be expected to sacrifice their governing authority in order to pacify the whims of the masses? In broader terms, where does one find the ideal balance between monarchy (or meritocracy) and democracy?Coriolanus is frequently ranked by critics among Shakespeare’s better plays (i.e. in the top half). If it’s so great, why isn’t it more widely read? Maybe because it’s a little too close to Julius Caesar—an arrogant tyrant ousted by his envious rivals—without actually being Julius Caesar. Though Coriolanus was a real Roman general of the 5th century BC, he doesn’t have the name recognition of Caesar or any of the English kings whose names title Shakespeare’s history plays. Another reason may be that Caius Marcius Coriolanus is one of Shakespeare’s least sympathetic heroes. There is no denying the extreme arrogance of which he is accused. Marcius is a surly and taciturn character, not given to soliloquy. Thus, the audience doesn’t get inside his head in the same way that we are privy to the thoughts of Caesar or Hamlet. It’s hard to think of a character in the play that’s even likable. That only makes the play all the more authentic to what we see in today’s political climate, where unsullied heroes are few and far between.It was the 2011 film version starring Ralph Fiennes and Gerard Butler that drew my attention to Coriolanus. Set in the modern world of machine guns and TV news, the movie demonstrates very effectively how Shakespeare’s centuries-old work is still pertinent to the world in which we live. For anyone looking to explore Shakespeare’s lesser-known plays, Coriolanus is definitely a compelling read."}, {"review_sentiment": 5.0, "review_text": "See the Play. Shakespeare has to be heard on stage. The movie with Ralph Fiennes was pretty gory."}, {"review_sentiment": 5.0, "review_text": "shakespeare is always excellent"}, {"review_sentiment": 2.0, "review_text": "The book (Folger Shakespeare mass market paper) is small and thick and difficult to hold open. The annotations on the left side do not correspond well with the lines on the right and the reader is required to turn the page and back again to find the annotation or whether it exists, and then losing their place in the process. Furthermore, the typeface if very pale and difficult to read. Altogether, I advise the buyer to look elsewhere for a copy that is easier to read."}, {"review_sentiment": 5.0, "review_text": "​There aren't enough words to describe how much I enjoyed reading \"Coriolanus\".Caius Martius is a character that struggles with the image of himself and what others what him to be. I see a strong, hotheaded, blunt soldier that falls victim of a conspiracy lead by a government that is afraid of his power, strength of character and popularity. Coriolanus is arrogant proto-fascist that fails to become a politician, as his mother and the Roman government want him to be. Consequently, he walks right into a trap in which he falls victim. At the same time that he is a brute, he's also modest and honest with his comrades and himself until the very end. Furthermore, he had the courage to choose that was best for his family despite his thirst for revenge and knowing that his life was on the line.In the end, his mistake is to remain himself no matter how much the people around him try to make him something he is not. Death seemsThis play is definitely on my top favourite of Shakespeare's works!"}, {"review_sentiment": 3.0, "review_text": "He won't practice flattery and yes the nobles use the position to their advantage. He is Hilary Clinton without the bulls***. He despises the ppl and freely admits it. One has to choose a side and stick with it, in between gets both sides to dislike you. Institutions demand conformity and seemingly earnest commitment. You gotta play the game."}]}, "authors": ["William Shakespeare"], "isbn": "0140714731", "longitude": 12.4829321, "periods": ["0-500s"], "title": "Coriolanus", "word_cloud": "great work however specific edition play poorly do line number problematic student need quote specific line otherwise font easy bold title act scene help page so relevant today awesome fast delivery exactly look play everyone read high school perhaps write sometime still quite relevant world live today ancient deal sword public opinion struggle rule elite common play open citizens riot claim powerful general withhold grain meet street responds complaint open contempt assert common people see whine babe incapable govern claim grain right question distribution military commander war hero member patrician class see justified adopt tyrannical attitude towards plebeian volscian army threaten lead enemy city achieve almost superhuman feat military prowess return even honor distinction power honorary appellation military success come increased popularity scorn praise recognition bestow worthy judge reluctance put forward candidate populist tribune scheme make pay arrogance turn tide public opinion tragedies difficult foresee pride merely spell good guy bad guy black white term however explore political power public opinion competent ruler expect sacrifice govern authority order pacify whims mass broader term find ideal balance monarchy meritocracy democracy frequently rank critic better play top half great widely maybe little close arrogant tyrant oust envious actually real general century name recognition king name title history play reason least sympathetic hero deny extreme arrogance accuse surly taciturn character give soliloquy audience get head way privy thought hard think character play even likable make authentic see today political climate unsullied hero far film version star draw attention modern world machine gun tv news movie demonstrate effectively work still pertinent world live anyone look explore play definitely compel hear movie pretty gory shakespeare always excellent mass market paper small thick difficult hold annotation leave side correspond well line right require turn page back annotation exists lose place process typeface pale difficult advise buyer look elsewhere copy easier enough word describe much enjoy read character struggle image others see strong hotheaded blunt soldier fall victim conspiracy lead government afraid power strength character popularity arrogant fail become politician mother roman government want walk right trap fall victim time brute also modest honest comrade end furthermore courage choose best family thirst revenge know life end mistake remain matter much people try make something seems this play definitely top favorite work practice flattery yes noble use position advantage despise freely admit choose side stick get side demand conformity seemingly earnest commitment get ta play game", "genres": ["Ancient Rome", "Drama"], "summary": "Set in the earliest days of the Roman Republic, Coriolanus begins with the common people, or plebeians, in armed revolt against the patricians. The people win the right to be represented by tribunes. Meanwhile, there are foreign enemies near the gates of Rome.\r\n\r\nThe play explores one reason that Rome prevailed over such vulnerabilities: its reverence for family bonds. Coriolanus so esteems his mother, Volumnia, that he risks his life to win her approval. Even the value of family, however, is subordinate to loyalty to the Roman state. When the two obligations align, the combination is irresistible.\r\n\r\nCoriolanus is so devoted to his family and to Rome that he finds the decision to grant the plebians representation intolerable. To him, it elevates plebeians to a status equal with his family and class, to Rome’s great disadvantage. He risks his political career to have the tribunate abolished—and is banished from Rome. Coriolanus then displays an apparently insatiable vengefulness against the state he idolized, opening a tragic divide within himself, pitting him against his mother and family, and threatening Rome’s very existence.", "asin": "0140714731", "rank": "457683", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51Asz-7emNL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}