{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 33.3024309, "ratings": {"num_ratings": 309, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "I bought this for my daughter for a school project and she enjoyed the book which means a) she either lied or b) is kind of a nerd, or c) both. The good news is we still have the book at home."}, {"review_sentiment": 5.0, "review_text": "Great buy."}, {"review_sentiment": 5.0, "review_text": "This is a very good translation of a very ancient story that is remarkably similar to the biblical Noah story, but with significant differences.The Babylonian epic Gilgamesh was written on twelve tablets around 2000 B.C.E. and has survived in several versions. It predates the scriptural story. A tradition dates the revelation of the Bible to 2448 after creation, or about 1312 B.C.E. Scholars offer a date of around 1200 B.C.E. The Gilgamesh epic was discovered in 1839 among the ruins of a buried library in the excavated ancient city Nineveh. Amazingly, the author’s name is written in one of the tablets, Shin-eqi-unninni. He is the oldest known human author.The story of Gilgamesh The author Shin-eqi-unninni reports the adventures of the warrior king Gilgamesh of Urik, Babylon. We know that a man called Gilgamesh actually lived around 2700 B.C.E. He is said to have been the fifth king of Uruk after the founding of the city. He is described in the myth as being partly a god from his mother’s side and partly human from his father. He is a human with “all knowledge.” He is considered to be the greatest king on earth and superhuman, but he is a vicious king. He forces his subjects to build a wall around his capital city. He also insists that he can enjoy sexual intercourse with all brides on their wedding nights.The pagan gods are concerned that Gilgamesh is so powerful that they need to control his behavior, so they send him a friend Enkidu to moderate his desires and control his actions. Like Joseph in Genesis 37, Gilgamesh has two dreams that foretell the arrival of Enkidu.Enkidu is like a wild brutish animal when he is created, but he soon looses his strength and wild behavior when he has sexual intercourse with a woman. The newly moral Enkidu hears how Gilgamesh is having sexual intercourse with all brides, thinks it is disgusting and challenges Gilgamesh to a fight. Gilgamesh wins the battle, but the two, as in many modern adventure stories, become close friends.Although Enkidu was sent to Gilgamesh to curb his ferocious nature, Gilgamesh persuades Enkidu to accompany him in a battle against a demon. The two assault the demon by surprising him after a journey of seven days. The demon usually wears seven layers of armor, but he is only clothed with one layer when the pair sneak in to kill him, and Gilgamesh is able to kill him.The goddess Ishtar sees Gilgamesh success and offers to become his lover. Gilgamesh, who sleeps with all newlywed women, rebuffs her because she had many human lovers before him. Ishtar is outraged and vows vengeance. The other gods join with her and decide to punish Gilgamesh by killing his friend Enkidu.Enkidu suffers for twelve days and dies. Gilgamesh falls apart. He stops bathing and caring for himself. He becomes obsessed with the fear of his own death. He decides that his best solution is to seek help from his ancestor Utnapishtim, who had also been a king, who was the survivor of the world-wide flood and who was granted eternal life by the gods. Gilgamesh travels twelve leagues until he enters a brilliant garden of gems, where every tree bears precious stones.Utnapishtim’s account of the flood It is only in the eleventh of the twelve tablets that Utnapishtim tells Gilgamesh about the flood. (The twelfth tablet narrates Gilgamesh’s rule of the “nether world” after his death.)Utnapishtim tells his descendant that the gods created humans but soon felt they had made a mistake. Humans become so numerous that the gods are unable to stand the noise. They meet in counsel and decide to rid the world of the clattering humans by washing them away with a flood. The chief god insists that the other gods swear that they will not reveal the holocaust to humans. Ea, one of the gods who was previously involved in creating the humans, warns Utnapishtim, a king, by not talking to him directly, as required by his oath, but by talking to Utnapishtim’s wall while Utnapishtim was in the room. He advises him to build a great square boat and bring all living things into it. Utnapishtim loads the boat with gold and silver, his wife, and all animals.The flood lasts for seven days and seven nights until the boat comes to rest on a mountain top, where it remains for another seven days. Utnapishtim releases a dove to discover whether the water waned, but the dove returns, indicating that the land is still flooded. He then sends a swallow with the same result. Finally, he dispatches a raven, which does not return. Thus, the raven shows that the water receded.As soon as Utnapishtim exits the boat, he offers a sheep as a sacrifice to the gods and a libation (meat and wine). The gods like the sacrifices so much that they feel sorry that they killed the humans. As an act of contrition, they give Utnapishtim and his wife a gift of immortal life.Utnapishtim’s advise to Gilgamesh about immortal lifeUtnapishtim tells his descendant that he could achieve eternal life if he would stay awake for seven nights. Gilgamesh tries to do it but falls asleep on the first night. Utnapishtim’s wife feels sorry for him and persuades her husband to tell him about a plant that, while not giving eternal life, can make a person who eats it young again. Gilgamesh obtains the plant but, when he leaves it unguarded, a serpent eats it. This is why snakes shed their skin and become young again.Similarities1. Gilgamesh is described as being partly divine and Scripture portrays humans as having the tzelem Elohim, the “image of God.”2. Both stories picture humans as knowledgeable beings.3. The number seven occurs frequently in the Gilgamesh story and in the Bible (seven days is the Sabbath, seven weeks is Shavuot, seven months is Rosh Hashanah, etc.)4. The number twelve occurs frequently in both the myth and the Bible where many biblical figures have twelve sons.5. A splendid garden appears in both stories. The gardens contain something that could grant eternal life.6. In both tales, the protagonists are unable to obtain eternal life.7. Both heroes are saved from the flood in a boat/ark.8. Both the ark and the boat finally came to rest on a mountain top.9. Both tales relate that the boat occupant sends out birds on three occasions to discover whether the land is still flooded.10.  Noah and Utnapishtim offer a sacrifice when they descend from their ark/boat, although Noah “took from every clean cattle and every clean fowl and offered burnt offerings on the altar (that he built),” while Utnapishtim offers a sheep and a libation.Differences between the two tales1. As in most pagan myths, the gods behave in unethical ways and leave humans no real freedom to act: the humans are subject to the will and whims of the gods. In the Bible, people are given the power to make decisions and are encouraged to use that power properly.2. Gilgamesh is the leader of his people and a warrior. Noah was neither.3. While Gilgamesh is so barbaric that he needs to be controlled by the gods, the Bible states that Noah is righteous.4. Gilgamesh is continually fighting even after the arrival of Enkidu, who was created to moderate his behavior. This reflects the Babylonian martial thinking. Noah, in contrast, is appalled when he is mistreated by his son after the flood.5. One of Gilgamesh’s battles is against a demon. There is no mention of demons in the Bible.6. Gilgamesh falls apart when Enkidu dies and stops caring for himself. When Aaron’s sons die, he is silent.7. The philosophy of life recounted in the myth is the pursuit of pleasure, while proper ethical conduct is the way of life in the Bible.8. When the gods decide to punish Gilgamesh, they do so by killing his innocent friend Enkidu. This concept of punishing a person for another’s misdeed is alien to Judaism.9. Gilgamesh is fearful of dying, but Noah expresses no fear.10. The principle theme of the Gilgamesh epic is the hero’s attempt to find eternal life. Proper behavior is the core of the biblical story of the flood.11. Both the Bible and the Babylonian tale tell about a plant/tree that gives life and a serpent that interferes with the future life of humanity, but the biblical account is not connected with the flood but with the account of the Garden of Eden.12. The trees in the Gilgamesh garden bear precious gems, while the biblical trees yield food.13. The principle theme of the garden in Gilgamesh is eternal life. While the Garden of Eden contains a tree of life, it plays no central role in its plot.14. Adam and Eve are stopped by God from eating of the tree of life. They are expelled from the Garden before they can eat from it. Gilgamesh is given the opportunity to have eternal life but is unable to perform the act that would bring him success.15. In the Bible, God decides to destroy people and He saves Noah and his family. In Gilgamesh, the gods decide to destroy people and a single god goes against the decree and saves humanity.16. In Scripture, Noah and his family are saved because they act justly. In the myth, the gods decide to wipe out humanity because of the noise they produce. The first focuses on proper behavior; the second on the gods’ pleasure.17. Noah does not try to save gold and silver on his ark.18. Noah’s ark is not square.19. Noah takes his entire family with him, while Utnapishtim only brings his wife.20. The flood in Gilgamesh lasted seven days and seven nights. Noah’s flood lasts forty days and forty nights.21. Noah sends a raven first, then a dove twice. The dove later became a symbol of peace. Utnapishtim releases a dove, which found no place to land, then a swallow with the same result, then a raven which did not return showing that it had a place to land and food to eat. The raven is a symbol of violence.22. Noah does not offer wine as a sacrifice, but drinks it himself.Summary There are many similarities between the Gilgamesh myth and the Bible. The stories of the flood in both accounts are very close. This leads one to think that the idea of a flood and many of its details were well-known in ancient times. When one realizes that the Gilgamesh account is only one of many non-biblical reports of the flood and they all have similar details, this conclusion is fortified. The account of the flood is only in one of the twelve tablets of Gilgamesh that contain this story. There are many other similarities in the other tablets to other details in other parts of the Bible. Yet there are many differences. These differences are the result of the different world view of the Gilgamesh author and the Bible. The two have a totally dissimilar idea of how God/gods function, how the divine feels about people and deals with them. The two also have a different view of humanity, how people should behave and how they should relate to the divine."}, {"review_sentiment": 5.0, "review_text": "A spellbinding journey backwards in time, from the standard Babylonian version of the epic to the much older Sumerian poems from which it slowly evolved. Professor Andrew George’s rendering into English of these ancient texts displays all the virtues of an original poetical work, while maintaining throughout an unaltered sense of antiquity and authenticity. Moreover, the author’s scholarly meticulousness provides us with a fascinating glimpse into the tools and methods of assyriology, a field of study otherwise virtually inaccessible to the lay reader."}, {"review_sentiment": 5.0, "review_text": "Beautiful edition cover art."}, {"review_sentiment": 5.0, "review_text": "An amazing epic entailing the life of Gilgamesh, a king by birthright who is two-thirds divine, as he encounters his only equal. Together with the wild man, Enkidu, Gilgamesh wrestles with the bull of heaven and takes on the guardian of a divine forest. This tale depicts an all-but-immortal man as he fights against the control of his gods and struggles with the inevitability of his eventual demise.This edition of the Epic of Gilgamesh contains multiple translations of the story, each based upon the various tablets that have been uncovered. The author gives their input on the story as you read, as well as any relevant background information, to aid you in understanding each tablet.This book was fantastic and I highly recommend it to history nerds, epic fans, and anyone who appreciates a good story."}, {"review_sentiment": 3.0, "review_text": "Needed it for a college class. Make sure you buy the right copy of this book because there are different translations and formats. This particular version could be better because the print is pretty small and close together on the page where other versions have more pages with bigger font."}, {"review_sentiment": 5.0, "review_text": "Really like this story, should have read it a long time ago"}, {"review_sentiment": 5.0, "review_text": "Amazing book that has shaped our modern world largely. Highly recommended"}, {"review_sentiment": 4.0, "review_text": "Gilgamesh+Enkidu=OTPIconic powercouple of the times of old.Introduction had me rereading PLENTY, my eyes glazed over because there was a glaring absence of the oxford comma. Takes genuine effort to read through that part, despite the interesting pieces of knowledge."}]}, "authors": ["Anonymous"], "isbn": "014044100X", "longitude": 44.3787992, "periods": ["Pre Common Era"], "title": "The Epic of Gilgamesh", "word_cloud": "buy daughter school project enjoy mean lie b kind nerd c good news still home buy good translation ancient story remarkably similar biblical story significant babylonian write twelve tablet survive several version predate scriptural story tradition date revelation creation offer date discover ruin bury library excavated ancient city author name write tablet oldest know human story author report adventure warrior king know man call actually live say fifth king found city describe myth partly god mother side partly human father human consider greatest king earth superhuman vicious king force subject build wall capital city also insist enjoy sexual intercourse bride wed pagan god concern powerful need control behavior send friend moderate desire control action dream foretell wild brutish animal create soon loos strength wild behavior sexual intercourse woman newly moral hear sexual intercourse bride think disgust challenge fight win battle many modern adventure stories become close send curb ferocious nature persuade accompany battle demon assault demon surprising journey day demon usually wear layer armor clothe layer pair sneak able kill goddess see success offer become lover sleep newlywed woman many human lover outrage vow god join decide punish kill friend suffers twelve day dy fall apart stop bath care become obsessed fear death decide best solution seek help ancestor also king survivor flood grant eternal life god travel twelve league enters brilliant garden gem tree bear precious account flood eleventh twelve tablet tell flood twelfth tablet narrates rule nether world death tell descendant god create human soon felt make mistake humans become numerous god unable stand noise meet counsel rid world clatter human wash away flood chief god insist god swear reveal holocaust human ea god previously involve create human warns king talk directly require oath talk wall room advise build great square boat bring living thing load boat gold silver wife flood last day night boat come rest mountain top remain day release discover water wan return indicate land still flood send swallow result dispatch raven return raven show water soon exit boat offer sheep sacrifice god libation meat wine god sacrifice much feel sorry kill human act contrition wife gift immortal advise immortal lifeutnapishtim tell descendant eternal life night try fall asleep first night wife feel sorry persuades husband tell plant give eternal life make person eats young obtain plant leaf unguarded serpent eats snake shed skin become young describe partly divine portrays human tzelem image stories picture human knowledgeable number occur frequently story day week month number twelve occur frequently myth bible many biblical figure twelve splendid garden appear stories garden contain something eternal tale protagonist unable eternal hero save flood ark boat finally come rest mountain tale relate boat occupant send bird occasion land still offer sacrifice descend take clean cattle clean fowl offer burnt offering altar build offer sheep pagan myth god behave unethical way leave human real freedom act human subject whim god bible people give power make decision encourage use power leader people warrior barbaric need control god bible state continually fight even arrival create moderate behavior reflect babylonian martial thinking contrast appal mistreat son battle mention demon fall apart die stop care son die philosophy life recount myth pursuit pleasure proper ethical conduct way life god decide punish kill innocent friend concept punish person misdeed alien fearful die express principle theme hero attempt find eternal life behavior core biblical story tale tell give life serpent interfere future life humanity biblical account connect flood account tree garden bear precious gem biblical tree yield principle theme garden eternal life contain tree life play central role stop eat tree life expel eat give opportunity eternal life unable perform act decide destroy people save family god destroy people single god go decree save family save act justly myth god decide wipe humanity noise produce first focus proper behavior second god try save gold silver ark take entire family bring flood last day night flood last forty day forty sends raven first twice dove later become symbol peace release find place land swallow result raven show place land food raven symbol offer wine sacrifice drink many similarity myth story flood account close lead think idea flood many detail ancient time realize account many report flood similar detail conclusion fortify account flood twelve tablet contain story many similarity tablet detail part yet many difference difference result different world view author totally dissimilar idea function divine feel people deal also different view humanity people behave relate divine spellbind journey backwards time standard version much older sumerian poem slowly evolve render english ancient text display virtues original poetical work maintain unaltered sense antiquity authenticity moreover author scholarly meticulousness provide fascinate glimpse tool method assyriology field study otherwise virtually inaccessible lay beautiful edition cover art amazing entail life king birthright divine encounter equal together wild man wrestle heaven take guardian divine forest tale depict man fight control god struggle inevitability eventual edition contain multiple translation story base various tablet uncover author give input story well relevant background information aid understanding fantastic highly recommend history nerd fan anyone appreciate good story need college class sure right copy different translation format particular version print pretty small close together page version page bigger font really like story long time shape modern world largely recommend power couple time reread eye glaze glare absence oxford comma genuine effort part interesting piece knowledge", "genres": ["Poetry", "Ancient Civilizations"], "summary": "N. K. Sandars's landmark translation of one of the first and greatest works of Western literature\r\n\r\nGilgamesh, King of Uruk, and his companion Enkidu are the only heroes to have survived from the ancient literature of Babylon, immortalized in this epic poem that dates back to the third millennium BC. \r\n\r\nTogether they journey to the Spring of Youth, defeat the Bull of Heaven and slay the monster Humbaba. When Enkidu dies, Gilgamesh’s grief and fear of death are such that they lead him to undertake a quest for eternal life. A timeless tale of morality, tragedy and pure adventure, The Epic of Gilgamesh is a landmark literary exploration of man’s search for immortality.\r\n\r\nN. K. Sandars’s lucid, accessible translation is prefaced by a detailed introduction that examines the narrative and historical context of the work. In addition, there is a glossary of names and a map of the Ancient Orient.", "asin": "014044100X", "rank": "26273", "city": "Baghdad", "image": "https://images-na.ssl-images-amazon.com/images/I/517qYD8hAwL.jpg", "country": "Iraq", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}