{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 158, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "It was very good"}, {"review_sentiment": 3.0, "review_text": "A good job done to the unfinished work."}, {"review_sentiment": 4.0, "review_text": "Good Dickens but he never finished story..."}, {"review_sentiment": 5.0, "review_text": "What can  you say about greatness"}, {"review_sentiment": 5.0, "review_text": "Classic Dickens."}, {"review_sentiment": 5.0, "review_text": "Enjoyed it very much....."}, {"review_sentiment": 5.0, "review_text": "Loves it..."}, {"review_sentiment": 5.0, "review_text": "Great book, what else could one expect from Dickens, and the book layout and feel was good too."}, {"review_sentiment": 4.0, "review_text": "The only downside: it's rather a tantalizing read, since Dickens died before he could finish it."}, {"review_sentiment": 5.0, "review_text": "My mother liked it"}]}, "authors": ["Charles Dickens"], "isbn": "0140439269", "longitude": -0.12574, "periods": ["1800s"], "title": "The Mystery of Edwin Drood", "word_cloud": "good good job do unfinished work good never finish story say greatness classic dickens enjoyed much love else dickens feel good downside rather tantalize die mother like", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Charles Dickens's final, unfinished novel, and one that has puzzled readers and inspired writers since its publication\r\n\r\nEdwin Drood is contracted to marry orphan Rosa Bud when he comes of age, but when they find that duty has gradually replaced affection, they agree to break off the engagement. Shortly afterwards, in the middle of a storm on Christmas Eve, Edwin disappears, leaving nothing behind but some personal belongings and the suspicion that his jealous uncle John Jasper, madly in love with Rosa, is the killer. \r\n\r\nAnd beyond this presumed crime there are further intrigues: the dark opium dens of the sleepy cathedral town of Cloisterham, and the sinister double life of Choirmaster Jasper, whose drug-fuelled fantasy life belies his respectable appearance. \r\n\r\nDickens died before completing The Mystery of Edwin Drood, leaving its tantalising mystery unsolved and encouraging successive generations of readers to turn detective. ", "asin": "0140439269", "rank": "103060", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51jPT1E7lLL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}