{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 49, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "It's no spoiler to say that there's no plot in this rambling but sharp snapshot of mid-1800's Paris. There characters feel like they stepped right out of early 21th century Los Angeles or Brooklyn. Caught in a scene that celebrates itself, everyone in this book is a raging opportunist, willing to sell out all their friends and principles to get ahead, but nobody is really very good at it. Sure, Frederic and Rosanette would like to be in Dangerous Liasons, juggling lovers and champagne - but they're just not smart enough! And that's precisely what makes it so funny. To wonderful comic effect (or tragic, depending on your point of view), Flaubert illustrates that people don't change, no matter the time or the place. Throughout, the writing is evocative and almost dreamlike, though its subjects...not so much. They're just messes."}, {"review_sentiment": 4.0, "review_text": "Enjoyed madame bovary more"}, {"review_sentiment": 3.0, "review_text": "A multi-character novel that covers many years a la Edna Ferber. I found it boring and stuffed with incidents that I now call Hollywoody hokum, of chance-coincidence and manipulated characters. No one captured my imagination, least of all the protagonist."}, {"review_sentiment": 5.0, "review_text": "Remarkable novel. Historical background strangely placed at the end of this edition."}, {"review_sentiment": 5.0, "review_text": "Great read."}, {"review_sentiment": 5.0, "review_text": "Easily one of the best novels. Don't know what James objections were."}, {"review_sentiment": 4.0, "review_text": "The version on Kindle is alittle old fashioned intranslation."}, {"review_sentiment": 1.0, "review_text": "This is a review of the *English translation* that is listed here from 'digireads'. Don't buy this Kindle book! The translation is really poor. It regularly makes a mess of the French and makes no sense. The Adrianne Tooke translation is better."}, {"review_sentiment": 5.0, "review_text": "Flaubert - classic. love it."}, {"review_sentiment": 2.0, "review_text": "A mystery to me why this is book was rated so high by so many.  We read it as a book club choice and almost all of us found it dismally dull.  It was filled with characters who moved through life making choices that were disastrous and learning nothing from their mistakes.  We wondered this Sentimental Education wherein no one seemed to learn anything."}]}, "authors": ["Gustave Flaubert"], "isbn": "0140447970", "longitude": 2.3514992, "periods": ["1800s"], "title": "Sentimental Education", "word_cloud": "spoiler say plot ramble sharp snapshot character feel step right early century scene celebrate everyone rag opportunist willing sell friend principle get ahead nobody really good juggle lover champagne smart enough precisely make funny comic effect tragic depend point view illustrate people change matter time place write evocative almost subject much mess madame bovary cover many year la find bore stuffed incident call hokum manipulate character one capture imagination least protagonist remarkable background strangely place end edition great easily best novel do objection version little old fashion in translation review list translation really poor regularly make mess french make sense translation better classic love mystery rat high many club choice almost find dismally dull fill character move life making choice disastrous learn nothing mistake wonder wherein seem learn anything", "genres": ["Fiction & Literature"], "summary": "Based on Flaubert's own youthful passion for an older woman, Sentimental Education was described by its author as \"the moral history of the men of my generation.\" It follows the amorous adventures of Frederic Moreau, a law student who, returning home to Normandy from Paris, notices Mme Arnoux, a slender, dark woman several years older than himself. It is the beginning of an infatuation that will last a lifetime. He befriends her husband, an influential businessman, and as their paths cross and re-cross over the years, Mme Arnoux remains the constant, unattainable love of Moreau's life. Blending love story, historical authenticity, and satire, Sentimental Education is one of the great French novels of the nineteenth century.\r\n\r\n", "asin": "0140447970", "rank": "37256", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51k9EWgIyPL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}