{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 134, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Voice driven and full of fun, tragedy and exhuberance! Must read."}, {"review_sentiment": 5.0, "review_text": "Great book"}, {"review_sentiment": 2.0, "review_text": "Slow and hard to follow."}, {"review_sentiment": 5.0, "review_text": "Great book, fast paced read..."}, {"review_sentiment": 3.0, "review_text": "Can Doyle sound like a rambunctious ten year old, and write convincingly in that boy's voice? Yes. Can Doyle make that boy's stories any more interesting than the stories you could hear from your own real ten year old? Not particularly. And there's the rub. Roddy Doyle is rightfully a well regarded and well respected writer. This is a competent, sometimes even inspired, work. But, it could be a lot longer or a lot shorter, and it wouldn't matter that much; once you get the idea, well, you get the idea. And not to put too fine an edge on it, but Paddy Clarke isn't exactly from some alien exotic culture that needs to be revealed and examined. He's you and me at ten, jazzed up a bit thanks to poetic license.  That makes this book engaging enough, but not essential."}, {"review_sentiment": 4.0, "review_text": "Meet a couple in Las Vegas n thy recommend this book. ..love it..cracks me up"}, {"review_sentiment": 5.0, "review_text": "one of the best Irish humorists"}, {"review_sentiment": 1.0, "review_text": "Did not like at all. Depressing. Choppy."}, {"review_sentiment": 4.0, "review_text": "Few books successfully capture the experience of a child, fewer still manage to both capture the perspective of a child with a thorough comment on 'adult' issues. In Paddy Clarke Doyle comments on religion, politics, Ireland, family dynamics (and probably more stuff I didn't pick up on)The story is light-hearted in prose, but deep in content which creates a somewhat awkward but fulfilling story. A good length too, leaving one satiated without gagging for more (or bored throughout)"}, {"review_sentiment": 5.0, "review_text": "After reading this book, I am almost inclined to go back and change my review of David Mitchell's Black Swan Green, which owes a tremendous debt to Paddy Clarke Ha Ha Ha.Doyle's book is a marvel not because of a particularly ambitious plot but rather because he captures the fickle nature of pre-adolescence as experienced by the pre-adolescent. I don't say this to belittle the family drama the eponymous character lives through. However, the drama is especially compelling only because we get a truly believable stream of consciousness narrative that magnifies the banality of it all in much the same way it would be magnified in any child's mind.Stream of consciousness narratives can be difficult to follow at times. Even though this one, like many others, is chronologically non-linear, it is not willfully opaque. It moves authentically through Paddy's days with his friends and schoolmates, juxtaposing his peer relationships with his family ones.Doyle's book is a pleasure to read, and stylistically brilliant. There is every reason pick it up. And pair Black Swan Green with this one, not Catcher in the Rye."}]}, "authors": ["Roddy Doyle"], "isbn": "0140233903", "longitude": -6.2602732, "periods": ["1900s"], "title": "Paddy Clarke Ha Ha Ha", "word_cloud": "full fun tragedy exuberance great hard follow fast pace sound rambunctious year old write convincingly boy voice make boy story interest story real ten year old not particularly rightfully well regard well respect writer competent sometimes even inspired work lot longer lot shorter much get idea well idea fine edge exactly alien exotic culture need reveal examine jazzed bit thanks poetic license make engage enough essential couple n thy recommend best irish humorist few successfully capture experience child fewer still capture perspective child thorough comment issue comment religion politics family dynamic probably stuff pick story prose deep content create somewhat awkward fulfil story good length leave satiate gag bore read almost incline back change review owe tremendous debt marvel particularly ambitious plot rather capture fickle nature experience say belittle family drama eponymous character live however drama especially compelling truly believable stream consciousness narrative magnifies banality much way child consciousness narrative difficult follow time even many others chronologically willfully opaque move authentically day friends schoolmate juxtapose peer relationship family pleasure stylistically brilliant reason pick pair", "genres": ["Fiction & Literature"], "summary": "Paddy Clarke is ten years old. Paddy Clarke lights fires. Paddy Clarke's name is written in wet cement all over Barrytown, north Dublin. \r\n\r\nPaddy Clarke's heroes are Father Damien (and the lepers), Geronimo and George Best. Paddy Clarke has a brother called Francis, but Paddy calls him Sinbad and hates him because that's the rule. Paddy Clarke knows the exact moment to knock a dead scab from his knee. \r\n\r\nPaddy Clarke loves his Ma and Da, but it seems like they don't love each other, and Paddy's world is falling apart.", "asin": "B00A2KBII6", "rank": "8469117", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/41-Pv3qLAfL.jpg", "country": "Ireland", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}