{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 44, "rating": 4.6, "reviews": [{"review_sentiment": 3.0, "review_text": "This was a short little book with some brief periods of truly lovely writing. The story isn't much to write home about and you won't be on the edge of your seat wishing for more. Worth the read, but it will not make it on my personal list of books everyone should read before they die."}, {"review_sentiment": 5.0, "review_text": "Thank you sweetheart.  This isn't beat.  this is real. A moment in the life.  This an experience."}, {"review_sentiment": 5.0, "review_text": "Jack Keroauc is my all time favorite author. Tristessa is my most favorite of his work. It is so personal and really sheds light on exactly how the beat author felt about the women in his life."}, {"review_sentiment": 5.0, "review_text": "Jack at his surreal best...."}, {"review_sentiment": 5.0, "review_text": "Its a strange book, strangely written. I love it though. I feel like im in the authors head in real time."}, {"review_sentiment": 5.0, "review_text": "Really weird, 2-part book.  1st half is written in flow-of-consciousnesses, non-gramatically-correct, poetical Kerouacian (jacked on morphine).  The 2nd half is written in more-standard English.I really enjoyed the book.  It's a good trip."}, {"review_sentiment": 5.0, "review_text": "Kerouac is in full form in this \"bop prosody\" vision of the tragedy of love and the painful banality of loss. For such a short work (less than one hundred pages) he manages to spin an enthralling vision of a fleeting, passionate encounter in a world that has been poisoned. His characters, though only partially aware of it, oscillate between the two extremes of enlightened detachment and base addiction. For fans of Kerouac's more experimental moments, \"Tristessa\" will provide another satisfying feast."}, {"review_sentiment": 5.0, "review_text": "Great condition!! Thank you!! One of my fave JK books.."}, {"review_sentiment": 5.0, "review_text": "A short tale by Kerouac, but quite fulfilling. Whether it is read in a quiet study room, a library - or in a taxi, drunk, on a rainy saturday nite (Jack would be proud!) There are many passages here reflecting his deep love for humanity (and any la gata) as well as searching the pale blue Mexican scenery, streets and bars, knowing something grande should be nearby..."}, {"review_sentiment": 4.0, "review_text": "Tristessa is another in Jack Kerouac's autobiographical cavalcade that followed close on the heels of his breakout success with On the Road. The brief novel (frankly, at less than a hundred pages, it's not even a novelette but more like a longish short story) tells the story of Kerouac's brief platonic fling with a a drug-addled Mexican prostitute (it's platonic because at this point Kerouac was into the Zen stylings of Gary Snyder, as told in The Dharma Bums, and didn't want to corrupt his body with something as unpure as sex).The relationship is interesting as an exploration of doomed infatuation but I was most struck by Kerouac's descriptions of the setting, the Mexico City underworld of addicts, hookers, thieves and other assorted demimonde fauna. It's not a pretty picture. Kerouac's language here is somewhat difficult as he is deploying his impressionistic stylings, which are not always immediately decipherable, but the subject is compelling enough, and the narrative arc coherent enough that one can pretty much make it out. A short, vivid read."}]}, "authors": ["Jack Kerouac"], "isbn": "0140168117", "longitude": -99.1333416, "periods": ["1900s"], "title": "Tristessa", "word_cloud": "short little brief period truly lovely write story much write home seat wish make personal list everyone die sweetheart beat real moment life experience time favorite author favorite work personal really shed light exactly beat author felt woman life surreal best strange strangely write love feel mi author head real time really weird half write poetical jack half write really enjoy good trip full form bop prosody vision tragedy love painful banality loss short work hundred page manages spin enthral vision fleet passionate encounter world poison character partially aware oscillate extreme enlighten detachment base addiction fan experimental moment provide satisfying feast condition fave short tale quite fulfil quiet study room library taxi drunk rainy saturday tine many passage reflect deep love humanity la gate well search pale blue scenery street bar know something grand nearby autobiographical cavalcade follow close heel success brief frankly le hundred page even novelette longish short story tell story brief platonic fling prostitute platonic point styling tell want corrupt body something unsure sex relationship interesting exploration doom infatuation strike description set underworld addict hooker thief assort demimonde fauna pretty picture language somewhat difficult deploy impressionistic styling always immediately decipherable subject compel enough narrative arc coherent enough pretty much short vivid", "genres": ["Fiction & Literature"], "summary": "\"Each book by Jack Kerouac is unique, a telepathic diamond. With prose set in the middle of his mind, he reveals consciousness itself in all its syntatic elaboration, detailing the luminous emptiness of his own paranoiac confusion. Such rich natural writing is nonpareil in later half XX century, a synthesis of Proust, Céline, Thomas Wolfe, Hemingway, Genet, Thelonius Monk, Basho, Charlie Parker, and Kerouac's own athletic sacred insight.\r\n\r\n\"This entire short novel Tristessa's a narrative meditation studying a hen, a rooster, a dove, a cat, a chihuaha dog, family meat, and a ravishing, ravished junky lady, first in their crowded bedroom, then out to drunken streets, taco stands, & pads at dawn in Mexico City slums.\" \r\n\r\nAllen Ginsberg", "asin": "0140168117", "rank": "195286", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/31jnCcmoEPL.jpg", "country": "Mexico", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}