{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 31.199004, "ratings": {"num_ratings": 309, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Good buy, great read."}, {"review_sentiment": 5.0, "review_text": "One of my favorite novels of all time! I read this years ago but when I found it on kindle I decided to read it again. Durrell is an absolute master of the English language, and he will transport you through highly sensory, detailed descriptions and the development of the plot. He's highly intellectual and explores the human condition deeply through his complex characters, so if you like quick, easy, happy reads, this is probably not for you."}, {"review_sentiment": 5.0, "review_text": "This was my favorie book when it came out more than fifty years ago, and now, reading it again, I see it still is."}, {"review_sentiment": 5.0, "review_text": "It is difficult to capture the satisfaction of reading the Alexandria Quartet. I spaced reading of the four novels over two years, and always returned with joy and anticipation. One of the best things about the quartet is delving deeper into an overarching story with each of the first three novels. It's like peeling an onion. In addition, the vastly dissimilar points of view are great and displays the author's talent. Truthfully, the novels at times challenged my ability to assimilate the philosophy advanced by the characters, and this from someone who enjoys Umberto Eco and Saramaga. There are few books I will read again, but I can see myself returning, if not to all four, then to the fourth novel which serves as a good endpiece to the set. Although these novels were written at the end of the fifties, I kept feeling as if I were reading a slightly more modern D. H. Lawrence or one of the Lost Generation writers. Buy it. Read it."}, {"review_sentiment": 1.0, "review_text": "Wast of time. Did not finish"}, {"review_sentiment": 5.0, "review_text": "Gorgeous cover for a gorgeous book. If you love love or if you hate love, read this."}, {"review_sentiment": 5.0, "review_text": "Florid and time consuming read, but one feels as if in Alexandria."}, {"review_sentiment": 5.0, "review_text": "Great literature"}, {"review_sentiment": 4.0, "review_text": "This book is ambient; to me it reads like a haze. In that sense, the book presumably realizes its objective of evoking Alexandria. The first person narrative is both vague and precise, meandering in time and sentiment while etching certain scenes in marble. In that way the book really sticks with you. These striking scenes don't necessarily seem so at the time, but they don't fade. Meanwhile, a sense of languor hangs over it all.When the narrator first meets Justine, or the hunt near the end, or when Pursewarden ostensibly passes out drunk--these scenes are all written with a precision that contrasts with the overwrought navel gazing periodically indulged by the narrator.I liked the book quite a bit, surprisingly. I'm often put off by florid prose but for some reason it works here when it is employed. Perhaps it's the necessary ingredient creating that languorous sense of the place. I imagine some people will really dislike the book because of it, but I will move on to Balthazar with only a brief wait."}, {"review_sentiment": 5.0, "review_text": "I read the Quartet about 50 years ago it enthralled me then and it still has the same effect to day"}]}, "authors": ["Lawrence Durrell"], "isbn": "0140153209", "longitude": 29.894378, "periods": ["1900s"], "title": "Mountolive", "word_cloud": "good buy great favorite novel time year ago find decide absolute master language transport highly sensory detailed description development plot highly intellectual explores human condition deeply complex character quick easy happy read probably favorite come year reading see still difficult capture satisfaction read space read novel year always return joy anticipation best thing quartet delve deeper overarch story first novel peel onion addition vastly dissimilar point view great display author talent novel time challenge ability assimilate philosophy advance character someone enjoy see return fourth serf good end piece set novel write end fifty keep feel read slightly modern writer wast time gorgeous cover gorgeous love love hate love florid time consume feel great literature ambient read haze sense presumably realize objective evoke first person narrative vague meander time sentiment etch certain scene marble way really stick striking scene necessarily seem time fade meanwhile sense languor hang narrator first meet hunt end ostensibly pass drunk scene write precision contrast overwrought navel gaze periodically indulge like quite bit surprisingly often put florid prose reason work employ perhaps necessary ingredient create languorous sense place imagine people really move brief wait quartet year ago enthral still effect day", "genres": ["Fiction & Literature"], "summary": "Book 3/4 in the Alexandria Quartet Series\r\n\r\nThe intrigues of Justine and Balthazar multiply and deepen in the third volume of the Alexandria Quartet, giving us a novel of labyrinthine intricacy and mesmerizing beauty. \r\n\r\nIn the first two novels of this profoundly innovative masterpiece, Lawrence Durrell explored two sides of a romantic quadrangle involving several inhabitants of prewar Alexandria. Now that geometry is seen from a startling new angle—through the clinical eye of a British diplomat, for whom love is only another form of statecraft. Like its predecessors, Mountolive is a novel of vertiginous disclosures, in which the betrayer and the betrayed share secret alliances and an adulterous marriage turns out to be a vehicle for the explosive passions of the modern Middle East.\r\n\r\n“Durrell is almost without peer in conveying atmosphere and mood. Even if his Alexandria never existed on this earth, it is now as real as Hawthorne’s Rome, Proust’s Paris, Loti’s Constantinople. . . . Mountolive is dazzlingly cohesive, beautifully controlled from beginning to end.”—Saturday Review\r\n\r\n“A work of splendid craft and troubling veracity.”—The New York Times\r\n\r\n“Mountolive has vivid imagery and scenes of ghastly hilarity. . . . Readers will be sharply aware that they are encountering an acute intelligence pursuing a grand design.”—TIME", "asin": "0140153209", "rank": "432666", "city": "Alexandria", "image": "https://images-na.ssl-images-amazon.com/images/I/417jSZDE7UL.jpg", "country": "Egypt", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}