{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 59.9132694, "ratings": {"num_ratings": 49, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "good"}, {"review_sentiment": 5.0, "review_text": "A great read!"}, {"review_sentiment": 2.0, "review_text": "The book is fine, but underlined throughout. I don't worry as I just wanted a quick read of this book before going to Iceland to seek Toking history."}, {"review_sentiment": 3.0, "review_text": "Expecting something different"}, {"review_sentiment": 5.0, "review_text": "Arrived in good condition."}, {"review_sentiment": 4.0, "review_text": "Very good"}, {"review_sentiment": 5.0, "review_text": "Did a book report on this for my world history class. Even though I absolutely hate learning about history, I really enjoyed this book. I learned a lot of things that I didn't know."}, {"review_sentiment": 5.0, "review_text": "A wealth of information.  Highly recommended."}, {"review_sentiment": 5.0, "review_text": "this book is very readable and fits for all strangers about this people's past."}, {"review_sentiment": 5.0, "review_text": "This was my first book on Viking topic. I found it full of information. It gave me the detail I need at this stage. The references are excellent and have pointed me to other books to read to learn even more. Definitely a good choice as a starting book!"}]}, "authors": ["Else Roesdahl"], "isbn": "0140252827", "longitude": 10.7391112, "periods": ["500-1400s"], "title": "The Vikings", "word_cloud": "good great fine underline worry want quick go history expect something different good condition very good world history class even absolutely hate learn history really enjoy learn lot thing know wealth information recommend readable fit stranger people first topic find full information give detail need reference excellent point learn even definitely good choice start", "genres": ["History", "Ancient Civilizations"], "summary": "For almost 300 years, from the 8th to the 11th centuries, the Vikings played an important and often decisive role in shaping the history of large parts of Europe. Their long ships took them from Scandinavia to conquer England, exploit the Franklin Empire, rule Normandy, trade in Russia, colonize Iceland, discover Greenland and America and much else. \r\n\r\nAt the same time the three Scandinavian kingdoms of Denmark, Norway and Sweden started to take form. Towns were founded, far-flung trade routes were organized, art and poetry flourished and Christianity was introduced. This book covers the contributions of the many disciplines involved in modern Viking studies, giving a full survey of the Viking's achievements abroad. \r\n\r\nIt also investigates the background which made it all possible and presents a picture of a strong, self-contained and fast developing society and culture. It discusses the sources of our knowledge, and those of the popular Viking myth.", "asin": "0140252827", "rank": "287007", "city": "Oslo", "image": "https://images-na.ssl-images-amazon.com/images/I/51p%2Bfpa58VL.jpg", "country": "Norway", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}