{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 114, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Very well written."}, {"review_sentiment": 4.0, "review_text": "A bit drawout in some parts, but in general very interesting reading."}, {"review_sentiment": 5.0, "review_text": "I love this book. I follow the writings of this great american author. The adventures of the young protagonist takes us through many chapters of american history  until our times with stories full of adventure and tender moments . The main character , young Fogg and his way of life teaches us the conflicts of a boy with a very difficult life and how he pulls off to take control and mainly being true to himself.I recommend this reading."}, {"review_sentiment": 5.0, "review_text": "read this book 18 years ago and still think about it often . was my first of many by the author and perhaps my favorite . love the way he writes about average people who take unexpected decisions that develop into attention grabbing  consequences."}, {"review_sentiment": 5.0, "review_text": "I am only halfway through, but unless the main character/narrator ends up going on a killing spree I don't' see changing my opinion. I will write more when done, but I just wanted to put down some initial impressions. The narrator is someone with whom I feel kinship. His experiences and how he interacts with the world reminds me very much of a young, college-age SW Coyote."}, {"review_sentiment": 4.0, "review_text": "Marco Fogg’s young life is steeped in tragedy and loss.  His beginnings are fraught with misfortune and unlikely survival.  His destiny seems directed by circumstance and coincidence as three generations meld with the present.  Auster is a master storyteller, taking us on a spellbinding adventure as Marco pieces together his past so that he can ultimately see the possibility of a future."}, {"review_sentiment": 4.0, "review_text": "I really like Astor's voice and enjoyed this book."}, {"review_sentiment": 5.0, "review_text": "Paul Auster's seminal masterpiece."}, {"review_sentiment": 5.0, "review_text": "I find the author very intriguing and talented, I have read 3 books by the author and found each book so vastly different from another.  Although all seem to have the underlying mystery of drama and serendipity, with forever life changing results,( in this sense, very much like Ian McEwan), his stories read very modern and unconventional and (dare I say), \"hip\" feel to them.  This book has both sharp, intellectual humor and analysis as well as the beautiful imagery that translates smoothly into the deep emotional realm."}, {"review_sentiment": 2.0, "review_text": "Paul Auster's high literary reputation is a mystery to me. At best I have found his work so-so and at worst pretentious and badly written.This is an example of the former – a humdrum story in the form of narratives within narratives as the main character comes to face with his past and the mystery of who his father was. At the same time, it still has enough examples of bad prose and grotesque exaggeration to fit into the second category.Much of it, such as the accounts of the main character's life as a teenager, is unoriginal and echoes writers like William Styron and Philip Roth.Other parts are plain silly and unbelievable, e.g. he lives wild in Central Park eating leftover food from garbage cans and also manages to read over 1,000 books at random in a few months, a glamorous Chinese girl wearing a Navaho headband rescues him as he is on the verge of dying and then falls in love him, he wanders around New York at night distributing US$50 notes on behalf of a dying millionaire he is looking after, he goes to the desert to find a mysterious cave and then walks to the coast.It might be best if the reader were to regard this as an account of one man's fantasy rather than an attempt to tell a story.That's its only saving grace as far as I'm concerned."}]}, "authors": ["Paul Auster"], "isbn": "0140115854", "longitude": 0.0, "periods": ["1900s"], "title": "Moon Palace", "word_cloud": "very well write bit draw out part general interesting reading love follow writing great american author adventure young protagonist take many chapter american history time stories full adventure tender moments main character young way life teach conflict boy difficult life pull take control mainly true recommend reading year ago still think often first many author perhaps favorite way write average people take unexpected decision develop attention grabbing consequence halfway main end go kill spree see change opinion write do want put initial impression narrator someone feel experience interact world remind much young young life steep tragedy loss beginning fraught misfortune unlikely survival destiny seem direct circumstance coincidence generation meld present master storyteller take spellbind adventure piece together past ultimately see possibility future really voice enjoy seminal masterpiece find author intriguing talented author find vastly different seem underlying mystery drama serendipity forever life change result sense much story modern unconventional dare say hip feel sharp intellectual humor analysis well beautiful imagery translate smoothly deep emotional realm high literary reputation mystery best find work worst pretentious badly example former humdrum story form narrative narrative main character come face past mystery father time still enough example bad prose grotesque exaggeration fit second account main character life teenager unoriginal echo writer part plain silly unbelievable life wild eat leftover food garbage can also manage random month glamorous girl wear headband rescue verge die fall love wanders night distribute note die millionaire look go desert find mysterious cave walk regard account man fantasy rather attempt save grace far concern", "genres": ["Fiction & Literature"], "summary": "Marco Stanley Fogg is an orphan, a child of the sixties, a quester tirelessly seeking the key to his past, the answers to the ultimate riddle of his fate. As Marco journeys from the canyons of Manhattan to the deserts of Utah, he encounters a gallery of characters and a series of events as rich and surprising as any in modern fiction.\r\n\r\nBeginning during the summer that men first walked on the moon, and moving backward and forward in time to span three generations, Moon Palace is propelled by coincidence and memory, and illuminated by marvelous flights of lyricism and wit. Here is the most entertaining and moving novel yet from an author well known for his breathtaking imagination.\r\n\r\nFrom New York Times-bestselling author Paul Auster (The New York Trilogy).", "asin": "0140115854", "rank": "436121", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41f66ecqCuL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}