{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 11, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "Listed as Good. Pages dog eared, writing throughout the book."}, {"review_sentiment": 4.0, "review_text": "Very interesing travel journal of Flaubert's trip to Egypt in 1849. It's a thin book, but never dull. As one reviewer noted, there are as many revealing details about Flaubert's own life as there are about Egypt. But it's all fascinating, especially Flaubert's account of the boat trip on the Nile, and his frequent visits to bordellos around the country. The devotion to his mother, detailed in various letters, is also of interest. As an historic travel piece, this book is quite valuable, giving us glimpses of a famous writer in his younger years, and that of a country awash in history."}, {"review_sentiment": 5.0, "review_text": "This book has accounts from Flaubert's letters and travel notes during his adventure in Orient. He is a romantic poet and a weak traveler when it comes to difficulties in the voyage, but what calls the attention is his lack of amazement for the ancient monuments. Interestingly, in this book there are translations form Du Camp's accounts that tell how unconscious and lazy was Flaubert during this journey when admiring the ancient places. Du Camp is not a romantic writer and he is a scientific and very realistic man. He did photography and research during the entire journey along with Flaubert's rare oriental experiences. You have both perspectives in one book! But if you want to go deeper about the journey, you need to reed their books separately. The only problem I encountered is that Du Camp's books were not translated to English! and now I have to read them in French. On the other hand, Flaubert's books are translated not only in English but in Spanish too. To me this makes no justice to Du Camp's works."}, {"review_sentiment": 5.0, "review_text": "In 1849, at age 28, Gustave Flaubert (who had not yet distinguished himself in literature) embarked on a trip to the \"Orient\", as it was then called.  His traveling companion was Maxime Du Camp.  From November 1849 to July 1850 they were in Egypt.  From there they went on to Palestine, Syria, Turkey, Greece, and Italy.  This book is an account of the Egyptian portion of the trip.FLAUBERT IN EGYPT actually is a composite, assembled from several sources:  Flaubert's own travel notes, in their original version and as later re-written by Flaubert (but never published); letters Flaubert sent from Egypt to his beloved mother and to his good friend Louis Bouilhet; and the papers and several publications of Du Camp.  Francis Steegmuller has done a brilliant job of selecting, inter-weaving, and translating these various extracts, and then interpolating them with helpful and non-intrusive notes and commentary, so that the result is a very coherent and eminently readable travelogue.True to its title, the book reveals as much about Gustave Flaubert as it does about Egypt, and to me they are equally engrossing and fascinating.  Egypt of 1850 was an extraordinary and exotic place, and Gustave Flaubert was an extraordinary sojourner, highly receptive to the exotica of Egypt.  His writing, as translated and edited by Steegmuller, is more literary, readable, and entertaining than that of Sir Richard Francis Burton, who began his famous travels and accounts a few years later, in the 1850s.FLAUBERT IN EGYPT abounds with the odd, the colorful, the curious, and the grotesque.  One example: Flaubert and Du Camp spent five hours perched on a wall watching the ceremony of the Doseh, whereby a sheik (priest) rides his horse over the bodies of more than 200 men, lying on the ground and arranged and pressed together in a row like sardines.  According to legend, in so doing the sheik cannot hurt any of the men; if they die, \"it is due to their sins.\"  Another:  Sailing up the Nile, they passed a Coptic monastery, from which dozens of monks, totally naked, spilled into the river and swam towards their boat shouting \"Baksheesh, baksheesh\", while the crew of the boat tried to beat them off.  Elsewhere, Flaubert writes that baksheesh and the cudgel \"are the essence of the Arab.\"  The essence, or symbol, of Egypt turns out to be bird[poop]. Actually, Flaubert, as translated, uses a more vulgar term:  \"Bird[poop] is Nature's protest in Egypt; she decorates monuments with it instead of with lichen or moss.\"As the above suggests, the strait-laced and the politically-correct of today may find offense in some passages of FLAUBERT IN EGYPT.  There is much that is vulgar, and a few of Flaubert's observations would quickly be condemned by some as racist.  He also described, and participated in, rather exotic venery.  Of one night with an \"almeh\" (dancer/whore), during which he counted \"coup\" five times, he wrote:  \"How flattering it would be to one's pride if at the moment of leaving you were sure that you left a memory behind, that she would think of you more than of the others who have been there, that you would remain in her heart!\"  Be that as it may, Flaubert himself left Egypt with a venereal problem for which he received mercury treatments for the rest of his life.Steegmuller gently pushes the notion that the expedition and the travel notes Flaubert maintained during it marked an important transition in his writing and aesthetic perspective from romanticism to realism.  Along those lines, one of the excerpts from Du Camp's writings tells about Flaubert, on the summit of Gebel Abusir overlooking the Second Cataract of the Nile, suddenly crying out, \"I have found it! Eureka! Eureka! I will call her Emma Bovary!\""}, {"review_sentiment": 3.0, "review_text": "This book's value lies largely in the insight into the personality of Flaubert that it provides.  The commentary on ancient Egypt is virtually nil. Flaubert's commentary on the Egypt of 1849 is rather interesting, but limited here as well.  I was looking for more on ancient Egypt out of this book, but Flaubertistas may not be disappointed. There are a few photos and drawings of interest."}, {"review_sentiment": 4.0, "review_text": "Having enjoyed \"Salammbo,\" which is a technicolor sandals and swords Panavision epic a century before its time, I wondered about Flaubert's earlier travels in the fall of 1849 in the desert realm. He probably behaved no differently than any other twenty-seven-year-old aesthete from Europe among the natives, and this remains less an indictment of \"orientalism\" in our P.C.-sensitive era than a pair of journals by him and his companion Maxime du Camp, with commentary by the Flaubert expert Francis Steegmuller. Parts ramble on without a lot of interest, and other sections captivate you, but like any diary and the expanded journal entries made later by Flaubert, the work as a whole is more a miscellaneous notebook of impressions and observations, much as one might expect of this formidably articulate tourist.I think the relatively few sexual episodes get, if understandably for their candor, too much of the attention here compared to the bulk of this slender book, which is given over to the sights. There's amidst the itinerary and dutifully recorded letters to his mother many marvelous descriptions. Not all were addressed to his mother! You get the sense of the languid pace of a brothel, an early visitor's curious wanderings among the colossal statues of Luxor or Thebes, the sun rising over the graffitied Pyramids, his first sight of the Sphinx-- Steegmuller's notes remind us how magical this would have been before the ubiquitous photographs-- and the decaying splendors of Karnak.Here's a sample of the prose about this last attraction. \"The first impression of Karnak is of a land of giants. The stone grilles still existing in the windows give the scale of these formidable beings. As you walk among the forest of tall columns you ask yourself whether men weren't served up whole on skewers, like larks. In the first courtyard, after the two great pylons as you come from the Nile, there is a fallen column all of whose segments are in order, despite the crash, exactly as would a fallen pile of checkers. We return via the avenue of sphinxes: not one has his head-- all decapitated. White vultures with yellow bills are flying around a mound, around a carcass; to the right three have alighted and calmly watch us pass. An Arab trots swiftly on his dromedary.\" (169)Out of such awesome silence, Flaubert also gained inspiration for \"Madame Bovary,\" unlikely as it may seem. He also learned early about the fickleness of women, no matter where they might live, in his closing comments to Louise Colet about an \"almeh,\" a lady of the night who often entertained him, Kuchuk: \"You and I are thinking of her, but she is certainly not thinking of us. We are weaving an aesthetic around her, whereas this particular very interesting tourist who was vouchsafed the honours of her couch has vanished from her memory completely, like many others. Ah! Traveling makes one modest-- you see what a tiny place you occupy in the world.\" (220)These remarks remind us that Flaubert cannot be seen as a mere pawn of mid 19-c imperial strategems. He took advantage of his position, but he also realizes his complicity and the whole game that he by his privilege is able to indulge himself in as long as he pays the price. Another will always be found to accept his payment and render services accordingly, Those who denigrate Flaubert's typically frank account for its coolly documented exchanges might well contemplate how we today are enmeshed in a far greater contest, that began in such initial encounters, a century and a half before the vogue of globalization."}, {"review_sentiment": 5.0, "review_text": "\"Let me begin by giving you a great hug, holding my breath as long as possible, so that as I exhale onto this paper your spirit will be next to me.\"This is the book I read the most. I read it at random, sometimes rereading passages I read only days ago. It's not the exoticism that allures but the colonial/imperial mind at work comprehending and quantizing the East. Read Said's Orientalism to better understand the situation under which these journals and letters were written. Flaubert cuts through Egypt like a shark, almost in on his own joke. Initially he seems to take a typically orientalist posture scandalizing the sexuality of the savages. Upon further investigation one can see that his tone is ambivalent yet cooly giddy at the thought of westerners being perturbed at such behaviour. It's almost as if he knows that the West is the oddball out and everyone else is normal."}, {"review_sentiment": 2.0, "review_text": "I was required to read Flaubert's account of his travels in Egypt, when I was in my senior year of college.  We were doing an extensive study on the effects of the mentality of \"us\" versus \"them.\"  A prime example was in the travels, made by Europeans, to the East, as well as to other countries that became colonized parts of North and South America.  Though, many people consider this a classic novel (hence, it is one of Penguin Classics' \"classic\" pieces of literature).I found Flaubert's observations of Egypt to be pretentious, arrogant, chauvinistic and offensive.  His approach was one of several ignorant examples demonstrated amongst other Europeans, who went on to colonize countries, as part of a movement of rescue and possession.  As we read of his numerous sexual exploits with the local women, his responses (often of distaste) to the local customs, and his general air of boredom, he epitomizes the example of a bored, rather spoiled man-child, with nothing better to do but objectify and criticize the customs of a culture foreign to his own."}, {"review_sentiment": 5.0, "review_text": "Kerouac isn't qualified to hold Flaubert's pen.This is the real deal. From Christendom to the Orient Flaubert sails and records his thoughts, observations and indulengences in his usual excellent prose.A must read."}, {"review_sentiment": 5.0, "review_text": "In 1849 Gustave Flaubert was twenty eight.  He had an air of athletic vigor.  He was the son of a doctor.  He had always written.  At this point he had finished THE TEMPTATION OF SAINT ANTHONY.  Friends suggested he use a story known to him, perhaps through his father, that became the basis for MADAME BOUVARY.Maxime Du Camp accompanied Gustave to Egypt.  France had maintained a controlling political interest in Egypt.  Flaubert wrote that in Egypt everyone with clean clothes beats everyone with dirty clothes.  Europeans were called Franks.He wrote that the desert began at the gates of Alexandria.  It is suggested that the very act of keeping a travel diary moved Flaubert from being a Romantic to becoming a Realist.  There was a sunrise.  They saw from the top of pyramids the valley of the Nile being bathed in mist.The young men stared at the Sphinx.  They visited the Coptic Church in Old Cairo.  There were jugglers and acrobats and those very feared persons, snake charmers.  Maxime Du Camp busied himself with photography throughout the trip.  They saw dervishes.  Flaubert described the water of the Nile.  It was yellow and carried soil.They took a trip down the Nile.  They passed Luxor.  The mountains were dark indigo.  They arrived at Thebes.  They saw towns whose buildings were made of dried mud.  They saw and described dancing in their writings.  They traveled to Assuan.  Du Camp's photographic record of temples became famous.  Flaubert reported to his mother that there always seemed to be a temple buried up to its shoulders in sand.From Luxor to Karnak the great plain looked like an ocean.  One's first impression of Karnak was that it was a place of giants.  They went to the Red Sea at Koseir.  Flaubert found the boats terrifying and was pleased that he did not have to use one.  He thought that they carried the plague.Flaubert's impressions of Egypt returned to him when he wrote SALAMMBO according to Du Camp.  It seemed to Du Camp that Flaubert disdained the journey and looked at nothing.  On the contrary, Egypt gave Flaubert his first comprehensive view of colors.This is an elegant account of a writer's response to an alien culture.  The book consists of journal entries and letters of Flaubert, writings of Du Camp, notes of the editor, and pictures.  All in all it is a most interesting compilation."}]}, "authors": ["Gustave Flaubert"], "isbn": "0140435824", "longitude": 31.243666, "periods": ["1800s"], "title": "Flaubert in Egypt: A Sensibility on Tour", "word_cloud": "list good page dog eared writing very interest travel journal trip thin never dull reviewer note many reveal detail life fascinate especially account boat trip frequent visit bordellos country devotion mother detail various letter also interest historic travel piece quite valuable give glimpse famous writer younger year country awash history account letter travel note adventure romantic poet weak traveler come difficulty voyage call attention lack amazement ancient monument translation form account tell unconscious lazy journey admire ancient place romantic writer scientific realistic man photography research entire journey rare oriental experience perspectives want go deeper journey need reed separately problem encounter translate french hand translate english spanish make justice work age yet distinguish literature embark trip orient call travel companion go account egyptian portion actually composite assembled several source travel note original version later never publish letter send beloved mother good friend paper several publication do brilliant job select translate various extract interpolate helpful note commentary result coherent eminently readable title reveals much equally engross fascinate extraordinary exotic place extraordinary sojourner highly receptive exotica writing translate edited literary readable entertain begin famous travel account year later abound odd colorful curious grotesque example spend hour perch wall watching ceremony sheikh priest ride horse body men lie ground arrange press together row sardine accord legend sheikh hurt men die due sin sail pass coptic monastery dozen monk totally naked spill river swam towards boat shout baksheesh crew boat try beat write baksheesh cudgel essence essence symbol turn bird poop actually translated us vulgar term poop protest decorate monument instead lichen moss suggests today offense passage much vulgar observation quickly racist also describe participated rather exotic veneer night almeh count coup time write flatter pride moment leave sure left memory behind others heart leave venereal problem receive mercury treatment rest gently push notion expedition travel note maintain mark important transition write aesthetic perspective romanticism realism line excerpt writing tell summit overlook suddenly cry find call value lie largely insight personality provide commentary ancient virtually nil commentary rather interest limit well look ancient photo drawing interest have enjoy technicolor sandal sword epic century time wonder earlier travel fall desert realm probably behave differently aesthete native remain le indictment orientalism era pair journal companion dew commentary expert ramble lot interest section captivate diary expand journal entry make later work whole miscellaneous notebook impression observation much formidably articulate think relatively sexual episode get understandably candor much attention compare bulk slender give sight midst itinerary dutifully record letter mother many marvelous description not address mother get sense languid pace brothel early visitor curious wandering colossal statue sun rise graffiti ed first sight note remind magical ubiquitous decay splendor sample prose last attraction first impression land giants stone grille still exist window give scale formidable being walk forest tall column men serve whole skewer lark first courtyard great pylon come fall column segment order crash exactly pile checker return avenue sphinx head decapitate vulture yellow bill fly around mound carcass right alight calmly watch pass arab trot swiftly dromedary awesome silence also gain inspiration unlikely also learn early fickleness woman matter closing comment lady night often entertain think certainly think weave aesthetic particular interesting tourist vouchsafed honor couch vanished memory completely many others ah travel make modest see tiny place occupy world remark remind see mere pawn mid imperial stratagem take advantage position also realize complicity whole game privilege able indulge long pay price always find accept payment render service accordingly denigrate typically frank account coolly document exchange well today enmesh far greater contest begin initial encounter century half vogue globalization give great hug hold breath long possible exhale paper spirit random sometimes reread passage day exoticism allure mind work comprehend quantify say better understand situation journals letter write cut shark almost joke seem typically orientalist posture scandalize sexuality savage investigation see tone ambivalent yet cool giddy think westerner perturb almost know oddball everyone else normal require account travel senior year college extensive study effect mentality prime example travel make well country become colonized part many people consider classic hence classic piece literature find observation pretentious arrogant chauvinistic offensive approach several ignorant example demonstrate among st go colonize country part movement rescue possession numerous sexual exploit local woman response often distaste local custom general air boredom epitomize example bore rather spoil nothing better criticize custom culture foreign qualify real deal sail record thought observation indulgence usual excellent twenty air athletic vigor son doctor always write point finish suggest use story know perhaps father become basis accompany maintain control political interest write everyone clean clothes beat everyone dirty clothes call write desert begin gate suggest act keep travel diary move become sunrise saw top pyramid valley bath young men star visit juggler acrobat fear person snake charmer busy photography trip saw dervish describe water yellow carry take trip pass mountain dark arrive saw town building make dry mud saw describe dance writing travel photographic record temple become famous report mother always seem temple buried shoulder great plain look first impression place giant go find boat terrify pleased use think carried impression return write accord seem disdain journey look nothing contrary give first comprehensive view elegant account writer response alien culture consists journal entry letter writing note editor picture interesting compilation", "genres": ["Travel Writing"], "summary": "Flaubert's unforgettable memoirs of travels abroad\r\n\r\nAt once a classic of travel literature and a penetrating portrait of a “sensibility on tour,” Flaubert in Egypt wonderfully captures the young writer’s impressions during his 1849 voyages. \r\n\r\nUsing diaries, letters, travel notes, and the evidence of Flaubert’s traveling companion, Maxime Du Camp, Francis Steegmuller reconstructs his journey through the bazaars and brothels of Cairo and down the Nile to the Red Sea.", "asin": "0140435824", "rank": "615176", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/515RhtZ30LL.jpg", "country": "Egypt", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}