{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 36.600256, "ratings": {"num_ratings": 294, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Classic Steinbeck, great writer, twisted endings to stories."}, {"review_sentiment": 5.0, "review_text": "Simply a great story. My all time favorite author. I'd have never dreamed a story about a group of \"bums and wineo's\" could have possibly been so entertaining and gripping. Written by anyone else, probably it wouldn't have."}, {"review_sentiment": 5.0, "review_text": "Perhaps distracted many people of their problems in 20’s"}, {"review_sentiment": 4.0, "review_text": "Good fun reading!"}, {"review_sentiment": 5.0, "review_text": "Brand new. Fast shipping."}, {"review_sentiment": 5.0, "review_text": "Great book of course because I live in Monterey where this took place I think this is one of the best damn books ever."}, {"review_sentiment": 5.0, "review_text": "Great copy...thanks!"}, {"review_sentiment": 4.0, "review_text": "wow, what an unusual read, what a classic story, what was that? I really liked it, but it certainly was weird, in a good way ... described as an arthurian legend, but that's a stretch...still a lot of fun and I would recommend to anyone interested in Steinbeck, California history, and a voice not usually heard these days ... and it was short, always a positive (just started Middlemarch and altho it's considered one of the greatest books of all time, don't know if I can hang in for almost 800 pages) ... onward!"}, {"review_sentiment": 5.0, "review_text": "I'm a Northern California guy, so was Steinbeck, Tortilla Flat, Cannary Row and Sweet Thursday are still alive on the high North Coast."}, {"review_sentiment": 4.0, "review_text": "there were a lot of stickers on the book which ended up damaging the cover"}]}, "authors": ["John Steinbeck"], "isbn": "0140187405", "longitude": -121.8946388, "periods": ["1900s"], "title": "Tortilla Flat", "word_cloud": "classic great writer twist ending story great story time favorite author never dream story group bum possibly entertain grip anyone else probably perhaps distract many people problem good fun reading new shipping great course live take place think best damn ever copy thanks wow unusual classic story really like certainly weird good way describe arthurian legend stretch still lot fun anyone interested history voice usually hear day short always positive start alto consider greatest time hang almost page onward guy still alive high lot sticker end damage cover", "genres": ["Fiction & Literature"], "summary": "\"Steinbeck is an artists; and he tells the stories of these lovable thieves and adulterers with a gentle and poetic purity of heart and of prose.\" New York Herald Tribune\r\n\r\nAdopting the structure and themes of the Arthurian legend, John Steinbeck created a “Camelot” on a shabby hillside above the town of Monterey, California, and peopled it with a colorful band of knights. At the center of the tale is Danny, whose house, like Arthur’s castle, becomes a gathering place for men looking for adventure, camaraderie, and a sense of belonging—men who fiercely resist the corrupting tide of honest toil and civil rectitude.\r\n \r\nAs Nobel Prize winner Steinbeck chronicles their deeds—their multiple lovers, their wonderful brawls, their Rabelaisian wine-drinking—he spins a tale as compelling and ultimately as touched by sorrow as the famous legends of the Round Table, which inspired him. This edition features an introduction by Thomas Fensch.", "asin": "0140187405", "rank": "58909", "city": "Monterey", "image": "https://images-na.ssl-images-amazon.com/images/I/51TwEFilqcL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}