{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 232, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "If you love Roman history this is a must!"}, {"review_sentiment": 5.0, "review_text": "Fun to read about Caesar."}, {"review_sentiment": 5.0, "review_text": "This is one of my favorite books of classical literature.  I first came across the Graves translation after reading I, Claudius, and was delighted to find this is a readable and entertaining translation;"}, {"review_sentiment": 5.0, "review_text": "Interesting as well as enlightening."}, {"review_sentiment": 5.0, "review_text": "I was happy to find this edition available on Amazon. The print and pages are clear and good quality. The many photos are excellent. Included are family trees and timelines of the caesars. Suetonius was less restrained as a historian than Tacitus. There may be things you'll want to skip. But still, it's a great history and this version, with the great pictures, make it all come alive."}, {"review_sentiment": 5.0, "review_text": "Robert Graves is the best!"}, {"review_sentiment": 4.0, "review_text": "Instructive read!"}, {"review_sentiment": 3.0, "review_text": "I started looking for the translation of this book by Robert Graves, but, was directed to this version. I bought it without looking more carefully at the product. The good part was this translation didn't cost much, so, the pain was somewhat tolerable. I did find Robert Graves's translation from amazon.uk."}, {"review_sentiment": 5.0, "review_text": "Great book. Great service as usual."}, {"review_sentiment": 5.0, "review_text": "Great translation that reads easily."}]}, "authors": ["Suetonius"], "isbn": "0140455167", "longitude": 12.4829321, "periods": ["0-500s", "Pre Common Era"], "title": "The Twelve Caesars", "word_cloud": "love history favorite classical literature first come translation reading delight find readable entertaining translation interest well enlighten happy find edition available print page clear good quality many photo excellent include family tree timelines le restrained historian thing want skip still great history version great picture make come alive best instructive start look translation direct version buy look carefully product good part translation cost much pain somewhat tolerable find translation service usual translation read easily", "genres": ["Biography", "History", "Ancient Rome"], "summary": "An essential primary source on Roman history and a fascinating achievement of scholarship covering a critical period in the Empire.\r\n\r\nAs private secretary to the Emperor Hadrian, the scholar Suetonius had access to the imperial archives and used them (along with eyewitness accounts) to produce one of the most colourful biographical works in history. The Twelve Caesars chronicles the public careers and private lives of the men who wielded absolute power over Rome, from the foundation of the empire under Julius Caesar and Augustus, to the decline into depravity and civil war under Nero and the recovery that came with his successors. A masterpiece of observation, anecdote and detailed physical description, The Twelve Caesars presents us with a gallery of vividly drawn—and all too human—individuals. \r\n\r\nJames B. Rives has sensitively updated Robert Graves's now classic translation, reinstating Latin terms and updating vocabulary while retaining the liveliness of the original. This edition contains a new chronology, further reading, glossaries, maps, notes and an introduction discussing Suetonius' life and works. ", "asin": "0140455167", "rank": "36282", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/41t0e9n-WiL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}