{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 43, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Absolutely fabulous and atmospheric read. Effi Briest is the generally likeable seventeen-year old daughter of an upper class family. When her mother's one-time suitor calls and seeks her hand in marriage, Effi is aware of his prospects and immediately assents - though the reader has a sense of foreboding as her playmates' voices echo into the room, calling 'Come back, Effi.'Living in a distant town, Effi's new home is comfortable but creepy, with a ghostly presence that sometimes manifests itself. And while her much older husband Geert is not unkind, he prioritizes his career in the civil service and is rather a dry old stick. And then Effi is thrown into the company of womanizing Major Crampas...Unputdownable and unforgettable."}, {"review_sentiment": 2.0, "review_text": "i love classic german literature and since this particular book was praised by Thomas Mann i had high expectations. well, i had a big let down there. a story very similar to that of Madame Bovary and i am not a fan of Madame Bovary either. my dislike is for the execution not the story..and the heroine, Effi, is so unlikeable, so annoying that i found myself wishing the worst for her-i knew what was coming and i wished it came faster! i am not used to  feeling like this while reading the classics..,i rather read them slowly, savoring every page..still,i gave the book two stars because i  want believe many maybe lost in translation, Mann cannot be this wrong.."}, {"review_sentiment": 3.0, "review_text": "The translation is poor.  I've got what looks like a mixture of German and English, i.e., Dis instead of this, tling, for thing, etc.  Some words I couldn't make out at all.  So, I didn't enjoy the story as much as I could have."}, {"review_sentiment": 1.0, "review_text": "Please note, I haven't finished the book itself. The two stars is only related to typos on the Kindle edition. There are at least 162 typos in the first chapter. It's quite obvious the book was simply scanned and transcribed by a computer, as specific pages have consistent typos ('th' is regularly mis-copied as 'di'). If you're looking for Effi Briest on Kindle, I suggest you avoid this version.EDIT: In addition, the entirety of chapter 11 is missing. In its place is a paragraph summary of the actual events."}, {"review_sentiment": 5.0, "review_text": "I loved how Fontane described Effi's emotions and her process of growing up. The storyline makes you analyze and reflect a lot."}, {"review_sentiment": 5.0, "review_text": "Great story of a woman's fall from grace. She and her family were victims of a harsh Prussian code. Book also excellent in setting the scenes and lives in old Prussia.  Sad because it would all come to a tragic end in 1945."}, {"review_sentiment": 5.0, "review_text": "Lovely, lingering novel about the downfall of a young woman naïve about marriage."}, {"review_sentiment": 5.0, "review_text": "Jolly good. Best taken with Earl Grey mid morning."}, {"review_sentiment": 5.0, "review_text": "Excellent translation of a famous German novel. Edward Bucacci"}, {"review_sentiment": 5.0, "review_text": "excellent!!"}]}, "authors": ["Theodor Fontane"], "isbn": "0140447660", "longitude": 13.3888599, "periods": ["1800s"], "title": "Effi Briest", "word_cloud": "absolutely fabulous atmospheric generally likable old daughter upper class family mother suitor call seek hand marriage aware prospect immediately assent sense forebode playmate voice echo room call distant town new home comfortable creepy ghostly presence sometimes manifest much older husband unkind prioritize career civil service rather dry old stick throw company womanize unforgettable love classic german literature particular praise high expectation well big let story similar fan dislike execution heroine unlikable annoy find wish worst knew come wish come faster use feel read rather slowly savor give star want believe many maybe lose translation translation poor get look mixture german instead glint thing word enjoy story much note finish star related typo edition least typo first chapter quite obvious simply scan transcribed computer specific page consistent typo regularly look suggest avoid addition entirety chapter miss place paragraph summary actual event love describe emotion process grow story line make analyze reflect lot story woman fall grace family victim harsh prussian code also excellent set scene life old tragic end lovely linger downfall young woman nave marriage jolly good take mid morning excellent translation famous german excellent", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "In 1919 Thomas Mann hailed Effi Briest (1895) as one of \"the six most significant novels ever written.\" \r\n\r\nSet in Bismarck's Germany, Fontane's luminous tale of a socially suitable but emotionally disastrous match between the enchanting seventeen-year-old Effi and an austere, workaholic civil servant twice her age, is at once touching and unsettling. \r\n\r\nFontane's taut, ironic narrative depicts a world where sexuality and the enjoyment of life are stifled by narrow-mindedness and circumstance. Considered by many to be the pinnacle of the nineteenth-century German novel, Effi Briest is a tale of adultery that ranks with Madame Bovary and Anna Karenina and brilliantly demonstrates the truth of the author's comment and \"women's stories are generally far more interesting.\"", "asin": "0140447660", "rank": "654611", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51pW3pHwLIL.jpg", "country": "Germany", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}