{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 50.8465573, "ratings": {"num_ratings": 381, "rating": 3.9, "reviews": [{"review_sentiment": 2.0, "review_text": "I found this novel overly long, and the story-line is subjected to a profusion of unrealistic improbabilities.  There are, of course some passages of brilliant writing but, on the whole, I enjoyed \"Jane Eyre\" more, in spite of the critics' consensus that \"Villette\" is the superior novel."}, {"review_sentiment": 5.0, "review_text": "I enjoyed the character Lucy Snow and the way her character was strong and unending under the challenges of life."}, {"review_sentiment": 5.0, "review_text": "I love this edition so much I bought several other books with this binding. The only problem is my cat also liked the binding and the little string to mark the page and within two days had chewed the corner off the book."}, {"review_sentiment": 1.0, "review_text": "It's a paperback, which I didn't realize when I ordered it. It's like a paper workbook that you would use in school. I thought it was a hard cover. :-("}, {"review_sentiment": 5.0, "review_text": "I enjoyed this book immensely. This author has an affinity and detail for words that cannot be adequately expressed. If you like suspense you will enjoy this book."}, {"review_sentiment": 2.0, "review_text": "Lucy Snowe starts out as a sympathetic heroine, but religious and anti-French prejudice are on display throughout this book, which is also slow-moving and has long stretches of untranslated French (which I've forgotten so much of since high school).  Hard to believe that Charlotte Bronte wrote this and Shirley after she wrote the immortal Jane Eyre.  She should have quit while she was ahead."}, {"review_sentiment": 3.0, "review_text": "This is a hugely accomplished book in many respects. The characterization is strong and varied, the psychological insight is fine, and the prose masterly. Charlotte Brontë achieves the impressive feat of creating a proto-feminist work from the unpromising material of a very unassuming and passive heroine and sustaining interest in her throughout a long novel. So why only three stars? The plot, such as it is, proceeds through a whole series of highly improbable coincidences. Even by the standards of the 19th century novel, these are so consistent a narrative device as to become unpardonable. Disbelief simply cannot be suspended so frequently and to such an extent. This is a pity as Villette could otherwise have been the masterpiece it is sometimes proclaimed to be, but sadly is not. Less importantly, the book is marred by Bronté's childish French nomenclature. Naming the country in which the action takes place 'Labassecour' (French for 'farmyard') might, for example, have been witty in a comic work but is simply discordant in a work as solemn and serious as Villette.  It is also revealing of the cultural chauvinism that is at least semi-explicit throughout the work. Would I recommend that Villette be read? Yes, because its good points are so very good. Is it better than Jane Eyre? Much better and far worse."}, {"review_sentiment": 3.0, "review_text": "I ordered this edition because it was the least expensive, and when it arrived I was taken aback. Although it was not damaged, it was not what I was expecting. The book is roughly the size of a magazine, and is printed with very small text. The standard printing of this novel is just over 500 pages, but this edition is only 207 pages, managed by the minuscule text and massive page size.The outside is aesthetically pleasing but this edition is not meant to be read."}, {"review_sentiment": 2.0, "review_text": "This read as two books out together to make one.  Also, the book takes a sharp turn at the end, and it is as though the author tired of the story and decided to being the book to an abrupt end."}, {"review_sentiment": 4.0, "review_text": "Classic story"}]}, "authors": ["Charlotte Brontë"], "isbn": "0140434798", "longitude": 4.351697, "periods": ["1800s"], "title": "Villette", "word_cloud": "find overly long subjected profusion unrealistic improbability course passage brilliant write whole enjoy spite critic consensus superior enjoy character way character strong unending challenge life love edition much buy several bind problem cat also like bind little string mark page day chew corner paperback realize order paper workbook school think hard cover enjoy immensely author affinity detail word adequately express suspense enjoy start sympathetic heroine religious prejudice display also long stretch untranslated french forget much high school believe write write immortal quit ahead hugely accomplished many respect characterization strong varied psychological insight fine prose masterly achieve impressive feat create work unpromising material unassuming passive heroine sustain interest long star plot proceeds whole series highly improbable coincidence even standard century consistent narrative device become unpardonable simply suspend frequently extent pity masterpiece sometimes proclaim sadly importantly mar childish french nomenclature country action take place french example comic work simply discordant work solemn serious also reveal cultural chauvinism least work recommend good point good better better far worse order edition least expensive arrive take aback damage expect roughly size magazine print small standard printing page edition page manage minuscule text massive page aesthetically please edition meant together make also take sharp turn end author tire story decide abrupt end classic story", "genres": ["Fiction & Literature"], "summary": "\"I am only just returned to a sense of real wonder about me, for I have been reading Villette...\" George Eliot\r\n\r\nWith neither friends nor family, Lucy Snowe sets sail from England to find employment in a girls’ boarding school in the small town of Villette. There she struggles to retain her self-possession in the face of unruly pupils, an initially suspicious headmaster, and her own complex feelings, first for the school’s English doctor and then for the dictatorial professor, Paul Emmanuel. \r\n\r\nCharlotte Brontë’s last and most autobiographical novel is a powerfully moving study of isolation and the pain of unrequited love, narrated by a heroine determined to preserve an independent spirit in the face of adverse circumstances.", "asin": "0140434798", "rank": "270914", "city": "Brussels", "image": "https://images-na.ssl-images-amazon.com/images/I/51RWaGdUmaL.jpg", "country": "Belgium", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}