{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 36.600256, "ratings": {"num_ratings": 1673, "rating": 4.7, "reviews": [{"review_sentiment": 4.0, "review_text": "Steinbeck novel. The writing is “simple” and easy to read, but the thoughts and depth are both real and raw. We know little about Cain and Abel in the Bible story, but I suspect this gives some insight into both the brothers. One “good” but far from perfect, the other “bad” but as much from circumstance and poor timing as from evil intent (although the latter does exist at times). They both pay for it in their own way."}, {"review_sentiment": 5.0, "review_text": "This book had some of the most odious characters and themes I have ever read. I found myself, at first, hating it, but still captivated by the story. The last third or so, I found certain characters to be more endearing and their purposes more significant. I was still on the fence as to my true opinion until the last page. Once I read the final word of the novel (which wouldn’t make sense unless you read the rest) I felt the entire work not only redeemed, but highly recommendable."}, {"review_sentiment": 5.0, "review_text": "Spellbinding.couldn't put it down. He keeps you in suspense.  It shows the evolution of the generations and how they affect our very existence."}, {"review_sentiment": 5.0, "review_text": "Mankind's struggle with good and evil told with a diverse cast of characters and with a tragic humor. A true classic."}, {"review_sentiment": 5.0, "review_text": "Beautifully written family saga. Steinbeck at his best."}, {"review_sentiment": 4.0, "review_text": "Great book!!"}, {"review_sentiment": 5.0, "review_text": "Good book."}, {"review_sentiment": 4.0, "review_text": "Read this eons ago as a teenager and had forgotten most of it. Parts are very deep and hard to read but that was the way Steinbeck wrote."}, {"review_sentiment": 5.0, "review_text": "Timeless classic.  I first read this so long ago, I only remembered the outlines of the story.  I'd forgotten about the vivid characters and the  humor that lightens the narrative in places.  Steinbeck is truly a master."}, {"review_sentiment": 5.0, "review_text": "A little different than the picture, still a good book"}]}, "authors": ["John Steinbeck"], "isbn": "0140186395", "longitude": -121.8946388, "periods": ["1900s"], "title": "East of Eden", "word_cloud": "write simple easy thought depth real raw know little story suspect give insight brother good far perfect bad much circumstance poor time evil intent latter exist time pay way odious character theme ever find first hat still captivate story last third find certain character endear purpose significant still true opinion last page once final word make sense rest felt entire work redeem highly recommendable put keep suspense show evolution generation affect existence struggle good evil tell diverse cast character tragic true classic beautifully write family saga best great good read eon ago teenager forgotten deep hard way write classic first long ago remember outline story forget vivid character humor lightens narrative place truly master little different picture still good", "genres": ["Fiction & Literature"], "summary": "A masterpiece of Biblical scope, and the magnum opus of one of America’s most enduring authors\r\n\r\nIn his journal, Nobel Prize winner John Steinbeck called East of Eden \"the first book,\" and indeed it has the primordial power and simplicity of myth. Set in the rich farmland of California's Salinas Valley, this sprawling and often brutal novel follows the intertwined destinies of two families—the Trasks and the Hamiltons—whose generations helplessly reenact the fall of Adam and Eve and the poisonous rivalry of Cain and Abel.\r\n\r\nThe masterpiece of Steinbeck’s later years, East of Eden is a work in which Steinbeck created his most mesmerizing characters and explored his most enduring themes: the mystery of identity, the inexplicability of love, and the murderous consequences of love's absence. Adapted for the 1955 film directed by Elia Kazan introducing James Dean and read by thousands as the book that brought Oprah’s Book Club back, East of Eden has remained vitally present in American culture for over half a century.", "asin": "0140186395", "rank": "3312", "city": "Monterey", "image": "https://images-na.ssl-images-amazon.com/images/I/51gcQhUb-yL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}