{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 165, "rating": 4.4, "reviews": [{"review_sentiment": 3.0, "review_text": "Second read. This review is of the 1997 edition.This book served my purposes well, in that I was looking for an overview history of the entire period of American involvement. Karnow delivers on that, and also provides some broader context of the ancient Vietnamese history, its history as a colony, and the French war in Indochina.Originally published in 1983, Karnow includes updates from later visits. His first-hand reportage and interviews with leading figures (such as Giap and Westmoreland) give this account some immediacy and weight. If anything, Karnow was there, living these events and connecting them with other people who lived through them. Some of these interviews must have been for a related TV series at the time, and as far as TV-associated books go, this definitely rises to the top. Too, the photographs are well chosen and underscore the narrative, bringing this period to life. Karnow certainly understands the major issues, and for the most part covers the war adequately from all perspectives. For all these reasons, it's easy to see why this book is frequently recommended as the one-volume history to read.Yet, I wanted more from this. I find the first three chapters difficult to get through, mainly because they weave backwards and forwards in time. The first chapter is sort of an update to the earlier editions, covering Vietnam since the end of the war in 1975. The next chapter goes backwards, dealing with Vietnam as a European colony. Then the third chapter goes back even further, dealing with the long Vietnamese historical struggle for independence, often against China. To be sure, all of these chapters are worth reading -- and understanding Vietnam's long conflict with China is still relevant today -- but they are not arranged chronologically.After this, though, the book gets rolling. If there's one theme that comes through loudly and clearly, it was that Vietnam was fighting for its independence for a long time, and that this will to national autonomy and unity was something the United States could not beat, as others before it had tried to do as well. This seems banal to write, because it is well known by now, but it is nevertheless important to remember and still a salient takeway from this Karnow's history.Looking at the endnotes, it appears that much of the research was based on secondary sources that were used before the original publication. There are some limitations to this approach, mainly that there's little to no obvious archival work, but also that the books used for research are themselves dated. The coverage of North Vietnam seems a little weak, for understandable reasons, more understandable in 1983 than perhaps it is today.I also would have liked a better understanding of the military aspects of events, and Karnow seems to shy away from the kind of military descriptions that Rick Atkinson or Barbara Tuchman, other journalist-historians, excel at. Instead, Karnow focuses on higher political maneuverings, as the last chapter about the Nixon era especially highlights. So, given that this is a book about a war, I can't say that in either reading I've come away with a better understanding of how it was fought day to day. Even so, it remains a good starting point for a general reader looking to understand the dynamic sweep of Vietnam throughout its history, but especially for the American involvement in that country."}, {"review_sentiment": 5.0, "review_text": "proper perspective"}, {"review_sentiment": 4.0, "review_text": "An excellent and comprehensive coverage of a major historical event .Having lived through the war in another western society as a teenager, it is a revelation to put together what were confusing and sometimes obfuscurated facts. The book ( which accompanied the television history in 11 parts) has the added ability to furnish prose detail to News events at the time.  Both political systems and the Media in the US had to grow rapidly with the discovery that this War in particular was not simply one with soldiers but with citizens and families connected in a unique way around the evening dinner table . The book is a mature delivery of the warts and all facts of the “first casualty”, which is always, in any war, the truth.  Not just Presidents but everyone involved got caught up in the “policy of limited candour”It was good to read also at this distance in time ..... a respectable 50 plus years.ReviewJim Waters"}, {"review_sentiment": 3.0, "review_text": "Karnow's book is an interesting, almost too-detached account of Vietnam's history. He spends a good 1/4 of the book on the country's complex history and the bulk of the rest on political machinations during the war -- including an all-too-detailed account of the Diem coup. The battles and experiences of those who fought seem almost secondary. For example, Ia Drang barely warrants a sentence or two and the Tet Offensive Battle for Hue gets perhaps a page or two.The book is written well and provides lots of political narrative and insights into the many pressures LBJ and his team faced but lacks the emotion and grit of battle. Even the turmoil at home in the US seems secondary and fails to capture fully how the war was tearing us apart. It abruptly ends with the NVA's capture of the US embassy but offers no analytical poscript on the meaning of the war, its impact and its social costs."}, {"review_sentiment": 5.0, "review_text": "The new addition of a book used in classes at the Air Force Academy.  An outstanding introduction to an often misunderstood war.  Still has a place on my shelf today more than 30 years later."}, {"review_sentiment": 3.0, "review_text": "Karnow's a good writer & a good reporter, but not a great one. That credit goes to Maggie Higgins, the little tigress who earned her chops starting in WW2. She immediately smelled a rat in the flack over the ousted Diem administration & when meeting the Buddhists condemning him. It's all in her book, OUR VIETNAM NIGHTMARE. I found Karnow's history of Vietnam to be a very good overview for Western readers, but he fails to comprehend, as opposed to Higgins & Sir Robert Thompson, that Diem was a relatively gentle leader who cared deeply for his people & did not want to see them butchered-- even the Communists. That got him assassinated. Ho praised the man, for heaven's sake! If one reads Karnow with that understanding, VIETNAM is a good starter, but not the last word on that sad saga.To really understand America's entry into the conflict, one must first understand the history of the Cold War & the events that took place after the Yalta & Potsdam Conferences. The Soviets took over Eastern Europe & Mao took China. Then the expansions began in Asia & Africa. There was every reason to believe in the Domino Theory, esp. after what happened in poor Hungary (see, THE BRIDGE AT ANDAU, J. Mitchener). America was not naive concerning the Soviets or the Maoist thugs. Just look how the USSR & the PRC suffered under Stalin & Mao respectively. We knew them to be sneaky, lying totalitarian regimes. What amazes me is that so many people overlook the fact that the only thing that saved both countries was taking the Capitalist Road, the very thing Mao warned against. The same happened in Nam. But I digress....Assassinating Diem was the worst thing our govt. assented to imho. But then, our govt. has never been very good at foreign diplomacy & intrigue."}, {"review_sentiment": 5.0, "review_text": "Very detailed and accurate history."}, {"review_sentiment": 5.0, "review_text": "very in depth book. a lot of work went into this publication. very worth reading if you are a viet nam historian."}, {"review_sentiment": 5.0, "review_text": "Excellent detailed history of what led to our involvement."}, {"review_sentiment": 5.0, "review_text": "This book is very detailed, but I love details. Gives one the complete story of Vietnam."}]}, "authors": ["Stanley Karnow"], "isbn": "0140265473", "longitude": 0.0, "periods": ["1900s"], "title": "Vietnam: A History", "word_cloud": "second review serve purpose well look overview entire period american involvement deliver also provide broader context ancient vietnamese colony war publish include update later visit reportage interview lead figure give account immediacy weight anything live event connect people live interview tv series time far definitely rise top photograph well choose underscore narrative bringing period life certainly understand major issue part cover war adequately perspectives reason easy see frequently recommended want find first chapter difficult get mainly weave backwards forward time first chapter sort update earlier edition cover end war next chapter go backwards deal colony then third chapter go back even deal long vietnamese historical struggle independence often sure chapter worth read understanding long conflict still relevant today arrange get roll theme come loudly clearly fight independence long time national autonomy unity something others try well seem banal write well know nevertheless important remember still salient takeaway end notes appear much research base secondary source use original publication limitation approach mainly little obvious archival work also use research date coverage seem little weak understandable reason understandable perhaps also better understand military aspect event seem shy away kind military description excel instead focus higher political maneuverings last chapter era especially highlight so give war read come away better understanding fought day day even remain good start point general look understand dynamic sweep especially american involvement country proper perspective excellent comprehensive coverage major historical event live war western society teenager revelation put together confuse sometimes obfuscate facts accompanied television part add ability furnish prose detail event time political system grow rapidly discovery particular simply soldier citizens family connect unique way even dinner mature delivery wart fact first casualty always war truth not everyone involve get caught policy limit candor good also distance time respectable water interest almost account spend good country complex bulk political machination war include account coup battle experience fight seem almost secondary example barely warrant sentence get perhaps page write well provide lot political narrative insight many pressure team face lack emotion grit battle even turmoil home seem secondary fails capture fully war tear abruptly end nova capture embassy offer analytical postscript mean war impact social cost new addition use class outstanding introduction often war still place shelf today year later good writer good reporter great credit go little tigress earn chop start immediately smell rat flack oust administration meeting buddhist condemn find good overview western reader fail comprehend opposed relatively gentle leader care deeply people want see butcher even get assassinated praise man heaven read understand good starter last word sad really understand entry conflict first event take place conferences take take then expansions begin reason believe esp happen poor see naive concern thug suffer respectively know sneaky lie totalitarian regime amaze many people overlook fact thing save country take capitalist thing warn happen digress worst thing govt assent imho govt never good foreign diplomacy intrigue very detailed accurate depth lot work go publication read vie man historian excellent detailed lead involvement detailed love detail give complete story", "genres": ["History", "Politics", "Journalism"], "summary": "\"A landmark work...The most complete account to date of the Vietnam tragedy.\" The Washington Post \r\n\r\nThis monumental narrative clarifies, analyzes, and demystifies the tragic ordeal of the Vietnam war. Free of ideological bias, profound in its understanding, and compassionate in its human portrayal, it is filled with fresh revelations drawn from secret documents and from exclusive interviews with participants (French, American, Vietnamese, Chinese): diplomats, military commanders, high government officials, journalists, nurses, workers, and soldiers. \r\n\r\nOriginally published a companion to the Emmy-winning PBS series, Karnow's defining book is a precursor to Ken Burns's ten-part documentary series, The Vietnam War. Vietnam: A History puts events and decisions into such sharp focus that we come to understand - and make peace with - a convulsive epoch of our recent history.\r\n\r\n\"This is history writing at its best.\" Chicago Sun-Times\r\n\r\n\"Even those of us who think we know something about it will read with fascination.\" The New York Times", "asin": "0140265473", "rank": "47612", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51jjjkcFgFL.jpg", "country": "Hanoi", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}