{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 24, "rating": 3.4, "reviews": [{"review_sentiment": 4.0, "review_text": "The cover is a little broken."}, {"review_sentiment": 5.0, "review_text": "This story reads like a song. Triumphant in places, elegiac in others, the prose evidencing a compelling psychological portrait of Hyacinth Robinson and all he has become mixed up in. Wonderful."}, {"review_sentiment": 5.0, "review_text": "Though throughly written in James' style and prose, the persistent concerns and references to the socially oppressed classes gives the reader the sense that Dickens watched over the writing."}, {"review_sentiment": 3.0, "review_text": "This is the story of a princess who wants to be a revolutionary, a revolutionary who wants to be a nobleman, and a brilliant novelist who quite loses his way by trying his hand at something he is not really very good at. The princess of the title is estranged from her princely husband, an Italian nobleman, and she has all the beauty and brains of a classic James heroine—more really. But she has a fascination for the teeming underclass of Victorian Britain and the seething politics and class unrest that threatened revolution on all sides in that turbulent era. The hero is Hyacinth Robinson, the illegitimate son of a British nobleman and the French woman who murdered him in a passion; he is a bookbinder by profession, a gentleman by blood, and someone who comes to dabble in revolutionary circles, and eventually agrees to be the instrument of a bloody assassination attempt.The story could seem seriously dated and improbable, but only if you forget how really terrifying the anarchists of that time were. They were that era’s terrorists, and they struck with great violence and cruelty. Crude bomb-makers blew themselves up in crowded trains and cozy cafes in Paris, crackpots from obscure political sects took potshots at crowned heads and political figures. And more victims fell than just the Archduke and Archduchess of Austria at Sarajevo. William McKinley, the U.S. president, was assassinated, as was an Austrian empress, a French president, an Italian king and a Spanish prime minister. The crimes were vicious, shocking, and deadly, just like today. And they fascinated and appalled the aristocracy.This novel is James’ attempt to give them a thrilling glimpse into this murky world and to depart from his usual haunt of the drawing rooms and ballrooms of the rich and privileged. In this he was ill-advised and he should have stuck with the subjects and the class that he knew so well. This is an attempt to give a Dickensian peep into the seedy underworld of the London poor and the politicians and terrorists that were stirring the pot of civil unrest there, and James simply does not pull it off very well. The great central plot device of the novel—the impending assassination attempt—hangs over the novel for 600 pages, but in the end it is what the English call a damp squib, a firework that fails to go off. And 600 pages of that is far too much, leaving one feeling like the Emperor Joseph II, who supposedly said to Mozart on hearing “The Abduction from the Seraglio” for the first time: “That is too fine for my ears–there are too many notes!” There are too many words in this novel for the scant plot it seeks to advance, the characterizations of working class people are neither convincing nor sympathetic, and are not even particularly interesting. James should have left this world to Dickens and stuck to the world he knew so well and which adorns his other, much better, novels."}, {"review_sentiment": 4.0, "review_text": "This is a great book but I was annoyed that the reprint job, apparently made by photographing an earlier edition page by page, was so poorly handled. Parts of several pages were illegible and why do we have to see UC library's sign out sheet?"}, {"review_sentiment": 2.0, "review_text": "I like Henry James generally, but found this particular work to be too slow in development to recommend. A young man of modest circumstances and spear-side bourgeois inheritance becomes involved with the Socialist movement. His pride of ancestry, along with a growing feeling that Socialism by leveling the playing field will remove the opportunity to unique, begins to turn him away from the movement despite a promise to commit a terrorist act. Enthralled by the title princess who begins to affect the life of the working poor, he holds his concerns at bay as the book tries for an exciting climax.While I found the political arguments interesting, the book's slow pace becomes its undoing. The writing is particularly dense and inaccessible (even for James), eschewing an initial Dickensian sensibility for often-tricky sentence structures that win on length as they lose on meaning.Can't recommend it"}, {"review_sentiment": 1.0, "review_text": "The print quality of this book was terrible.  There were entire passages that were unreadable due to incompletely formed letters or missing words.  I returned the book and received a replacement that had the same problems."}, {"review_sentiment": 4.0, "review_text": "This novel from James' middle period in the 1880s is no yellow press report on the state of the nobility. The title might suggest a visit to European princes, but it is rather misleading, as James  descends  into working class and political  environments. He lets us observe some simple people. He visits people of the revolutionary ilk and sees an abundant supply of conviction and prophecy -- but he doesn't let us share the abundance. The man is outside his element.The title heroine has crossed our path before, in one of the early novels. Her real name is Christina Light. In Roderick Hudson she was a beauty with a destructive effect on men, and the need for a good  marriage. She married into the right to be called a princess. Now we meet her again in a story of  political intrigue and terrorism. What has the good princess got to do with such horrors? She finds the rebels more interesting than her stupid boring prince. She is a social tourist. Her curiosity is obscene and qualifies her as an agent provocatrice. There is the usual sex-free sexual tension as well. A treasure trove for a shrink! We wonder about her. Is she destined to be an impresaria of world revolution? Or will she drop out as bored as she was with her husband? Or does she have the will to self-destruction, as could certainly be envisaged? The possibility that she might get caught and might be hanged seems rather appealing to her. Masochism?James presents himself as a link between Dickens and Conrad. Some passages, like chapter 3 with the little boy's visit to his dying mother in jail, are straight out of Dickens. The terrorist intrigues and complications anticipate Conrad's Secret Agent and Under Western Eyes. The meetings of the political group in their smoke filled pub room are reminiscent of Zola's similar group in The Belly.Some of the humor anticipates Woody Allen. Imagine that!But it is still a James story: Hyacinth, the Hamletian hero (to kill or not to kill?), in his divided loyalty and indecision, is the focus. The man has committed himself to play the game, and when he loses conviction due to other attractions of life, he realizes: there is no way back, no emergency exit. He had joined the group of political sectarians from a need to belong, somewhere. He longed for a long time to be admitted to the secrets, the inner circle.. When he is there, he is not sure any more.He has grown up with the dream that a place among the ruling class would be his proper due, while he realizes at the same time that his actual status is such that he would not marry any one who would marry him.(I had not realized that this joke is from the 19th century. I learned it first from Woody Allen)While the novel is entertaining in a Jamesian way, it is also irritating. Condescension is one thing. We feel that the patronizing voyeurism of the princess is rather shared by the master. He didn't really bother to look much into the poor classes.Another weak point: the political and historical background is painted only vaguely. We have a reference to the Paris Commune, to the International, to socialism, to unemployment and poverty, to Darwin and Spencer (not to Marx though), but we have no exposure to ideology, no attempt at diving into the thoughts of the rebels.No ideas enter HJ's mind, as somebody said.The strength of the novel is in its central character Hyacinth and in his indecision.As often with James, I would have wished the novel to be shorter. But then, isn't it better to spend more time than planned with James, even if not unflawed, than wasting it entirely?"}, {"review_sentiment": 1.0, "review_text": "The OCR scanning is very poor. Many mistakes on every page render this book essentially unreadable. Publishers, maybe you could pay a few English majors 10 bucks an hour or so to type the book up....? I'd rather pay a few dollars more for something readable!!!"}, {"review_sentiment": 1.0, "review_text": "That this book itself is a classic is a given. Yet while digital collections of the \"complete\" Henry James abound, for some reason 'The Princess' is unusually hard to come by. Unfortunately the edition that Amazon does have available, and the one reviewed here, is an eminently poor copy. The likely OCR'd text is frequently mistranscribed or spotted with arbitrary punctuation; proper names exchange letters at random (such that Rosy is oftener \"Posey\" or \".Posy\"). This alone wouldn't be enough to mar the experience, except that roughly half of the last chapter of Book I is truncated mid-sentence. Given how much these serial novels rely on the budding suspense between sections, the omission is plainly unacceptable. I thus could not recommend this edition for any purpose until corrected."}]}, "authors": ["Henry James"], "isbn": "014043254X", "longitude": -0.12574, "periods": ["1800s"], "title": "The Princess Casamassima", "word_cloud": "cover little broken story read song place elegiac others prose evidence compel psychological portrait mixed wonderful thoroughly write style prose persistent concern reference socially oppressed class give sense watch write story want revolutionary revolutionary want nobleman brilliant novelist quite lose way try hand something really good title estrange princely husband italian nobleman beauty brain classic really fascination teem underclass victorian seethe politics class unrest threaten revolution side turbulent era hero son british nobleman french woman murder passion bookbinder profession gentleman blood someone come dabble revolutionary circle eventually agree instrument bloody assassination story seriously date improbable forget really terrify anarchist time era terrorist strike great violence cruelty blew crowd train cafe crackpot obscure political sect take potshot crown head political figure victim fell president assassinate austrian empress french president king spanish prime minister crime vicious shock deadly today fascinate appal attempt give thrill glimpse murky world depart usual haunt draw room ballroom rich privilege stuck subject class knew well attempt dickensian peep seedy underworld poor politician terrorist stir pot civil unrest simply pull well great central plot device impend assassination page end call damp squib firework fails go page far much leave feeling supposedly say hear first time fine many note many word scant plot seek advance characterization work class people convince sympathetic even particularly interesting leave world stick world knew well adorns much better novel great annoy reprint job apparently make photograph earlier edition page page poorly handle several page illegible see library sign sheet like generally find particular work slow development young man modest circumstance bourgeois inheritance becomes involve socialist movement pride ancestry grow feel level play field opportunity unique begin movement promise commit terrorist act enthral title begin affect life work poor hold concern bay try excite find political argument interest slow pace become undo write particularly dense inaccessible even eschew initial dickensian sensibility sentence structure win length lose recommend print quality terrible entire passage unreadable due incompletely form letter miss word return received replacement problem middle period yellow press report state title visit european prince rather mislead descend work class political environment let simple people visit people revolutionary ilk see abundant supply conviction prophecy let share man title heroine cross path early novel real name beauty destructive effect men need good marriage marry right call now story political intrigue terrorism good get horror find rebel interest stupid boring prince social tourist curiosity obscene qualifies agent provocative usual sexual tension well treasure trove shrink wonder be destine impresario world revolution drop bore husband certainly possibility caught seem rather appeal present passage chapter little boy visit die mother jail straight dickens terrorist intrigue complication anticipate western meeting political group smoke fill pub room reminiscent similar group humor anticipate still story hero kill divide loyalty indecision focus man commit play game lose conviction due attraction life realize way back emergency exit join group political sectarian need belong somewhere long long time admit secret inner sure grow dream place rule class due realizes time actual status realize joke century learn first entertain jamesian way also irritate thing feel patronize voyeurism rather share master really look much poor weak point political historical background paint vaguely reference socialism unemployment poverty exposure ideology attempt dive thought idea enter mind somebody strength central character often shorter better spend time plan even flaw waste entirely scan poor many mistake page render essentially unreadable publisher maybe english major buck hour type rather pay dollar something readable classic give digital collection complete reason unusually hard come unfortunately edition available review eminently poor copy likely text frequently mistranscribed spotted arbitrary punctuation name exchange letter random oftener alone mar experience roughly last chapter truncate given much serial novel rely bud suspense section omission plainly unacceptable thus edition purpose correct", "genres": ["Fiction & Literature"], "summary": "Henry James conceived the character of Hyacinth Robinson—his 'little presumptuous adventurer with his combination of intrinsic fineness and fortuitous adversity'—while walking the streets of London. \r\n\r\nBrought up in poverty, Hyacinth has nevertheless developed aesthetic tastes that heighten his awareness of the sordid misery around him. He is drawn into the secret world of revolutionary politics and, in a moment of fervour, makes a vow that he will assassinate a major political figure. Soon after this he meets the beautiful Princess Casamassima. \r\n\r\nCaptivated by her world of wealth and nobility, art and beauty, Hyacinth loses faith in radicalism, 'the beastly cause'. But tormented by his belief in honour, he must face an agonizing, and ultimately tragic, dilemma. \r\n\r\nThe Princess Casamassima is one of James's most personal novels and yet one of the most socially engaged.", "asin": "014043254X", "rank": "382072", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41sTQJQ1z8L.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}