{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 153, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "I'm at the 70% mark after a marathon session with my tablet. I cannot put this down!  I wanted to write this review before I forgot.This remarkable book is an achievement because it contains both all of the detail you would expect from such a well-researched project and great writing: the author really brings out the personalities in a great piece of storytelling.What really stands out is the way he simultaneously tracks developments in Japan and the US throughout 1941, moving back and forth from the Japanese officers and politicians to their American counterparts.  As Yamamoto and a small circle of colleague start to get serious about the seemingly impossible dream of a surprise attack on Pearl Harbor, the Americans keep pondering what the Japanese would do if negotiations broke down.  Again and again the idea of some sort of attack on Pearl Harbor is brought up and then forgotten.  The frustration a typical American reader is likely to feel cannot be understated.  Epic frustration.The detailed examination of the Japanese planning is good not only for those who want to learn about this operation but also, to be coolly objective, it's simply a good case study of people turning over a problem (or opportunity) and looking at it from almost every angle.  The contrast between the Japanese and the Americans could not be more stark.To demonstrate how thorough this book is: I bought it on the off chance that I would find an answer to my own question, which was, did the Japanese not realize that it was possible that sunken ships would simply be hauled out, repaired, and sent out to fight the Japanese again?  This is the cost of trying to sink ships in the shallow waters of a harbor (with all those repair facilities right there) instead of out in the (for all intents and purposes) bottomless ocean.  Anyway, I was sure Yamamoto had considered this (especially since the shallow harbor presented a problem for the Japanese torpedoes).The author did not disappoint.  He shows in a couple of places in his narrative how this issue vexed one of the Japanese officers in particular, who was hoping that some of the ships would be parked in a much deeper harbor not too far away.  The other harbor was included in the planning, but he was to be disappointed that morning when reconnaissance discovered nothing there.  But they did plan for this disappointment: because of the shallow water at Pearl, their mission was not merely to sink the battleships, but to destroy them beyond all hope of repair.  An important distinction affecting the detailed instructions given to the pilots.Even so, when one reads the Japanese side, there is a frustration that mirrors the one you might feel while reading the American side of the story: even Yamamoto acknowledged, explicitly, that an operation against Pearl could only be a delaying tactic in a war that America would certainly win.  This is something that the Japanese worried about but seemed to have no answer for.  The answer might have been in Washington, where Japanese diplomats seemed to be honestly trying to keep the peace, and voiced their frustration with their own government and military for an insistence on imperialist adventures."}, {"review_sentiment": 5.0, "review_text": "I’m a big fan of history, and in particular, World War II history.  I went looking for a book on Pearl Harbor and before I started the search I had heard of Gordon Prange’s history of the event.  Most of the reviews and guides I read kept bringing me back to his book as the definitive study of the event and so I took it on.  Prange served in World War II, served in the military in historical services and personally conducted numerous interviews with most of the Japanese leaders involved in the event.  His personal knowledge of Pearl Harbor was without equal and he produced, but died before seeing it published, this impressive and amazingly detailed history of the event.  His writing style is lucid and readable which makes this tomb accessible.  It is however, beefy and exhaustive.  It is my understanding that two of his students (Prange was also a history professor) edited his text down to the over 750 pages it stands at today.  Prange, to his infinite credit, drills into the amazing currents and tides of the Japanese leadership’s journey to deciding to attack the United States at Pearl.  The thumbnail of the story of how Yamamoto conceived and pushed the plan is well known, but the political gyrations underneath that superficial knowledge are fascinating.  Granted, the long journey to the ultimate consensus to attack Pearl Harbor takes 300 pages.  And then it is another 200 pages before the attack itself takes place.  Throughout these 500 pages you get a detailed look at a cadre of Japanese and American leaders, what drove them, and how they helped shape events.  At its core, the book sheds light on how improbable success was for Yamamoto’s brazen plan and also how again and again the American forces and political leaders failed to “connect the dots” and execute on the most basic of sound defensive tactics.  Prange does a solid job of bringing to life the attack itself but as a deliberate historian he acknowledges that many of the official reports, from both militaries, are fraught with contradictions and he dutifully reports what he can confirm while straying from representations he cannot substantiate.  This leaves the combat portion of the book paling in comparison to the heft of the steps leading up to the battle and then the onerous post event second guessing by the American forces.  This is an impressive history.  Its heft can make it daunting for the faint of heart.  If you want a quality overview of the event then this book is not for you.  If you want a highly detailed and thorough unpacking of this shocking event that changed the courses of two nations then you have struck pay dirt."}, {"review_sentiment": 3.0, "review_text": "It was a very detailed report on Pearl Harbor attack. Therefore, very hard to read, but for someone doing research on this, there are a lot of historical details.  I recommend it if you need this type of information."}, {"review_sentiment": 5.0, "review_text": "excellent. author is tops in his field."}, {"review_sentiment": 4.0, "review_text": "An in depth history of the actions (and lack thereof) leading up to December 7, 1941. Full of names, dates and the thinking on both sides of the Pacific. Really incredible."}, {"review_sentiment": 3.0, "review_text": "This is a very interesting account of events leading up to the bombing of Pearl Habour. It is written from both theJapanese and American sides and is about the year leading up to the attack. It is not your usual book of war action like others I have read but rather one written about the military planning and diplomatic activities leading up to our country declaring war on Japan. It is fascinating to hear the names of those involved in the planning of the attack and to get inside their brains. On the other hand it is interesting to read of the differing views of the American key players with regard to our unpreparedness regarding Japan's intended aggression. If you are looking for fascinating historical behind the scenes reading this book gives one an up close and personal account of the key players of on both the Japanese and American sides of the event."}, {"review_sentiment": 5.0, "review_text": "AOK!"}, {"review_sentiment": 5.0, "review_text": "READ IT AND LEARN."}, {"review_sentiment": 4.0, "review_text": "very useful. i receive it very fast. EVERYTHING IS GREAT. Great looking product, beautifully crafted. Very sharp, good weight, incredible price!  just buy one for myself,"}, {"review_sentiment": 4.0, "review_text": "I had read Prange's book some years ago and am delighted to make myself acquainted with it once more. This book takes an exhaustive and thorough look at the factors that led to the outbreak of WWII and explains the human failings associated with it. A very enjoyable read."}]}, "authors": ["Gordon W. Prange"], "isbn": "0140157344", "longitude": -157.8556764, "periods": ["1900s"], "title": "At Dawn We Slept: The Untold Story of Pearl Harbor", "word_cloud": "mark marathon session tablet put want write review remarkable achievement contains detail project great write author really bring personality great piece really stand way simultaneously track development move back forth japanese officer politician american counterpart small circle colleague start get serious seemingly impossible dream surprise attack keep ponder negotiation break idea sort attack bring frustration typical likely feel understate detailed examination japanese plan good want learn operation also coolly objective simply good case study people turn problem opportunity look almost angle contrast japanese buy chance answer question japanese realize possible sunken ship simply repaired sent fight cost try ship shallow water repair facility right instead intent purpose bottomless sure yamamoto consider especially shallow present problem japanese torpedo author disappoint show couple place narrative issue vex japanese officer particular hop ship much deeper far away include planning disappointed morning reconnaissance discover nothing plan disappointment shallow water mission merely sink battleship hope repair important distinction affect detailed instruction give read japanese side frustration mirror reading american side even acknowledge explicitly operation tactic war certainly something japanese worry seemed answer diplomat seem honestly try peace voice frustration government military insistence imperialist adventure big fan history particular history go look start search hear history event review guide keep bring back definitive study event take serve serve military historical service personally conduct numerous interview japanese leader involve event personal knowledge equal produce died see publish impressive amazingly detailed history event write style lucid readable make tomb accessible however beefy exhaustive understand student range also history professor edit text page stand today infinite credit drill amazing current japanese leadership journey decide attack thumbnail conceive pushed plan well known political gyration superficial knowledge fascinate grant long journey ultimate consensus attack take page page attack take place page get detailed look cadre japanese american leader drive help shape event core shed light improbable success brazen plan also american force political leader fail connect dot execute basic sound defensive tactic solid job bring life attack deliberate historian acknowledge many official report militarizes fraught contradiction dutifully report confirm stray representation substantiate leave combat portion pal comparison heft step lead battle onerous post event second guessing american force impressive history heft make daunt faint heart want quality overview event want highly detailed unpack shock event change course nation strike pay dirt detail report attack hard someone research lot historical detail recommend need type information excellent author top field depth history action lack thereof lead name date think side incredible interesting account event lead bomb write the japanese side year lead attack usual war action others rather write military planning diplomatic activity lead country declare war fascinate hear name involve plan attack get brain hand interest differ view american key player regard regard intend aggression look fascinate historical scene read give close personal account key player japanese american side event oak useful receive fast everything look product beautifully craft very sharp good weight incredible price range year ago delight make acquaint take exhaustive thorough look factor lead outbreak explain human failing associate enjoyable", "genres": ["History", "WWII"], "summary": "At 7:53 a.m., December 7, 1941, America's national consciousness and confidence were rocked as the first wave of Japanese warplanes took aim at the U.S. Naval fleet stationed at Pearl Harbor. \r\n\r\nAs intense and absorbing as a suspense novel, At Dawn We Slept is the unparalleled and exhaustive account of the Japanese bombing of Pearl Harbor. It is widely regarded as the definitive assessment of the events surrounding one of the most daring and brilliant naval operations of all time. \r\n\r\nThrough extensive research and interviews with American and Japanese leaders, Gordon W. Prange has written a remarkable historical account of the assault that-sixty years later-America cannot forget.\r\n\r\n\"Prange's exhaustive interviews of people on both sides enable him to tell the story in such personal terms that the reader is bound to feel its power....It is impossible to forget such an account.\" The New York Times", "asin": "0140157344", "rank": "77734", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51WiEDRiTIL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}