{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 23, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Bucky Wunderlick is that guy we should all probably hate. Wildly famous, filthy rich, Bucky is a rock star at the apex of his career.Until he walks out on all of it to live like a vagrant in a run down apartment in New York City.See, Bucky is bored. Of the music. The noise. The fame. Of himself. He knows neither who he really is, or even why he is that person.Take a slow, rambling and often surreal ride through the eyes of Bucky Wunderlick. Bored rock star. Philosopher. Accidental cartel middleman.Along the way, you'll discover that fame can come at a cost, that even the famous can experience existential crises and maybe even learn a thing or two about your own existence.Told from the first person perspective and in a rambling, near stream of consciousness manner reminiscent of Cormac McCarthy, Great Jones Street is as much a philosophical conversation with a novel protagonist as it is a novel.Highly recommended."}, {"review_sentiment": 5.0, "review_text": "DeLillo is in my top three list of living American novelists.  He describes the human condition from so many different perspectives.  There is always more than meets the narrative eye.  Few others delve deeper than pulp.  Longing and wishing for another time like Underworld.... love the challenge."}, {"review_sentiment": 5.0, "review_text": "Great Jones Street – Don DeLillo’s novel published as part of the 1980s Vintage Contemporaries series where a young rock-and-roll artist seals himself off in a Lower Manhattan down-and-out apartment. Well, there’s the occasional visit from his girlfriend and members of his rock group and hawkers connected with a Happy Valley Commune yammering about a future miracle drug, enough visits to keep his sharp edge very sharp and enough visits to possibly drive a crazy boy crazy.And here's our man, the one and only Bucky Wunderlick, musing on the mystical nature of his girlfriend and soulmate, the incomparable Opel: \"All she desired was the brute electricity of that sound. To forget everything. To be that sound. That was the only tide she heeded. She wanted to exist as music does, nowhere, beyond the maps of language.\" A batch of reasons why this novel by Don DeLillo is fab:THE BOX MAN, AMERICAN-STYLEWithin months of publication of “Great Jones Street” another new novel hit the shelves addressing many of the same themes: “The Box Man” by Nobel winning Japanese novelist, Kōbō Abe, where the nameless protagonist surrenders his previous identity and conventional routine to live in a large cardboard box he wears over his head. “Great Jones Street” and “The Box Man” – so into yourself, so “society get out of my face.” At one point in DeLillo’s novel, girlfriend Opel tells Bucky about a new underground counterculture group: “The return of the private man, according to them, is the only way to destroy the notion of mass man.” Oh, Opel. Oh, Bucky. Oh, Box Man. This is so 70s! Sidebar: I recall watching a 1970s newscast where a university student wore a black cloth over his head down to his shoes and walked around campus calling himself “the black bag.” Actually, I thought this guy really cool.POETRYAt one point, Bucky reflects: “Alone I lived in the emergency of minutes, in phases of dim compliance with the mind’s turning hand.” And here’s another of his rock-and-roll reveries: “Euphoric with morphine we’d be wheeled among them, noting proportions and contours, admiring the beauty of what we were.” It’s as if Bucky’s words could have been excerpts from Alan Ginsberg’s many page beatnik slam-poem “Howl.” And there are numerous other such Bucky rant-lines for fans of DeLillo’s poetic, philosophic prose.THE WRITER IN THE APARTMENT ABOVE“Some writers presume to be men of letters. I’m a man of numbers.” So says the novelist, essayist, poet, short story writer Fenig, who lives in the apartment on Great Jones Street right above Bucky and who is a writer obsessed with seeking fame and knowing the ups and downs of the writer’s market better than a seasoned stock broker knows Wall Street. Don DeLillo, you sly dog, putting a writer who might be the shadow side of yourself in the apartment above your protagonist.ROCK-AND-ROLL, THE NEW MODERN ARTIn an interview, Bucky pontificates how when people read a book or look at a painting, they just sit there or stand there, but through his music, he makes people move. WOW! The one and only Bucky Wunderlick, shining star, prime mover, kinesthetic force, creator of a new political-erotic-mystical art form that, as sculptor Claes Oldenburg insisted, does more than just sit on its ass in a museum.SOCIAL COMMENTARYAgain, Don DeLillo fans will not be disappointed since many are the zingers hurled at contemporary American society. For example, how TV programs are interrupted and announcers sound close to insanity, their voices soaring, as they report on the impending snowstorm: heavy snow, deep snow, drifting snow, big fluffy white flakes are falling and will continue to fall from the sky. (I myself am always both amused and amazed at the panic snow arouses in the media). And, again: Bucky has issues with his hard-earned money having to work . . . no, no, no, he did the work; he wants his money resting in nice big green stacks in some cool bank vault. He’s told in so many words: so sorry, Bucky, like it or not, your rich ass is tied into the American financial world!BUCKY’S MAGICAL MYSTERY TOURInserted into the first-person narrative is the Superslick Mind-Contracting Media Kit featuring “The Bucky Wunderlick Story” told in various news clips, song lyrics and Zen-like enigmatic responses to interviewers. All very fitting since Bucky’s words have that ring of rock-and-roll truth, when he states further on in the story, “Beauty is dangerous in narrow times, a knife in the slender neck of the rational man, and only those who live between the layers of these strange days can know its name and shape.” Yea, baby! Hearing such wisdom I have to ask: What’s the sound of one Bucky turning at thirty-three and a third, second cut, side one, third album?THE FIGURATIVE DEATH-IN-LIFE JOURNEYBucky wants us to know his solitary journey on Great Jones Street is only the literal way of looking at things. Figuratively, he tells us, he lived in a remote monastery with the lamas of Tibet, being guided through the mysteries of the highest levels, the most esoteric planes of death. That’s what he came to know. Death-in-life.Oh, how cool is that! Thanks, Don D. You rock!"}, {"review_sentiment": 4.0, "review_text": "Wonderful book full as full of imagination and poetry as Dylan"}, {"review_sentiment": 1.0, "review_text": "A stream of verbal diarrhoea"}, {"review_sentiment": 2.0, "review_text": "Very odd book, I was looking for fine arts stories with regard to Jones street."}, {"review_sentiment": 3.0, "review_text": "I have read five DeLillo books (six counting Underworld which I'm reading now) and this was my least favorite.  The story is about a leader of a rock & roll band who walks away from a concert tour and returns to his shabby apt in NYC (the Great Jones St area).  There are some interesting characters, drugs, record executives, girlfriends etc but the whole thing did not really come together for me.  I recall reading that DeLillo refers to writing as intense thinking but this book does not include his better thinking in my view.  However, he's a heck of a thinker and a writer with great insights on the state of our culture.  If you have not read any of DeLillo's works then please do, he's an American talent.  An Italian-American lad from the Bronx."}, {"review_sentiment": 5.0, "review_text": "Rock and roll and nihlism never made so much sense."}, {"review_sentiment": 5.0, "review_text": "Rugged NYC tour de force."}, {"review_sentiment": 5.0, "review_text": "Bucky Wunderlick is the lead singer and song writer of a successful hard rock band. On tour, the burned-out Bucky realizes the band has reached the scary limit of its loud and raw sound and he suddenly drops out. Bucky then becomes the subject of bizarre rumors and bogus sightings while he lives on Great Jones Street, which, before the boom in New York City real estate, was grim and seedy. This Bucky, who is wasted and drifting, has \"no intentions.\" But then Opel, his girlfriend, appears and forces him to address these questions: What do you do when something ends? How will you evolve?As a musician, Bucky finally decides he \"needed a route back\". But will his route back resemble that of his band mate Azarian, who evolves and affirms his own musicality in soul music? Or will Bucky's route back follow the vision of Globke, his agent, who has brilliant ideas about promoting Bucky's celebrity and is indifferent to his music. Or will Bucky follow the path of the musician Watney, who realized his own mediocrity and evolved through business? Or, will Bucky find a musical equivalent of Fenig, his upstairs neighbor, who is a writer seeking success through the exploitation of market niches?In offering these alternatives to Bucky, DeLillo also begins in a very dark space. In particular, all these options for Bucky's personal evolution are opposed by the sinister Happy Valley Farm Commune. This sees Bucky's musical withdrawal as a principled stand for independence and privacy. Happy Valley, by the way, apparently has two factions, one of them nihilistic and violent as it enforces its beliefs.As Bucky is exposed to these musical possibilities, he also becomes a passive participant in a dangerous drug deal. In this case, Opel, Azarian, and Watney each seek to acquire a \"package\" that Bucky keeps in his living room and that contains the ultimate recreational drug. The drug, which is the property of the Happy Valley Farm Commune, is also a matter of interest to the drug legend Dr. Pepper, who makes several wildly entertaining appearances in GJS. My favorite occurs in Chapter 18, where Dr. Pepper explains that he wants the package since he, like everyone else in GREAT JONES STREET, is trying to evolve. In this case, Dr. Pepper wants to make the package his platform for a final creative and professional breakthrough.GJS is my eleventh DeLillo novel. IMO, GJS is a superb effort that showcases the great Don's glittering and terse prose, hilarious and insightful associations, and his unmistakable and inimitable voice. But unlike many of DeLillo's later novels, GJS has a protagonist who, while on the fringe, has not fully dropped out. This is quite different from Falling Man: A Novel,Point Omega: A Novel, and The Body Artist: A Novel, where much of the tension exists in a protagonist's familiar marginality and creepy normalcy.  Don, BTW, solves the issue of the ultimately eloquent Bucky's marginality in a surprising and perfect last chapter.This is an excellent and highly entertaining novel and is highly recommended."}]}, "authors": ["Don DeLillo"], "isbn": "0140179178", "longitude": 0.0, "periods": ["1900s"], "title": "Great Jones Street", "word_cloud": "guy probably hate wildly famous filthy rich rock star apex walk live vagrant run apartment bore music noise fame know really even ramble often surreal eye rock star cartel way discover fame come cost even famous experience existential crisis maybe even learn thing first person perspective rambling stream consciousness manner reminiscent much philosophical conversation protagonist recommend top list live american novelist describe human condition many different perspective always meet narrative eye others delve deeper pulp long wish time love challenge publish part series young artist seal apartment occasional visit girlfriend member rock group hawker connect happy yammer future miracle drug enough visit sharp edge sharp enough visit possibly drive crazy boy man muse mystical nature girlfriend soulmate incomparable desire brute electricity sound everything tide heed want exist music nowhere map language batch reason fab month publication new hit shelf address many theme win japanese novelist nameless protagonist surrender previous identity conventional routine live large cardboard box wear head society get point girlfriend tell new underground counterculture group return private man accord way destroy notion mass recall watch newscast university student wear black cloth head shoe walk campus call black think guy really point reflect live emergency minute phase dim compliance mind turning revery morphine wheel noting proportion contour admire beauty word many page beatnik numerous fan poetic philosophic writer presume men letter man say novelist essayist poet short story writer live apartment right writer obsess seek fame know ups down writer market better seasoned stock broker know sly dog put writer side apartment interview pontificate people look paint sit stand music make people move shin star prime mover anesthetic force creator new art form sculptor insist sit as fan disappoint many zinger hurl contemporary american society example tv program interrupt announcer sound close insanity voice soar report impend snowstorm heavy snow deep snow drift snow big fluffy white flake fall continue fall sky always amuse amazed panic snow arouse medium issue money work work want money rest nice big green stack cool bank vault tell many word sorry rich as tie american financial world narrative feature tell various news clip song lyric enigmatic response interviewer fitting word ring truth state story dangerous narrow time knife slender neck rational man live layer strange day know name baby wisdom ask sound turn third second cut side third album want know solitary journey literal way look thing figuratively tell live remote monastery lama guide mystery highest level esoteric plane death come know cool rock wonderful full full imagination poetry stream verbal diarrhea very odd look fine art story regard count read least favorite story leader rock roll band walk away concert tour return shabby apt area interesting character drug record executive girlfriends etc whole thing really together recall read refers write intense think include better think view however heck thinker writer insight state culture work please talent lad roll nihilism never make much sense rugged force lead singer song writer successful hard rock band tour realize band reach scary limit loud raw sound suddenly drop becomes subject bizarre rumor bogus sighting live boom real estate grim seedy waste drift intention girlfriend appear force address question something end evolve musician finally decide need route back route back resemble band mate azarian evolve affirms musicality soul music route back follow vision agent brilliant idea promote celebrity indifferent music follow path musician realize mediocrity evolve business find musical equivalent neighbor writer seek success exploitation market niche offer alternative also begin dark space particular option personal evolution oppose sinister see musical withdrawal principled stand independence privacy happy way apparently faction nihilistic violent enforces expose musical possibility also becomes passive participant dangerous drug deal case seek package keep living room contains ultimate recreational drug drug property also matter interest drug legend make several wildly entertaining appearance favorite occurs explain want package everyone else try evolve case want package final creative professional eleventh superb effort showcases glitter terse prose hilarious insightful association unmistakable inimitable voice many later novel protagonist fringe fully drop quite different fall man much tension exist protagonist familiar marginalia creepy normalcy solve issue ultimately eloquent marginalia surprise perfect last excellent highly entertain highly recommend", "genres": ["Fiction & Literature"], "summary": "Bucky Wunderlick, rock star and budding messiah, has hit a spiritual wall. In mid-tour he bolts fromhis band to hole up in a dingy East Village apartment and separate himself from the paranoid machine that propels the culture he has helped create. As faithful fans await messages, Bucky encounters every sort of roiling farce he is trying to escape. \r\n\r\nA penetrating look at rock and roll's merger of art, commerce and urban decay, Great Jones Street \"reflects our era's nighmares and hallucinations with all appropriate lurid, tawdry shades\"", "asin": "0140179178", "rank": "340049", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51w9QFFWDuL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}