{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 64.145981, "ratings": {"num_ratings": 78, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Very good interpretation, and very interesting!!!"}, {"review_sentiment": 5.0, "review_text": "Fun and easy to read!"}, {"review_sentiment": 4.0, "review_text": "I found out that I had some Scandinavian ancestry after doing my DNA and I got this book as a gift to help me learn a little bit more about the mythology and some of the sagas.  I found it very interesting and though sometimes I stumbled over some of the names, I had a hard time putting it down.  And I also found some similarities from my german roots, especially as it relates to some family names.  Lets just say they were a bloody bunch but I already have another book lined up to help me shed more light on it."}, {"review_sentiment": 5.0, "review_text": "The translated saga itself is quite brief - maybe not even half of this thin volume. Still, this comfortable translation brings to life the jealousies, adventure, and tragedy in this story. More than that, it brings to life the elements of myth and legend that separate this from the more historical kinds of sagas. I found the explanatory footnotes and commentary helpful, too - they tie this to other sagas, through the characters shared across story lines, and even to Wagner's Ring cycle. Wagner mixed threads from other myths into his operas, but you'll recognize many of the characters and plot devices here.I'm certainly no Norse scholar, but I've enjoyed a number of the sagas. Things like this keep me coming back for more.-- wiredweird"}, {"review_sentiment": 1.0, "review_text": "I realize that this is a translation of historical sagas and legends, but it reads like stereo instructions. I am a huge fan of Viking and Nordic history and mythology, but this was so dry as to be unreadable."}, {"review_sentiment": 5.0, "review_text": "Excellent book for Vikings fans. The story of the family of Aslaug."}, {"review_sentiment": 5.0, "review_text": "Great translation, easy to read."}, {"review_sentiment": 5.0, "review_text": "Yes!  But I shall wait for further comment until I actually use this book in class."}, {"review_sentiment": 5.0, "review_text": "Great experience!"}, {"review_sentiment": 5.0, "review_text": "This was super entertaining. I though is was easy to read, and it helps take you into the old mindset. This was a saga that lasted through centuries, these were traits that they found commendable, or such as oath breaking despicable."}]}, "authors": ["Jesse L. Byock", "Anonymous"], "isbn": "0140447385", "longitude": -21.9422367, "periods": ["0-500s"], "title": "The Saga of the Volsungs", "word_cloud": "very good interpretation interest easy find scandinavian ancestry dna get gift help little bit mythology saga find interest sometimes stumble name hard time put also find similarity german root especially relate family name let say bloody bunch already line help shed light translated quite brief maybe even half thin volume still comfortable translation bring life jealousy adventure tragedy story more brings life element myth legend separate historical kind sagas find explanatory footnote commentary helpful tie saga character share story line even cycle mixed thread myth operas many character plot device certainly scholar enjoy number saga thing keep come back wired weird realize translation historical saga legends read stereo instruction huge fan viking history mythology dry unreadable excellent viking fan story family translation easy comment actually use class great experience super entertaining easy help old mindset last century trait find commendable oath breaking despicable", "genres": ["History", "Ancient Civilizations"], "summary": "One of the great books of world literature--an unforgettable tale of jealousy, unrequited love, greed, and vengeance.\r\nBased on Viking Age poems and composed in thirteenth-century Iceland, The Saga of the Volsungs combines mythology, legend, and sheer human drama in telling of the heroic deeds of Sigurd the dragon slayer, who acquires runic knowledge from one of Odin's Valkyries.\r\n\r\n Yet the saga is set in a very human world, incorporating oral memories of the fourth and fifth centuries, when Attila the Hun and other warriors fought on the northern frontiers of the Roman empire. \r\n\r\nIn his illuminating Introduction Jesse L. Byock links the historical Huns, Burgundians, and Goths with the extraordinary events of this Icelandic saga. With its ill-fated Rhinegold, the sword reforged, and the magic ring of power, the saga resembles the Nibelungenlied and has been a primary source for such fantasy writers as J. R. R. Tolkien and for Richard Wagner's Ring cycle.", "asin": "0140447385", "rank": "46088", "city": "Reykjavik", "image": "https://images-na.ssl-images-amazon.com/images/I/51VhUj-8UNL.jpg", "country": "Iceland", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}