{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 62, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Good book. I could put it down.... That being said it is taking me an inordinate amount of time to read it because I am not thrilled with reading it. I thought I would be. Maybe when I grow up...."}, {"review_sentiment": 4.0, "review_text": "As expected"}, {"review_sentiment": 5.0, "review_text": "One of the greatest war satires ever written, Hasek's work will stay with you long after you've finished the book."}, {"review_sentiment": 5.0, "review_text": "It's a Classic!  Exceptionally humorous if you've ever been in the military."}, {"review_sentiment": 5.0, "review_text": "Had to go to Amazon for this - couldn't find it in a bookstore.  Classic Eastern European dry wit and ironic fatalism . . . the perfect attitude for an unenthusiastic soldier marching off to a war he doesn't understand, doesn't care to be involved in, and has nothing to gain by participating - except maybe a marble headstone with his name on it, if even that.  If you appreciate Eastern European \"dark humor\" in the vein of Kundera, Wolfe, Gogol, or Bulgakov, you'll love this work.  The same can be said for Kurt Vonnegut's \"Slaughterhouse Five,\" Joseph Heller's \"Catch-22,\" or Mark Twain's hilarious short story \"A History of a Campaign that Failed\" . . . appreciate the ironic, \"dark humor\" of these works, get \"The Good Soldier Svejk.\"  Highly recommended by this ex-professor of English and lover of sarcastic, raucous, and irreverent literature."}, {"review_sentiment": 4.0, "review_text": "700 pages of bliss"}, {"review_sentiment": 5.0, "review_text": "Very good buy and prompt delivery.  This humorous and poignant novel is worthy of a high place in world lit."}, {"review_sentiment": 3.0, "review_text": "Supposedly this book influenced Catch22, I didn't see that, but Heller said it did.  The story mirrors the hurry up and wait every soldier experiences and the clueless officers that lead them. It's a entertaining read."}, {"review_sentiment": 1.0, "review_text": "Nothing is sadder that humour that is not amusing.Perhaps due to loss in translation, this applies to this rather pathetic work.Here, characters are shallow and predictable and the plot is just non-existent, short vignettes following each other aimlessly, presumably in order to provide comic effect.This is not in any way successful but proves rather irritating.Although some may see the whole work as an apt analogy to the absurdity of warfare, it is difficult to recommend to anyone to invest time and energy with it."}, {"review_sentiment": 5.0, "review_text": "A classic!"}]}, "authors": ["Jaroslav Hasek"], "isbn": "0140449914", "longitude": 14.4212535, "periods": ["1900s"], "title": "The Good Soldier Svejk: and His Fortunes in the World War", "word_cloud": "say take inordinate amount time thrill read think maybe grow expect greatest satires ever write work stay long finish exceptionally humorous ever military go bookstore classic eastern european dry wit ironic fatalism perfect attitude unenthusiastic march understand care involve nothing gain participate maybe marble headstone name even appreciate eastern european dark humor vein love work say hilarious short story fail appreciate ironic dark humor work recommend lover sarcastic raucous irreverent literature page bliss very buy prompt delivery humorous poignant worthy high place lit supposedly influence see say story mirror hurry wait experience clueless officer lead entertain nothing sadder humor due loss translation apply rather pathetic character shallow predictable plot short vignette follow aimlessly presumably order provide comic way successful prove rather whole work apt analogy absurdity warfare difficult recommend anyone invest time energy classic", "genres": ["Fiction & Literature", "WWI", "Satire"], "summary": "Jaroslav Hašek's black satire, the inspiration for such works as Joseph Heller's Catch-22\r\n\r\nGood-natured and garrulous, Švejk becomes the Austro-Hungarian army's most loyal Czech soldier when he is called up on the outbreak of the First World War - although his bumbling attempts to get to the front serve only to prevent him from reaching it. \r\n\r\nPlaying cards, getting drunk and becoming a general nuisance, the resourceful Švejk uses all his natural cunning and genial subterfuge to deal with the doctors, police, clergy and officers who chivvy him towards battle. The story of a 'little man' caught in a vast bureaucratic machine, The Good Soldier Švejk combines dazzling wordplay and piercing satire to create a hilariously subversive depiction of the futility of war. \r\n\r\nCecil Parrott's vibrant, unabridged and unbowdlerized translation is accompanied by an introduction discussing Hašek's turbulent life as an anarchist, communist and vagranty, and the Everyman character of Švejk. This edition also includes a guide to Czech names, maps and original illustrations by Josef Ladas.", "asin": "0140449914", "rank": "106015", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51OFFA1dZsL.jpg", "country": "Czechia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}