{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 2924, "rating": 4.6, "reviews": [{"review_sentiment": 2.0, "review_text": "Small print. Thick book."}, {"review_sentiment": 5.0, "review_text": "So much better than any movie adaptation could ever be. Dumas keeps the reader enthralled in the story, causing many a sleepless night as they become engrossed in the story and have to read just one more page"}, {"review_sentiment": 5.0, "review_text": "I'm not quite sure what first endeared this book to me and I have loved it since the first time I read it. A story of revenge and then self-discovery as Dantes realizes he cannot disguise himself enough to run from the internal torment and all the revenge in the world doesn't bring true peace and happiness. This is my first time reading the unabridged version - I was shocked to learn a year ago that the copy I had often read was abridged and oh how much it left out! Still my favorite!"}, {"review_sentiment": 5.0, "review_text": "It took me a long time to read this book, but by the end I felt like I knew the characters personally.  It proved hie satisfying it is to see scoundrels get there comeuppance."}, {"review_sentiment": 3.0, "review_text": "I must admit, I'm very choosy with books. While some classics are terribly dull, too philosophical, or pointless, this one is excellent. Its got action, adventure, romance, drama. Do yourself a favor and read this one. You'll love it"}, {"review_sentiment": 5.0, "review_text": "Very well written classical novel"}, {"review_sentiment": 5.0, "review_text": "Excellent tale..inspired deeply...must read for all"}, {"review_sentiment": 5.0, "review_text": "This book is a classic literature must read. Each chapter is so vivid and poetically written. This e-version did have minor typos but it was easy enough to follow and I liked the reference points in this ebook for some things that the authored mentioned that the common reader may not understand."}, {"review_sentiment": 4.0, "review_text": "good"}, {"review_sentiment": 2.0, "review_text": "The book was hard to get into at first, then the drama set in and went more smoothly.  It was somewhat enjoyable, although the lead character had a God complex.  The leading character, the count, liked to be generous and he saved a nubian man from death and in return the man became his faithful servant, yet the \"benevolent\" count described him to another servant as a slave and lowlier than a dog and worthy of instant death if he should not serve the count properly.  Very distasteful, unapologetic racism it was, and the count seemed to be desperate to keep the servant's service who he was discussing that with, I don't know why.  Also, his relationship with the slave woman Haidee was negligible.  I'm certain he alluded to having relations with her when he first mentioned her but he called her his daughter later, and then sought romance with her.  In the end he didn't actually kill anyone with his own hand, even though he sought revenge, and he helped a young couple in love and he told the truth finally, but he was somewhat nuts.  The book was not exactly what I expected and quite long and written in an older style and could have been better without that one major flawed line, and his God complex (obviously called Monte CRISTO for a reason, but it was strange) and the revenge."}]}, "authors": ["Alexandre Dumas père"], "isbn": "0140449264", "longitude": 2.3514992, "periods": ["1800s"], "title": "The Count of Monte Cristo", "word_cloud": "small print so much better movie adaptation ever keep enthral story cause many sleepless night become engross story page quite sure first endear love first time a story revenge realize disguise enough run internal torment revenge world bring true peace happiness first time read unabridged version shock learn year copy often abridge oh much left still favorite take long time end felt know character personally prove hie satisfy see scoundrel get comeuppance choosy classic terribly dull philosophical pointless excellent got action adventure romance drama love very well write classical excellent deeply classic literature chapter vivid poetically write minor typo easy enough follow like reference point book thing author mentioned common good hard get first drama set go smoothly somewhat enjoyable lead character complex lead character like generous saved nubian man death return man become faithful servant yet benevolent describe servant slave lowlier dog worthy instant death serve properly very distasteful unapologetic racism seem desperate keep servant service discuss know also relationship slave woman negligible certain allude relation first mention call daughter later seek romance end actually anyone hand even sought revenge help young couple love tell truth finally somewhat nut exactly expect quite long write older style major flaw line complex obviously call reason strange revenge", "genres": ["Fiction & Literature"], "summary": "\"On what slender threads do life and fortune hang\"\r\n\r\nThrown in prison for a crime he has not committed, Edmond Dantes is confined to the grim fortress of If. There he learns of a great hoard of treasure hidden on the Isle of Monte Cristo and he becomes determined not only to escape, but also to unearth the treasure and use it to plot the destruction of the three men responsible for his incarceration. Dumas’ epic tale of suffering and retribution, inspired by a real-life case of wrongful imprisonment, was a huge popular success when it was first serialized in the 1840s.\r\n\r\nRobin Buss’s lively English translation is complete and unabridged, and remains faithful to the style of Dumas’s original. This edition includes an introduction, explanatory notes and suggestions for further reading.", "asin": "B00JDY7SQ8", "rank": "56557", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41vr2h-4wIL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}