{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": -37.8142176, "ratings": {"num_ratings": 10, "rating": 3.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Monkey Grip follows single mother Nora and her loving obsession with Javo, the heroin junkie. They and their friends drift through communal houses, mostly surviving on the dole and having sex whenever, and with whom ever, they please. This book, published in 1977, was very of its time – I imagine it caused a big stir, revealing as it did the reality of the life of junkies and scandalising people with its depiction of strong feminist views forbidding possessive personal relationships at a time when feminism had barely got into its stride.Nora wanders in and out of bed with Javo, looks after her daughter Gracie, swims in the Fitzroy pool and rides her bike all over inner Melbourne. But no matter how badly Javo behaves, stealing money from flatmates to fund his addiction, disappearing for months at a time, something always draws them back together, ‘and the harder they pull away from each other, the tighter the monkey grip’.The story is almost plotless, as the characters wander from one house, one party, one sexual encounter, to the next. One of the criticisms levelled at it at the time was that Garner had simply published her diaries. Later she admitted that much of the story had come from her diaries, which makes this book an incredible expose of her psyche at that time, but it doesn’t read like a diary, its better than that.  The minutae of everyday life that Garner portrays is really mesmerising and one of the great strengths of her writing, for me at least. I love her casual way with dialogue and how resolutely Australian everyone sounds. They go out the back to the dunny, they talk about people ‘giving them the s***’, and tell people to ‘get stuffed’.No wonder Australians identified with such local literature, which until then was almost non-existent.I suppose what I admire most about Garner’s skill is her ability to deliver a line of dialogue with some internal discourse attached to it, that perfectly conveys how the character is feeling in so few words. I just love the minimalism of it. One of the best lines for me is when Nora decides to move out from the house she shares with her friend Rita, and the man she reluctantly thinks of as her current squeeze, asks whether she feels guilty about leaving Rita and her daughter behind.‘If you can do it and not feel guilty about it, that’s really good. I’ve never done it, that’s all,’ he says.‘Done what?’ Nora asks.‘Walked out on someone who needed me.’And then Garner, sums up just how this affects Nora in just 12 perfect words, and no more:A great rush of distress and its protective accompaniment, anger, filled me.It may not seem like the most amazing line of prose, but to me its just perfect. I could read her all day.The concept of rebelling against monogamy is also interesting – when one of the women says the one thing you can’t do is take another woman’s man, they all glare at her as if she’s just suggested dropping the atomic bomb, and Nora wonders if they think that, then what have they ‘all been agonising about all this time?’ The conversation perfectly captures the problem with open relationships – its a good idea, but in reality, jealousy, possessiveness and love intrude and cause these women to be hurt, multiple times over, as they try to hide their pain from their men and each other.But eventually Nora and Javo’s dance around each other has to come to a head, and there’s a climax of sorts, but this isn’t the book to read if you need a classical plot and deft structure. Just read it to revel in the words, and the images, and the precise, evocative dialogue."}, {"review_sentiment": 2.0, "review_text": "Boring"}, {"review_sentiment": 4.0, "review_text": "Love a gritty book. One review talked about dysfunctional parenting but I saw it differently. It was a different time & different culture. I saw a great love story!"}, {"review_sentiment": 1.0, "review_text": "Load of nonsense. Nothing ever really happened. The same events kept happening over and over and no real ending was present."}, {"review_sentiment": 5.0, "review_text": "I love all her books, my favourite being The Spare Room.  She just has a wonderful way of describing things with not a wasted word."}, {"review_sentiment": 5.0, "review_text": "This is a novel for gaining insight into life on a number of levels- It portrays inner city life in Australia as it was in the 1970's in shared households- It shows what happens to addicted people and how their addictions can direct them to obviously self-destructive behaviour but their awareness of where they headed is not necessarily constructive. That is, those addicted to love, to drugs or to everything really are consumed by their addiction.Beautiful, clear writing which rewards a reader with new ideas at every successive reading.One of the most meaningful books this reviewer has embraced.James Pope"}, {"review_sentiment": 5.0, "review_text": "As an Australian living overseas one of the first things that I found attractive about this book was the manner in which Garner paints the suburban Australian landscape and lifestyle. The party scenes made me laugh out loud. I also enjoyed the realistic descriptions of shared houshold life. The troubled relationship which forms the central theme of the book rung true to me with its unresolved tensions, misunderstandings and developments. I very much enjoyed the rhythm and style of the dialogue and descriptions. In fact, I have marked many lines and quotes from my favorite parts so that I can find them to re-read again and again. I can see why other reviewers may have disliked this book for their own reasons. I vote it, however, as one of my favorite books of all time. This is my first review in Amazon, and I just felt drawn to writing something about this book in the hope that maybe some other readers around the world may find as much enjoyment in it as I did!"}, {"review_sentiment": 5.0, "review_text": "Maybe you have to be \"of a certain age\" and have lived through a certain time, with all its complexities, to appreciate this book.  There was a lot of high and low life in the counter-culture, a lot of confusion, but there were some wonderful experiences to be had as well.  I've read this book completely through about six times.  I think of it as an old friend with which I will never part.  I think her prose is breathtaking in its immediacy; it breathes life.  Some of her descriptions of what she sees/hears/observes are so amazingly wonderful that I stop every time I read them to savor them a while before moving on.  She is poetic in the true sense: not trying for an effect, but responding with her whole heart to a moment in such a way that your heart also is touched."}, {"review_sentiment": 3.0, "review_text": "Helen Garner is scarcely known outside of Australia, but in Melbourne she's been regarded as one of the finest writers of the past twenty years. After a brief, botched career as a high-school teacher she moved to the  skanky-bohemian areas of Carlton and Fitzroy near central Melbourne and  wrote for a publication called Digger. Apparently she was also working on a  novel during this time (1974-76). If Monkey Grip is not thinly disguised  autobiography then it is a masterful piece of mimesis. It reads like a  succession of arty, impressionistic, diary entries, mostly written on  bright mornings under the influence of a bad hangover.The story runs  like this: our protagonist, Nora, lives with a group of other bohemians and  their children in a succession of houses.  Occasionally she works on a  newspaper or chats about feminist issues at the pubs and cafes. She drifts  from one male lover to the next. A burnt-out young man named Javo takes her  fancy. We don't know what his game is precisely; he does a little acting, a  little writing, a little drawing. He also does a lot of smack. This upsets  Nora vaguely, but she doesn't mind so long as he's around for her. Javo,  you see, is great in bed. He goes away and gets himself arrested in  Bangkok. Nora pines for him. He returns and she is happy. He drifts away  again, returns, leaves, hangs around, quits heroin for a few days, shoots  up again. Sometimes they hitchhike to Sydney or visit Tasmania, where  Javo's mother lives. Nora gets a part in a film about junkies. Javo gets a  part in a play and another minor film. All the while they're surrounded by  dozens of interchangeable and unmemorable characters.Two things are  immediately apparent about this book: 1) an editor's blue pencil could have  improved it enormously by condensing the longeurs and repetitions; 2) the  panache of the book is pure old avant-garde from the Paris of the 20s and  30s. The plot is there but instead of being strung between the two ends of  the book it cycles over and over like the refrain of a song. If you want a  straightforward story, you'll find this novel extremely irritating.The  book was made into a film a few years ago. A friend in the Australian film  business gave me her copy after I'd returned from Melbourne (her own  hometown) and raved about what a swell place it was. A tiny smile played at  the corner of her mouth as she handed me the book. Was it all a great  leg-pull or was she was really curious to know what I'd think of this  dreary but fascinating little tome?"}, {"review_sentiment": 2.0, "review_text": "Written partly through the eyes of Helen herself (I assume ?), this story takes the reader on a ride through life, living in Melbourne Australia during the 1970's.  It presents the life of a girl and her infatuation  with a drug induced loser.  Throughout the entire book, I found myself just  waiting for her to come to her senses, and get her life back on track.  Unfortunately .. as is life I guess, she never does and the book just ends,  like it began with no real conclusions.  It left me personally with a  feeling of utter frustration."}]}, "authors": ["Helen Garner"], "isbn": "0140049533", "longitude": 144.9631608, "periods": ["1900s"], "title": "Monkey Grip", "word_cloud": "follow single mother love obsession heroin junkie friends drift communal house mostly survive dole sex ever published time imagine cause big stir revealing reality life junky scandalize people depiction strong feminist view forbid possessive personal relationship time feminism barely get wanders bed look daughter swim pool ride inner matter badly behaves steal money flatmate fund addiction disappear month time something always draw together harder away tighter story almost plot less character wander house party sexual encounter criticism level time simply publish diary admit much story come diary make incredible expose psyche time diary better minute everyday life portray really mesmerize great strength write least love casual way dialogue resolutely australian everyone sound go back sunny talk people give tell people get stuffed wonder identify local literature almost suppose admire skill ability deliver line dialogue internal discourse attach perfectly conveys character feeling word love minimalism best line decide move house share friend man reluctantly think current squeeze ask feel guilty leave daughter guilty really good never do walk someone need sum affect perfect word great rush distress protective accompaniment anger fill amazing line prose perfect rebel monogamy also interest woman say thing woman man glare suggest drop atomic bomb wonder think agonize time conversation perfectly capture problem open relationship good idea reality jealousy possessiveness intrude cause woman hurt multiple time try hide pain men eventually dance around come head climax sort need classical plot deft structure revel word image precise evocative dialogue bore gritty review talk dysfunctional parenting saw differently different time different culture saw great love story nonsense ever really happen event keep happen real end present love favorite wonderful way describe thing waste word gaining insight life number portray inner city life share show happen addicted people addiction direct obviously behavior awareness head necessarily constructive addict drug everything really consume clear writing reward new idea successive meaningful reviewer australian living overseas first thing find attractive manner paint suburban australian landscape lifestyle party scene make loud also enjoy realistic description share household life troubled relationship form central theme rung true unresolved tension misunderstanding development much enjoy rhythm style dialogue description fact mark many line quote favorite part find see reviewer reason vote however favorite time first review felt drawn write something hope maybe reader world much enjoyment maybe certain age live certain time complexity appreciate lot high low life lot confusion wonderful experience well completely time think old friend never part think prose breathtaking immediacy breathes life description amazingly wonderful stop time savor move poetic true sense try effect respond whole heart moment way heart also touch scarcely know regard finest writer past year brief botch career teacher move area central write publication call also work time thinly disguise autobiography masterful piece mime sis read succession arty impressionistic diary entry mostly write bright morning influence bad story run protagonist live group bohemians child succession house work newspaper chat feminist issue pubs male lover young man name take fancy know game precisely little acting little write little drawing also lot smack upset vaguely mind long see great bed go away get arrest pin return happy drift away return leaf hang quits heroin day shoot sometimes hitchhike visit mother live get part film junky get part play minor film surround dozen interchangeable unmemorable thing immediately apparent editor blue pencil enormously condense longueur repetition panache pure old plot instead string end cycle refrain song want straightforward story extremely make film year friend film business give copy return hometown rave swell place tiny smile play corner mouth hand great really curious know think dreary fascinating little tome partly eye assume story take ride life live present life girl infatuation drug induce loser entire find wait come sens get life back track life guess never end begin real conclusion leave personally feeling utter frustration", "genres": ["Fiction & Literature"], "summary": "Inner-suburban Melbourne in the 1970s: a world of communal living, drugs, music and love. In this acclaimed first novel, Helen Garner captures the fluid relationships of a community of friends who are living and loving in new ways.\r\n\r\nNora falls in love with Javo the junkie, and together they try to make sense of their lives and the choices they have made. But caught in an increasingly ambiguous relationship, they are unable to let go - and the harder they pull away from each other, the tighter the monkey grip.\r\n\r\n'A lyrical, rough-edged novel full of warmth and uncompromising feeling' The Sunday Age", "asin": "0140049533", "rank": "2466682", "city": "Melbourne", "image": "https://images-na.ssl-images-amazon.com/images/I/51xSy4BZmNL.jpg", "country": "Australia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}