{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 87, "rating": 3.4, "reviews": [{"review_sentiment": 2.0, "review_text": "The first half of this book (exactly to the kindle 50% mark) is borderline torture. I'm fairly well-rounded in literature and can appreciate good writing, but trying to parse what exactly the author is trying to convey is like pulling teeth. I found myself so disinterested at times that I would have a half-page of lucid daydreams of nothing in particular rather than ingest enormously complex sentences with no discernible point or even allusion. As a matter of principle, I soldiered through the entire book, and admittedly the second half of the book is on the whole more tolerable. The \"twist\" is laughable because due to changing social norms, it's hardly surprising, like seeing someone wince and cover their ears when someone says the word \"damn\".Give this one a hard pass."}, {"review_sentiment": 2.0, "review_text": "Too difficult to read and little or no storyline."}, {"review_sentiment": 2.0, "review_text": "A slog"}, {"review_sentiment": 2.0, "review_text": "This is the type of fiction that really does not translate into modern times. It is an excessively verbose treatment of a trivial conflict. James' skills at hooking words together must be appreciated, but the effort is not worth the payoff for this book, as is true for any of the James books that I have read."}, {"review_sentiment": 5.0, "review_text": "As far as this edition goes(The Everyman's Library), it's a beautiful choice. (My rating is based completely on this fact, and not the story, since I assume most people will be trying to decide which edition to buy, as opposed to my thoughts on the story.) The book itself is a burgundy color, with a black label and gold writing on the spine. The dust cover is lovely, and I much prefer having it on the book. The pages are on the thicker side, with a nice sized font. (I always worry about tiny writing that strains my eyes horribly, but there's no concern with this one, thankfully.) There's also a ribbon bookmark attached. So far, I've been super impressed with the Everyman's Library editions that I've got.As far as the story goes, in case anyone is curious, it's a bit over my head at this point in my life(to put it mildly). I admit that I struggle through many classics(and enjoy many, too), but the words in this book had such a hard time connecting with my brain. It drove me insane, even in little doses. It took an immense amount of focus for me to get through what I did. Maybe when my little guys are older, I can revisit this book and enjoy it better. For now, though, it's not for me."}, {"review_sentiment": 3.0, "review_text": "Slow read but good"}, {"review_sentiment": 4.0, "review_text": "It's nice to be able to easily pick up a classic book like this one discretely. So one may read it's contents after hearing it referenced by a colleague. I have yet to run into that colleague again to discuss the contents of said \"classic\", but I'm ready. Bring it. Amazon saves me yet again from my last quarter of the twentieth century somewhat shoddy eduction."}, {"review_sentiment": 5.0, "review_text": "55 year old Lambert Strether is on a quest. His \"fiance\", Mrs. Newsome, who happens to be rich if not beautiful, has given him the task of retrieving her wayward son Chad from the clutches of a femme fatale in Paris, France. It's an implied condition that if Strether cannot convince Chad to come home and take over the family business, there will be no marriage to Mrs. Newsome back in Massachusetts.Strether arrives in Paris thinking that he will find Chad debauched by women, wine, and song but is greatly surprised to find him flourishing and in fact improved from the shallow boy he once knew. He is more of a gentleman with a sophisticated mind and tastes. The harpy destroyer of his innocence, Madame de Vionnet,  turns out to be an elegant and charming woman who is currently separated from her husband. Strether can't figure out if Chad is in love with Vionnet our her young daughter, or if he is in love with neither.Ironically, the more time Strether spends in Paris hanging out with Chad and his coterie, the more Strether HIMSELF doesn't want to return home to the States! He begins to realize that he hasn't really ever had time to experience and enjoy life and maybe it's not to late to find a small bit of happiness in Paris among young minds and art.Henry James himself ranked this novel as his best so I thought it would be a great place to try reading his work for the first time. Unfortunately, this book is from his \"late period\" which means its language is a lot more convoluted and dense and can be a bit hard to understand coming into it unaware as I did. The experience to me was closest to reading Shakespeare for the first time.  At points all through this book I would read 2-3 pages and the realize that I had no idea what had just occurred. And I consider myself an above average reader. A casual reader would lose interest in this book in the first few pages. As you start reading you catch the broad strokes of the action and you have to use context clues not to infer meaning from individual words but whole sections of text.The great thing was that the more of the book you read, the more beautiful it becomes because your mind starts to get used to the style and is able to decode the meaning of the text. By the end of the book, the language and sentence construction no longer bothered me and I was able to greatly enjoy it.I would say the main conflict of the book is Strether's regret. The fact that at 55, he starts to question his life choices and for the first time, he begins to think about what he wants to do with his life. Fortunately for him, within the confines of this novel, he discovers that maybe he still has TIME to sort out his future. Does he want to go home and marry Mrs Newsome, does he want to stay in Paris and get together with one of the other women he has met, or does he want to stay single? He's ended up middle aged, repressed, depressed, and dull,  but at least the author gives Strether the opportunity to make something of his inner life even at this late stage in his life. You'll have to read the book to see if Strether seizes the opportunity he's been given."}, {"review_sentiment": 3.0, "review_text": "Honestly, it is not a book which I find easy to read and understand. Not formally trained in English literary studies, I have found Henry James's writing extremely hard to follow. The prose all along is long, discursive, distracting, like a mud trail that leads me into a big big forest. I have felt very lost sometimes, as the hint (I had thought it was) given by the author turned out leading me the other way. At 50% of the book, I thought there should be something creepy between Chad Newsome and Madame de Vionnet. At 60% of the book I found myself completely wrong footed.So, as a book worm, this book is so challenging. And, compared to great authors about the times like Charles Dickens, Henry James's plot is more adaptable to what city people think at our times, 21st century.Not bad. But it will take you a lot of time, thought and energy once you pick up."}, {"review_sentiment": 3.0, "review_text": "The story of an American in Europe is a recurring subject for Henry James, and this also has the main character--Strether- in London and Paris, where he encounters the stimulating experiences.  It is about the possibility of living the past, unlived life in a new, nourishing environment and the conflict when a selection has to be made ultimately.  Although I am again, amazed at the mastery of the author's writing, this book was very challenging to retain attention and focus which definitely is required to appreciate his type of writing.  Although, the plot and characters are simple, you definitely need enduring mental stamina to fully appreciate this book -over 400 pages of long, indirect, extremely refined sentences."}]}, "authors": ["Henry James"], "isbn": "0141441321", "longitude": 2.3514992, "periods": ["1800s"], "title": "The Ambassadors", "word_cloud": "first half exactly kindle mark borderline torture fairly literature appreciate good write try parse exactly author try convey pull teeth find disinterested time daydream nothing particular rather ingest enormously complex sentence discernible point even allusion matter principle soldier entire admittedly second half whole tolerable twist laughable due change social norm hardly surprise see someone wince cover ears someone say word damn hard pas difficult little story line slog type fiction really translate modern time excessively verbose treatment trivial conflict skills hook word together effort payoff true far edition go beautiful choice rating base completely fact story assume people try decide edition opposed thought story burgundy color black label gold write dust cover lovely much prefer page thicker side nice size font always worry tiny writing strain eye horribly concern thankfully also ribbon bookmark attach so far super impressed edition far story go case anyone curious bit head point life put mildly admit struggle many classic enjoy many word hard time connect brain drive insane even little dos take immense amount focus get maybe little guy older revisit enjoy better good nice able easily pick classic discretely hear referenced colleague yet run colleague discus content say classic ready save yet last quarter twentieth century somewhat shoddy seduction year old quest fiance happen rich beautiful give task retrieve wayward son clutch lemme fatal imply condition convince come home family business marriage back arrive think debauch woman wine song greatly surprised flourishing fact improve shallow boy know gentleman sophisticate mind taste harpy destroyer innocence turn elegant charm woman currently separate husband love young daughter love time spend hang coterie want return home state begin really ever time experience enjoy life maybe late find small bit happiness young mind rank best think great place try read work first time unfortunately late period mean language lot convolute dense bit hard understand come unaware experience closest reading first time point idea occur consider average casual interest first page start read catch broad stroke action context clue infer mean individual word whole section great thing beautiful becomes mind start get use style able decode mean text end language sentence construction longer bother able greatly main conflict regret fact start question life choice first time begin think want life fortunately confines discovers maybe still sort future home marry want stay together woman meet want stay single end middle age repress depressed dull least author give opportunity make something inner life even late stage life see stretcher seizes opportunity give honestly find easy understand not formally trained literary study find write extremely hard follow prose long discursive distract mud trail lead big big forest felt lose sometimes hint think give author turn leading way think something creepy find completely wrong worm challenging compare great author time plot adaptable city people think time bad lot time think energy pick story recur subject also main character encounter stimulate experience possibility live unloved life new nourish environment conflict selection make ultimately amaze mastery author write challenge retain attention focus definitely required appreciate type write plot character simple definitely need endure mental stamen fully appreciate page long indirect extremely refine sentence", "genres": ["Fiction & Literature"], "summary": "The greatest expression of his talent for witty, observant explorations of what it means to 'live well', Henry James's The Ambassadors is edited with an introduction and notes by Adrian Poole in Penguin Classics.\r\n\r\nConcerned that her son Chad may have become involved with a woman of dubious reputation, the formidable Mrs Newsome sends her 'ambassador' Strether from Massachusetts to Paris to extricate him. Strether's mission, however, is gradually undermined as he falls under the spell of the city and finds Chad refined rather than corrupted by its influence and that of his charming companion, Madame de Vionnet, and her daughter, Jeanne. As the summer wears on, Mrs Newsome concludes that she must send another envoy to confront the errant Chad - and a Strether whose view of the world has changed profoundly. One of the greatest of James's late works, The Ambassadors is a subtle and witty exploration of different responses to a European environment.", "asin": "0141441321", "rank": "95648", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41B2gokXxEL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}