{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 60.1674086, "ratings": {"num_ratings": 11, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "I bought this book to read, prior to watching the new movie version, which just came out. I have no ability to judge the quality of the translation from Finnish, but it seems to be well-written, with only a small number of odd turns of phrase.The book follows a contingent of soldiers as they man their machine guns in defense of the Finnish border against the Russians. The main characters are quite well-developed and I felt like I 'knew' them, their backgrounds, their motivations, and their feelings about being in the war. It is not much of a spoiler to reveal that some of them don't make it back, and I felt genuinely sad because they were so well-described by the author. Finally, the Finns had to deal with complex politics during that time; the Russians were their enemy, already having taken some of their land during the previous Winter War, so they were uneasy allies with the Germans, who obviously had questionable motives toward Finland.A fine addition to the, \"War is Hell\" genre."}, {"review_sentiment": 5.0, "review_text": "Top notch war novel"}, {"review_sentiment": 4.0, "review_text": "Very well written and well plotted. Death and destruction in a sort of matter of fact way. Frontline soldiers doing their job: killing the enemy. And when they are not killing, the boredom, the humor and the humanity of being in a war: grim, brutal, sad."}, {"review_sentiment": 5.0, "review_text": "Essential reading for any student of WWII. A view we rarely get."}, {"review_sentiment": 4.0, "review_text": "This is probably the most realistic, gruesome account of warfare I've read of.  And so sad.  The novel takes place in the Finnish Continuation War where the Finns have a tenuous alliance with Germany against the Soviet Union in order to win back territory lost to the Soviet Union in the Winter War.  Some of the characters seemed a bit more like \"charactures\" as from Dickens.  I enjoyed reading something different from a relatively unknown part of history."}, {"review_sentiment": 5.0, "review_text": "I have inherited this book in Finnish from my dad, who had fought in the Continuation War. My ability to read Finnish is very weak, so I purchased this English translation of it. As I understand Finnish, it took a while to get into the contrived accents. It worked at a certain level, especially with Rokka, perhaps not so much with the lisping Lt. Col. I think not rolling your rrr's would give a different sense than lisping. However, I think the accents were represented as well as they could. Overall, I enjoyed the book and the characters in it. I may give the Finnish version a stab now that I've read this."}, {"review_sentiment": 5.0, "review_text": "A high-quality printing worthy of a private library."}, {"review_sentiment": 5.0, "review_text": "Interesting story on what the Finns call the continuation war with the Soviet Union from 1941-1944. It is kind of a side bar conflict to the rest of World War II, but shows how the Finns fought the Soviet Union, and the real reactions Finnish Soldiers had to being in the war."}, {"review_sentiment": 5.0, "review_text": "Not finished reading yet."}, {"review_sentiment": 4.0, "review_text": "For persons who have Finnish ancestry, it is a very graphic depiction of how the Finns fought against the Russians who had taken much of the Finnish territory in the 1930's.  Many youngFinnish men lost their lives in a losing war, but they fought bravely against tremendous odds."}]}, "authors": ["Vaino Linna"], "isbn": "0141393653", "longitude": 24.9425683, "periods": ["1900s"], "title": "Unknown Soldiers", "word_cloud": "buy prior watch new movie version come ability judge quality translation seem small number odd turn follow contingent man machine gun defense finnish border main character quite felt background motivation feeling war much spoiler reveal make back felt genuinely sad author deal complex politics time enemy already take land previous uneasy ally obviously questionable motif fine addition genre top notch war very well write well plot destruction sort matter fact way job kill enemy kill boredom humor humanity war grim brutal sad essential reading student view rarely probably realistic gruesome account warfare take place finnish tenuous alliance order win back territory lose character seem bit charactures enjoy read something different relatively part history inherit finnish dad fought ability weak purchase english translation understand finnish take get contrive accent work certain level especially perhaps much lisp think roll err different sense lisp however think accent represent well enjoy character finnish version stab printing worthy private library interest story call continuation war kind side bar conflict rest show fight real reaction finnish war not finish reading yet person finnish ancestry graphic depiction fought take much finnish territory many young finnish men lose life lose war fight bravely tremendous odds", "genres": ["Fiction & Literature", "WWII"], "summary": "'There they stood, bumbling into lines with a bit of difficulty: Mother Finland's chosen sacrifice to world history' Unknown Soldiers follows the fates of a ramshackle troupe of machine-gunners in the Second World War, as they argue, joke, swear, cadge a loaf of bread or a cigarette, combat both boredom and horror in the swamps and pine forests - and discover that war will make or break them. \r\n\r\nOne of Finland's best-loved books, this gritty and unromantic depiction of battle honours the dogged determination of a country and the bonds of brotherhood forged between men at war, as they fight for their lives. 'A rediscovered classic... profound and enriching ... Unknown Soldiers still has the power to shock' Herald", "asin": "0141393653", "rank": "189938", "city": "Helsinki", "image": "https://images-na.ssl-images-amazon.com/images/I/41SZmiqfn-L.jpg", "country": "Finland", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}