{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 64.145981, "ratings": {"num_ratings": 122, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "\"The Sagas of the Icelanders\" is a very eventful and entertaining book. The entire book contains a collection of tales, known as sagas, that took place in Iceland during the age of the Vikings. The tales are told in prose, but are not difficult to interpret, and there is also a bit of poetry for you poetry lovers. Although, the tales do show a lot of heroic moments and times of vengeance, there is also a lot of character development and connections within characters that are seen through tales about love, honor, betrayal, exploration, marriage, and other real-life occurrences, that are similar to the same life issues we deal with today. However, at that time in Iceland, things were handled in a slightly different way, and that's also what makes the book so interesting. You will get a good glimpse on the organization of their social status, government, religion, and other early Viking traditions.As you read through the sagas, you will start to notice that most the characters are transitioning from childhood to adulthood. There are also some characters who are mentioned in more than one saga, due to the fact that the sagas originate from one area (Iceland). For example, some characters are married or related to other characters in different sagas, within the book. I would have to say that is one thing that that makes the sagas somewhat confusing at times. Another thing that bothered me was the repetition of all the character names. Apparently, during the age of the Vikings, many people named their children after their relatives, so names are repeated entirely too much throughout the book. However, the good thing is, that the author constantly mentions nicknames and last names to help differentiate the characters, but I still think that it takes one to have some good memory to stay informed on what's taking place. I am not one who usually likes historical books or anything war-like, but this book is well worth exploring!"}, {"review_sentiment": 4.0, "review_text": "Gave this as a gift to a friend after we went to Iceland. He was delighted by it. Also, it was quite a bit cheaper on Amazon than it was in the Icelandic bookshop."}, {"review_sentiment": 5.0, "review_text": "LIKE AN OLD WHISKY"}, {"review_sentiment": 5.0, "review_text": "We came back from a week in Iceland and bought this book to learn more about the country. Love it."}, {"review_sentiment": 5.0, "review_text": "\"Like holding an ancient tome.\" Money well spent. A must-have for understanding European origins."}, {"review_sentiment": 4.0, "review_text": "Not your average read.  This book covers several sagas or histories of the icelandic people.  Enjoying it."}, {"review_sentiment": 5.0, "review_text": "Great condition."}, {"review_sentiment": 5.0, "review_text": "A wonderful compilation of Icelandic sagas.  Brings the Viking world alive!"}, {"review_sentiment": 5.0, "review_text": "A big book that should be on the shelves of every European."}, {"review_sentiment": 4.0, "review_text": "Think size of Norton Anthologies.i'm sure it's great. Tables full of this book at duty free in Reykjavik."}]}, "authors": null, "isbn": "0141000031", "longitude": -21.9422367, "periods": ["0-500s"], "title": "The Sagas of the Icelanders", "word_cloud": "eventful entertain entire contains collection tale know take place age vikings tale tell prose difficult interpret also bit poetry poetry lover tale show lot heroic moment time vengeance also lot character development connection character see tale honor betrayal exploration marriage occurrence similar life issue deal today however time thing handle slightly different way also make interest get good glimpse organization social status government religion early start notice character transition childhood adulthood also character mention saga due fact originate area example character marry related character different thing make somewhat confusing time thing bother repetition character name apparently age many people name child relatives name repeat entirely much however good thing author constantly mention nickname last name help character still think take good memory stay inform take place usually like historical anything well explore gift friend go delight also quite bit cheaper bookshop come back week buy learn country hold ancient tome well spend understanding european origin not cover several history icelandic people enjoy condition wonderful compilation world alive big shelf european size sure great full duty free", "genres": ["History", "Ancient Civilizations"], "summary": "A unique body of medieval literature, the Sagas rank with the world's greatest literary treasures--as epic as Homer, as deep in tragedy as Sophocles, as engagingly human as Shakespeare. Set around the turn of the last millennium, these stories depict with an astonishingly modern realism the lives and deeds of the Norse men and women who first settled Iceland and of their descendants, who ventured further west--to Greenland and, ultimately, the coast of North America itself.\r\n\r\nThe ten Sagas and seven shorter tales in this volume include the celebrated \"Vinland Sagas,\" which recount Leif Eiriksson's pioneering voyage to the New World and contain the oldest descriptions of the North American continent.\r\n\r\n\"One of the great marvels of World Literature.... This is a dream come true.\" Ted Hughes", "asin": "0141000031", "rank": "23704", "city": "Reykjavik", "image": "https://images-na.ssl-images-amazon.com/images/I/51HRX6rHOBL.jpg", "country": "Iceland", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}