{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 38, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "Dream-like French classic novel, less well known to English readers today.  A young man in a French village, wandering off the main roads, comes to a strange chateau in the forest and meets its mysterious inhabitants, including a beautiful girl.  He then spends years of his life trying to relocate the chateau and the girl and recapture his memories of them.  If it sounds as though it prefigures Proust--well, it does.Meaulnes is the protagonist and \"Le Grand Meaulnes\" means \"The Great Meaulnes.\"  Interestingly this was a favorite book of F. Scott Fitzgerald and gave him the idea for the title \"The Great Gatsby\"."}, {"review_sentiment": 5.0, "review_text": "The book is almost mystical, more like a voyage of the spirit than a conventional narrative. Beautiful and deeply moving"}, {"review_sentiment": 4.0, "review_text": "When we become adults we cross a threshold and forever after the world of the child is lost to us - indeed we try and block it out. Im not entirely sure how, but this book is incredibly evocative of that lost realm."}, {"review_sentiment": 5.0, "review_text": "Enchanting and unusual, this has become a new favorite for me."}, {"review_sentiment": 4.0, "review_text": "Weirdly mesmerizing."}, {"review_sentiment": 5.0, "review_text": "The language in this story is beautiful, as is the plot. Every sentence is elegant. So French! It is hard to believe that this book is not better known."}, {"review_sentiment": 4.0, "review_text": "I read the book and it was nicely written, however, it was not what I expected after reading the reviews and listening to npr talking about it. I thought it would be a different story. I do not know. It is still a very good read, but ....not for me."}, {"review_sentiment": 5.0, "review_text": "This is beautiful book with a deep meaning"}, {"review_sentiment": 5.0, "review_text": "In English, the meaning of the word disillusioned carries a subtly different meaning than it does in French. An English speaker who is disillusioned, say because of something they learned about someone they love, would at first feel disappointed but would eventually be relived to know the truth. A French speaker would also feel disappointment but instead of glad they now know the truth would wish they had never known it, they would wish to continue to be deceived and so use the word to convey that particular meaning. An English speaker, lacking a word for the feeling would say 'ignorance is bliss'.Yet aside from a subtlety of translation, this small novel from 100 years ago in France by a young man who died just a few months after the book was published in WW1, a war that disillusioned the entire world through its brutality, is immediately recognizable in what it is trying to say, even if our own vocabulary is limited. The story is quite simple: a young man comes to a small French village and happens upon a wedding party where he meets a young woman whom he falls in love with but because he doesn't remember how he came to the party is not able to find his way back to her and spends years obsessed with this love.Now it would seem at first that this is a very sentimental and nostalgic book, and in a way that's true, but it comes at sentiment and nostalgia from the opposite direction. This novel is a book about the danger of nostalgia, of not seeing the world for what it is, for failing, like Valentine later in the book, to accept what we've been given without making it into something it can never be. And the real danger is hurting someone you love because they are not what you wanted them to be - it's unfair to everyone.The novel is quite timely too because of the onset of the war after its publication. The world very definitely changed after WW1, and all preconceptions of how Europe thought wars were fought and how governments and civilizations should behave were destroyed in the trenches along the fronts and in the meat-grinders of mechanized battle. The world grew up after WW1 and there is no going back to the simpler time of the 19th century, a scene reenacted at the wedding party as the guests all wear costumes from the early part of that long ago time.Most striking, however, is the novel's beauty. The novel reads like an impressionistic painting, as if Monet were a writer describing his paintings. Schoolchildren playing in the snow, the drip of rain on a mans boot, the looming church, the old farmhouse, a young man with two small children sitting on his lap before a fireplace. And this language, this beautiful imagery works to not only draw you into the story, but also to return you to your own youth, to a time when everything was new, when all life was possibility and everyone you met was a potential friend.Remarkable that this novel was written by someone so young and it leaves you wondering what loss, what pain he may have endured to have created this work of art before being sent to die on some battlefield in France. Yet in a way we are returned to his youth through this book and so his youth is immortal, his young life is always preserved for us in a sort of soft amber.Le Grand Meaulnes, sometimes translated as 'The Big Meaulnes' or 'The Great Meaulnes' or 'The Magnificent Meaulnes', 'The Wanderer', 'The Lost Domain', or 'The Lost Estate' (my choice for best possible translation), is one of the most beautiful books I have ever read. The book is sad, and sometimes even a little uneven in the middle third of the book, but across time and across language it speaks to a feeling we all have that we wish we never really grew up to learn how the world, how other people, and how we really are."}, {"review_sentiment": 5.0, "review_text": "This is the most beautiful book  for me, somehow the lost past lingers around one while one is  reading it.Many times I had to stop reading because I wanted to cry, not because of what was said  but the way it was said evoked deep  emotions  in me.It is a very special book, but may be for an old person rather (I am over 70).A young person with no life experience might just get the story which is very good.Which is very mystical, but it has more layers then the story only?  A very subtle way implying things what one does not talk about.Gabriella Bollobas, sculptor"}]}, "authors": ["Henri Alain-Fournier"], "isbn": "0141441895", "longitude": 0.0, "periods": ["1900s"], "title": "The Lost Estate (Le Grand Meaulnes)", "word_cloud": "french classic le well know english reader today young man french village wander main road come strange chateau forest meet mysterious inhabitant include beautiful girl spend year life try relocate chateau girl recapture memory sound prefigures well protagonist mean favorite give idea title almost mystical voyage spirit conventional narrative deeply move become adult cross threshold forever world child indeed try block entirely sure incredibly evocative realm enchant unusual new favorite weirdly mesmerize language story beautiful plot sentence elegant french hard believe better know nicely write however expect read review listen talk think different story know still good beautiful deep meaning meaning word disillusion carry subtly different mean english speaker disillusion say something learn someone love feel disappoint eventually know truth french speaker also disappointment instead glad know truth never know continue deceive use word convey particular mean english speaker lack word feeling aside subtlety translation small year ago young man die month publish war disillusion entire world brutality immediately recognizable try even vocabulary limit story quite simple young man come small french village happen wed party meet young woman fall remember come party able find way back spend year obsess first sentimental nostalgic way true come sentiment nostalgia opposite direction danger see world fail later accept give make something never real danger hurt someone love want unfair quite timely onset war publication world definitely change preconception think war fought government civilization behave destroy trench front mechanized battle world grow go back simpler time century scene reenact wed party guest wear costume early part long ago strike however read impressionistic painting writer describe painting play snow drip rain man boot loom church old farmhouse young man small child sit lap fireplace language beautiful imagery work draw story also youth time everything new life possibility everyone meet potential write someone young leave wondering loss pain create work art send die battlefield way return youth youth immortal young life always preserve soft sometimes translate big choice best possible translation beautiful ever sad sometimes even little uneven middle third time language speaks feel wish never really grow learn world people really beautiful somehow past lingers reading time stop read want cry say way say evoked deep emotion special old person rather young person life experience story mystical layer story subtle way imply thing talk sculptor", "genres": ["Fiction & Literature"], "summary": "An unforgettable French masterpiece in the spirit of The Catcher in the Rye-in a dazzling new translation \r\n\r\nWhen Meaulnes first arrives in Sologne, everyone is captivated by his good looks, daring, and charisma. But when he attends a strange party at a mysterious house with a beautiful girl hidden inside, he is changed forever. Published here in the first new English translation since 1959, this evocative novel has at its center both a Peter Pan in provincial France-a kid who refuses to grow up-and a Parsifal, pursuing his love to the ends of the earth. Poised between youthful admiration and adult resignation, Alain- Fournier's narrator compellingly carries the reader through this indelible portrait of desperate friendship and vanished adolescence.", "asin": "0141441895", "rank": "177001", "city": "The Sologne", "image": "https://images-na.ssl-images-amazon.com/images/I/41S9Bi65jAL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}