{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 46.4846583, "ratings": {"num_ratings": 651, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "Good story"}, {"review_sentiment": 5.0, "review_text": "good book"}, {"review_sentiment": 5.0, "review_text": "Met expectations!"}, {"review_sentiment": 1.0, "review_text": "Didn't like it much"}, {"review_sentiment": 4.0, "review_text": "Heartbreaking, funny, sad, thrilling."}, {"review_sentiment": 2.0, "review_text": "This book is hard to follow and not funny at all.  The only thing I appreciated about it were the Halocast scenes."}, {"review_sentiment": 5.0, "review_text": "A journey of non-buddies spans two centuries in a small village. Magical realism infuses this tale of heritagel war, and grief."}, {"review_sentiment": 5.0, "review_text": "Excellent from start to finish."}, {"review_sentiment": 2.0, "review_text": "Extremely disappointing. I honestly cannot see how this book won the awards that it did. I happened to be reading it at the same time as Corelli's Mandolin -- what a contrast. The earlier book had characters I cared about and did a decent job at explaining what happened on a certain island in Greece in 1943. This book, by contrast, had characters I could not have cared less about, and as far as I can tell from online sources, does not even come close to telling us what really happened at Trochenbrod. (If you're interested, watch the indie documentary Lost Town - a far better use of your time)."}, {"review_sentiment": 4.0, "review_text": "This novel combines such disparate literary genres as the Shtetl Fairy Tale, Genealogy Tourism, Holocaust Novel, and Epistolary Novel into a concoction that somewhat overflows the cup of the author's talent. It’s ambitious, funny, said, digressive and at times riveting. I found the most successful parts of the novel the least gimmicky, when the overly-thought-out multiple-narrator structure faded into the background of actual stories and characters but there is a ton of Postmodern catnip in here if that’s what you like. Foer can be very experimental but he also knows his way around the traditionally pleasing fiction apparatus like the troublemaking comic sidekick dog, Sammy Davis, Junior, Junior."}]}, "authors": ["Jonathan Safran Foer"], "isbn": "0141008253", "longitude": 30.732564, "periods": ["1900s"], "title": "Everything is Illuminated", "word_cloud": "good story good expectation much heartbreaking funny sad thrilling hard follow funny thing appreciate scene journey span century small village magical realism infuses tale heritage war grief excellent start finish extremely disappointing honestly see award happen read time contrast earlier character care decent job explain happen certain island contrast character le far tell online source even come close tell really happen interested watch indie documentary far better use time combine disparate literary genre concoction somewhat overflow cup author talent ambitious funny say digressive time rivet find successful part least gimmicky structure fade background actual story character ton catnip experimental also know way traditionally please fiction apparatus trouble making comic sidekick dog", "genres": ["Fiction & Literature"], "summary": "Everything Is Illuminated is Jonathan Safran Foer's bestselling novel of a search for truth. (The inspiration for the Liev Schreiber film, starring Elijah Wood.) A young man arrives in the Ukraine, clutching in his hand a tattered photograph. He is searching for the woman who fifty years ago saved his grandfather from the Nazis. Unfortunately, he is aided in his quest by Alex, a translator with an uncanny ability to mangle English into bizarre new forms. \r\n\r\nA \"blind\" old man haunted by memories of the war; and an undersexed guide dog named Sammy Davis Jr, Jr. What they are looking for seems elusive -- a truth hidden behind veils of time, language and the horrors of war. What they find turns all their worlds upside down... \r\n\r\n\"One of the most impressive novel debuts of recent years.\" Joyce Carol Oates, The Times Literary Supplement", "asin": "0141008253", "rank": "48032", "city": "Odessa", "image": "https://images-na.ssl-images-amazon.com/images/I/610n7TnzwgL.jpg", "country": "Ukraine", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}