{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 133, "rating": 3.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 1.0, "review_text": "The quality of this product is very good, After I bought it and use, there no problems, I believe it is very durable.I often recommend friends to buy  This is a pretty cool product for a good price. I'm very pleased with this purchase.  Good value.  Seriously try it  A perfect solution  This is my second purchase, and I will surely purchase again!"}, {"review_sentiment": 1.0, "review_text": "This definitely serves its purpose.  Five star excellent  I definitely recommend this item.  Does exactly as hoped  Use this everyday, love it.  Highly recommend"}, {"review_sentiment": 3.0, "review_text": "It isn't really the kind of book I like. Written like other books of its era and genre, it does tend to go on and on. And on. A Reader's Digest version would be much better.However, you do feel for and with Maisie. She is a little girl that no one wants except one wizened old woman. No one wants her because, to a greater or lesser extent, she interferes with the various and divers sexual dalliances.Sad, but sadly, her plight is unremarkable."}, {"review_sentiment": 5.0, "review_text": "Henry James' story of a little girl who is shunted around, used by her parents as a bludgeoning tool, denied what's right for her years (academic and art education), and schooled instead in her adult friends' sexual soap operas, vile attitudes and standards of conduct, moved me greatly. It's been a long time since I felt so emotionally connected to my own extreme youth. The book caused me to reflect that perhaps this is at bottom how most children are reared - perhaps why the world is full of so many terrible people.Maisie's knowing plays out in several ways. I won't spoil it for you.I read a couple of James's novels in grad school; they did nothing for me. I think I wasn't mature enough for them. What Maisie Knew has made me a James fan, eager to re-read those two and more. By pure luck I've fallen into a Wings of the Dove reading group. It comes to me exactly at the right time. (less)"}, {"review_sentiment": 4.0, "review_text": "James's middle-period style is less complex than the prose of his 'major phase,' but still may be off-putting to those who want a crisply told tale.  But it is his style that makes for the richness of this narrative.  Imagine: he uses language appropriate to a mature, well educated, cultivated  adult, but limits his perceptions to those of which a girl of ten would be capable.  We see what she sees, and infer what she misses, as she is shunted back and forth as the result of an increasingly messy divorce.  Tender and heartbreaking, it is also artistically exhilarating."}, {"review_sentiment": 4.0, "review_text": "One of Henry James’s major themes in his novels is the foolishness of European and American aristocratic society of his time, circa 1900. His novel What Maisie Knew points up this theme almost without trying. Maisie is a precocious young child. When we meet her, very young, she is at the center of a court battle for custody. Each of her parents wants custody—not because they love their daughter, but, as in so many battles of this nature, they want supremacy. As a result, each is given six consecutive months a year with the child. Maisie grows, and as she does, she is introduced to her mother’s new husband and her father’s new wife. They, too, struggle for Maisie’s attention, but this time because they seem to care for her. Enter the mix is Maisie’s governess Mrs. Wix, who, too, cares for the girl. But the struggle for supremacy continues, and all of the adults are foolish indeed. The edition I read was created for the release of the 2013 film of the novel, a film whose setting has been updated to “today.” And that’s the beauty of this story: whether ancient times, the early 1900s, or the early twenty-first century, adults are going to be foolish and custody battles can get ugly. My only complaint is that I often got bogged down in the pronouns. When James said “she,” I often got confused as to which “she.” Was he referring to Maisie, the governess, the blood-mother, the step-mother? I found myself re-reading whole passages. Some will say that James strikes them as that way in all his novels: confusing and antiquated in his prose. But I’ve read nine or ten of his novels, and this is the only one I’ve gotten lost in. I love his writing. Yes, it is a style of another era, but his characters are rich and flawed and totally believable and his plots are engrossing and relatable."}, {"review_sentiment": 1.0, "review_text": "Although Henry James was a talented writer of classic literature, the plot advanced excruciating slowly."}, {"review_sentiment": 5.0, "review_text": "In “What Maisie Knew,” Henry James explores the dynamics of a very modern family from the point of view of young Maisie Farange, whose parents divorce amid accusations of infidelity and neglect. To survive in this environment, Maisie must negotiate new alliances and, at the same time, avoid taking sides as her parents, their respective lovers and even the nanny battle for supremacy.The novel – with its convoluted plot, profound psychological depth, and sentences that seem to run on for paragraphs -- sees James at his most “Jamesian,” for lack of a better word. This can be both good and bad. Readers who see this through, though, will be rewarded with an insightful and, ultimately, heartbreaking portrayal of how divorce affects one child in particular. Over a hundred years after its publication, “What Maisie Knew” stands the test of time and demonstrates that, when it comes to matters of the heart, people can be as cruel and calculated as ever.As the legal proceedings drag out, Maisie learns that she often plays an unwitting role as a pawn in her parents’ struggle for the upper hand. Or, as Maisie’s mother admits, “the day was at hand … when she should feel more delight in hurling Maisie at [her father] than in snatching her away … the real end of all their tugging would be that each parent would try to make the little girl a burden to the other.”"}, {"review_sentiment": 4.0, "review_text": "Great product, just as described."}]}, "authors": ["Henry James"], "isbn": "0141441372", "longitude": -0.12574, "periods": ["1800s"], "title": "What Maisie Knew", "word_cloud": "excellent quality product good buy use problem believe often recommend friend buy pretty cool product good price please purchase value perfect solution second purchase surely purchase definitely serve purpose star excellent definitely recommend item exactly hop everyday love recommend really kind like era genre tend version much little girl want wizened old woman one want greater lesser extent interfere various diver sexual sadly plight unremarkable story little girl shunt use parent bludgeon tool deny right year academic art education school instead adult friend sexual soap opera vile attitude standard conduct move greatly long time felt emotionally connect extreme youth caused reflect perhaps bottom child rear perhaps world full many terrible know play several way couple novel grad school nothing think mature enough make fan eager pure luck fall wing read group come exactly right time le style le complex prose phase still crisply told tale style make richness narrative use language appropriate mature well educate cultivate adult limit perception girl ten see see infer miss shunt back forth result increasingly messy divorce tender heartbreaking also artistically exhilarate major theme novel foolishness european aristocratic society time point theme almost try precocious young child meet young center court battle custody parent want love daughter many battle nature want supremacy result give consecutive month year child grow introduce mother new husband new wife struggle attention time seem care mix governess care girl struggle supremacy continue adult foolish indeed edition create release film film setting updated beauty story ancient time early early century adult go foolish custody battle get ugly complaint often get bogged pronoun say often get confuse refer governess find whole passage say strike way confuse antiquate prose ten novel get lose love write style era character rich flaw totally believable plot engross repeatable talented writer classic literature plot advance excruciate slowly explore dynamic modern family point view young parent divorce accusation infidelity neglect environment new alliance time take side parent respective lover even nanny battle convolute plot profound psychological depth sentence seem run paragraph see lack better word good bad reader see reward insightful ultimately heartbreaking portrayal divorce affect child particular year publication stand test time demonstrate come matter heart people cruel calculated legal proceeding drag learns often play unwitting role pawn parent struggle upper hand mother admits day hand delight hurl father snatch away real end tugging little girl burden product describe", "genres": ["Fiction & Literature"], "summary": "A new edition of the innovative, emotionally complex novel.\r\n\r\nAfter her parents’ bitter divorce, young Maisie Farange finds herself shuttled between her selfish mother and vain father, who value her only as a means for provoking each other. Maisie—solitary, observant, and wise beyond her years—is drawn into an increasingly entangled adult world of intrigue and sexual betrayal until she is finally compelled to choose her own future. \r\n\r\nPublished in 1897 as Henry James was experimenting with narrative technique and fascinated by the idea of the child’s-eye view, What Maisie Knew is a subtle yet devastating portrayal of an innocent adrift in a corrupt society.\r\n", "asin": "0141441372", "rank": "451307", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51PuyP7RTGL.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}