{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 394, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "303.  Vanity Fair by William Makepeace Thackeray (Novel-E Book-Fiction) 5* Originally “The Novel Without a Hero”, which more or less is about the gist of it, as even the character Colonel William Dobbin is not without some flaws.  The author certainly is a loquacious writer and no doubt his mind was muddled at times and certainly his pen hand cramped with the volume of pages of this work.  Published as a 19 volume series between 1847-1848, it's meant to reflect early 19th century society of England, told with wit and satire.  As the reader follows the lives of Amelia Sedley and Rebecca Sharp, we don't have to  wait long to determine each ladies character, Amelia being naïve and Rebecca unscrupulous and rather ruthless at times.  Their paths cross many times during the course of the narrative and not always in a good way.  I thought it was an excellent story and well written which I thoroughly enjoyed.  “Ah, Vanitas Vattatum! Which of us is happy in this world?  Which of us has his desire? Or, having it is satisfied? -come, children, let us shut up the box and the puppets, for our play is played out” William Makepeace Thackeray and thus ends Vanity Fair."}, {"review_sentiment": 1.0, "review_text": "This review is not for the contents. The font size of the text is super tiny and extremely difficult to read so buy any other edition but this! Btw, I can find no publisher or press information in the book."}, {"review_sentiment": 5.0, "review_text": "A strong woman who does what she has to in order to survive! She's not a shrinking Violet and doesn't let social expectations keep her from living a good life!"}, {"review_sentiment": 5.0, "review_text": "The book is *must-read*, and the audio narration is good.Everyone should know about Becky Sharp!"}, {"review_sentiment": 5.0, "review_text": "Love this story, love his writing. Pure brilliance. A lot of world & linguistic history is in this, & the critical edition is like getting a behind-the-scenes look."}, {"review_sentiment": 5.0, "review_text": "Having recently read Edward VII, etc. by Catherine Arnold, I was reminded so much about reading VANITY FAIR as a senior in high school; so, I decided to reread -- and finish -- VF this time.  Thackeray's complex writing style and the deep satire made the reading very difficult for a high schooler in the early 1960s.  However, the satire & comedic characters (and names) made this second reading a pleasure and fun, especially after my years of experience in the interim that included witnessing the final remnants of the British class system at work in the UK companies that I managed.  It's an academic read; but I recommend it..."}, {"review_sentiment": 5.0, "review_text": "During my misspent youth I avoided books like this like plague. James Bond anyone? Any way, I got old and started backtracking a little. Maybe a little more patient and a little more insightful. Wanted to see why classics became classics.Anyway, I really liked this book. Although obviously written a looong time ago, it has a certain modernity to it. For a buck on kindle, give it a try. You will need to stick with it for awhile before it starts picking up. Recommended."}, {"review_sentiment": 1.0, "review_text": "Works exactly as stated.  As soon as I started to use it, I like it.  They are trustworthy…  Yes but it's still perfect. thank you!  It does a fantastic job for being so well and so inexpensive  Product is as advertised works well"}, {"review_sentiment": 1.0, "review_text": "Works great.  Good deal! Recommend! it's really good  A happy shopping experience.  Nice item that works as advertised  Very good quality.  I bought these products for my girlfriend's birthday and she and I both were pleasantly surprised!So far I have been very fond of it, will recommend to me around the needs of people."}, {"review_sentiment": 5.0, "review_text": "A great English writer . The best book L ever read"}]}, "authors": ["William Makepeace Thackeray"], "isbn": "0141439831", "longitude": 2.3514992, "periods": ["1800s"], "title": "Vanity Fair", "word_cloud": "le gist even character flaw author certainly loquacious writer doubt mind muddle time certainly pen hand cramp volume page work publish volume series mean reflect early century society tell wit satire follow life wait long determine lady character nave unscrupulous rather ruthless time path cross many time course narrative always good way think excellent story well write thoroughly enjoy happy world desire satisfied child box puppet play play thus end review content font size text super tiny extremely difficult edition find publisher press information strong woman order survive shrink social expectation living good life audio narration know story love write brilliance lot world linguistic history critical edition get look have recently remind much read senior high school decide reread finish time complex writing style deep satire make read difficult high schooner early however satire comedic character name make second reading pleasure fun especially year experience interim include witness final remnant british class system work company manage academic recommend misspent youth avoid plague anyone way get old start backtrack little maybe little patient little insightful want see classic become really like obviously write looong time ago certain modernity buck kindle give try need stick awhile start pick recommend work exactly state soon start use yes still perfect fantastic job well inexpensive advertise work well work great good deal really good happy shopping experience item work advertise very good quality buy product girlfriend birthday pleasantly surprise so far fond recommend need people great english writer best l ever", "genres": ["Fiction & Literature"], "summary": "No one is better equipped in the struggle for wealth and worldly success than the alluring and ruthless Becky Sharp, who defies her impoverished background to clamber up the class ladder. Her sentimental companion Amelia, however, longs only for caddish soldier George. \r\n\r\nAs the two heroines make their way through the tawdry glamour of Regency society, battles—military and domestic—are fought, fortunes made and lost. The one steadfast and honourable figure in this corrupt world is Dobbin with his devotion to Amelia, bringing pathos and depth to Thackeray's gloriously satirical epic of love and social adventure. ", "asin": "0141439831", "rank": "387374", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/511Hb09XRqL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}