{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "very good"}, {"review_sentiment": 4.0, "review_text": "The background setting is Pearl Harbour 1941 just before the Japanese `sneak attack' and our main protagonist Sgt Milt Warden is thirsting after his commanding officer's sultry wife Karen. Milt is a man who gets straight to the point, and, barely into proceedings, he informs Karen: \"I want to go to bed with you.\" There is no beating about the bush when this author as he thrusts you into novel.This is what you get with this weighty piece of pre-WW2 account of barracks life in the United States. It is well written with a considerable cast of characters. The author gives attention to detail, as if you using a microscope. The reader is committed to a rather long and intense read - it is very easy for one to lose the various character threads and at times I found myself having to back track and re-read parts to just find my `footing', so to speak. I found it was worth the commitment to keep reading and rather rewarding. It is interesting to note that while the author does not breakdown fact from fiction a number of scenes, events if you will, did happen in real life and were experienced by him first hand."}]}, "authors": ["James Jones"], "isbn": "014139322X", "longitude": 0.0, "periods": null, "title": "From Here to Eternity", "word_cloud": "good background set japanese attack main protagonist thirst command officer sultry wife man get straight point barely proceed informs want bed beat bush author thrust get weighty piece account barrack life well write considerable cast character author give attention detail use microscope committed rather long intense easy lose various character thread time find back track part find speak find worth commitment read rather reward interesting note author fact fiction number scene event real life experience first hand", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "Book 1/3 in The World War II Trilogy \r\n\r\nJames Jones’s epic story of army life in the calm before Pearl Harbor—now with previously censored scenes and dialogue restored.\r\n\r\nAt the Pearl Harbor army base in 1941, Robert E. Lee Prewitt is Uncle Sam’s finest bugler. A career soldier with no patience for army politics, Prewitt becomes incensed when a commander’s favorite wins the title of First Bugler. His indignation results in a transfer to an infantry unit whose commander is less interested in preparing for war than he is in boxing. But when Prewitt refuses to join the company team, the commander and his sergeant decide to make the bugler’s life hell.\r\n\r\nAn American classic now available with scenes and dialogue considered unfit for publication in the 1950s, From Here to Eternity is a stirring picture of army life in the months leading up to the attack on Pearl Harbor.\r\n\r\n“A blockbuster of a book . . . raw and brutal and angry.” The New York Times", "asin": "014139322X", "rank": "2364386", "city": "", "image": "https://images-na.ssl-images-amazon.com/images/I/51pLkhAJ9sL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}