{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 107, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Brilliant book. Beautiful, charming, depressing, and contradictory. It's amazing."}, {"review_sentiment": 5.0, "review_text": "gifted this to someone. they loved it!!"}, {"review_sentiment": 4.0, "review_text": "There is a lot of good philosophy here.  But I also got the impression the author was suffering from depression.  At times, the book was quite maudlin, at others, brilliant."}, {"review_sentiment": 4.0, "review_text": "Very strange but quite compelling."}, {"review_sentiment": 5.0, "review_text": "Every page is a heartbreak."}, {"review_sentiment": 5.0, "review_text": "The man who claims to be nothing - says everything.  Beautifully written insightfully honest, revealing the hidden places of the soul. A continual existential crisis of a man who has no need to do anything about it except write."}, {"review_sentiment": 5.0, "review_text": "Some real pearls and insight into life from a different cultural perspective that eventually ties humanity together."}, {"review_sentiment": 4.0, "review_text": "I love the writing style and prose. It is very poetic and reads like a diary. My only problem is that the author bounces around from subject to subject, and sometimes seems to ramble in detail about something that is irrelevant. The style reminds me of Jean Paul Sartre's Nausea in that they both talk about the ill-feeling of existence. Still, this is worth reading for the poetic expression, even if it's not one of my favorite books."}, {"review_sentiment": 5.0, "review_text": "Truly one of a kind. Not for everyone of course, if you can dig some depressing almost lo-fi existential moaning, then this is your book. Some incredible insights and pretty good poetry as well. Can't recommend enough."}, {"review_sentiment": 5.0, "review_text": "Gift."}]}, "authors": ["Fernando Pessoa"], "isbn": "0141183047", "longitude": -9.1365061, "periods": ["1900s"], "title": "The Book of Disquiet", "word_cloud": "charm depress contradictory amaze gift someone love lot good philosophy also get impression author suffer depression time quite maudlin others brilliant very strange quite compel page heartbreak man claim nothing say everything write insight fully honest reveal hidden place soul continual existential crisis man need anything write real pearl insight life different cultural perspective eventually tie humanity together love write style poetic read diary problem author bounce subject subject sometimes seem ramble detail something irrelevant style remind talk existence still worth read poetic expression even favorite truly kind not everyone course dig depress almost existential moan incredible insight pretty good poetry well recommend enough gift", "genres": ["Fiction & Literature", "Poetry"], "summary": "Fernando Pessoa was many writers in one. He attributed his prolific writings to a wide range of alternate selves, each of which had a distinct biography, ideology. and horoscope. \r\n\r\nWhen he died in 935, Pessoa left behind a trunk filled with unfinished and unpublished writings, among which were the remarkable pages that make up his posthumous masterpiece, The Book of Disquiet, an astonishing work that, in George Steiner's words, \"gives to Lisbon the haunting spell of Joyce's Dublin or Kafka's Prague.\"\r\n\r\nPublished for the first time some fifty years after his death, this unique collection of short, aphoristic paragraphs comprises the \"autobiography\" of Bernardo Soares, one of Pessoa's alternate selves. \r\n\r\nPart intimate diary, part prose poetry, part descriptive narrative, captivatingly translated by Richard Zenith, The Book of Disquiet is one of the greatest works of the twentieth century.", "asin": "0141183047", "rank": "31717", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/51LH5Bmom2L.jpg", "country": "Portugal", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}