{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 1341, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Came in good condition"}, {"review_sentiment": 4.0, "review_text": "So funny!"}, {"review_sentiment": 5.0, "review_text": "This is such a beautiful book. I've had my original copy of Bridget Jones's Diary for years, but when I saw the Penguin Ink edition, I knew I had to upgrade. I absolutely love the artwork. The front is wonderful, as well as both inner flaps. I've read Bridget Jones's Diary multiple times over the years, and I've always loved it. I'm excited that next time I read it, it will be from this amazing edition."}, {"review_sentiment": 5.0, "review_text": "Love the movie loved the book more"}, {"review_sentiment": 2.0, "review_text": "The writing style was interesting but the subject matter was shallow! It's chic lit, but seriously, chics do have more going on in their brains than darling Bridget Jones seems to!"}, {"review_sentiment": 5.0, "review_text": "Hilarious. A quick read."}, {"review_sentiment": 5.0, "review_text": "Love Bridget and Mark Darcy...love the parallel with Pride & Prejudice."}, {"review_sentiment": 4.0, "review_text": "I enjoyed the diary style of the book. I like that Bridget was a mess, it made it very enjoyable."}, {"review_sentiment": 3.0, "review_text": "The book was entertaining and kept me interested. However the ending felt rushed and the \"romance\" was nonexistent. It's hard to believe that a guy falls in love with a woman that he's literally only spoken a few sentences to."}, {"review_sentiment": 5.0, "review_text": "Read it years ago and had me laughing out loud--my friend loves it now too."}]}, "authors": ["Helen Fielding"], "isbn": "0141000198", "longitude": -0.12574, "periods": ["1900s"], "title": "Bridget Jones's Diary", "word_cloud": "good condition so funny beautiful original copy year saw edition know upgrade absolutely love artwork front wonderful well inner flap multiple time year always love excite next time amazing edition movie love writing style interest subject matter shallow chic light seriously sics go brain darling seem quick parallel enjoy style like mess make enjoyable entertaining kept interested however end felt rushed romance nonexistent hard believe guy fall love woman literally spoken sentence year ago laugh loud friend love", "genres": ["Fiction & Literature", "Romance"], "summary": "Bridget Jones's Diary is a 1996 novel by Helen Fielding. Written in the form of a personal diary, the novel chronicles a year in the life of Bridget Jones, a thirty-something single working woman living in London. She writes about her career, self-image, vices, family, friends, and romantic relationships.\r\n\r\nA huge success in England, this marvelously funny debut novel had its genesis in a column Fielding writes for a London newspaper. It's the purported diary, complete with daily entries of calories consumed, cigarettes smoked, \"alcohol units\" imbibed and other unsuitable obsessions, of a year in the life of a bright London 30-something who deplores male \"fuckwittage\" while pining for a steady boyfriend.", "asin": "0141000198", "rank": "505603", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51dxeBM986L.jpg", "country": "England", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}