{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 202, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "The book was delivered in great condition. I was actually very impressed by the condition of he book."}, {"review_sentiment": 1.0, "review_text": "I couldn't get into it at all and did not enjoy it. Many others have raved about it but I didn't get the hype."}, {"review_sentiment": 4.0, "review_text": "I have to say Barbara is quite a character. She's crafting her story in more ways than one while the reader must powerlessly observe."}, {"review_sentiment": 5.0, "review_text": "Excellnt storytelling. Witty, malicious, funny, suspenseful - an adroit page turner."}, {"review_sentiment": 5.0, "review_text": "I am so happy when I find a book I Can't put down. I saw the movie which is also good.....well written"}, {"review_sentiment": 5.0, "review_text": "A simple if controversial story beautifully told with some gut wrenching raw emotions and observations.A married school teacher, Sheba, becomes obssessed with a pupil while an older, single school teacher becomes obssessed with Sheba to distract herself from her desperate loneliness."}, {"review_sentiment": 3.0, "review_text": "Though I found this book rather entertaining, it was not as good as the movie. The book was definitely written to a high school or local college level. You can feel the plot turns coming from 100 miles away. But it's fun light reading."}, {"review_sentiment": 5.0, "review_text": "Don't pick this one up thinking it's merely some scandalous and salacious student/teacher affair. It's so much more. This was a perversely fascinating and wickedly humorous study of predators and their prey. Granted, if you've already seen the 2006 film, you'll think it's mostly dark and creepy. The film was quite good and came to life with some amazing star power (Judi Dench and Cate Blanchett), but it never quite captures the pervading dark humor and depth of characterization in the book.The story is narrated by a very cynical and negative/judgmental Barbara Covett, an early 60's teacher of 35 yrs and very close to retirement. She's academically intelligent but has the emotional development of her young charges... not that they can see that. To the world she is mostly a stern and respectable ole spinster who knows her stuff. Her sexuality and sexual experience is unclear, lol. Socially, it doesn't appear she knows how to be in a relationship. But if you enter her lair, you're done. The mind games, the manipulations, the possessiveness... you're hers and there's no escape.Enter the lamb: Sheba Hart. The new and very pretty art teacher that staff and students alike are charmed by. And Barbara's new obsession. She's 42 yrs old and married to a much older man who's been her caretaker as she raised their children, but now she's ready to have her own career. As a new teacher in a rough school... the teens might think she's hot but they also walk all over her. Stressed and losing control, Sheba finds comfort and heavenly new discoveries about herself via a 15 yr old boy, Steven Connolly. Not quite the lamb in this scenario. Or is she?Once Barbara learns what Sheba is up to, she uses this as a source of power and manipulation over her. But who's really in control? This story has layers upon layers of power dynamics coming from different angles. You can't even underestimate the manipulations of a horny teenager looking for sex. The lions and lambs become a questionable thing throughout the story. I even had my moments of feeling sorry for pathetic and lonely old Barbara (and her cat), as twisted as she was. Jury is still out as to whether or not she is a dormant lesbian. Too many personality disorders to wade through, lol.These are not likable characters. A lot of the low ratings are from people just hating on these twisted characters and the horrible situations they create, lol. Though keep in mind that Barbara is not the most reliable narrator.  And it's hard to deny how excellent the writing is here. Really. Very engaging-- you'll fly through it. It actually renews my faith in first person point of view. I felt like I was in Barbara's mind and yet I also got a strong vision of secondary characters and anyone else she brought up. Beautifully descriptive stuff. I seriously kept looking at the back of my paperback to ensure that young and pretty picture of the author wasn't a scowling Judi Dench, lol... because man, did she nail Barbara, bigtime."}, {"review_sentiment": 3.0, "review_text": "An intriguing, undemanding read which I enjoyed. Narrated by teacher Barbara, a spinster approaching retirement, it tells the story of her colleague and friend Sheba. A married art teacher from a well-to-do background, the lovely Sheba seems to have the kind of charmed life the lonely Barbara can only dream of. But when she ill-advisedly begins an affair with a 15 year old boy from their school, things look set to change...There are moments of hilarity as Barbara relays Sheba's confidences to her; the way the 40 year old woman imbues her young lover's limited conversational abilities with romantic mystique. And as she describes daily life in a rough comprehensive one laughs out loud at times.But there is also sadness in the desperate loneliness of our narrator, and an ever-present threatening feeling, as she recalls previous 'difficulties' with friends who no longer feature in her life, shows jealousy over Sheba's other friends, and , most mystifying, is keeping a detailed set of notes on the whole incident, complete with timeline...Good entertainment, though I felt it fizzled out just a tad."}, {"review_sentiment": 5.0, "review_text": "What an amazing book!  This book actually tells 2 tales of two incredibly damaged women and beautifully intertwines them!  It would be difficult to provide much detail without ruining the experience but if you like very good mystery stories, this book gives you a two for the price of one experience!"}]}, "authors": ["Zoe Heller"], "isbn": "0141039957", "longitude": -0.12574, "periods": ["1900s"], "title": "Notes on a Scandal", "word_cloud": "delivered great condition actually impress condition enjoy many others rave get hype say quite character craft story way powerlessly storytelling malicious funny suspenseful adroit page turner happy find put saw movie also good write simple controversial story beautifully tell gut wrench raw emotion marry school teacher become obsess pupil older single school teacher becomes obsess distract desperate loneliness find rather entertaining good movie definitely write high school local college level feel plot turn come mile away fun light read think merely scandalous salacious affair much perversely fascinate wickedly humorous study predator prey grant already see film think mostly dark creepy film quite good come life amaze star power never quite capture pervade dark humor depth characterization story narrated cynical early teacher yr close retirement academically intelligent emotional development young charge see world mostly stern respectable ole spinster know stuff sexuality sexual experience unclear lo socially appear know relationship enter lair do mind game manipulation possessiveness lamb new pretty art teacher staff student alike charm new obsession yrs old married much older man caretaker raise child ready career new teacher rough school teen hot also walk stressed lose control find comfort heavenly new discovery yr old boy not quite lamb scenario once learn use source power manipulation really story layer layer power dynamic come different angle even manipulation teenager look sex lion lamb become questionable thing story even moment feel sorry pathetic lonely old cat twist still dormant lesbian many personality disorder wade likable character lot low rating people hat twisted character horrible situation create lo mind reliable narrator hard deny excellent write really very engage actually renew faith first person point view felt barbara mind yet also get strong vision secondary character anyone else bring descriptive stuff seriously keep look back paperback young pretty picture author scowl lo man nail big time intriguing undemanding enjoy teacher spinster approach retirement tell story colleague friend married art teacher background lovely seem kind charm life lonely dream begin affair year old boy school thing look set change moment hilarity relay confidence way year old woman imbue young lover limited conversational ability romantic mystique daily life comprehensive laugh loud also sadness desperate loneliness narrator threaten feel recall previous friend longer feature life show jealousy friend mystify keep detailed set whole incident complete timeline entertainment felt fizzle tad amaze actually tell tale incredibly damage woman beautifully intertwine difficult much detail ruin experience good mystery story give price experience", "genres": ["Fiction & Literature"], "summary": "Schoolteacher Barbara Covett has led a solitary life until Sheba Hart, the new art teacher at St. George's, befriends her. But even as their relationship develops, so too does another: Sheba has begun an illicit affair with an underage male student. \r\n\r\nWhen the scandal turns into a media circus, Barbara decides to write an account in her friend's defense--and ends up revealing not only Sheba's secrets, but also her own.", "asin": "B0092GEZF4", "rank": "871163", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51xs1NWnJoL.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}