{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 42, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Great novel. I don't usually read first person, but seeing as this is how the only novel by Rilke, I've made an exception"}, {"review_sentiment": 5.0, "review_text": "Good  book"}, {"review_sentiment": 5.0, "review_text": "Classic fiction from a poet that lived the life."}, {"review_sentiment": 5.0, "review_text": "One of the greatest books ever written."}, {"review_sentiment": 2.0, "review_text": "love Rilke but lost interest in this... probably my mood"}, {"review_sentiment": 4.0, "review_text": "The protagonist was a brat, but I enjoyed the book. Beautifully told story."}, {"review_sentiment": 4.0, "review_text": "This mArvelous book is not light reading but it is reading with great emotional rewards. It is a companion to the Stories of God, the book of Hours and The Sonnets of Orpheus. Rilke writes with a sincerity that many will find strange, from another, Almost forgotten place. He can tear at your heart, your eyes, your mind."}, {"review_sentiment": 5.0, "review_text": "This is an existentialist must read.Beautiful, sublime and painterly..."}, {"review_sentiment": 4.0, "review_text": "Malte Laurids Brigge is a queer fellow, indeed. Read his notebooks if you have a queer bent of mind, and if you can stomach drifting into the recesses of an uncanny consciousness, which delves into the mysterious peculiarity of life, the memories of childhood in an aristocratic Danish family, and all sorts of reflections which beget queer feelings in one's head. But I warn you! Malte is a queer fellow, and if you can't handle his queerness- at times he becomes so queer I have no idea what he's talking about!- then these notebooks will make you want to eat a hamburger in disgust. But my, what an eerie, wonderful mind he has!"}, {"review_sentiment": 4.0, "review_text": "This is a complicated work that operates on a number of levels. It's a vaguely autobiographical take on Rilke's brief time living in Pre-WWI Paris, it's also a contemplation on the sudden rise of urban life, of the anxiety of being one anonymous person living in a sea of anonymous people. Rilke juxtaposes the dreariness of modern city life with intense, haunted recollections about Laurids childhood in the Austro-Hungarian countryside, in a world where the effects of modernity have yet to really take hold and in which an almost suffocating sense of family life prevails. It's a beautifully written book which responds to the world with a dense, allusive sensibility that really pre-figures a lot of the big stylistic shifts that high-modernism would bring about just a few years later."}]}, "authors": ["Rainer Maria Rilke"], "isbn": "0141182210", "longitude": 2.3514992, "periods": ["1800s"], "title": "The Notebooks of Malte Laurids Brigge", "word_cloud": "usually first person see make exception good classic fiction poet live life greatest ever write lose interest probably mood protagonist brat enjoy tell story marvelous light read read great emotional reward companion hours write sincerity many find strange forgotten place tear heart eye mind existentialist painterly queer fellow indeed bent stomach drift recess uncanny consciousness delve mysterious peculiarity life memory childhood aristocratic family sort reflection beget queer feeling head warn queer fellow time become queer idea talk make want eat hamburger disgust eerie wonderful mind complicate work operate number level vaguely autobiographical brief time live also contemplation sudden rise urban life anxiety anonymous person live sea anonymous people juxtapose dreariness modern city life intense haunt recollection childhood countryside world effect modernity yet really hold almost suffocate sense family life prevail beautifully write respond world dense allusive sensibility really lot big stylistic shift year later", "genres": ["Fiction & Literature"], "summary": "A masterly new translation of one of the first great modernist novels \r\n\r\nIn the only novel by one of the German language's greatest poets, a young man named Malte Laurids Brigge lives in a cheap room in Paris while his belongings rot in storage. Every person he sees seems to carry their death with them, and with little but a library card to distinguish him from the city's untouchables, he thinks of the deaths, and ghosts, of his aristocratic family, of which he is the sole living descendant. Suffused with passages of lyrical brilliance, Rilke's semi-autobiographical novel is a moving and powerful coming-of-age story.", "asin": "0141182210", "rank": "362513", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51LsuQA90jL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}