{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 77, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Read it."}, {"review_sentiment": 5.0, "review_text": "\"Alone in Berlin\" is book which Hans Fallada seemingly wrote extremely quickly, getting it done in a matter of mere weeks.  Yet it is also a book where he takes his time, his descriptions are detailed and nothing is rushed.  Fallada wanted to make sure his readers got the whole story and were able to soak up the reality of life in Nazi controlled Berlin, in all its frightening details.  It is the contrast between the small handful of individuals, determined to challenge Nazi accounts of the war in the smallest, but most immediate way they can think of to get around blanket control versus the weight of the Nazi state marshalled against them that will remain in this reader's mind for a long, long time.  Small, indeed petty really, as their contribution of handwritten protest postcards was, it took enormous courage and the couple saw it through to the end, with dignity and courage.  Good people brave enough to confront a totalitarian system, enforced by petty criminals and thugs.  Yet many were prepared to give their lives to challenge the regime of terror and they should never be forgotten."}, {"review_sentiment": 5.0, "review_text": "Anna and Otto Quangel lost their only son when Germany invaded France in WWII. They did not wish to sit by without resisting the increasingly barbaric nazi policies, so they devised a form of quiet resistance, which simply entailed printing postcards critical of their regime, and leaving them in busy places. The danger they exposed themselves and everyone who came into contact with them to was severe. They and Ma y people were executed because of this simple form of protest. I always knew about secret informers who could betray even their parents landing them in concentration camps, for saying, or even implying the slightest criticism of naziiasm, but I never before read a book that made me feel abjest fear every time the Quangels went to place one of their cards. This novel was inspired by a true story."}, {"review_sentiment": 5.0, "review_text": "This book is cutting. It is filled with muscular prose and the story and its hero and heroine are painted as simple people who have everyday dreams that we all have. I cannot say enough about this book, which I know that I will re-read. Spectacular."}, {"review_sentiment": 5.0, "review_text": "... the banality of good ...Hans Fallada’s novel, ‘Jeder stirbt für sich allein’ (Everyone dies alone,) first came to my attention through its publication in English, ‘Alone in Berlin,’ a translation that was delayed by 60 years. The book has been sitting on my shelf as a ‘must read’ for a long while. Burdened by regressive small-mindedness and divisions around the world, I finally tackled ‘Alone in Berlin,’ aware that it would be a grim read, having been described as a testament to the darkest years of the 20th century from the point of view and experience of ordinary people.Resistance to the Nazi regime by individuals had no news value after the war. Yet such stories provide the most poignant insights into what it is like to oppose a state under a dictatorship. As such, this book, written raw and in haste eighteen month after the defeat of Nazism, offers a high alert to simple solutions for social problems. The author, Hans Fallada, aka Rudolf Ditzen, died before this last of his works was published in 1947.The urgency behind the writing is palpable. The players, sketched with harsh strokes, embody the full range of human nature – the capacity for compassion, kindness, complacency, stupidity, meanness, stubbornness, false pride, envy, hate, and resentment, fear, fanaticism and vengeance tipping into the most depraved cruelty.Very quickly the dread of being caught in the nightmarish system of a totalitarian state jumps at the reader. While the ghostly despot drifts in the background, his control is shown through the dynamic interactions of ordinary citizens – be they power-hungry officers, opportunists, cunning manipulators, cowards, reticent objectors or unsung heroes. Resistance carried the threat of death and seemed futile.The anguish conveyed is chilling, intensified by the archetypal hue clinging to the tragic comic characters, at times suggesting caricatures. The sheer absurdness of the stupidities and sadistic cruelties depicted may dilute the shock, but it makes the scenes all the more heart-breaking.The classic method of totalitarianism is to instil fear and divide factions of society against each other, so people spy on each other and nobody can be trusted anymore. In this chapter of history fear served as the leverage for forcing the banal idea of a perfect state that can be safeguarded through clockwork control.Fallada’s main protagonists, Otto and Anna Quangel, were based on the records of two insignificant objectors to the regime, Otto and Elise Hampel. The elderly couple started spreading anti-Nazi missives written on postcards in buildings around Berlin. For their sadly ineffective attempts of rebellion, the Hampel’s were arrested in 1942, tried in 1943 and executed shortly after. The same fate befell their friends and relatives.Can a few virtuous individuals, each driven by personal idiosyncrasies, redeem the moral integrity of a nation? It is up to the reader to decide whether the many deaths a totalitarian regime inflicts on soon forgotten brave people are in vain.The book brought alive the pressure my grandparents must have lived under, as well as the uncanny anxious atmosphere that spoiled my parents’ teen years, and, the wariness I personally and many of the post-war generation developed towards overbearing authority.Presented in the context of ordinary individual lives, the story reads like a tragic comedy that screams – let us never forget that freedom lies in people being allowed to be different, not chained to a hell of obedience and conformity.Primo Levi’s declared ‘Alone in Berlin’ as the greatest book ever written about German resistance to the Nazis. English readers have had to wait 60 years to read the novel."}, {"review_sentiment": 5.0, "review_text": "An authentic tale of what opportunism and complaisance contributed to the stranglehold Fascism gained during these years. Yet, also a redemptive tale, with people laying down their lives symbolically to show their refusal to accept the horrors of barbaric Europe and its worst inhabitants of the time  Can't say I was encouraged, but certainly spellbound and left wondering where my own chahracter would dovetail in times and places like those. Stupendous, experienced writing at its best."}, {"review_sentiment": 5.0, "review_text": "An easy read that got me in from the beginning. It reflects a sad in our history."}, {"review_sentiment": 5.0, "review_text": "How did Germans create Nazi Germany? What made Nazi Germany work? This book goes a long way to assist us in feeling Nazi Germany at the \"molecular level\". Also the question where were those Germans who saw the folly of the psychology generated by Hitler is addressed. This is done through the stories of a number of individual Berliners interacting to create the oppressive atmosphere imprisoning the souls of Germans in individual prison cells.The courage of those who tried to push away those prison walls however ineffectively is displayed.  ."}, {"review_sentiment": 5.0, "review_text": "Although the end is predetermined, the plot captures the reader and moves at a high pace with deep and interesting charachters."}, {"review_sentiment": 5.0, "review_text": "very well witten but as always quite disturbing as about the Nazis and their cruelty"}]}, "authors": ["Hans Fallada"], "isbn": "014118938X", "longitude": 13.3888599, "periods": ["1900s"], "title": "Alone in Berlin", "word_cloud": "seemingly write extremely quickly get do matter mere week yet also take time description detail nothing rush want make sure reader get whole story able soak reality life control frightening detail contrast small handful individual determine challenge account war smallest immediate way think blanket control versus weight state marshal remain mind long long time indeed petty really contribution handwritten protest postcard take enormous courage couple saw end dignity courage good people brave enough confront totalitarian system enforce petty criminal thugs yet many prepared give life challenge regime terror never forget lose son invade wish sit resist increasingly barbaric nazi policy devise form quiet resistance simply entail printing postcard critical regime leave busy place danger expose everyone come contact severe ma people execute simple form protest always know secret informer even parent land concentration camp say even imply slightest criticism naziiasm never make feel ablest fear time go place card inspire true story cut fill muscular prose story hero heroine paint simple people everyday say enough know spectacular banality good stir fr site allen everyone dy first come attention publication translation delay year sit shelf long regressive division world finally tackle aware described testament darkest year century point view experience ordinary regime individual news value war story provide poignant insight oppose state dictatorship write raw haste eighteen month defeat offer high alert simple solution social problem author aka die last work publish urgency write palpable player sketch harsh stroke embody full range human nature capacity compassion kindness complacency stupidity meanness stubbornness false pride envy hate resentment fear fanaticism vengeance tip deprave quickly dread catch nightmarish system totalitarian state jump ghostly despot drift control show dynamic interaction ordinary citizen officer opportunist cunning manipulator coward reticent objector unsung hero carry threat death seem anguish conveyed chill intensified archetypal hue cling tragic comic character time suggest caricature sheer absurdness stupidity sadistic cruelty depict shock make scene classic method totalitarianism instill fear divide faction society people spy nobody trust anymore chapter history fear serve leverage force banal idea perfect state safeguard clockwork main protagonist base record insignificant objector regime elderly couple start spread missive write postcard building sadly ineffective attempt rebellion arrest tried execute shortly fate befell friends virtuous individual drive personal idiosyncrasy redeem moral integrity nation many death totalitarian regime inflicts soon forget brave people bring alive pressure grandparent live well uncanny anxious atmosphere spoil parent teen year wariness personally many generation develop towards overbear context ordinary individual live story read tragic comedy scream let never forget freedom lie people allow different chain hell obedience declare greatest ever write german resistance reader wait year authentic tale opportunism complaisance contribute stranglehold gain year yet also redemptive tale people lay life symbolically show refusal horror worst inhabitant time say encourage certainly spellbound leave wondering character time place experience write best easy get begin reflect sad history create make work go long way assist feel molecular level also question saw folly psychology generate address do story number individual interact create oppressive atmosphere imprison soul individual prison courage try push away prison wall however ineffectively displayed end predetermine plot capture move high pace deep interesting character well always quite disturb cruelty", "genres": ["Fiction & Literature", "WWII"], "summary": "Berlin, 1940, and the city is paralysed by fear. But one man refuses to be scared. Otto, an ordinary German living in a shabby apartment block, tries to stay out of trouble under Nazi rule. But when he discovers his only son has been killed fighting at the front he's shocked into an extraordinary act of resistance, and starts to drop anonymous postcards attacking Hitler across the city. If caught he will be executed.", "asin": "014118938X", "rank": "435635", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZYBGvM2JL.jpg", "country": "Germany", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}