{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 211, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent book"}, {"review_sentiment": 1.0, "review_text": "This paperback volume was so poorly edited as to be really annoying."}, {"review_sentiment": 1.0, "review_text": "The physical book is enormous and the formatting is really poorly done. The content is, of course, great, but I found it really difficult to read because of the formatting and the dimensions of the book made it very awkward to read publicly."}, {"review_sentiment": 5.0, "review_text": "I loved the book from the first page to the last page."}, {"review_sentiment": 5.0, "review_text": "In very condition"}, {"review_sentiment": 5.0, "review_text": "What can I say? Henry James.... ahhhh"}, {"review_sentiment": 5.0, "review_text": "This is a very nicely done edition of a classic novel. Quite a good value for what I paid!"}, {"review_sentiment": 5.0, "review_text": "Exactly as advertised"}, {"review_sentiment": 4.0, "review_text": "will purchase again. This product is sleek, light, and extremely sharp! For what I paid, I thought this was going to be a Walt-Mart knock off quality bread product, but this thing has sliced through every bread I've thrown at it like butter! The handle is also really well designed and easy to get a good grip on, so getting nice, even, straight slices is really easy. send it to my teacher as a gift, very well. fast shipping,"}, {"review_sentiment": 5.0, "review_text": "The book was in excellent condition . Enjoyed reading it ."}]}, "authors": ["Henry James"], "isbn": "0141441267", "longitude": -0.12574, "periods": ["1800s"], "title": "The Portrait of a Lady", "word_cloud": "excellent paperback volume poorly edit really annoy physical enormous format really poorly do content course great find really difficult format dimension make awkward publicly love first page last page condition say nicely do edition classic quite good value pay exactly advertise purchase product sleek light extremely sharp pay think go knock quality bread product thing slice bread throw butter handle also really well design easy good grip get nice even straight slice really easy send teacher gift well fast ship excellent condition reading", "genres": ["Fiction & Literature"], "summary": "The Portrait of a Lady is the story of a spirited young American woman, Isabel Archer, who inherits a large amount of money and subsequently becomes the victim of Machiavellian scheming by two American expatriates. \r\n\r\nLike many of James's novels, it is set in Europe, mostly England and Italy. Generally regarded as the masterpiece of James's early period, this novel reflects James's continuing interest in the differences between the New World and the Old, often to the detriment of the former. It also treats in a profound way the themes of personal freedom, responsibility, and betrayal.", "asin": "B01BITM8UQ", "rank": 0, "city": "London", "image": "", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}