{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 6.2443382, "ratings": {"num_ratings": 5, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book. To the point about the reality of the \"drug wars.\" Business as usual for a lot of countries"}, {"review_sentiment": 5.0, "review_text": "Absolutely outstanding account of a drug that does less damage than many that are legal. Extremely well researched and written so that anyone can read it."}, {"review_sentiment": 5.0, "review_text": "The research and stories are impressive and scary, and considering the latest testimony by the newly aprehended \"La Barbie\", dead on. Tom Feiling will give you insights into the cocaine business you need to understand why 26,000 people where killed in the Mexican drug war this year."}, {"review_sentiment": 5.0, "review_text": "Outstanding - MagníficoCom certeza o melhor livro que já li sobre o comércio ilegal de drogas.O autor consegue ser imparcial e técnico por meio de profunda pesquisa e análise de dados e fatos nos mais variados cantos do planeta.Fica bem claro a visão progressista, realista e liberal do autor, levando e/ou convidando os leitores(as) a formar opinião sobre o assunto.Convido a todos que apreciem leitura sobre serviços de inteligência, espionagem, formulaçao e implementação de poíticas públicas que visam melhorias na área de segurança, social, entre outras.Moisés de Freitas CunhaDiretor-Presidente do Instituto Educacional Mosaico de São Paulo"}, {"review_sentiment": 4.0, "review_text": "Tom Feiling has written a fabulously comprehensive look at the rise and fall (and rise again) of the cocaine trade.  He goes far beyond the damage caused by the trade, choosing instead to focus on the complicity of the \"war on drugs.\"Although primarily focusing on the United States (which makes sense given that the highest usage of cocaine takes place here), Feiling also explores the migration of cocaine production and smuggling routes, from South America to the Caribbean, to Mexico.This is fairly up-to-date information with statistics up to 2008 included.  He is heavy on the details, however, so if you are searching for a light read, this isn't it.  But if you find the subject as fascinating as I do, you'll enjoy Feiling's efforts here."}]}, "authors": ["Tom Feiling"], "isbn": "0141034467", "longitude": -75.573553, "periods": ["2000s", "Recent Releases"], "title": "The Candy Machine: How Cocaine Took Over the World", "word_cloud": "reality drug war usual lot country absolutely outstanding account drug le damage many legal extremely well research write anyone research stories impressive scary consider latest testimony newly apprehend dead insight business need understand people kill mexican drug war year outstanding certeza melhor liver we j lee sober comércio legal auto con segue tier impartial e técnico pro memo fatso no maid variant canto be carol visor progressista realist e liberal auto levando convidando o leitores format opinion sober dodo we apreciem leitura sober servo formulaçao publican we visa an social write fabulously comprehensive look rise fall rise trade go far damage cause trade choose instead complicity war drug primarily focus make sense give highest usage take place also explore migration production smuggle route fairly information statistic include detail however search light find subject fascinating enjoy ceiling effort", "genres": ["History"], "summary": "Cocaine is big business and getting bigger. Governments spend millions on an unwinnable war against it, yet it's now the drug of choice in the West. How did the cocaine economy get so huge? Who keeps it running behind the scenes?\r\n\r\nIn The Candy Machine Tom Feiling travels the trade routes from Colombia via Miami, Kingston and Tijuana to London and New York. He meets Medillin hitmen, US kingpins, Brazilian traffickers, and talks to soldiers and narcotics officers who fight the gangs and cartels. He traces cocaine's progress from legal 'pick-me-up' to luxury product to global commodity, looks at legalization programmes in countries such as Switzerland, and shows how America's anti-drugs crusade is actually increasing demand.\r\n\r\nCutting through the myths about the white market, this is the story of cocaine as it's never been told before.", "asin": "0141034467", "rank": "2130481", "city": "Medellin", "image": "https://images-na.ssl-images-amazon.com/images/I/51yMun3umVL.jpg", "country": "Colombia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}