{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 29, "rating": 3.3, "reviews": [{"review_sentiment": 3.0, "review_text": "I was surprised.  From very early on in this short book I assumed that the two 'Europeans', though probably brother and sister (they look similar) are frauds and adventurers, not at all the long-lost cousins of the worthy New England family on whom they are going to prey.  My expectation began when the two have a very ambiguous conversation  - before they have met the New England family - about whether the family will turn out to be rich.  The 'Baroness' remarks 'perhaps we should have brought more letters', presumably letter of introduction that would let them prey instead on different richer families if needed.  The brother reminds his sister of her stated conviction that the 'voice of the blood' 'should go before everything''.  She responds, 'you're such a child'.  Sounds very suspicious to me.  Next, Felix the relatively young 'cousin', meets the family, sent as s sort of advance guard by his older sister.  A daughter tries to get Felix's identity straight - he's Sicilian, no, he's French, no, of course not.  The brother and sister seem to have no nationality except that both their parents were once Americans.  So they are 'faux' Europeans..When finally the Baroness meets the father of the family, he finds it difficult to see a niece, ' the child of his own father's daughter' in this strange woman; presumably he sees no family resemblance as well finding her manner alarming.  Later on, Felix freely calls himself 'an adventurer'. The Baroness meanwhile talks quite a lot about 'fibs' and deception, and her ambivalent suitor, a friend of the family, worries that he doesn't quite believe in her. Indeed, far from having a polished European charm the Baroness seems to me like a smell of very strong perfume that you would like to get out of the house as soon as possible.  SO, my theory, and I'm sticking to it, is that James intended to bring out the falseness of the two more and more, perhaps, being James, not so you are quite absolutely sure.  But he lost interest and left the story as it is, to be called \"shallow\" by his own brother.  Should've worked more on the gullible New Englander theme and the frightening ease of deception."}, {"review_sentiment": 1.0, "review_text": "really slow"}, {"review_sentiment": 5.0, "review_text": "By a master!"}, {"review_sentiment": 2.0, "review_text": "Didn't like it all. Please"}, {"review_sentiment": 2.0, "review_text": "I wanted so much to love this as Henry James is a favorite author, but just could not get into this one."}, {"review_sentiment": 1.0, "review_text": "\"First Rate Publishers\" reproduces a copy of the book for each order on Amazon.  Font is too small (8 or 8.5) to read comfortably.The Henry James novel is great, First Rate Publishers is not."}, {"review_sentiment": 5.0, "review_text": "What a writer!  Even one-hundred years later, the book is still gripping and a real delight."}, {"review_sentiment": 4.0, "review_text": "Henry James combining his signature tug-of-will dynamics between characters, particularly of the opposite sex, with accessibility to intelligent, reasonably informed readers (you don't have to have a Ph.D. in lit to understand it, as you do with a book like The Ambassadors)."}, {"review_sentiment": 4.0, "review_text": "I didn't think this book quite as good as other Henry James books.  It is certainly worth reading and a very pleasurable read.  Just not quite as beautiful as some of his other works."}, {"review_sentiment": 5.0, "review_text": "Great book..and of course good service from ebay.  Would recommend it to all!  A history for all who enjoy times past."}]}, "authors": ["Henry James"], "isbn": "0141441402", "longitude": -71.0595678, "periods": ["1800s"], "title": "The Europeans: A Sketch", "word_cloud": "surprise early short assume probably brother sister look similar fraud adventurer cousins worthy family go prey expectation begin ambiguous conversation meet family family turn rich remark bring letter presumably letter introduction instead different richer family need brother remind sister state conviction blood everything respond child suspicious relatively young meet family send sort advance guard older sister daughter try get identity straight sicilian french course brother sister seem nationality parent finally meet family find difficult see niece child father daughter strange woman presumably see family resemblance well find manner alarm freely call meanwhile talk quite lot deception ambivalent suitor friend family worry quite believe indeed far polished european charm seem smell strong perfume house soon possible theory stick intend bring falseness perhaps quite absolutely sure lost interest leave story call shallow brother work gullible theme frighten ease deception really master want much love favorite author first reproduces copy order small great publisher writer even year later still grip real delight combine signature dynamic character particularly opposite sex accessibility intelligent reasonably inform reader light understand ambassador think quite good certainly read pleasurable quite beautiful work great course good service ebay history enjoy time", "genres": ["Fiction & Literature"], "summary": "\"The Europeans\", Henry James's novel of conflicting attitudes between Europeans and Americans was first serialized in The Atlantic Monthly in 1878. It is the story of Eugenia Munster and Felix Young, two siblings who while born in America have grown up in Europe. The two travel to Boston and there they experience a society much different from the one they have previously known.", "asin": "0141441402", "rank": "372693", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/51B-pJfDiUL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}