{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 15, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "This is one of the most singular memoirs I have ever read.  Brenan was in the right place at the right time and with the right temperament to record the last vestiges of some extremely ancient traditions.  The uncorrupted \"cante jondo\" which he heard as a matter of everyday life may be the prehistoric Mediterranean song form and one of the festival customs he witnessed is thought by one scholar to be a vestige of the Roman Saturnalia.Brenan was a man of parts.  A formidable athlete, he once walked over 60 miles, with an elevation gain of 8000 feet, in one day.  I have never heard of anything comparable other than perhaps when John Muir pushed his limits.  His many mountain treks gave him expertise in alpine botany and the culture of shepherds (and bandits) in extreme isolation.  In the hilarious chapter where an eccentric erotomaniac (who probably was impotent) took him on a guided tour of the brothels of Almeria, Brenan proved a master at recreating dialog with vividness and verisimilitude; this is a gift not given to even some of the greatest writers.I wish this were available in a scholarly edition with a glossary of the many Spanish terms (especially for human character) which have no one-word equivalent in English.  Michener also dwelt on this topic."}, {"review_sentiment": 4.0, "review_text": "\"South from Granada\" is an old book about the traditional patterns of life in the remote Spanish villages where Gerald Brenan lived 80 years ago.  So it is not surprising that much of it is structured and reads as a kind of anthropology text book. Brenan was anxious to capture the culture and lifestyle that had endured for hundreds of years and to celebrate the practices of the past that had made his time there so fascinating and memorable.  He did this with affection and honesty, fully aware of the brutal realities of poverty and oppression in which most of the villagers lived.  In a decidedly non-academic style he also tells us of the colourful characters he met and strange happenings he became part of.  It is a great read about people in a harsh but beautiful natural environment since replaced one suspects by the modernistic concrete and glitz of crass tourist developments up and down the Spanish coastline."}, {"review_sentiment": 5.0, "review_text": "This is a wonderful book. The sense of observation and the talent of describing those observations of Brenan is superb. Even if one is not interested in Spain and its people, which is not my case, it will love the details of the life of an Englishman in a backward hamlet of the mountains between Granada and Algeciras. Brenan left to Yegen just after fighting in World War I with his 1,600 books library. Yegen was a world in itself, completely detached from the rest of Spain and consequently of the planet. They did not know that WW I was fought just across the Pyrenees. They asked Brenan if he had fight against the \"moros\". It took me two days to digest that…I recommend the readers to get some additional information about Brenan in Google. He was not a saint and he does not mention in the book the daughter that he had with a Spanish girl. He took his daughter with him to England and never allowed them to meet again. Brenan is nowadays considered a hero in Yegen because he put the hamlet in the map, but some people still reproach him because of the daughter episode. Great reading!"}, {"review_sentiment": 5.0, "review_text": "A delight to read. So interesting to read about the history and prehistory of the area and the people where I have chosen to live,  written in an almost mesmerising way.  Quite enchanting."}, {"review_sentiment": 5.0, "review_text": "Makes me want to visit Granada"}, {"review_sentiment": 5.0, "review_text": "Brenan's book is a finely written account of his life in a small village south of Granada in the 1920s. Written in the 1950s, it is partly a memoir, partly travel writing and partly history, and it is all good. A fascinating book. I will look for his other books now."}, {"review_sentiment": 5.0, "review_text": "Arrived earlier than expected. The book was in brand new condition, and also came with a bookmark. Nice touch."}, {"review_sentiment": 5.0, "review_text": "Brenan is indispensable feet-up, pot-of-tea- at- the- ready, Sunday afternoon reading.  Here was a man, for whom the probably very strong influence of his own upbringing had no appeal for him and he followed his own muses. Also-if empire builders had shown his perception and gentle, generous spirit, it's a different world out here."}, {"review_sentiment": 4.0, "review_text": "Arriving in the north of Spain he walked and took the train down to the south where, from looking at a map, he thought that between the Sierras and the sea would be a good place to hunt for a house to rent - The Alpujarras was his destination.In the years between 1920 and 1934 Brenan lived in Yegen for around 6 years, one of the poorest villages in the Alpujarras. He tells his tale of daily life among the local and very poor villagers showing us the difficulties and hardships  the people of the time faced.The majority of the book is his account of festivals, folk-lore, lively characters and traditions. It's a fascinating account of how the poor of the day lived, without which our knowledge of Spanish history and our understanding would be sadly lacking."}, {"review_sentiment": 5.0, "review_text": "Although it was first published over half a century ago, Gerald Brenan's \"South from Granada\" is still considered by many to be the canonical text about the Albujarra region of Spain's Sierra Nevada, the standard against which all other work is judged. Does it deserve its exalted reputation? You'll get no argument from me.Brenan writes intelligently and fluidly, and his account is always interesting, whether he is writing about his own personal experiences, or about his neighbors and the local customs of the Albujarra. As he was friends with members of the Bloomsbury circle, the book also contains an account of (separate) visits by Lytton Strachey and Virginia Woolf.The following comments on Woolf nicely illustrate Brenan's perspicacity and generosity, two of the qualities that make this memoir so enjoyable to read:\"I want to emphasize Virginia's real friendliness on this occasion and the trouble she took to advise and encourage me, because her recklessness in conversation -- when she was over-excited she talked too much from the surface of her mind -- made some people think that she lacked ordinary sympathies. I was young for my age, and rather earnest. ... She on the other hand was a writer of great distinction, approaching the height of her powers. Yet she and her husband not only concealed the impatience they must often have felt, but treated me as though I was their intellectual equal.\"Based on this book, I'm really looking forward to reading Brenan's writing on the Spanish Civil War.I highly recommend \"South from Granada\". Readers with an interest in the region might also enjoy Chris Stewart's \"Driving over Leemons\"."}]}, "authors": ["Gerald Brenan"], "isbn": "0141189320", "longitude": 0.0, "periods": ["1900s"], "title": "Modern Classics South From Granada", "word_cloud": "singular memoir ever right place right time right temperament record last vestige extremely ancient tradition corrupted cant rondo heard matter everyday life song form festival custom witness thought scholar vestige man part formidable athlete walk mile elevation gain foot day never hear anything comparable perhaps push limit many mountain trek give expertise alpine botany culture shepherd bandits extreme isolation hilarious chapter eccentric erotomaniac probably impotent take guide tour brothel prove master recreate dialog vividness verisimilitude gift give even greatest wish available scholarly edition glossary many spanish term especially human character equivalent also dwell topic old traditional pattern life remote spanish village live year ago so surprising much structure read kind anthropology text anxious capture culture lifestyle endure hundred year celebrate practice make time fascinate memorable affection honesty fully aware brutal reality poverty oppression villager live decidedly style also tell colorful character meet strange happening become part great people harsh beautiful natural environment replace suspect modernistic concrete glitz crass tourist development spanish coastline wonderful sense observation talent describe observation superb even interested people case detail life backward hamlet mountain leave fight library yemen world completely detach rest consequently planet know fight ask take day digest recommend reader get additional information saint mention daughter spanish girl take daughter never allow meet nowadays consider hero put map people still reproach daughter episode reading delight so interesting history prehistory area people choose live write almost mesmerize way enchanting want visit finely write account life small village partly memoir partly travel write partly history good fascinating look arrive earlier expect brand new condition also come bookmark touch indispensable ready afternoon reading here man probably strong influence upbringing appeal follow mus empire builder show perception gentle generous spirit different world arrive north walk take train look map think sea place hunt house rent year live year poorest village alpujarras tell tale daily life local poor villager show difficulty hardships people time majority account festival lively character tradition fascinate account poor day live knowledge spanish history understand sadly lack first publish half century still consider many canonical text region standard work judged exalt reputation get argument writes intelligently fluidly account always interest write personal experience neighbor local custom friend member circle also contain account separate visit follow comment nicely illustrate perspicacity generosity quality make memoir enjoyable want emphasize real friendliness occasion trouble take advise encourage recklessness conversation talk much surface mind make people think lack ordinary sympathy young age rather earnest hand writer great distinction approach height power husband conceal impatience often treated intellectual equal base really look forward read write spanish highly recommend interest region also", "genres": ["Travel Writing"], "summary": "Between 1920 and 1934, Gerald Brenan lived in the remote Spanish village of Yegen and South of Granada depicts his time there, vividly evoking the essence of his rural surroundings and the Spanish way of life before the Civil War. Here he portrays the landscapes, festivals and folk-lore of the Sierra Nevada, the rivalries, romances and courtship rituals, village customs, superstitions and characters. \r\n\r\nFascinating details emerge, from cheap brothels to archaeological remains, along with visits from Brenan’s friends from the Bloomsbury group – Lytton Strachey and Virginia Woolf among them. Knowledgeable, elegant and sympathetic, this is a rich account of Spain’s vanished past.", "asin": "0141189320", "rank": "1194570", "city": "Andalucia", "image": "https://images-na.ssl-images-amazon.com/images/I/51Gtv7di2YL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}