{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 44, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "This is not an easy read.  The level of detail on party fortunes and who did what to whom is 'way past being absorbable by anyone not a specialist in post-WW II Spanish history.  That said, Hooper's observations on forces driving recent Spanish cultural trends seem well-informed and well-reasoned."}, {"review_sentiment": 4.0, "review_text": "An interesting reading and a very fluent and pleasant writing. However, I would like to have had more historical information and a little more picturesque data to better characterize the Spanish people."}, {"review_sentiment": 5.0, "review_text": "Bought it for my daugher and she loves it. Thank you."}, {"review_sentiment": 5.0, "review_text": "good book"}, {"review_sentiment": 5.0, "review_text": "I wish this were available in Kindle format"}, {"review_sentiment": 5.0, "review_text": "Wonderful book - I bought it for a Spanish Civilization class, but this book is so well written and such a good read that I decided to keep it instead of selling for a few bucks at my college. You definitely learn a lot about Spain."}, {"review_sentiment": 3.0, "review_text": "John Hooper wrote it in an easy-to-understand language and he really made me understand quite alot about Spanish history. It widened my knowledge about the politics and the economy of Spain and how it changed from a dictatorship into a democracy. I didn't zone out on this book as much as I zoned out on other informational, historical books because of the non-complex language the author uses."}, {"review_sentiment": 5.0, "review_text": "informative, straight forward. very interesting read. can be kind of dry, but it's the type of book you can read over time, or skip around."}, {"review_sentiment": 3.0, "review_text": "A bit dry but gives good overview of modern Spain."}, {"review_sentiment": 3.0, "review_text": "This book is an interesting account of the colorful tapestry that is modern Spain. It gives a concise overview to the  diversity of the regions and the history which gave rise to the differences which are vast and confusing to the uneducated student of this great country. Where it falls short is that it tries and fails to pull it all together in a coherent fashion. It is not a history nor is it a travel journal nor an anthropology yet it is all of these in some measure and it makes for a cumbersome read. If you want to learn about Spain, read a history and a travel journal."}]}, "authors": ["John Hooper"], "isbn": "0141016094", "longitude": -3.7035825, "periods": ["1900s"], "title": "The New Spaniards", "word_cloud": "easy level detail party fortune absorb able anyone specialist history say observation force drive recent spanish cultural trend seem interesting reading fluent pleasant write however historical information little picturesque data better spanish people daughter love good wish available format wonderful buy spanish class well write good decide keep instead sell buck college definitely learn lot write language really make understand quite a lot spanish history widen politics economy change dictatorship democracy zone much zone informational historical language author us informative straight forward interest kind dry type time skip bit dry give good overview modern interesting account colorful tapestry modern give concise overview diversity region history give rise difference vast confusing uneducated student great country fall short try fail together coherent fashion history travel journal anthropology yet measure make cumbersome want learn history travel journal", "genres": ["History", "Travel Writing", "Social & Cultural Studies"], "summary": "A fully revised, expanded and updated edition of this masterly portrayal of contemporary Spain. The restoration of democracy in 1977 heralded a period of intense change that continues today. \r\n\r\nSpain has become a land of extraordinary paradoxes in which traditional attitudes and contemporary preoccupations exist side by side. Focussing on issues which affect ordinary Spaniards, from housing to gambling, from changing sexual mores to rising crime rates. \r\n\r\nJohn Hooper's fascinating study brings to life the new Spain of the twenty-first century.", "asin": "0141016094", "rank": "260239", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51ES71-8kNL.jpg", "country": "Spain", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}