{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 30, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "I like the story, but it's not a novel but a scrip for a play so it reads as  a script."}, {"review_sentiment": 5.0, "review_text": "Awesome play much read this book..."}, {"review_sentiment": 5.0, "review_text": "A fantastic anticipation of the problems of today's artificial intelligence"}, {"review_sentiment": 5.0, "review_text": "Here are ten philosophical insights embedded in the extended prologue to this highly inventive 1920 science fiction three-act play by Czechoslovakian author Karel Čapek. And, yes, this play marks the very first appearance of the term “Robot” as in R.U.R. – Rossum’s Universal Robots – mass produced, human-like machines to perform manual labor and function as servants.1. Old man Rossum was a biologist who failed to create actual humans in his laboratory; engineer son Rossum invented the living labor machine, the Robot, a natural progression of production (son) following discovery (father). After all, as the present central director of R.U.R. states: “If you can’t do it faster than nature, what’s the point?” Let’s not forget this is 1920, the engineer is king and speed, machines, factories and efficiency are all the rage. Speed and machines even made headway in the world of art some year prior, especially among the Italian Futurists such as Mainetti, Boccioni and Bella.2. The central director continues: “Production should be as simple as possible and the product the best for its function.” And “The creation of an engineer is technically more refined than the product of nature.” The spirit of these statements was captured magnificently in the film “Modern Times” with Charlie Chaplin. Since the prologue is peppered alternately with satire, comedy and black humor, it’s as if the creators of that Chaplin film mined a number of ideas from Čapek’s play.3. Young Rossum started with twelve-foot Superrobots but they kept falling apart so he began manufacturing Robots of normal human height and respectable human shape. Curiously, when Robots mimic human dimensions, there is something inexplicably appealing about their physical presence. For example, witness the computer generated American football playing Robot one of the large commercial stations uses in their broadcasts – the Robot signals a first down, spikes the ball and even does a little dance after scoring a touchdown – all very charming for football fans – just Robot enough to be fantasy; just human enough to seemingly possess human emotions and feelings.4. A recent arrival to the R.U.R. factory, Helena, a sensitive young lady converses with the central director and mistakes the director’s beautiful secretary, a Robot named Sulla, for a real person. Oh, no, no! Helena is quite upset and initially refuses to belief such a gorgeous woman, just like herself, isn’t human. Ah, there’s something so very compelling about a woman’s beauty – we refuse to believe a young woman with such beauty lacks heart and feeling – case in point, the 2015 film “Ex Machina.”5. The way they are constructed, Robots never think up anything original. As the director notes: “They’d make fine university professors.” Did I mention Karel Čapek’s infusion of satire and black humor? Such a nice touch – not too much satire to sound preachy but enough to let us know much in his society and culture, all the flummery about “progress” and the eventual perfection and purification of mankind through scientism, is so much smoke and mirrors.6. Turns out Helena has traveled to the R.U.R. factory on behalf of the League of Humanity in order to incite and liberate the Robots. All the factory directors in the room, all six men, laugh and tell Helena everybody from the outside who comes to the factory wants to do good by the Robots and set them free. As the central director, Harry Domin, informs Helena: “It would amaze you to know how many churches and lunatics there are in the world.” Churches and lunatics . . . you gotta love it! As events unfold beginning in Act One, Helena’s words take on stinging irony.7. Helena wants to know if you can show the Robots a bit of love. Impossible, retorts the directors, since Robots are made for one and only one purpose: work. For Robots have no sense of taste nor do they ever smile. Considering how many 21st century factory Robots have been successfully constructed for nonstop work, this passage takes on a particular resonance. And, God forbid, if there is work where Robots can’t replace humans, there is always the opportunity to move your factory to a third world country and corral the poverty-stricken into your sweat-shop for next to nothing. Much of the themes of R.U.R. are as relevant today as they were in 1920.8. But, but, but . . . there is a chink in the armor. As one director sadly states: “Occasionally they go crazy somehow. Something like epilepsy, you know? We call it Robotic Palsy. All of a sudden one of them goes and breaks whatever it has in its hands, stops working, gnashes its teeth – and we have to send it to the stamping mill. Evidently a breakdown of the organism.” Sound like trouble? Such breakdowns prove to be big trouble.9. Powerful economic forces are at work. One of the directors pronounces how their Robots have cut the cost of labor, so much so that non-Robot factories are going belly-up. Many are the zingers the playwright hurls at a society reduced to the forces of supply and demand where the requirement to produce profits for shareholders takes top priority at the expense of humanity. Money, money, money . . . the lifeblood of the modern world then and now.10. Harry Domin proclaims how no longer will mankind have to destroy his soul doing work he hates; people will live to perfect themselves. Considering the modern phenomenon of the couch potato and numerous other mind-numbing addictions, unfortunately there is substantial evidence the vast percentage of the population is far from “perfecting itself” given time free from work.So, Act One, Act Two, Act Three take place at the R.U.R. factory ten years after the prologue. It's Robots vs. humans. I encourage you to read the play to find out what happens. And I highly recommend this Penguin edition which includes a most informative introductory essay by Czeck writer Ivan Klima."}, {"review_sentiment": 5.0, "review_text": "Every scfi fan should read this."}, {"review_sentiment": 5.0, "review_text": "a great book going through fundamental questions on the use of robotics and AI despite being very-very old (for the field)"}, {"review_sentiment": 5.0, "review_text": "I bought this for a university class, not thinking much of it at the time. After reading it though, I found it to be fantastic. So detailed, and when the detail is left out there is a thoughtful reason for it. As much as I do not read a novel twice, I have a feeling this one will get a second read."}, {"review_sentiment": 5.0, "review_text": "This book was very interesting especially to me as an IT major."}, {"review_sentiment": 4.0, "review_text": "This is the first work to refer to automatons as robots. The first two acts are hard to read because this work is firmly rooted in early twentieth century cultural ideas. However, if you keep going to act 3 you will see some of the seeds of the best science fiction themes ever."}, {"review_sentiment": 5.0, "review_text": "This Czech play was the source of the word \"robot\" from 1920. This is the first English translation from 1923. As I see more and more machines designed to make man's work unnecessary, I had to read it.A \"must read\" for every techie and school teacher (I am a computer systems professor).There is a very good modern interpretation from the Edward Alderton Theatre on Youtube."}]}, "authors": ["Karel Capek"], "isbn": "0141182083", "longitude": 14.4212535, "periods": ["1900s"], "title": "R.U.R. (Rossum's Universal Robots)", "word_cloud": "like story scrip play read script play much fantastic anticipation problem today artificial intelligence here ten philosophical insight embed extended prologue highly inventive science fiction play author play mark first appearance term mass produce machine manual labor function man biologist fail create actual human laboratory engineer son invent live labor machine natural progression production son follow discovery father present central director state faster nature point king speed machine factory efficiency machine even make headway world art year prior especially italian futurist central director continue simple possible product best creation engineer technically refine product spirit statement capture magnificently film prologue pepper alternately satire comedy black humor creator film mine number idea capek start keep fall apart begin manufacture normal human height respectable human shape human dimension something inexplicably appeal physical presence example witness computer generate american football playing large commercial station use broadcast signal first spike ball even little dance score charm football fan enough fantasy human enough seemingly posse human emotion recent arrival factory sensitive young lady converse central director mistake director beautiful secretary name real person quite upset initially refuse belief gorgeous woman human something compel woman beauty refuse believe young woman beauty lack heart feeling case point film way construct never think anything original director note make fine university mention infusion satire black humor such nice touch much satire sound enough let much society culture mummery progress eventual perfection purification scientist much smoke travel factory behalf order incite liberate factory director room men laugh tell everybody come factory want good set free central director inform many church lunatic lunatic get ta love event unfold begin word take sting want show bit love impossible retort director make purpose work sense taste ever smile many century factory successfully construct nonstop work passage take particular resonance forbid work human always opportunity move factory third world country corral next nothing much theme relevant today chink armor director sadly state occasionally go crazy somehow something epilepsy know call robotic sudden go hand stop work gnashes teeth send stamp mill breakdown trouble such breakdown prove big economic force work director pronounce cut cost labor much factory go many zinger playwright hurl society reduce force supply demand requirement produce profit shareholder take top priority expense humanity money money lifeblood modern world proclaim longer destroy soul work hat people live perfect modern phenomenon couch potato numerous addiction unfortunately substantial evidence vast percentage population far perfect give time free place factory year prologue humans encourage find happens highly recommend edition include informative introductory essay writer sci fan great go fundamental question use robotics old field buy university class think much time read find fantastic so detailed detail leave thoughtful reason much twice feel get second interesting especially major first work refer automaton robots first act hard work firmly root early twentieth century cultural idea however keep go act seed best science fiction theme ever play source word robot first english translation see machine design make man work unnecessary techie school teacher computer system professor good modern interpretation", "genres": ["Science Fiction", "Drama"], "summary": "A visionary work of science fiction that introduced the word \"robot\"\r\n\r\nWritten in 1920, premiered in Prague in 1921, and first performed in New York in 1922—garnered worldwide acclaim for its author and popularized the word robot. Mass-produced as efficient laborers to serve man, Capek’s Robots are an android product—they remember everything but think of nothing new. But the Utopian life they provide ultimately lacks meaning, and the humans they serve stop reproducing. \r\n\r\nWhen the Robots revolt, killing all but one of their masters, they must strain to learn the secret of self-duplication. It is not until two Robots fall in love and are christened “Adam” and “Eve” by the last surviving human that Nature emerges triumphant.\r\n", "asin": "0141182083", "rank": "364634", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51aZJe9OqrL.jpg", "country": "Czechia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}