{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 223, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Robertson Davies as an author can do no wrong; this is sophisticated writing so be prepared for an unusual read"}, {"review_sentiment": 4.0, "review_text": "I really liked the Fifth Business, the first book of the trilogy.  It was intriguing and maintained my interest very well and I liked the way the three boyhood characters reunited in an inexplicable encounter at the end of the tale.  The Manticore was not as interesting to me and the coincidence of encountering Eisengrim yet again was much harder for me to swallow by this time.  David's story was not nearly as engaging as Dunstan's and I could not swallow the explanation for his arrested sexuality.  He just was not real for me.  By the third book, I had lost interest and only skipped through the bizarre saga of Paul's life.  I admire Davies' writing and enjoy all his literary references, but I had trouble following through on the entire trilogy.  I suspect I missed something critical in the story line for the second book, but I am not sure I want to put in the effort to find it out.  I do like that Davies' story is intentionally ambiguous on multiple levels."}, {"review_sentiment": 1.0, "review_text": "awful"}, {"review_sentiment": 5.0, "review_text": "Brilliant, brilliant author. I just wish that they sold a Kindle version of this book as well, as it is a heavy book to carry around."}, {"review_sentiment": 5.0, "review_text": "A good read. Three interconnected stories of the lives and growth of three men.  Small causes and large effects.  Well written."}, {"review_sentiment": 5.0, "review_text": "Everybody should read this book!  It's a classic!"}, {"review_sentiment": 5.0, "review_text": "Robertson Davies has quickly become one of my favorite writers. His wit is subtle, his characters real but intriguing. He is a novelist who takes life seriously and shares w/ his readers a quiet wisdom."}, {"review_sentiment": 5.0, "review_text": "I had to buy this book twice because I liked it so much I gave my first copy away!"}, {"review_sentiment": 5.0, "review_text": "I absolutely loved the first book in this series!! It was very profound and well written. Seriously. Made up for the not so great second book. But others might like it."}, {"review_sentiment": 5.0, "review_text": "I had to read this for my book club . . . the first 100 pages were torture and I thought I might not get through it and then, C L I C K!  All of a sudden, the characters came alive for me and I found myself completely wrapped up in the story.  I ended up loving the book so much I purchased the two subsequent books in the trilogy as well as an anthology by Roberson Davies.Totally loving them all!  I'm now a Robertson Davies fan!"}]}, "authors": ["Robertson Davies"], "isbn": "0141186151", "longitude": -79.387207, "periods": ["1900s"], "title": "Fifth Business", "word_cloud": "author wrong sophisticated writing prepare unusual really like first trilogy intrigue maintain interest well like way boyhood character reunite inexplicable encounter end tale interesting coincidence encounter yet much harder swallow time story nearly engage explanation arrest sexuality real third lose interest skip bizarre saga life admire davy write enjoy literary reference trouble follow entire trilogy suspect miss something critical story line second sure want put effort find story intentionally ambiguous multiple level awful brilliant author wish sell version well heavy carry good interconnect story live growth men small cause large effect well write everybody classic quickly favorite writer wit subtle character real intriguing novelist take life seriously share reader quiet wisdom buy twice like much give first copy away absolutely love first series profound well write seriously great second others club first page torture think sudden character come alive find completely wrapped story end love much purchase subsequent trilogy well anthology love fan", "genres": ["Fiction & Literature", "Historical Fiction", "WWI"], "summary": "Deptford Trilogy\r\n\r\nRamsay is a man twice born, a man who has returned from the hell of the battle-grave at Passchendaele in World War I decorated with the Victoria Cross and destined to be caught in a no man's land where memory, history, and myth collide.\r\n\r\nAs Ramsay tells his story, it begins to seem that from boyhood, he has exerted a perhaps mystical, perhaps pernicious, influence on those around him. His apparently innocent involvement in such innocuous events as the throwing of a snowball or the teaching of card tricks to a small boy in the end prove neither innocent nor innocuous.\r\n\r\nFifth Business stands alone as a remarkable story told by a rational man who discovers that the marvelous is only another aspect of the real.", "asin": "0141186151", "rank": "155926", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51Fecwo1b1L.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}