{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 487, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Love this book. We are reading as a family and I love it the twists and compassion learned and needed along with the history and time piece make this fun for all ages. Leads to other topics my 8 and 11 year old love it."}, {"review_sentiment": 4.0, "review_text": "Since I was heading to San Francisco, someone recommended this book to me and it didn't disappoint. While geared toward a younger reader, it is still a good read."}, {"review_sentiment": 5.0, "review_text": "A quick nice read! Loved how every character interacts and reacts differently to the sister. Also, loved the Alcatraz history."}, {"review_sentiment": 3.0, "review_text": "Al Capone does my shirts is about, a kid named Moose Flanagan and he is going to move to Alcatraz for his autistic sister who needs to go to a special ED school with the name of Esther P. Marinoff school. The book also has many more characters and they focus more on Natalie even though moose is the main character I also feel that this book has a lot of twists and turns in it. The author Gennifer Choldenko who has also made other books like, notes from a liar and her dog. The book has 215 pages, the book is a fictional novel so, I would rate it a 3 out of 5 stars. Also for kids 12 and older. I think that way because this book talks about murderers, rapists and more. I think the book was very good and I enjoyed how they mentioned al Capone. I also enjoyed how Moose's sister, Natalie was autistic and the moment that I found out I understood the book a lot more and I also understood it more because I have a relative who is autistic so if you have an autistic relative it’ll help you understand the book a lot better than if you did not. I thought the cover was creative with the photo of Alcatraz on it. This book is not in a series from what I know but I do know you should read it because I literally couldn’t let go of it as I was reading. I hope you enjoy the book as much as I have."}, {"review_sentiment": 5.0, "review_text": "Really easy and fun read. It is an engaging book that actively addresses autism. I had to read this book for an education class and I'm really glad that the teacher had assigned it. There's a reason why it got a medal. This is the first book of a series of 3. A little bit pricey, considering I found on at a used book store for 75 cents, but this one is of course new and has that new book smell. Worth the read."}, {"review_sentiment": 5.0, "review_text": "Would read againI love all the books in the entire seriesI hope u like it toHave fun"}, {"review_sentiment": 5.0, "review_text": "This book is about a kid named Moose who is 12 years old and his father who just got a job as an electrician on the island of Alcatraz.  His mother teaches piano lessons sometimes,and when she teaches, Moose has to look over her sister who is really 16. His mom insists on pretending that she is 10 because Natalie is developmentally disabled and there is a school in San Francisco that can help kids with her difficulties, but she has to be ten to get in. Moose has to stay out of trouble so the warden wouldn't kick them of the island but he gets in trouble because the warden's daughter is always tying to do bad things.  Moose got a little help from the famous mob leader Al Capone. I liked this book a lot. I highly recommend it."}, {"review_sentiment": 5.0, "review_text": "Got this for a school assignment.  It did not disappoint."}, {"review_sentiment": 1.0, "review_text": "Great for me because its grabs you right in the very beginning. And i really truly love that in a book"}, {"review_sentiment": 5.0, "review_text": "I bought this for my grandson who usually has to be pushed to do his summer reading for school.  He liked this book so much that he asked for the other 2 books in the series."}]}, "authors": ["Gennifer Choldenko"], "isbn": "0142403709", "longitude": -122.4192363, "periods": ["1900s", "Recent Releases"], "title": "Al Capone Does My Shirts (Tales from Alcatraz)", "word_cloud": "read family love twist compassion learn need history time piece make fun age topic year old love head someone recommend disappoint gear younger still good quick nice love character interact react differently sister also love history kid name go move autistic sister need go special school name school also many character focus even moose main character also feel lot twist turn author also make note liar page fictional rate star also kid older think way talk murderer rapists think good enjoy mention also enjoy sister autistic moment find understand lot also understand relative autistic autistic relative help lot better think cover creative photo series know know literally let read hope enjoy much really easy fun engage actively address autism education class really teacher assign reason get medal first series little bit pricey consider find use store cent course new new smell entire series i hope to have fun kid name year old father get job electrician island mother teach piano lesson sometimes teach look sister really mom insist pretend developmentally disable school help kid difficulty ten get stay trouble warden island get trouble warden daughter always tie bad thing get little help famous mob leader like lot highly recommend school assignment disappoint grab right begin really truly buy grandson usually push summer read school like much ask series", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Moose Flannagan moves with his family to Alcatraz so his dad can work as a prison guard and his sister, Natalie, can attend a special school.  But Natalie has autism, and when she's denied admittance to the school, the stark setting of Alcatraz begins to unravel the tenuous coping mechanisms Moose's family has used for dealing with her disorder.\r\nWhen Moose meets Piper, the cute daughter of the Warden, he knows right off she's trouble.  But she's also strangely irresistible.  All Moose wants to do is protect Natalie, live up to his parents' expectations, and stay out of trouble.  But on Alcatraz, trouble is never very far away.\r\n\r\nSet in 1935, when guards actually lived on Alcatraz Island with their families.  Choldenko's second novel brings humor to the complexities of family dynamics and illuminates the real struggle of a kid trying to free himself from the \"good boy\" stance he's taken his whole life.", "asin": "0142403709", "rank": "14264", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51c4E6NJrHL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}