{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 14, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Raymond Queneau was born in Le Havre in 1903. He married Janine Kahn in 1928, the sister-in-law of Andre Breton. Queneau was notable as a novelist, poet and critic. His first novel was published in 1933, with his first Collection of poems coing in 1937. \"Zazie in the Metro\", his fourteenth novel, is probably hsi best known work andwas first published in 1959. It was adapted for the big screen the following year.Zazie is a pre-teen from rural France. The book opens with her arrival in Paris; she's come to stay with her Uncle Gabriel for a couple of days while her mother spends some time with a lover. Zazie's one aim is to travel on the metro, Unfortunately, the metro's closed due to a stike, which doesn't impress her one bit. She therefore sets out to entertain herself around the city and, in doing so, raises merry hell. That's really the last thing her poor uncle Gabriel needs, as he works very late nights on-stage in Pigalle.A very short and enjoyable book overall. (I'm a little sorry it didn't last longer). Some of the book's fun comes from the phonetic games Queneay plays, while Zazie herself - cheeky and foul mouthed - is a very entertaining character. (I was also fond of Gabriel and Laverdure). Definitely recommended."}, {"review_sentiment": 5.0, "review_text": "A yummy Bon Bon!!!"}, {"review_sentiment": 5.0, "review_text": "VIVA ZAZI!!"}, {"review_sentiment": 4.0, "review_text": "Hilarious and fun. Queneau is the best."}, {"review_sentiment": 5.0, "review_text": "This book is hilarious from begining to end.  Not extrange it was his most selling book in France.  Again, the translation is wonderful."}, {"review_sentiment": 5.0, "review_text": "one of the great modern books a must for anyone with any sense of humor and wit. if you are serious forget it. if you like  french silly, read it"}, {"review_sentiment": 5.0, "review_text": "I have had the pleasure to be introduced to a lot of French authors such as Vian, Queneau, Sartr, Bataille and others and I have found each one of them extremely fascinating and intricate. The majority of Queneau's work I have read in Bulgarian and he has become a favourite of mine, however  I am quite disappointed with Barbara Wright's translations. I could barely finish reading Exercises in style. I fell offended by the literary translation and its bluntness. As much as I love the author, I'll never be able to get any of his books unless I find another translation, and that is a pitty...It's a shame since I wanted to get a bunch of my friends acquainted with his work."}, {"review_sentiment": 3.0, "review_text": "If you decide to read Zazie in the Metro, don't be surprised to find yourself thinking a bit like the story's quirky cast of characters: speaking with charmingly wordy phrases (e.g., \"Picking up a syphon he purposed to cause its mass to reverberate against Gabriel's skull,\" rather than, \"he hit Gabriel in the head with a bottle.\"), and forming words using unusual spellings (e.g., \"Tsnot true, unkoo\" instead of, \"It's not true, uncle.\"). You may even find yourself looking at the world through Zazie's wide eyes, seeing things with the innocence of a child narrated with a vocabulary like Charles Bukowski's.I pity poor translator Barbara Wright -- author Raymond Queneau's preferred translator, from what I understand -- for what must have been buckets of perspiration shed in what could have only worked as a labor of love. After all, this is a book is more about language and dialogue than it is about anything that could be mistaken for a plot.The other main source of Zazie in the Metro's charm comes from its unusual roll call of characters. Aside from the always-interesting Zazie, the book offers the quixotic and curious \"Unkoo\" Gabriel, his dour sometimes foil Gridoux, and even a parrot called Laverdure, whose solitary line -- \"Talk, talk, that's all you can do\" -- seems to get blurted out only with exceptional timing.It's easy to understand how this colorful tale inspired a generation of French readers and writers. It is even said to have had a hold on Jean-Pierre Jeunet, the director of the wonderful and similarly playful film, Amelie.Compared to all this, the plot of this story hardly seems worth mentioning: young Zazie comes to Paris to visit her uncle, but what she really wants to do is ride on the metro for the first time. Because of a strike, she can't, and she compensates with a string of other adventures.Up until this point, I know, this does not sound like a three-star review (or three and a half, if that had been possible). I have given Zazie in the Metro what amounts to a so-so rating for reasons I am not too sure how to describe. The best explanation I can come up with is that despite all of the positive points made here, the book just failed to capture me; I never felt like I was part of the story. Somehow, its 157 pages seemed quite a bit longer, and sometimes the action became confused or obscured because of the clever word play. It was like a meal based on ingredients I adore, but which don't quite seem to work well together.Yes, of course, buy and read Zazie in the Metro. Its place in Europe's literary cannon and the unusual mix of characters and language is enough to make that case. Besides, it's a book that an at least mildly adventurous literate person should know. I'll just hope it will be a bit more of a treat for you than it was for me."}, {"review_sentiment": 5.0, "review_text": "Raymond Queneau has written a strange but tantalizing little novel about an adolescent named Zazie... she has a New York accent, and the mouth of a Henry Miller. Her misadventures in Paris, prove challenging to those around her,and amusing to the reader. It's a collage of seemimgly misplaced dialogue and eccentric characters, yet is easy to read and laugh with.(Note: Queneau is, I think, an underappreciated genius. You can find out more about him by looking up the book \"The OULIPO COMPENDIUM\" here at Amazon, which contains his extraordinary \"One-hundred-trillion sonnets.\" \"Oulipans: rats who build the labyrinth from which they plan to escape\" -- Raymond Queneau).Zazie is less of a labyrinth and more of a amusement park, a good introduction to this imaginative writer. Probably not for those easily offended (nor is \"Zazie\" herself), but a little treasure worth looking for"}, {"review_sentiment": 5.0, "review_text": "Queneau offers a caleidoscope of satirical views about Paris and the people there, and he populates his novel with truly bizarre guys. Zazie is a perhaps twelve-year old girl that comes to Paris with her mother for some  days; the mother visits her lover, and Zazie visits her uncle Gabriel.  Gabriel works as a dancer (with a balley costume) in a gays' night-club  without being homosexual himself. Some of his friends (a shoemaker, a pub  owner, a parakeet, a taxi driver, Gabriel's wife, an almost-rapist) make  the scene complete.Queneau does not forget to fill the book with  swearwords and other vulgarities that are common in Paris, and he leaves no  opportunity out to make everyone look ridiculous - a bus full of tourists,  the \"gendarmerie\", the Parisian car drivers...I laughed a lot."}]}, "authors": ["Raymond Queneau"], "isbn": "0142180041", "longitude": 2.3514992, "periods": ["1900s"], "title": "Zazie in the Metro", "word_cloud": "bear marry notable novelist poet critic first publish first poems coin fourteenth probably his best known work and was first publish adapt big screen follow rural open arrival come stay couple day mother spends time lover aim travel unfortunately close due stoke impress bit therefore set entertain city raise merry hell really last thing poor uncle need work late night short enjoyable overall little sorry last longer fun come phonetic game play cheeky foul mouth entertaining character also fond recommend yummy hilarious fun best hilarious begin end not estrange sell translation wonderful great modern anyone sense humor wit serious forget french silly pleasure introduce lot french author van others find extremely fascinating majority work bulgarian become favorite mine however quite disappoint translation barely reading style fell offend literary translation bluntness much love author never able get find translation shame want get bunch friend acquaint work decide surprise thinking bit story quirky cast character speak charmingly wordy phrase pick siphon purpose cause mass reverberate skull rather hit head bottle forming word use unusual spelling true unkoo instead true even look world wide eye see thing innocence child narrate vocabulary pity poor translator author prefer translator understand perspiration shed labor love language dialogue anything main source charm come unusual roll call character offer quixotic curious dour sometimes foil even parrot call solitary line talk talk seem get blurt exceptional easy understand colorful tale inspire generation french reader writer even say hold director wonderful similarly playful film plot story hardly seem mention young come visit uncle really want first time strike compensate string point know sound review half possible give amount rating reason sure best explanation come positive point make failed capture never felt part story page seem quite bit longer sometimes action become confused obscure clever word meal base ingredient adore quite seem work well course place literary cannon unusual mix character language enough case least mildly adventurous literate person know hope bit treat write strange tantalize little adolescent name accent mouth misadventures challenge amuse collage seemingly misplace dialogue eccentric character yet easy think underappreciated genius find look contain extraordinary sonnet rat labyrinth plan escape le labyrinth amusement park good introduction imaginative writer easily offend little treasure look offer kaleidoscope satirical view people populate truly bizarre guy perhaps old girl come mother day mother visit lover visit uncle work dancer valley costume gay homosexual friend shoemaker pub owner parakeet taxi driver wife make scene forget fill swearword vulgarity common leave opportunity make everyone look ridiculous bus full tourist gendarmerie parisian car driver laugh lot", "genres": ["Fiction & Literature", "Young Adult"], "summary": "Impish, foul-mouthed Zazie arrives in Paris from the country to stay with Gabriel, her female-impersonator uncle. All she really wants to do is ride the metro, but finding it shut because of a strike, Zazie looks for other means of amusement and is soon caught up in a comic adventure that becomes wilder and more manic by the minute. In 1960 Queneau's cult classic was made into a hugely successful film by Louis Malle. Packed full of word play and phonetic games, Zazie in the Metro remains as stylish and witty as ever.", "asin": "0142180041", "rank": "166478", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51-8bIEf5TL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}