{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 102, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "got to recommend this one so nice"}, {"review_sentiment": 5.0, "review_text": "I really liked this book. The characters were interesting and colorful. I had to consult the internet for lot of the \"New Orleans\" terminology.  I liked the author's style of writing. The only thing that disappointed me was that after Josie (Mary) got her house  the story ended. I wanted to know what happened after that, guess I wasn't ready for it to end."}, {"review_sentiment": 5.0, "review_text": "If you enjoy Historical Fiction you would probably enjoy this book."}, {"review_sentiment": 3.0, "review_text": "I loved all the historic accounts of New Orleans. Storyline and character development we a bit weak. Loved the old pictures"}, {"review_sentiment": 3.0, "review_text": "I was excited to read this book after just finishing \"Sin in the Second City\" about the brothels in Chicago. I looked up the book on Amazon, and based on all of the 5-star ratings, I snapped it off the shelf without a second thought. It wasn't horrible, but it certainly wasn't great. The writing is disjointed and uneven (maybe because of having two authors?) and the stories within just really don't flesh themselves out. I think they were trying to include too much and try to set up scenarios for certain historical names/stories to appear, which didn't necessarily make sense or add to the story. I would have liked the story to continue after Mary becomes Josie Arlington, one of the most \"feared\" madams in New Orleans, because she was certainly no one to fear through out this book. How did that come about? To sum it up, this was a fairly disappointing read that left me wanting for more."}, {"review_sentiment": 5.0, "review_text": "Loved this book! Fascinating mix of actual history and fiction."}, {"review_sentiment": 5.0, "review_text": "Fun way to learn about history of New Orleans!  I just returned from NoLa and wanted to know more about the history and places I had seen. Well written and easy and quick to read!"}, {"review_sentiment": 5.0, "review_text": "I enjoyed reading this novel. It was interesting without being lewd. While I feel sorry for Mary and what she was forced to endure, I'm impressed by her ability to survive such dire circumstances."}, {"review_sentiment": 3.0, "review_text": "New Orleans certainly boasts a colorful history, what with Andrew Jackson and pirate Jean Lafitte teaming to defeat the British at the close of the War of 1812 (actually after the Treaty of Ghent had been signed, so technically after the war had ended), the city constantly battling the encroachment of Gulf waters, and, the subject of this book, the confinement of prostitution and bordellos to a red-light district. While many cities have had formal red-light districts (and some still do, like Amsterdam and many German cities), New Orleans’ version has always held a sort of romantic appeal, perhaps because of its nickname, “Storyville,” or that it is way back in history.Lynn and Martin attempt to resurrect the period, really 1898, the time leading up to the inauguration of the district, by novelizing the life of a young prostitute. While interesting and definitely portraying the misery that was (and is) street prostitution, it’s never as compelling as you might expect a novel on this topic to be. Truth be told, it’s kind of flat. Lynn and Martin might have done better by shortening the build-up to the instituting of the district and lengthening the portion devoted to the district.In fact, there was a real Mary Deubler, the central character. She, however, wasn’t nearly as downtrodden and hapless as her novelized version. She proved a quite shrewd entrepreneurial type who did operate a house called the Arlington, who even in short biographical sketches sounds intriguing. Probably many of the characters who have basis in history, like Tom Anderson and Lulu White, were more interesting than as Lynn and Martin portray them. Which highlights the weakness of their novelized approach, weak characterizations.In the end, Madam isn’t really the place to seek out information about or titillation from Storyville. Those wishing to pursue these might try a source cited as a favorite by the authors, Storyville, New Orleans: Being an Authentic, Illustrated Account of the Notorious Red Light District and the extant photographic work of E.J Bellocq, E.J. Bellocq Storyville Portraits, as well as novels using the period and location as a backdrop."}, {"review_sentiment": 5.0, "review_text": "Background: I was looking for something with a good New Orleans vibe. Found this one, which is about a prostitute who rises from meager beginnings to become a prominent player in the so-called underground world. The story is based on the actual figure (Mary Deubler, dba Josie Arlington), as well as the events surrounding the formation of Storyville, New Orleans' then-red-light district.This is a fun and entertaining read. Some scenes are funny, some are gritty, some are dire, and some are uplifting. There are sexual caricatures of prominent figures, sex and voodoo for petty revenge, and dirty dealing politicians who might resemble Tom Waits and John Goodman in real life. (At least that's how I picture them.) If you don't know much about Storyville, you can expect to learn a thing or two, although you get the impression that the authors took plenty of dramatic license.The language is fairly simple and straightforward. It reads like a contemporary novel, not like a heavy-handed history text.Recommended for a casual read about a fun chapter in New Orleans' history."}]}, "authors": ["Cari Lynn", "Kellie Martin"], "isbn": "0142180629", "longitude": -90.0701156, "periods": ["1800s", "1900s", "Recent Releases"], "title": "Madam: A Novel of New Orleans", "word_cloud": "get nice really like character interest colorful consult internet lot terminology like author style write thing disappointed get house story end want know happen guess ready end enjoy probably love historic account character development bit weak old picture excite finish brothel look base rating snap second think horrible certainly great writing disjoint uneven maybe author story really flesh think try include much try set scenario certain historical appear necessarily sense story story continue becomes fear madam certainly fear come fairly disappointing leave want love fascinate mix actual history fiction way learn history return want know history place see well write easy quick enjoy read interest lewd feel sorry force endure impress ability survive dire circumstance certainly boast colorful history pirate team defeat british close actually sign technically war end city constantly battle encroachment water subject confinement prostitution bordello district many city formal district still many city version always hold sort romantic appeal perhaps nickname way back attempt resurrect period really time lead inauguration district novelize life young prostitute interest definitely portray misery street prostitution never compel topic tell kind flat do better shorten institute district lengthen portion devote fact real central character however nearly downtrodden hapless novelize version prove quite shrewd entrepreneurial type operate house call even short biographical sketch sound intrigue probably many character basis history interest portray highlight weakness novelized approach weak end really place seek information titillation wish pursue source cite favorite author extant photographic work well novel use period location backdrop look something good vibe find prostitute rise meager beginning become prominent player underground world story base actual figure dab well event surround formation fun entertain scene funny gritty dire uplifting sexual caricature prominent figure sex voodoo petty revenge dirty deal politician real life least picture know much expect learn thing get impression author take plenty dramatic language fairly simple straightforward read contemporary history casual fun chapter history", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "When vice had a legal home and jazz was being born—the captivating story of an infamous true-life madam\r\n \r\nNew Orleans, 1900. Mary Deubler makes a meager living as an “alley whore.” That all changes when bible-thumping Alderman Sidney Story forces the creation of a red-light district that’s mockingly dubbed “Storyville.” Mary believes there’s no place for a lowly girl like her in the high-class bordellos of Storyville’s Basin Street, where Champagne flows and beautiful girls turn tricks in luxurious bedrooms.  But with gumption, twists of fate, even a touch of Voodoo, Mary rises above her hopeless lot to become the notorious Madame Josie Arlington.\r\n \r\nFilled with fascinating historical details and cameos by Jelly Roll Morton, Louis Armstrong, and E. J. Bellocq, Madam is a fantastic romp through The Big Easy and the irresistible story of a woman who rose to power long before the era of equal rights.", "asin": "0142180629", "rank": "553130", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51l0IEyVqaL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}