{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 179, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "The Shape of Water is the 1st book in the Inspector Montalbano Mystery series that takes place in Sicily. A place where goats once roamed in now a place for drug dealings and sexual encounters. It is called the Pasture.Two cleaners who pick up garbage in the Pasture discover a car with a dead male body. He looks like he died a natural death while having sex. To complicate the matter, he is well known in the political field in the area. Inspector Montalbano does not want to close the case so quickly as he has some questions that he wants answered. Some things don't make sense. He is pressured to close the case.The book follows the Inspector as he asks questions and meets with quite a few people. The best part of the book for me was Inspector Montalbano. He is honest and hard working. There is a lot of corruption that he has to work through. It was a fast enjoyable read and I will continue with the series."}, {"review_sentiment": 5.0, "review_text": "One of his best.  Again, the characters are wonderful, the local color is vivid.  Makes one want to be there.  I want more!"}, {"review_sentiment": 4.0, "review_text": "I was completely charmed by this series.  The narrative eludes the formulaic rigor of most modern detective stories without losing the plot.  The crimes are complex, verging on convoluted, and the path to solving them - I think - reflects the culture and the terrain.  This is not a book for people who are linear thinkers.  Our hero is kind of like a Sicilian Columbo and the book is populated with a terrific range of characters, many of whom appear later in the series.  I thought the author did a great job with selecting interesting locations and didn't sound maudlin or like a history book or a tourist pamphlet.  And the violence was not sensationalized.  I loved the idiosyncrasies of this book and I couldn't wait for the detective to go home to dinner so I could research another recipe."}, {"review_sentiment": 4.0, "review_text": "No further comment needed."}, {"review_sentiment": 3.0, "review_text": "I'm not going to spoil the ending but it was a disappointment. In addition the main surprise of the book makes no sense or at least the reason for it was never adequately developed or explained."}, {"review_sentiment": 2.0, "review_text": "Not a lot of depth...superficial story telling.  I would like to have been given more background to some of the characters."}, {"review_sentiment": 4.0, "review_text": "Book One of the Inspector Montalbano series had me smiling and I will certainly read more.This Inspector is one of the good guys in a society where corruption is part and parcel of everyday life. He approaches this somewhat naively at times while other instances he sees through instantly and is able to move at speed to the next problem that needs to be solved.The story is quite complex with a large number of characters but there are reminders and sufficient depth of characterisation that the reader not put off by the complexity but instead persists to the end.Sicily is a very different part of the world and the descriptions of the various settings involved in this mystery are detailed and interesting."}, {"review_sentiment": 5.0, "review_text": "A friend just back from Sicily told me I had to read Camilleri's books and he was so right!  Set in Sicily, it is a wing-ding murder mystery solved by a forthright, honest inspector named Salvo Montalbano in the fictional town, Vigata.  It begins when a powerful and respected man is found parked in a disrespectful part of the town, dead with his pants pulled down.  By the time it is wrapped up, several politicians are also dead, and there is a revelation that comes out of nowhere and hits you like a hammer!  This crafty writer is terrific and prolific.  With all his books, I’m going to be very busy in the future."}, {"review_sentiment": 5.0, "review_text": "Great author!"}, {"review_sentiment": 1.0, "review_text": "Threw it away before finishing. I hope law enforcement in Italy isn't anywhere close to how it's described in the part of the book I read."}]}, "authors": ["Andrea Camilleri"], "isbn": "0142004715", "longitude": 0.0, "periods": ["2000s"], "title": "The Shape of Water", "word_cloud": "series take place sicily place goat roam place drug dealing sexual encounter call cleaner pick garbage discover car dead male body look died natural death sex matter well know political field area want close case quickly question want answered thing make sense pressure close follow asks question meet quite people best part honest hard work lot corruption work fast enjoyable continue series best again character wonderful local color vivid want want completely charm series narrative eludes formulaic rigor modern detective story lose plot crime complex verging convolute solve think reflect culture people linear thinker hero kind sicilian populate terrific range character many appear later series think author great job select interesting location sound maudlin history tourist pamphlet violence sensationalized love idiosyncrasy detective home dinner research recipe comment need go spoil end disappointment addition main surprise make sense least reason never adequately develop explain not lot depth superficial story tell give character series smile certainly good guy society corruption part parcel everyday life approach somewhat naively time instance see instantly able move speed next problem need story quite complex large number character reminder sufficient depth characterization put complexity instead persist different part world descriptions various setting involve mystery detailed interesting friend back tell right murder mystery solve forthright honest inspector name fictional town begin powerful respected man find park disrespectful part town dead pant pull time wrap several politician also dead revelation come nowhere hit hammer crafty writer terrific prolific go busy future author away finish hope law enforcement anywhere close described part", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Inspector Montalbano, Book 1\r\n\r\nAndrea Camilleri's Inspector Montalbano has become an international sensation whose adventures have been translated from Italian into eight languages, from Dutch to Japanese. The Shape of Water is the first book in this sly, witty, engaging series with its sardonic take on Sicilian life. \r\n\r\nThe goats of Vigata once grazed on the trash-strewn, sirocco-swept site still known as the Pasture. Now local enterprise of a different sort flourishes: drug dealers and prostitutes of every flavor. But their discreet trade is upset when two employees of the Splendor Refuse Collection Company discover the body of engineer Silvio Lupanello, one of the local movers and shakers-apparently deceased in flagrante-at the Pasture. The coroner's verdict is death from natural causes-refreshingly unusual for Sicily. But Inspector Salvo Montalbano, as honest as he is streetwise and as scathing to fools and villains as he is compassionate to their victims, is not ready to close the case-even though he's being pressured by Vigata's police chief, judge, and bishop. \r\n\r\nPicking his way nimbly through a labyrinth of high-comedy corruption, delicious meals, vendetta fire-power, and carefully planted false clues, Montalbano can be relied on, whatever the cost, to get to the heart of the matter. ", "asin": "0142004715", "rank": "154175", "city": "Sicily", "image": "https://images-na.ssl-images-amazon.com/images/I/51FkKyMwgwL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}