{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 94, "rating": 4.5, "reviews": [{"review_sentiment": 3.0, "review_text": "I enjoyed the writing, the character of the inspector, and the description of Sicily with its culinary highlights and bureaucratic intrigues. However, from a crime novel point of view, the story was disappointing. Most importantly the story did not make any sense to me. This includes the motive for the murder, but also many other aspects that I don't want to give away. Also, the police investigation was very sloppy with many mistakes that did not come across in the book as such - maybe the author overlooked them. Protagonists are not supposed to be perfect, on the contrary, but it was not believable to me that a real police unit would work like this. I did not have this issue with the Terracotta Dog."}, {"review_sentiment": 5.0, "review_text": "What can one say, its Inspector Montalbano and therefore an excellent read.  It also shows how not doing small things can snowball into events that have deadly consequences."}, {"review_sentiment": 5.0, "review_text": "Montalbano is at his perplexing best keeping his staff and us readers puzzled. How doe Livia put up with him?The violin is part of this mystery. What a great performance !"}, {"review_sentiment": 4.0, "review_text": "The Montalbano mysteries are always a joy to read. I was fully engaged right to the end."}, {"review_sentiment": 5.0, "review_text": "Really enjoy Inspector Montalbano.  The books are well written.....the characters, well developed and realistic.  Looking forward to reading them all."}, {"review_sentiment": 5.0, "review_text": "Just discovered this series and in less then two weeks I have read ten of the books. Great plot and love humor interspersed throughout. Translator does a great job and it's hard to believe it wasn't written in English."}, {"review_sentiment": 5.0, "review_text": "If you like Montalbano in the other novels, you'll like this one as well. Good character/detective, secondary characters, plot, etc. Pretty good translation, some laugh-out-loud. Might want to start with novels 1 or 2 first, though."}, {"review_sentiment": 4.0, "review_text": "I don't generally like mysteries as a rule, but this series has many interesting things about life in Italy. It's funny sometimes and the situations are, well, different."}, {"review_sentiment": 5.0, "review_text": "Inspector M is a well-thought-out character. Just the right blend of humor, mystery, and references to Italian cooking and food!"}, {"review_sentiment": 5.0, "review_text": "The humor thought is like the spice in Montlbano's description of the meals he enjoys.  The twist at the end is doubly marvelous because we not only find out who the murderer is and why but also a delicious post mortim confirming evidence that helps to explain why the murderer is convinced he's been discovered despite what would otherwise seem merely to be circumstantial evidence against him."}]}, "authors": ["Andrea Camilleri"], "isbn": "0142004456", "longitude": 0.0, "periods": ["2000s"], "title": "Voice of the Violin", "word_cloud": "enjoy write character inspector description culinary highlight bureaucratic intrigue however crime point view story disappoint most importantly story make sense include motive murder also many aspect want also police investigation sloppy many mistake come maybe author overlooked protagonist suppose perfect contrary believable real police unit issue say therefore excellent also show small thing snowball event deadly consequence perplex best keep staff reader puzzle doe put part mystery great performance mystery always joy fully engage right end really well write character well develop realistic forward reading just discover series le week ten plot love humor intersperse great job hard believe write like novel well good secondary character plot etc good translation want start novel first generally mystery rule series many interesting thing life funny sometimes situation well different character right blend humor mystery reference italian cooking food humor think spice description meal enjoy twist end doubly marvelous find murderer also delicious post mortim confirm evidence help murderer convince discover merely circumstantial evidence", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "The fourth book in the New York Times bestselling Inspector Montalbano mystery series\r\n\r\nInspector Montalbano, praised as “a delightful creation” (USA Today), has been compared to the legendary detectives of Georges Simenon, Dashiell Hammett, and Raymond Chandler. As the fourth mystery in the internationally bestselling series opens, Montalbano’s gruesome discovery of a lovely, naked young woman suffocated in her bed immediately sets him on a search for her killer. \r\n\r\nAmong the suspects are her aging husband, a famous doctor; a shy admirer, now disappeared; an antiques-dealing lover from Bologna; and the victim’s friend Anna, whose charms Montalbano cannot help but appreciate... But it is a mysterious, reclusive violinist who holds the key to the murder.", "asin": "0142004456", "rank": "158833", "city": "Sicily", "image": "https://images-na.ssl-images-amazon.com/images/I/518CZ1R6YRL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}