{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 266, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent ~"}, {"review_sentiment": 2.0, "review_text": "There is a lot to like about this book. As usual, the mastery of phrasing and characterisation of Greene are in full display. It started , very promisingly for me, with a highly evocative scene of two men meeting with no apparent purpose in mind but both with heaps of baggage, emotional as well as ideological. Greene saves this novel from descending into another \"Passion of Maurice Bendrix\" by the astute observations on how the affair was conducted , with Parkis and his boy sad side actors in the play. Towards the end, the novel became unbearably infused with religiosity, all kinds of miracles being shown up to persuade us that we are fools not to believe in god. I am sure Greene can do better than this."}, {"review_sentiment": 5.0, "review_text": "I can't emphasize enough how wonderful this book, or recording rather, is, and how wonderful Colin Firth is reading it. The story is what it is, I'm not rating the actual story by Graham Greene. The product is Mr. Firth's reading of said story. And as wonderful of an actor he is is as good as he reads this. I've listened to some stinker of books lately that frankly, would have been better had I read them myself. But I buy the audio to catch up on my reading when I'm on my commute. I purposely drove out of my way on many occasions to continue to listen to Colin. And I've even let him read me to sleep. haaahaa. I highly recommend. A great addition to any Colin Firth collection. I hope he will continue to read classics for audible books."}, {"review_sentiment": 5.0, "review_text": "Loved it. Great writing style."}, {"review_sentiment": 3.0, "review_text": "When Bendrix meets Henry in the park by chance one rainy night, it takes him back to the time, a couple of years earlier, when he was having an affair with Henry's wife, Sarah. Now Bendrix is bitter – she left him and he has never really understood why. And Henry, unaware of their affair, now tells him that he thinks Sarah may be seeing someone else. All the old feelings brought to the surface, Bendrix feels he must know – did Sarah ever love him? Or was he just one in a long line of men...This is a book of two halves for me. The first half is quite wonderful. It's a study of how jealousy and insecurity can lead someone to destroy the very love that is causing those emotions, and how easily a failed love can turn to bitterness, even hatred. Bendrix, the first person narrator, is arrogant and can be cruel, but he is also self-aware, which makes him tolerable if not likeable. The writing is fantastic from the very first sentences – lean and direct. Greene never tells us anything – he lets his characters speak for themselves, though we see them mostly through the filter of Bendrix's jumble of emotions. Greene understands the vulnerability that comes with love, the weakness and insecurity that can cause us to seek excuses in advance for love's failure, and, by doing so, create that failure through our own actions. There are occasional passages of pathos, done with a simplicity that makes them deeply moving without ever verging on the mawkish.I listened to Colin Firth's narration of the book and he does a superb job, making it feel both tense and intense. He doesn't 'act' the dialogue, but uses the subtlest shifts in tone to convey the different characterisations. All the anger and bitterness is there on the surface, but he lets us hear the sorrow and love that still underlie those emotions. It's not at all surprising that he won the Audie Award for Best Solo Narration for this in 2013.Unfortunately the second half fell away sharply for me and I'll have to be vague about the reasons why in order to avoid spoilers. Many of Greene's books reflect his own personal struggle with faith and his strange relationship with the Catholic Church, and this book is no exception. But whereas in other novels – The Heart of the Matter, The Power and the Glory – I've found that both interesting and moving, in this one somehow it all feels forced and rather... OK, I've tried to think of a better word, but the one that suits is... silly. I hold my hands up – I'm a life-long atheist and that may have affected how I felt about it. But I actually don't think it's that – it seems to me the way Greene handles the religious aspects in this one is crass, and I think I'd feel that way even if I were a believer.So, in short, what starts as a wonderfully truthful depiction of love, jealousy and grief, turns into a superficial and incredible account of some kind of religious revelation. My real problem with it is that I have been saying for many years that The Heart of the Matter is one of my favourite books, and now I'm scared to re-read it in case Scobie's struggles with his faith strike me in the same way. In other words, perhaps it’s this book, or perhaps I’ve just become too cynical for this kind of shallow, sentimental mysticism."}, {"review_sentiment": 2.0, "review_text": "Dull"}, {"review_sentiment": 5.0, "review_text": "Very good book, and great price."}, {"review_sentiment": 4.0, "review_text": "a brilliant author"}, {"review_sentiment": 5.0, "review_text": "Fabulous Author"}, {"review_sentiment": 5.0, "review_text": "A book of deep melancholy and profound sadness. Yet, the dawn is behind darkness and redemption is never far off."}]}, "authors": ["Graham Greene"], "isbn": "0142437980", "longitude": -0.12574, "periods": ["1900s"], "title": "The End of the Affair", "word_cloud": "excellent lot usual mastery phrase characterization full display start promisingly highly evocative scene men meet apparent purpose mind heap baggage emotional well ideological save descend astute observation conduct boy sad side actor play become unbearably infused religiosity kind miracle show persuade fool believe god sure better enough wonderful record rather wonderful read story rating actual story product reading say story wonderful actor good read listen stinker lately frankly buy audio catch reading commute purposely drive way many occasion continue listen even let sleep haaahaa highly recommend great addition collection hope continue classic audible love great writing style meet park chance rainy night take time couple year earlier wife now bitter leave never really understood tell think see someone else old feeling bring surface feel ever love long line men halve first half quite wonderful study jealousy insecurity lead someone destroy love cause emotion easily fail turn bitterness even hatred first person narrator arrogant cruel also make tolerable likable writing fantastic first sentence lean direct never tell anything let character mostly filter jumble emotion understand vulnerability come weakness insecurity cause seek excuse advance love failure create failure action occasional passage pathos do simplicity make deeply move ever verge listen narration superb job make feel tense intense dialogue use subtlest shift tone convey different characterization anger bitterness surface let sorrow love still underlie emotion surprising second half fell away sharply vague reason order avoid spoiler many reflect personal struggle faith strange relationship exception whereas novel find interest move somehow feel force rather ok try think better word suit silly hold hand atheist felt actually think seem way handle religious aspect crass think feel way even short start wonderfully truthful depiction love jealousy grief turn superficial incredible account kind religious revelation real problem say many year favorite scar case struggle faith strike way word perhaps perhaps become cynical kind shallow sentimental mysticism dull very good great price brilliant author fabulous author deep melancholy profound sadness dawn darkness redemption never far", "genres": ["Fiction & Literature", "WWII"], "summary": "\"A story has no beginning or end: arbitrarily one chooses a moment of experience from which to look ahead...\"\r\n \r\n\"This is a record of hate far more than of love,\" writes Maurice Bendrix in the opening passages of The End of the Affair, and it is a strange hate indeed that compels him to set down the retrospective account of his adulterous affair with Sarah Miles. Now, a year after Sarah's death, Bendrix seeks to exorcise the persistence of his passion by retracing its course from obsessive love to love-hate. At first, he believes he hates Sarah and her husband, Henry. Yet as he delves further into his emotional outlook, Bendrix's hatred shifts to the God he feels has broken his life, but whose existence at last comes to recognize.\r\n \r\nOriginally published in 1951, The End of the Affair was acclaimed by William Faulkner as \"for me one of the best, most true and moving novels of my time, in anybody's language.\" This Penguin Deluxe Edition features an introduction by Michael Gorra.", "asin": "0142437980", "rank": "32266", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51-2xzxtJcL.jpg", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}