{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 42, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "American Genius"}, {"review_sentiment": 5.0, "review_text": "I wish all biographies were morelike this, although this book is not strictly a biography. What I mean is that the focus is on the achievements and significance of the remarkable central character, Eadweard Muybridge.  It was Muybridge's photographic work that led to the development of modern cinema, which Slonit recognizes as \"splitting the second\" and therefore as significant as splitting the atom.  In the hands of a less skill author, a central character as eccentric as Muybridge could easily have overtaken the narrative. I mean he did kill a guy in a jealous rage.  But the murder, the insanity defense and the legally impossible jury verdict are all contained in a single chapter. The larger story, the technological development of the 19th century, continues.  We also get a close look at Leland Stanford, the beginning of the transcontinental railroad and the early history of San Francisco, although I did feel Slonit sometimes strained to connect the camera, the railroad and California into a coherent story.  This is the first book I have read by this author, but it won't be the last. I was really blown away by this."}, {"review_sentiment": 5.0, "review_text": "This book really gave an interesting account of photography and the origins of motion pictures. I'll never look at a racing horse the same."}, {"review_sentiment": 2.0, "review_text": "Great looking product, beautifully crafted. Very sharp, good weight, incredible price!  very good seller . recommend it to my friend. best service. my company need it ,"}, {"review_sentiment": 4.0, "review_text": "I read Ms.Solnit's book after learning that it had inspired actor/director Gary Oldman to write a screenplay called Flying Horse, with an eye toward directing the film about photo pioneer Eaweard Muybridge. RIVER OF SHADOWS is a meandering but thoughtfully entertaining journey through the energetic, sometimes tragic life of Eaweard Muybridge whose motion-study images were midwife to modern cinema. Solnit grandly sets the stage of Muybridge's era and how the lure of the early photographic process gave the Englishman a new career and a fresh start. His whole-hearted embrace of the burgeoning technology continues to impact us and our perception of time via motion pictures and all forms of emerging visual media. The book title's reference to the \"technological wild west\" is so appropriate by guiding us through the historical cloud of dust kicked up by an America of the late 1800s with its growing railroads, vanishing cowboys and struggling native tribes, to reveal how science was a significant part of the rough and tumble mix."}, {"review_sentiment": 3.0, "review_text": "I was overall somewhat disappointed. Muybridge's great achievement was to photograph animal locomotion. . This involved his development of high speed camera shutters and very sensitive photographic emulsions. There is almost nothing in the book about how this was accomplished. Photographic chemistry is a difficult subject. How had Muybridge mastered it and how had he improved upon it ?The book never tells. An appendix to the book containing technical details would have been helpful . What were Muybridge's patents , if any?"}, {"review_sentiment": 5.0, "review_text": "came as described!"}, {"review_sentiment": 1.0, "review_text": "Probably one of the most boring books I've read. Was a selection for my book club or I wouldn't have finished it"}, {"review_sentiment": 1.0, "review_text": "I'd rather claw my eyes out than read this book again. I couldn't say enough bad things about this book to justify how terrible it was."}, {"review_sentiment": 2.0, "review_text": "I got through 150 pages of this book by active skimming but finally gave up. Solnit buries a fascinating story under a blizzard of details about the historical context of Muybridge's life and inventions. To my taste the ratio was way off, compared to, say, what Laura Hillenbrand did with the Depression context of 'Seabiscuit'. Perhaps Solnit was compensating for the relative lack of information available about Muybridge's own life? -- but in that case, why not write a terrific magazine article instead of an overstuffed full-length book?"}]}, "authors": ["Rebecca Solnit"], "isbn": "0142004103", "longitude": -122.4192363, "periods": ["1800s", "1900s", "2000s"], "title": "River of Shadows: Eadweard Muybridge and the Technological Wild West", "word_cloud": "american wish biography more like strictly biography mean focus achievement significance remarkable central character photographic work lead development modern cinema recognize split second therefore significant splitting atom hand le skill author central character eccentric easily narrative mean kill guy jealous rage murder insanity defense legally impossible jury verdict contain single chapter larger story development century continue also get close look begin transcontinental railroad early history feel slonit sometimes strained connect camera railroad coherent story first author last really really give interesting account photography origins motion picture never look race horse great look product beautifully craft very sharp good weight incredible price good seller recommend friend best service company need learn inspired write screenplay call eye direct film photo pioneer meander thoughtfully entertain journey energetic sometimes tragic life image midwife modern cinema grandly set stage era lure early photographic process give new career fresh embrace burgeon technology continue perception time motion picture form emerge visual medium title reference appropriate guide historical cloud dust kick late grow railroad vanish cowboy struggle native tribe reveal science significant part tumble mix overall somewhat disappointed great achievement photograph animal locomotion involve development high speed camera shutter sensitive photographic emulsion almost nothing accomplished chemistry difficult subject master improve never tell appendix contain technical detail patent come described probably boring be selection club rather claw eye enough bad thing justify terrible get page active skim finally give buries fascinate story blizzard detail historical context life invention ratio way compare say context perhaps compensate relative lack information available life case terrific magazine article instead overstuff", "genres": ["Biography", "Art & Architecture", "History", "Film", "Photography"], "summary": "The world as we know it today began in California in the late 1800s, and Eadweard Muybridge had a lot to do with it. This striking assertion is at the heart of Rebecca Solnit’s new book, which weaves together biography, history, and fascinating insights into art and technology to create a boldly original portrait of America on the threshold of modernity.\r\n\r\nThe story of Muybridge—who in 1872 succeeded in capturing high-speed motion photographically—becomes a lens for a larger story about the acceleration and industrialization of everyday life. Solnit shows how the peculiar freedoms and opportunities of post–Civil War California led directly to the two industries—Hollywood and Silicon Valley—that have most powerfully defined contemporary society.", "asin": "0142004103", "rank": "132308", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/515Y%2BYc0kFL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}