{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 42, "rating": 3.7, "reviews": [{"review_sentiment": 2.0, "review_text": "It just didn't float my boat, I didn't warm to or care about the characters or their destiny. It was for me a sufferance 😳"}, {"review_sentiment": 5.0, "review_text": "This is a well written and very interesting story. It was recommended by a friend who had lived in Hong Kong. I knew nothing about this time period or Hong Kong, so I found it historically interesting. The only weak part was the last section, where I felt like the author was having difficulty with the ending or that another writer finished the book. Still, it's worth reading."}, {"review_sentiment": 2.0, "review_text": "I've had this book on my shelf for a long time, but I remember many favorable reviews when it came out years ago. Boy, was I disappointed!  As some other reviewers have noted, the book is disjointed; about a third covers one character; another third covers another, totally unrelated character; and the final third or so is about a character who sort of brings together all three.  However, the characters are flat, stick figures, and while Mr. Lanchester is widely regarded as a fine author, much of the plot is flat too.  For example, the lead character in the middle section of the book stays in Hong Kong during the horrors of the Japanese occupation in WWII, but there's no drama or even suspense.  The final third of the book is even worse; the lead character in that portion seems to narrate his life, but it's really not very interesting.Finally, the atmosphere of Hong Kong itself is unimaginative and boring.A real disappointment."}, {"review_sentiment": 3.0, "review_text": "Lots of facinating content, but sometimes disconnected."}, {"review_sentiment": 5.0, "review_text": "Almost, but not as brilliant as his \"A Debt to Pleasure\".And that is the Lanchester book to read."}, {"review_sentiment": 5.0, "review_text": "In a departure from his Euro-centric novels, Lanchester writes of Hong Kong before World War II, during the Japanese occupation, and through to the hand-off of the British colony to the Chinese.  But, in his remarkable way, he finds a point of view that is perfect.  Tom Stewart has no prospects in England so sets out by tramp steamer for far-away Hong Kong.  He is joined by a bank employee, a devoted couple, and two nuns, one of whom teaches him Chinese as the ship makes its way to the Orient.  He finds work in a bank, which makes him useful to the Japanese when they take over, but also puts him in between the suddenly-captured English and the Chinese underclass of the island, and … one of the nuns.  I’ll not say more. - See more at: http://jwlbooks.com/jack-london-reviews/hammock-days/#sthash.09YvIziu.dpuf"}, {"review_sentiment": 3.0, "review_text": "interesting read, great at times, but disappointed in the ending."}, {"review_sentiment": 5.0, "review_text": "fantastic. Beautiful story, beautifully written - highly recommended."}, {"review_sentiment": 5.0, "review_text": "A deceptive beginning followed by an increasingly enthralling story. Accentuated by the fact that I read it while I was hiking with the most delightful man from Hong Kong. But even without that it was an enthralling read that breathed new life into what I thought was an old city."}, {"review_sentiment": 4.0, "review_text": "A good read.  Interesting but a disappointing ending.  I would still recommend it."}]}, "authors": ["John Lanchester"], "isbn": "0142003379", "longitude": 114.1628131, "periods": ["1900s"], "title": "Fragrant Harbor", "word_cloud": "float boat warm care character destiny sufferance well write interesting story recommend friend live know nothing time period find historically interest weak part last section felt author difficulty end writer finish still worth read shelf long time remember many favorable review come year disappoint reviewer note disjointed third cover character third cover totally unrelated character final third character sort bring together however character flat stick figure widely regard fine author much plot flat example lead character middle section stay horror japanese occupation drama even suspense final third even worse lead character portion seem narrate life really atmosphere unimaginative real disappointment lot fascinate content sometimes disconnect almost departure novel write japanese occupation british colony remarkable way find point view perfect prospect set tramp steamer join bank employee devote couple teach chinese ship make way find work bank make useful japanese take also put english underclass island nun say see http interest great time disappointed end fantastic story beautifully write highly recommended deceptive beginning follow increasingly enthral story fact hike delightful man even enthral breathe new life think old city good disappoint end still", "genres": ["Fiction & Literature"], "summary": "It is 1935 and Tom Stewart, a young Englishman with an almost visceral longing for adventure, has bought himself a cheap ticket to the complex, corrupt, and corrupting world of Hong Kong. Aboard ship, he becomes the pawn in a wager between a bluff businessman and a Chinese missionary nun, who bets she can teach him Cantonese on the six-week voyage out. What begins as friendship turns into solace and then a passion that only individual vows can remit. \r\n\r\nFragrant Harbor takes the reader from the intrigue and double-dealing of the 1930s through the savagery of the Japanese occupation to contemporary Hong Kong, crossroads of international trade and finance and waystation for laundering the dirty money of warlords, drug runners, and Chinese triads. The novel ends three years after the Mainland takeover, with Hong Kong as greedy, corrupt, and corrupting as when Stewart first landed there. \r\n\r\nWriting with the same fine style and observant eye that distinguished his previous novels, John Lanchester depicts a tumultuous time and place and then peoples it with extraordinary characters. The result is a novel that proves he is amongour most versatile and talented contemporary novelists-indeed, as The New York Times wrote, \"Lanchester is a commanding writer.\"", "asin": "0142003379", "rank": "912302", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/518XNAWFMKL.jpg", "country": "China", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}