{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 36.600256, "ratings": {"num_ratings": 674, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Very well written.  I loved every sentence. I must read more classics.  My husband is reading it at the same time and loving it v"}, {"review_sentiment": 5.0, "review_text": "I first read this book in 1961 as a 19 year old Marine pvt.  I've lost count of the number of times that I have re-read it since. Yet every time is as much a joy as the very first....."}, {"review_sentiment": 4.0, "review_text": "A classic neighborhood...."}, {"review_sentiment": 5.0, "review_text": "Brand new. Fast shipping."}, {"review_sentiment": 5.0, "review_text": "The words flow like unfettered water and the inhabitants of Cannery Row come alive as if you have chatted with them for years."}, {"review_sentiment": 5.0, "review_text": "John Steinbeck is awesome! This is one of the funniest and most heart-warming books I have ever read. The cast of characters is composed of the unseemly individuals most of us never spend a moment’s time with in our entire lives – outside of possibly spooning them some soup while volunteering at a local shelter. These are the cast offs, outcasts, prostitutes, derelicts, bums, crooks, hustlers, immigrants and the lost. All of those souls who never show up on our TV programs or at our local churches – yet they are out there, they live among us – hidden by our ignorance, dismissal and, possibly, guilt.This is not a story about the suffering of the down and out. It is not about oppression, poverty, or the plight of the poor. It is a story the takes us through the everyday life of those who live on the other side of the tracks. It is ultimately a story about community and life – about appreciating what you have, enjoying those you are with and supporting one another in whatever way you are able.This is a needed tale in the land of more.We live in a culture that is paralyzed by “the missing tile” syndrome. Dennis Prager discusses this plight in the video below. In essence – we tend to fixate all of our energy and thoughts on the things, traits or features that we do not have. We could be in great health, have a wonderful marriage, a fulfilling career, healthy children, and a home of our own – all blessings in the real world – but we will often think only of the vacation we weren’t able to take, the new car we can’t afford, the six-pack abs we don’t have and on and on and on. We spend our days lamenting what we don’t have, what our neighbor does have – meanwhile, our neighbor looks at us with the same feelings. Happiness will forever elude those who cannot be grateful for what they have, enjoy it completely and share it willingly.It is called contentment – which is the enemy of a consumer economy. Sometimes, we all need a reminder of what we have, how much worse off we could be – to just stop looking at those who are “above” you, but instead look at the billions who are “behind” you.Reading about Mac and the boys makes me remember that every one of those people who are on the “outside” are individuals – they have a history, a family, life experiences and a story to tell – of where they are from and how they arrived where they are today. Check out the song “Moments” by Emerson Drive – the lyrics are amazing and it hits you in the heart– we have all been loved, but how do so many get lost?I could read Steinbeck all day long, he is an amazing writer who brings you into the hearts and minds of his characters – they become your friends and you will carry them with you for the rest of your life. I know I will."}, {"review_sentiment": 5.0, "review_text": "A classic and deservidously so."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "A fun book to read. John Steinbeck's books are great, and ones to read numerous times. A really .great author"}, {"review_sentiment": 5.0, "review_text": "Love this magical story tellng"}]}, "authors": ["John Steinbeck"], "isbn": "014200068X", "longitude": -121.8946388, "periods": ["1900s"], "title": "Cannery Row", "word_cloud": "very well write love sentence husband reading time love v first year old pvt lose count number time time much joy first classic neighborhood new shipping word flow unfettered water inhabitant come alive chat year awesome funniest ever cast character compose unseemly individual never spend moment time entire life possibly spoon soup volunteer local shelter cast offs outcast prostitute derelict bum crook hustler immigrant lose soul never show tv program local church yet live hide ignorance dismissal possibly story suffer oppression poverty plight poor story take everyday life live side track ultimately story community life appreciate enjoy support way need tale land live culture paralyze miss tile syndrome discuss plight video essence tend fixate energy thought thing trait feature great health wonderful marriage fulfil career healthy child home blessing real world often think vacation able new car afford spend day lament neighbor meanwhile neighbor look feeling forever elude grateful enjoy completely share call contentment enemy consumer economy need much worse look instead look billion boy make people outside individual history family life experience story tell arrive today song lyric amaze hit love many get lose day long amazing writer brings heart mind character friend carry rest life know classic deservidously excellent fun great one numerous time really author magical story telling", "genres": ["Fiction & Literature"], "summary": "Steinbeck's tough yet charming portrait of people on the margins of society, dependant on one another for both physical and emotional survival.\r\n\r\nUnburdened by the material necessities of the more fortunate, the denizens of Cannery Row discover rewards unknown in more traditional society. Henry the painter sorts through junk lots for pieces of wood to incorporate into the boat he is building, while the girls from Dora Flood’s bordello venture out now and then to enjoy a bit of sunshine. Lee Chong stocks his grocery with almost anything a man could want, and Doc, a young marine biologist who ministers to sick puppies and unhappy souls, unexpectedly finds true love. Cannery Row is just a few blocks long, but the story it harbors is suffused with warmth, understanding, and a great fund of human values.\r\n\r\nFirst published in 1945, Cannery Row focuses on the acceptance of life as it is—both the exuberance of community and the loneliness of the individual. John Steinbeck draws on his memories of the real inhabitants of Monterey, California, and interweaves their stories in this world where only the fittest survive—creating what is at once one of his most humorous and poignant works. In Cannery Row, John Steinbeck returns to the setting of Tortilla Flat to create another evocative portrait of life as it is lived by those who unabashedly put the highest value on the intangibles—human warmth, camaraderie, and love.", "asin": "014200068X", "rank": "21135", "city": "Monterey", "image": "https://images-na.ssl-images-amazon.com/images/I/51pKtoV%2Bd2L.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}