{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 33, "rating": 3.9, "reviews": [{"review_sentiment": 2.0, "review_text": "It was not what I expected.  Way to much irrelevant details in my opinion. I do like this author's other WWII books."}, {"review_sentiment": 5.0, "review_text": "Antony Beevor is simply a marvelous writer, and the ability to use his wife's knowledge and experience really enriches this book. The use of Diana Cooper's father's diaries (and his memoir filled out with the daughter's memories) is a major strength of this account of one of the most fascinating and troubling eras of French history. The book has wonderful variety and richly evocative accounts of many leading figures and events. A joy to read and savor."}, {"review_sentiment": 4.0, "review_text": "I have several criticisms, which prevented me from rating it five stars.  There were a great number of names of famous (?) persons in all walks, art, literature, politics, military – you get the picture.  They breakdown into three categories: people you have never heard of, peoples whose name you vaguely recognize and people you know about (the largest group).  The author is British and he assumes everyone knows who he is talking about, this may be true for the English and Europeans but not so for Americans.  He should revise the book to give a one or two sentence biography the first time a name is mentioned.  The first part of the book describing French politics before the war is incomprehensible; in his defense, I spoke to a good friend from Paris and he says the French cannot figure it out either.  The last part of the book is a mad race to bring the book forward after 1949.  It is outside the scope of the book and unnecessary.  Otherwise – great, I enjoyed it."}, {"review_sentiment": 5.0, "review_text": "I've read most of Mr. Beavor's books, detail by detail. More than you'll ever need to know about the Paris Occupation"}, {"review_sentiment": 5.0, "review_text": "Engrossing, detailed and lively account of life, culture, politics and personalities."}, {"review_sentiment": 3.0, "review_text": "Ok book!  Loved all the rest of Beevor's work in his other books.  This one had too much French without being interpretated.  Expected more information about Vietnam.  It did highlight how sorry the Grench are!!!  Currently reading After the Occupation: The Brutal Occupation of the Allies which really highlights the duplicity of the French!!!!"}, {"review_sentiment": 3.0, "review_text": "Love the detail Beevor always delivers.  This was the third of his works for me and I'm never disappointed!"}, {"review_sentiment": 4.0, "review_text": "A fascinating story well told: about France occupation, collaboration of Vichy, the great purges and reglements des comptes and Communist terror after the war, De Gaulle's grab to power and his later resignation, the frictions between him and the hated Anglo-Saxons, brutal and uneven justice meeted out against real or imagined collaborators, misery and hunger in post-war Paris, at the same time luxury among occupation officers and diplomats, class warfare and endless strikes, the tensions between militant Communists, the democratic centre and the Gaullists at the right, a vivid nightlife, and a great deal of intellectual creativity amongst writers, philosophers and artists, all this beautifully woven together and well told with hundreds of more or less interesting anectodes. Most focus on happenings and scandals amongst the upper classes, diplomats (including Cooper's grandfather-ambassador, whoses diaries and correspondence are extensively quoted).In the end all of this namedropping, who had what for dinner, who had an affair with whom, who was gay or not, becomes a bit tiresome. Also I find it a bit bizarre that the cover tells us that this is a funny story. Too many people did suffer, were shot or beaten to death in this book, not funny at all, rather a lot of senseless suffering"}, {"review_sentiment": 4.0, "review_text": "The great historian antony beevor is having fun with this one. All sorts of  stories of the horror and joy of paris at liberation and before and after. liberation. Display of large egos interacting which is at times funny."}, {"review_sentiment": 4.0, "review_text": "A very detailed analysis of French politics throughout the 20th century."}]}, "authors": ["Antony Beevor", "Artemis Cooper"], "isbn": "0142437921", "longitude": 2.3514992, "periods": ["1900s"], "title": "Paris After the Liberation 1944-1949", "word_cloud": "expect much irrelevant detail opinion like author simply marvelous writer ability use wife knowledge experience really enrich use father diary memoir fill daughter memory major strength account fascinate trouble era french history wonderful variety richly evocative account many leading figure event joy savor several criticism prevent rating star great number name famous person walk art literature politics military get picture breakdown category people never hear people name vaguely recognize people know largest group author british assume everyone know talk true sentence biography first time name mention first part describe french politics war incomprehensible defense speak good friend say french figure last part mad race bring forward scope unnecessary great enjoy beaver detail detail more ever know engross detailed lively account life culture politics personality much french interpretated expect information highlight sorry read really highlight duplicity french detail always deliver third work never disappoint fascinating story well tell occupation collaboration great purge regalement ed competes communist terror war grab power later resignation friction hat brutal uneven justice teem real imagined collaborator misery hunger time luxury occupation officer diplomats class warfare endless strike tension militant democratic center gaul lists right vivid nightlife great deal intellectual creativity among st writer philosopher artist beautifully weave together well hundred le interesting anecdote most focus happening scandal among st upper class diplomat include whose diary correspondence extensively quote end namedropping dinner affair gay become bit tiresome also find bit bizarre cover tell funny story many people suffer shot beat death funny rather lot senseless suffer great historian antony beef fun sort story horror joy large ego interact time funny detailed analysis french politics century", "genres": ["History", "WWII"], "summary": "In this brilliant synthesis of social, political, and cultural history, Antony Beevor and Artemis Cooper present a vivid and compelling portrayal of the City of Lights after its liberation. \r\n\r\nParis became the diplomatic battleground in the opening stages of the Cold War. Against this volatile political backdrop, every aspect of life is portrayed: scores were settled in a rough and uneven justice, black marketers grew rich on the misery of the population, and a growing number of intellectual luminaries and artists including Hemingway, Beckett, Camus, Sartre, de Beauvoir, Cocteau, and Picasso contributed new ideas and a renewed vitality to this extraordinary moment in time.\r\n\r\nRevised Edition\r\n\r\n\"A rich and intriguing story which the authors disentangle with great skill.\" Sunday Telegraph", "asin": "0142437921", "rank": "703247", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41-bbmheDML.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}