{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 33.3024309, "ratings": {"num_ratings": 33, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book, unique memoir of the Persian Gulf War"}, {"review_sentiment": 5.0, "review_text": "I've meant to write this review for a few years now.As an Operation Desert Storm veteran (7/101st ABN), I picked up \"Baghdad Express\" in 2004 because I yearned to peek into other perspectives from the conflict. Joel's perspective is raw, genuine, and his writing edges on philosophical - yet remains easy to relate to. His experiences, while vastly different than mine (chiefly, that he was a Marine, and I was in the Army) still resonated soundly.This is not a war-glorifying autobiography, written to bolster the author's ego; it is his honest, personal experiences, in a prose that invites reflection.Those looking for insight into the reality of \"war\" (not strictly combat), need look no further than this book. The boredom, the arbitrary nature of being a Soldier (or Marine, in this case), on a day-to-day basis is well portrayed and elegantly written.The Gulf War was, and is likely to remain, one of the most unique U.S. military campaigns and I feel \"Baghdad Express\" tells its story very well."}, {"review_sentiment": 5.0, "review_text": "Interesting book"}, {"review_sentiment": 5.0, "review_text": "Im a Marine veteran of the Gulf War and was a member of the Bagdad Express as well. Although the author came accross as a slacker as a Marine it was enlighting to ready that he experienced some of many of the same things.it was also enlightening to learn of some of the findings that we were exposed to with the chemicals and drugs we were given and some of the episodes of war like chemeical attacks that we were exposed to as well thay most of us were unaware of whike fighting. Overall i found the book to be very informative. Hopefully his fact were provien and justified properly."}, {"review_sentiment": 2.0, "review_text": "If you're in the military and looking for a story about the military, I certainly would not recommend this book. This self-absorbed self-described ****bird discusses the Marine Corps in probably the most disrespectful way I've heard. Not the Corps in general but he talks down about the Marines. From squabbling with the Chaplin over the definition of a word to passing judgement on pretty much every Marine he meets. I have to say the part I found the most difficult is when he spent time in \"The Pound\", changes the way he speaks to mimic his idea of black Americans and then raps to them because how else will they possibly understand Thoreau?I kept waiting for this book to get better and for him to realize that he is not too good for the Marines, as an overall Corps or to interact as a human being. This whole book was a justification of judgment. I struggled to finish the book because every time I finished a paragraph I had to actively stop my eyes from rolling and focus back on the page."}, {"review_sentiment": 5.0, "review_text": "Great book you won't be disappointed with the authers story."}, {"review_sentiment": 4.0, "review_text": "Hard core marines would probably not approve of this book. Because as a marine, Turnipseed is something less than gung-ho. His approach to the military life is much too casual. Of course he's telling only about his tour in Saudi Arabia during the first Gulf war, where he was a truck driver/mechanic with a philosophic bent - along with a bent sense of humor and seriously skewed world view. By the time his Motor Transport Battalion out of Minnesota was deployed to the Gulf, Turnipseed had already been in the USMC Reserves for several years. At the time of his activation he was lounging his way through the University of Minnesota, majoring in (what else?) philosophy. His enthusiasm over being reactivated knew bounds, if you know what I mean. But he didn't feel that this particular little war was worth going to Canada for. So he packed one of his seabags full of books and substituted cigarettes for his pipe and was off to Arabia. For a kid who got knocked around and bounced around between divorced parents and uncaring step-parents and grandparents, I have to admire this guy. He straightened himself out. Looking at the kind of marine he is by 1990, it's hard to believe he was a boot camp honor grad, but he says he was. While it's true Turnipseed never saw combat, you gotta understand that MOST of the troops in that short-lived little skirmish never saw combat. It was mostly a kind of remote-controlled war filled with countless hours of boredom broken up by marathon sessions of self-abuse. (Read Swofford's Jarhead.) As a military memoir, this is a very strange animal. This Turnipseed guy, while maybe (at least in some people's minds) a disgrace to the Corps, is a very thoughtful and a very funny guy. I liked this book. - Tim Bazzett, author of SOLDIER BOY: AT PLAY IN THE ASA"}, {"review_sentiment": 4.0, "review_text": "I have read plenty of books over here, there are times when there is little else to do. It is too hot to be outside, you have nowhere to go anyway on a FOB in the middle of a desert, you have no work assigned, and time is slow. The boredom is mind-numbing. There are also times, like the author describes, when you go for weeks and months on end sleeping maybe four hours a day. The sun just keeps spinning around the sky and the relentless days just keep coming at you. You get no break, there is no mercy.Turnipseed captures very accurately what it is like to be deployed to this region. Some things have changed, of course. If the author were here now, he might find things a little more exciting for a truck driver. But some things never change, the tent cities, the boredom, the exhaustion and stress.  Even those of us who never leave the wire deal with the constant possibilities of incoming rounds, rockets, and mortars. There is a fear that haunts your sleep at the beginning and an unending tension which must eventually replace it.As for Turnipseed's philosophic and individualist bent, that is not at all as uncommon as some reviewers think in military members. We are not mindless faceless followers of orders. The military, ironically, attracts people with issues with authority. The results are often humorous, unless of course you are the one dealing with the consequences of your smart attitude. The military is far more educated than in past generations. Sure, plenty of kids still join straight out of high school. But plenty more start or even finish college, and have no way to realistically pay for it and so end up in the service, often in the support branches like Turnipseed. (Others join for patriotism, or bravado, or just plain curiosity.)Most of us are younger than thirty: young people throughout history have displayed an individualistic streak, and a belief that they are the first ones to think and feel what they are going through. Being young is a crime of which we are all guilty at one time or another, I forget where I first heard that quote. Turnipseed at least was a young man who did not shirk his duty, as so many in the last generation did.As for Turnipseed's isolation, it is largely self-imposed, and he doesn't deny that. Some of it, too, is a reflection of hard times from his youth. But he does outgrow it. He comes to realize that not all is black and white, that philosophy can inform life, but in the end it just has to be lived, in all its ups and downs. You will never fit in, being human entails some level of isolation. You can't attach more meaning to ideas than to people who would and sometimes do risk their lives for you.But all of this is just an aside. The author captures the military experience perfectly, that strange mix of cameraderie and pride at the ideals which inspire the great institution, with the apathy and disillusionment and sheer exhaustion which ensue when we go to carry out our orders. There are mix-ups and mess-ups (to put it in polite civilian), rumors and constant changes of plans. You question sometimes what order your leaderships' priorities are in - the mission, your safety, their careers and politics? But you will always feel a certain pride at having served, despite it all. The cause is worth it.The military, above all, teaches you the limits of what you can endure and how insignificant your feelings and self-esteem are to those limits, contrary to what everyone has told you to that point in your life. This is a difficult but necessary lesson to my generation. It's hard to explain the military or war to anyone who has not been there, but Turnipseed does so deftly with a concise and often hilarious style I have not encountered in other memoirs of modern war. For a view of the other side, non-veterans should read this book. For those who have served or are serving, you will smile and nod knowingly throughout, and may even find some of the quotes appropriate."}, {"review_sentiment": 3.0, "review_text": "The first few chapters I had a hard time reading through as there was an excessive amount of profanity.  By the middle of the book I was able to comprehend what he was saying.  The last half of the book was interesting and showed his development from an outcast, to finally being accepted by people in the Dog Pound.  I liked that there was an underlying message of his change/maturity, but that he also gave a nice portrayal of the war.  With a friend that's currently a Marine in Iraq it was good to be able to have a taste of what he is going through."}, {"review_sentiment": 3.0, "review_text": "This is actually a good read, and I could have gone either way 3 to 4 stars.  Turnipseed makes this interesting reading, despite throwing in various quotes from philosophers.  I am not sure his fellow grunts understood him, and maybe I don't either.  His job as a reserve Marine was to drive trucks from the rear to near the front.  Most of his time was not spent in hazardous duty, despite the SCUDS and NBC threats.  What he had to do was routine duty, that most frontline soldiers would grab for.  Despite his duties, he makes this interesting reading by relating his experiences during the first Gulf War.This is a fairly short read about the experiences of one soldier in war, and war for him was mostly in the rear.  His philosohical notions sometimes gets in the way of the read. I especially enjoyed his chapter on the black planet."}]}, "authors": ["Joel Turnipseed"], "isbn": "0142001538", "longitude": 44.3787992, "periods": ["1900s"], "title": "Baghdad Express: A Gulf War Memoir", "word_cloud": "unique mean write review year veteran pick yearn peek perspective conflict perspective raw genuine writing edge philosophical yet remain easy experience vastly different mine chiefly still resonate autobiography write bolster author ego honest personal experience prose invite look insight reality strictly combat need look boredom arbitrary nature case basis well portrayed elegantly likely remain unique military campaign feel tell story well interest veteran member well author come across slacker en lighting ready experience many also enlighten learn finding expose chemical drug give episode chemical attack expose well that unaware fight overall find informative fact proven justify properly military look story military certainly discuss probably disrespectful way hear not general talk marines squabble definition word pass judgment pretty much meet say part find difficult spent time change way speaks mimic idea black rap else possibly keep wait better good overall interact human whole justification judgment struggle finish time finish paragraph actively eye roll focus back page disappointed anther story core marine probably marine something le approach military life much casual course tell tour first truck philosophic bent bent sense humor seriously skew world view time deploy already several year time activation lounge way majoring else philosophy enthusiasm reactivate knew bound know mean feel particular little go pack teabags full substitute cigarette pipe get knock bounce divorced parent uncaring grandparent admire guy straighten look kind marine hard believe boot camp honor grad say true never saw combat get ta understand troop little skirmish never saw combat mostly kind fill countless hour boredom broken marathon session read military strange animal guy maybe least people mind disgrace thoughtful funny guy like author plenty time little else hot nowhere anyway desert work assign time boredom also time author describes go week month end sleep maybe hour day sun keep spin sky relentless day come get break capture accurately deploy region thing change course author thing little exciting truck driver thing never change tent city boredom exhaustion stress even never leave wire deal constant possibility incoming round rocket mortar fear haunt sleep begin unending tension eventually philosophic individualist bent uncommon reviewer think military member mindless faceless follower order military ironically attract people issue authority result often humorous course dealing consequence smart attitude military far educate past generation sure plenty kid still straight high school plenty start even finish college way realistically pay end service often support branch join patriotism bravado plain curiosity most younger thirty young people history display individualistic streak belief first one think go young crime guilty time forget first hear quote least young man shirk duty many last generation isolation largely reflection hard time youth come realize black white philosophy inform life end live ups down never fit human entail level isolation mean idea people sometimes life aside author capture military experience perfectly strange mix camaraderie pride ideal inspire great institution apathy disillusionment sheer exhaustion ensue go carry order polite civilian rumor constant change plan question sometimes order leadership priority mission safety career politics always certain pride serve cause worth military teach limit endure insignificant feeling limit contrary everyone tell point life difficult necessary lesson generation hard explain military anyone deftly concise often hilarious style encounter memoir modern view side serve serve smile nod knowingly even quote appropriate first chapter hard time read excessive amount profanity middle able comprehend say last half interest show development outcast finally accept people like underlying message also give nice portrayal friend currently good able taste go actually good go way star make interest read throw various quote philosopher sure fellow grunt understood maybe either job reserve drive truck rear front time spend hazardous duty threats routine duty front line soldier duty make interest read relate experience first fairly short experience soldier mostly philosophical notion sometimes get way especially enjoy chapter black planet", "genres": ["Memoir"], "summary": "In early summer of 1990, Joel Turnipseed was homeless—kicked out of his college's philosophy program, dumped by his girlfriend. He had been AWOL from his Marine Corps Reserve unit for more than three months, spending his days hanging out in coffee shops reading Plato and Thoreau.\r\n\r\nThen Saddam Hussein invaded Kuwait.\r\n\r\nTurnipseed's unit was activated for service in Operation Desert Shield. By January of '91, he was in Saudi Arabia driving tractor-trailers for the Sixth Motor Transport Battalion—the legendary \"Baghdad Express.\" The greatest logistical operation in Marine Corps history, the Baghdad Express hauled truckloads of explosives and ammunition across hundreds of miles of desert. But on the brink of war, Turnipseed's greatest struggles are still within. Armed with an M-16 and a seabag full of philosophy books, he is a wise-ass misfit, an ironic observer with a keen eye for vivid detail, a rebellious Marine alive to the moral ambiguity of his life and his situation.\r\n\r\nDeveloped from Turnipseed's 1997 feature article for GQ Magazine, this innovative memoir—simultaneously terrifying and hilarious, equal parts Catch-22 and Catcher in the Rye—explores both the absurdities of war and the necessity of accepting our flawed world of shadows. With expansive humanity and profane grace, Turnipseed finds the real-world answers to his philosophical questions and reaches the hardest peace for any young man to achieve—with himself.", "asin": "0142001538", "rank": "1427167", "city": "Baghdad", "image": "https://images-na.ssl-images-amazon.com/images/I/51Wu%2B3tT2pL.jpg", "country": "Iraq", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}