{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 187, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "No question,the novel is better"}, {"review_sentiment": 4.0, "review_text": "Great classic."}, {"review_sentiment": 4.0, "review_text": "Very funny/sarcastic story. Loved it!"}, {"review_sentiment": 4.0, "review_text": "I'd not read any Graham Greene and wanted to acquaint myself.  It's interesting, beautifully written, a little odd.  But I do recommend it and shall read more of this author.  I do remember seeing the movie and liking it...it's a bit comical too."}, {"review_sentiment": 5.0, "review_text": "Awesome story."}, {"review_sentiment": 4.0, "review_text": "Good book considering the time period it was written.  Not very long but most of the mid century stuff has trouble keeping my attention, not a huge fan of the writing style honestly.  But this book was a nice story and a quick read and the \"British\" humor I guess you would call it, was entertaining."}, {"review_sentiment": 5.0, "review_text": "enjoyed it"}, {"review_sentiment": 1.0, "review_text": "I this book is confirmation that I (generally) don’t like thing written in the 50’s and 60’s.  The language and the style just seem to be too aloof for me.  The story doesn’t get going until about half way through by which time I was annoyed. The characters are stagnate and the plot uninteresting which added to my overall dislike of this book."}, {"review_sentiment": 2.0, "review_text": "\"Our Man in Havana\" by Graham Greene is a farce- a spoof of the British intelligence system and its fight to crush Communism in the late 1950s. The setting is Havana, Cuba- where an innocent vacuum cleaner salesman named Wormold is somehow persuaded to become a secret agent- inside of a men's restroom by a total stranger. The entire book is filled with dialogue that surely was intended to be quite hysterical, but which today- 59 years later- reads as both boring and irrational. Greene was a talented author and he titled this one with the subheading \"An Entertainment\"- a sign to the novice Greene reader that the work was a farce, with whole sections tied together by oxymoronic statements, silly commentary and entire dialogues which simply make no sense other than to say \"Life is absurd- and this is proof.\" I wanted very much to like the book- as it was recommended reading for my upcoming Smithsonian Tour of Cuba- but I must say I would much more highly recommend Ernest Hemingway's \"The Old Man and the Sea\" or a more recent work, \"Sailing to Hemingway's Cuba\" by Dave Schaefer. I found myself having to put the book down several times- as the dialogue was simply ridiculous, the interactions between the characters quite silly. I give this book 2-stars out of five- and recommend it only to those who ABSOLUTELY LOVE farces."}, {"review_sentiment": 4.0, "review_text": "This spy novel isn't quite an outright farce but it shows the ludicrous side of the intelligence game. When a British expatriate who works as a vacuum cleaner salesman in Havana is practically forced to become an agent of British intelligence he has no idea how to proceed. Acting on advice from his German friend he simply makes up agents and intelligence and soon \"our man in Havana\" is one of the British intelligence community's more valuable assets. The web of deceit (and bewildered bumbling ineptness) that follows is by turns humorous and tragic (I won't tell you which note it ends on).Overall, this was an enjoyable book (much more so than LeCarré's copycat Taylor of Panama that had a much grimmer tone). Not only is the story entertaining, but you are treated to a backdrop of pre-revolutionary Cuba...not a very edifying spectacle, but interesting. This is definitely worth a read as relatively realistic spy fiction (as opposed to the James Bond secret agent style) or even just as a man-trapped-by-circumstances kind of classic."}]}, "authors": ["Graham Greene"], "isbn": "0142438006", "longitude": -82.3658671, "periods": ["1900s"], "title": "Our Man in Havana", "word_cloud": "question better classic very story love want acquaint interest beautifully write little odd recommend see movie like bit comical story good consider time period write not long mid century stuff trouble keep attention huge fan write style honestly nice story quick british humor guess entertain enjoy confirmation generally thing write language style seem story get go half way time annoy character stagnate plot uninteresting add overall dislike spoof british intelligence system fight crush late setting innocent vacuum cleaner salesman name somehow persuade become secret men restroom total stranger entire fill dialogue surely intend quite hysterical year read boring irrational talented author title subheading sign novice work farce whole section tie together oxymoron statement silly commentary entire dialogue simply make sense say proof want much recommend reading upcoming smithsonian much highly recommend recent work find put several dialogue simply ridiculous interaction character quite silly give farce spy quite outright farce show ludicrous side intelligence game british expatriate work vacuum cleaner salesman practically force become agent british intelligence idea proceed advice friend simply make agent intelligence soon british intelligence community valuable asset web deceit bewilder bumble ineptness follow turn humorous tragic end enjoyable much copycat much grimmer tone not story entertain treat backdrop edify spectacle interest definitely worth relatively realistic spy fiction oppose secret agent style even kind classic", "genres": ["Fiction & Literature", "Cold War", "Politics", "Satire"], "summary": "MI6’s man in Havana is Wormold, a former vacuum-cleaner salesman turned reluctant secret agent out of economic necessity. To keep his job, he files bogus reports based on Charles Lamb’s Tales from Shakespeare and dreams up military installations from vacuum-cleaner designs. Then his stories start coming disturbingly true…\r\n \r\nFirst published in 1959 against the backdrop of the Cold War, Our Man in Havana remains one of Graham Greene’s most widely read novels. It is an espionage thriller, a penetrating character study, and a political satire of government intelligence that still resonates today. This Penguin Classics edition features an introduction by Christopher Hitchens.", "asin": "0142438006", "rank": "45551", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/41M5AytYrNL.jpg", "country": "Cuba", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}