{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 95, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent book, and very readable. The author has the talent to write so that paragraphs can be read in one scan. If you have ever seen an old building in the French countryside and thought \"We could fix that up and live here?\", this is your book.  It's a bit different to Peter Mayle's book A Year in Provence, with more focus on growing Olives and the challenges of doing it all while still doing one's day job (in other countries no less ) and with little funds to do it."}, {"review_sentiment": 5.0, "review_text": "Funny, poignant, romantic, and entertaining!"}, {"review_sentiment": 5.0, "review_text": "Read in one day!  Wonderfully written as it weaves you right into their lives. Such a happy  story of love."}, {"review_sentiment": 5.0, "review_text": "Great read. Really enjoyed the book."}, {"review_sentiment": 5.0, "review_text": "What a great read. This book was selected for Book Club. Carol Drinkwater is a fabulous writer. I was captured from the first page. I almost felt like I was in the South of France. She has a whole series of the Olive books and I plan on reading them all. After hearing about her experiences, I don't plan on buying a home in France, however. The regulations and ability to get anything done are killer."}, {"review_sentiment": 5.0, "review_text": "This was my second reading of this wonderful book.  Carol has such a talent for expressive writing and made me want to go to France and live there.  I enjoyed every minute of the book again and will read the sequels as soon as I can.  I enjoyed every minute of it and was transported to the beautiful place where the Olive Farm is situated."}, {"review_sentiment": 5.0, "review_text": "So glad I found this on Amazon. It's a very fascinating book and I love listening to Carol Drinkwater's narration."}, {"review_sentiment": 5.0, "review_text": "Great read!  Enjoyed it very much."}, {"review_sentiment": 5.0, "review_text": "Great read"}, {"review_sentiment": 4.0, "review_text": "I enjoyed that it was more down to earth than some of this genre and they seemed to meet real people - of all stripes - in their quest to make this farm a home. Some descriptions made it so I could smell the earth and feel the warmth of the South of France."}]}, "authors": ["Carol Drinkwater"], "isbn": "0142001309", "longitude": 0.0, "periods": ["1900s"], "title": "The Olive Farm: A Memoir of Life, Love, and Olive Oil in the South of France", "word_cloud": "author talent paragraph scan ever see old building countryside think bit different focus grow olive challenge still day job country le little fund poignant romantic entertaining read day write weave right life such happy story love enjoy great select fabulous writer capture first page almost felt whole series plan read hear experience plan buy home however regulation ability get anything do killer second reading wonderful talent expressive write make want live enjoy minute sequel soon enjoy minute transport beautiful place situate so glad find fascinate love listen narration much great enjoy earth genre seem meet real people strip quest make farm home description make earth warmth", "genres": ["Memoir", "Travel Writing", "Food and Wine"], "summary": "When the opportunity arises for Carol Drinkwater and her husband, Michel, to purchase ten acres of a disused olive farm in the South of France, the idea seems ridiculously farfetched.\r\nAfter all, they are newlyweds of limited means, and Carol is still adjusting to her role as stepmother to Michel’s two daughters. \r\n\r\nBut the splendor of the region becomes a force they are unable to resist. Michel presents their life savings to the real estate broker as a down payment for the farm, embarking the family on an adventure that will bring them in close contact with the charming countryside, querulous personalities, petty bureaucracies, and extraordinary wildlife (including a ravenous wild boar) of Provence. \r\n\r\nIn the spirit of Peter Mayle’s A Year in Provence and Frances Mayes’s Under the Tuscan Sun, The Olive Farm is a splendid tour of southern France, from the glamour of Cannes to the Iles de Lérins and a Cistercian monastery on the tiny isle of St. Honorat, to Carol Drinkwater’s own small piece of land, which she transforms from an overgrown plot of weeds and ivy to a thriving, productive farm, transforming in the process her own dream of a peaceful and meaningful life into reality.", "asin": "0142001309", "rank": "446956", "city": "Cannes", "image": "https://images-na.ssl-images-amazon.com/images/I/51sSAIXGR6L.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}