{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 27, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Book arrived as described."}, {"review_sentiment": 5.0, "review_text": "Great and excellent.. I'm very confortable with this and it works in an excellent way; perfect stuff and just awesome!"}, {"review_sentiment": 5.0, "review_text": "YOUTH: SCENES FROM A PROVINCIAL LIFE II is the second installment of Coetzee's four-part fictionalized autobiography. It begins in 1959 with John, a 19-year-old university student and aspiring poet, living in one-room flat in Cape Town. It ends with John at 24, living in a one-room flat about an hour from London, where he works as a programmer.During these five years, John experiences his youth--that is, he establishes a prickly independence from his family; he tests the values and judgments of his chosen authority figures; and he suffers as life relentlessly pushes back against his naïve preconceptions. In the case of the aspiring-writer John, this pushback is especially powerful in his search for a suitable female, since he believes that the right woman \"...will see through the opaque surface he presents to the world, to the depths inside.\" And: \"The right woman will unlock the hidden intensities of passion in him.\" In doing so, John, burdened with centuries-old ideas about a muse, also believes that the love of this chosen-one will unlock the blocked flow of his poetry.YOUTH is my sixth Coetzee book and my second--the amazing Summertime: Fiction was the first--of his fictionalized autobiography. All six of these books feature austere yet elegant prose that carries the reader to insights that Coetzee makes both fresh and powerful. In the novels I've read (Waiting for the Barbarians: A Novel (Penguin Ink) (The Penguin Ink Series),Life and Times of Michael K: A Novel,Age of Iron, and Disgrace: A Novel) this style enables profound truth-telling that mingles with loathing of self and society. In SUMMERTIME, this style enables Coetzee to explore different truths about a successful deceased novelist, who was awkward and pathetically lost in his thirties. So how does this style work in YOUTH? To my surprise, Coetzee uses the same spare prose and implacable honesty, mixes in his usual dollop of self-loathing, and produces a book that is, in many spots, funny, truly funny. Imagine my surprise.IMHO, YOUTH has many wonderful moments. But I have two favorites. In the first, the 24-year-old John, who is profoundly influenced by the literary judgments of Eliot and Pound, finds Samuel Beckett's Watt in a bookstore. \"From the first page he knows he has hit on something... unlike Beckett's plays... there is no clash, no conflict, just a voice telling a story, a flow continually checked by doubts and scruples, its pace fitted exactly to the pace of his own mind. WATT is also funny, so funny that he rolls about laughing.\" After five years, in other words, John serendipitously discovers his true mentor.For me, a second great moment in YOUTH also came when John was 24. Then, he is hilariously considering his path-of-least-resistance career, as well as the dumb power of artistic clichés, which he embraces due to his need, as an artist, to test the depth and edges of experience. \"It is sophistry,\" the self-exasperated John rants. \"... that is all, contemptible sophistry.\" If he's going to write, this maturing John decides, he is going to have to do it himself.Highly recommended."}, {"review_sentiment": 4.0, "review_text": "This is the kind of book that stays with a reader long after the final page.  Coetzee once again delivers a kind of realism through words that few can achieve better."}, {"review_sentiment": 5.0, "review_text": "Coetzee can come across as cool, detached, and even cruel in the second installment of his autobiographical series, Youth: Scenes from a Provincial Life II.  Part of it the third person narration.  Coetzee puts distance between himself and the narrative by referring to himself as James Coetzee.  Part of this may be a post-modernist trick.  We are not to believe too strongly that Coetzee is actually portraying himself in this work, but rather a facsimile of that self.But it is hard to let Coetzee off with this.  The book, if it is nothing else, is bone rattling honest about the shortcomings of this character named Coetzee; we see all his missteps, almost rendering the reader a voyeur.  We get to watch all the stumbling of the young Coetzee as he tries to free himself of the stifling provincial existence of South Africa for the cosmopolitan life of London. And how can we not see it as a failure?  Coetzee all but tells us that it is?This book is really a monument to the failure of youth.  There comes a time when young men and women realize that they will fail in life; that dreams, those wonderful time consumers of thought and energy, will probably never come to fruition.  Coetzee is just more honest about this basic fact than most of us can bear."}, {"review_sentiment": 5.0, "review_text": "Sometimes there is an advantage in reading books by the same author in reverse order. This has been the case here for me. Having read and greatly enjoyed his most recent Summertime: Fiction, in which Coetzee creates an intriguing portrait of one John Coetzee, deceased, a kind of alter ego, and whose personality emerges through interviews and recollections by several friends and acquaintances. In his 2002 portrait \"Youth\" he distances himself from the younger John by writing what he terms an \"autre-biography\"*). Written in the present tense and in the third person, the story has a lively and immediate reality while at the same time suggesting a clear distance between the author and his subject. With the hindsight of SUMMERTIME, this reader for one, wondered how much Coetzee has creatively changed or adapted the realities of John's growing up story to suit his idea of who he might have been.Coetzee concentrates on a decisive period in John's life - from his mid-teens to his early twenties. In this coming of age portrait of John, we see an awkward youth, whose mind hovers between ambitious dreams and self-doubt. He is a young South African, determined to escape the confines of family and the restrictions in his country. Coetzee presents us with a fascinating and often entertaining quasi-memoir, set against the backdrop of a tumultuous period in history: The frequent unrests and subsequent violent suppression of protests by South African blacks (e.g. Sharpville), the Cuban missile crisis, the declaration of South Africa as a republic, etc.John, while a reasonably successful mathematics student, sees his real calling in being a poet. Poetry for him is the ultimate in artistic expression, prose would only be second best. He also dreams of being kissed by a muse, falling madly in love and that everything else will follow from there smoothly and happily.  Life, not surprisingly, turns out very differently and Coetzee's sense of irony is subtle, yet evident throughout the novel. John is somewhat of a reluctant student of passion, experiencing it more vividly in his mind than he is able to transpose it into reality.Leaving South Africa, he moves to London and from there to a country estate in Berkshire where he is employed as a computer programmer. The description of his daily routines, in North London in particular, and his commentary on life around him are wonderfully accurate, perceptive and also funny. Having lived there for many years, I could relate to many of John's experiences. His ambitions, on the artistic and the personal fronts, don't progress as hoped and are, at least for a while, pushed to the back of his mind. Somewhat disillusioned John nevertheless finds a certain level of inner peace. However, this state of mind and body can only be temporary and he soon struggles again with options and alternatives to move on. Will he get back to his dream of being a poet? Or will he have to settle for second-best and try his hand on prose.J.M. Coetzee writes in a dry, yet engaging style. The reader feels empathy with the subject and despite Coetzee's detached and often ironic analysis of John's complex inner struggle, the reader cannot help but smile at times as John describes the environment around him. [Friederike Knabe]*) In an interview with David Attwell in 2002, Coetzee asserted that \"all autobiography is autre-biography\", or the biography of an other. \"Genre definitions\", he said, \"- at least those definitions employed by ordinary readers - are quite crude."}, {"review_sentiment": 4.0, "review_text": "Youth is the second in Coetzee's fictionalized autobigraphical series.  I read it right after reading Boyhood.  Though it is a continuation, it is not necessary to read Boyhood first.In Youth, John Coetzee meanders aimlessly in Capetown while completing university.  All the while, he dreams of the excitement of being young angst ridden artist in London.  Paris would be his preference but he figures that lack of fluency in French would be an impossible hurdle.  He is convinced that South Africa will self destruct and he needs to get out.When he lands in London, it is not what he expects.  He ultimately settles into what is, for him, a drudgerous life working as a programmer at IBM.  He does have affairs but largely remains unfulfilled and an outsider.  Though IBM is passable in some ways, he still longs to be an artist.This is a study in a young foreign outsider in London in the 1960s.  He is slightly embarassed to be from South Africa and never seems to fit in.As usual, Coetzee's prose is flawless and his description of the inner thoughts of the main character rings with authenticity.It is uncertain how much is fiction and how much Coetzee's real experience but it's definitely an interesting read.While it is not one of Coetzee's most important works, it's still very good.I recommend it as I do pretty much everything by Coetzee.  To me, he is clearly one of the greatest writers of our time."}, {"review_sentiment": 5.0, "review_text": "This book by South African writer J. M. Coetzee is not exactly an autobiography, as it recounts a few years of his life, from about the time he was 19 to his mid 20s, during the early 1960s. Though less than 200 pages long, this is hardly a fast read. Coetzee's writing style is not overly complex, but he packs so many things in it, in terms of ideas and reactions to the world around him, that you have to go slow in order to pay close attention. Not that the life shown here is particularly eventful, since most of the time he finds himself bored and lonely. A familiar theme in autobiographies by writers is growing up alone and with few friends and this book certainly shows this. If his male friends are few, his relationships with women are even worse, sordid and often abusive. The book starts in South Africa as the narrator finishes his degree in mathematics, while secretly dreaming of becoming a poet. After the Sharpeville massacre, he decides to move to London, where he works at jobs he finds depressing, first in IBM and then in a British computer firm. Far from being Swinging London, the English capital depicted in this book seems cold and depressing. The protagonist (presumably Coetzee himself) seems very selfish, and self possessed, seemingly incapable of developing a meaningful relationship with fellow human  beings. Coupled with a job that he finds meaningless, his only solace (aside with occasional casual sex) comes with reading poetry. Since the book ends when the protagonist is in his mid 20s, the immediate question after reading this book, is what happened to him after that, did he become wiser or did he grew up to be a bitter man."}, {"review_sentiment": 5.0, "review_text": "Coetzee's second autobiographical novel is a story of flights and also an 'Education sentimentale'.It is a flight from the oppressiveness of his family and the love of his mother - `the bond with the firstborn' -, from the socio-political situation in South-Africa - `an albatross around his neck' - and from mortgage shackles. In one word, it is a flight to freedom.He arrives in London, but the city turns him into a beaten dog: no work, no stay. He quickly understands that the struggle for life is still going on, that he will have to find his place in the world and that he has to prove that he belongs to this earth.Intellectually, he is attracted to Pure Thought (mathematics), but he also wants to become a poet. He makes his first encounters (through reading and radio programs) with world literature, e.g. Joseph Brodsky who teaches him that `poetry is truth'.Sentimentally, he has to fight against his own depths of coldness, callousness, caddishness, his lack of heat and heart. He falls in love with filmdivas, but his own love (better: sex) life is not that of a `fine' author.In impeccable prose, J.M. Coetzee painted without any shame a very realistic picture of a `Youth-struggle'.Not to be missed."}, {"review_sentiment": 4.0, "review_text": "It seems that Coetzee, winner of two Bookers, is taken awfully seriously.  And, that this is a book based upon his own formative years, adds to that pontificating ouvre.  I found the book to be awfully funny, as a Salinger-like view of youthful naivete and stumbling ambition, that may well be a look back with some wiser perspective and storytelling exaggeration.  Indeed, the novel's insulated viewpoint, exclusively that of this immature lad, cannot disguise the hilarity of his views of D. H. Lawrence, for instance, or his hormonal lassitudes with the women visiting his bed, for better or for worse.  That he takes it all so seriously cannot, it seems to me, be mistaken for the author's meaning it to be experienced at some remove as the follies and misplaced assured utterances of the would-be writer.  The ending is typically ambiguous, but does seem to be a turn into the temporary trap of middle-class white-collar life, which does not smoothly fit what has come before it.  That it is the subject of such a somber at-face-value reading does not match a closer (and less awe-struck) examination of the book."}]}, "authors": ["J. M. Coetzee"], "isbn": "0142002003", "longitude": -0.12574, "periods": ["1900s"], "title": "Youth: Scenes from Provincial Life II", "word_cloud": "arrive described comfortable work excellent way perfect stuff awesome second installment fictionalize autobiography begin university student aspire poet living flat end live flat hour work year experience youth establishes prickly independence family test value judgment choose authority figure suffer relentlessly push back nave preconception case push back especially powerful search suitable female believe right woman opaque surface present world depth right woman unlock hidden intensity passion burden idea muse also believe unlock block flow sixth second amazing first fictionalize autobiography feature austere yet elegant prose carry insight make fresh powerful novel wait barbarian style enable mingles loathe society style enable explore different truth successful deceased novelist pathetically lose thirty style work use spare prose implacable honesty mix usual dollop produce many spot funny truly funny many wonderful moment favorite first profoundly influence literary judgment find bookstore first page know hit something play conflict voice tell story flow continually check doubt scruple pace fit exactly pace mind also funny funny roll laugh year word serendipitous discover true second great moment also come then hilariously consider career well dumb power artistic cliche embrace due need artist test depth edge experience sophistry rant contemptible sophistry go write mature decide go recommend kind stay long final page delivers kind realism word achieve better come cool detach even cruel second installment autobiographical series person narration put distance narrative refer believe strongly actually portray work rather facsimile hard let nothing else bone rattle honest shortcoming character name see misstep almost render voyeur get watch stumbling young try free stifle existence cosmopolitan failure tell really monument failure youth come time young men woman realize fail dream wonderful time consumer think energy probably never come fruition honest basic fact bear sometimes advantage read author reverse order case have greatly enjoy recent create intrigue decease kind alter ego personality emerge interview recollection several friend acquaintance portrait distance younger write term present tense third person story lively immediate reality time suggest clear distance author subject hindsight wonder much creatively change adapted reality grow story suit idea decisive period early twenty coming age portrait see awkward youth mind hovers ambitious dream young south african determine escape confines family restriction country present fascinate often entertaining set backdrop tumultuous period history frequent unrest subsequent violent suppression protest south african black missile crisis declaration republic reasonably successful mathematics student see real call poet ultimate artistic expression prose best also dream kiss fall madly everything else follow smoothly happily surprisingly turn differently sense irony subtle yet evident somewhat reluctant student passion experience vividly mind able transpose move country estate employ computer programmer description daily routine particular commentary wonderfully accurate perceptive also funny live many year many experience ambition artistic personal front progress hop least push mind disillusion nevertheless find certain level inner peace however state mind body temporary soon struggle option alternative move back dream poet try hand write dry yet engage style feel empathy subject detach often ironic analysis complex inner struggle help time describe environment interview assert autobiography biography definition say least definition employ ordinary reader quite crude second fictionalize autobiographical series right read continuation necessary meander aimlessly complete university dream excitement young angst ridden artist figure lack fluency hurdle convince destruct need land expect ultimately settle drudgerous work programmer affair largely remain unfulfilled outsider passable way still longs study young foreign outsider slightly embarrass never seem fit usual prose flawless description inner thought main character ring uncertain much fiction much real experience definitely interest important work still recommend pretty much everything clearly greatest writer time south african writer exactly autobiography recount year time mid early le page long hardly fast write style overly complex pack many thing term idea reaction world go slow order pay close attention not show particularly eventful time find bore lonely familiar theme autobiography writer grow alone friends certainly show male friend relationships woman even worse sordid often abusive start narrator finish degree mathematics secretly dream become poet massacre decides move work job find depress first computer firm capital depict seem cold depress protagonist presumably seem selfish self possess seemingly incapable develop meaningful relationship fellow human being couple job find meaningless solace occasional casual sex come read poetry end protagonist mid immediate question reading happen become wiser grow bitter man second autobiographical story flight also flight oppressiveness family mother bond firstborn situation albatross neck mortgage shackle word flight arrive city turn beaten dog work stay quickly understand struggle still go place world prove belongs attract mathematics also want become make first encounter read radio program world literature teach fight depth coldness callousness caddishness lack heat heart fall love film divas better sex impeccable prose paint shame realistic picture miss seem winner take awfully seriously base formative year add pontificate find awfully funny view youthful naivete stumble ambition back wiser perspective storytelling exaggeration indeed insulate viewpoint exclusively immature lad disguise hilarity view instance hormonal lassitude woman visit bed better worse take seriously seem mistaken author meaning experience folly misplace assured utterance writer end typically ambiguous seem turn temporary trap smoothly fit come subject somber reading match closer le examination", "genres": ["Memoir"], "summary": "Book 2/3 in the Coetzee Autobiographic Series\r\n\r\nYouth's narrator, a student in 1950s South Africa, has long been plotting an escape from his native country. Studying mathematics, reading poetry, saving money, he tries to ensure that when he arrives in the real world he will be prepared to experience life to its full intensity, and transform it into art. Arriving at last in London, however, he finds neither poetry nor romance. Instead he succumbs to the monotony of life as a computer programmer, from which random, loveless affairs offer no relief. Devoid of inspiration, he stops writing and begins a dark pilgrimage in which he is continually tested and continually found wanting.\r\n\r\nSet against the background of the 1960s, Youth is a remarkable portrait of a consciousness turning in on itself. J. M. Coetzee explores a young man's struggle to find his way in the world with tenderness and a fierce clarity.", "asin": "0142002003", "rank": "689178", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/410nXAozMfL.jpg", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}