{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 50.110653, "ratings": {"num_ratings": 5, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "I wrote of Clare Dudman's novel One Day the Ice Will Reveal All Its Dead that it is \"equal parts science and poetry.\" Something similar could be said of her book 98 Reasons for Being, which tells the story of the historical Dr. Heinrich Hoffmann. He was the author of Struwwelpeter, or Shockheaded Peter, a German children's book of rhymed stories about, usually, naughty children and the horrible consequences of their misbehavior. Struwwelpeter was a big deal, wildly popular and much translated, but the Hoffmann on these pages, at least, was more concerned with his true calling in life: he served as doctor at Frankfurt's lunatic asylum in the mid-19th century. Dudman brings Hoffmann to life in these pages as he becomes obsessed with curing a new arrival at the asylum, a young Jewish woman, Hannah, who does not speak initially and seems mired in an overwhelming sadness. After the usual cures prove ineffective--and here the horrors of pre-modern psychiatric treatment are on display--Hoffmann adopts a radical approach: talking. His story, and then hers, slowly drip out during his sessions with the patient, so that the source of her misery is finally revealed while his trials and character are likewise laid bare. At the same time, the lives of the other residents of the asylum are explored, both the inmates and the attendants, who live on-site for extended periods. These are all fleshed out characters, very real in their faults and sorrows. It's all deeply moving and sad, in large part, and beautifully written throughout. Every time I opened the book I was spellbound by it. It is an added treat that some of Hoffmann's stories are featured in the book, fit between the chapters, and they are surprisingly relevant to the surrounding story."}, {"review_sentiment": 4.0, "review_text": "Overall, an excellent read. I found the characters to be extremely dynamic and multidimensional. The story was also at times heartbreaking as well as uplifting. Yet, it was the writing style that made this book exceptional to read. There were sections of narration that were interrupted by case studies performed by the psychiatrist as well as the thoughts inside the main character's mind. Though I would not go as far to say that it is postmodern, the way that the story is presented is certainly nontraditional.Basically, it is the story of a Jewish girl who is brought into a mental institution because she refuses to talk. Through her treatment, she encourages the doctor and other patients to open up and free themselves from their own demons. Of course, not all are saved and there are numerous characters that can be deemed as \"not good\". Still, the complexities of the characters makes them seem more real than the paper on which they are described."}, {"review_sentiment": 5.0, "review_text": "A moving and richly human novel of depth and understanding, at once a psychological and a historical novel.Claire Dudman offers an original and offbeat perspective of life in a Frankfurt assylum in the 1850s.A Jewish girl, Hannah Meyer, labelled as a nymphomaniac, is admitted to a Frankfurt insane assylum , in a deep and extremely debilitating state of melancholia. Dr Heinrich Hoffman, a Frankfurt physician who runs the sanatorium, and also the well known author of the book of children's poems known as Sturmwetpeter, undertakes to treat her, all treatments fail until Dr Hoffman patiently talks to her about his own life and patiently coaxes, slowly coaxes her out of her crippling melancholic state and teaches her to talk and respond again.Her own inner thoughts and recounting of her own inner thoughts are recounted in italics, used in an intelligent and pertinent way.Deeply in love with a German gentile who woos her and secretly  marries her, and then cruelly spurns her, with strong anti-Semitic words, this incident has brought on her depressive state. The novel also focuses on the staff and other inmates of the asylum.The novel also focuses on the staff and other inamtes of the assylum.It is at once a window into 19th century Germany, the progressive thinking of Dr Hoffman, the inner world of the mentally ill and the anti-Semitism of the time.An evocative novel despair and hope, love and cruelty, and ultimately the search for purpose and the reason for being, hence the name 98 reasons for being."}, {"review_sentiment": 4.0, "review_text": "This novel is not quick to read, and not a book that you can't put down.  The story is intelligent and intricate, the details are not laid out simply, but sometimes need to be processed, through the reading.  The intricacy and the multiple first person narratives reminded me of Faulkner.  I think the author did a great job of bringing a time period, subject matter, and characters to life."}, {"review_sentiment": 4.0, "review_text": "After the first several pages, I almost gave up. Reading italics seems so gimicky and needless. But no - it's a sly and clever way to make you see the story from two points of view, the doctor's and the patient's.  The time period is interesting, the characters are interesting, the plot, while simple enough, has a true feeling. I would slow down, savor this, enjoy."}]}, "authors": ["Clare Dudman"], "isbn": "0143038001", "longitude": 8.682093, "periods": ["1800s", "Recent Releases"], "title": "98 Reasons for Being", "word_cloud": "write equal part science poetry similar say tell story historical author german child rhyme story usually naughty child horrible consequence misbehavior big deal wildly popular much translate page least concerned true call life serve doctor lunatic asylum century bring life page becomes obsess cure new arrival asylum young woman speak initially seem mired overwhelm sadness usual cure prove ineffective horror psychiatric treatment display adopt radical approach talk story slowly drip session patient source misery finally reveal trial character likewise lay bare time live resident asylum explore inmates attendant live extend period flesh character real fault sorrow deeply move sad large part beautifully write time open spellbind add treat story feature fit chapter surprisingly relevant surround story overall excellent find character extremely dynamic multidimensional story also time heartbreaking well uplift write style make exceptional section narration interrupt case study perform psychiatrist well thought main character far say postmodern way story present certainly story girl bring mental institution refuse talk treatment encourages doctor patient open free demon course save numerous character deem good still complexities character make seem real paper describe move richly human depth understand psychological historical offer original offbeat perspective life asylum jewish girl label nymphomaniac admit insane asylum deep extremely debilitate state melancholia physician run sanatorium also well know author child poems know undertakes treat treatment fail patiently talk life patiently coax slowly coax cripple melancholic state teach talk respond inner thought recount inner thought recount italic use intelligent pertinent love gentile woos secretly marry cruelly spurn strong word incident bring depressive state also focus staff inmate also focus staff inmate window century progressive thinking inner world mentally ill evocative despair hope cruelty ultimately search purpose reason hence name quick story intelligent intricate detail lay simply sometimes processed read intricacy multiple first person narrative remind think author great job bring time period subject matter character life first several page almost give italic seem gimmicky needle sly clever way make story point view doctor patient time period interest character interest plot simple enough true feeling savor enjoy", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Novelist Clare Dudman, whose work has earned comparisons to Andrea Barrett and Peter Høeg, is that rare kind of author who manages to bring history dramatically to life. In 98 Reasons for Being, she conjures up the revolutionary nineteenth-century German physician Heinrich Hoffmann, best known today for his famous book of children’s rhymes, Struwwelpeter, or Shockheaded Peter.\r\n\r\nIn 1850s Frankfurt, a Jewish girl named Hannah Meyer is admitted to the town asylum; she hasn’t spoken, slept, or eaten in weeks and wagging tongues have resulted in a diagnosis of nymphomania. In an increasingly obsessed effort to cure her, Dr. Hoffmann uses all the methods at his disposal—from ice packs and blood letting to electrodes. Nothing works until he resorts to talking—revealing the fascinating case histories of his other patients as well as his own troubled home life. Only then does Hannah begin to respond and gradually yield her tale of love, transgression, and prejudice. As the secrets hidden in Hannah’s mind are exposed, Hoffmann begins to uncover his own buried truths and, in the end, discover his real reasons for being. \r\n\r\nBrilliantly composed with a keen sense of German and Jewish history, 98 Reasons for Being is written with the intensity of D. M. Thomas’s The White Hotel and confirms Dudman’s reputation as a gifted storyteller.\r\n\r\n\"An unsettling, weirdly evocative novel, evidently superbly researched ... the novel's images of the dawn of modern psychiatry and its portrait of doctor and patient struggling together towards the light remain memorably poignant.\" Times Literary Supplement", "asin": "0143038001", "rank": "3943863", "city": "Frankfurt", "image": "https://images-na.ssl-images-amazon.com/images/I/51X9JX3F73L.jpg", "country": "Germany", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}