{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 121, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "One of the most evocative books on WWI and on the Irish revolution."}, {"review_sentiment": 5.0, "review_text": "Great reading"}, {"review_sentiment": 5.0, "review_text": "Forgot I had already read it and was looking Barrys new Brocker Prize nominated novel. Opps Read again and still one of the best books on WW 1, op there with Parades End and \"All Quiet on Western Fronf"}, {"review_sentiment": 5.0, "review_text": "The most intimate and visceral account I have read  of what it was like to be an ordinary soldier at the Front during the First World War. Sebastian's Barry's writing  is just plain beautiful."}, {"review_sentiment": 5.0, "review_text": "If I could give this book more than five stars then I would do so.  There is a fine intensity to the writing. The writer uses the simple and unwordy Willie Dunne to convey complex ideas about war, Ireland and love between men and women and between men in the platonic sense of the word that are trapped in the killing fields of Flanders in World War One.How this book did not win the Booker is beyond me.It is rivetting read and will remain in my mind for many a day"}, {"review_sentiment": 4.0, "review_text": "WW I was a long, long, sad war.  This book described it well, but reading it was a long, long, struggle.  Perhaps that is as it should be."}, {"review_sentiment": 5.0, "review_text": "A beautifully written work. I could harxly put the book down. What a great insight into difficult times for Ireland, and the world in general."}, {"review_sentiment": 5.0, "review_text": "Great use of the english language"}, {"review_sentiment": 4.0, "review_text": "An interesting read.  The author weaves in some Irish history with the \"story\" of World War I."}, {"review_sentiment": 3.0, "review_text": "wasn't a page-turner...."}]}, "authors": ["Sebastian Barry"], "isbn": "0143035096", "longitude": -6.2602732, "periods": ["1900s", "Recent Releases"], "title": "A Long Long Way", "word_cloud": "evocative revolution reading already look new nominate still best op intimate visceral account like ordinary soldier write plain beautiful star fine intensity write writer use simple wordy convey complex idea war men woman men platonic sense word trap kill field win rivet remain mind many day sad war describe well read struggle perhaps beautifully write work great insight difficult time world general use english language interest author weave irish history story", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "Praised as a “master storyteller” (The Wall Street Journal) and hailed for his “flawless use of language” (Boston Herald), Irish author and playwright Sebastian Barry has created a powerful new novel about divided loyalties and the realities of war.\r\n\r\nIn 1914, Willie Dunne, barely eighteen years old, leaves behind Dublin, his family, and the girl he plans to marry in order to enlist in the Allied forces and face the Germans on the Western Front. Once there, he encounters a horror of violence and gore he could not have imagined and sustains his spirit with only the words on the pages from home and the camaraderie of the mud-covered Irish boys who fight and die by his side.  \r\n\r\nDimly aware of the political tensions that have grown in Ireland in his absence, Willie returns on leave to find a world split and ravaged by forces closer to home. Despite the comfort he finds with his family, he knows he must rejoin his regiment and fight until the end. \r\n\r\nWith grace and power, Sebastian Barry vividly renders Willie’s personal struggle as well as the overwhelming consequences of war.", "asin": "0143035096", "rank": "307625", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/516ZmNqH1IL.jpg", "country": "Ireland", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}