{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 159, "rating": 4.0, "reviews": [{"review_sentiment": 2.0, "review_text": "Good historical fiction should teach you something.  This book doesn't.  It might ok for those already in the know about Irish history.  I'm not, and it was totally confusing.  The beginning of the novel about Henry's infancy was initially charming; but it got so redundant that it became annoying.  I hate when an author can't get out of his own way and end it already.  Some of the book is grossly unrealistic; Henry comes across as a cartoon type action figure in some scenes.  Glad I got it out of the library and didn't pay."}, {"review_sentiment": 5.0, "review_text": "A very dark novel about a young man living in the slums of Dublin, with no family, no faith, no country allegiance, no hope.  Author is very skilled, and that's what saved me from putting this book down."}, {"review_sentiment": 5.0, "review_text": "What a powerful book, a journey through the first 20years of the 20th century turbulent Irish history, full of lamentation, poverty, tragedies, human frailty, but in the end, I couldn't help but falling into the awe and the magic of Irish people, their art, passion, poetry, and the universal humanity. This book is an example of the importance of fiction reading, not only based on history, but through the creative writing, the story of Henry Smart reaches the depth of emotions, and takes us into the soul of the characters, their struggles in hunger, negligence, fear, hope, reality and their dreams.  How else can we relate to the world beyond time and place?  An incredibly moving, powerful book.  The book cover captures the essence of the story so well, I loved everything about this book."}, {"review_sentiment": 5.0, "review_text": "Bought for my husband and he really loved the trilogy.  Raves about Roddy Doyle's writing.."}, {"review_sentiment": 5.0, "review_text": "I loved this book. I didn't know much about Irelands history but this novel brought it to life in a beautiful way."}, {"review_sentiment": 5.0, "review_text": "I read this book twice before I bought it.  The writing style is very unique and descriptive. The story telling invokes your imagination, and puts you in the scene as a third person. Absolutely great book"}, {"review_sentiment": 5.0, "review_text": "Every sentence jumps off the page. You can see, feel and viscerally attach to Henry's story and that of the Irish revolution. A tour de force!"}, {"review_sentiment": 4.0, "review_text": "Fantastic - a fresh perspective on a much-written about period of Irish history. Funny, surprising and brilliantly well written"}, {"review_sentiment": 5.0, "review_text": "Enticing and exciting enough for the pleasure reader, complex and academic enough for the scholarly reader. I would reccomend this to any fans of war novels, romance novels, historical fiction, psychology or criminal nature, or lovers of high literature"}, {"review_sentiment": 5.0, "review_text": "Great story will start sequel soon."}]}, "authors": ["Roddy Doyle"], "isbn": "0143034618", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "A Star Called Henry (Last Roundup)", "word_cloud": "good historical fiction teach something already irish history totally confuse beginning infancy initially charm get redundant become annoy hate author way end already grossly unrealistic come cartoon type action figure scenes get library pay dark young man live slum family faith country allegiance hope skilled save put powerful journey first century turbulent irish history full lamentation poverty tragedy human frailty end fall awe magic irish people art passion poetry universal humanity example importance fiction read base history creative write story reach depth emotion take soul character struggle hunger negligence fear hope reality dream else relate world time place incredibly move powerful cover capture essence story well love everything husband really love trilogy raf love know much history bring life beautiful way twice buy writing style unique descriptive story tell invokes imagination put scene third person absolutely great sentence jump page see viscerally attach story revolution tour de force fantastic fresh perspective period history surprising brilliantly well write entice excite enough pleasure complex academic enough scholarly fan war novel romance novel historical fiction psychology criminal nature lover high literature story start sequel soon", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Born at the beginning of the twentieth century, Henry Smart lives through the evolution of modern Ireland, and in this extraordinary novel he brilliantly tells his story. From his own birth and childhood on the streets of Dublin to his role as soldier (and lover) in the Irish Rebellion, Henry recounts his early years of reckless heroism and adventure. At once an epic, a love story, and a portrait of Irish history, A Star Called Henry is a grand picaresque novel brimming with both poignant moments and comic ones, and told in a voice that is both quintessentially Irish and inimitably Roddy Doyle's.", "asin": "0143034618", "rank": "384682", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51pMenUYngL.jpg", "country": "Dublin", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}