{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 4217, "rating": 4.2, "reviews": [{"review_sentiment": 1.0, "review_text": "Book didn't live up to all the hype. Her story dragged on"}, {"review_sentiment": 1.0, "review_text": "I did not finish this book.  It was so incredibly lame.  I'm just glad the price was low because there are no refunds."}, {"review_sentiment": 5.0, "review_text": "Came faster than expected. Love the book and have become an Elizabeth Gilbert fan for life."}, {"review_sentiment": 2.0, "review_text": "I could not get into this book. Gave it 100 pages and quit. The writing style was good but I found myself not caring about her self-discovery."}, {"review_sentiment": 5.0, "review_text": "What did I feel when I decided to finally read something from Elizabeth Gilbert? Not just anything... this particular book.I ATE the pages with my eyes !I PRAYED it would never end !!I LOVED every single chapter and metaphor !!!Something tells me the circumstances in which I read it were crucial to this perception. I was going through an excruciating divorce, searching for myself under every rock, and thirsty for human contact to understand how I felt.I personally recommend this book for women, book lovers, and people trying to get along with the hurricane of unanswered questions inside their minds."}, {"review_sentiment": 3.0, "review_text": "Lightweight and rather silly book about a gushy thirty something trying to find herself."}, {"review_sentiment": 2.0, "review_text": "Didn't care for this book.  I felt it was too contrived and she was too whiny."}, {"review_sentiment": 5.0, "review_text": "I loved the movie. Love the book more. It's now filled with high lighted and underlined sections. Even good as a multi read."}, {"review_sentiment": 1.0, "review_text": "I purchased this on my kindle device.  It kept queuing but it didn't download.  I waited for hours but it still wouldn't download.Other books queued and download but not this book.So I tried to cancel the purchase.  Instead I got debited again for the book.So now I've paid for it twice and still don't have it.  This is robbery.And I can't find anywhere on Amazon where I can complain about a digital purchase gone wrong!!"}, {"review_sentiment": 5.0, "review_text": "GREAT!  One o fthe best books I've ever read."}]}, "authors": ["Elizabeth Gilbert"], "isbn": "0143038419", "longitude": 12.4829321, "periods": ["2000s", "Recent Releases"], "title": "Eat, Pray, Love: One Woman's Search for Everything Across Italy, India and Indonesia", "word_cloud": "live hype story drag finish incredibly lame glad price low refund faster expect fan life page quit writing style good find care feel decide finally something not anything particular page eye never single chapter metaphor tell circumstance crucial perception go excruciate divorce search rock thirsty human contact understand personally recommend woman lover people try hurricane unanswered question mind rather silly gushy thirty something try care felt contrive whiny love movie fill high light underlined section even good multi purchase kindle device keep queue download wait hour still download try cancel purchase instead get debit pay twice still anywhere complain digital purchase go wrong great the best ever", "genres": ["Fiction & Literature", "Romance"], "summary": "Elizabeth Gilbert’s Eat Pray Love touched the world and changed countless lives, inspiring and empowering millions of readers to search for their own best selves. Now, this beloved and iconic book returns in a beautiful 10th anniversary edition, complete with an updated introduction from the author, to launch a whole new generation of fans. \r\n \r\nIn her early thirties, Elizabeth Gilbert had everything a modern American woman was supposed to want—husband, country home, successful career—but instead of feeling happy and fulfilled, she was consumed by panic and confusion. This wise and rapturous book is the story of how she left behind all these outward marks of success, and set out to explore three different aspects of her nature, against the backdrop of three different cultures: pleasure in Italy, devotion in India, and on the Indonesian island of Bali, a balance between worldly enjoyment and divine transcendence.", "asin": "0143038419", "rank": "6383", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/41jxVQo-S8L.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}