{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 230, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Taiye Selasi weaves an intricate web through the use of short, staccato sentences as she takes a circuitous look into the lives of the six Sai family members. The patriarch, Kweku, deserts the family in Boston and never explains that he has been fired as the chief surgeon.  He became the scapegoat after he was unable to save the life of a member of a very powerful family.  He leaves his wife, Fola, their son, twins and youngest daughter.  The reader is allowed to dip into all of their lives and see how each suffers from his absence.  Years later, he dies after hearing that Fola has moved to Ghana where he is living with his second wife. Their children travel to Ghana to attend his funeral and  they bond as a unit. Selasi uses a unique method of storytelling and her wisdom leaves much to chew on."}, {"review_sentiment": 5.0, "review_text": "Perfect, clean and frankly new"}, {"review_sentiment": 5.0, "review_text": "Loved this book. Very well written."}, {"review_sentiment": 2.0, "review_text": "Im sure this is a great story, but it just didnt catch my attention. I am a religious book reader and being that im from Ghana I was very proud and excited to read this book but it just didnt catch me. Maybe this book is for the older people (im 27) but I was bored and uninterested i felt like my grandmother who is into poems and somehing would have enjoyed it."}, {"review_sentiment": 5.0, "review_text": "If, like me, you find yourself bogged down a time or two, or discouraged by the seeming disjointedness, take heart.  The last third brings it together and brings it home.Home to the human condition.  Family love and heartbreak, human ambition and the wreckage it can make, wanting to belong and, in this globalized world, wanting not to belong, art and devastation, the longing to salvage meaning from the struggle, it's all here.Clearly written by a woman, but with a lot of insight into the male heart, too.  Selasie has that rare gift, a feel for how life feels, and she uses it judiciously and artfully to bring a hundred flashes of insight and a few powerful scenes.The family was devastated by an injustice in the heart of an institution that should have been safe from such abuse.  The stresses that built up in the years of reaching that position just washed the family solidarity away.  The mother's resulting depression led to even more betrayal.  And many years later, the family gets together for the father's funeral, and secrets come out.If that sounds melodramatic, then I have misled by encapsulating.  The most striking thing about \"Ghana Must Go\" is the texture, the feeling that life's disappointments and frustrations are given subtle shape by the postures we have taken, but given life and meaning by the inner self which, in a real way, we all share."}, {"review_sentiment": 5.0, "review_text": "This book is MUST READ!"}, {"review_sentiment": 5.0, "review_text": "I love African writers, No-Violet Bulawayo, Pettinah Gappah, Chimamanda Ngozi-Adichie......and Ive just addedd Taiye Selasie. This is book is so well-written I could not put it down. Its so subtle and i think i will only \"get it\" after a second and third reading. It explores all my favourite themes of identity and belonging."}, {"review_sentiment": 3.0, "review_text": "Great storyline but the style of writing is very veryvery annoying. Often I fount myself having to re-read just to understand. Sometimes I would skip sections because I felt there was unnecessary fluff of poor sentences"}, {"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 3.0, "review_text": "This book dragged.... I actually read two other books in between this one. But being the quitter I am not, I finally finished it. Not really worth it, and I was annoyed at the characters' overachieving, selfish ways. Nice prose, but a bit much."}]}, "authors": ["Taiye Selasi"], "isbn": "0143124978", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Ghana Must Go", "word_cloud": "weave intricate web use short staccato sentence take circuitous look live family member patriarch desert family never explain fired chief surgeon become scapegoat unable save life member powerful family leave wife son twin youngest daughter allow dip life see suffers absence year later die hear move live second wife child travel attend funeral bond unit use unique method storytelling wisdom leave much chew perfect clean frankly new love very well write sure great story dint catch attention religious mi proud excited dint catch older people mi bore uninterested felt grandmother poem something like find bogged time discourage seem disjointedness heart last third brings together bring human condition love heartbreak human ambition wreckage make want globalized world want belong art devastation longing salvage mean struggle write woman lot insight male heart rare gift life feel use judiciously artfully hundred flash insight powerful family devastate injustice heart institution safe stress build year reach position wash family solidarity away mother result depression lead even betrayal many year later family get together father funeral secret come sound melodramatic mislead encapsulate striking thing texture feel life disappointment frustration give subtle shape posture take give life mean inner self real way share love african writer added subtle think second third read explore favorite theme identity belonging great story line style write very very annoy fount understand section felt unnecessary fluff poor sentence great drag actually quitter finally finish not really worth annoy character overachieve selfish way prose bit much", "genres": ["Fiction & Literature"], "summary": "A “buoyant” and “rapturous” debut novel (The Wall Street Journal) about the transformative power of unconditional love\r\n\r\nElectric, exhilarating, and beautifully crafted, Ghana Must Go introduces the world to Taiye Selasi, a novelist of extraordinary talent. In a sweeping narrative that takes readers from Accra to Lagos to London to New York, it is at once a portrait of a modern family and an exploration of the importance of where we come from to who we are.\r\n\r\nA renowned surgeon and failed husband, Kweku Sai dies suddenly at dawn outside his home in suburban Accra. The news of his death sends a ripple around the world, bringing together the family he abandoned years before. Moving with great elegance through time and place, Ghana Must Go charts their circuitous journey to one another and, along the way, teaches us that the truths we speak can heal the wounds we hide.", "asin": "0143124978", "rank": "85350", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41jADC3VFoL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}