{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 82, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "This has a pretty interesting plot and Salvo does not seem to be so obsessed with his age.  Normally I’m not a huge fan of the Mafia storylines but this was quite good and kept me guessing the entire time.  In fact, I’m still not quite sure of the ending.  I guess it ends well for Montalbano but to be honest, I’m not quite totally certain of that.  Anyway, is it possible this is the last of the Montalbano books?  I think I now have read them all.  It has taken me several years and if you have read my reviews you’ll find that some I liked, others I did not.  I am a huge fan of the movies and they are why I read the books.  As I’ve already written, the books are different and in fact Salvo (imho) is not all that likable in the books.  In fact he is kind of a jerk.  In the movies, he most definitely is not a jerk.  At any rate, the series was fun to read but maybe I am ready to move on.  But before I go, I just want to reiterate how attached I have become to all the characters in the books: Catarella, Fazio, Mimi... and all the rest.  Camilleri has concocted a family that will be impossible to forget.  And some day I would love to go to Sicily... although in my embarrassment I now can finally admit:  I don’t like (nor eat) seafood.  Bueno, Salvo.  Bueno."}, {"review_sentiment": 5.0, "review_text": "Another great book by this very Sicilian writer.  Very nice."}, {"review_sentiment": 4.0, "review_text": "A very nice story even though without any flirt with gorgeous females and no great recipes of Sicilian origin. Unfortunately the translation to English was not well delivered."}, {"review_sentiment": 5.0, "review_text": "Good read!! Good service on the delivery ."}, {"review_sentiment": 5.0, "review_text": "Camilleri is one of the great living writers, not only mystery writers."}, {"review_sentiment": 5.0, "review_text": "Asked & Answered"}, {"review_sentiment": 5.0, "review_text": "Wittyanx well timed"}, {"review_sentiment": 3.0, "review_text": "reads as if NOT written by Camilleri, but has been \"aped\""}, {"review_sentiment": 5.0, "review_text": "Another great Montalbano story!"}, {"review_sentiment": 5.0, "review_text": "One of the best crime series ever written and the discussion of food in Italy is fantastic."}]}, "authors": ["Andrea Camilleri"], "isbn": "014312644X", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "A Voice in the Nigh", "word_cloud": "pretty interesting plot seem obsess age huge fan story lines quite good kept guess entire time fact still quite sure end guess end well honest quite totally certain possible last think take several year review find like others huge fan movie as already write different fact imho likable fact kind jerk movie definitely jerk rate series fun maybe ready move go want reiterate attach become character rest concoct family impossible forget day embarrassment finally admit eat seafood great sicilian writer nice nice story even flirt gorgeous female great recipe sicilian origin translation well deliver good service delivery great live writer mystery writer ask well time read write ape great story best crime series ever write discussion food fantastic", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "An Inspector Montalbano Mystery\r\n\r\nTwo deaths lead Inspector Montalbano into investigations of corruption and power in the twentieth installment of the New York Times bestselling series\r\n\r\nMontalbano investigates a robbery at a supermarket, a standard case that takes a spin when manager Guido Borsellino is later found hanging in his office. Was it a suicide? The inspector and the coroner have their doubts, and further investigation leads to the director of a powerful local company.\r\n\r\nMeanwhile, a girl is found brutally murdered in Giovanni Strangio’s apartment—Giovanni has a flawless alibi, and it’s no coincidence that Michele Strangio, president of the province, is his father. Weaving together these two crimes, Montalbano realizes that he’s in a difficult spot where political power is enmeshed with the mafia underworld.\r\n\r\n“The idiosyncratic Montalbano is totally endearing.” The New York Times\r\n ", "asin": "014312644X", "rank": "177751", "city": "Sicily", "image": "https://images-na.ssl-images-amazon.com/images/I/51oFNsPxdsL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}