{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": -27.4689682, "ratings": {"num_ratings": 136, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "It was hard to put down"}, {"review_sentiment": 5.0, "review_text": "Beautifully written war story of WW 2 in a part of the world that we seldom hear of."}, {"review_sentiment": 5.0, "review_text": "Because I lived in Indonesia, and have been all over Australia, this was a very welcoming book. The coming of age story of a young man, stuck in Indonesia as the 2nd WWar is starting. And what happens to him and the young Eurasian girl he loves. Her story is as compelling as his."}, {"review_sentiment": 5.0, "review_text": "Enjoyed the story and a lot written did happen according to Dutch friends."}, {"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 2.0, "review_text": "Didn't enjoy so didn't finish reading it."}, {"review_sentiment": 4.0, "review_text": "... and an awareness of the fundamental differences between the plethora of human tribes, their motivations, and their basic commonalities."}, {"review_sentiment": 5.0, "review_text": "The writing is wonderful.  The condition of the book is not what I expected.  Many of the pages have food stains and the book definitely shows shelf wear."}, {"review_sentiment": 5.0, "review_text": "I'd read it before, still very enjoyable"}, {"review_sentiment": 5.0, "review_text": "A really great read!"}]}, "authors": ["Bryce Courtenay"], "isbn": "0143007009", "longitude": 153.0234991, "periods": ["1900s", "Recent Releases"], "title": "The Persimmon Tree", "word_cloud": "hard put beautifully write war story part world seldom hear live welcome come age story young man stick start happen young girl love story compelling story lot write happen accord dutch friend great reading awareness fundamental difference plethora human tribe motivation basic commonality writing wonderful condition expect many page food stain definitely show shelf wear still enjoyable really great", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "The persimmon tree is a symbol of life, a heartwood that will outlast everything man can make . . . It is 1942 in the Dutch East Indies, and Nick Duncan is a young Australian butterfly collector in search of a single exotic butterfly. \r\n\r\nWith invading Japanese forces coming closer by the day, Nick falls in love with the beguiling Anna van Heerden. Their time together is brief, as both are forced into separate, dangerous escapes. They plan to reunite and marry in Australia but it is several years before their paths cross again, scarred forever by the dark events of a long, cruel war. \r\n\r\nIn The Persimmon Tree, Bryce Courtenay gives us a story of love and friendship set against the dramatic backdrop of the Pacific during the Second World War.", "asin": "B00307CCCY", "rank": 0, "city": "Brisbane", "image": "", "country": "Australia", "story_arc": ["Tragedy", "Things only get worse"]}