{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 42, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "A very clear depiction of the life of a bar girl. Excellently written."}, {"review_sentiment": 5.0, "review_text": "Better, in some ways, than the movie, but also quite different, giving a more stark and realistic take on the life of a Hong Kong prostitute.  Written in good taste, and gave a frozen time capsule view of Hong Kong-past.I enjoyed it very much.Michael P. SakowskiAuthor of The Dog of Jesus"}, {"review_sentiment": 4.0, "review_text": "As a sailor who spent time in Hong Kong and the Philippines, I identify with the sailors portrayed in the book, but also the bar girls. I never looked down on them, and found some to be the sweetest, most delightful people I ever met.Who among us hasn't done what we had to do to try to attain a decent life?I liked the way the personalities of the bar girls were described and detailed by the author.I found myself dreading the end of the book, not thinking a happy ending (no pun intended) was on the horizon.Spoiler Alert..........The ending left the possibility of more of Robert and Suzie's life to be written by the author, or someone else. Anybody know if that ever happened?"}, {"review_sentiment": 5.0, "review_text": "I liked this book so much that was sorry when I finished it.  Liked reading about old times in China; it held my interest.  The ending is typical, nothing dramatic, and this may be the only downside to the novel.  If you like light reading with an interesting plot and likeable characters, then you will enjoy it."}, {"review_sentiment": 5.0, "review_text": "Fascinating...and bonus....it ends well; no tragedy. Absolutely recommended. An easy read and hard to put down. So relieved at the end thinking it would end on sad notes."}, {"review_sentiment": 5.0, "review_text": "Beautifully-written cross-cultural love story that hits many deep chords. The character of Suzie Wong is intricately-drawn and has inspired several theatrical works and a memorable film. In addition, the novel evokes Hong Kong of the 1950s in a way that leaves you feeling like you've been there and done that."}, {"review_sentiment": 5.0, "review_text": "excellent writing"}, {"review_sentiment": 5.0, "review_text": "Even now it's a real classic, must read!"}, {"review_sentiment": 5.0, "review_text": "Magic story"}, {"review_sentiment": 5.0, "review_text": "this is a very old book I read and am rereading"}]}, "authors": ["Richard Mason"], "isbn": "0143120425", "longitude": 114.1628131, "periods": ["1900s"], "title": "The World of Suzie Wong: A Novel", "word_cloud": "clear depiction life bar girl excellently write way movie also quite different give stark realistic take life prostitute good taste give frozen time capsule view enjoy sailor spent time identify sailor portray also bar girl never look found sweetest delightful people ever do try attain decent life like way personality bar girl describe detailed find dread end think happy end pun intend end left possibility life write author someone else ever happen like much sorry finish reading old time hold interest end typical nothing dramatic like light read interesting plot likable character enjoy fascinate bonus end well tragedy absolutely recommend easy hard put so relieved end thinking sad note story hit many deep chord character inspire several theatrical work memorable film addition evokes way leave feel do excellent write even real classic story old reread", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Penguin Books reintroduces the timeless story of the love affair between a British artist and a Chinese prostitute.\r\n\r\nRobert is t he only resident of the Nam Kok hotel not renting his room by the hour when he meets Suzie at the bar. She becomes his muse and they fall in love. But even in Hong Kong, where many white expatriates have Chinese mistresses, their romance could jeopardize the things they each hold dear. \r\n\r\nSet in the mid-1950s, The World of Suzie Wong is a beautifully written time capsule of a novel. First published more than fifty years ago, it resonated with readers worldwide, inspiring a film starring William H olden, a ballet, and even a reggae song. Now readers can experience the romance of this groundbreaking story anew.\r\n\r\n“Reminiscent of Somerset Maugham at his storytelling best… Suzie Wong is enchanting.” New York Herald Tribune\r\n", "asin": "0143120425", "rank": "1014316", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/51Q2qRC7uoL.jpg", "country": "China", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}