{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 1271, "rating": 4.1, "reviews": [{"review_sentiment": 2.0, "review_text": "I only recently discovered Tana French and what a find - her first book, Into the Woods, was fantastic - with  wonderful, insightful character observations, leading to me highlighting many passages in that book.  Thoroughly enjoyed her next two books and to-date found Frank Mackey to be my favourite protagonist, though would not mind seeing Rob Ryan again.  I must say, I feel as though Rob's story is not complete.Broken Harbor... well, it is my least favourite of her books thus far.  I actually got about halfway I think, maybe even less and then jumped to the end.  The book was a slog - tedious, morose and bleak - it was just a drain to get through.  The thing is even reading the ending, I did not feel inspired to go back and check on the missing bits.The book is actually one star, but due to Ms French's skilful writing, I have added another."}, {"review_sentiment": 4.0, "review_text": "French is a very talented writer.  Her books are character driven and she presents many points of  view.  I liked this novel very much but was very disappointed in the ending.  It felt like she just had to end is somehow.  This is the 4th book in the series.  Each book is entirely different.  The connecting thread is each lead detective is a member of the Dublin Murder Squad.  This allows French to write a very different book each time without having to keep the main lead character."}, {"review_sentiment": 5.0, "review_text": "I got hooked on Tana French.  I read all of her series, back to back, no stopping.  Such a fabulous storyteller."}, {"review_sentiment": 4.0, "review_text": "The only thing I hate about her addictive series is how little things are left unresolved. The rotating cast of main characters keeps things fresh but when small things are left unfinished with one at the end of the novel it is maddening because there is not \"to be continued\" in the next book. Still like a bad habit I know I'll go and read the next one."}, {"review_sentiment": 5.0, "review_text": "This is my favorite Tana French book so far.  I have read four.  She's a good author who takes character development seriously and always has a good plot to keep the reader guessing."}, {"review_sentiment": 4.0, "review_text": "Real literature. Psychologically strong, gripping and intense. Stay for some time with the reader."}, {"review_sentiment": 5.0, "review_text": "Tana French is a great story teller and wonderful mystery writer. The Murder Squad books, although about different characters, have a familiar feel each time I read them."}, {"review_sentiment": 5.0, "review_text": "I really enjoy her books."}, {"review_sentiment": 5.0, "review_text": "Tana French's books are a great read.  I enjoy her exploration of the characters, especially the detectives."}, {"review_sentiment": 4.0, "review_text": "Good writing and an interesting plot. The ending was disappointing...too ambiguous."}]}, "authors": ["Tana French"], "isbn": "0143123300", "longitude": -6.2602732, "periods": ["2000s", "Recent Releases"], "title": "Broken Harbor: A Novel", "word_cloud": "recently discover find first fantastic wonderful insightful character observation lead highlight many passage thoroughly enjoy next find favorite protagonist see feel story well least favorite thus far actually get halfway think maybe even le jumped slog tedious morose bleak drain get thing even read end feel inspired go back check miss actually star due skillful write add french talented writer character driven present many point view like much disappointed end felt like end somehow series entirely different connect thread lead detective member allow french write different time main lead character get hooked series back back stop such fabulous storyteller thing hate addictive series little thing leave rotate cast main character keep thing fresh small thing leave unfinished end madden continue next still bad habit know go next one favorite far good author take character development seriously always good plot guessing real literature strong gripping intense time great story teller wonderful mystery writer different character familiar feel time really great enjoy exploration character especially detective good write interesting plot end disappointing ambiguous", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 4/5 in the Dublin Murder Squad Series\r\n\r\nA New York Times bestseller and quintessential Tana French thriller—a damaged hero, an unspeakable crime, and an intricately plotted mystery—the novel that \"proves anew that [Tana French] is one of the most talented crime writers alive.” (The Washington Post).\r\n\r\nMick \"Scorcher\" Kennedy plays by the book and plays hard. That's why he's the Dublin Murder Squad's top detective, and that's what puts the biggest case of the year in his hands.\r\n\r\nOn one of the half-abandoned \"luxury\" developments that litter Ireland, Patrick Spain and his two young children have been murdered. His wife, Jenny, is in intensive care. At first, Scorcher thinks it's going to be an easy solve, but too many small things can't be explained: the half-dozen baby monitors pointed at holes smashed in the Spains' walls, the files erased from the family's computer, the story Jenny told her sister about a shadowy intruder slipping past the house's locks. And this neighborhood--once called Broken Harbor--holds memories for Scorcher and his troubled sister Dina: childhood memories that Scorcher thought he had tightly under control.\r\n\r\nWinner of Ireland AM Crime Fiction Book of the Year", "asin": "0143123300", "rank": "29885", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/514cwmC-A1L.jpg", "country": "Ireland", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}