{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 1140, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "My second book of Ms French's and I'm ready to start a third.  Can't do work, laundry, cleaning - anything - until I finish the book.  Holds my attention without me even realizing it.  Poor husband has to cook us dinner until I finish!  I've read mysteries/thrillers all my adult life and French's writing, character building, and plot line pull me in quickly and don't let go until the end."}, {"review_sentiment": 3.0, "review_text": "This is the third of French's \"Dublin Murder Squad\" books I've read, and she certainly seems to like mining the theme of identity -- hidden identities, confused identities, etc... and this book takes it to the most extreme. In fact, so extreme that the basic premise is utterly laughable -- I'm not sure I've ever read a crime novel that asks the reader to suspend so much disbelief. I could never get past that, and so I could never really buy into the story -- which, to be fair, is quite well told.The basics are that a woman is found murdered in an abandoned cottage, and it turns out she's a dead ringer for Detective Cassie Maddox. The woman was a Trinity College grad student and housemate with four other students who seem to have shared an unusually close bond. Without much to go on, the police keep the murder quiet and have Cassie pretend to be the victim and survive. In theory, this will flush out whomever the original attacker was. What follows is a gripping nail-biter of psychological suspense, as Cassie and the various housemates play a kind of cat-and-mouse game. (Of course, it's not really a nail-biter, since the idea that she could fool the four closest people to the murder victim is a joke.)Like French's other books, the strength is in how she depicts the thinking of Cassie and the other characters. It's quite a feat, and if you enjoy her other books, you'll probably like this -- assuming you can get past the premise."}, {"review_sentiment": 5.0, "review_text": "Detective Cassie Maddox has a double...and that double has been murdered. What's more, the girl had somehow found and assumed Cassie's old undercover identity, Lexie Madison. So Cassie goes undercover once more, into Lexie's life with housemates Daniel, Abby, Rafe, and Justin, to find out who was responsible for Lexie's murder. Cassie's handler, Frank Mackey, believes that one of the housemates is guilty; Cassie isn't so sure.The story explores the psychology of the housemates, each of whom has some pretty serious issues, and gives us a look into Cassie's head as she 'becomes' Lexie. In fact, Cassie gets so deeply into her role that the lines begin to blur between Lexie and her real self, which could cost her the case, her career, even her life.I gave it 5 stars because it is a fascinating, perfectly paced story. The tension began in the Prologue and proceeded without lapse to the end. Bravo, Ms. French!"}, {"review_sentiment": 5.0, "review_text": "Top notch character development in an unpredictable mystery rich with Irish contemporary settings and culture.  Plus love, of course. Recommended for lovers of fine literary fiction, but may move too slowly for fans of shoot 'em up action adventure."}, {"review_sentiment": 4.0, "review_text": "A good psychologist I cal narrative that keeps you engaged  the second half looses momentum but spends more time on detail. Perplexing relationships but the book avoids deep reflection in the character's."}, {"review_sentiment": 5.0, "review_text": "I read In The Woods first and I was hooked. I was hesitant on buying this one because Cassie wasn't my favorite character in the first book. But I bought it and I'm so happy I did!!! This was by far one of the best books I have ever read. The writing is fantastic and the characters are so real. I can't wait to read her next book!"}, {"review_sentiment": 5.0, "review_text": "_The Likeness_ is French's second \"Dublin Murder Squad\" book (In the Woods (Dublin Murder Squad, Book 1)). Unlike most books in a series, you can read them out of order (I accidentally read the fifth book first), as French focuses on a different protagonist from within the squad for each story; while there are interrelationships and connections between characters, this isn't crucial to the plot of the book._The Likeness_ was, in a word, tremendous.  The story begins with the discovery of a body.  (Typical mystery fare, that.)  What makes this murder unique - and what sets the story in motion, is that the corpse issuing the alias a former undercover cop (and former member of the Dublin Murder Squad member) used on a long-concluded investigation.  The name was entirely made up.  What is even more unsettling, is body itself is identical to the undercover cop herself.  Hence the title.  In order to solve the murder, the former undercover, Casssandra Maddox, goes undercover again - as the dead woman.While the story was a bit slow to start as French laid the foundation of the story, it gradually builds a head of steam as Cassandra slips into the life she originally created (and which was usurped by the unknown victim), literally working the investigation from the inside-out.  The details of Cassandra's double (triple?) life were riveting, the suspects, motives and interactions between characters enthralling.  French is a very talented writer.  And while I congratulated myself on discovering the meaning of some of the clues, French still managed to trick me with the meaning behind the clues.  I really enjoy it when an author outsmarts me, and French has done so twice.  I can't wait to read her next work.  For fans of mysteries or thrillers, this writer and this series will not disappoint."}, {"review_sentiment": 3.0, "review_text": "Good, not great."}, {"review_sentiment": 4.0, "review_text": "solid. not quite as engaging as book 1 in the series.  I struggled a little with the premise."}, {"review_sentiment": 5.0, "review_text": "This book will stay with me. I loved the characters and the story line. Great author. I’m off to read the 3rd in the series."}]}, "authors": ["Tana French"], "isbn": "0143115626", "longitude": -6.2602732, "periods": ["2000s", "Recent Releases"], "title": "The Likeness", "word_cloud": "second ready start third work laundry clean anything finish attention even realize husband cook dinner finish adult life french write character building plot line pull quickly third french certainly seem mine theme identity hidden identity confuse identity take extreme fact extreme basic premise utterly laughable sure ever crime ask suspend much disbelief never never really story fair quite well basic woman find murder abandoned cottage turn dead ringer woman student student seem share unusually close bond much police murder quiet pretend victim survive theory flush original attacker follow grip psychological suspense various housemate play kind game course really idea closest people murder victim joke french strength depicts think character quite feat enjoy probably assume past premise double double murder girl somehow find assume old undercover identity go undercover life housemate find responsible murder handler believe housemates guilty story explore psychology housemate pretty serious issue give head fact get deeply role line begin blur real self case even give star fascinate perfectly pace story tension begin proceed lapse end top notch character development unpredictable mystery rich contemporary setting culture course lover fine literary fiction slowly fan shoot action adventure good psychologist cal narrative keep engage second half loose momentum spends time detail perplex relationship avoids deep reflection character first hook hesitant buy favorite character first buy happy far best ever writing fantastic character real next french second series order accidentally fifth first french focus different protagonist squad story interrelationship connection character crucial plot word story begin discovery body typical mystery fare make murder unique set story motion corpse issue alias former undercover cop former member member use investigation name entirely make even unsettle body identical undercover cop title order solve murder former undercover go undercover dead story bit slow start foundation story gradually build head steam slip life originally create usurped unknown victim literally work investigation detail double triple life rivet suspect motif interaction character enthral french talented writer congratulate discover mean clue still manage trick meaning clue really author outsmarts french do twice next work fan mystery thriller writer series disappoint good great solid quite engage series struggle little premise stay love character story line author series", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 2/5 in the Dublin Murder Squad Series\r\n\r\nIn the \"compelling\"* and \"pitch perfect\"** follow up to Tana French’s runaway bestseller In the Woods, it's six months later and Cassie Maddox has transferred out of the Dublin Murder squad. But an urgent telephone call beckons Cassie to a grisly crime scene. The victim looks exactly like Cassie and carries ID identifying herself as Alexandra Madison, an alias Cassie once used as an undercover cop. Suddenly, Cassie must discover not only who killed this girl, but, more importantly, who is this girl? \r\n\r\n“Inspires cultic devotion in readers…most crime fiction is diverting; French's is consuming.\" The New Yorker", "asin": "0143115626", "rank": "17820", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/513VibFQS7L.jpg", "country": "Ireland", "story_arc": ["Tragedy", "Things only get worse"]}