{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 99, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Elif Shafak is a great storyteller and an expert wordsmith."}, {"review_sentiment": 4.0, "review_text": "A meandering story through an ancient world that I was unfamiliar with but now have become more curious about. Wonderful characters, well developed and interesting. The last chapter was my favorite."}, {"review_sentiment": 4.0, "review_text": "I love everything by Elif. This novel is also a great read. The only place where i am lost is how much of this a fiction and how much is truly based on historic fact."}, {"review_sentiment": 5.0, "review_text": "I loved this book, the imagery, the feelings of the main character..."}, {"review_sentiment": 4.0, "review_text": "interesting history and a unique viewpoint."}, {"review_sentiment": 4.0, "review_text": "This book is testimony to the belief that the best way to capture a time and place is through literature, rather than through its counterpart: non fiction. Facts and figures can never truly explain the life of a city."}, {"review_sentiment": 5.0, "review_text": "Finally, a wonderful, full character developed story. I didn't know the artist nor anything about building, but the combination with the elephant and love and travel.  One of the best story I've read in a long time."}, {"review_sentiment": 5.0, "review_text": "A beautiful book, beautifully written...lessons on life against the panorama of 16th century Ottoman power...Suleiman's cruelty juxtaposed with his concern for the welfare of his country...a satisfying read."}, {"review_sentiment": 4.0, "review_text": "I appreciated the tremendous amount of research that went into this book.  The author seemed to capture the era thoroughly.  My main objection was the tone of the writing, i.e., like a child speaking throughout.  Also, the characters were one dimensional.  I have read other books by this author and found them to be more fully developed.  The book fascinated me and kept me engrossed because of the great story it told and the period of history it encompassed."}, {"review_sentiment": 4.0, "review_text": "An interesting book. I enjoyed her The Bastard of Istanbul better. However he fact that it was set in Turkey and the time it was set made for interesting reading."}]}, "authors": ["Elif Shafak"], "isbn": "0143108301", "longitude": 28.9651646, "periods": ["Recent Releases", "1500s"], "title": "The Architect's Apprentice: A Novel", "word_cloud": "great storyteller expert wordsmith meandering story ancient world unfamiliar become curious wonderful character well develop interest last chapter favorite love everything also great place lose much fiction much truly base historic fact love imagery feeling main character interest history unique viewpoint testimony belief best way capture time place literature rather counterpart non fiction fact figure never truly explain life city finally wonderful full character develop story know artist anything build combination elephant love travel best story long time beautiful beautifully write lesson life panorama century power cruelty juxtapose concern welfare country satisfy appreciate tremendous amount research go author seem capture era thoroughly main objection tone write child speak also character dimensional author find fully develop fascinate kept engross great story tell period history encompass interesting enjoy better however fact set time set make interesting reading", "genres": ["Fiction & Literature", "Art & Architecture", "Historical Fiction"], "summary": "From the acclaimed author of The Bastard of Istanbul, a colorful, magical tale set during the height of the Ottoman Empire.\r\n\r\nIn her latest novel, Turkey’s preeminent female writer spins an epic tale spanning nearly a century in the life of the Ottoman Empire. In 1540, twelve-year-old Jahan arrives in Istanbul. As an animal tamer in the sultan’s menagerie, he looks after the exceptionally smart elephant Chota and befriends (and falls for) the sultan’s beautiful daughter, Princess Mihrimah. A palace education leads Jahan to Mimar Sinan, the empire’s chief architect, who takes Jahan under his wing as they construct (with Chota’s help) some of the most magnificent buildings in history. Yet even as they build Sinan’s triumphant masterpieces—the incredible Suleymaniye and Selimiye mosques—dangerous undercurrents begin to emerge, with jealousy erupting among Sinan’s four apprentices.\r\n\r\nA memorable story of artistic freedom, creativity, and the clash between science and fundamentalism, Shafak’s intricate novel brims with vibrant characters, intriguing adventure, and the lavish backdrop of the Ottoman court, where love and loyalty are no match for raw power.\r\n", "asin": "0143108301", "rank": "93693", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/510nrzGMEVL.jpg", "country": "Turkey", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}