{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 55, "rating": 3.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Good"}, {"review_sentiment": 3.0, "review_text": "The book discussion group met in September 2016 at The LGBT Center in NYC to discuss this highly praised book. A few readers really liked this book, saying that it was absolutely terrific, but most of us were less convinced. The general consensus was that it was too long with too little happening.Crain is a respected literary critic, so he really knows how to write. We were constantly presented with great descriptive and unexpected images, especially with the protagonist Jacob's every internal thought carefully cataloged and nuanced change explored. But after a while, it's just too much. Too too much.I was impressed that the novel begins on the day that Jacob enters the teacher's lounge in Prague where he will be teaching English and ends on the day that he gets on the bus to leave Prague to return to America. The time is 1990 just after the Communist government has fallen and capitalism is painfully trying to take hold.There aren't a lot of flashbacks or backstories in the novel. Jacob did have one unsatisfying relationship in America and he's come to Prague to come out as gay among strangers, which he slowly and unevenly does. Many of the readers found Jacob to be charmless and too naive, which isn't a reason to dislike the novel but it makes it difficult to maintain much interest in his goings-on. As for his goings-on, not much happens. Jacob and his fellow teachers teach class, go out drinking, visit historic sites and museums, view beautiful architectural sites around the city and nearby, drink more, deal with the landlord, get ill and get better, talk about life a lot, gain a few outside jobs teaching English, and try to connect with each other and the locals. This is all standard college stuff, demonstrating how people easily move into your life and just as easily slide out. After all, they're all young and anything is possible.The novel has three sections. In the first section, Jacob has a rather low-key affair with a local guy, Lubos, who turns out to have secrets that Jacob cannot deal with. The second section revolves around Carl, Jacob's friend from college who comes to visit and begins a relationship with one of Jacob's fellow teachers. The final section finds Jacob in a rather satisfying relationship with another local, Milo, who he introduces to his teacher-friends as he prepares to leave Prague. But despite the two significant affairs, there is absolutely no sex in this book. It's what Edmund White and Paul Monette refer to as \"d*ckless fiction,\" which sometimes means the author is hoping for a cross-over hit.One of our readers was impressed at how gray Prague was presented in writing. Somehow, all the details reduce it all to a gray movie. The novel is very even; there's no crescendo in action, no major event, no glorious soaring moment, no one has an epiphany. Even the one death in the novel takes place far off stage and far, far away. There's not enough in the characterizations or in the politics to make a serious dent.I'm going to stick with my original assessment that \"Necessary Errors\" is well written, just not exciting or very entertaining. The problem is that the novel reflects the action it presents too well. There's not enough to make it interesting or recommendable outside academics interested in good writing or people who've visited Prague."}, {"review_sentiment": 5.0, "review_text": "It is a good story of an American teaching in the Czech Republic immediately after the fall of communism. But also an excellent source of information about life in the Republic following the transition. For those who want to be writers, this is an excellent, though long, novel that provides the best of current non-fiction fiction autobiographical writing."}, {"review_sentiment": 5.0, "review_text": "A lot of the bad reviews of this book have been from people who immediately latched on the the book's Czechoslovakian setting and expected a light narrative about the character's time there. That really isn't what this is about and that is what made me adore this book more than anything.I agree with many reviewers in that Crain is attempting instead to explore the every day interactions with others and the city itself. His absolute mastery of dialogue has created a sort of character study; we as readers are never told how to feel about a character or an event, we are simply guided through it, free to get to know the characters on our own. The critics on the back cover are entirely correct, I believe, in saying that 'Necessary Errors' is indeed a masterpiece. If you're looking for something that tries hard and overtly to connect with you and your own previous experiences, this is not the book you should read. If instead, you're looking for a work of literary art that challenges both itself and you as the reader, a novel that will absolutely invite you, despite anything you're bringing to the table, into its world with fantastic subtlety, then PLEASE read this novel.You will not regret it."}, {"review_sentiment": 5.0, "review_text": "Caleb, I just read your Harper's article about literature in the age of algorithms.  A few paragraphs in, I saw that I was in good hands, so I poured a glass of whiskey, and sipped and read.After some part of an hour, I could see the black dot at the end of article approaching, and I sighed, and a minute later, I reached the dot.Caleb, your writing, an hour of free time, and a glass of spirit...wow, wow, wow.  Thanks, man."}, {"review_sentiment": 4.0, "review_text": "This  is a great book for anyone who spent time traveling /living in Europe after college.You relive what is was like to to live away from USA in the '80's. Best described \"sensitive\""}, {"review_sentiment": 5.0, "review_text": "[Originally published on Goodreads]Mr. Crain displays an uncanny ability to observe day-to-day human conditions that often go unspoken, and almost reminded me of Louis C.K. in this observational ability, and serious humor.The novel does seem to get slow at times, as there is not much happening, plotwise, in the conventional, TV-drama sense (the protagonist, an american teacher in Prag –gay, not that there is anything wrong with that– , finds a Czech lover, has a friend visiting, witnesses two friends getting romantically close, has another lover etc.)But what the novel 'lacks' in event-bombardment, it more than makes up for with the beauty of the prose, its observational subtlety, and humor, I'm not accustomed to observing  literary humor to this extent in a dead-serious book, since reading some of my favorite DFW or  Nabokov novels.AND it does get better and better as you progress. Many of the last 100 pages left me thinking 'nobody should be allowed to write this good',  and hurriedly copying passages to my quote book (I know)."}, {"review_sentiment": 5.0, "review_text": "If you migrated `east` after the fall of the `iron curtain,` then Caleb Crain`s `Necessary Errors` is a necessary read.  Even for those who stayed home, `Errors` shouldn`t be missed.  Like some 19th century novelist, Caleb Crain has created a rich universe that holds much mystery and treasure for all 472 pages.`Necessary Errors` is a love story (or rather several), a coming-of-age saga, and most of all, a bildungsroman of a young gay man finding himself abroad.  Texas-born, Harvard graduate, Jacob Putnam has found himself floating in Prague on the waves of post-revolution euphoria.  He has just come out and like his adopted Praguers, is tasting the delights (and limits) of a new-found freedom.  Finding work as the ubiquitous `language teacher, ` he joins a group of similarly idealistic and unmoored ex-pats living the heady atmosphere of 1990`s Praha.  There`s Annie, a flame-locked Irish lass who becomes Jacob`s closest confidante, the handsome and straight Scot, Thom, the cerebral and eccentric Englishman, Henry, and the pretty `English rose,` Melinda, whose movie star looks and imperial bearing make her pack-leader.And there are others, Germans, like pallid Kaspar obsessed with Czech poetry and Prague`s Jewish past and Danes like the embittered socialist, Hans, who mourns the demise of socialism.  And of course, there are the the Czechs themselves.  The Stehliks, Jacob`s courteous but suspicious landlords, struggle to understand why Jacob left the land of plenty.  Then there are the boyfriends, Lubos and Milo.  And even another American, Carl, Jacob`s friend from the States, joins the pack of comrades in hopes of experiencing `it` before `it` moves on.With its colorful cast of characters, `Errors` reads like a Dickens` novel.  Crain artfully captures the tension and euphoria of being young and footloose abroad, stumbling from one life experience to another.  Jacob and pals connect in dingy classrooms, smoky `lokals, ` smokier coffeehouses, deafening discos and of course, down sooty alleys at four in the morning.  This novel celebrates that unbearable lightness of being that disappears as fast as you live it.Despite its voluminous size, `Errors` reads fast.  It is mostly dialogue, as the characters question themselves and tackle the big questions of life, love and the future.  And all this against the backdrop of a city and society born anew.  These conversations saunter along effortlessly, as if you the reader were eavesdropping along.  Crain masterfully integrates Jacob`s blossoming proficiency with Czech.  Meaning is gracefully hinted at rather than directly translated.“Rekni ti to pozdej,” said Jacob.“No, don`t tell him later either.  That`s no better,” snapped Annie.As some reviewers have correctly pointed out, no grand action or profound change occurs within these 472 pages.  No dramatic courting, no scenes of relationships gone awry, no marriages, deaths, tragic things whatsoever.  Rather, this novel is an exploration of identities, what it means to be young, American, a `westerner, gay, and most of all, what it means to stand before those `big` events in life that determine destiny.  Even sex is treated in a minor, almost superfluous manner.  `Errors` is a novel of intentions, dreams, and perhaps most of all, desires and their irrevocable consequences.With its omniscient narration, `Errors` lets you get into each character`s head and explore his or her motivations.  As we follow Jacob into his classes, walk with him to his lovers` place or eavesdrop on his conversations with Annie, we climb a little deeper into his psyche.  Yet, motivations remain vague at best, alluded to, but never declared.Despite its god`s eye view, `Necessary Error, ` is Jacob Putnam`s story.  We follow him from his shy excursions into Prague`s gay underworld, to his naïve infatuation with Lubos, and eventually to his uneasy,if more mature, `relationship` with Milo.  The two become lovers and friends if not actual partners.  This is young love, first love and its terminus is fixed.  Jacob will return home to grow up.  Yes, this is a novel of youth above all and the necessary errors we must make in order to stumble over the doorstep of maturity.Yet, Jacob wants to prolong a world of open ends for as long as possible.  “Her mysticism fell in with an idea himself that he wanted to keep as long as he could of himself as a person on an errand whose nature was still unfolding.”  Ditto for `Necessary Errors” the novel as well.  It`s a journey of self-discovery melded with an exacting portrait of a certain time and place.  It`s `The Great Gatsby` coupled with `Giovanni`s Room.` Yet, these are only shadowy analogies.  Rather, Caleb Crain has crafted something highly original and always in style:  a great American novel."}, {"review_sentiment": 2.0, "review_text": "Very boring book with very murky characterization that goes nowhere. The paean to Prague's sights make it a travelogue, but the uninteresting personae get in the way of even that objective. I always finish a book I start hoping for some peaks and valleys but this was a straight uneventful repetitive highway. I was taken in by a review I read. ES, San Antonio"}, {"review_sentiment": 5.0, "review_text": "The setting for this book is Prague in the days following the Velvet Revolution.  President Havel has done what he can to draw the country (at that time, it was still Czechoslovakia).  Part of his efforts was to encourage bilingualality amongst the population.  Of course most people were already bilingual, but they spoke Czech and Russian.  The need to learn western languages in order to emerge from a Soviet dominated society and into modern commerce.  The principal characters in this book are a mix of people from English speaking countries who traveled to Prague to work in the language schools or to free-lance teaching of English as a Second Language. It is easy to dismiss this book as ‘another circle of friends’ book, but it is so much more.  The foreigners adapt to the Czech culture and the Czech people adapt to something that they do not totally understand, modern living without fear of being discovered by “them” who have been looking over their shoulders in the past.I am sure that the businesses mentioned in Mr. Crain’s book no longer exist.  They could only have existed in that twilight world of the change in culture.  I am sure that there is a modern version of the wonderful bakery, the ‘country club’ the subterranean meet and greet pub in today’s Prague.  I visited Prague a few years after the time of this book and fell in love with it.  This is a wonderful tale and I am now homesick for Prague.  I guess that I need to plan another trip."}]}, "authors": ["Caleb Crain"], "isbn": "014312241X", "longitude": 14.4212535, "periods": ["1900s", "Recent Releases"], "title": "Necessary Errors", "word_cloud": "good discussion group meet discuss highly praise reader really like say absolutely terrific le convince general consensus long little respected literary critic really know write constantly present great descriptive unexpected image especially protagonist internal thought carefully catalog nuanced change explore much impressed begin day enter teacher lounge teach english end day get bus leave return time communist government fall capitalism painfully try lot flashback backstories unsatisfying relationship come come gay stranger slowly unevenly many reader find charmless naive reason dislike make difficult maintain much interest much happen fellow teacher teach class go drink visit historic sit museum view beautiful architectural site city nearby deal landlord ill better talk life lot job teach english try connect locals standard college stuff demonstrate people easily move life easily slide young anything section first section rather affair local guy turn secret deal second section revolve friend college come visit begin relationship fellow teachers final section find rather satisfy relationship local introduces prepares leave significant affair absolutely sex refer fiction sometimes mean author hop reader impressed gray present write detail gray movie even crescendo action major event glorious soar moment epiphany even death take place far stage far far away enough characterization politics make serious go stick original assessment well write excite entertain problem reflect action present well enough make interest recommendable outside academic interested good write people visit good story american teaching immediately fall communism also excellent source information life follow transition want writer excellent long provide best current fiction autobiographical writing lot bad review people immediately latch czechoslovakian setting expect light narrative character time really make adore agree many reviewer cain attempt instead explore day interactions others city absolute mastery dialogue create sort character study reader never tell feel character event simply guide free get know character critic back cover entirely correct believe say indeed masterpiece look something try hard overtly connect previous experience instead look work literary art challenge absolutely invite anything bring table world fantastic subtlety article literature age algorithms paragraph saw good hand pour glass whiskey sip part hour black dot end article approach sigh minute later reach write hour free time glass spirit wow wow wow man great anyone spent time travel relive live away describe sensitive originally publish display uncanny ability observe human condition often go unspoken almost remind observational ability serious seem slow time much happen plot wise conventional sense protagonist american teacher anything wrong find czech lover friend visit witness friend get romantically close lover etc make beauty prose observational subtlety humor accustom observe literary humor extent read favorite get better better progress many last page leave thinking allow write good hurriedly copy passage quote know migrate fall curtain even stay home miss century novelist create rich universe hold much mystery treasure story rather several saga bildungsroman young gay man find abroad graduate find float wave euphoria adopted taste delight limit freedom find work ubiquitous teacher join group similarly idealistic unmoored living heady atmosphere lass become closest confidante handsome straight cerebral eccentric pretty rise movie star look imperial bear make others german pallid obsess poetry embittered socialist mourns socialism course courteous suspicious landlord struggle understand leave land plenty then boyfriends even american friend join comrade hop experience move colorful cast character read artfully capture tension euphoria young footloose abroad stumble life experience pal connect dingy classroom smoky smokier coffeehouse deafen disco course sooty alley morning celebrate unbearable lightness disappears fast live voluminous size read fast mostly dialogue character question tackle big question life future backdrop city society bear conversation saunter along effortlessly eavesdrop along masterfully integrate blossom proficiency gracefully hint rather directly ti podded say tell later either better snap reviewer correctly point grand action profound change occur page dramatic courting scene relationships go awry marriage death tragic thing exploration identity mean young gay mean stand event life determine destiny even sex treat minor almost superfluous manner intention dream perhaps desire irrevocable omniscient narration let get head explore motivation follow class walk place eavesdrop conversation climb little deeper psyche motivation remain vague best allude never eye view story follow shy excursion gay underworld nave infatuation eventually uneasy mature become lover friends actual partner young love first terminus fix return home grow youth order stumble doorstep want prolong world open end long possible mysticism fell idea want long person nature still well journey meld exact portrait certain time place couple shadowy analogy craft something highly original always style great american very boring murky characterization go nowhere paean sight make travelogue uninteresting persona get way even objective always finish start hop peak valley straight uneventful repetitive highway take review es set day follow do draw country time still effort encourage bilingualality among st population course people already bilingual speak need learn western language order emerge dominate society modern commerce principal character mix people speak country travel work language school teach english easy dismiss circle friends much foreigner adapt czech culture people adapt something totally understand modern living fear discover look shoulder sure business mention longer exist twilight world change culture sure modern version wonderful bakery country club subterranean meet greet pub today visit year time fell wonderful tale homesick guess need plan trip", "genres": ["Fiction & Literature", "LGBT", "Historical Fiction"], "summary": "“Necessary Errors is a very good novel, an enviably good one, and to read it is to relive all the anxieties and illusions and grand projects of one’s own youth.” James Wood, The New Yorker\r\n\r\nAn exquisite debut novel that brilliantly captures the lives and romances of young expatriates in newly democratic Prague\r\n\r\nIt’s October 1990. Jacob Putnam is young and full of ideas. He’s arrived a year too late to witness Czechoslovakia’s revolution, but he still hopes to find its spirit, somehow. He discovers a country at a crossroads between communism and capitalism, and a picturesque city overflowing with a vibrant, searching sense of possibility. As the men and women Jacob meets begin to fall in love with one another, no one turns out to be quite the same as the idea Jacob has of them—including Jacob himself.\r\n\r\nNecessary Errors is the long-awaited first novel from literary critic and journalist Caleb Crain. Shimmering and expansive, Crain’s prose richly captures the turbulent feelings and discoveries of youth as it stretches toward adulthood—the chance encounters that grow into lasting, unforgettable experiences and the surprises of our first ventures into a foreign world—and the treasure of living in Prague during an era of historic change.\r\n\r\n“Ferociously observed. . . . We’re not through with narratives about the Getting of Wisdom, Americans Abroad, Coming of Age, Gay Coming of Age, New Lost Generations. Among such works, a new narrative will be measured against Caleb Crain’s fine book, which will endure as a powerful entry in the great fictional exploration of the meanings of liberation.” The New York Review of Books", "asin": "014312241X", "rank": "625638", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/41-yxAP-U1L.jpg", "country": "Czechia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}