{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 156, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "The story starts with Zelly Ha being pregnant and single in a primarily Muslim country. She lives in an all female household and the family dynamics with her sisters are interesting. The men die early and the only other male, her brother, left for America. The reader is then whisked off to America to a whole new set of characters. Another child is Armenian American and her mother marries the estranged brother, Armanoush eventually travels to Istanbul to meet her step-father's family and discover her Armenian past. Asya, Zelly Ha's, child befriends Armanoush.The story jumps around a bit too much and lands in territory of philosophy of the Armenian deaths at the hands of the Ottomans. I really wanted to learn Zelly Ha's and Asyz's stories and the journey as a single pregnant woman in Istanbul. The stray threads eventually sew together, but it's a bit too long winded arguing over genocide versus war and instead of being Asya's story (the bastard of Istanbul). It seems like the title didn't fit the storyline. Overall, I enjoyed the family in Istanbul and figured out the twist long before the end. Worth a read."}, {"review_sentiment": 4.0, "review_text": "Enjoyed the story"}, {"review_sentiment": 5.0, "review_text": "A beautifully written, heart-wrenching novel. Shafak commands words like no other."}, {"review_sentiment": 2.0, "review_text": "I found the names of the various characters in the languages initially very confusing though as we approached the end it became easier."}, {"review_sentiment": 3.0, "review_text": "Just ok"}, {"review_sentiment": 2.0, "review_text": "Such a a disappointment.  This author needed an editor badly, with too many threads in the air and too many characters to dislike"}, {"review_sentiment": 4.0, "review_text": "Thoroughly enjoyable and authentic.  Speaking as a former Peace Corps Volunteer who served in Turkey and have become a Turkophile!  Shafak tells an interesting, readable and reliable story!"}, {"review_sentiment": 4.0, "review_text": "Enjoyed reading about the city  Istanbul and their culture."}, {"review_sentiment": 3.0, "review_text": "Very well written; good sentence structure; and imagery .BUT the climax was disappointing because it was not plausible-genetically.. It would have helped to have a genealogy chart of the Turkish and the Armenian families involved. Convoluted."}, {"review_sentiment": 5.0, "review_text": "Well narrated story reflect the dramatic history of Turkey and the Armenian genocide... two families connected by dark secrets of the past. A touch of magic, tradition and modernity. I loved it!"}]}, "authors": ["Elif Shafak"], "isbn": "0143112716", "longitude": 28.9651646, "periods": ["1900s"], "title": "The Bastard of Istanbul", "word_cloud": "story start telly pregnant single primarily country live female household family dynamic sister interest men die early male brother leave whisk whole new set character child armenian mother marries estrange brother eventually travel family discover past child befriend story jump bit much land territory philosophy armenian death hand really want learn story journey single pregnant woman stray thread eventually sew together bit long wind argue genocide war instead story seem title fit story line enjoy family figure twist long end worth story beautifully write command word find name various character languages initially confusing approached end become easier just ok such disappointment author need editor badly many thread air many character dislike thoroughly enjoyable authentic speak former serve tell interesting readable reliable story read city culture very well write good sentence structure imagery climax disappoint help chart family involve convolute well narrated story reflect dramatic history genocide family connect dark secret touch magic tradition modernity love", "genres": ["Fiction & Literature"], "summary": "Populated with vibrant characters, The Bastard of Istanbul is the story of two families, one Turkish and one Armenian American, and their struggle to forge their unique identities against the backdrop of Turkey's violent history. Filled with humor and understanding, this exuberant, dramatic novel is about memory and forgetting, about the tension between the need to examine the past and the desire to erase it.", "asin": "0143112716", "rank": "122123", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51z6wqIU4uL.jpg", "country": "Turkey", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}