{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 171, "rating": 4.0, "reviews": [{"review_sentiment": 2.0, "review_text": "So very sloooooow. If you want an exciting spy novel, this is not it. Disappointed."}, {"review_sentiment": 4.0, "review_text": "A very good exposition of spanish civil war and its aftemath. Franco barbarities exposèd. A shame the regime he created has not been internationally, or even nationally, condemned to date by some nations or by the partido popular in Spain. (Mind you it is understandable since the members of that party are the descendants of the Francoist). A brave book."}, {"review_sentiment": 5.0, "review_text": "AS usual his books are great"}, {"review_sentiment": 1.0, "review_text": "Boring"}, {"review_sentiment": 5.0, "review_text": "sucks you right in!"}, {"review_sentiment": 4.0, "review_text": "Well researched and brilliantly realised!"}, {"review_sentiment": 5.0, "review_text": "I thought he was likely to only describe superlative pictures of Tudor England.  But, he has described a landscape in Spain in an equally memorable fashion."}, {"review_sentiment": 4.0, "review_text": "A gripping novel.  Sansom is fast becoming a favorite author for me.  He combines historical facts with fictional drama and gives you a book you will not want to put down."}, {"review_sentiment": 5.0, "review_text": "great overview of Spain's culture and history"}, {"review_sentiment": 5.0, "review_text": "this author is superb."}]}, "authors": ["C. J. Sansom"], "isbn": "0143115138", "longitude": -3.7035825, "periods": ["1900s", "Recent Releases"], "title": "Winter in Madrid: A Novel", "word_cloud": "so sloooooow want excite spy disappoint good exposition spanish civil war aftermath barbarities expose shame regime create internationally even nationally condemned date nation parotid popular understandable member party descendant francois brave usual great bore suck right well research brilliantly realize think likely describe superlative picture describe landscape equally memorable fashion gripping fast become favorite author combine historical fact fictional drama give want put great overview culture history author superb", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII", "Spanish Civil War"], "summary": "A #1 internationally bestselling novel set in post-Civil War Spain.\r\n\r\nSeptember 1940: the Spanish Civil War is over, Madrid lies in ruin, while the Germans continue their march through Europe, and General Franco evades Hitler's request that he lead his broken country into yet another war. Into this uncertain world comes a reluctant spy for the British Secret Service, sent to gain the confidence of Sandy Forsyth, an old school friend turned shady Madrid businessman. Meanwhile, an ex-Red Cross nurse is engaged in a secret mission of her own.\r\n\r\nThrough this dangerous game of intrigue, C. J. Sansom's riveting tale conjures a remarkable sense of history unfolding and the profound impact of impossible choices.", "asin": "0143115138", "rank": "442267", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZtrY9YOLL.jpg", "country": "Spain", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}