{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 42, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "What an extraordinary novel! I doubt if there exists a more powerfully accurate evocation of London in the Blitz. But Greene's \"entertainment\" is so much more."}, {"review_sentiment": 5.0, "review_text": "great book"}, {"review_sentiment": 5.0, "review_text": "Author Graham Greene described this espionage novel as an \"entertainment,\" and entertaining it certainly is. It's also beautifully written, with a hero - if that's the right word - so damaged, so vulnerable that the reader can't help but sympathize with him and his predicament as he bravely tries, in war-torn London, to find the reasons he is being hunted by both the police (for a murder he didn't commit) and by Nazi agents for the secrets he may have unwittingly exposed merely by winning a fateful cake at a village fete. The author had first hand experience of the blitz in London, which is on display in the grim, fitfully violent world of this tale. That it's also quite funny, in a darkly unsettling way, is only one of the reasons this  novel transcends the strictures of the the spy genre. In fact, Greene was inventing the genre as he went along. Only Conrad and Somerset Maugham had explored this territory in a literary way before him. Ian Fleming's James Bond and the espionage fiction of John Le Carre were still in the future when \"Ministry of Fear\" (great title!) was published in 1943."}, {"review_sentiment": 4.0, "review_text": "This 1943 novel is subtitled ‘an entertainment’, Greene’s term for lighter works he produced, but is it really ‘light’? It starts out as a literal interpretation of the English saying, “You can’t have your cake and eat it”. Arthur Rowe wins a cake at a fundraising event after consulting its fortune teller. Its organisers are reluctant to let him have it, but Arthur takes it home. Next day, a man arrives at his lodging house and insinuates himself into eating slice after crumbling slice of said cake. Then a German bomb strikes the house. [After all, the novel is situated in London during the Blitz.]Arthur used to be a journalist. He has been tried for killing his terminally-ill wife and was sent (briefly) to a psychiatric institution and is now unemployable. Neither the armed forces nor civil defence want him in its ranks. He had few possessions, just his clothes and two books he loved when young and reread again and again, but he is financially secure. He is convinced his visitor on the fateful night tried to poison him and is keen on finding out why. Did the cake he was not meant to win,  contain something he must not find?Graham Greene did his bit for the country by e.g. concocting this espionage novel, co-starring an ‘Austrian refugee’ brother and sister surnamed Hilfe (‘help’, ‘aid’, ‘assistance’) running a well-connected humanitarian agency with plenty of volunteers. Greene pictures plenty of wartime poverty, stoicism and sacrifice on behalf of the home nation. And portrays (even) blundering Arthur, stunned, burdened and confused by his life’s losses, as useful in the war effort! Was made into a ‘noir’ war movie in 1944. And Graham Greene stayed true to himself, creating complex Arthur, forever musing about God, sin and guilt ."}, {"review_sentiment": 5.0, "review_text": "Wonderful, wonderful prose"}, {"review_sentiment": 5.0, "review_text": "Greene at his best.  I read this book after seeing the film of the same name.  There is no comparison!  Greene is wonderful at description and suspense.  He knows spooks;  his war-time boss was Kim Philby!!"}, {"review_sentiment": 3.0, "review_text": "I am thrilled to have read this book, it is funny and has opened a new reading horizon, had not read any of Greene's works.Isabel beeOn second thought, as I went along the book it got more confusing and hard to follow. I am sure the rest of his books are easier to read."}, {"review_sentiment": 4.0, "review_text": "If you were to level an accusatory finger at Greene's \"entertainments\", as he called them, you might say they're too much like \"novels\". They're stitched up too conveniently and implausibilities become credible as you're bustled along by the hastily woven plotting – it's almost as if the novelist saves himself from the incredulity of the reader at the last moment by sleight of hand, and you let him get away with it – or otherwise – with a grudging (perhaps nodding) respect. \"The Ministry of Fear\" is one of Greene's best of this category, and it's amnesia (of the hapless protagonist, victim) that rescues what almost becomes an implausible narrative. Read it to the end and it's haunting on multiple levels, hinting at some of the much greater work Greene does in \"The Heart of the Matter\" and \"The Quiet American\". Even when he was writing fast, there's a profundity to Greene: she loved him better when his past became a mystery to himself ... and so he let it be. Lot's of plot twists and action in between"}, {"review_sentiment": 4.0, "review_text": "3 by Graham GreeneThese three adventure novels were all filmed by Hollywood in the 1940s. These stories are similar to the Eric Ambler novels where an ordinary person gets caught up in government intrigue but manages to survive. While fictional, there is a moral lesson to these stories. Their settings reflect the European politics of the 1930s. You can watch Greene’s progress as a writer.“This Gun For Hire” is about a killer hired to bump off an old politician. The corporation that hired him paid this gunman with money that was stolen; if caught he would be guilty of a robbery. This gunman resolves to take revenge on those who double-crossed him, and does. It is an adventure novel that recalls Continental politics of that time.“The Confidential Agent” is about a middle-aged politician sent to England to buy coal supplies for his government; or to prevent them from being acquired by the other side in their civil war. D. fails in the first, but succeeds in the second by sheer luck. We get a glimpse of corporate politics behind the scenes. D. escapes England in an unbelievable ending.“The Ministry of Fear” is about a middle-aged man just released from a sanitarium. By luck he acquires a home-made cake made from fresh ingredients (war time rationing). But this gets him involved in a spy-ring operating in London as part of the “Free Mothers” charity organization. Bombings, committal to another sanatarium, and an escape to find Scotland Yard (they don’t think he is crazy). They catch the spies before the secret microfilm leaves the country. [This novel gets bogged down by too much psychological prattle. The film was much better.] The Ministry of Fear refers to the way secret services can blackmail people into doing what they want because of hidden scandals in their past."}, {"review_sentiment": 4.0, "review_text": "3: This Gun For Hire, The Conficential Agent, The Ministry of FearThese three adventure novels were all filmed by Hollywood in the 1940s. These stories are similar to the Eric Ambler novels where an ordinary person gets caught up in government intrigue but manages to survive. While fictional, there is a moral lesson to these stories. Their settings reflect the European politics of the 1930s. You can watch Greene’s progress as a writer.“This Gun For Hire” is about a killer hired to bump off an old politician. The corporation that hired him paid this gunman with money that was stolen; if caught he would be guilty of a robbery. This gunman resolves to take revenge on those who double-crossed him, and does. It is an adventure novel that recalls Continental politics of that time.“The Confidential Agent” is about a middle-aged politician sent to England to buy coal supplies for his government; or to prevent them from being acquired by the other side in their civil war. D. fails in the first, but succeeds in the second by sheer luck. We get a glimpse of corporate politics behind the scenes. D. escapes England in an unbelievable ending.“The Ministry of Fear” is about a middle-aged man just released from a sanitarium. By luck he acquires a home-made cake made from fresh ingredients (war time rationing). But this gets him involved in a spy-ring operating in London as part of the “Free Mothers” charity organization. Bombings, committal to another sanatarium, and an escape to find Scotland Yard (they don’t think he is crazy). They catch the spies before the secret microfilm leaves the country. [This novel gets bogged down by too much psychological prattle. The film was much better.] The Ministry of Fear refers to the way secret services can blackmail people into doing what they want because of hidden scandals in their past."}]}, "authors": ["Graham Greene"], "isbn": "0143039113", "longitude": -0.12574, "periods": ["1900s"], "title": "The Ministry of Fear", "word_cloud": "extraordinary doubt exists powerfully accurate evocation entertainment much great describe espionage entertainment entertain certainly also beautifully write hero right word damage vulnerable predicament bravely try find reason hunt police murder commit nazi agent secret unwittingly expose merely win fateful cake village fete author first hand experience blitz display grim fitfully violent world tale also quite funny darkly unsettle way reason transcend stricture spy genre fact inventing genre go only explore territory literary way espionage fiction still future great title publish subtitle entertainment term lighter work produce really light start literal interpretation say cake eat win cake fundraise event consult fortune teller organizer reluctant let take home day man arrive lodge house insinuate eat slice crumble slice say cake then bomb strike house situated use journalist try kill wife send briefly psychiatric institution unemployable armed force civil defense want rank possessions clothes love young reread financially convinced visitor fateful night try poison keen find meant win contain something bit country concoct espionage austrian refugee brother sister surnames help aid assistance run humanitarian agency plenty volunteer picture plenty wartime poverty stoicism sacrifice behalf home nation portrays even blunder stun burden confused life loss useful war effort make nor war movie stay true create complex forever musing sin guilt wonderful wonderful prose best see film name comparison wonderful description suspense know spook thrill funny open new read horizon bee on second thought go along get confuse hard follow sure rest easier level accusatory finger entertainment call much novel stitch conveniently implausibilities become credible bustle hastily weave plot almost novelist save incredulity last moment sleight hand let away otherwise grudge perhaps nod best category amnesia hapless protagonist victim rescue almost becomes implausible narrative end haunt multiple level hint much greater work quiet american write fast profundity love better past become mystery let plot twist action adventure novel film story similar novel ordinary person get caught government intrigue manages survive fictional moral lesson story setting reflect european politics watch progress killer hire bump old politician corporation hire pay gunman money steal catch guilty robbery gunman resolve take revenge adventure recall continental politics politician sent buy coal supply government prevent acquire side civil war fails first succeed second sheer luck get glimpse corporate politics scene escape unbelievable man release sanitarium luck acquires cake make fresh ingredient war time ration get involve operate part charity organization committal sanitarium escape find think crazy catch spy secret microfilm leave country get bogged much psychological prattle film much better refers way secret service blackmail people want hidden scandal adventure novel film story similar novel ordinary person get caught government intrigue manages survive fictional moral lesson story setting reflect european politics watch progress killer hire bump old politician corporation hire pay gunman money steal catch guilty robbery gunman resolve take revenge adventure recall continental politics politician sent buy coal supply government prevent acquire side civil war fails first succeed second sheer luck get glimpse corporate politics scene escape unbelievable man release sanitarium luck acquires cake make fresh ingredient war time ration get involve operate part charity organization committal sanitarium escape find think crazy catch spy secret microfilm leave country get bogged much psychological prattle film much better refers way secret service blackmail people want hidden scandal", "genres": ["Fiction & Literature", "Mystery & Suspense", "WWII"], "summary": "\"A master thriller and a remarkable portrait of a twisted character.\" Time\r\n \r\nFor Arthur Rowe, the trip to the charity fête was a joyful step back into adolescence, a chance to forget the nightmare of the Blitz and the aching guilt of having mercifully murdered his sick wife. He was surviving alone, outside the war, until he happened to win a cake at the fête. From that moment, he is ruthlessly hunted by Nazi agents and finds himself the prey of malign and shadowy forces. \r\n\r\nThis Penguin Classics edition features an introduction by Alan Furst.", "asin": "0143039113", "rank": "164459", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41ozNQsFQdL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}