{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 502, "rating": 3.7, "reviews": [{"review_sentiment": 1.0, "review_text": "This is a very long book entirely in the stream-of-consciousness style. I read it because some call it a classic. I found it to be a classic example of diarrhea of a sick mind. The imagery on almost every page made me want to puke. After months of reading this book to he very end, I still can't tell you what the plot is or even what the book is really about. It seems to be set in Europe near the end of WW2 and everybody in it appears to be insane."}, {"review_sentiment": 5.0, "review_text": "The book is in many ways like Ulysses in that it is encyclopedic. Joyce said he wanted people to be able to recreate Dublin from his book, were the city to be somehow destroyed. Pynchon has allowed us to duplicate America at the beginning of the end of its empire. And just as Ulysses is full of Irish ‘inside’ jokes, GR is full of American history jokes, and, given Pynchon’s scientific background, full of silly science jokes and puns that only a nerd would get.The main theme revolves around the Puritanical nature of America and Western Europe and the Calvinistic concept of the Puritan \"elect\" or chosen and the \"preterite\". Slothrop is one of the preterite; he had a great, great Aunt who was hung in Salem. His father actually sold the infant Slothrop to one of the chosen, Professor Jampf, a contemporary of Pavlov. The deal was that the child would get a Harvard education in return for Jampf being able to give the baby an erection through stimuli, like the dogs – but even more so, in that Jampf believed that you could condition people to react to stimuli that aren't there – the lack of stimuli would cause a reaction – thus the continuing theme and chapters called “Less than Zero.”So this less than zero, something more than just on and off, for example, reflects Pynchon’s quantum physics background – in the same way, the Schrodinger’s cat is both alive and dead until the wave function collapses. Newton’s world was yes and no; Einstein’s was yes, no and maybe.So, since most are the preterite, they are expendable, they are Pavlovian dogs – their lives are controlled, videotaped, and generally screwed with as the chosen ones decide… human chess pieces. The chosen have come to be big chemical companies and their scientists (Pynchon argues that with du Pont’s development of plastic, scientists no longer had to limit themselves to what nature allowed – they could now beat nature and do whatever they wanted).  Constantly Pynchon talks about GE, du Pont, ICI (big English chem Company), Dutch Shell and IG Farben. In fact, these guys are the ones running the war, again as a big experiment… Pynchon ponders why all of the above companies have contributed to the V-2 – they share info, parts, data all during the war, and why not? His chapter In the Zone reflects the world of these companies after the war has ended… the unchosen preterite cannot go back to pre-war life… they have been programmed by war, to accept war as normal… so the new Zone is the cold war world into which we were born… and paranoia is rightly a part of our world – the ABC unit spies on the CDE unit which tries to gain the upper hand over the EFD people, ad infinitum. Among the chosen, everything is permissible and we the preterite take that as normal.If you recall, Pynchon mentions the one African tribe that was taken over by the Germans in the 1930s (then, they were given an alphabet because you can’t control without the language of Christianity, “in the beginning was the word”). Now in Germany, the tribe refuses to procreate – members come up with perverse sexual practices, anything with anyone or anything or any animal just to keep from having kids. They want no part of it – they seek the glorious death that Hemingway says is our only chance at a noble act. And in perfect Pynchon humor, the Germans are crazy – what will happen if there’s no one to turn into slaves? How will we live?We accept as normal that the OSS is in cahoots with the FBI and fights for power against the Stasi or against the OMB – a series of ridiculous initials – bureaucracies that are above country, like big corporations. Most of GR takes place after the war, in the zone when Russians and Americans and Turks and Africans are selling secrets, drugs, women, and civilizations as a way to continue holding power/money now that the war is over. The war allowed everything – so now everything is still allowed, the war continues as another phase of the experiment. A large part of the book is the list of perversions we preterite can be led into, tempted by the chosen as a Pavlovian experiment, just to feel something real – we’ll take pain, abuse, torture, eat shit, literally, anything to experience something real because our lives as preterite are not real.Here’s the clever part: early in section 2, Pynchon wonders if the guilt and repression that we Puritans have, the stuff Freud brought to light, don’t actually come to life in the form of people. Our sexual guilt is now alive in a certain part of the population, for example, and thus there are crazy people, doing crazy things everywhere – including crazy scientists, salesmen, generals, you name it. Then Pynchon asks which came first, crazy people or the Puritan repression that made crazy people. Did the war make the V-2 or did V-2 technology beget the war? Did the war make western cultures crazy or did the innate craziness make the war? Thus the central theme: does the rocket find Slothrop’s conquests or do the women call down the V-2? In a very quantum physics way, Pynchon questions cause and effect. Did Reagan create Ollie North or did North create Reagan? This is a very deep question – and one that could lead you, like Slothrop, into some very paranoid thoughts.Long before the end of the book, Slothrop simply evaporates – he goes from Slothrop to Zoot Suit Man to a reporter to Rocketman until his personality unravels. His quest to find out who he is and who is controlling him leads to either insanity or to dissipationBut, there’s a chance that maybe it was Slothrop’s insanity that started him on the quest – maybe the entire book is nothing but the ravings of an increasingly paranoid schizophrenic? Or was he turned into one by those early penile experiments?We can’t know because we are living the experiment the chosen have made for us (can we be made to react with less than zero stimuli?)… or our innate insanity has us so paranoid we spook at everything… or we’re paranoid for good reason.Maybe GR was a product of the 60s… maybe it was once too fantastical… but these days the book can seem tame compared to one hour of watching CNN or Fox. I think GR was once a tough read, but now it’s as accessible as a fairy tale.(Trump called Kim Jon Un “Rocketman”…  coincidence? I don’t think so. More like prescience on Pynchon’s part. Both the Korean supreme leader (a Pynchon term for sure) and Trump (Captain Chaos) fit perfectly as characters into GR without skipping a beat.)"}, {"review_sentiment": 5.0, "review_text": "Excellent product.  Shipped on time and came as described.  Would use this vendor again."}, {"review_sentiment": 5.0, "review_text": "I finally read it this summer. I almost wish I hadn't because I can't seem to get started on anything else now that it's behind me. I'm genuinely concerned that I will never find another book with the prose and scope of this novel. Borges, Nabokov, Eco, et al. I've read so many things that I've loved immensely, but I'm not sure I've ever read anything I loved this much. I annoyed the hell out of my friends and family reading snippets that I just had to share with someone."}, {"review_sentiment": 1.0, "review_text": "I threw in the towel on all this chronic word salad at about page 75 when I saw the story was not going to be clarified anytime soon.  I made a real effort but in the end couldn't contain my anger at being (what I felt was) jerked around by the author.  I just didn't see how I was going to get through 800 pages of this treatment."}, {"review_sentiment": 4.0, "review_text": "Good"}, {"review_sentiment": 5.0, "review_text": "My favorite book of all time. The guy who recommended this to me told me it was about \"the absolute interconnectedness of everything,\" and after reading it three times (once out loud to my wife) I can confidently say that he was right. This is one of those books that resonates and echoes around in your head for a long, long time. And it comes complete with gorgeous, poetic language, psychedelic trippiness, belly laughs, paranoid, macabre fun, and the deepest insights into the human condition of any nov"}, {"review_sentiment": 5.0, "review_text": "It may be 44 years old, but it's still a nihilist epic poem for the age of Trump. Especially relevant given the recent revelation of a down-and-out Ukrainian middle factory selling rocket engines to North Korea. I finished it today and wanted to start all over again."}, {"review_sentiment": 5.0, "review_text": "I bought a paperback copy of “Gravity’s Rainbow” sometime in the mid-1970’s. This must have been about the time that the paperback edition first came out. I began reading it but couldn’t quite make out what it was supposed to be. I didn’t make it past the first few pages before abandoning it. That was over 40 years ago now and quite a bit has ensued in the world in the mean time and I am not the person who I was at the time.  The world, as I see it, and I, as I see myself, are quite different now. That, I think, is one of the themes of the novel. People construct their own reality and people need a constructible and explainable reality.The main theme that I take from “Gravity’s Rainbow” is the need for people to create a controllable reality and the effect on them if that is not possible.  WW2, in the novel, destroys the sense of control that people have. Early in the novel, the V2 rocket is an agent of that loss of control. It plummets at supersonic speed. The sound of its plunge reaches people after its explosion and destruction. The effect comes before the cause.  People feel helpless in the face of it and psychologically fail.  They seek new beliefs, new constructs, anything to regain that control. Science, mysticism, and anything are shown in the novel to be mechanisms whereby people seek that control. Later in the novel, the rocket is shown to have taken on mystic significance and is incorporated as part of the psychological explanation that provide people with the illusion of comprehension and control of their surroundings.“Gravity’s Rainbow” may be difficult, at times, but it is a book that rewards reading.  There are passages that are laugh-out-loud funny. There are passages of profound insight and there are passages of beautiful English. It is book that entertains and instructs. It will reward many readings. I found myself marking sections and going back to read them because they are just so good. This book may be difficult but it is accessible and it is enjoyable."}, {"review_sentiment": 5.0, "review_text": "This novel is bomb. I loved it. Warpedy brain in all sorts of ways. Worth the effort."}]}, "authors": ["Thomas Pynchon"], "isbn": "0143039946", "longitude": -0.12574, "periods": ["1900s"], "title": "Gravity's Rainbow", "word_cloud": "long entirely style call classic find classic example diarrhea sick mind imagery almost page make want puke month read end still plot even really seem set end everybody appear insane many way encyclopedic say wanted people able recreate city somehow destroyed allow begin end empire ulysses full joke full history joke give scientific background full silly science joke pun nerd main theme revolve around nature concept elect choose preterit preterit great great hung father actually sell infant chosen contemporary deal child education return able give baby erection stimulus dog even believe people stimulus lack stimulus reaction thus continue theme chapter call le something example reflect quantum physic background way cat alive dead wave function collapse world yes preterit expendable pavlovian dog live control videotape generally screw choose one human chess piece chosen come big chemical company scientist argue development plastic scientist longer limit nature allow nature want talk dew big chem fact guy one run war big ponders company contribute share info part data war chapter reflect world company war chosen preterit go back program war war new cold war world paranoia rightly part world unit spy unit try gain upper hand people ad infinitude choose everything permissible preterit recall mention tribe take give control language begin word now tribe refuse procreate member come perverse sexual practice anything anyone anything animal keep kid want part seek glorious death say chance noble act perfect humor crazy turn slave live accept normal cahoot fight power series ridiculous initial bureaucracy country big corporation most take place war zone sell secret drug woman civilization way continue hold war war allow everything everything still allow war continue phase experiment large part list perversion preterit lead tempted chosen pavlovian experiment feel something real take pain torture eat shit literally anything experience something real live preterit clever part early section wonder guilt repression stuff bring light actually come life form people sexual guilt alive certain part population example thus crazy people crazy thing everywhere include crazy scientist salesmen general name then ask come first crazy people repression make crazy people war make technology war war western culture crazy innate craziness make war central theme rocket find slothrop conquest woman call quantum physic way question cause effect create deep question paranoid end simply evaporate go reporter personality unravel quest find control lead insanity dissipation but chance maybe insanity start quest maybe entire nothing raving increasingly paranoid schizophrenic turn early penile experiment know live experiment choose make make react le stimulus innate insanity paranoid spook paranoid good product maybe day seem tame compare hour watch think tough accessible fairy tale call coincidence think more prescience part supreme leader term sure fit perfectly character skip beat excellent product time come described use vendor finally summer almost wish start anything else genuinely concern never find prose scope al many thing love immensely sure ever anything love much annoy friend family read snippet share someone throw towel chronic word salad page saw story go clarified anytime soon make real effort end anger felt jerk author see go page treatment good favorite time guy recommend tell absolute interconnectedness everything reading time loud wife confidently right resonate echo head long long time come complete gorgeous poetic language psychedelic nippiness belly laugh paranoid macabre fun deepest insight human condition nov year old still nihilist epic poem age give recent revelation factory sell rocket engine finish today want start buy paperback copy sometime time edition first come begin read quite make supposed make past first page abandon year ago quite bit ensued world mean time person time world see see quite different think theme construct reality people need constructible explainable main theme take need people create controllable reality effect possible destroy sense control people rocket agent loss control plummet supersonic speed sound plunge reach people explosion destruction effect come cause people feel helpless face psychologically fail seek new belief new construct anything regain control mysticism anything show mechanism whereby people seek control rocket show take mystic significance incorporate part psychological explanation people illusion comprehension control difficult time reward read passage funny passage profound insight passage beautiful english entertain instruct reward many reading find mark section go back good difficult accessible enjoyable bomb love brain sort way effort", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "Winner of the 1973 National Book Award, Gravity's Rainbow is a postmodern epic, a work as exhaustively significant to the second half of the twentieth century as Joyce's Ulysses was to the first. Its sprawling, encyclopedic narrative and penetrating analysis of the impact of technology on society make it an intellectual tour de force.\r\n\r\nLengthy, complex, and featuring a large cast of characters, the narrative is set primarily in Europe at the end of World War II, and centers on the design, production and dispatch of V-2 rockets by the German military. In particular, it features the quest undertaken by several characters to uncover the secret of a mysterious device named the \"Schwarzgerät\" (\"black device\"), slated to be installed in a rocket with the serial number \"00000\".\r\n\r\nTraversing a wide range of knowledge, the novel transgresses boundaries between high and low culture, between literary propriety and profanity, and between science and speculative metaphysics.\r\n\r\nThe novel shared the 1974 U.S. National Book Award for Fiction with A Crown of Feathers and Other Stories by Isaac Bashevis Singer. Although selected by the Pulitzer Prize jury on fiction for the 1974 Pulitzer Prize for Fiction, a single passage involving coprophilia offended the other members of the Pulitzer board, who rejected the selection. No Pulitzer Prize was awarded for fiction that year. The novel was nominated for the 1973 Nebula Award for Best Novel.\r\n\r\nTIME named the novel one of its \"All-Time 100 Greatest Novels\", a list of the best English-language novels from 1923 to 2005 and it is considered by some critics to be one of the greatest American novels ever written.\r\n\r\nWikipedia", "asin": "0143039946", "rank": "17057", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51Ruv1DR2pL.jpg", "country": "England", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}