{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 43, "rating": 4.4, "reviews": [{"review_sentiment": 3.0, "review_text": "Three stars because I love most of Graham Greene's work. This is a story about two old friends in Spain who head off on a sort of pilgrimage in their battered car. But it isn't up to the standard of his best work, eg The Human Factor. I read this one in paperback years ago, quite liked it then I thought, and recently bought the Kindle version. Unfortunately the conversations (arguments/debates) now seem laborious, and at times preposterous. Writing modern idiom makes Greene seem like a fish out of water. A young women appearing from behind some bushes asks the old gentlemen if they have been 'making out' like her! It was too embarrassing to read any more and I deleted the book."}, {"review_sentiment": 5.0, "review_text": "More to it than it first appears . Excellent introduction, too."}, {"review_sentiment": 1.0, "review_text": "This is about the edition, not the novel. Amazon sent me a counterfeit. A somewhat skilled counterfeit--could be a very low quality Penguin edition, similar to how toaster makers sell cheap stuff on Amazon and Walmart. But nonetheless, the edition sucks.The pages are white and see through, the cover is cardboard? like a glossy post card. All around unreadable."}, {"review_sentiment": 5.0, "review_text": "Great read"}, {"review_sentiment": 5.0, "review_text": "One of Graham Greene's best books"}, {"review_sentiment": 5.0, "review_text": "Great book with a spoof on Don Quixote. Make sure you read Cervantes first!"}, {"review_sentiment": 5.0, "review_text": "Most entertaining."}, {"review_sentiment": 5.0, "review_text": "This is the first of his books that I really appreciated. The dialogue between the 2 characters, the mutual respect and the resulting insights each came to were really  important. Especially for Monsignor Quixote.."}, {"review_sentiment": 5.0, "review_text": "I've read it before and I'll read it again. Hard to understand that Mr. Greene isn't Spanish. And if you look around, you'll discover things haven't changed mush since this book was written."}, {"review_sentiment": 4.0, "review_text": "Lovely book. enjoyed it."}]}, "authors": ["Graham Greene"], "isbn": "0143105523", "longitude": -3.7035825, "periods": ["1900s"], "title": "Monsignor Quixote", "word_cloud": "star love work story old friend head sort pilgrimage batter car standard best work eh paperback year ago quite like think recently buy version conversation seem laborious time preposterous modern idiom make seem fish water young woman appear bush asks old gentleman embarrass delete more first appear excellent introduction edition send somewhat skilled counterfeit quality edition similar toaster maker sell cheap stuff nonetheless edition page white see cover cardboard glossy post card unreadable great best spoof sure first most entertaining first really appreciate dialogue character mutual respect result insight come really important understand discover thing change mush write lovely enjoy", "genres": ["Fiction & Literature", "Religion"], "summary": "When Father Quixote, a local priest of the Spanish village of El Toboso who claims ancestry to Cervantes’ fictional Don Quixote, is elevated to the rank of monsignor through a clerical error, he sets out on a journey to Madrid to purchase purple socks appropriate to his new station. \r\n\r\nAccompanying him on his mission is his best friend, Sancho, the Communist ex-mayor of the village who argues politics and religion with Quixote and rescues him from the various troubles his innocence lands him in along the way. \r\n\r\nPublished in 1932, Monsignor Quixote is Graham Greene’s last religious novel, a fond homage to Cervantes, and a sincere exploration into the meaning of faith in the modern world. ", "asin": "0143105523", "rank": "421710", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/412PcaQt84L.jpg", "country": "Spain", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}