{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 354, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "Love the way he tells the story,  his description of places and people are fascinating and very personal. I have not been to Venice, but would love to and would now look at it very differently."}, {"review_sentiment": 4.0, "review_text": "Good book to read before going to Venice."}, {"review_sentiment": 5.0, "review_text": "Read the book before a trip to Venice and it was great preparation for the trip."}, {"review_sentiment": 5.0, "review_text": "I am reading the book for the second time.  It was interesting seeing the actual locations & having our dinners in a familiar spot.  Look forward to another visit."}, {"review_sentiment": 2.0, "review_text": "This book was recommended to my husband so I purchased it for him.  While it has some interesting facts and characters, I never finished it.  It just bogged down and I wasn't interested enough to keep reading.  My husband never finished it either."}, {"review_sentiment": 5.0, "review_text": "the books always better than the movie but i loved the movie"}, {"review_sentiment": 4.0, "review_text": "Really brings back memories of Venice to those who have traveled there.  Its impressive how Berendt somehow got all these diverse people to talk to him.  The one criticism I have is that he spent too much time one or two of the stories."}, {"review_sentiment": 2.0, "review_text": "Self deserving"}, {"review_sentiment": 3.0, "review_text": "An interesting book about the town of Venice and the people who actually live there- as opposed to the tourists.  The people and places you meet in the book are interesting, but he just couldn't find the quirkiness and the mystery that he found in Savannah.  Sorry, John. \"Midnight\" is one of my favorite books- next time, try New Orleans."}, {"review_sentiment": 3.0, "review_text": "After \"Midnight in the Garden of Good and Evil,\" this was quite a letdown. The portion of the book about Ezra Pound and Olga Rudge really dragged.  There was none of the humor or great anecdotes about interesting characters or back stories. The characters were mostly self important and unsympathetic. Other than that, it was fine..."}]}, "authors": ["John Berendt"], "isbn": "0143036939", "longitude": 12.3345898, "periods": ["2000s", "Recent Releases"], "title": "The City of Falling Angels", "word_cloud": "way tell story description place people fascinate personal differently good go read trip great preparation trip read second time interest see actual location dinner familiar spot forward visit recommend husband purchase interesting fact character never finish bogged interested enough keep reading husband never finish always better movie love movie really bring memory travel impressive somehow get diverse people talk criticism spend much time story deserve interesting town people actually live opposed tourist people place meet interesting quirkiness mystery find favorite next time quite letdown portion really drag none humor great anecdotes interest character back stories character mostly self important unsympathetic other fine", "genres": ["History", "Travel Writing"], "summary": "Twelve years ago, Midnight in the Garden of Good and Evil exploded into a monumental success, residing a record-breaking four years on the New York Times bestseller list (longer than any work of fiction or nonfiction had before) and turning John Berendt into a household name. \r\n\r\nThe City of Falling Angels is Berendt's first book since Midnight, and it immediately reminds one what all the fuss was about. Turning to the magic, mystery, and decadence of Venice, Berendt gradually reveals the truth behind a sensational fire that in 1996 destroyed the historic Fenice opera house. \r\n\r\nEncountering a rich cast of characters, Berendt tells a tale full of atmosphere and surprise as the stories build, one after the other, ultimately coming together to portray a world as finely drawn as a still-life painting.", "asin": "0143036939", "rank": "157016", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51AFYZxNRhL.jpg", "country": "Italy", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}