{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 228, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I am sorry I gave up on the Gunther novels because the idea that amongst the Germany of the NAZI years there were some good cops is pure fantasy and mocks at the reality of history. The incredible feature of those years was that Heinrich Himmler was able to turn the regular police force in Germany in the Weimar years into the force which kept the Jews in control so they boarded the cattle trucks on the trans to the death camps . However in this novel Kerr produces some unforgettable scenes ,for example one in which a German officer having wi9tnessed the  killing of Jews in Poland is quietly murdered because he has not now embraced Nazi philosophy.and must be eliminated. Kerr beautifully suggests the soul-searching that Gunther undergoes. To regard it as a sort of cops and robbers story is really silly and may appeal to American readers  because they have never had to live under  a regime which turned the murder of other human beings as respectable.."}, {"review_sentiment": 5.0, "review_text": "Kerr continues to astound us!His prose is impeccable, his plots magnificent and his atmospherics have no equal in the genre. May Bernie Gunther continue to reign supreme!"}, {"review_sentiment": 5.0, "review_text": "as promised."}, {"review_sentiment": 5.0, "review_text": "Prague Fatale is the fifth Philip Kerr mystery that I read. I read the first three in order and then jumped to the 2017 novel. This one is somewhere in the middle. One does not have to read them in order to enjoy them. I like them and have three more on my desk ready to read.Kerr is an excellent author. His tales about Bernie Gunther are gripping. They are excellent suspenseful tales. Many of the stories, such as this one, focus on what is happening during World War II. Most of the happenings in this tale are in the lands of the Czechs. Kerr has Bernie make wise cracks on every page. They are enjoyable, funny, and do not disrupt the tale or overdone. Bernie despises the Nazis and feels awful about the murder of the Jews and everyone knows it. Even the butcher General Reinhard Heydrich who was placed in charge of the land of the Czechs. He uses Bernie despite his views because Bernie is the best detective in Germany.There are essentially four plots in this thriller: (1) Heydrich summons Bernie to his territory to find the person who he thinks wants to kill him. While there, an officer, an adjutant to Heydrich is shot twice in a closed room. The door to the room is locked with a key in the inside keyhole and the window in the room is bolted shut. (2) The Czechs dislike the Germans and three of them, called the Three Kings are harming Germans. Two were caught, but one is at large. (3) There is a traitor among the Germans who is giving information to the Czechs who are passing it on to England. We do not know the traitor’s identity. (4) Bernie meets a woman and is attracted to her, brings her with him to Heydrich’s territory, but he is not sure she is on his side."}, {"review_sentiment": 4.0, "review_text": "A little too much Roger Ackroyd but otherwise perfect Bernie. Reinhard Heydrich gets full treatment."}, {"review_sentiment": 5.0, "review_text": "Another great Bernie Gunther story."}, {"review_sentiment": 1.0, "review_text": "I found this book almost unreadable because it was so poorly written.  The author seems to believe that by throwing out names of streets and people from the times he can forego character, plot and writing that is bearable to read.  But good came out of bad.  I got this book from the library (thank goodness i didn't pay money for it!), and after I found it, I glanced up and saw a book by Ken Kesey called, \"Sometimes a Great Notion.\"  The name sounded familiar and I selected it, too. What a great book that was!  Please put down your Kerr and pick up this book by Kesey and be prepared for a grand story told brilliantly!"}, {"review_sentiment": 5.0, "review_text": "Very well written.  Engaging all the way through"}, {"review_sentiment": 5.0, "review_text": "As always by Kerr a first rate read."}, {"review_sentiment": 5.0, "review_text": "I like his story lines because there is reference to WWII.  The reader sees the times from the reference of the first person, a detective. The story is more personally attached to the conflicts one faces during this period.  It is not as simple as the ally and the enemy. There are so many other contexts of relationships depending on the time, region, cultures, religion."}]}, "authors": ["Philip Kerr"], "isbn": "0143122843", "longitude": 13.3888599, "periods": ["1900s"], "title": "Prague Fatale: A Bernie Gunther Novel", "word_cloud": "sorry give novel idea among st year good cop pure fantasy mock reality history incredible feature year able turn regular police force year force kept control board cattle truck trans death camp however produce unforgettable scene example german officer kill quietly murder embraced eliminate beautifully suggest undergoes sort cop robber story really silly american reader never live regime turn murder human being continue prose impeccable plot magnificent atmospherics equal genre continue reign supreme promise fifth mystery first order jump somewhere order enjoy like desk ready excellent author tale grip excellent suspenseful tale many story focus happen happening tale land make wise crack page enjoyable funny disrupt tale overdone despise feel awful murder everyone know even butcher place charge land use view best detective essentially plot thriller summons territory find person think want officer adjutant shot twice close room door room lock key inside keyhole window room bolt dislike call harm catch large traitor give information passing know traitor identity meet woman attract brings territory sure side little much otherwise perfect get full treatment great story find almost unreadable poorly write author seem believe throw name street people time forego character plot write bearable good come bad get library thank goodness pay money find glance saw call sometimes name sound familiar select great put pick prepare grand story tell brilliantly very well write way always first rate like story line reference see time reference first person detective story personally attached conflict face period simple ally enemy many context relationship depend time region culture religion", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII"], "summary": "September 1941: Reinhard Heydrich is hosting a gathering to celebrate his appointment as Reichsprotector of Czechoslovakia. He has chosen his guests with care. All are high-ranking Party members and each is a suspect in a crime as yet to be committed: the murder of Heydrich himself.\r\n\r\nIndeed, a murder does occur, but the victim is a young adjutant on Heydrich’s staff, found dead in his room, the door and windows bolted from the inside. Anticipating foul play, Heydrich had already ordered Bernie Gunther to Prague. After more than a decade in Berlin's Kripo, Bernie had jumped ship as the Nazis came to power, setting himself up as a private detective. But Heydrich, who managed to subsume Kripo into his own SS operations, has forced Bernie back to police work. Now, searching for the killer, Gunther must pick through the lives of some of the Reich’s most odious officials.\r\n\r\nA perfect locked-room mystery. But because Philip Kerr is a master of the sleight of hand, Prague Fatale is also a tense political thriller: a complex tale of spies, partisan terrorists, vicious infighting, and a turncoat traitor situated in the upper reaches of the Third Reich.", "asin": "0143122843", "rank": "72127", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/518Gb%2B0X4RL.jpg", "country": "Germany", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}