{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 57, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "It's a lot of work and it's worth it.  Terrifying and real.  And have gained a new appreciation for Shostakovich's music - opus 49, 110 etc and Keith Jarrett's Shostakovich Preludes and Fugues also an inspiration which I listened to throughout.  Thank you for your efforts as an author."}, {"review_sentiment": 1.0, "review_text": "I could not finish this book. It may be an unfortunate happenstance that this was the first William Vollman book that I’ve attempted to read. It is so poorly written and uniquely uninteresting that I will never attempt another of his works.Recommendation: NO"}, {"review_sentiment": 5.0, "review_text": "Beautiful, profound writing."}, {"review_sentiment": 5.0, "review_text": "I find that the older I get, the closer World War II seems in time.  Growing up in the Sixties, born a decade after the war's end, it seemed ages ago and impossible to imagine as real.  Now it seems only yesterday.  The tragicomic election of Trump, marking the unmistakable decline of the U.S., and the rise of China, make a new world war all too imaginable.Vollmann's 750-page novel moves back and forth between the two central antagonists in the war, Hitler's Germany and Stalin's Russia, presenting fictionalized accounts of real historical individuals and events.  I initially found the style difficult, and it took me months to finally finish, setting it down periodically before returning.  There were two things that compelled me to pick it up and to persevere -- first, my annual trips to Berlin for the past several years, which have led to a fascination with German history, and second, my love for the Russian composer Dmitri Shostakovich, who is the central fictionalized character in the novel.Most of the characters are closely based on real life, and Vollmann did impressively extensive research -- the sources are presented at the back of the book.  But he created an imaginary lover for Shostakovich, and a love triangle also featuring a Soviet filmmaker is the most developed set of characters in the novel.  Other than the composer, I found the accounts of two generals, General Vlasov, who was captured by the Germans, and General Paulus, who was captured by the Russians after his defeat at Stalingrad, to be the most gripping and impressive, with Vollmann demonstrating his ability to inhabit the thinking of his characters.Europe Central won the National Book Award.  I recommend it to anyone interested in modern literary insight into the most brutal, consequential event of the 20th Century."}, {"review_sentiment": 5.0, "review_text": "It joins V. Grossman's Life and Fate - two works that illuminate WWII in the same way that War and Peace did the War of 1812You cannot read one without the other.It is that rare book that one finishes and takes a breath and then begins again."}, {"review_sentiment": 2.0, "review_text": "Couldn't really get going with this book. My only experience so far with Vollman is my reading of The Dying Grass, which kept me going satisfied through its 1200+ pages. Europe Central is very different.- colder?"}, {"review_sentiment": 5.0, "review_text": "G-R-E-A-T"}, {"review_sentiment": 5.0, "review_text": "Vollmann’s language is rich and strawberry cream creamy, language that, without too much ado, could be transcribed into T.S. Elliot-style poetry, since his themes hit on damaged humanity, the power of history and fragmentation, and that’s fragmentation as in Dada, as in Hannah Höch and John Heartfield photomontage, a form of art Adolf Hitler especially despised. And with this quote from Mein Kampf “I go the way that Providence dictates, with the assurance of a sleepwalker.\" the novel repeatedly refers to Hitler as the sleepwalker.I particularly enjoy the author’s vivid image of those old black rotary telephones having ten eyes, “that octopus whose ten round eyes, each inscribed with a number, glare through you at the world.” and then linking the telephone with sleepwalker Hitler: “The sleepwalker in the Reich Chancellery could tell you (not that he would) they’re his eyes, lidless, oval, which imparts to them a monotonously idiotic or hysterical appearance . . . “. It’s that fluid yet deadly interplay of objects with the human, as if Hitler is so omnipresent he is looking at all Nazis under his command as well as the entire population of Europe through the ten eyes of each and every black telephone, 1930s-1940s ubiquitous device par excellence. “The sleepwalker’s all eyes” And in terms of using his eyes, let's not forget Hitler spent many years dedicated to the visual arts, drawing and painting as a near-starving artist in Vienna.Reading the first section ‘Steel in Motion’ I catch initial glimpses of the novel’s stunning historical references, for example: “Barrage balloons swim in the air, finned and fat like children’s renderings” Bulls-eye, WTV! Perfect simile; that’s exactly what those barrage balloons looked like, balloon used by the British to defend against air attacks – the cables holding up the balloon would damage enemy aircraft.“Steel imbued with the sleepwalker’s magic sight, illuminates itself as it comes murdering.\" Again, 'Europe Central' shares much with the photomontage of artists like Hannah Höch and John Heartfield, a steely emphasis on the intertwining of humans with technologies, for example, another image of the octopus-telephone: “From the anus-mouth behind the dial.” Vollmann soaks the black gadget for all its worth, telephone as the eyes and anus of Hitler.  Yet again, another striking quote: “Don’t trust any technicians who assure you that this brain is “neutral” – soon you’ll hear how angrily the receiver jitters in its cradle.” The author picks up on Marshall McLuhan -- the media is the message. It’s as if in Europe Central the gadgets and all that steel exude a life of their own and are manipulating humans as their flesh-and-blood pawns. “Behind the wall, rubberized black tentacles spread across Europe.” Ominous, ominous – 20th century technology as the strangling octopus, throttling, choking and crushing humans as if they are a school of helpless little fish in an ocean of steely, unforgiving tentacles.Then, in the section entitled “The Saviors: A Kabbalistic Tale”  The author uses Aristotelian compare and contrast in presenting Fanya Kaplan with N.K.Krupskaya,, two women who saw themselves as good Marxist comrades marching shoulder to shoulder with other likeminded comrades toward the land of final synthesis as in Hegel-turned-on-his-head thesis-antithesis-synthesis. And age 28 special for both Ks, Kaplan and Krupskaya, since Krupskaya at age 28 married Lenin and Kaplan at age 28 shot him. And each woman, as per vintage photos, were stunning as a 20-year-old, but, oh my goodness, did women age quickly back then, especially when sent to prison or Siberia for years of hard labor.Anyway, Vollmann packs in historical facts and lyrical images as if he were stuffing 25 pounds of potatoes into a 10 pound sack, for example, we read the following of the last 4 days in Fanya Kaplan’s life after she shot Lenin: “a huddle of twenty-four grey subterranean hours like orphaned mice; and in the flesh of every hour a swarm of useless moments like ants whose queen has perished; and within each moment an uncountable multitude of instants resembling starpointed syllables shaken out of words . . . “  If you were counting, that’s three similes tightly packed in.  I read a Paris Review interview where Vollmann relates how at one time in his life he was writing 16 hours a day.  Now that’s a writer on fire! . . . and perhaps on cocaine, speed, or, at least, caffeine.For the narrator of Europe Central, people stand tall like a certain letter of the alphabet, ideas glow like a letter, words hum like a letter, which reminds me of that Georges Perec quote: “Is the aleph that place in Borges from which the entire world is visible simultaneously, anything other than an alphabet?” And these Europe Central times are times for men and women of action, as in the action-packed words of Comrade N. V. Krylenko “We must execute not only the guilty. Execution of the innocent will impress the masses even more.” Ironically, Comrade Krylenko would himself be shot – I wonder if the masses were impressed.However, nobody could ever doubt Comrade Krylenko was a revolutionary who took his revolution seriously.  And equally ironic, through all the revolutionary slaughter, one of N. K. Krepskaya’s very favorite books was Louisa May Alcott’s ‘Little Women.’ And there’s a scene of N. K. Krepskaya meeting Fanya Kaplan in a prison cell that provides a stroke of Latin American-style magical realism: \"Then the letters disappeared into the woman's mouth. Krupskaya was speechless. The woman began to glow more and more, until the light from her was as white and pure as a page of the Torah.\"One of my favorite parts of the novel was all the references to Dimitri Shostakovich and his music. For example: “Best listened to in a windowless room, better than best an airless room – correctly speaking a bunker sealed forever and enwrapped in tree-roots – the Eighth String Quartet of Shostakovich (Opus 110) is the living corpse of music, perfect in its horror.  Call it the simultaneous asphyxiation and bleeding of melody.”  To gain a keener insight and feeling for this novel, I listened to this and other Shostakovich string quartets repeatedly during my reading.  All in all, I great novel, but I must say not a novel exactly to my taste since I found, for one thing, the shifting first-person narrator at a distance from the other characters.  I contrast this with another 800 page novel set in Europe and Russia during WWII: “The Kindly Ones” by Jonathan Littell, a novel where the first-person narrator was a member of the Nazi SS.  The evil of Littell's novel was so real, so immediate, so powerful, I had to listen to the audiobook while taking my walks and let the evil run down my legs and out the bottom of my feet.  Europe Central is an encyclopedic literary monument to an incredible time in 20th century European history but, for me, Vollmann’s novel lacks the power of Littell’s."}, {"review_sentiment": 5.0, "review_text": "It is very rare that I come across a book that grabs me emotionally as strongly as Europe Central did.  An overwhelming evocation of the death and destruction that was Europe and Germany in the 20th century, particularly during World War II, Vollman also the moral dilemmas and ambiguity that people are forced to face especially when living in a state of war and totalitarism.As many have said here, the story is told through pairs of \"stories\" about people, mostly historical, beginning just before and after World War I and continuing essentially up until the mid 70's.  Most of these \"pincer movements\" are in some way \"opposites,\"  often Germany v. the Soviet Union.  Thus two of the longest stories are about Russian General Andrey Vlasov and German General Friedrich Paulus.  Both were captured after their armies were surrounded and both essentially were turned to the other side.  On the other hand, early in the book, we get stories about Lenin's wife on one hand and the woman who attempted to assassinate Lenin.  These stories are connected in various ways and are essentially chronological but do not add up to a \"plot\" as such.  Rather this is a look at what life and culture were like in Europe Central.  The backbone of the book is a fictionalized life of Dmitri Shostakovich in terms of his reception by Stalin and his Communist cronies and his presence in Leningrad during much of the siege by the Nazis.I've read criticism that as \"historical fiction,\"  Europe Central is hard to read for someone not well versed in the history of WW II and the Soviet Union under Stalin.  Because these subjects are of general interest to me, I did not have this problem but I also don't feel that it has to be a problem in this age of the internet.  Wikipedia contains more than sufficient background for Vollmann's subjects.  A quick read of the entries about Kathe Kollwitz or the Battle of Stalingrad, or Kurt Gerstein or any of the other subjects will tell a reader of Europe Central all they need to know to understand Vollmann's book.  I knew nothing about Vlasov's Army but when I got to that part of Europe Central, it was a 10 minute side trip to learn how conventional historians viewed the general.  Even Shostakovich's music is readily available online, particularly Op. 40 and 110 which are so central to Europe CentralThe book is long and has been criticized as such.  I disgree with the criticism.  I found nothing that I though should have been edited out.  My only problem with it is that the death, destruction and moral ambiguity I mentioned above are relentless and made Europe Central hard for me to read emotionally.  It was rare when I could tolerate much more than 25 pages or so in a sitting and it therefore took me a while to get through its 750 pages of text (not including another 70 or so pages of source notes).  Still I did not find the book particularly hard to read, unlike some new literature.  Vollmann's structure and style are very original but not anywhere near as dense and incomprehensible as I feared.  On the contrary, his syntax and grammar should be easily accessible to any moderately educated reader.I'm not sure how I managed to miss this when it was first published and awarded the National Book Award, nor am I sure how I got this far into my life without having even heard of William Vollmann but I'm awful glad I did.  I am looking forward to Seven Dreams.  In the meantime, I recommend Europe Central highly as one of the best works I've read in a very long time."}, {"review_sentiment": 1.0, "review_text": "Not my kind of book. I don't care for historical fiction. I am afraid of later using historical facts that turn out to be fiction. If you are like me this book is a pass."}]}, "authors": ["William T Vollmann"], "isbn": "0143036599", "longitude": 13.3888599, "periods": ["1900s", "Recent Releases"], "title": "Europe Central", "word_cloud": "lot work terrify real gain new appreciation music opus also inspiration listen effort author happenstance first attempt poorly write uniquely uninteresting never attempt no profound writing find older get closer seem time grow sixty bear decade war end seem age ago impossible imagine real now seem yesterday tragicomic election mark unmistakable decline rise make new world war move back forth antagonist war present fictionalized account real historical individual event initially find style difficult take month finally finish set periodically return thing compel pick persevere first annual trip several year lead fascination german history second love composer fictionalize character character closely base real life impressively extensive research source present back create imaginary lover love triangle also feature soviet filmmaker develop set character other composer find account general capture capture defeat grip impressive demonstrate ability inhabit think recommend anyone interested modern literary insight brutal consequential event century join work illuminate way rare finish take breath begin really go experience far read die keep go satisfied page colder language rich strawberry cream creamy language much ado poetry theme hit damage humanity power history fragmentation fragmentation photo montage form art especially despise go way dictate assurance sleepwalker repeatedly refer particularly enjoy author vivid image old black rotary telephone ten eye octopus ten round eye inscribe number glare link telephone sleepwalker sleepwalker lidless oval imparts monotonously idiotic hysterical appearance fluid yet deadly interplay object human omnipresent look command well entire population ten eye black telephone ubiquitous device par excellence sleepwalker eye term use eye spend many year dedicate visual art draw paint artist first section catch initial glimpse stun historical reference example balloon swim air fin fat child rendering simile exactly barrage balloon look balloon use british defend air attack cable hold balloon enemy imbue sleepwalker magic sight illuminates come murder share much photo montage artist steely emphasis intertwine human technology example image soak black gadget telephone eye anus striking quote trust technician assure brain neutral soon hear angrily receiver jitter author pick medium message gadget steel exude life manipulating human pawn wall rubberize black tentacle spread ominous century technology strangle throttle choke crush human school helpless little fish ocean steely unforgiving section entitle author use aristotelian compare contrast present woman saw good comrade march shoulder shoulder like minded comrade land final synthesis age special age marry age shot woman vintage photo stun oh goodness woman age quickly back especially sent prison year hard pack historical fact lyrical image stuff pound potato pound sack example follow last day life shot huddle grey subterranean hour orphan mouse flesh hour swarm useless moment ant queen perish moment uncountable multitude instant resemble star pointed syllable shake word count simile tightly pack interview relate time life write hour day now writer fire perhaps cocaine speed least people stand tall certain letter alphabet idea glow letter word hum letter reminds quote aleph place entire world visible simultaneously anything alphabet time time men woman action word guilty innocent impress mass even wonder mass nobody ever revolutionary take revolution seriously equally ironic revolutionary slaughter favorite meeting prison cell provide stroke magical realism then letter disappear woman mouth speechless woman begin glow light white pure page favorite part reference music example listen windowless room better best airless room correctly speak bunker seal forever entrap live corpse music perfect horror simultaneous asphyxiation bleed keener feel listen string quartet repeatedly read great exactly taste find thing shift narrator distance character contrast page set narrator member evil real immediate powerful listen audio book take walk let evil leg bottom foot encyclopedic literary monument incredible time century european history lack power rare come grab emotionally strongly overwhelming evocation death destruction century particularly also moral dilemma ambiguity people force face especially living state war many say story tell pair story people mostly historical beginning continue essentially mid most pincer movement way opposites often longest story russian capture army surround essentially turned side hand early get story wife hand woman attempt assassinate story connect various way essentially chronological add plot look life culture backbone fictionalize life term reception crony presence much siege criticism historical fiction hard someone well versed history subject general interest problem also feel problem age internet contain sufficient background subject quick entry subject tell need know understand know nothing get part minute side trip learn conventional historian view general music readily available online particularly op long criticize disagree criticism find nothing edit problem death destruction moral ambiguity mention relentless make hard emotionally rare much page sit therefore take get page text include page source note still find particularly hard new literature structure style original anywhere dense incomprehensible fear contrary syntax grammar easily accessible moderately educated sure manage miss first publish award sure get far life even hear awful glad look forward meantime recommend highly best work long time not kind care historical fiction afraid later use historical fact turn fiction pas", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "A daring literary masterpiece and winner of the National Book Award.\r\n\r\nIn this magnificent work of fiction, acclaimed author William T. Vollmann turns his trenchant eye on the authoritarian cultures of Germany and the USSR in the twentieth century to render a mesmerizing perspective on human experience during wartime. Through interwoven narratives that paint a composite portrait of these two battling leviathans and the monstrous age they defined, Europe Central captures a chorus of voices both real and fictional— a young German who joins the SS to fight its crimes, two generals who collaborate with the enemy for different reasons, the Soviet composer Dmitri Shostakovich and the Stalinist assaults upon his work and life", "asin": "0143036599", "rank": "180195", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51rof4-pRzL.jpg", "country": "Germany", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}