{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 163, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "This book accompanied me on many business trip flights and was the perfect read while I’m trying to distract myself from my uncomfortable state. I really appreciated the author’s vulnerability as she described the time away from her husband and her own struggle with leaving her career to support his."}, {"review_sentiment": 5.0, "review_text": "Ann Mah is one of the best food oriented storytellers around today."}, {"review_sentiment": 4.0, "review_text": "Mastering the  Art of  French  Eating is a  well written  memoir with  recipes although I Ann Mah's novel Chinese  Kitchen  much more.Although I thought it was well written, and engaging neither my husband nor I particularly like  French food so some  of the descriptions of  tripe,  brains and other inards ,  lots of bacon  which  we only have on a  very rare occasion and very little  meat or cheese  etc.  Most of the recipes  were  very  unhealthy  and  usually  very rich food  everything loaded with  tons of butter/ cream,  lots of meat,  usually lots of bacon,  and way  too much cheese and other dairy products  etc.  This  isn't the way we  eat, we  eat very  healthy, but  always wonderful very healthy food,  a good Mediterranean  diet. I  use  dairy products very  very  sparingly and very infrequently,  EVO instead of butter  99% of the time,  very  very very little  red meat only  a tiny bit a few times  a year, no tripe , bacon only 1-2 x annually, no steaks, no  hamburgers, no  frites (  french fries  ever),  lots of  vegetables, salads,  fish,  chicken ,  fruit, lentils and other legumes.  I cook  mostly Middle  Eastern food  which is  healthy and delicious,  that's  what we eat out also ,  we also eat healthy Indian food, particularly at a vegetarian  restaurant near us, and sushi."}, {"review_sentiment": 2.0, "review_text": "I picked up this book hoping, from the title, that it would be a thoughtful examination of the French culture and particularly the French attitude towards food, a kind of guide to the pleasure-loving way of life that they're so envied for, à la French Women Don't Get Fat but without the dieting angle. Instead, I was disappointed to discover that this book is no more than a printed-and-bound food blog. Full of personal anecdotes of little to no substance, enthusiastic descriptions of food, and the occasional, infuriatingly shallow foray into the country's rich culinary heritage. All that was missing were the insta-worthy photos of each dish (which even mentions taking!!!). Gag.It felt to me like a book she needed to write just to have something to do while her husband was away for the year. I got the impression that she wanted to be congratulated for existing in a foreign country and speaking basic French. She wrote an entire chapter about a kind of sausage which she refused to ever take more than a single bite of. At the end of it I asked myself, why do I care about this at all..?If you want to read the bland chit-chat between an American and her ex-pat friends in Paris and then hear her describe what a crepe tastes like, be my guest. Personally, I was not inspired and even a little bit annoyed that this book got published. Waste of a good title."}, {"review_sentiment": 4.0, "review_text": "Really enjoyed the divisions in this book. It helped me focus on what I want to eat when I am in France. Obviously a very important factor."}, {"review_sentiment": 4.0, "review_text": "QUITE INTERESTING !  merci, JG"}, {"review_sentiment": 4.0, "review_text": "no review"}, {"review_sentiment": 4.0, "review_text": "Enjoyable,quick read!"}, {"review_sentiment": 2.0, "review_text": "I found the book to be pretty boring and difficult to pick up every time. I don't think most people get this book looking for recipes, and the story behind them is not attractive enough to keep readers engaged. Wanted to like it but it was not for me."}, {"review_sentiment": 4.0, "review_text": "Very enjoyable - easy read."}]}, "authors": ["Ann Mah"], "isbn": "0143125923", "longitude": 2.3514992, "periods": ["2000s", "Recent Releases"], "title": "Mastering the Art of French Eating: From Paris Bistros to Farmhouse Kitchens, Lessons in Food and Love", "word_cloud": "accompany many business trip flight perfect try distract uncomfortable state really appreciate author vulnerability describe time away husband struggle leave career support best orient storyteller today well write memoir recipe ann much think well write engage husband particularly description tripe brain innards lot bacon rare occasion little meat cheese etc most recipe unhealthy usually rich everything load ton cream lot meat usually lot bacon way much cheese dairy product etc way eat eat healthy always wonderful healthy good diet use dairy product sparingly infrequently instead butter time little red meat tiny bit time year tripe bacon annually steaks hamburger fry fry ever lot vegetable salad fish chicken fruit lentils legume cook mostly healthy delicious eat also also eat healthy indian particularly vegetarian restaurant sushi pick hop title examination culture particularly attitude towards kind guide way life envy diet angle instead disappoint discover blog personal anecdote little substance enthusiastic description occasional infuriatingly shallow foray country rich culinary heritage miss photo dish even mention take felt need write something husband away year get impression want congratulated exist foreign country speak basic write entire chapter kind sausage refuse ever single bite end ask care want bland friends hear describe crepe taste guest personally inspire even little bit annoyed get publish good title really enjoy division help want eat obviously important factor quite interesting mercy review enjoyable quick find pretty boring difficult pick time think people get look recipe story attractive enough keep reader engage very enjoyable easy", "genres": ["Memoir", "Travel Writing", "Food and Wine"], "summary": "The memoir of a young diplomat’s wife who must reinvent her dream of living in Paris—one dish at a time\r\n\r\nWhen journalist Ann Mah’s diplomat husband is given a three-year assignment in Paris, Ann is overjoyed. A lifelong foodie and Francophile, she immediately begins plotting gastronomic adventures à deux. Then her husband is called away to Iraq on a year-long post—alone. Suddenly, Ann’s vision of a romantic sojourn in the City of Light is turned upside down.\r\n\r\nSo, not unlike another diplomatic wife, Julia Child, Ann must find a life for herself in a new city.  Journeying through Paris and the surrounding regions of France, Ann combats her loneliness by seeking out the perfect pain au chocolat and learning the way the andouillette sausage is really made. She explores the history and taste of everything from boeuf Bourguignon to soupe au pistou to the crispiest of buckwheat crepes. And somewhere between Paris and the south of France, she uncovers a few of life’s truths.\r\n\r\nLike Sarah Turnbull’s Almost French and Julie Powell’s New York Times bestseller Julie and Julia, Mastering the Art of French Eating is interwoven with the lively characters Ann meets and the traditional recipes she samples. Both funny and intelligent, this is a story about love—of food, family, and France.", "asin": "0143125923", "rank": "235466", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/61hWzI5qILL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}