{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1992, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "There are few books that cause me to reflect on my own life. This is one of them. A story of life and how we choose to live it. An excellent novel."}, {"review_sentiment": 4.0, "review_text": "A wonderful visit to NYC in 1938. I️ appreciate that the author doesn’t feel the need to explain every reference, as if he assumes you already know or can look it up yourself. Places, artists, authors are name-dropped with precision!"}, {"review_sentiment": 5.0, "review_text": "A book filled with wonderful characters who are beautifully described. I could feel the pace and breath of New York as a main character."}, {"review_sentiment": 5.0, "review_text": "Fabulous book. No need to gIve  more details.......trust me, just read it. You won’t be sorry. 😀"}, {"review_sentiment": 5.0, "review_text": "While being somewhat predictable, I still enjoyed the journey. If you liked the Great Gatsby, surely you will enjoy this."}, {"review_sentiment": 5.0, "review_text": "A Gentleman in Moscow was great.  Rules is very good, but not great.  But definitely worth the read.  The author turns a phrase exceedingly well."}, {"review_sentiment": 5.0, "review_text": "This novel has caused me to regret my age ... I will not have the opportunity to read Mr. Towles' final novel ... I will gobble as many as he is willing to place before me but time and tide wait for no man..."}, {"review_sentiment": 4.0, "review_text": "Very interesting characters. You feel yourself in NYC in the late 1930s. If you have ever lived in NYC, this book is a treat. Very well written, great dialogue. Makes me want to read other books by this author."}, {"review_sentiment": 5.0, "review_text": "I have enjoyed this author's books very much. While I have to say I liked A Gentleman in Moscow better, I would also recommend this book too. In both of these books he does a great job of setting the scene. The reader feels immersed in the era in which the characters are living. Would like to read more from this author."}, {"review_sentiment": 5.0, "review_text": "This author is a master story-teller.  I felt like I was part of the crowd in young NYC in 1938.  I liked the idea that the sophisticated crowd wouldn’t have a clue about my midwestern background...everyone rich and poor sounds the same."}]}, "authors": ["Amor Towles"], "isbn": "0143121162", "longitude": 0.0, "periods": ["1900s"], "title": "Rules of Civility", "word_cloud": "cause reflect life story life choose live excellent wonderful visit appreciate author feel need explain reference assume already know look place artists author precision fill wonderful character beautifully describe pace main character fabulous need detail sorry somewhat predictable still enjoy journey like surely great good great definitely author turn phrase exceedingly well cause regret age opportunity final gobble many willing place time tide wait man very interesting character feel nyc late ever live treat very well write great dialogue want author enjoy author much say like better also great job set scene feel immerse era character live author author master felt part crowd young like idea sophisticate crowd clue midwestern everyone rich poor sound", "genres": ["Fiction & Literature"], "summary": "The New York Times bestselling novel that \"enchants on first reading and only improves on the second\" (The Philadelphia Inquirer)\r\n\r\nThis sophisticated and entertaining first novel presents the story of a young woman whose life is on the brink of transformation. On the last night of 1937, twenty-five-year-old Katey Kontent is in a second-rate Greenwich Village jazz bar when Tinker Grey, a handsome banker, happens to sit down at the neighboring table. This chance encounter and its startling consequences propel Katey on a year-long journey into the upper echelons of New York society—where she will have little to rely upon other than a bracing wit and her own brand of cool nerve. \r\n\r\nWith its sparkling depiction of New York’s social strata, its intricate imagery and themes, and its immensely appealing characters, Rules of Civility won the hearts of readers and critics alike.", "asin": "0143121162", "rank": "1619", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/515vcmOa5GL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}