{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1136, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Beautifully written with fully-developed , interesting characters and a plot that will keep you guessing until the very end.  Loved it!"}, {"review_sentiment": 5.0, "review_text": "really really love this book! There were so many surprises who knew! I would certainly recommend this book if you want a good read."}, {"review_sentiment": 5.0, "review_text": "This is one of the best books I’ve read in a long time - one I really didn’t want to put it down!  So many twists - would recommend!!"}, {"review_sentiment": 4.0, "review_text": "It  was actually the stories of several characters.  When the many secrets were finally revealed there was still a final revelation. At times it was a somewhat unbelievable and difficult to keep up with the timelines and the various threads of the book but definitely worth reading.  In fact, hard to put down."}, {"review_sentiment": 4.0, "review_text": "Slow in spots, otherwise very good mystery."}, {"review_sentiment": 1.0, "review_text": "A talented eighth grader could write a better book than this drivel."}, {"review_sentiment": 5.0, "review_text": "Wonderfully described and complex characters, a brilliantly crafted story line, one of a select few books that you don't want to end, but will think about long after it does.  The best book I have read in years."}, {"review_sentiment": 5.0, "review_text": "Couldn't put it down.  Every single person in my book group loved it (which is not the norm!)."}, {"review_sentiment": 5.0, "review_text": "Couldn't put this one down. More twists and turns than a Grand Prix. Loved everything about it, sorry it had to end."}, {"review_sentiment": 5.0, "review_text": "Kmmmll oh.  Lmmmmm mph tfggg po jk Ning j’me, it rtg pull gb uh je j’habite je j’habite la mu"}]}, "authors": ["Joel Dicker"], "isbn": "0143126687", "longitude": 0.0, "periods": ["1900s", "2000s", "Recent Releases"], "title": "The Truth About the Harry Quebert Affair:", "word_cloud": "beautifully write interesting character plot guess end love really really many surprise know certainly want good best long time really want put so many twist actually stories several character many secret finally reveal still final revelation time somewhat unbelievable difficult timeline various thread definitely worth read fact hard put slow spot otherwise good mystery talented eighth grader better drivel wonderfully describe complex character brilliantly craft story line select want end think best year put single person group love norm put more twist turn everything sorry end tfggg po j j rt pull gb uh die j habit die j habit la mu", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "“Unimpeachably terrific.” —The New York Times Book Review\r\nOne of CBS This Morning’s 6 “Must-Have Titles for Your Summer Reading List”\r\n \r\nThe publishing phenomenon topping bestseller lists around the world, with sales of more than two million copies in Europe and rights sold in more than forty countries, The Truth About the Harry Quebert Affair is a fast-paced, tightly plotted, cinematic literary thriller, and an ingenious book within a book, by a dazzling young writer.\r\n \r\nAugust 30, 1975: the day fifteen-year-old Nola Kellergan is glimpsed fleeing through the woods, never to be heard from again; the day Somerset, New Hampshire, lost its innocence.\r\n \r\nThirty-three years later, Marcus Goldman, a successful young novelist, visits Somerset to see his mentor, Harry Quebert, one of the country’s most respected writers, and to find a cure for his writer’s block as his publisher’s deadline looms. But Marcus’s plans are violently upended when Harry is suddenly and sensationally implicated in the cold-case murder of Nola Kellergan—whom, he admits, he had an affair with. \r\n\r\nAs the national media convicts Harry, Marcus launches his own investigation, following a trail of clues through his mentor’s books, the backwoods and isolated beaches of New Hampshire, and the hidden history of Somerset’s citizens and the man they hold most dear. \r\n\r\nTo save Harry, his own writing career, and eventually even himself, Marcus must answer three questions, all of which are mysteriously connected: Who killed Nola Kellergan? What happened one misty morning in Somerset in the summer of 1975? And how do you write a book to save someone’s life?", "asin": "0143126687", "rank": "81772", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/519gYSFu7XL.jpg", "country": "New Hampshire", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}