{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 18, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "The story of a husband and father's journey with his daughter to escape the terrible aftermath of a flood in Trinidad. A moving and eloquent book about grief, loss, love and maritime adventure among others things."}, {"review_sentiment": 5.0, "review_text": "Beautifully written - poignant story, splendid descriptions of terrain and the moods of the sea!"}, {"review_sentiment": 4.0, "review_text": "Archipelago was the perfect mix of heartbreak (tabanca), hope, and healing for my current life status. I enjoyed the soothing lull of the ocean as I read about sailing from Trinidad to the Galapagos. It brought me some peace during my own turbulent days. I may have dragged out reading it partially because I so enjoyed imagining running away and sailing myself. To leave all of the excess and drama behind, only to come back to it with a renewed sense of purpose and peace."}, {"review_sentiment": 5.0, "review_text": "Loved this book. Roffey had my attention the whole time I read it. Tragically beautiful. Gives such great imagery of the Caribbean lifestyle."}, {"review_sentiment": 3.0, "review_text": "There was a lot to love in this book, but the sad part was gut-wrenching. Easy and quick read with enjoyable locals."}, {"review_sentiment": 5.0, "review_text": "An amazing novel about grief, love, loss and the sea. I could feel the wind in my hair and salt water on my skin as I read it. It wanted me to explore myself and the world even more!"}, {"review_sentiment": 5.0, "review_text": "A lovely moving story about loss and the ability to grieve and heal."}, {"review_sentiment": 3.0, "review_text": "He killed his dog.  And possibly his son too.  I didn't like that and I didn't like him, except when he was talking with his daughter.  On the plus side, the writing was evocative; it was easy to 'see' what was happening.  How could a 6-year-old be so sagacious?  I liked the daughter a lot, although I never could decide how to pronounce her name."}, {"review_sentiment": 5.0, "review_text": "I loved this book and didn't want it to end. I also loved Monique's other book \"The White Woman on the Green Bicycle\". I guess the truth is I'm sick of books that are too ... feminine. I'm a woman, but I'm tired of everything being all flowery and everyone going on and on about their feelings. Not that Monique doesn't delve into the feelings of the characters, because you know exactly how each of them feels, what losses/challenges they're experiencing, etc. But she's got a good dose of masculine energy in her writing which is refreshing to me. I'm not sure how else to describe it.Monique's descriptions of what it's like to be alone out at sea were exceptional. I really feel like I got it, even though I've never had the experience. Worth the money!"}, {"review_sentiment": 3.0, "review_text": "This novel was alright. I kept hoping it would get exciting, and climax but it just didn't happen. In the end, I just wanted to finish reading it. But I didn't find it was anything to rave about."}]}, "authors": ["Monique Roffey"], "isbn": "0143122568", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Archipelago: A Novel", "word_cloud": "story husband father journey daughter escape terrible aftermath flood move eloquent grief loss love maritime adventure others thing beautifully write poignant story splendid description terrain mood sea perfect mix heartbreak hope heal current life status enjoy soothe lull ocean sail bring peace turbulent day read partially enjoy imagine run away sail excess drama come back renew sense purpose peace love attention whole time tragically beautiful great imagery lifestyle lot sad part enjoyable local amazing grief love loss sea hair salt water skin want explore world even lovely move story loss ability grieve heal kill dog possibly son like like talk daughter plus side write evocative easy happen like daughter lot never pronounce name love want end also love guess truth sick feminine woman tire everything flowery everyone go feeling not delve feeling character know exactly feel experience etc get good dose masculine energy write refresh sure else describe description alone sea exceptional really feel get even never experience worth money alright keep hop exciting climax happen end want finish reading find anything rave", "genres": ["Fiction & Literature"], "summary": "A mesmerizing tale of a father and daughter’s sailing adventure from Trinidad to the Galapagos Islands, winner of the 2013 OCM Bocas Prize for Caribbean Literature and finalist for the 2014 Orion Book Award\r\n \r\nMonique Roffey, vibrant new voice in Caribbean fiction and author of the Orange Prize finalist The White Woman on the Green Bicycle, returns with Archipelago, a new novel that is a journey of redemption, healing, and hope in the wake of devastating loss.\r\n\r\nWhen a flood destroys Gavin Weald’s home in Trinidad and rips his family apart, life as he knows it will never be the same. A year later he returns to his house and tries to start over, but when the rainy season arrives, his daughter’s nightmares about the torrents make life there unbearable. So father and daughter—and their dog—embark upon a voyage to make peace with the waters. Their journey takes them far from their Caribbean island home, as they sail through archipelagos, encounter the grandeur of the sea, and meet with the challenges and surprises of the natural world.\r\n\r\n“The challenge the author sets up is a big one: How to show that this ruined family could ever recover. And Ms. Roffey, who won the OCM Bocas Prize for Caribbean Literature for this novel, gracefully delivers on this front. Every wonder our sailors encounter — an octopus, a giant tortoise — brings a sense of believable peace.” The New York Times", "asin": "0143122568", "rank": "1117258", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/51mqfVRqDqL.jpg", "country": "Galápagos Islands", "story_arc": ["Tragedy", "Things only get worse"]}