{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 2993, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "Predictable and anticlimactic. Good, intriguing start with an underwhelming ending."}, {"review_sentiment": 2.0, "review_text": "spoiler alert!!!!!!!!!!!!!!!!!!!!!!!!i am confused. i enjoyed every page (despite the horrible quality of the ebook version) for the two thirds of the book. however by the end, it became obvious that i would be let down. i did not know there was a series called \"dublin murder squad\", i thought this was a stand alone book. but nooo. the two intertwining stories turn out to be not related, at all. and this was the only reason that kept me staying awake and read for 4 nights. ryan's case drew my interest more than katy's. but the seemingly primal story is just a bait. a false lead going nowhere! katy's case and her story on the other hand is clear as day from the moment the family is introduced. the culprit is outhere under the pointing neon arrows. so why the fork i read the rest? to find out about the three children, what happened 20 years ago, what is the connection between the two cases. so if you want answers, beware, there is none.. i feel manipulated and cheated. the bread crumbs were placed just to lure the reader to the squals then?ms french has a strong voice, very rich and enjoyable presentation.she has a dark sense of humor and the book \"flows\". but i felt like she took the reader for a fool while contructing this book, yes she befools us in many ways: about the suspects, about the main characters (sloppy build of character-often contradicting within themselves), about the so-called parallel stories and about the ending.shame on you!"}, {"review_sentiment": 5.0, "review_text": "Wow,  My second read by Harlan. This guy can spin a story. Not my preferred genre, but if I'm going to read murder mysteries, he's my guy. Griping from first page to the last. Just read this book!!!"}, {"review_sentiment": 5.0, "review_text": "I️ just absolutely love Tana French’s writing.  The character development and intricacies of their relationships draw me in every time.  And she can plot twist like no other.  It’s not just about “who done it”.  I️ genuinely enjoy the journey to the big reveal and am always left wanting more."}, {"review_sentiment": 3.0, "review_text": "It was ok.  Hard to get through.  I would have liked more suspense and less back and forth.  Maybe the second book will be better."}, {"review_sentiment": 3.0, "review_text": "I sit here trying to figure out how to review this book without giving away too many details about the story.  It is very difficult to discuss the good and the bad without spoiling it for other readers.  I will try to keep my review to the main points that influenced my rating the most.So first off I listened to this book as an unabridged Audible book and it clocks in at over 20 hours. The first problem is at about 60% of the way through the book – it all clicks on the mystery and you realize “Aw Hell” there is still like 40% of the book left.  The story basically starts slowing down to almost actual time and it just drags on and on.The characters of Rob, Cassie and Sam have great chemistry and I did like their interactions and the team dynamic throughout the mystery.  Rob and Cassie have a great ease about their relationship that is genuine and built on a strong past. The story is told from Rob’s point of view but I would have liked to hear the other two’s thoughts and observations. Rob as a main character is very intriguing and you are instantly drawn into his world but he is not that likable of guy.I never really got a sense of geography or layout of spaces from the author but I got a great sense of what people look like and their expressions.  The narrator Stephen Crossley did a fine job with the book and really gave a voice to the characters to match the authors great descriptions."}, {"review_sentiment": 3.0, "review_text": "Honestly I found it hard to get into, the main character unlikable, and the big mystery was never answered. Wouldn't recommend."}, {"review_sentiment": 5.0, "review_text": "As a fan of John sandford books, this book does a great job of holding interest till, and through, the end."}, {"review_sentiment": 3.0, "review_text": "Tangential stories that really don't contribute to the main plot. Because of all the filler, the story took a while to pick up. Decent read but not an all time great."}, {"review_sentiment": 4.0, "review_text": "Quite readable though writing style was not the best, held the mystery till the end. Was a big help in reducing the boredom of flying for 17 hours over the Pacific."}]}, "authors": ["Tana French"], "isbn": "0143113496", "longitude": -6.2602732, "periods": ["1900s", "2000s", "Recent Releases"], "title": "In the Woods: A Novel", "word_cloud": "predictable anticlimactic intrigue start underwhelming end spoiler alert confuse enjoy page horrible quality book version third however end become obvious series call dublin murder squad think alone noon intertwine story turn related reason keep stay awake night ryan case draw interest katy seemingly primal story bait false lead go nowhere case story hand clear day moment family introduce culprit out here point neon arrow fork rest find child happen year ago connection case want answer beware feel manipulate cheat bread crumb place lure squeal ms french strong voice rich enjoyable dark sense humor flow felt take fool construct befoul many way suspect main character sloppy build contradict parallel story second guy story not preferred genre go murder mystery guy grip first last absolutely write character development intricacy relationships time plot twist do genuinely journey big reveal always leave want get suspense le back forth second better sit try figure review give away many detail story difficult discus good bad spoil reader try review main point influence rating first listen unabridged audible clock hour first problem way click mystery still leave story basically start slow almost actual time drag character great chemistry like interaction team dynamic mystery great ease relationship genuine build strong story tell point view like thought observation main character intrigue instantly draw world likable never really get sense geography layout space author get great sense people look expression narrator fine job really give voice character match author great description honestly find hard main character unlikable big mystery never answer fan sand ford great job hold interest till end tangential story really contribute main plot filler story take pick time great readable write style best hold mystery till end big help reduce boredom fly hour", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 1/5 in the Dublin Murder Squad Series\r\n\r\nThe bestselling debut with over a million copies sold that launched Tana French, “required reading for anyone who appreciates tough, unflinching intelligence and ingenious plotting” (The New York Times), who is “the most interesting, most important crime novelist to emerge in the past 10 years” (The Washington Post)\r\n\r\nLook out for Tana French’s newest novel, The Trespasser, available now\r\n\r\nAs dusk approaches a small Dublin suburb in the summer of 1984, mothers begin to call their children home. But on this warm evening, three children do not return from the dark and silent woods. When the police arrive, they find only one of the children gripping a tree trunk in terror, wearing blood-filled sneakers, and unable to recall a single detail of the previous hours.\r\nTwenty years later, the found boy, Rob Ryan, is a detective on the Dublin Murder Squad and keeps his past a secret. But when a twelve-year-old girl is found murdered in the same woods, he and Detective Cassie Maddox—his partner and closest friend—find themselves investigating a case chillingly similar to the previous unsolved mystery. Now, with only snippets of long-buried memories to guide him, Ryan has the chance to uncover both the mystery of the case before him and that of his own shadowy past.\r\n\r\nRichly atmospheric and stunning in its complexity, In the Woods is utterly convincing and surprising to the end.", "asin": "0143113496", "rank": "5063", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51VBtIu7KEL.jpg", "country": "Ireland", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}