{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 979, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Great wonderful book that is worth the read"}, {"review_sentiment": 5.0, "review_text": "This is my third read through this book, and it just keeps getting better. The characters and stories are all relatable in some ways, and confounding in others. The breadth of experiences described in these stories means that at any point, some are directly relevant in my life, and others I can hardly imagine ever being true for anyone, even though I know they are. I first read this book in my early teens, and will probably read it again in a few years. I keep finding new gems in it, that I didn't have the experience to understand on the previous read."}, {"review_sentiment": 3.0, "review_text": "I laughed, I cried, but I think this book left me with more questions than answers.I found the stories a little hard to follow. This character did what in the past? Her mother was the one who did what again? I felt as though there were many stories that just didn't quite finish. Maybe it's meant to be that way.I enjoyed the book, I just don't quite know what you make of it. I guess I'll have to read other reviews, criticisms, and analyses. Oh, the fun of teaching English!Moe to come later. I will edit when I have time."}, {"review_sentiment": 1.0, "review_text": "The dialogue and descriptions are lacking and the theme lame."}, {"review_sentiment": 5.0, "review_text": "Culture and family history are something that could unite this whole world, and bring peace, if we let it. Read this and remember your family, and where you came from."}, {"review_sentiment": 4.0, "review_text": "The style is really artistic, making it a page turner, the stories are enthralling and touching. I would have enjoyed more connections between the narrative styles but, I still highly recommend it."}, {"review_sentiment": 5.0, "review_text": "Good book!"}, {"review_sentiment": 5.0, "review_text": "Lovely book for any audience in any stage of life. Will read again and again as I read through it in haste the first time around."}, {"review_sentiment": 5.0, "review_text": "have been wanting to read this novel as far as i can remember but have not done it for some reason. but now i have and it never failed my expectations. i am not Chinese but a Filipino. but since a lot of Chinese culture has influenced and has become a huge part of the Filipino culture and traditions that have evolved from centuries ago of Chinese, Spanish, and American influences, i must say that through Amy Tan's novel, i am proud to rediscover my own unique identity. this novel is enlightening, sensitive, and yet entertaining. an awesome read!"}, {"review_sentiment": 5.0, "review_text": "A magnificent tapestry of deeper meanings woven into a masterpiece that cleverly draws you into the hearts of these Chinese people."}]}, "authors": ["Amy Tan"], "isbn": "0143038095", "longitude": -122.4192363, "periods": ["1900s"], "title": "The Joy Luck Club: A Novel", "word_cloud": "wonderful worth third keep get better character story repeatable way confound others breadth experience describe story mean point directly relevant life others hardly imagine ever true anyone even know first early teens probably year keep find new gem experience understand previous laugh cry think left question find story little hard follow character mother felt many story quite finish mean enjoy quite know make guess review criticism analysis fun teach come later edit time dialogue description lack theme lame culture family history something whole world bring peace let family come style really artistic making page turner story enthral touch connection narrative style still highly good lovely audience stage life haste first time want far do reason never fail expectation lot chinese culture influence become huge part culture tradition evolve century chinese spanish american influence proud rediscover unique identity enlighten sensitive yet entertain awesome magnificent tapestry deeper meaning woven masterpiece cleverly draw heart chinese people", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "For readers of Amy Tan's bestselling novel, The Valley of Amazement, revisit her classic tale of mothers and daughters\r\n\r\nFour mothers, four daughters, four families whose histories shift with the four winds depending on who's \"saying\" the stories. In 1949 four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared unspeakable loss and hope, they call themselves the Joy Luck Club. Rather than sink into tragedy, they choose to gather to raise their spirits and money. \"To despair was to wish back for something already lost. Or to prolong what was already unbearable.\" Forty years later the stories and history continue.\r\n \r\nWith wit and sensitivity, Amy Tan examines the sometimes painful, often tender, and always deep connection between mothers and daughters. As each woman reveals her secrets, trying to unravel the truth about her life, the strings become more tangled, more entwined. Mothers boast or despair over daughters, and daughters roll their eyes even as they feel the inextricable tightening of their matriarchal ties. Tan is an astute storyteller, enticing readers to immerse themselves into these lives of complexity and mystery.", "asin": "0143038095", "rank": "6104", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/512G5WB1r5L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}