{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 254, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Loved this book, very interesting"}, {"review_sentiment": 3.0, "review_text": "Hong Kong is as much a character in this book as the Piano Teacher. The story is told through two points of view and set in two different time periods. We begin with Claire, a newly married British woman who has moved with her dependable, unexciting husband to Hong Kong where he is working as an engineer on water projects. Their income is modest, and Claire is bored, so she takes a job teaching piano to the daughter of a prominent wealthy Chinese family in Hong Kong. Claire is not a trained teacher and the young student is unmotivated. Through teaching, Claire’s path crosses with Will Truesdale, the underemployed and unexpected British driver for the same Chinese family. It is Will who provides the second and more interesting point of view. Will’s story alternates between two time periods. The first time is immediately before and during the Japanese occupation of Hong Kong during World War II. The second time is in the early 1950s after Claire’s arrival. Ms. Lee tells an interesting story about Hong Kong and the complexities of its mixtures of cultures, nationalities, social structures, and politics. The Japanese occupation of Hong Kong was brutal, hard, and surreal with the contrast between those imprisoned, the occupiers, the tortured, and the opportunists. Before the occupation, Will was in love with Trudy, a glamourous, scandalous, and unreliable Amerasian woman. This relationship between Will and Trudy is built up to be a great love story, but it always seemed unhealthy to me. During the occupation, Will is imprisoned and Trudy remains in the city. With her shady relatives, she is collaborating with the enemy for profit and for survival. Trudy is missing after the occupation and presumed dead. Will is physically and emotionally crippled by his war experiences. Claire’s portion of the story is set only in the 1950s. She undermines her stable but unsatisfying married life with petty thefts and a less than secret affair with Will. Postwar Hong Kong is still slightly unsettled as its complex society is becoming reestablished. The war is over, but it is not forgotten as the bill comes due for collaborators. There are many interesting historical factors to the story. Somehow, I failed to become very attached to Claire or Will. Perhaps that was a consequence of the multiple points of view and time periods or perhaps it was because that they did not seem to care much about what happened to themselves. This is not a sweeping romantic story of true love or even great passion. Some reviewers have compared the book to the English Patient, but the comparison does not work for me."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this probably more so as Hong Kong holds a special place in my heart. A powerful love story set in Hong Kong during the second World War, an interesting portrayal of life in Hong Kong during that unsettling period. The story of Will and Trudy's love during the war years was the part of the novel I enjoyed the most. It is a much stronger narrative than the part about Claire, the Piano Teacher of the title. This novel will probably appeal to those interested in not only a moving love story but also Hong Kong."}, {"review_sentiment": 5.0, "review_text": "The book club loved it"}, {"review_sentiment": 5.0, "review_text": "You are about to relate to the main characters when you read this book. Hong Kong is fascinating anyway with its history and mix of people that live there. The period the book is written in was also life changing. Humans deal with disaster in so many different ways so they can deal with life around them. I enjoyed it very much."}, {"review_sentiment": 5.0, "review_text": "This is one of my favorite books of all time....I generally always have a novel goin but this one I actually go back & re-read my favorite parts"}, {"review_sentiment": 4.0, "review_text": "At first I had a little difficulty following the various characters, but at some point it became clear who was who.  In looking back on the story now that I've finished it, I realize that I really liked this book and the story."}, {"review_sentiment": 4.0, "review_text": "It is not true, but I cannot help imagining this novel being inspired by “Breakfast at Tiffany’s” by Truman Capote, and certainly, if Audrey Hepburn were alive and in her prime, she would be the perfect actress to play Trudy Liang – assuming makeup could present her as Eurasian.  “The Piano Teacher” is  a broader, more complex novel  wherein Hong Kong and its history before, during and after WWII is very important.  It is an engrossing read, despite some flaws. While Trudy is a terrific character, the novel falls short with Claire.  There is meant to be a tension between the narrow minded, passive aspect of her character and the woman who wants to experience life more fully, with a taste for the exotic and the sophisticated.  It would have been better if the prudishness of her mother and its influence had been less emphasized, and it might have been better that her mother conveyed an interest in books as well as piano.  Ultimately Will declares that one basis for his attraction to Claire was her “purity” when he met her, which is entirely the wrong word, it should have been “innocence”. If the beginning of the novel was a little slow because of the problems with Claire, the last section is overdone.  I enjoyed the jumping back and forth in time, but it is carried too far in the last section: Claire has lunch with Edwina, and then the lunch is revisited later, not from a different point of view, but apparently because Lee wanted to delay the reader’s knowledge of what Edwina had to say about Trudy’s fate.  SPOILER.  Is it reasonable that Edwina would acknowledge her deplorable role in Trudy’s fate, even if she could manage to justify it to herself?  In one scene Victor is using Trudy to ingratiate himself with Otsubo, and then Victor gets deadly jealous of her influence, whereas she herself, more realistically, felt her influence waning."}, {"review_sentiment": 5.0, "review_text": "This novel made me check the history of the British Empire as I asked why the ---- were the English in Hong Kong anyway. Excellent examples of \"might makes right.\"( Ironically, we are seeing a great object lesson of mega-dismissal in our upcoming political state. ) The \"Crown Collection - like the Elgin Marbles have no more \"right\" to be  in British possession than any other artifact created any other country/continent in the world. I worked in an African colony for two years; I know well the \"us-them\" mentality. Novel character, Victor,really did say it best,\"The bloody British on their moral high horse while they poison half of China with opium, for their own gain.\""}, {"review_sentiment": 5.0, "review_text": "Arrived as promised, good condition."}]}, "authors": ["Janice Y. K. Lee"], "isbn": "0143116533", "longitude": 114.1628131, "periods": ["1900s", "Recent Releases"], "title": "The Piano Teacher: A Novel", "word_cloud": "love interesting much character story tell point view set different time period begin newly marry british woman move dependable unexciting husband work engineer water project their income modest bore take job teach daughter prominent wealthy chinese family train teacher young student unmotivated teach path cross underemployed unexpected british driver family provide second interesting point view story alternate time period first time immediately japanese occupation second time early arrival tell interesting story complexity mixtures culture nationality social structure politics japanese occupation brutal hard surreal contrast imprison occupier tortured opportunist occupation glamorous scandalous unreliable amerasian woman relationship build great love story always seem unhealthy occupation imprison remain city shady relative collaborate enemy profit survival miss occupation presume dead physically emotionally cripple war experience portion story set undermines stable unsatisfying married life petty theft le secret affair still slightly unsettled complex society become reestablish war forgotten bill come due collaborator many interesting historical factor story fail attached perhaps consequence multiple point view time period perhaps seem much happen sweeping romantic story true even great passion reviewer compare english comparison work enjoy probably hold special place heart powerful love story set second interest portrayal life unsettling period story war year part enjoy much stronger narrative part title probably appeal interested move love story also club love relate main character fascinate anyway history mix people live period write also life change human deal disaster many different way life enjoy much favorite time generally always goon actually go back favorite part first little difficulty follow various character point become clear look back story finish realize really like story true help imagine inspire certainly alive prime actress play assume makeup eurasian broader complex wherein history important engross flaw terrific character fall short meant tension narrow mind passive aspect character woman want experience life fully taste exotic sophisticate prudishness mother influence le emphasized mother conveyed interest well ultimately declare basis attraction purity meet entirely wrong word innocence begin little slow problem last section overdone enjoy jump back forth time carry far last section lunch lunch revisit later different point view apparently want delay knowledge say fate reasonable deplorable role fate even scene use ingratiate get deadly jealous influence whereas realistically felt influence waning make history british ask english anyway example make right see great object lesson upcoming political state right british possession artifact create world work african colony year know well mentality character really say best bloody british moral high horse poison half opium gain promise good condition", "genres": ["Fiction & Literature", "Romance", "Historical Fiction", "WWII", "Women's Fiction"], "summary": "The New York Times bestseller \r\n\r\nIn the sweeping tradition of The English Patient, Janice Y.K. Lee's debut novel is a tale of love and betrayal set in war-torn Hong Kong. In 1942, Englishman Will Truesdale falls headlong into a passionate relationship with Trudy Liang, a beautiful Eurasian socialite. But their affair is soon threatened by the invasion of the Japanese as World War II overwhelms their part of the world. \r\n\r\nTen years later, Claire Pendleton comes to Hong Kong to work as a piano teacher and also begins a fateful affair. As the threads of this spellbinding novel intertwine, impossible choices emerge-between love and safety, courage and survival, the present, and above all, the past.\r\n\r\n\"A rare and exquisite story . . . Transports you out of time, out of place, into a world you can feel on your very skin.\" Elizabeth Gilbert", "asin": "0143116533", "rank": "482568", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/51ESF4nXp7L.jpg", "country": "China", "story_arc": ["Tragedy", "Things only get worse"]}