{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1537, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "I do not recommend. Written like a bad inventory list.“Where will he sleep? What’s he going to eat? Are there any girls for him?”Car - road - man - girls (some of them underaged)- money ... & repeat."}, {"review_sentiment": 5.0, "review_text": "It's a classic, worth reading!"}, {"review_sentiment": 5.0, "review_text": "As a lifelong nomad, I've read this novel about 5 times. As I find myself living \"on the road\" as we speak, it is time to revisit this timeless classic."}, {"review_sentiment": 5.0, "review_text": "My grand daughter has been wanting to read it and enjoyed it very much."}, {"review_sentiment": 5.0, "review_text": "Just as expected. Wonderfully careful packaging. Great seller! Thanks!"}, {"review_sentiment": 1.0, "review_text": "After seeing so many references to On the Road, I thought I'd read it myself. It took me FOREVER to get through. I just didn't get the point. Granted, Kerouac is a master at writing beautiful descriptions but there's got to be a plot! Many times I debated bailing out and not finishing the story but I kept thinking something major was going to happen (spoiler alert) IT DOESN'T!  I will say that one thing that I learned is a better understanding of a young man I know who is always ON THE ROAD. He's a homeless young man who just likes to travel."}, {"review_sentiment": 1.0, "review_text": "Boring, don't understand how anyone would enjoy reading this"}, {"review_sentiment": 5.0, "review_text": "The One!  This is the way Jack intended us to read the book, and it is SO much more rewarding that the 1957 published version, which I have read many times."}, {"review_sentiment": 3.0, "review_text": "If he was looking for something, I'm not sure he found it: which may be the point."}, {"review_sentiment": 3.0, "review_text": "Strange story of some lost souls"}]}, "authors": ["Jack Kerouac"], "isbn": "0143105469", "longitude": 0.0, "periods": null, "title": "On the Road: The Original Scroll", "word_cloud": "recommend bad inventory go eat girl road man girl underage money repeat classic worth reading lifelong nomad time find live road speak time revisit timeless classic grand daughter want enjoy much just expect wonderfully careful packaging seller thanks see many reference think take get point grant master write beautiful description get plot many time debate bail finish story keep think something major go happen spoiler say thing learn better understanding young man know always homeless young man like travel understand anyone read way intend so much rewarding publish version many time look something sure find story lose soul", "genres": ["Fiction & Literature", "Travel Writing"], "summary": "The classic novel of freedom and the search for authenticity that defined a generation\r\n\r\nInspired by Jack Kerouac's adventures with Neal Cassady, On the Road tells the story of two friends whose cross-country road trips are a quest for meaning and true experience. Written with a mixture of sad-eyed naivete and wild ambition and imbued with Kerouac's love of America, his compassion for humanity, and his sense of language as jazz, On the Road is the quintessential American vision of freedom and hope, a book that changed American literature and changed anyone who has ever picked it up.   \r\n\r\n\"An authentic work of art . . . the most beautifully executed, the clearest and the most important utterance yet made by the generation Kerouac himself named years ago as 'beat,' and whose principal avatar he is.\" The New York Times \r\n\r\n", "asin": "0143105469", "rank": "20229", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51LitoUcEaL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}