{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 39, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "The book came in good condition. It's for my son."}, {"review_sentiment": 5.0, "review_text": "This book I got for my daughter.  She needed it for her English class and she loved it.  The author did a wonderful job.  Deserves five stars."}, {"review_sentiment": 5.0, "review_text": "This is a fantastic novel. It's hilarious and heartbreaking, and yes, as others have pointed out, full of foul language and furious emotion. That's a good thing! This novel is about what it's like to feel pulled by two different cultures, and how we find home--with our families? Inside ourselves? It's also a coming of age story with a frank and very real point of view about how the protagonist begins to have a sexual awakening. It's great. Read it, unless you are squirmish about foul language and real prtrayals of women's sexuality, in which case stick to Anne of Green Gables or whatever."}, {"review_sentiment": 2.0, "review_text": "Interesting novel about the coming of age of a Palestinian American young lady, set in the Middle East of the 90s and then in Texas. A lot of gratuitous pseudo porn and crude language though."}, {"review_sentiment": 1.0, "review_text": "Horrible! I was so excited that there was a book that I could finally relate to being Arab American. The language was crude and the writing was terrible. I suggested this book for our book club and got an earful."}, {"review_sentiment": 4.0, "review_text": "A light and entertaining read about the coming of age of Nidali."}, {"review_sentiment": 5.0, "review_text": "It takes a while for the plot to take off, but the author keeps you interested in the characters and the life she's living in the mean time. Its a coming of age story and has some scenes and references that could make the reader blush. I had to read this for a gender studies class and it was by far my favorite book from that class."}, {"review_sentiment": 3.0, "review_text": "Randa Jarrar's coming of age novel, A Map of Home, has some interesting elements but is ultimately unspectacular.  Like many first novels, this is very autobiographical with the central character, Nidali, being. like Jarrar, a Palestinian-American born in the U.S. but having a childhood in Kuwait and Egypt before moving back to the U.S. as a teenager.Because Jarrar had an interesting life, there are sections of the book that reflect that.  Her family's flight across Iraq after that country occupied Kuwait was a thrilling ride and their inability to go home afterwards because of the pro-Iraq stance of Palestinian leaders was touchingly done.However, one gets the impression that Jarrar simply took the happenstance events of her own life and fictionalized them without the additional focus that a novel requires.The relationship with, Esam, the fundamentalist cousin is a missed opportunity and an example.  This could've have been a very intriguing conflict between a westernized adolescent and an indoctrinated jihadi wannabe but it becomes a relatively unconnected incident with a character who remains undeveloped.  The story of Nidali's name, a boy's name from a father whose hopes for a son led him to prematurely name her with a boy's name, Nidal, which was them feminized with an \"i\" after he realized that he'd jumped the gun, is an example of cutesy touch that doesn't really go anywhere.  The sections on her discovering sexuality and her teenage romance with Fakhr seem like typical YA fare.Indeed, much of the novel is like that the above;  Jarrar certainly has personality but I think this would have been more engaging as a memoir rather than a novel."}, {"review_sentiment": 1.0, "review_text": "This woman is sick and bitter and ethnocentric as a nazi."}, {"review_sentiment": 5.0, "review_text": "I like it. Nidali is a really unique girl. I just want to follow her story all the way through"}]}, "authors": ["Randa Jarrar"], "isbn": "0143116266", "longitude": 31.243666, "periods": ["1900s", "Recent Releases"], "title": "A Map of Home", "word_cloud": "come good condition son get daughter need english class love author wonderful job star fantastic hilarious heartbreaking yes others point full foul language furious emotion good thing like feel pull different culture find family also come age story frank real point view protagonist begin sexual awaken great skirmish foul language real portrayal woman sexuality case stick interest come age palestinian young lady set lot gratuitous pseudo porn crude language horrible excite finally arab language crude write terrible suggest club get earful light entertain coming age take plot author keep interested character life live mean time coming age story scene reference blush gender study class far favorite class come age interesting element ultimately unspectacular many first novel autobiographical central character bear childhood move back interest life section reflect family flight country occupy thrill ride inability go afterwards stance palestinian leader touchingly get impression simply take happenstance event life fictionalize additional focus relationship fundamentalist cousin miss opportunity example conflict westernize adolescent indoctrinate jihad wannabe become relatively unconnected incident character remain undeveloped story name boy name father hope son lead prematurely name boy name feminize realize jump gun example cutesy touch really anywhere section discover sexuality teenage romance seem typical much certainly personality think engage rather woman sick bitter ethnocentric nazi like really unique girl want follow story way", "genres": ["Fiction & Literature", "Historical Fiction", "Women's Fiction"], "summary": "From America to the Middle East and back again— the sparkling story of one girl’s childhood, by an exciting new voice in literary fiction\r\n\r\nIn this fresh, funny, and fearless debut novel, Randa Jarrar chronicles the coming-of-age of Nidali, one of the most unique and irrepressible narrators in contemporary fiction. Born in 1970s Boston to an Egyptian-Greek mother and a Palestinian father, the rebellious Nidali—whose name is a feminization of the word “struggle”—soon moves to a very different life in Kuwait. There the family leads a mildly eccentric middle-class existence until the Iraqi invasion drives them first to Egypt and then to Texas. This critically acclaimed debut novel is set to capture the hearts of everyone who has ever wondered what their own map of home might look like.\r\n\r\nRead Randa Jarrar's posts on the Penguin Blog.", "asin": "0143116266", "rank": "211386", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/518e2%2BbThFL.jpg", "country": "Egypt", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}