{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 59.9132694, "ratings": {"num_ratings": 70, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "recommended, close to your heart beat, organic...a classic among classics."}, {"review_sentiment": 5.0, "review_text": "You really get to know these people. You become one of them. Excellent book. The style is not dated despite its vintage and setting."}, {"review_sentiment": 4.0, "review_text": "Simply good historical fiction, placing me in Norway in the 19th century. Characters were real and developed and evolved as did the environment. Gave me a good background for other reading prior to traveling to Norway. It also gives one insight into the mind of someone who was otherwise reviled as a Nazi sympathizer but obviously had depth of character."}, {"review_sentiment": 5.0, "review_text": "Great epic novel."}, {"review_sentiment": 5.0, "review_text": "At least one other reviewer has noted that this great story helped Dire Straits guitarist Mark Knopfler craft the stirring “Telegraph Road” from their album “Love Over Gold.” That song has been part of the soundtrack for my life for 34 years. “Growth of the Soil” has been part of the literature of my life for nearly as long. The language plain but deep, time moving only as fast or slow as the seasons will allow. The thoughts and experiences of an entirely ordinary life rendered extraordinary by real attention to what it is to live, breathe, work, love, struggle, enjoy and on and on. To sit it back on the shelf, look around and survey the long arc of your own life. Then comes the evening."}, {"review_sentiment": 5.0, "review_text": "What a lovely story of the NATURE of life!  The cadence gives body to the place and people of Lapland, Norway and Sweden: a beautiful, timeless and truthful perspective of existence and experience."}, {"review_sentiment": 5.0, "review_text": "Spoiler alert!!!Only near the end could I tell through Giessler's small rant, that the main theme was not only about the fruits of relentless hard work, both in character development and in wealth, but that the story is also in a larger sense about the clash of the agrarian lifestyle and the modern lifestyle, and how Hamsun (through Geissler) believed that it's a dead-end path, when we hurry up and rush so much, toward industrialization and greater wealth; the contrast being clearest between the on-and-off operations at the mine that caused the homesteaders to enjoy great prosperity, which was followed by a crash and then poverty, contrasted with the slow and very steady development and maintenance of Isak's and Inger's homestead. And one thing that I loved about this is that while brute force is certainly a vital part of it, the whole homestead is really a product of Isak's mind! He loved keeping Inger in the dark about what he was up to, as he'd build one new building after another hahaha. But really, even though he could carry huge loads on his back, along a backcountry road that he himself created, it was his mind that really built their life :) he wasn't \"smart\" by modern standards, but even in his brutishness and simplicity of mind, there was a kind of slow and steady genius. :)"}, {"review_sentiment": 5.0, "review_text": "My wife has  been heckling me to read Growth of the Soil for 40 years.  I finally gave in,  and as with so many other things,  I should have listened to her to begin with.This is an amazing book.  Told in a magisterial, enchanting third person, the tone lifted from the Northern sagas,  Hamsun tells the tale of Isak and his hare lipped wife Inger,  who tame the northern Norwegian wilderness.  With their children, Sivert, Eleseus,  Leopoldine and Rebecca they tear a life out of the rocks and trees of Norway above the Arctic circle.  Others gather and settle along the path between them and the village,  and we watch as the land is tamed and as the Sellarna family becomes more and more prosperous.  This is not a sentimental tale and there is no condescension.  Just real feeling for his characters.  The conclusion of the book is as dignified and graceful as anything I have ever read.  Hamsun is  deft at describing the life of the unlearned.  The pitch there is perfect.An added benefit of reading Hamsun:  it gives you some context for reading the other great Scandinavian writers: you can see Hamsun's influence on Halldor Laxness,  certainly in his masterpiece,  Independent People.  And now I understand a bit more of where Karl Ove Knaussgaard is coming from.  Of course,  all of these writers' sensibilities are shaped by their growing up and reckoning with the harsh but beautiful environment that nourishes them and tries to kill them at the same time.Caution:  It was difficult for me to get by Hamsun's shameful support for Hitler.  It may be for you as well.  Better to read the book as an artifact of the time in which it was written: 1917.  The man of the 1940s  could not have been the writer of this humanistic masterpiece,  even if the seeds of his prejudices can be glimpsed in the narrative."}, {"review_sentiment": 5.0, "review_text": "I must confess that I bought this book because I was drawn to the title and the cover, ( yes, I sometimes judge a book by its cover and amazingly and luckily, most of them have turned out great.) and the more I read it, the more I was impressed and amazed by the beauty of the writing and the depth of the story. With the underlying biblical tone of the Man, the Nature and the labor, the story begins with Isak--the first Man-- walking on the path and \"the no-man's land owned by no one, came into being.\"  This is only the first page!!! And the story--over 300 pages-- never stops being marvelous, subtle, insightful.  The characters represent different relationships with the nature, labor, and life.  Toward the end, through the long speech by Geissler, the author talks about plow vs. dice, courage vs. fear, tiller vs. gambler, and the responses from the nature, \"The problem is they refuse to keep pace with life, wanting to go faster, they are in a rush, breaking into life like wedges... And so life crushes them politely, but firmly.  then begin the complaints about life, the rage against life! Everyone to his liking\", For a life time city dweller like me, there is grave understanding and humility in the end toward the nature and what it means to be a dot in the universe. \"The world is wide, swarming with tiny dots, Inger has swarmed with the rest.  She was next to nothing among the living, only one.\"  This is an amazing book."}, {"review_sentiment": 4.0, "review_text": "One of the other reviews used something like \"written with Olympian disdain\"...which isn't far of the mark.  And yet - the reader comes to know and inhabit the characters.  Maybe that's the great feat here - the writer provides the arbor for the reader to grow the characters - I know these people...I am these people.....  While different in style and subject than most anything I've read I found it wonderfully engaging."}]}, "authors": ["Knut Hamsun"], "isbn": "0143105108", "longitude": 10.7391112, "periods": ["1900s"], "title": "Growth of the Soil", "word_cloud": "recommend close heart beat organic classic classic really know people become excellent style date vintage setting simply good historical fiction place century real develop evolve environment good background read prior travel also give insight mind someone otherwise revile sympathizer obviously depth character epic least reviewer note great story help guitarist craft stir album song part soundtrack life year part literature life nearly long language plain deep time move fast slow season allow thought experience entirely ordinary life render extraordinary real attention live breathe work love struggle enjoy shelf look survey long arc life then come even lovely story life cadence give body place people beautiful timeless truthful perspective existence experience alert only near end small rant main theme fruit relentless hard work character development wealth story also larger sense clash agrarian lifestyle modern lifestyle believe path hurry rush much industrialization greater wealth contrast clearest operation mine cause homesteader enjoy great prosperity follow crash poverty contrast slow steady development maintenance homestead thing love brute force certainly vital part whole homestead really product mind love keep dark new build hahaha really even huge load back back country road create mind really built life smart modern standard even brutishness simplicity mind kind slow steady genius wife heckle year finally give many thing listen begin amaze magisterial enchant third person tone lift saga tell tale hare lipped wife tame northern norwegian wilderness child tear life rock tree circle gather path village watch land tame family become prosperous sentimental tale condescension real feeling character conclusion dignify graceful anything ever deft describe life unlearn pitch add benefit reading give context reading great scandinavian writer see influence certainly masterpiece independent understand bit come course writer sensibility shape grow reckon harsh beautiful environment nourishes try kill difficult shameful support well artifact time write man humanistic masterpiece even seed prejudice glimpse narrative buy draw title cover yes sometimes judge cover amazingly luckily turn great impress amazed beauty write depth story underlying biblical tone labor story begin first walk path land own come first page story page never stop marvelous subtle insightful character represent different relationship nature labor life end long speech author talk plow dice courage fear tiller gambler responses nature problem refuse pace life want go faster rush break life wedge life crush politely firmly complaint life rage life liking life time city dweller grave understand humility end nature mean dot world wide swarm tiny dot swarm rest next nothing live amazing review use something write disdain far mark yet come know inhabit character maybe great feat writer provide arbor grow character know people people different style subject anything find wonderfully engage", "genres": ["Fiction & Literature"], "summary": "The epic novel of man and nature that won its author the Nobel Prize in Literature-the first new English translation since the novel's original publication ninety years ago \r\n\r\nWhen it was first published in 1917, Growth of the Soil was immediately recognized as a masterpiece. Ninety years later it remains a transporting literary experience. In the story of Isak, who leaves his village to clear a homestead and raise a family amid the untilled tracts of the Norwegian back country, Knut Hamsun evokes the elemental bond between humans and the land. \r\n\r\nNewly translated by the acclaimed Hamsun scholar Sverre Lyngstad, Hamsun's novel is a work of preternatural calm, stern beauty, and biblical power-and the crowning achievement of one of the greatest writers of the twentieth century.\r\n\r\n", "asin": "0143105108", "rank": "236978", "city": "Oslo", "image": "https://images-na.ssl-images-amazon.com/images/I/518uX5B-%2BBL.jpg", "country": "Norway", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}