{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 36.600256, "ratings": {"num_ratings": 164, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "A sequel to Steinbeck’s beloved Cannery Row this novel reprises a favored haunt of the author—with many of its old-friends denizens. Familiar landmarks also appear in post-war, tattered glory: the Palace Flophouse, Lee Chong’s Grocery store (under new management), the Bear Flag “establishment” and Doc’s messy but beloved Western Biological Laboratory.  Despite hard times and some painful memories the residents welcome Doc’s return home but gradually realize that something is wrong with their genial friend.  Things begin to pop at the arrival of peppy but down-at-heels Suzy; the sheriff sizes her up right quick, but the new kid in town is lucky to get a job at all—thanks to Fauna, the street-smart Madam.  Once again it is a case of “the best-laid plans of mice and men” which unfold with characteristic setbacks and misreading of non-verbal clues. Feelings are tromped on while schemes are hatched; mostly with an eye to making Doc feel happy again and helping him write his scientific paper on octopi. But how can he visit the tide pools of La Jolla at the right tide while nursing a broken arm?  Readable and entertaining this study in what friends will do for friends proves vintage Steinbeck—including an explanation for why he bowed to some previous literary criticism; comic relief is also provided by references to local history, which bear no relation to plot advancement. Readers may expect a veritable parade of whack-job characters, as “the boys” and the Madam finagle to get Doc what they feel he needs most."}, {"review_sentiment": 3.0, "review_text": "Not his best work I don’t think but it was ok"}, {"review_sentiment": 4.0, "review_text": "Steinbeck could almost have called this postwar novel CANNERY ROW REVISITED.  Not as good as the first novel, nor is the Rodgers & Hammerstein musical based on it one of their best, but both have their moments.  It is highly advisable to read CANNERY ROW first."}, {"review_sentiment": 5.0, "review_text": "Brand new. Fast shipping."}, {"review_sentiment": 5.0, "review_text": "great book!!!!!!"}, {"review_sentiment": 5.0, "review_text": "A beautiful character study that both soothed me and entertained me from beginning to end. Steinbeck is a master storyteller who knows just how to portray the everyday lives of humans in compelling ways."}, {"review_sentiment": 4.0, "review_text": "Revisits old friends from \"Cannery Row\""}, {"review_sentiment": 4.0, "review_text": "I liked this better than Cannery Row.  Characters seem more human and loved the storyline of Suzy and Doc"}, {"review_sentiment": 5.0, "review_text": "be careful with it in the sun, not as good as cannery row"}, {"review_sentiment": 5.0, "review_text": "This is one of my favorite authors who never writes a bad book.  It is amusing, interesting, and moves quickly.  I highly recommend this book."}]}, "authors": ["John Steinbeck"], "isbn": "0143039474", "longitude": -121.8946388, "periods": ["1900s"], "title": "Sweet Thursday", "word_cloud": "sequel beloved reprise favor haunt many denizen landmark also appear tattered glory store new management establishment messy beloved western hard time painful memory resident welcome return home gradually something wrong genial friend pop arrival peppy sheriff size right quick new kid town lucky job case plan mice men unfold characteristic setback misread clue tromped scheme hatch mostly eye make happy help write scientific paper octopus visit tide pool right tide nurse broken arm entertaining study friends friends prof vintage explanation bow previous literary criticism comic relief also provide reference local history bear relation plot advancement reader veritable parade character boys finagle get feel need not best work think ok steinbeck almost postwar not good first musical base best moment highly advisable first new shipping great beautiful character study soothe entertain begin end master storyteller know portray everyday live human compel way revisits old friend like better seem human love story line careful sun good cannery row favorite author never write bad amuse interest move quickly highly recommend", "genres": ["Fiction & Literature"], "summary": "In Monterey, on the California coast, Sweet Thursday is what they call the day after Lousy Wednesday, which is one of those days that are just naturally bad. \r\n\r\nReturning to the scene of Cannery Row—the weedy lots and junk heaps and flophouses of Monterey, John Steinbeck once more brings to life the denizens of a netherworld of laughter and tears—from Doc, based on Steinbeck’s lifelong friend Ed Ricketts, to Fauna, new headmistress of the local brothel, to Hazel, a bum whose mother must have wanted a daughter. ", "asin": "0143039474", "rank": "116534", "city": "Monterey", "image": "https://images-na.ssl-images-amazon.com/images/I/51leTYkqqbL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}