{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 87, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 4.0, "review_text": "For some reason I thought that  the book was in reference to Alexander Von Humboldt but I am enjoying the read and the introduction to another Humboldt."}, {"review_sentiment": 5.0, "review_text": "Best book I've read in a long while, even after having read it years ago.  Literature."}, {"review_sentiment": 5.0, "review_text": "There's a Morrissey song called \"We Hate It When Our Friends Become Successful\" and if its possible for the self-indulgent yearnings of a man to reach back and influence a book about the self-indulgent if clueless yearnings of a different man, I'd say we could make a good case, if physics and sheer plausibility didn't get in the way.  However, it does make a halfway decent soundtrack.Saul Bellow has won a number of awards over the years, including three National Book Awards, but this was the only one that netted him a Pulitzer Prize (and apparently led to his selection for the Nobel Prize for Literature later that year) and yet I never felt it got mentioned in the same conversations as books like \"Herzog\" and \"Mr Sammler's Planet\", perhaps because it doesn't have the same power that those books muster.  Years ago on reading \"Mr Sammler's Planet\", I was so affected by it that even if the next thing Bellow wrote was a book telling everyone that I did copious amounts of drugs and beat up small animals I still would have thought it was the best thing I ever read.  Here, the concept seems to be shooting for more humor in the midst of all the philosophical musing, but unfortunately at nearly five hundred pages he doesn't seem to learn that the funniest jokes know when to get out when they've said what they've needed to say.The concept is simple enough for all the rambling . . . Von Humboldt Fleisher is a poet interested in creating capital A Art, while his young literary admirer Charlie Citrine would also like to make Art but winds up writing a famous Broadway play and becomes a rich writer in the process, while Fleisher dies essentially alone and penniless and thus ready to be trumpeted as \"The Best Poet You've Never Read\" in a series of clickbait articles written by people whose daily challenge is to find the most obscure thing possible and convince you why its better than the stuff you like.  Bellow actually uses this relationship (apparently based on a friendship he had with poet Delmore Schwartz) as a springboard for some interesting commentary on the nature of Art and how it reflects society, with neither man really getting what they want, or at least not receiving very satisfactory results.The book starts out promisingly enough, especially as it details the relationship between the younger Citrine and not yet entirely bitter Fleisher.  But the book seems to drift away from that fairly quickly and although every time it dips back in later on it does liven up the proceedings, the basic idea is conveyed very quickly  . . . one got famous and one didn't and the one who didn't get famous got mean.  We don't see Fleischer alive during the course of the novel and while the recounting of his slow descent into becoming a paranoid misanthrope becomes a nice cautionary tale, we're never convinced that the loss of this apparently genius poet is as great a loss to society on the level of a national tragedy.  Sure, Citrine thinks he's good, but don't we all think our friends are pretty good at stuff?If you think the core of this material would have made a good short story, well, that's what Saul Bellow thought as well, but for some reason he expanded it into this.  Unfortunately he forgot to come up with enough story to support all that and instead the bulk of the novel seems obsessed with Citrine being a sap and gradually losing all his money by everyone around him taking advantage of his good nature and bleeding him dry.  He's involved in a divorce so never-ending that the lawyers from \"Bleak House\" would be like \"Geez, give it a rest already\", he's got a low level mobster following him around giving him advice that he never asked for and his new girlfriend appears to view him as a walking dollar sign that sometimes has sex with her.  In the midst of this we get the play of art versus commerce, with Citrine as the battleground.And when the book delves into society's conflict between art that elevates things and our love of watching people hang out at the Jersey Shore and throw up on each other, its illuminating even when it doesn't contribute much to the plot.  But as the story of Citrine's trials and travails, it often feels like someone writing to someone else about what a parody of Philip Roth would look like, with an overstressed and slightly neurotic intellectual protagonist getting in trouble with both his woman and his other woman while engaging in somewhat ridiculous antics, all seeming designed to eventually elicit a \"I stands all I can stands, I can't stands no more\" from our hero.  This is where the length of the book starts to hurt, as Citrine is so passive at times, or at least really dedicated to letting people walk all over him that it starts to border on the absurd, as thing after thing goes wrong  in a way that supposed to be comical but makes you question why he doesn't just fake his own death and start over.  Maybe Bellow and I aren't on the same wavelength when it comes to how darkly funny I'm supposed to find all this or he's really insistent on making sure I get the point.  And maybe it might take me longer than someone with a better literary/philosophical background but I'm pretty sure after five hundred pages I either got it two hundred pages ago or I'm never going to get it.  But in the process he makes his own character look like a total oblivious dope.The backend of the plot deals with the nature of the \"gift\" that Humboldt leaves for his friend (I was hoping it would just be a note that says \"Ha ha\" but this isn't Kurt Vonnegut) and how everyone handles that but the characters seem to treat it as more amazing than it seems to me and the degree to which it resolves issues doesn't make it feel like its grandly coming together as much as \"shoot, we have fifty pages left\".  With mortality on the brain, Bellow does save some of his most eloquent writing for these later sections as the prose dips ever so slightly toward the stream of consciousness style that gave \"Mr Sammler's Planet\" its heft at times.  Its reemergence is welcome but its impact isn't elevated by the weight of the preceding four hundred plus pages beyond a relieved \"its about time\".  Maybe if Citrine wasn't such an obvious sap, maybe if we saw more of the relationship between him and Fleischer, maybe if the conflicts weren't such obvious springboards for musings . . . its difficult to say and I'm the last person qualified to suggest how a Saul Bellow novel can be improved.  And because of that its never bad, with more than enough to say, but having experienced his more intense works I guess I could have used a little more of that intensity and less of a feel that I'm reading the treatment for an extremely erudite sitcom."}, {"review_sentiment": 5.0, "review_text": "Take your time reading.  Really interesting."}, {"review_sentiment": 5.0, "review_text": "To paraphrase John Cheever’s view of this work, “I think it a work of genius…” The 1976 Pulitzer winner for fiction and Saul Bellow’s best work (my opinion of course), “Humboldt’s Gift” is a literary masterpiece. Straddling the line between powerful introspective spiritual philosophy and the oftentimes quirky inner-workings of our protagonist, the profoundly intellectual Charlie Citrine, we’re provided with scores of some of the most intelligent, transcendental and self-deprecating writing of the modern era. Bellow’s ability to capture Citrine’s book-long attempts at higher consciousness (Rudolf Steiner’s anthroposophy being his goal, the ability to reach and maintain an otherworldly spiritual state by the use of highly disciplined mental faculties and thinking) and the in-depth cataloging of Citrine’s metaphysical excursions along with his adventures with communicating spiritually with the dead give us a character unlike any presented in great literature before.As suggested, Charlie Citrine is this high browed intellect who bumbles along throughout…he starts out by leaving Appleton, Wisconsin as a young man in the search of mentoring from his literary and artistic hero, poet Von Humboldt Fleisher. Finding and latching on to him in New Jersey, Humboldt takes an instant liking to the young intellect and, in turn, takes him under his wing. Spouting continual and verbose celestial incantations about art, literature and history, Citrine becomes a sponge and partner, tantalizing Humboldt with a patient ear while also presenting an intelligent challenger.Soon Citrine is off on his own, publishing books and writing screenplays. He reaches his zenith with a play, “Von Trenck” that becomes widely popular but, for reasons deep inside Humboldt, he’s seen as a traitor suddenly to the arts and intellect by the poet. Never reconnecting, Humboldt deteriorates to a street person in New York where Citrine views him briefly soon before he (Humboldt) dies ignominiously in a flophouse. The guilt Charlie suffers becomes the backbone for the book.Mixing Citrine’s chaotic present life (a divorce that is breaking him, a very young mistress, a number of entrepreneurial failures involving quaky friends and the constant attention of a Mafioso who Charlie develops a love/hate relationship) with his attempts to find peace, order and this spiritual uplifting, Bellow is masterful at guiding us through the story with amazing literary grace. This work flows from serious cognitive thought into the often very humorous adventures of our guy and his tangential characters, making what could be a very workmanlike and boring book a pleasure to read. The work that the reader puts into this is well worth it...reaching the “gift” provides a very satisfying and happy ending.At 500 pages, “Humboldt’s Gift” is a definite commitment for the reader…the philosophical discursions may be a tad much for some but the aggregate total of this wonderful book is truly uplifting. I found it both inspiring and informing and any reader, I’m sure, will see why Saul Bellow has been cemented as one of our finest novelists should they undertake it."}, {"review_sentiment": 4.0, "review_text": "I enjoyed reading this 41 year old novel wondering why I had never read Bellow before. In my younger days my novel reading was voracious. Bellow was probably always on my list but I never got around to reading his works unless perhaps a short story in Harpers Magazine or such other periodical.The story is not what makes this book. It is the discussions that are carried on between the protagonist and several eccentric characters that are either his friends or those who have insinuated themselves upon him. Charlie is ripe for destruction and as the end of the book approached I thought he may descend into sort of a psychotic mysticism. He did not.The title character von Humboldt was a poete maudit that befriended Charlie some 20 years earlier during their Princeton days. Humboldt’s gift appears as his talents. His writing brought him many accolades and personal connections. He was a candle burning brightly and psychosis led to alcoholism and he died youngish from his illness with the added fuel of gin.Humboldt’s mother named him from a statue she liked in Central Park. The statue was a tribute to the great 19th century naturalist, one know one seems to know today. Bellows it seems to me, used that as a bit of irony.Charlie himself had a distinguished career as a writer and historian but at the time of the book he is in his later fifties and sans solid ideas for new material. He was emotionally and financially manipulated by a girlfriend and nearly broke.He also was haunted by a small time gangster seeking to parasitically earn money by getting a stake in Charlie’s future earnings. There were other characters and they all stimulated Charlie’s intellectual imagination even if he did not want that.It seems that years earlier while students, Humboldt and Charlie wrote a screenplay that was never published. Suddenly it was a hit movie. From whence the Hollywood producers came upon the script was not clear but it provided Charlie with some legal blackmail with which to usurp a significant sum for a settlement. His financial situation vastly improved, he shared his profits with Humboldt’s uncle and re-buried Humboldt next to his mother. Charlie was at least partially redeemed by this last act."}, {"review_sentiment": 1.0, "review_text": "This book .......not my cup of tea. I thought it was a rambling, self-indulgent effort. Look at how many obscure references I made in this sentence or that. I must be a GREAT MAN to be able to write like this.I fought it for 6 weeks and finally abandoned it after 250 pages."}, {"review_sentiment": 4.0, "review_text": "Bellow's writing is wonderful.......he obviously loved writing the book."}, {"review_sentiment": 5.0, "review_text": "Great book by a great writer. You have to acquire a taste for Bellow. A nobelist."}]}, "authors": ["Saul Bellow"], "isbn": "0143105477", "longitude": -87.6244212, "periods": ["1900s"], "title": "Humboldt's Gift", "word_cloud": "excellent reason think reference enjoy introduction best long even year ago song call hate friend possible yearning man reach back influence clueless yearning different man say good case physic sheer plausibility get way however halfway decent number award year include net apparently lead selection later year yet never felt get mentioned conversation perhaps power muster year ago read affect even next thing write tell everyone copious amount drug beat small animal still best thing ever here concept seem shoot humor midst philosophical musing unfortunately nearly hundred page seem learn funniest joke know get say need concept simple enough ramble poet interested create capital young literary admirer also wind write famous play become rich writer process die essentially alone penniless thus ready trumpet best poet series click bait article write people daily challenge find obscure thing possible convince better stuff actually use relationship apparently base friendship poet springboard interest commentary nature reflect society man really get want least receive satisfactory start promisingly enough especially detail relationship younger yet entirely bitter seem drift away fairly quickly time dip back later liven proceeding basic idea convey quickly get famous get famous get mean see fleischer alive course recount slow descent become paranoid misanthrope become nice cautionary tale never convince loss apparently genius poet great loss society level national tragedy think good friend pretty good stuff think core material good short story well think well reason expand unfortunately forgot come enough story support instead bulk seem obsessed sap gradually lose money everyone take advantage good nature bleed dry involve divorce lawyer rest already get low level mobster follow give advice never ask new girlfriend appear view walk dollar sign sometimes sex midst get art versus commerce delve society conflict art elevate thing watch people hang throw illuminate even much plot story trial travail often feel someone write someone else parody over stressed slightly neurotic intellectual protagonist get trouble woman woman engage somewhat ridiculous antic seem design eventually elicit stand stand hero length start hurt passive time least really dedicated let people walk start border absurd thing thing go wrong way suppose comical make question fake death start wavelength come darkly funny suppose really insistent make sure get point maybe longer someone better background pretty sure hundred page either get page ago never go process make character look total oblivious backed plot deal nature leave friend hop say ha everyone handle character seem treat amazing seem degree resolve issue make feel grandly come together much shoot fifty page leave mortality brain save eloquent writing later section prose dip ever slightly stream consciousness style give heft reemergence welcome impact elevate weight precede hundred page relieved time obvious sap maybe saw relationship maybe conflict obvious springboard musing difficult say last person qualify suggest improve never bad enough say experienced intense work guess use little intensity le feel read treatment extremely erudite sitcom time read really interest view work think winner fiction best work opinion course literary masterpiece line powerful introspective spiritual philosophy oftentimes quirky protagonist profoundly intellectual provide score intelligent transcendental write modern era ability capture attempt higher consciousness anthroposophy goal ability reach maintain otherworldly spiritual state use highly discipline mental faculty think catalog metaphysical excursion adventure communicate spiritually dead give character present great literature suggest high bow intellect bumbles start leave young man search mentor literary artistic hero poet latch take instant like young intellect turn take wing spout continual verbose celestial incantation art literature history become sponge partner tantalize patient ear also present intelligent publishing writing screenplays reach zenith play become widely popular reason deep see traitor suddenly arts intellect poet reconnecting deteriorate person view briefly soon die ignominiously guilt suffer become backbone chaotic present life divorce break young mistress number entrepreneurial failure involve quaky friend constant attention develop relationship attempt find peace order spiritual uplifting masterful guide story amaze literary grace work flow serious cognitive thought often humorous adventure guy tangential character make boring pleasure work put well worth reach provide satisfy happy page definite commitment philosophical discussion much aggregate total wonderful uplift find inspire inform sure see cement finest novelist undertake enjoy read year old wondering never younger day read voracious probably always list never get read work perhaps short story story make discussion carry protagonist several eccentric character friend insinuate ripe destruction end approach think sort psychotic mysticism title character con poet audit befriend year earlier day appear talents write bring many accolade personal connection candle burn brightly psychosis lead alcoholism die youngish illness add fuel mother name statue like statue tribute great century naturalist know seem know today seem use bit distinguished career writer historian time later fifty sans solid idea new material emotionally financially manipulate girlfriend nearly also haunt small time gangster seek parasitically money get stake future earnings character stimulate intellectual imagination even want seem year earlier student write screenplay never publish suddenly hit movie whence producer come script clear provide legal blackmail usurp significant sum settlement financial situation vastly improve share profit uncle mother least partially redeem last act cup tea think ramble effort many obscure reference make sentence able write fought week finally abandon page write wonderful obviously love write great writer taste nobelist", "genres": ["Fiction & Literature"], "summary": "“I think it A Work of genius, I think it The Work of a Genius, I think it brilliant, splendid, etc. If there is literature (and this proves there is) this is where it’s at.” John Cheever\r\n\r\nSaul Bellow’s Pulitzer Prize-winning novel explores the long friendship between Charlie Citrine, a young man with an intense passion for literature, and the great poet Von Humboldt Dleisher. At the time of Humboldt’s death, Charlie’s life is falling apart: his career is at a standstill, and he’s enmeshed in an acrimonious divorce, infatuated with a highly unsuitable young woman, and involved with a neurotic Mafioso. \r\n\r\nAnd then Humboldt acts from beyond the grave, bestowing upon Charlie an unexpected legacy that may just help him turn his life around.\r\n\r\nThis Penguin Classics edition features an introduction by Jeffrey Eugenides.", "asin": "0143105477", "rank": "209028", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/519geomGIgL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}