{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 118, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "This is a really interesting read. A little slow at times but overall very engaging and I feel a lot better informed about Cuban history for reading it."}, {"review_sentiment": 5.0, "review_text": "Great book about the Bacardi family and their history in Cuba."}, {"review_sentiment": 5.0, "review_text": "One of the best history books I've read.  Highly recommend."}, {"review_sentiment": 5.0, "review_text": "Since visiting Cuba a couple of times already this year, I'm absolutely fascinated with the history BEFORE Castro.  This book covers from before the Spanish revolution and is chock full of \"who knew\" information!"}, {"review_sentiment": 4.0, "review_text": "A lot of research here.  The first part tells you  a lot about Cuba.  The last part tells a lot about the Bacardi Family, not so much about Cuba."}, {"review_sentiment": 4.0, "review_text": "History, sugar, rum ..........Cuba!Lights Out: A Cuban Memoir of Betrayal and Survival"}, {"review_sentiment": 5.0, "review_text": "I bought this book because I was planning a trip to Cuba and thought it wold be great insight into its history and culture. I wasn't disappointed. It is great historical account of not only the Bacardi family but also how the Rum industry has deep roots in Cuban culture and economy. The writing is excellent and its a joy to read. The struggle of the Cubans through the eyes of this one family to attain independence from Spain, then United States and now Castro regime reads like a historic novel with insights into its characters on a personal basis. I was surprised to find so many upper class Cubans who were in favor of the Revolution and Castro - only to be duped ultimately betrayed by their mercurial and megalomaniac leader. I recommend reading this in conjunction with Havana; A Subtropical Delirium by Mark Kurlansky. Which gives you good insights into the depth's of Cuba's slave trade on their culture. I just returned from my trip to Cuba and felt incredibly connected historically and culturally with the Cuban people. If your planning to travel there - it will enhance your trip (and want to make you drink great Cuban rum, which I did in abundance!!)."}, {"review_sentiment": 5.0, "review_text": "This book is fantastic.  I read it before and while in Cuba, and it gave me some deep perspective on some of the undercurrents of the country.  Do not get me wrong; much of the beauty of Cuba lies in its inability to be explained.  But for anyone who has a desire to learn more about it, or especially to travel there, this is required reading."}, {"review_sentiment": 5.0, "review_text": "This history demonstrates good research and reads like a James A. Michener  novel.  Documents  Cuban history from the mid-nineteenth century to the present with the story of Bacardi rum company as the central character.  The cover design doesn't do the contents justice; it looks like an ad for a rum and rumba party.  I loved it and recommend it!"}, {"review_sentiment": 5.0, "review_text": "Great historical context, this is a very interesting read."}]}, "authors": ["Tom Gjelten"], "isbn": "0143116320", "longitude": -82.3658671, "periods": ["1900s", "Recent Releases"], "title": "Bacardi and the Long Fight for Cuba: The Biography of a Cause", "word_cloud": "really interest little slow time overall engage feel lot better informed history reading family history best history highly visit couple time already year absolutely fascinate history cover spanish revolution chock full knew information lot research first part tell lot last part tell lot family much history sugar rum buy plan trip think wold great insight history culture disappoint great historical account family also industry deep root cuban culture economy writing excellent joy struggle eye family attain independence regime read historic insight character personal basis surprise find many upper class favor dupe ultimately betray mercurial megalomaniac leader recommend read conjunction give good insight depth slave trade culture return trip felt incredibly connect historically culturally cuban people plan travel enhance trip want make drink great rum abundance fantastic give deep perspective undercurrent country do wrong much beauty lie inability explain anyone desire learn especially travel required reading history demonstrate good research read history century present story rum company central character cover design content justice look ad rum rumba party love recommend historical context interesting", "genres": ["Business & Finance", "History", "Politics", "Food and Wine"], "summary": "In this widely hailed book, NPR correspondent Tom Gjelten fuses the story of the Bacardi family and their famous rum business with Cuba's tumultuous experience over the last 150 years to produce a deeply entertaining historical narrative. The company Facundo Bacardi launched in Cuba in 1862 brought worldwide fame to the island, and in the decades that followed his Bacardi descendants participated in every aspect of Cuban life. With his intimate account of their struggles and adventures across five generations, Gjelten brings to life the larger story of Cuba's fight for freedom, its tortured relationship with America, the rise of Fidel Castro, and the violent division of the Cuban nation.", "asin": "0143116320", "rank": "282353", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51%2B91icbL6L.jpg", "country": "Cuba", "story_arc": ["Tragedy", "Things only get worse"]}