{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 186, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "This was my first JLC novel. I had read many of Fleming's books (which I loved) and I was simply looking for a different style. Needless to say I was not prepared for this novel. \"What have I purchased and what am i reading?\" as I plowed through the book. This was not Fleming but I could not walk away. When I had finished the book I was a Le Carre fan for life. JCL is not for everyone but I am so glad I \"accidentally\" picked this winner."}, {"review_sentiment": 2.0, "review_text": "C this reviewing system stinks. Kindle is killing itself as car as I am concerned. Mmm. Lol. Ugh. Cbc. Yes com no yes  oMac"}, {"review_sentiment": 4.0, "review_text": "Very interesting narrative structure. A story of flash backs and motive."}, {"review_sentiment": 5.0, "review_text": "Written by a master and highly entertaining."}, {"review_sentiment": 1.0, "review_text": "I will not write to Customer Service untilI get my refunf of $ 10.49 overcharged on a duplicate order nor wiil I buy any item aqainGirl on the chat said 3 to 5 days for  a refundI think Amazon is a huge company that does not need my $ 10.49"}, {"review_sentiment": 2.0, "review_text": "The novel is very difficult to read and follow. It’s was too long without saying much"}, {"review_sentiment": 1.0, "review_text": "i have read most of le carre books and this is unworthy of his name. he should never have published it."}, {"review_sentiment": 5.0, "review_text": "Large and complicated book which was well received by my book club.  The writing is wonderfully descriptive.  So many complicated characters."}, {"review_sentiment": 5.0, "review_text": "I hadn't even heard of this chap before last week when Terry Gross called him the quintessential spy novelist and ex member of MI6. I might could be a little intrigued by everything he writes about: spies, conspiracies and cultural and regional lingo. A British lass from Pony Club had me from her first sentence, \"Mind the cones.\" I've been using \"mind the...\" ever since. We now know building 7 fell at free fall speed on 9/11 with nano thermite found everywhere in an obvious controlled demolition. This false flag event and Hegelian dialectic in addition to spy intelligence got us into never ending wars based on yellah cake and other fake news propagated by the weaponized media. It's almost as if the system is made to feed, protect and constantly kill for the empire whose storied (if not phony) creation myth came ordained by the Lord himself. You'll have to forgive me if I'm not really into a God who ordains genocide."}, {"review_sentiment": 5.0, "review_text": "I have lost count of the number of times I have read John le Carre's masterpiece, A Perfect Spy, and each time I am deeply affected by the experience.  It is surely his greatest work and it remains for me as fresh and compelling as ever.  Thanks to Le Carre's biographer Adam Sisman's magnum opus and also The Pigeon Tunnel,  the counter collection of autobiographical stories le Carre felt compelled to produce in response, we know now how much of the complicated father son relationship A Perfect Spy describes, is taken from real life.  The loves and betrayals of friendship is the major theme shaping the book's enduring appeal and indeed, all of le Carre's contemporary writing.  \"Never mind, E Weber love you always\",  the brush off from one spectacular deceit, is the line of the book for me.  Thus is the Perfect Spy made and sustained to the very end."}]}, "authors": ["John le Carré"], "isbn": "0143119761", "longitude": 14.4212535, "periods": ["1900s"], "title": "A Perfect Spy", "word_cloud": "first many fleming love simply look different style say prepare purchase read plow away finish fan life everyone glad accidentally pick winner review system stink kill car concern o mac very interesting narrative structure story flash back motive master highly entertaining write until i refund overcharge duplicate order wail buy item aqaingirl chat say day refund i think huge company need difficult long say much le carer unworthy name never publish large complicate well receive club writing wonderfully descriptive so many complicate character even hear chap last week call quintessential novelist member intrigued everything write spy conspiracies cultural regional lingo british lass first sentence cone use mind ever know build fell free fall speed anon termite find everywhere obvious control demolition false flag event dialectic addition intelligence get never end war base yell ah cake fake news propagate weaponized medium almost system make feed protect constantly empire storied phony creation myth come ordain forgive really ordain lose count number time le masterpiece time deeply affect experience surely greatest work remain fresh compelling ever magnum opus also counter collection autobiographical story le felt compel produce response know much complicate father son relationship describe take real life love betrayal friendship major theme shape endure appeal indeed le contemporary write mind always spectacular deceit line make sustained end", "genres": ["Fiction & Literature", "Mystery & Suspense", "Cold War"], "summary": "Over the course of his seemingly irreproachable life, Magnus Pym has been all things to all people: a devoted family man, a trusted colleague, a loyal friend—and the perfect spy. But in the wake of his estranged father’s death, Magnus vanishes, and the British Secret Service is up in arms. Is it grief, or is the reason for his disappearance more sinister? And who is the mysterious man with the sad moustache who also seems to be looking for Magnus?\r\n \r\nIn A Perfect Spy, John le Carré has crafted one of his crowning masterpieces, interweaving a moving and unusual coming-of-age story with a morally tangled chronicle of modern espionage.", "asin": "0143119761", "rank": "70171", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/5179O0vkJwL.jpg", "country": "Czechia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}