{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 208, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book. Three stories linked together by a common thread. It's amazing. Read it for my Contemporary Fiction class and fell in love with it. Will definitely go seek out some other works by Auster."}, {"review_sentiment": 3.0, "review_text": "I liked the first novella of the three in the volume.  I thought it was witty and funny and that I mostly understood it.  The middle one, I partly understood what happened in it, but the third I could not.  The writing style is good, so I was disappointed that the writing was opaque."}, {"review_sentiment": 1.0, "review_text": "Read Part 1 but had no enthusiasm to continue. Could not see to where this was leading....and, frankly, did not care"}, {"review_sentiment": 5.0, "review_text": "I love this book so much !"}, {"review_sentiment": 1.0, "review_text": "awful, unreadable."}, {"review_sentiment": 5.0, "review_text": "Unusual and Intruiging.  This will set you thinking.  Worth the read.  I will surely reread.  Makes you ponder your own life."}, {"review_sentiment": 1.0, "review_text": "I'm very strange book and just seem to go all over the place and it had no ending"}, {"review_sentiment": 1.0, "review_text": "If you loved \"Waiting for Godot\" this'll be a great choice.  For anyone else it's just boring.  I read the first two stories only (variations on a theme) before tossing in the towel."}, {"review_sentiment": 1.0, "review_text": "This book has a great-looking cover. This author writes well. If you are looking for good story, character, dialogue, or interesting content, though, you will not find it here."}, {"review_sentiment": 2.0, "review_text": "I read the first story years ago, so I picked this up to finish the trilogy. It was slow going. I didn't find it exciting or groundbreaking at all. I will not read another one of his books again."}]}, "authors": ["Paul Auster"], "isbn": "0143039830", "longitude": 0.0, "periods": ["1900s"], "title": "The New York Trilogy", "word_cloud": "story link together common thread amaze class fell love definitely go seek work austen like first novella volume think witty funny mostly understand middle partly understand happened third write style good disappoint write opaque enthusiasm continue lead frankly care love much awful unreadable unusual set think surely reread ponder life strange seem place end love great choice anyone else bore first story variation theme toss towel cover author write well look good story character dialogue interesting content find first story year pick finish go find excite groundbreaking one", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "The series that made New York Times-bestselling author Paul Auster a renowned writer of metafiction and genre-rebelling detective fiction\r\n\r\nThe New York Review of Books has called Paul Auster's work “one of the most distinctive niches in contemporary literature.” Moving at the breathless pace of a thriller, these uniquely stylized detective novels include City of Glass in which Quinn, a mystery writer, receives an ominous phone call in the middle of the night. He’s drawn into the streets of New York, onto an elusive case that’s more puzzling and more deeply-layered than anything he might have written himself. In Ghosts, Blue, a mentee of Brown, is hired by White to spy on Black from a window on Orange Street. Once Blue starts stalking Black, he finds his subject on a similar mission, as well. In The Locked Room, Fanshawe has disappeared, leaving behind his wife and baby and nothing but a cache of novels, plays, and poems.\r\n\r\nThis Penguin Classics Deluxe Edition includes an introduction from author and professor Luc Sante, as well as a pulp novel-inspired cover from Art Spiegelman, Pulitzer Prize-winning graphic artist of Maus and In the Shadow of No Towers.\r\n\r\nFor more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "asin": "0143039830", "rank": "70959", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51cbJ9D9hpL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}