{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.2083537, "ratings": {"num_ratings": 122, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "great book"}, {"review_sentiment": 3.0, "review_text": "In “The Essential Rebecca West”, a collection of her writings “selected from her writings by her publishers and with her help”, there are 200 pages of extracts from the original two-volume  1,200-page long work about the author’s journey through Yugoslavia in 1937.  I have not read the full work; but I assume that these extracts are sufficiently representative of the book as a whole that for me to  have ventured to post this review.  I have to report, though, that to Geoff Dyer, reviewing the whole book in The Guardian in 2006, writes that this selection “feels like an aesthetic violation”.It begins with a prologue which is in part a straightforward, if selective narrative of brutal historical events connected with the Balkans before and, in one case, after the First World War; and she explains that she had been unexpectedly so taken by Yugoslavia on a lecture tour in 1936 that she felt she must go again in the following year, this time with her husband.  But, typically, the Prologue also indulges in some far-fetched and pretentious reflections on, for example, what King Alexander of Yugoslavia would have felt during that visit to France where he would be assassinated in 1934.The extracts that follow are fine travel writings, full of observations, of vivid scenes, of personal reflections (often tangential, turgid and very far from being vivid), and of historical information, delving back all the way to medieval times, about the complexities and violence in that region, and about ethnic and religious tensions which would eventually contribute to the disintegration of Yugoslavia.  She supports nationalism so long as it is a protest against foreign oppression and does not turn into oppression itself.There is a particularly fine passage about the Haiduk women of Bosnia, who will not eat until after their menfolk, whom they serve, have eaten, but who do not in the least seem to feel oppressed, but are sturdy, vigorous, happy and spiritually free.  There are 26 pages about the unbelievable muddles before, during and immediately after the assassination of Francis Ferdinand at Sarajevo.In Macedonia she witnesses, on two occasions, primitive rituals by Bektashi Muslims, especially by women who are asking favours, around a tall stone in a field. One of these rituals is innocuous enough, but the other involves bloody sacrifices; and she makes a comparison between that rite and the sacrifice of Jesus in Christianity.  Not only that, but she here brings in references to Shakespeare, Mozart, Jane Austen and William Blake as well!  These discursions, which become more plentiful in the late extracts, are what have made some critics, like Geoff Dyer, rate it so highly as much more than a travel book; but I found them irritating and self-indulgent, sometimes intensely so.She takes an ancient Serb epic poem as the basis for the suggestion that the defeat by the Turks of the Serbs at the Battle of Kossovo in 1389 was due to Lazar, the Serb King, having resigned himself to defeat, and her epilogue draws a parallel with the defeatism of England and France in the face of the threat from Nazi Germany and Fascist Italy; and she dreaded the possibility that the West would come to lie under the German heel for centuries, just as the Serbs suffered for centuries under the Turks.  The two volumes were published in 1942, and the epilogue will have been written before Stalingrad and El Alamein late that year; but even so, I find ludicrous the comparison she made between “Kossovo in 1389 and England in 1939”.We first hear about this epic poem in a seven-page long rumination near the end of this selection, in perhaps the most convoluted passages of writing of many in the whole book.  Here we finally discover to what the title’s grey falcon and black lamb refer.  That Rebecca West should choose the imagery of those six pages as the title of the whole book is typical of what seems to me her frequent pretentiousness.  I’m afraid I did not care for her: for her style which is often hard going, for her discursions, and for the persona these suggest to me.The book is indeed her magnum opus in all senses of these words, but so packed with information that its main appeal must surely be to people who, like her, cannot have too much of it."}, {"review_sentiment": 3.0, "review_text": "Only read the first 100 pages. Difficult and challenging but I think this will be a rewarding read. An aside: By chance I opened my secondhand copy to page 270. (It is blank.) Someone has printed in blue ballpoint ink in a single column the following- cold, arrogant, ruthless, vengeful, elitist. Gee, thanks, haven't gotten this far and only have 1000+ pages to go! Thank you and enjoy!"}, {"review_sentiment": 5.0, "review_text": "In placing 5 stars on Dame Rebecca West’s Black Lamb and Grey Falcon I am giving her credit for writing a book better than it could have been intent. Her book makes many things clear. Including some that did not manifest themselves until long after her death. Her prose can alternate between too florid and poetic to classic history professor. Her fondness for assigning the most abstract and poetic meaning to anything from the weather to the expression of a nearly starving local can be maddening. However there is enough of the dispassionate reporter, learned professor and knowledgeable travel guide to keep me reading even as the length of the read was getting to me.In over 1100 pages Dame West leads us through the many nations and peoples that then constituted the then newly created Yugoslavia. She is clearly pro Yugoslavia, and pro-Slavic but less certain about the Turks (Muslims). Respecting their beliefs and holding that they are good enough if only they would stay in their own countries. She has little patience for the Austrians and basically assigns all bad things to the Germans, or at least the subset of Germans who were on the verge of launching World War II.  And so it goes through the catalogue of ethnicities and nationalities of a crowded part of Europe. If you have forgotten the term Balkanization or why it was coined, Black and Grey makes the case.She has a keen eye for architecture and just enough language skills and at least one well-placed friendly and important local to give her readers access to the many pressures and opinions that were simmering under the newly hung flag of Yugoslavia.Mostly Black Lamb and Grey Falcon is a travelogue as Dame West, her European Banker husband and their guide; Poet friend and government officer, Constantine cover the country. Together they travel mostly by car and train. The year is 1938, this is her second such visit. The publication date of 1941 makes her dedication poignant: “To My Friends in Yugoslavia, Who are All Dead or Enslaved.”Through her we will visit seven major national homelands, notably Croatia, Bosnia, and Serbia all names that should have an eerie and deadly and deadly association Dame West would not have wished on a 2017 reader. In each place she will visit (to us) obscure monasteries and monuments. She will recite for us the backgrounds of the royal houses and peoples who were martyred, betrayed or themselves betrayed the many causes that constitute the jumbled nexus of history she knew as Yugoslavia. She makes the case that the selected human tools of the Serbian independence movement that assassinated the Emperor Franz Joseph and started World War One were local heroes.She takes sides in the case of women, so often sold as breeding animals for political purposes and the more modern pheasant equivalent worked prematurely from the beauty of youth into the exhaustion of age. She is bitter about the casual way the better known western nations sold states in Balkans to Austria or back to the Turks, always to the impoverishment and subjugation of the locals.Into this mix she offers a plea and a patriotic call to those who had been the isolationist and the idealists. Being above the fray may lend purity to the conscientious objector but at the cost of the blood of those the objector should be sworn to protect. This many years later this can sound as a note of propaganda. Allowing for that it is still an important insight.When the Bosnian war broke out in 1992 it was common to observe that the war was making enemies of people who had lived in peace for years. By this time Dame West would have been dead for ten years and the state of Yugoslavia that she had traveled was broken with worse to come.  What Black Lamb and Grey Falcon achieves, beyond any intention on her part is to remind the modern reader that the forces that broke apart Yugoslavia and started this especially inhumane raping and killing had antecedents centuries in the making. However much individuals had found ways to respect or at least live with each other Dame West had told us, if unwittingly that the spirit of cooperation was weak and the desire for blood had never cooled."}, {"review_sentiment": 5.0, "review_text": "helped enormously with a recent visit to Croatia. Well written, clear, intelligent."}, {"review_sentiment": 5.0, "review_text": "When I was in college, I noticed that my school offered a course on Balkan history. I went in to talk to the professor who taught the course to find out more about it. He asked if I knew anything about the Balkans already. I said \"I've traveled there some and I've read Black Lamb, Grey Falcon.\" He stopped and said \"Wait. You've read Black Lamb, Grey Falcon? All of it? Don't take my course. You'll be bored. If you've read that whole book there's nothing more I can teach you about the Balkans.\" It is a huge book, but completing it was as rewarding as finishing a book has ever felt! If you're passionate about the Balkans this is an absolute must read. The other two you should read are Bridge on the Drina and Balkan Ghosts, but this is at the top of the list. Rebecca West is such an incredibly erudite and unique woman, and her passion for the region shows on every page."}, {"review_sentiment": 2.0, "review_text": "unusual for  me but I'm not finished with it yet ......so much to wade through; maybe too much to wade through"}, {"review_sentiment": 4.0, "review_text": "Long read but worth it."}, {"review_sentiment": 5.0, "review_text": "Still an indispensable read for anyone wishing to understand the Balkans and the people and cultures who occupy that fascinating region. West has an eye and ear for grasping important nuances."}, {"review_sentiment": 5.0, "review_text": "This is a classic."}]}, "authors": ["Rebecca West"], "isbn": "014310490X", "longitude": 16.3725042, "periods": ["1900s"], "title": "Black Lamb and Grey Falcon", "word_cloud": "great collection writing select writing publisher help page extract original long work author journey full work assume extract sufficiently representative whole venture post review report review whole guardian write selection feel aesthetic violation begin prologue part straightforward selective narrative brutal historical event connect case explain unexpectedly take lecture tour felt follow year time husband typically also indulge pretentious reflection example visit extract follow fine travel writing full observation vivid scene personal reflection often tangential turgid far vivid historical information delve way medieval time complexity violence region ethnic religious tension eventually disintegration support nationalism long protest foreign oppression turn oppression particularly fine passage woman eat menfolk serve eat least seem feel oppress sturdy vigorous happy spiritually free page unbelievable muddle immediately assassination witness occasion primitive ritual especially woman ask favor tall stone field rituals innocuous enough involves bloody sacrifice make comparison rite sacrifice not bring reference well discussion become plentiful late extract make critic rate highly much travel find irritate sometimes intensely take ancient epic poem basis suggestion defeat due resign defeat epilogue draw parallel defeatism face threat dread possibility lie german heel century suffer century turks volume publish epilogue write late year even find ludicrous comparison make first hear epic poem long rumination end selection perhaps convolute passage write many whole here finally discover title refer choose imagery page title whole typical seem frequent pretentiousness afraid care style often hard go discussion persona suggest indeed magnum opus sens word pack information main appeal surely people much only first page challenge think reward aside chance open secondhand copy page blank print blue ballpoint ink single column cold arrogant ruthless vengeful elitist thanks get far page go enjoy place star give credit write better make many thing clear manifest long death prose alternate florid poetic classic history professor fondness assign abstract poetic meaning anything weather expression nearly starve local maddening however enough dispassionate reporter learn professor knowledgeable travel guide keep read even length get page lead many nation people constitute newly create clearly pro le certain hold good enough country little patience basically assigns bad thing least subset verge launch go catalogue ethnicity nationality crowd part forget term coin make keen eye architecture enough language skill least friendly important local give reader access many pressure opinion simmer newly hang flag travelogue european husband guide friend government officer cover country travel mostly car train year second publication date make dedication poignant visit major national homeland notably name eerie deadly deadly association place visit obscure monastery monument recite background royal house people martyr betrayed betray many cause constitute jumbled nexus history know make case select human tool serbian independence movement assassinate start local take side case woman often sell breed animal political purpose modern pheasant equivalent work prematurely beauty youth exhaustion age bitter casual way better know western nation sell state back always impoverishment subjugation mix offer plea patriotic call isolationist idealist fray purity conscientious objector cost blood objector swear protect many year later sound note propaganda still important war break common war make enemy people live peace year time year state travel broken worse achieve intention part remind modern force break apart start especially inhumane rap kill antecedent century make however much individual find way least live tell unwittingly spirit cooperation weak desire blood never cool help enormously recent visit write clear intelligent college notice school offer course history go talk professor taught course ask know anything already say travel stop say course bore whole nothing teach huge complete reward finish ever felt passionate absolute top list incredibly erudite unique woman passion region show page unusual finish yet much wade maybe much wade long worth still indispensable anyone wish understand people culture occupy fascinate region eye ear grasp important nuance classic", "genres": ["History", "Travel Writing", "WWII"], "summary": "“Rebecca West’s magnum opus . . . one of the great books of our time.” The New Yorker\r\n \r\nWritten on the brink of World War II, Rebecca West’s classic examination of the history, people, and politics of Yugoslavia illuminates a region that is still a focus of international concern. A magnificent blend of travel journal, cultural commentary, and historical insight, Black Lamb and Grey Falcon probes the troubled history of the Balkans and the uneasy relationships among its ethnic groups. \r\n\r\nThe landscape and the people of Yugoslavia are brilliantly observed as West untangles the tensions that rule the country’s history as well as its daily life.\r\n ", "asin": "014310490X", "rank": "65539", "city": "Vienna", "image": "https://images-na.ssl-images-amazon.com/images/I/415TX2-69SL.jpg", "country": "Austria", "story_arc": ["Tragedy", "Things only get worse"]}