{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 143, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Augie March is an astonishing book written by a great observer of the human condition. Bellow's writing style takes some getting used too but once you get into the rhythm after maybe 15 pages it becomes a page turner. Bellow is particularly adept at describing situations and characters with a richness of depth not encountered in other authors."}, {"review_sentiment": 5.0, "review_text": "Great product. Great service."}, {"review_sentiment": 1.0, "review_text": "Boring."}, {"review_sentiment": 5.0, "review_text": "Stellar book"}, {"review_sentiment": 5.0, "review_text": "Surpassed every fiction book I've ever read and is now my all-time favorite (sorry, Rushdie; Satanic Verses held the prize for 20 years)."}, {"review_sentiment": 4.0, "review_text": "I read a lot of contemporary books, Occasionally, I try something a little older, and sometimes I am put off by the writing styles of authors who wrote before the mid-twentieth century. So, it was with some hesitation I picked up Saul Bellow’s “The Adventures of Augie March.” I was delightfully surprised at how much I enjoyed this novel. Mr. Bellow writes with a beauty and skill that does not distract from the story but makes his story more personal and valuable to the reader.Many older novels, though beautifully written lack a compelling story that is relevant to the twenty-first century reader. “The Adventures of Augie March” gives today’s readers a taste of the first half of twentieth century America in a way that is both relatable and entertaining. Augie March and most of the characters who interact with him in this story are not at all loveable people. But what they do have is a certain authenticity that Mr. Bellow systematically and skillfully reveals to the reader. These characters through their actions and a parlance steeped in speech of their times that vividly portray life in the 1920’s, 30’s and forties.Tom Parker does a masterful job in narrating this book. His performance added much to the enjoyment of the Audible edition.Recommended: Yes."}, {"review_sentiment": 5.0, "review_text": "American Novel.  Period.  Look no further.  Doesn't even matter that it was written by a liberal because the Democratic Party was actually relevant when Bellow was alive."}, {"review_sentiment": 4.0, "review_text": "It's a good read and well worth your time but it's not the easiest read and definitely has its dull moments."}, {"review_sentiment": 4.0, "review_text": "I can hardly believe it took me so many years to get around to reading this novel. Augie March is one of the unique figures in American literature, a follower who constantly finds himself the object of manipulation by others. While some readers have insisted that they found him unlikeable, I felt a great deal of sympathy toward him and found myself pulling for him. Augie is also self destructive and that infuriated me at times, but I eventually came to expect it.I will say that the opening chapters made me work. This is not a quick read. But once I fell into Bellows's style and got accustomed to the philosophical monologues both from Augie and other characters , I found it hard to put down."}, {"review_sentiment": 5.0, "review_text": "A masterpiece. One of the great novels of the 20th Century."}]}, "authors": ["Saul Bellow"], "isbn": "0143039571", "longitude": -87.6244212, "periods": ["1900s"], "title": "The Adventures of Augie March", "word_cloud": "astonish write great observer human condition writing style take get use rhythm maybe page becomes page turner particularly adept describe situation character richness depth encounter author great product service bore stellar surpass fiction ever favorite sorry hold year lot contemporary try something little older sometimes put write style author write century hesitation pick delightfully surprise much enjoy write beauty skill distract story make story personal valuable older novel beautifully write compelling story relevant century give today reader taste first half twentieth century way repeatable entertaining character interact story lovable people certain authenticity systematically skillfully reveal character action parlance steep speech time vividly portray life masterful job narrate performance add much enjoyment audible yes even matter write liberal actually relevant alive good well worth time easiest definitely dull moment hardly believe take many year get read unique figure american literature follower constantly find object manipulation others reader insist found unlikable felt great deal sympathy find pull also self destructive infuriated time eventually come expect say open chapter make work quick fell style get accustomed philosophical monologue character find hard put masterpiece great novel", "genres": ["Fiction & Literature"], "summary": "“The Adventures of Augie March is the great American Novel. Search no further.” –Martin Amis\r\n\r\nAs soon as it first appeared in 1953, this novel by the great Saul Bellow was hailed as an American classic. Augie, the exuberant narrator-hero is a poor Chicago boy growing up during the Great Deptression. A “born recruit,” Augie makes himself available for a series of occupations, then proudly rejects each one as unworthy. His own oddity is reflected in the companions he encounters—plungers, schemers, risk-takers, and “hole-and corner” operators like the would-be tycoon Einhorn or the would-be siren Thea, who travels with an eagle trained to hunt small creatures. This Penguin Classics edition, with an introduction by celebrated writer and critic Christopher Hitchens, makes a literary masterpiece available to a new generation of readers.\r\n\r\n", "asin": "0143039571", "rank": "94599", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/41XKOQ9BsML.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}