{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -12.9822499, "ratings": {"num_ratings": 5, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent history well written"}, {"review_sentiment": 4.0, "review_text": "Great book! I had to read it for school and it turned out to be a great read!"}, {"review_sentiment": 4.0, "review_text": "History, poetry, romance, intrigue, adventure. The Violent Land has it all.  The cocoa plantations are long gone, victim of disease, but here, their story is beautifully told."}, {"review_sentiment": 1.0, "review_text": "was reading this book to familiarize myself with some of the history of Brazil & although it portrayed the corruption & violence, their were too many characters & some of them were irrelevant to the story. I would have preferred sticking to one or two families & a straight forward timeline."}, {"review_sentiment": 3.0, "review_text": "A quick an enjoyable read, sharing an interesting perspective on a fascinating time in Brazilain history. Lovely characters that you will enjoy getting to know."}]}, "authors": ["Jorge Amado"], "isbn": "0143106376", "longitude": -38.4812772, "periods": ["1900s"], "title": "The Violent Land", "word_cloud": "excellent history well write school turn great poetry romance intrigue adventure cocoa plantation long go victim disease story beautifully tell read familiarize history portrayed corruption violence many character irrelevant story stick family straight forward timeline quick enjoyable share interesting perspective fascinating time history character enjoy get know", "genres": ["Fiction & Literature"], "summary": "From the great Brazilian author, an exotic tale of greed, madness, and a dispute between two powerful families over land on the cocoa-rich coast of Bahia.\r\n\r\nThe siren song of the lush, cocoa-growing forests of Bahia lures them all—the adventurers, the assassins, the gamblers, the brave and beautiful women. It is not a gentle song, but a song of greed, madness, and blood. It is a song that promises riches untold, or death for the price of a swig of rum . . . a song most cannot resist—until it is too late—not Margot, the golden blond prostitute who comes for love; not Cabral, the unscrupulous lawyer who works for one of the Cacao “colonels”; and not Juca, whose ruthless quest to reap the jungle’s harvest plants the seeds of his own destruction. ", "asin": "0143106376", "rank": "967126", "city": "Salvador", "image": "https://images-na.ssl-images-amazon.com/images/I/51TgotyrY4L.jpg", "country": "Brazil", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}