{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 20, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "I was disappointed in this title, mostly because I was expecting it to be about the earthquake. It mentioned the earthquake in the first four chapters; however, this work is more accurately a biography of Minister Carvalho, Marques de Pombal. The story told herein centers on Cavalho's work around the monarchy of Portugal and those effects he had on rebuilding Lisbon in the aftermath of the earthquake. And while it does talk about the devastation of the earthquake and subsequent tsunamis and conflagration, the death toll, and how it plunged Portugal into near-total ruin, the *focus* of the story isn't the earthquake - or the other factors which contributed to the razing of the city of Lisbon.One other thing that bothered me is the lack of citations. The footnotes in each chapter are almost solely reserved for direct quotations from other works. Incredibly, despite having several pages of bibliography, Shrady chose not to cite what information came from which source. Because of that, without checking out all of his referenced sources in the bibliography, readers can't simply accept that he researched the content. We've no way to know whether the information within this tome is part inference and historical interpretation - and if it is, we don't have a way to know what part of the material is inference/interpretation, and which part is verifiable historical fact.But I have to say that the most irritating thing about the book for me was chapter five. It had no place within the main bulk of the book - or, at least, it didn't belong *where* it was placed. It veers off from the book's subject and places readers in the 1500s. At this point, Shrady discusses international economics and Portugal's place in them. He talks about Portugal's Counter-Reformation, their Inquisition, the heavy religious threads bonding their society together. While this is all interesting material, it simply doesn't have a place in the center of this narrative given that the *subject* is supposed to be the destruction of Lisbon. Shrady could have incorporated most of these details in a more fluid way. He could have chosen either to have chapter five be an appendix added to the end of the book, or he could have parceled the information out and discussed the pertinent parts where they affected Lisbon's reconstruction. The economic factors were important because of Carvalho's establishment of state-funded businesses. And Shrady does make brief mention of the previous economic situation regarding imports and exports as that specifically relates. But when he does, he's repeating the information that he already presented in chapter five. Other aspects of that chapter are similarly treated in the last three chapters of the work.Overall, I would not have been as disappointed in this work if it weren't being billed as being about the 1 November 1755 earthquake. If the title had made it clear that the subject of this treatise was Carvalho's role in Portguese politics as *that* related to the earthquake and its aftermath, I would have been more pleased with the reading. (I would have still been disappointed in the lack of citations. And the placement of chapter five.) Unfortunately, the title is misleading. In the end, that caused me to be disappointed with the work as a whole."}, {"review_sentiment": 5.0, "review_text": "History at its best.  Shrady is an excellent writer and his research is top notch."}, {"review_sentiment": 5.0, "review_text": "Well written. Great historical insights"}, {"review_sentiment": 5.0, "review_text": "a great  true story."}, {"review_sentiment": 2.0, "review_text": "The Lisbon Earthquake is one of Europe's greatest disasters, both in magnitude and psychologically.  So I eagerly purchased Shrady's book a few years ago.  I have found it quite well written and interesting, but....where's the quake?  It is described in the first chapter and a bit toward the end, but nowhere else.  Mostly this is a history of medieval Portugal, including the Moors, the Reconquista, Jewish expulsion, the slave trade and the Inquisition.  It's all an excellent history lesson but then...what about the great quake?  Even its impact on the Enlightenment gets less print then it should.  I have read short articles with more material on the subject.  The calamity deserves to be a book of its own, not window dressing for a general history."}, {"review_sentiment": 5.0, "review_text": "Essential reading for anyone visiting Portugal, especially Lisbon"}, {"review_sentiment": 5.0, "review_text": "thx much. excellent"}, {"review_sentiment": 4.0, "review_text": "I agree with other reviewers it can seem a little choppy at time, especially with it jumping around the timeline (the earthquake is the first thing happening, then you go to some background, then you go even further back to get the background of Portugal since the Romans...) and interestingly seems rather short for what I'm used to for history books, but it is an easy read that is very informative, especially for someone who knew very little of Portuguese history before reading. I'd highly recommend for people wanting a full historical context as well as many first person accounts (though interestingly enough, most seem to be from British ex-pats in Lisbon at the time rather than Portuguese accounts. I'm not sure if that's just because they're easier to find or because they didn't need to be translating, but it caught my attention)."}, {"review_sentiment": 3.0, "review_text": "It took me a while to read through this short book. I have been to Lisbon and was fascinated by the earthquake, fire, and tidal wave that swept the city. This book gives an overview and history of the city, along with Carvalho's attempts to revitalize Lisbon.  However, there was only two chapters on the tragedy, and the rest were a history of the city, Carvalho, and the recovery from the earthquake. This material took a little longer to read through and understand.  Shrady spends a lot to time elsewhere, on things like how the Catholic Church dominated life in Portugal, and the colonization efforts in Africa, South America, and Asia.This is a nice starter for a history of this earthquake. It also gives a history of the Portuguese state. An OK read."}, {"review_sentiment": 4.0, "review_text": "Suffice it to say that the king's prime minister, Cavaho,later the Marques de Pombal,  used this disaster (earthquakes and a tsunami) that leveled much of Lisbon and did extensive damage to other parts of the country as an opportunity to remake Portuguese society.  He got the Jesuits kicked out, reduced church control of education, and did some very nasty things to nobles he thought were plotting against him.  As he didn't have much of a constituency behind him, most of these changes were revoked after the king's death.  Pombal did do an excellent job of disaster relief.  Though we now remember Voltaire's response to the disaster in his Candide, plenty of people at the time did see the disaster in religious terms that were opposed to Voltaire's point of view."}]}, "authors": ["Nicholas Shrady"], "isbn": "0143114603", "longitude": -9.1365061, "periods": ["1700s"], "title": "The Last Day: Wrath, Ruin, and Reason in the Great Lisbon Earthquake of 1755", "word_cloud": "disappoint title mostly expect mention first chapter however work accurately biography story tell herein center work around monarchy effect rebuild aftermath devastation subsequent tsunami conflagration death toll plunge ruin story factor contribute raze city thing bother lack citation footnote chapter almost solely reserved direct quotation work incredibly several page bibliography choose cite information come source check referenced source bibliography reader simply researched content way know information tome part inference historical interpretation way know part material part verifiable historical say irritate thing chapter place main bulk least belong place veer subject place reader point discuss international economics portugal place talk heavy religious thread bond society together interest material simply place center narrative give suppose destruction detail fluid way chapter appendix add end information discuss pertinent part affect reconstruction economic factor important establishment business make brief mention previous economic situation regard import export specifically relate repeat information already present chapter other aspect chapter similarly treat chapter work billed title make clear subject treatise role politics related aftermath please reading still lack citation placement chapter title misleading end cause disappointed work whole history best shady excellent writer research top notch well write historical insight true story greatest disaster magnitude psychologically so eagerly purchase year ago find quite well write interesting quake describe first chapter bit end nowhere else history medieval include moor jewish expulsion slave trade inquisition excellent history lesson get le print short article material subject calamity deserve window dress general history essential read anyone visit especially the much excellent agree reviewer seem little choppy time especially jump around timeline first thing happen background even back get interestingly seem rather short use history easy informative especially someone know little portuguese history read highly recommend people want full historical context well many first person account interestingly enough seem british time rather portuguese account sure easier find need translate catch attention take short fascinate fire tidal wave sweep city give overview history city attempt revitalize however chapter tragedy rest history city recovery material take little longer spend lot time elsewhere thing dominate life colonization effort nice starter history also give history state ok say king prime minister later use disaster earthquake tsunami level much extensive damage part country opportunity remake portuguese society get kick reduce church control education nasty thing noble thought plot much constituency change revoke king death excellent job disaster relief remember response disaster plenty people time see disaster religious term oppose point view", "genres": ["History", "Science & Nature"], "summary": "The Lisbon Earthquake of 1755 was no run-of-the-mill misfortune-it was a watershed moment that shook the pillars of an inveterate social order and sent reverberations throughout the Western world. \r\n\r\nEarth, water, wind, and fire all conspired to produce a hellish catastrophe that lasted for a full five days and left Lisbon thoroughly annihilated. \r\n\r\nNicholas Shrady's unique account of this first modern disaster and its aftereffects successfully articulates the outcome of the earthquake-the eighteenth-century equivalent of a mass media frenzy giving rise to a host of other fascinating developments, such as disaster preparedness, landmark social reform, urban planning, and the birth of seismology.", "asin": "0143114603", "rank": "318265", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/51xnScSQoxL.jpg", "country": "Portugal", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}