{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 103, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I love all of Susan Vreeland's books.  A great way to learn about art and artists without the dull classroom."}, {"review_sentiment": 5.0, "review_text": "What an interesting writer!  and this is based on a real person's life!"}, {"review_sentiment": 5.0, "review_text": "Well documented fictional account of Emily Carr- a real artist-a woman who defied mores of the early 20th century and followed her dream to paint and document the physical beauty and ecology of the Pacific Northwest and the lives of its indigenous people.  Makes me want to see her paintings in person. Interesting study of a devoted and dedicated artist who gave her all for her passion!"}, {"review_sentiment": 3.0, "review_text": "This is a decent introduction to Canadian artist Emily Carr.  As many artists of that period, it was difficult for a woman to find standing in the art community. The misunderstandings that resulted from her interest in Canada's first people made her career even more of a challenge. Some of Vreeland's other books are better, but this carried me along and made me interested enough to learn more about Carr and her contemporaries."}, {"review_sentiment": 3.0, "review_text": "Fascinating woman, especially for the time. Writing is fine when descriptive but characters and dialog a bit wooden. Research shows, blocking the flow somewhat, although it's fascinating"}, {"review_sentiment": 5.0, "review_text": "good read, one of her best"}, {"review_sentiment": 5.0, "review_text": "Excellent narrative of the painter in the soggy NW."}, {"review_sentiment": 5.0, "review_text": "Auditory reading was excellent...have read the book before and the reading did it justice."}, {"review_sentiment": 4.0, "review_text": "I love Susan Vreeland's writing style! I only discovered this  particular one while for anything new she had written since The Luncheon of the Boating Party and Lisette's List. I'm so glad that I read this earlier book. It brought out such beautiful images and emotions to me. I think it is one of her best and will highly recommend it to friends!"}, {"review_sentiment": 5.0, "review_text": "I had never heard of this artist before I stumbled into the Forest Lover, and now I can hardly wait to get to see her work in person."}]}, "authors": ["Susan Vreeland"], "isbn": "0143034308", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Forest Lover", "word_cloud": "love great way learn art artist dull classroom interest writer base real person life well documented fictional account real woman defy more early century follow dream paint document physical beauty ecology live indigenous people want painting person study devote dedicated artist give passion decent introduction canadian artist many artist period difficult woman standing art community misunderstanding result interest first people make career even better carry make interested enough learn contemporary fascinate woman especially time fine descriptive character dialog bit wooden research show block somewhat fascinate good best excellent narrative painter soggy read excellent reading justice love write style discover particular anything new write glad earlier bring beautiful image emotion think best highly friend never hear artist stumble hardly wait see work person", "genres": ["Fiction & Literature", "Historical Fiction", "Women's Fiction"], "summary": "In her acclaimed novels, Susan Vreeland has given us portraits of painting and life that are as dazzling as their artistic subjects. \r\n\r\nNow, in The Forest Lover, she traces the courageous life and career of Emily Carr, who more than Georgia O'Keeffe or Frida Kahlo blazed a path for modern women artists. \r\n\r\nOvercoming the confines of Victorian culture, Carr became a major force in modern art by capturing an untamed British Columbia and its indigenous peoples just before industrialization changed them forever. \r\n\r\nFrom illegal potlatches in tribal communities to artists' studios in pre-World War I Paris, Vreeland tells her story with gusto and suspense, giving us a glorious novel that will appeal to lovers of art, native cultures, and lush historical fiction.", "asin": "0143034308", "rank": "109915", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51WfJZgPloL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}