{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 1663, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Great novel!"}, {"review_sentiment": 5.0, "review_text": "As is typical this is a well crafted novel."}, {"review_sentiment": 4.0, "review_text": "Tana French is one of my favorite writers - she pulls you in with great writing and great characters!! This book was no exception. Twists kept me guessing throughout, and I really cannot stress enough how great her characters are. You almost forget about the crime and that you want the killer found because you're so sure it can't be any of the characters you come to identify with so strongly."}, {"review_sentiment": 5.0, "review_text": "Another amazing book by Tana French"}, {"review_sentiment": 1.0, "review_text": "Is there another writer named “Tara French”?. I am being snarky here, of course, but after reading all her previous novels, about the Dublin Murder squad, I just had to ask this question. I will not give anything away for those that want to lose several hours of their life they will never get back. Just read all the other “1” ratings because that is exactly what I am going to echo myself. As soon as I got to the paranormal references, I quit. It was like putting the icing on a inedible cake! RARELY, do I not finish a book and I read daily. Like Danny Glover says in Lethal Weapon “I am too old for this s**t!"}, {"review_sentiment": 4.0, "review_text": "I didn't think I could enjoy a novel with teenagers front and center, but French writes about the complexities of the human heart and mind with such a range of issues and characters that you forget you're reading mystery novel."}, {"review_sentiment": 5.0, "review_text": "This book was given the least favorable review in the series by a literary critic.  Read the 1st 4 books and expected to be less impressed with book # 5, but this is definitely not the case.  I found the vivid description of settings, touching all the senses, to be as well written as her previous books. Character development  was great great...had a good take on all of the main players.  These books can be easily read in any order as they are only connected with the 'murder squad' as the thread, but I would love to see some more of these characters come back.  The timeliness of electronic devices and bullying and adolescents is unfortunately so prevalent today."}, {"review_sentiment": 1.0, "review_text": "I got much more enjoyment from reading these 1 star reviews than this boring book.Made it to page 300 and decided to stop wasting my time."}, {"review_sentiment": 3.0, "review_text": "This book would have been five stars if it were not for the language. It seemed like an excessive amount of bad language. As for the actual mystery, I loved it."}, {"review_sentiment": 5.0, "review_text": "I've loved all French's books in this series, and this one blew me away. Hard to pick a fav between this and Into the Woods, but I highly recommend The Secret Place! Twists and turns that I definitely didn't see coming. Wanted to sit down and read in one sitting once I got started, but life got in the way and it took me a few days."}]}, "authors": ["Tana French"], "isbn": "0143127519", "longitude": -6.2602732, "periods": ["2000s", "Recent Releases"], "title": "The Secret Place: A Novel", "word_cloud": "great typical well craft favorite writer pull great write great character exception twist keep guess really stress enough great character almost crime want killer find sure character identify strongly amazing french be writer name snarky course read previous novel squad ask question give anything away want lose several hour life never back rating exactly go echo soon get paranormal reference quit put ice inedible cake finish daily say old think teenager front center french writes complexity human heart mind range issue character forget read mystery give least favorable review series literary critic expect le impressed definitely case find vivid description setting touch sens well write previous development great great good take main player easily order connect squad thread see character come back timeliness electronic device bully adolescent unfortunately prevalent today get much enjoyment read star review bore page decide wasting time star language seem excessive amount bad language actual mystery love love french series blow away pick fab highly recommend turn definitely see come want sit sit get started life get way take day", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 5/5 in the Dublin Murder Squad Series\r\n\r\nIn this dizzyingly addictive novel, Detective Stephen Moran has been waiting for his chance to join Dublin’s Murder Squad when sixteen-year-old Holly Mackey arrives in his office with a photo of a popular boy whose body was found at a girls’ boarding school a year earlier. \r\n\r\nThe photo had been posted at “The Secret Place,” the school’s anonymous gossip board, and the caption says “I KNOW WHO KILLED HIM.” Stephen joins with Detective Antoinette Conway to reopen the case—beneath the watchful eye of Holly’s father, fellow detective Frank Mackey. \r\n\r\nWith the clues leading back to Holly’s close-knit group of friends, to their rival clique, and to the tangle of relationships that bound them all to the murdered boy, the private underworld of teenage girls turns out to be more mysterious and more dangerous than the detectives imagined.\r\n\r\n“An absolutely mesmerizing read. . . . Tana French is simply this: a truly great writer.” —Gillian Flynn", "asin": "0143127519", "rank": "18961", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51-XKseB0bL.jpg", "country": "Ireland", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}