{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 43, "rating": 3.9, "reviews": [{"review_sentiment": 2.0, "review_text": "Did not enjoy this book.  Too much violence for my taste.  Others may be less critical and have a different opinion."}, {"review_sentiment": 3.0, "review_text": "disappointed in the ending. seemed to drop the consequences of the shooting by the woman to the sheriff. don't understand why she stays after ;death of her husband."}, {"review_sentiment": 5.0, "review_text": "I am delighted with my purchase from you, It arrived in very good time and is in an excellent condition.  Thank you very much, I will happily purchase again sometime"}, {"review_sentiment": 2.0, "review_text": "Not the best book I ever read,I found it a bit repetitive and slow.Interesting insight into life in Trinidad and Tobego."}, {"review_sentiment": 3.0, "review_text": "The beginning and ending were reversed. I had to go re- read the beginning. Interesting to get a flavor of politics in Trinidad."}, {"review_sentiment": 5.0, "review_text": "Monique Roffey has an extraordinary ability to evoke a sense of place, time, and character.  Like Océan from Archipelago, the bicycle-riding woman will not be forgotten."}, {"review_sentiment": 4.0, "review_text": "Well written, interesting novel from the rare perspective of white middle class Trinidad from late 1950's. Covers important period in Trinidad history."}, {"review_sentiment": 5.0, "review_text": "This is not always an easy read. families and relationships are challenging. But this is so well written. It's hard to put down once you've started reading."}, {"review_sentiment": 3.0, "review_text": "The book has a great heroine and interesting supporting characters, but the history is only interesting if you are really interested in Trinidad."}, {"review_sentiment": 5.0, "review_text": "It is the 1950′s and Sabine and George Harwood are young newlyweds in England.  When George gets the opportunity of a life time from his employer to move to Trinidad, he jumps at the chance.  It an opportunity to make much more money than he can in England.  Knowing that it is only a three year contract, Sabine agrees and they move.George instantly falls in love with the life in Trinidad but Sabine is not comfortable there with both the heat and the racial segregation.  Sabine however does enjoy riding her green bicycle around the island.  In fact, it seems she is the only whiter woman there who rides a bike and becomes well know as the white  woman on the green bicycle by the natives.When a new leader takes over in Trinidad and England withdrawals, many people who came to work there from England return home but not George.  He is going to stay the entire three years but promises Sabine they will return to England.Sabine becomes very interested in the new political leader who give hope to the natives in Trinidad that big changes are coming.  However, even getting running water back in the slums doesn’t seem to happen.  Will there really be change for the people of Trinidad or is it promise of a corrupt political leader?50 years later George and Sabine are still in Trinidad.  George works at the newspaper and Sabine lives what appears to be a comfortable lifestyle.  However, with years of resentment coming to a head, will the couple be able to weather the storm?White Woman on Green Bicycle give the outsider a look into Post-colonial life in Trinidad both for the natives and the British who decide to stay.  The reader gets insight into the politics and how the natives live with unique and well fleshed out characters.  The writing is magnificent!"}]}, "authors": ["Monique Roffey"], "isbn": "0143119516", "longitude": 0.0, "periods": ["1900s", "2000s", "Recent Releases"], "title": "The White Woman on the Green Bicycle: A Novel", "word_cloud": "much violence taste critical different opinion disappointed end seem drop consequence shoot sheriff understand stay death husband delight purchase arrive good time excellent condition much happily purchase sometime not best ever find bit repetitive insight life beginning end reverse go begin flavor politics trinidad extraordinary ability evoke sense place time character forgotten well write interest rare perspective middle class late important period history always easy family relationships challenge well write hard put start reading great heroine interest support character history interest really interested young newlywed get opportunity life time employer move jump chance opportunity make much money year contract agree instantly fall love life comfortable heat racial segregation however enjoy rid bicycle island fact seem whiter rid becomes well bicycle new leader take withdrawals many people come work return home go stay entire year promise return becomes interested new political leader give hope native big change come however even get run water back slum seem really change people promise corrupt political leader year later still work newspaper live appear comfortable lifestyle however year resentment come head couple able weather storm outsider look life natives british stay get insight politics native live unique well fleshed character writing magnificent", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "A beautifully written, unforgettable novel of a troubled marriage, set against the lush landscape and political turmoil of Trinidad \r\n\r\nMonique Roffey's Orange Prize-shortlisted novel is a gripping portrait of postcolonialism that stands among great works by Caribbean writers like Jamaica Kincaid and Andrea Levy. \r\n\r\nWhen George and Sabine Harwood arrive in Trinidad from England, George is immediately seduced by the beguiling island, while Sabine feels isolated, heat-fatigued, and ill-at-ease. As they adapt to new circumstances, their marriage endures for better or worse, despite growing political unrest and racial tensions that affect their daily lives. But when George finds a cache of letters that Sabine has hidden from him, the discovery sets off a devastating series of consequences as other secrets begin to emerge.\r\n\r\n\"A rich and highly engaging novel.\" The Guardian ", "asin": "0143119516", "rank": "1015777", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/51Uo3Zvyj5L.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}