{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 52.5170365, "ratings": {}, "authors": ["Philip Kerr"], "isbn": "0143125133", "longitude": 13.3888599, "periods": ["1900s"], "title": "A Man Without Breath: A Bernie Gunther Novel", "word_cloud": "", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "From the national bestselling author of Prague Fatale, a powerful new thriller that returns Bernie Gunther, our sardonic Berlin cop, to the Eastern Front.\r\n \r\nBerlin, March, 1943. A month has passed since the stunning defeat at Stalingrad. Though Hitler insists Germany is winning the war, commanders on the ground know better. Morale is low, discipline at risk. Now word has reached Berlin of a Red massacre of Polish officers in the Katyn Forest near Smolensk. If true, the message it would send to the troops is clear: Fight on or risk certain death. For once, both the Wehrmacht and Propaganda Minister Goebbels want the same thing: irrefutable evidence of this Russian atrocity. To the Wehrmacht, such proof will soften the reality of its own war crimes in the eyes of the victors. For Goebbels, such proof could turn the tide of war by destroying the Alliance, cutting Russia off from its western supply lines.\r\n\r\nBoth parties agree that the ensuing investigation must be overseen by a professional trained in sifting evidence and interrogating witnesses. Anything that smells of incompetence or tampering will defeat their purposes. And so Bernie Gunther is dispatched to Smolensk, where truth is as much a victim of war as those poor dead Polish officers.\r\n \r\nSmolensk, March, 1943. Army Group Center is an enclave of Prussian aristocrats who have owned the Wehrmacht almost as long as they’ve owned their baronial estates, an officer class whose families have been intermarrying for generations. The wisecracking, rough-edged Gunther is not a good fit. He is, after all, a Berlin bull. But he has a far bigger concern than sharp elbows and supercilious stares, for somewhere in this mix is a cunning and savage killer who has left a trail of bloody victims.\r\n\r\nThis is no psycho case. This is a man with motive enough to kill and skills enough to leave no trace of himself. Bad luck that in this war zone, such skills are two-a-penny. Somehow Bernie must put a face to this killer before he puts an end to Bernie.", "asin": "0143125133", "rank": "180726", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51LK%2BDTbxML.jpg", "country": "Germany", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}