{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 59.938732, "ratings": {"num_ratings": 1649, "rating": 4.2, "reviews": [{"review_sentiment": 2.0, "review_text": "You know how some books and movies have really clever, interesting plots? Crime and Punishment isn't like that. The story is dull and predictable. The characters are unappealing. There are no laughs. I know a lot of people pretend to love it. These are the same people who pretend to love atonal music. Read it because it's an important classic, but do not expect to enjoy it or learn anything from it."}, {"review_sentiment": 5.0, "review_text": "I've never been so moved by a book... It gave me a different feeling. One I can't seem to grasp, but it truly is a work! I love how detailed of a writer Fyodor Dostoyevsky is. It felt more like I was actually there, experiencing everything, rather than just reading it."}, {"review_sentiment": 5.0, "review_text": "Came on time. Classic novel, paper back ok"}, {"review_sentiment": 4.0, "review_text": "It was a long book and took me longer to get through then I would have liked. I liked it."}, {"review_sentiment": 2.0, "review_text": "SO hard to get through this book, but I am glad now I can check it off my bucket list..."}, {"review_sentiment": 5.0, "review_text": "Tedious to the modern reader but deserves the acholade of being a major classic. Enjoyed Crime and Punishment and got many insights into life in mid-nineteenth century Russia: poverty, degradation of the masses; male attitudes to women (frequent references to beatings etc.,); theological and philosophical theories prevalent amongst the ruling classes - not too disimiliar from those as expressed amongst today's 'elite' thinkers! Very informative; thoroughly enjoyable. Now reading The Brothers Karamasev - just as  reviting."}, {"review_sentiment": 5.0, "review_text": "Interesting look into the initial stages of the thoughts and philosophy that led to the Russian revolution and ultimately the communist state."}, {"review_sentiment": 2.0, "review_text": "Multiple times on each page words run together so it is extremely hard to read. Spell checker is not new technology."}, {"review_sentiment": 3.0, "review_text": "I've had this in my ever increasing TBR mountain for ages and read this as part of a group read which brought the novel alive for me.Not my favourite classic I'm afraid. For this reader Raskolnikov's \"punishment\" did not equal the enormity of his\"crimes\" in this novel. Also felt that the secondary characters very much overshadowed Raskolnikov.Had no issues with the quality of this edition, or of the translation."}, {"review_sentiment": 5.0, "review_text": "Had to reacquaint myself with this novel which I read 50+ years ago. Dostoevsky must have been a tortured soul to create characters like Raskolnikov and Sonia. It took me ages and a lot of self discipline to read the whole saga. Undaunted I will now move on to “Notes from Underground”. FD is not for everybody but he is a tour de force writer as this 1st commercial success bears witness"}]}, "authors": ["Fyodor Dostoyevsky"], "isbn": "0143107631", "longitude": 30.316229, "periods": ["1800s"], "title": "Crime and Punishment", "word_cloud": "know movie really clever interesting plot story dull predictable character unappealing laugh know lot people pretend people pretend atonal music important classic expect enjoy learn anything never move give different feel grasp truly work love detailed writer felt actually experience everything rather read came time classic paper back ok long take longer get like so hard get glad check bucket list tedious modern deserves accolade major classic get many insight life century poverty degradation mass male attitude woman frequent reference beating theological philosophical theory prevalent ruling class dissimilar express among st today thinker very informative thoroughly enjoyable now read rivet interest look initial stage thought philosophy lead russian revolution ultimately communist state time page word together extremely hard checker new technology ever increase mountain age part group bring alive favorite classic afraid equal enormity crime also felt secondary character much overshadowed issue quality edition translation reacquaint year ago soul create character take age lot discipline whole saga undaunted move note everybody tour force writer commercial success bear witness", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "“A truly great translation . . . This English version . . . really is better.” —A. N. Wilson, The Spectator\r\n\r\nThis acclaimed new translation of Dostoyevsky’s “psychological record of a crime” gives his dark masterpiece of murder and pursuit a renewed vitality, expressing its jagged, staccato urgency and fevered atmosphere as never before. \r\n\r\nRaskolnikov, a destitute and desperate former student, wanders alone through the slums of St. Petersburg, deliriously imagining himself above society’s laws. But when he commits a random murder, only suffering ensues. \r\n\r\nEmbarking on a dangerous game of cat and mouse with a suspicious police investigator, Raskolnikov finds the noose of his own guilt tightening around his neck. Only Sonya, a downtrodden prostitute, can offer the chance of redemption.\r\n", "asin": "0143107631", "rank": "273743", "city": "St Petersburg", "image": "https://images-na.ssl-images-amazon.com/images/I/61ipY24HopL.jpg", "country": "Russia", "story_arc": ["Tragedy", "Things only get worse"]}