{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 27, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "When an antisemitic acquaintance accuses Asa Leventhal of ruining his life, the New York City Jew brushes off the accusation to focus on a recent family tragedy. But the gentiles in his life are quick to take his accuser's side, to the point where Leventhal begins to feel guilty and finds himself bending over backwards to help out a nemesis who continues to belittle him. It's a powerful look at gaslighting and the pervasive effects of antisemitism, no less relevant today than in the post-World War II era when the novel was first published."}, {"review_sentiment": 5.0, "review_text": "Saul Bellow, what can one say, an enduring scribe, compadre, with whom one is never done...."}, {"review_sentiment": 5.0, "review_text": "Asa Leventhal's wife is out of town.  He's on his own.  He works on a trade magazine in Manhattan and he's pretty secure there.  But some time ago, when he was out of work, he went to ask for a job on a different magazine.  A friend of a friend had recommended him.  This second man, Allbee, had made some very anti-Semitic remarks at a party that Asa attended.  At the interview, the boss dismissed Asa rudely.  Asa became aggressive and told him off.  Subsequently, Allbee lost his job and blamed Asa's behavior for the loss.  But he was an alcoholic and rather unstable.  A couple of years later, Allbee suddenly turns up, looking very seedy, and demands reparations.  At the same time, Asa's nephew is sick and probably dying--a kid who lives on Staten Island.  The father, Asa's brother, is down in Texas working.  The mother is suspicious of hospitals and doesn't bring the kid there till it's quite late.  Is she mentally unstable?  Asa's mother had died in a mental institution.  Allbee claims to be a victim, but he behaves like the Old Man of the Sea in the story of Sinbad.  Asa can't get shed of him. The kid is definitely a victim.  You can see that Asa could be a victim too.  He isn't sure whether Allbee has a point or not.  \"Illness, madness, and death were forcing him to confront his fault\" if he actually were at fault.  He asks two friends, but they give very ambivalent answers or don't see his dilemma.  In another of his novels of question and introspection, Bellow creates a masterpiece of subtle, varying emotion.  The characters (at this particular point in their lives) are full of ambivalence, but harbor strong feelings nevertheless.  THE VICTIM is a rich stew of philosophy and wondering in a most mundane story.  There is no sex or violence, yet the story grips you.  What about repentance and the wavering probability of change?  Should you repent for something which you feel was not your fault?  What do others think of your behavior?  Should you be concerned about this?  In Bellow's novels nothing has sharp edges.  In the end, was all that doubt necessary?  Brilliant."}, {"review_sentiment": 5.0, "review_text": "Saul Bellow's second novel 'The Victim' was published in 1947. He must have written it after news of the Holocaust reached North America. The protagonist, Asa Leventhal, is a mensch and feels guilty about the fate of his fellow Jews, although he can't speak it. Instead his thoughts overtake him and he has a  psychological  breakdown. This lasts about six weeks during a sweltering New York summer. The reader may understand Kirby Albee to be a real character but Bellow may have meant that Albee (I'll be) is an imagined alter ego. Albee has the exact opposite in looks and traits that Leventhal has, and Albee is also a gentile.  Leventhal's friends accept him while he is tormented by 'this man that comes around.' One friend says, 'Are you in your right mind?' 'You want to be two people?' These are hints that Albee may be a figment of Leventhal's imagination. The friends also know that his mother was insane.  Author Bellow is a master at describing all five senses to the reader in a concise style. You can feel the heat, hear the clang of the Staten Island ferry chains, etc. His book 'The Victim' is a must read for his precise descriptions, story telling, characters and perfection of the novel."}, {"review_sentiment": 5.0, "review_text": "One sultry summer in New York shortly after the end of the war, Asa Leventhal is left to his own devices when his wife, Mary leaves to tend to her mother down South. Asa is Jewish and writes for a trade magazine and is a self made man who has endured tough times but rose above them. During this hot, desultory time, Asa is accosted by an old, down on his luck acquaintance named, Albee. Asa is also helping, somewhat, to look after his brother's family while his brother works in another state. Max, the brother, has left behind two boys and his Italian wife, Elena. One of the boys is very sick and Asa takes ferry rides over to Staten Island to check on the family.It becomes apparent that Albee is following Asa. Albee blames Asa for his downfall and his firing from a job in which he put in a good word for Asa, but Asa got caught up in a heated argument with the boss and the boss subsequently fired Albee. Albee is a pain in the you know what. He stalks Asa with no mercy. He ends up in Asa's flat. All the while, Asa questions his own actions in the downfall of Albee. Neither man can get a handle on his own actions and each blames the other for their frustration. Asa's stems from the fact that he endures endless quibs from people who are prejudice against his race (such as Albee) and also from the fact that he feels guilty for his moderate success when people like Albee fall from grace or maybe, never really had a chance. Anyway, as far as I can see, neither man can never really own up and it becomes a comedy of sorts with each man doing a dance. Albee dances around Asa saying he owes him, and Asa dances around saying that Albee is driving him crazy. As the days wear on, the heat is intense and these two imbeciles keep up their dance until the breaking point.There is a lot of inner dialog in The Victim. Asa scrutinizes everything, especially his interactions with others-he is constantly questioning himself and other people in their meaning of a look, a gesture or in what they say-much like humans do every day. That is the appeal of this book and much of Bellow's writing. Bellow's writing is so dense that you really cannot skim or skimp, if you do, you'll be back pedaling to see what you missed. Writers of his talent are rare. I always enjoy reading his works. He includes a lot of details but the way he writes never bores me and I never skim or skip ahead no matter the description or detail.I thoroughly enjoyed this book and I could read it again. If you are new to Saul Bellow, you might be better off to start with Henderson The Rain King as this is one of Bellow's earlier works and doesn't appeal to all. Bellow's characters are life like, which is why he was a winner of so many awards, including the Nobel Prize. These honors are spot on, for Bellow is one of the best writers of the last century."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this book very much.  I am reading Saul Bellow in order, so this is my second Saul Bellow novel after \"Dangling Man\".  I have enjoyed both of these novels.  They are very different novels.  Dangling Man is composed in the form of diary entries.  The Victim is in a more traditional narrative form.  As far as The Victm, there were times I was completely gripped by the story.  I don't want to spoil anything for anyone who has not read the novel.  As I will explain below, there were times that I was sure that something dreadful was going to happen to either the protagonist, Leventhal, or his wife. At the same time, I cannot say I really liked Leventhal.I read a lot but have little formal education in literature.  Nothing more than the college intro to literature type course.  Having said that, this novel seemed \"Kafka-esque\" at times and, at times, reminded me of \"The Trial\" by Kafka.  I had read The Trial in the past.  The Trial is a very a disquieting story that constantly leaves the reader in a state of ambiguity.  The Trial was published in 1925.  Mr. Kafka comes from a family of Jewish tradition as does Saul Bellow.  This book, The Victim,  was written just after World War II and Kafka did suffer persecution by the Nazis.I did get the sense that Saul Bellow was allowing for the possibility of anti semitism as part of this novel.  But all of th anti semitism is inferred and could be denied.  I found that interesting in a different light.  This book was published in 1947.  In that same year, Laura C. Hobson published her very fine and very readable novel, \"Gentleman's Agreement\".  In this book anti semitism is often subtle and unspoken.  In that context, these two novels, published in the same year, reminded me of each other.As I said, in reading Kafka's The Trial, one is left in a state of ambiguity.  I could not understand why the protagonist was in trouble and he suffered a dreadful fate.  In reading this book, The Victim, I sensed the same ambiguity.  I could not determine the time frame setting for this novel. I found that disquieting.  I do not wish to spoil the story, but you will see that there is a certain associate of Leventhal who seems bizarre and to me, Kafka-esque.  Both protagonists in both novels seem to have their fates cast adrift and are subject to the whims of others.  As I continued to relate one novel to the other, I began to suffer dread for the fate of either the protagonist or his wife.  It was an eerie feeling.  That experience may be part of the reason I was so affected by this novel."}, {"review_sentiment": 5.0, "review_text": "A compelling read about a moral man and an aggrieved man, some would say a loser. How much do we owe our fellow man when he is down and out? No easy answers and Bellow gets as far as you can to the bottom of it."}, {"review_sentiment": 5.0, "review_text": "I can only marvel at writing like this. Bellow's eye for detail and ear for dialogue delighted me on every page. Meanwhile the plot, such as it is, or perhaps better spoken of as the theme, is so subtle, so hard to put into words (other than the book itself), that the book left me craving to compare notes with other readers. This is a book about anti-Semitism ... or is it? The title of the book seems to me wholly apt, even though it becomes ambiguous as the book proceeds: Who is the victim? This is a book about how human beings relate to one another -- on shifting sands. We are all a mystery to one another, and hence cannot know ourselves either. It is a book about the unsettling texture of everyday life.The ending of the book surprised me, and also pleased me. (I had been expecting the book to remain Kafkaesque.) I found this book delicious in every way. I see it spoken of as an early work by Bellow and not up to his best. Not having read any other Bellow, this is hard for me to believe."}, {"review_sentiment": 2.0, "review_text": "Written in that (in this case, tedious) classic style of the period, I must say it was just too much of the saccharine drama for me. Thomas Dixon is an earnest writer but is a hagiographer rather than a biographer."}, {"review_sentiment": 5.0, "review_text": "Very happy with this product.  The intense creativity that is inherent in the prose of Saul Bellow is a tremendous joy."}]}, "authors": ["Saul Bellow"], "isbn": "0143106104", "longitude": 0.0, "periods": ["1900s"], "title": "The Victim", "word_cloud": "antisemitic acquaintance accuses ruin life brush accusation focus recent family tragedy gentile life quick accuser side point begin guilty find bend backwards help nemesis continue powerful gas lighting pervasive effect antisemitism le relevant today era first publish say endure scribe compare never do wife town work trade magazine pretty secure time ago work go ask job different magazine friend friend recommend second man make remark party attend interview bos dismiss rudely become aggressive told lose job blame behavior loss alcoholic rather unstable couple year later suddenly turn look seedy demand reparation time nephew sick probably die kid life father brother work mother suspicious hospital bring kid till quite late mentally unstable mother die mental institution claim behaves story shed kid definitely see sure point madness death force confront fault actually fault ask friend give ambivalent answer see dilemma novel question introspection create masterpiece subtle vary emotion character particular point live full ambivalence harbor strong feeling nevertheless rich stew philosophy wonder mundane story sex violence yet story grip repentance waver probability change repent something fault others think behavior novel nothing sharp edge end doubt necessary second publish write news reach protagonist mensch feel guilty fate fellow instead thought overtake psychological breakdown last week swelter summer real character imagine alter ego exact opposite look trait also gentile friend accept torment man come friend say right mind want people hint albee imagination friend also know mother insane master describe sens concise style feel heat hear clang ferry chain description story tell character perfection sultry summer shortly end war leave device wife leave tend mother write trade magazine self make man endure tough time rise hot desultory time accost old luck acquaintance name also help somewhat brother family brother work state brother leave boy italian wife boys sick take ferry ride check become apparent follow blame downfall fire job put good word get catch heat argument bos bos subsequently fire pain know stalk mercy end flat question action downfall man get handle action blame frustration stem fact endure endless quin people prejudice race also fact feel guilty moderate success people fall grace maybe never really chance far see man never really become comedy sort man dance dance say owes dance say drive crazy day wear heat intense imbecile dance breaking lot inner dialog scrutinize everything especially interaction constantly question people mean look gesture human day appeal much write write dense really skim skimp back pedal see miss talent rare always enjoy read work include lot detail way write never bore never skim skip ahead matter description thoroughly enjoy new earlier work appeal character life winner many award include honor spot best writer last century enjoy much read order second enjoy novel different novel dangle compose form diary entry traditional narrative form far time completely grip story want spoil anything anyone explain time sure something dreadful go happen protagonist wife time say really like lot little formal education literature college intro literature type course say seem time time remind disquiet story constantly leave state ambiguity publish come family jewish tradition write suffer persecution get sense allow possibility anti semitism part ht anti semitism infer find interest different light publish year publish fine readable anti semitism often subtle unspoken context novel publish year remind say read one leave state ambiguity protagonist trouble suffer dreadful fate read sense ambiguity time frame setting find disquiet wish spoil story see certain associate seem bizarre protagonist novels seem fate cast adrift subject whims others continue begin suffer dread fate protagonist wife eerie feel experience part reason affect compelling moral man aggrieve man much owe fellow man easy answer get far bottom marvel write eye detail ear dialogue delight page meanwhile plot perhaps better spoken theme subtle hard put word leave crave compare note reader title seem wholly apt even becomes ambiguous proceeds human being relate shift sand mystery hence know unsettling texture everyday end surprised also please expect remain find delicious way see spoken early work best not hard believe case tedious classic style period much saccharine drama earnest writer hagiographer rather biographer very happy product intense creativity inherent prose tremendous joy", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "\"The best novel to come out of America-or England-for a generation.\" —V.S. Pritchett, The New York Review of Books \r\n\r\nIn this unique noir masterpiece by the incomparable Saul Bellow, a young man is sucked into the mysterious, heat-filled vortex of New York City. Asa Leventhal, a temporary bachelor with his wife away on a visit to her mother, attempts to find relief from a Gotham heat wave, only to be accosted in the park by a down-at-the-heels stranger who accuses Leventhal of ruining his life. Unable to shake the stranger loose, Leventhal is led by his own self-doubts and suspicions into a nightmare of paranoia and fear.", "asin": "0143106104", "rank": "751924", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41%2BsqRtulCL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}