{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 77, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Tragic and funny, wonderful writing from a bad bad place.Should be read by anyone visiting Haiti today."}, {"review_sentiment": 5.0, "review_text": "Now for the latest edition of \"Graham Greene's Journeys Into Unpleasant Places\"!  Its not much of a secret that for one reason or another he was fairly well-traveled and while maybe some of these locales weren't totally his idea, I get the feeling that a large number of them were and so you have to wonder how much of a glutton for dangerous adventure he was.  It takes a special person to subject himself to an oppressive regime and think, \"Gosh, this will sure be fun when I make some fictional characters are miserable as I am.\"This episode takes us to Haiti, with a premise that starts out as a kind of strange joke, where a hotelier, a vegetarian Presidential candidate and a con-man all get on a ship together.  Brown, the hotelier, is heading back to look into his hotel, which he's sure is doing well once the brochures get around to leaving out all the people getting murdered in the streets.  Smith is the candidate and he and his wife are looking into starting a vegetarian center, which is one of those things that seems like a good idea only when there's no one around to tell you its a bad idea.  Jones is the con man and like every con-man ever he's super-personable and tells great stories that sound awesome in the telling but tend to have suspiciously vague details when you think hard about them.  All of them are heading for wacky hijinks, the kind that only flourishing dictatorships can provide.Greene does a first person narration this time out and definitely picks the right voice in having Brown tell us the tale.  A man with a semi-awkward past, he's also cynical as all heck and perhaps doesn't care about keeping his own skin intact as much as he should.  His dealings with the Tonton Macoute (essentially a brutal secret police that forget it was supposed to be secretive) are fraught with scenes where you fully expect him to get shot in the face, as he does his best Philip Marlowe impression and either believes he's invincible or figures that the men who routinely kill everyone else if they look at them wrong are just bluffing.  He's our weather-beaten tour guide for this trip and his \"seen this before\" attitude to pretty much everything (up to and including dead bodies in pools) makes him frustrating to deal with on a personal level but a lot of fun to read, as his ability to care about other human beings seems to have been cauterized at some point.The plot, meanwhile, centers around the antics of the often absent Jones as he plays with fire with the singular focus of an amphetamine user attempting to solve a Rubik's Cube, somehow convinced he's going to always come out on top like Bugs Bunny or just being very, very lucky.  In between the stretches of Jones shoving the plot to the next waypoint, we get a decent ground level view courtesy of Greene of what it was like to live during the regime of Francois Duvalier (apparently called \"Papa Doc\" as if disguising callous brutality with a cute nickname somehow makes it go down easier), which like any other dictatorship ever is an ongoing horror show with no chance that the credits are going to roll any time soon.  Due to being British he gets insulated from the worst of it to some extent but its clear very early on that the foreigners are all bystanders to a alarmingly rising body count that they can't do anything about as the regime backed by the Tonton Macoute basically does whatever it wants.These scenes depicting not only living there but the messy politics involved in tolerating Duvalier (anti-Communist, it seems like the US held their noses because the island acted as a buffer against Cuba) are where the novel was most interesting for me, as the Brown, no stranger to Haiti himself, discusses the ins and outs of existing here without being crushed by it entirely or resisting it without getting killed.  Its a dark read in that disgust and cynicism practically drip off the page from Brown's narration.  His dream of running a grand hotel pretty much ruined by a mass murderer with the title of president, all he can think of is getting out.Being that our view is mostly of how bad the situation was at the time (Duvalier didn't take too kindly to how the island was portrayed as a place where hope had left on the last boat out of town and went to the trouble of having his Ministry of Foreign Affairs issue a brochure that was basically an exercise in discovering how many insulting terms they could use to describe Greene) the plot doesn't have the same drastic inevitability that more well known Greene novels like \"The Heart of the Matter\" do.  We're left watching Brown navigate an affair with the German wife of the Uruguay ambassador (I don't think I've ever seen two single people have a romance in a Graham Greene novel), which helps humanize our  narrator even if it doesn't always show him in the best light (their fights do feel realistic in a way that he doesn't always manage).  Greene doesn't weave the intersections of our three principals as much as the beginning of the novel suggests it might (Smith ultimately hardly figures into the book's climax at all) and its clear that the antics of the particulars are really excuses to give us as realistic a view as he can of the unpleasantness of Haiti.  It makes for a book where the menace always bristles off-screen, where hope is scarce (or nonexistent) and for the people involved only a scant few options: get out while you can, adapt to a world that doesn't care if you do, or flare out in the midst of your own transformation.  If there's any scant comedy to be found in the book, its watching these people come up to the solid wall that is Duvalier's regime, size it up and then attempt to run through it full-tilt.  That they can't isn't the funny part, unless you like your jokes served cruel.  Its that even if they do make it through, they're only going to find another wall and they'll discover in how they react that the best comedy tells us more about ourselves than it does about the person telling the joke."}, {"review_sentiment": 5.0, "review_text": "I began it before going to and finished it in, Haiti"}, {"review_sentiment": 4.0, "review_text": "Graham Greene was a prolific English novelist of thrillers, essays, travel journals, and other works, several of which became movies and ended up on the list of books you should read in high school. This particular book became a 1967 movie starring Richard Burton as Brown, our narrator, with Elizabeth Taylor as the diplomat's wife and Brown's lover, Peter Ustinov as the diplomat, and Alec Guinness as Jones.The movie received mixed reviews, and I was interested in the book to see what it might have to add. With most of the Burton/Taylor dramas being more exciting off the screen, I'd have to say that the movie is true to that algorithm. The book is well written and does provide interesting background about Haiti in the sad time of Papa Doc; so much so that Greene was labelled by Papa Doc's government, as a result of the publication of this book, as a \" liar, a cretin, a stool-pigeon... unbalanced, sadistic, perverted... a perfect ignoramus... lying to his heart's content... the shame of proud and noble England... a spy... a drug addict... a torturer.\" (sourced from Wikipedia.)The comedians are the seemingly faceless - due to their names - Brown, Jones, and Smith, who each react in different ways to the political environment that permeates every walk of life in Haiti. We meet them as they are en route to Haiti, Brown to see his mother and take care of his hotel, Smith to develop his vegetarian society, and Jones - well, we're not very sure about Jones. And it's Jones that provides the most interest and creates tension. A bit slow moving, but nicely written, and interesting."}, {"review_sentiment": 5.0, "review_text": "Our main character is a world weary drifter. The novel starts with him returning to Haiti on a cargo ship with just a handful of passengers. There are so few Europeans in Haiti that all these passengers and some of the crew enter the story again. Disengaged from his courtesan mother and even unsure what his last name really is, he has worked in European restaurants and sold forged low-end paintings. His mother dies and leaves him a hotel/cabaret in Port-au-Prince. He attempts to run the hotel and has an affair with a South American ambassador’s wife who is obsessed with her child. He ruins the affair with his jealousy.The real story is the brutality of the Haitian dictatorship.  Despite the blatant brutality of their regimes, the US supported the Haitian dictators “Papa Doc” Duvalier from 1957-1971, and his son, “Baby Doc,” until 1986, because they were anti-communist. This was the time after Castro’s takeover of Cuba.Key figures in the story are the Tontons Macoute, perhaps the original “Men in Black.” They are the ‘police’ who run the country; basically terrorist authorized to kill, rape, torture and steal. The drive around in US military style jeeps and they all wear cheap sunglasses. They are the KGB and the SAVAK of Haiti. (I have known folks from the Caribbean who are visibly upset when the term “Tontons” is mentioned.) More people die in this book than in a typical Friday the 13th horror movie.The phones don’t work; electricity is intermittent; no one travels at night for fear of the Tontons; the capital city is a shantytown; school kids are rounded up to watch executions in the park. The country is thoroughly corrupt.  (The book was published in 1965. I found it in a used bookstore and in the back was a clipping of a NYT article from 1982 about how half the food aid being sent to Haiti was stolen and diverted into the black market. I thought, ‘Only half?’)A very naïve couple from the US, promoters of vegetarianism, serve as foils for the events. The husband is always referred to as “the Presidential candidate” because he ran against Truman and got a few votes as one of those numerous also-rans. So we have the black humor of conversations about goings-on in Haiti which begin literally as soon as the main character arrives back at his hotel and within minutes finds the body of a government minister in his pool.“They can’t make it out to be anything but suicide,” I said. “They can make it out to be whatever suits them.”“Has he seen a lawyer?” “That’s not possible here. The police wouldn’t allow it.”“A witness here can suffer just as much as the accused.”“What is the charge?” “There won’t necessarily be a charge.”“The minister said he was a Haitian and he could do what he liked with a Haitian.”“The police may exceed their instructions.”If someone is silly enough to ask about things such as ‘bail’ or a ‘warrant,’ the police laugh and pretend not to understand. (Or genuinely do not understand.)The main theme of this novel, from which the title derives, is this: a few people have a purpose in life. They are dedicated to a cause, committed to some purpose; they have dedication, courage and integrity. They might be Catholics or communists or, like the husband-wife team in the story, even vegetarians. But they have something. The rest are comedians. The main character admits to being a comedian. In early conversation on the ship one of the other characters speaks of the same idea, calling the people with purpose tofts, and the comedians, tarts. Here’s a great quote from a priest at a funeral; he’s obviously not a comedian (spoken in the Dominican Republic; he would not dare say this in Haiti):“…our hearts go out in sympathy to all who are moved to violence by the suffering of others. The Church condemns violence, but it condemns indifference more harshly. Violence can be the expression of love, indifference never. One is an imperfection of charity, the other the perfection of egoism.”This is Graham Greene, so obviously we expect excellent writing. A few examples:“He was only half way through his own story and he had no audience left: he resembled a sea-lion who has dropped his fish.”“He knew as many intimate things as a prostitute’s dog.”“’There’s a rendezvous I have to keep,’ I told her without knowing that I spoke the truth.”“…his teeth were very big and white and separate, like tombstones designed for a much larger cemetery. A curious smell crossed his desk as though one grave had stayed open.”Talking about religion:“I remember now. I used to think you were nothing.”“I am nothing.”“Yes, but a Protestant nothing, not a Catholic nothing. I am a Protestant nothing.”Other novels I have read about Haiti all portray the same tragic story such as The Kingdom of this World by Alejo Carpentier and Love, Anger, Madness by Marie Vieux-Chauvet. Feast of the Goat by Mario Vargas Llosa is about the kindred spirit of the brutal dictator Trujillo around the same time as the Docs in neighboring Dominican Republic, with which Haiti shares its island."}, {"review_sentiment": 5.0, "review_text": "I don't always agree with the author's political positions, but his writing borders on the perfect and his storytelling is equally good. The Comedians is like all other Greene books I've read - atmospheric, dark, deep, clearly narrated and riveting. You can feel the fear and the weather too.On the flip side, the movie version of this book was an unwatchable mess."}, {"review_sentiment": 4.0, "review_text": "This one starts off a little slowly, and as I reached the end of the first chapter, I started to think it might be the first Graham Greene novel I wasn't going to like. I'm glad I stuck with it. This book builds quietly and subtly, and in the end has tremendous power, portraying tragedy on the scale of both the individual and the nation.The title, \"The Comedians,\" refers to the role the characters Brown and Jones see themselves playing in a world gone awry, in which they can depend on nothing. They see themselves as comic actors in a farce. The tragedy of Brown, the main character who owns a hotel in Haiti, is that he is unable to love or trust, even when love and trust are freely offered to him. The tragedy of Jones is that he may one day be called to be the person he pretends to be, and he is always pretending, just to get by. The tragedy of the third major character, Smith, is that he is blinded by his ideals, which are so clear and sensible to him, he thinks that merely presenting them to others will be enough to persuade them.Brown's lover, Martha Pineda, is too strong, too practical, and too aware, to be an entirely tragic figure. She understands the world, and is able to navigate it. You have the sense she'll be able to take care of herself, but still, you wish something better for her.The real victims are the people of Haiti, who are powerless and hopeless under the profoundly destructive rule of \"Papa Doc\" Duvalier. Greene does an excellent job of evoking the horrors of totalitarian dictatorship in the third world. This book is an interesting counterpart to Orwell's \"1984.\" Greene is aware of the farcical elements of totalitarianism, and of how damaging they can be to the people of an impoverished, subjugated nation."}, {"review_sentiment": 5.0, "review_text": "Re read this and another book by Mr. Greene, he was one of the best writers of his time and it is very very enjoyable to read one of his books today.  The book is great, the writer is great, what more can you ask for...."}, {"review_sentiment": 3.0, "review_text": "It gave a god picture of conditions in Hati inthe books time frame.  If ound the story rambling."}, {"review_sentiment": 5.0, "review_text": "My second Greene novel and i'm addicted; his style is inimitable; confirmed by the supposed fact he once came second in a national competition to compose a short story in the manner of Graham Greene. Anyway, back to the book itself.The Comedians is possibly best described as a slow burner; there're no huge, breath-taking action scenes but that by no means equates to being dull. The dialogue is gorgeous; written in first-person for the most part, and the characters, as always are very well formed. Set in trouble-torn Haiti - has it ever been intact? we're introduced to the main character who has almost led a nomadic life until fortune, good or otherwise, brings him to the Caribbean where he becomes owner/manager of a once impressive hotel.Papa Doc, the infamous dictator and his regime run by the fearsome Tonton Macoute provide a brooding, often threatening setting for our cast. The story twists through illicit affairs; oppression; fraudsters; angst and light humour - a rare brew but it works.Not a quick read so perfect for a week away but before you purchase maybe quickly review the cast of the original movie production so you may place them in context if you enjoy that kind of thing."}]}, "authors": ["Graham Greene"], "isbn": "0143039199", "longitude": 0.0, "periods": ["1900s"], "title": "The Comedians", "word_cloud": "funny wonderful write bad bad anyone visit today now latest edition place much secret reason fairly maybe locales totally idea get feel large number wonder much glutton dangerous adventure take special person subject oppressive regime think sure fun make fictional character miserable episode take premise start kind strange joke hotelier vegetarian candidate get ship together hotelier head look hotel sure well brochures leave people get murder street candidate wife look start vegetarian center thing seem good idea tell bad idea con man ever tell great story sound awesome tell tend suspiciously vague detail think hard head wacky hi jinks kind flourish dictatorship first person narration time definitely pick right voice tell man past also cynical heck perhaps keep skin intact much dealing essentially brutal secret police forget suppose secretive fraught scene fully expect shot face best impression believe invincible figure men routinely kill everyone else look wrong bluffing tour guide trip see attitude pretty much everything include dead body pool make frustrate deal personal level lot fun ability care human being seem cauterize plot meanwhile center antic often absent play fire singular focus amphetamine attempt solve somehow convince go always come top lucky stretch shove plot next way point decent ground level view courtesy live regime apparently call disguise callous brutality cute nickname somehow make go easier dictatorship ever ongoing horror show chance credit go roll time soon get insulate worst extent clear early foreigner bystander alarmingly rise body count anything back basically scene depict live messy politics involve tolerate seem hold nose island act buffer interest stranger discuss in exist crush entirely resist get kill dark disgust cynicism practically drip page narration dream run grand hotel pretty much ruin mass murderer title president think get view mostly bad situation time kindly island portrayed place hope leave last boat town go trouble issue brochure basically exercise discover many insulting term describe plot drastic inevitability well know novel leave watch navigate affair german wife ambassador think ever see single people romance help narrator even always show best light fight feel realistic way always weave intersection principal much begin suggests ultimately hardly figure climax clear antic particular really excuse realistic view unpleasantness make menace always bristle hope scarce nonexistent people involve scant option get adapt world care flare midst transformation scant comedy find watch people come solid wall regime size attempt run part joke serve cruel even go wall discover react best comedy tell person tell joke begin go finish prolific novelist thriller essay travel journal work several become movie end list high school particular become movie star narrator diplomat wife lover diplomat movie receive mixed review interest see drama excite screen say movie true algorithm well write provide interest background sad time much label government result publication liar cretin unbalanced sadistic pervert perfect ignoramus lie heart content shame proud noble spy drug addict torturer source seemingly faceless due name different way political environment permeates walk life meet en route see mother care hotel develop vegetarian society well sure provide interest create bit slow move nicely write interesting main character world weary drifter start return cargo ship handful passenger passenger crew enter story courtesan mother even unsure last name really work european restaurant sell forge painting mother die leave attempt run hotel affair american ambassador wife obsess child ruin affair real story brutality dictatorship blatant brutality regimes support haitian dictator son time takeover figure story perhaps original police country basically terrorist authorize kill rape torture steal drive military style jeep wear cheap sunglass know folk visibly upset term mention more people die typical horror phone work electricity intermittent travel night fear capital city shantytown school kid round watch execution park country thoroughly corrupt publish find use bookstore back clip article half food aid send stolen divert black market think only nave couple promoter vegetarianism serve foil event husband always refer presidential candidate run get vote numerous black humor conversation literally soon main character arrive back hotel minute find body government minister make anything suicide say make whatever suit see lawyer possible police witness suffer much charge necessarily minister say police someone silly enough ask thing bail warrant police pretend understand genuinely understand main theme title derive people purpose life dedicate cause commit purpose dedication courage integrity communist team story even vegetarian something rest main character admits comedian early conversation ship character speak idea call people purpose tot tart here great quote priest funeral obviously comedian speak heart go sympathy move violence suffer others condemns violence condemns indifference harshly expression love indifference never imperfection charity perfection obviously expect excellent write example half way story audience leave resemble drop know many intimate thing prostitute rendezvous keep tell know speak teeth big white separate tombstone design much larger cemetery curious smell cross desk grave stay religion remember use think yes protestant nothing nothing protestant other novel haiti portray tragic story kindred spirit brutal dictator time neighbor share island always agree author political position write border perfect storytelling equally good atmospheric dark deep clearly narrated rivet feel fear weather flip side movie version unwatchable mess start little slowly reach end first chapter start think first go glad stick build quietly subtly end tremendous power portray tragedy scale individual title refers role character see play world go awry depend nothing see comic actor farce tragedy main character own hotel unable love trust even trust freely offer tragedy day call person pretend always pretend tragedy third major character blind ideal clear sensible think merely present others enough persuade strong practical aware entirely tragic figure understand world able navigate sense able take care still wish something better real victim people powerless hopeless profoundly destructive rule excellent job evoke horror totalitarian dictatorship third world interesting counterpart aware farcical element totalitarianism damage people impoverish subjugated nation best writer time enjoyable today great writer great ask give god picture condition in the time frame sound story ramble second addict style inimitable confirm suppose fact come second national competition compose short story manner back possibly best describe slow burner huge action scene mean equates dialogue gorgeous write part character always well form ever intact introduce main character almost lead nomadic life fortune good otherwise bring becomes impressive infamous dictator regime fearsome provide brood often threaten set cast story twist illicit affair oppression fraudsters angst light humor rare brew quick perfect week away purchase maybe quickly cast original movie production context enjoy kind thing", "genres": ["Fiction & Literature"], "summary": "Three men meet on a ship bound for Haiti, a world in the grip of the corrupt “Papa Doc” and the Tontons Macoute, his sinister secret police. Brown the hotelier, Smith the innocent American, and Jones the confidence man—these are the “comedians” of Greene’s title. \r\n\r\nHiding behind their actors’ masks, they hesitate on the edge of life. They are men afraid of love, afraid of pain, afraid of fear itself...", "asin": "0143039199", "rank": "114026", "city": "Haiti", "image": "https://images-na.ssl-images-amazon.com/images/I/51mjLr9qKTL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}