{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 434, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I thought this book was keep you reading all night good."}, {"review_sentiment": 3.0, "review_text": "This book is a price winner in the Louis Kincaid series but I liked it much less than the later one (Island of Bones (Louis Kincaid Book 5) ). The story starts with Louis arriving into small Michigan town to take a new job as policemen. Authors did a great job in describing the atmosphere of the region. The constant cold, the snow, the vast uninhabited areas, the frozen lake and the isolation of people living there made me almost shiver. The plot was a little bit predictable, it was easy to guess who the villain was and why but the details were still interesting. What I did not like about this book was that almost everybody was pissed off at everybody else for not always obvious reason. So much anger and aggression and only some of it justified. It left me depressed and tired rather than entertained or even just involved."}, {"review_sentiment": 5.0, "review_text": "What a page turner. This is the best one I've read in the series."}, {"review_sentiment": 5.0, "review_text": "Great story, great writing!"}, {"review_sentiment": 4.0, "review_text": "Loved this book. I found the characters to be engaging, although Louis Kincaid himself is a little on the bland side in my opinion, especially as the lead character in a book series. But the plot made up for a lot. It wasn't predictable or hard to follow, and I appreciated that it wasn't too neatly tied up in the end."}, {"review_sentiment": 4.0, "review_text": "Slow to start with, and although I enjoy development of main characters, this was overwhelming and overdone.  The love affair was not  needed.  It had no real purpose. It also  did not ring true.  The end though was excellent, so I was able to finish the book.  otherwise I felt an incessant urge to not waste my time."}, {"review_sentiment": 4.0, "review_text": "A good read that held my interest. However, from his first introduction, I suspected and was right about who the main villain was"}, {"review_sentiment": 3.0, "review_text": "This book was an average read.Not the keep you on the edge book"}, {"review_sentiment": 4.0, "review_text": "We know that some people have all the bad luck through no fault of their own and other people are, well, getting away with murder. This is a good series no matter what order I have read the books. Personally I would have liked more closure in this book but there never is closure when injustices prevail, is there?"}, {"review_sentiment": 5.0, "review_text": "Another decade has passed and we now find John Madden 20 years past the first book a farmer with a son off to war.  Sinclair is sticking around until the war ends and new men can come to the Yard.  This time a farm hand of John's is murdered in London on a weekend trip to visit an aunt and many old dark stories come to light.  John takes a special interest in seeing the case resolved as he feels a sense of responsibility for the dead girl, but as usual a dark twisty criminal is at the heart of the novel.  Somehow the book taking 3 books to get 20 years ahead doesn't lose reader attention even though you read it for the characters missing huge swathes of life is not a problem.  Wonderful writing."}]}, "authors": ["Rennie Airth"], "isbn": "0143117246", "longitude": -0.12574, "periods": ["1900s", "Recent Releases"], "title": "The Dead of Winter: A John Madden Mystery", "word_cloud": "think reading night good price winner series like much le later story start arrive small town new job policeman great job describe atmosphere region constant cold snow vast uninhabited area freeze lake isolation people live make almost plot little bit predictable easy guess villain detail still interest like almost everybody piss everybody else always obvious reason so much anger aggression justify leave depressed tired rather entertain even involve page turner best series story great writing love find character engage little bland side opinion especially lead character series plot make lot predictable hard follow appreciate neatly tie end slow start enjoy development main character overwhelm love affair need real also ring true end excellent able finish otherwise felt incessant urge waste time good held interest however first introduction suspect right main villain average keep edge know people bad luck fault people well get away murder good series matter order personally closure never closure injustice prevail decade pass year first farmer son war stick around war end new men come time farm hand murder weekend trip visit aunt many old dark stories come light take special interest see case resolve feel sense responsibility girl usual dark twisty criminal heart take year ahead lose attention even character miss huge swathe life problem writing", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "\"[Rennie Airth's] meticulously detailed procedural mysteries are beautifully written . . . well worth reading, and rereading.\"—Marilyn Stasio, The New York Times Book Review \r\n\r\nRennie Airth's The Death of Kings will be available from Viking in January 2017. \r\n\r\nOn a freezing London night in 1944, Rosa Novak is brutally murdered during a blackout. Scotland Yard suspects the young Polish refugee was the victim of a random act of violence and might have dropped the case if former police investigator John Madden hadn't been her employer. Madden feels he owes it to Rosa to find her killer and pushes the investigation, uncovering her connection to a murdered Parisian furrier, a member of the Resistance, and a stolen cache of diamonds. \r\n\r\nDelivering the atmospheric writing and compelling characters that have already established Rennie Airth as a master of suspense as well as style, this long-awaited third installment in the John Madden series is historical crime writing at its best.", "asin": "0143117246", "rank": "151252", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41axFjxjVdL.jpg", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}