{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 322, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "A  far better read than most of Hemingway's novels and truer to the reality. Greene lived it. Read it for a sense of French occupied Viet Nam in the 1950s but also for the cleverly twisted morality that runs through the book like a water main break."}, {"review_sentiment": 2.0, "review_text": "It's a great story, but the reading and recording is poor. Volume spikes and the reader's accent is annoying. This book has English, French and a bit of Vietnamese and the readers French and Vietnamese are horrible. There are no pauses where there should be, especially between the different characters speaking."}, {"review_sentiment": 5.0, "review_text": "If only Presidents Eisenhower, Kennedy, Johnson, and Nixon had read this prophetic novel before committing hundreds of thousands of American men and women to the breach of Vietnam. It was a rich man’s war fought by poor kids exacerbated by myopia and exercised to satiate four presidents’s hubris. The 55,800 words of Greene’s novel could have saved countless American and Vietnamese lives."}, {"review_sentiment": 5.0, "review_text": "All is fair in love and warThis truly awesome 1955 novel starts during the Korean War but is situated in French Indo-China, in particular in Vietnam, which struggled  towards independence in a disorganised, almost ‘medieval’ way, full of competing warlords with double agendas, lumped together by US observers as Communists. The reporter about this sideshow is Fowler, an elderly, cynical British news hack with issues back home and excellent local contacts,  incl. French colonial officials. He also maintains a beautiful, young girlfriend, Phuong.The quiet American is Pyle, young, shy and naive, a virgin in almost everything, a fresh recruit to the massive US economic advisory mission operating from Saigon. Phuong’s matchmaking sister Hei dislikes Fowler. Phuong leaves him and moves in with Pyle. Not long after, Pyle is found dead (with mud in his lungs) near a riverside restaurant, fifty meters from where Fowler has dinner.These are the bare bones of a Shakespearian tragedy involving millions of Vietnamese and ethnic Chinese, the French colonial administration and army, a contingent of US secret agents and neutral bystander Fowler (first name Thomas as in ‘Doubting Thomas’): selfish, unwilling and unable to commit himself to any creed or ideology, respectful of local hardship and suffering, sometimes wishing for death, sometimes crying out for help from the entity he does not believe in.Pyle is a man of faith, trying to further democracy under the guise of a Third Way, protecting Vietnam from communism whilst undermining colonial rule by starving the French of weapons and supplying dissidents with materials to make IEDs. He saves Fowler’s life in extreme circumstances; their discussions are searing because of their differences in worldview, ambitions and hopes, or lack thereof.“The Quiet American” took Graham Greene (1904-91) three years to write. He was short-listed for the Nobel Prize for Literature in 1966 and -67, inauspicious years given the US’ then-mounting involvement in Vietnam. Reading it late in 2017, seeing Caodaism the colourful, mixed  religion he briefly described on TV today, my humble verdict is: fresh as never before, a work of great scope and brilliance, a true classic, a must read."}, {"review_sentiment": 3.0, "review_text": "War mixes everything up. Or maybe everything is already mixed up and war just jumbles it around. Love and lust and vulnerability; ambition and power and youth. Ideologies and instincts, all shaken together and served upon a platter before a backdrop of steamy jungles or quiet dehydrated mountains in the third world.War is a third world affair; it has been now for generations. Theaters collapsed in upon themselves; fire-bombed towns; grand old cities occupied by crisply dressed soldiers drinking Champagne and dancing with elegant ladies dressed in white – concentration camps filled with the college educated, those were the wars of our grandfathers. Our wars, the wars that our fathers started are the wars of villagers against peasants – the under-trained against the poorly armed. Child soldiers with bloodshot eyes pointing an AK-47 at a passing car; an explosion planted in a market to kill vendors sitting cross-legged in front of a pile of dried fish. With an occasional drone strike to accent the difference, making it somehow absurd.The Quiet American is about this kind of war – war in third world Asia, Vietnam specifically. Rice farmers fighting street thugs. It is the story of a journalist and his love for a local girl which brings him into competition with a naïve young American. It’s a simple book – a simple story. Perhaps too simple, but well-enough written to elicit emotion.I made common cause, because we all know the types – those of us who know modern wars. Four of them, I think, for me – the wars I have known. The camps full of fly-covered children, bodies heaped in a pile as their blood drains into a small river seeking an exit. The jaded journalist, the ambitious diplomat, grandiose plans of nations built upon a foundation of the imperfect; like an oil painter swiping away reality with each pass of the brush, making her painting plain; cellophane wrapped like the west sees its wars.The book did take a surprising ending, especially for those who have seen the movie. I won’t spoil it; but I will say that sometimes a sad ending can also be happy, and vice versa too."}, {"review_sentiment": 4.0, "review_text": "On second reading 40-plus years after original publication, Graham Greene's short and masterful novel \"The Quiet American\" seems profound and prophetic. (To many of us it seemed arrogant, stereotyped and anti-American in 1957). Alden Pyle, the quiet American,has been said by Greene biographers to be a takeoff of Edwin Lansdale, the model for William Lederer's \"The Ugly American,\" a favorable account of America in Asia written contemporaneous with Greene's novel. Today Alden Pyle could be seen as a character based on the Robert McNamara, Maxwell Taylor, Henry Cabot Lodge or Robert Komer of the 1960s. Greene's moral vision is as keen here as in any of his novels."}, {"review_sentiment": 5.0, "review_text": "One one level, a truly amazing novel on love, betrayal and doubt. Graham Greene was my favourite writer when I was much younger, and I recently read The Quiet American for the third time. This time I more fully appreciated also the political insights of Greene, often referred to as a writer with an almost uncanny ability to visit and then describe a world of politics and revolutions at the right time.He was a flawed and ambivalent Catholic, and his battles with faith and doubt became the blood that lifted his novels to excellence. Give him a try."}, {"review_sentiment": 5.0, "review_text": "Perfectly written novel"}, {"review_sentiment": 5.0, "review_text": "Graham Greene was an exceptional writer. We chose this small book for our book club selection, and it was highly praised! It's a good look at Viet Nam (French Indochina) before the Americans sent in troops. It was also interesting to view the two movies, one from the 50's and the other more recent, to see the different interpretations on the same story."}, {"review_sentiment": 4.0, "review_text": "Its nostalgic if one is nostalgic for the cold war and British snobbism about Americans overseas."}]}, "authors": ["Graham Greene"], "isbn": "0143039024", "longitude": 0.0, "periods": ["1900s"], "title": "The Quiet American", "word_cloud": "far better novel truer reality live sense occupy also cleverly twisted morality run water main break great story read record poor volume spike accent annoy english french bit vietnamese reader french horrible pause especially different character speak president prophetic committing hundred thousand men woman breach rich man war fight poor kid exacerbate myopia exercise president hubris word countless life fair war this truly awesome start situate french particular struggle towards independence disorganize almost medieval way full compete warlord double agenda lump together u observer communists reporter sideshow elderly cynical british news hack issue home excellent local contact incl french colonial official also maintain beautiful young girlfriend young shy naive virgin almost everything fresh recruit massive economic advisory mission operate matchmaking sister dislike leave move not long pyle find dead mud lung riverside restaurant fifty meter bare bone shakespearean tragedy involve million ethnic colonial administration army contingent secret agent neutral bystander first name selfish unwilling unable commit creed ideology respectful local hardship suffer sometimes wish death sometimes cry help entity believe man faith try democracy protect communism whilst undermine colonial rule starve french weapon supply dissident material make save life extreme circumstance discussion sear difference worldview ambition hop lack take year write inauspicious year give involvement late see colorful mixed religion briefly describe tv today humble verdict fresh never work great scope brilliance true classic mix everything maybe everything already mixed war jumble lust vulnerability ambition power youth instincts shake together serve platter backdrop steamy jungle dehydrate mountain third third world affair generation theater collapse town grand old city occupy crisply dressed soldier drink dancing elegant lady dress white concentration camp fill college educate war grandfather war war father start war villager peasant poorly arm soldier bloodshot eye point passing car explosion plant market kill vendor sit front pile dry fish occasional drone strike accent difference make somehow kind war war third world specifically farmer fight street thug story journalist local girl bring competition nave young simple simple story perhaps simple write elicit make common cause know type know modern war four think war know camp full child body heap pile blood drain small river seek exit jaded journalist ambitious diplomat grandiose plan nation build foundation imperfect oil painter swipe away reality pas brush make paint plain cellophane wrap west see take surprising end especially see movie spoil say sometimes sad end also happy vice versa second reading year original publication short masterful seem profound prophetic many seem arrogant stereotype say biographer takeoff model favorable account write contemporaneous see character base moral vision keen novel level truly amazing love betrayal doubt favorite writer much younger recently third time time fully appreciate also political insight often refer writer almost uncanny ability visit describe world politics revolution right flaw ambivalent battle faith doubt become blood lift novel excellence try perfectly write exceptional writer choose small club selection highly praise good look send troop also interest view movie recent different interpretation story nostalgic nostalgic cold war british snobbish overseas", "genres": ["Fiction & Literature", "Politics"], "summary": "Against the intrigue and violence of Vietnam during the French war with the Vietminh, Alden Pyle, an idealistic young American, is sent to promote democracy, as his friend, Fowler, a cynical foreign correspondent, looks on. \r\n\r\nFowler s mistress, a beautiful native girl creates a catalyst for jealousy and competition between the men and a cultural clash resulting in bloodshed and deep misgivings. \r\n\r\nWritten in 1955 prior to the Vietnam conflict, The Quiet American foreshadows the events leading up to the Vietnam conflict. Questions surrounding the moral ambiguity of the involvement of the United States in foreign countries are as relevant today as they were fifty years ago.", "asin": "0143039024", "rank": "12793", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51NHrdycMNL.jpg", "country": "Hanoi", "story_arc": ["Tragedy", "Things only get worse"]}