{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 103, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "as usual a good story in an interesting setting with an unexpected final twist"}, {"review_sentiment": 5.0, "review_text": "I love the 'series' even though someone could pick up any of them without feeling like they've missed anything - I STRONGLY suggest you begin with the first one as I did The characters develop ove time!"}, {"review_sentiment": 4.0, "review_text": "As I wind my way through the Montalbano books by Camilleri, certainly some are better than others. I've enjoyed Catarella, Fazio, Mimi and of course Salvo.This particular book has not been made into a TV movie, I think.  At least I don't remember it (it is always possible I've seen it and simply forgotten!) and so in one regard this was particularly fun for me to read: I did not know how it would end.The title of the book is very appropriate as it does seem that it is a deadly game that is being played.  One that for a good part of the book does not make a lot of sense.  Things are not what they seem, to be sure.We see Salvo at the top of his game, here, against a quite challenging set of circumstances.  There is, of course the obligatory whining about growing old, and the fact that he is being seduced by a young, beautiful, woman.  One might get tired of those predictable things, but perhaps it is the current summer heat wave -- I have forgiven him for his failings.This was just simply a lovely summer read.  As I write this, I'm not quite certain if it is the last of the books.  There might be one or two more.  At the same time I was reading this, MHz released for streaming the most recent two movies.  So a wonderful double-dose of Montalbano.  The actors in the shows all are growing older as well (except the actor who plays Fazio!  He is forever young!).  It is a pleasant way to spend a hot July.I didn't realize it for the longest time that Camilleri's books about Montalbano always have 18 chapters.  It's an impressive feat.  The one negative comment I have about Game of Mirrors is that it ends very abruptly.  Bam! It's done.  You're left wanting maybe just a little bit more... and maybe that's not such a bad thing."}, {"review_sentiment": 5.0, "review_text": "Like almost all Camilleri, a great story. Great writing, and I'm not sure there's a better character as a detective than Inspector Montalbano."}, {"review_sentiment": 5.0, "review_text": "The series continues and this is one of the best in the series."}, {"review_sentiment": 5.0, "review_text": "Another great case that Inspector Montalbano gets involved in. I have been a fan for years. Awaiting the next case for him to solve."}, {"review_sentiment": 3.0, "review_text": "A little gruesome for my taste.  I like this crime series, but this one was not one I preferred."}, {"review_sentiment": 5.0, "review_text": "Great fun and a fast moving investigation."}, {"review_sentiment": 5.0, "review_text": "ASIN: B00L9B855G  Andrea Camilleri  Game of MirrorsI am always delighted to read another book in the Camilleri’s Montalbano mysteries set in nineteenth-century Sicily.  All Camilleri’s books are written in Italian; the outstanding Stephen Sartarelli is Camilleri’s translator.  In many places in the book I howled with laughter. (Many strange looks on the bus.)Camilleri’s Montalbano,  Commissioner Inspector and Fazio is his right hand and protégé, are very smart and work together to determine who is behind the killings. Love blooms, unique this series.  Several great characters, fully developed, are part of the action. The secretive involvement of the Mafia clouds the solution. However, Montalbano is a reader of good literature, and he eventually sees through the intricate plan. Montalbano’s series of questions and the resultant interrogations of those involved in the crimes lead to solving the many ugly murders.A great read!  I look forward to the Camilleri’s next book."}, {"review_sentiment": 5.0, "review_text": "Enjoyable Inspector Montalbano mystery.  It's interesting to follow him as he ages in the series."}]}, "authors": ["Andrea Camilleri"], "isbn": "0143123777", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Game of Mirrors", "word_cloud": "usual good story interest set unexpected final twist love even someone feel miss anything strongly suggest begin first character develop oven time wind way certainly better others enjoy course particular make tv movie think least remember always possible see simply forgotten regard particularly fun know appropriate seem deadly play good part make lot sense seem top quite challenging set circumstance course obligatory whine grow old fact seduce young beautiful woman tired predictable thing perhaps current summer heat wave forgiven simply lovely summer write quite certain last time read release stream recent movie so wonderful actor show grow older well actor play forever young pleasant way hot longest time always chapters impressive feat negative comment end abruptly do leave want maybe little bit maybe bad thing almost great story writing sure better character detective series continue best series great case get involve fan year await next case little gruesome taste like crime series prefer fun fast move investigation always delight mystery set sicily write italian outstanding translator many place howl laughter many strange look bus right hand protege smart work together killing bloom unique series great character fully developed part action secretive involvement cloud solution however good literature eventually see intricate plan series question resultant interrogation involve crime lead solve many ugly great look forward next enjoyable mystery interest follow age series", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "An Inspector Montalbano Mystery\r\n\r\nSomeone is toying with Italy’s favorite detective in the eighteenth installment of the New York Times bestselling Inspector Montalbano Mystery series\r\n\r\nAndrea Camilleri’s Inspector Montalbano novels have become an international sensation, with fans eagerly awaiting each new installment.\r\n\r\nIn Game of Mirrors, Inspector Montalbano and his colleagues are stumped when two bombs explode outside empty warehouses—one of which is connected to a big-time drug dealer. Meanwhile, the alluring Liliana Lombardo is trying to seduce the Inspector over red wine and arancini. Between pesky reporters, amorous trysts, and cocaine kingpins, Montalbano feels as if he’s being manipulated on all fronts. That is, until the inspector himself becomes the prime suspect in an unspeakably brutal crime.", "asin": "0143123777", "rank": "249190", "city": "Sicily", "image": "https://images-na.ssl-images-amazon.com/images/I/514r4Zm1fxL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}