{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": -12.9822499, "ratings": {"num_ratings": 20, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Captains of the sands It tells the story of  street kids in Salvador - Bahia in the 30s.They are seven to fifteen years old and live by begging, gambling and stealing, abandoned in the streets of Salvador.Being homeless, they call themselves “Captains of the Sands\".I recommend this book."}, {"review_sentiment": 3.0, "review_text": "I have mixed feelings about this one from Amado, at the same time it was written when he was just 24, and he himself admits in a personal note at the end to be aware of the flaws it might have.I have read it in an English translation as I can't read Portuguese, and the writing is smooth. Living in Salvador de Bahia (how did one of the reviewers above get the impression the book was set in Fortaleza?), he must have daily witnessed the situation of the \"ninhos da rua\", a tragic reality still today in most of Brazil.Though, I'm not sure the portrayal is so honest he claims at the end as the best quality of the book. Amado clearly cares a lot about those kids, the benign point of view towards them so obvious, at a point that when a rape is committed, it seems no big deal.Amado describes several different type of \"Captains of the sands\" each one with his peculiar attributes, but the look is always too sympathetic and he cannot keep a more detached viewpoint to the extent of somehow undermining the pedagogical intent of the book of portraying the reality of Brazilian abandoned kids.Subjects as the poverty, the solidarity among the poor, the right of the workers, the strike, the Communist ideology of social justice, the hypocrisy of some clergymen, the magnanimity of others, are all touched here and there, sometimes maybe too ambitiously, in \"black and white\" characterization. Impossible not to notice that basically at the same time, John Steinbeck was laying the foundations for his masterpiece \"The Grapes of Wrath\" published in 1939 (three years later than Amado's), where these same topics are addressed in such a sublime form of literature.Still, Amado sincere participation to these kids' fate, his felt contribution in letting everyone know, the peculiar traits of the multi-ethnic Brazilian culture, makes this read enjoyable and I look forward to some oh his later, and best known works"}, {"review_sentiment": 5.0, "review_text": "Like a Brazilian, I love it!"}, {"review_sentiment": 3.0, "review_text": "Good read"}, {"review_sentiment": 5.0, "review_text": "Marvelous, raw, touching! Brazilian modernist literature at its best!"}, {"review_sentiment": 5.0, "review_text": "After reading Violent Land decided to stick with author, to see if he could redeem himself & he sure did. The book was spellbinding the characters were really appealing. Couldn't put the book down.Although the setting was Brazil it was a universal story"}, {"review_sentiment": 5.0, "review_text": "Excellent content!!! I recommend!!! It is the best romance from Jorge Amado in my opinion. Human being, history, economy, society, and many others matters to study..."}, {"review_sentiment": 5.0, "review_text": "a wonderfully paced story that places you in the middle of a life few of us know or can relate to. I'll leave the details for the reader to open themself."}, {"review_sentiment": 5.0, "review_text": "This is really classic novel and enjoy reading as soon it delivered. The story emphasize the culture of Bahia stat in Brazil and it gives you a good understanding what really happening in Brazil in early 20th century."}, {"review_sentiment": 5.0, "review_text": "Amado captures with brilliance the pathos and humanity of the homeless orphans of Bahia who belong to a gang which serves as a surrogate family. At once known as rough and tumble gang members and petty criminals, at times cruel and at times tender, we see the dreams, yearnings for love and connection and identity, and the bonds of trust and friendship with which these young boys and girl create uncertain lives and futures for themselves."}]}, "authors": ["Jorge Amado"], "isbn": "014310635X", "longitude": -38.4812772, "periods": ["1900s"], "title": "Captains of the Sands", "word_cloud": "tell story street kid fifteen year old live begging gamble steal abandon street homeless call recommend mix feeling time write admit personal note end aware flaw translation write smooth reviewer get impression set witnessed situation ninth da rue tragic reality still today sure portrayal honest claim end best quality clearly care lot kid benign point view obvious point rape commit seem big describes several different type peculiar attribute look always sympathetic detached viewpoint extent somehow undermining pedagogical intent portray reality abandon poverty solidarity poor right worker strike ideology social justice hypocrisy clergymen magnanimity others touch sometimes maybe ambitiously black white characterization impossible notice basically time lay foundation masterpiece publish year later topic address sublime form sincere participation kid fate felt contribution let everyone peculiar trait brazilian culture make enjoyable look forward oh later best know work brazilian love good marvelous raw touch brazilian modernist literature best read decide stick author see sure spellbinding character really appeal put set universal story excellent content recommend best romance opinion history economy society many others matter wonderfully paced story place middle life know leave detail open them self really classic enjoy read soon deliver story emphasize culture stat give good understanding really happen early century capture brilliance pathos humanity homeless orphan belong gang serve surrogate family know rough tumble gang member petty criminal time cruel time tender see dream yearning love connection identity bond trust friendship young boy girl create uncertain live future", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A Brazilian Lord of the Flies, about a group of boys who live by their wits and daring in the slums of Bahia\r\n\r\nThey call themselves “Captains of the Sands,” a gang of orphans and runaways who live by their wits and daring in the torrid slums and sleazy back alleys of Bahia. Led by fifteen-year-old “Bullet,” the band—including a crafty liar named “Legless,” the intellectual “Professor,” and the sexually precocious “Cat”—pulls off heists and escapades against the right and privileged of Brazil. But when a public outcry demands the capture of the “little criminals,” the fate of these children becomes a poignant, intensely moving drama of love and freedom in a shackled land.\r\n\r\nCaptains of the Sands captures the rich culture, vivid emotions, and wild landscape of Bahia with penetrating authenticity and brilliantly displays the genius of Brazil’s most acclaimed author.\r\n", "asin": "014310635X", "rank": "234991", "city": "Salvador", "image": "https://images-na.ssl-images-amazon.com/images/I/51%2BDOr5g0KL.jpg", "country": "Brazil", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}