{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 142, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "Very comprehensive and detailed. At times the nanes and places are confusing."}, {"review_sentiment": 5.0, "review_text": "An excellent book which deals with the complexities very well."}, {"review_sentiment": 5.0, "review_text": "Good read for history buffs"}, {"review_sentiment": 5.0, "review_text": "If you care about the Spanish Civil War, this is the book to own. The author is balanced and thorough in his appraisal of the Republican vs the Nationalists, and comes across as thoughtful, informative and rigorous. The book is not as easy to read as a novel, but if you care about facts,it does a great job presenting the conflict objectively. I was impressed by the author's level-headedness and scholarship."}, {"review_sentiment": 3.0, "review_text": "I've read - and loved! - Antony Beevor's Stalingrad and had high expectations of this book. But it never got going... it is detailed, it gave me great insights into the civil war and the back ground, origins and what happened, but it somehow never got \"personal\". It consistently hovered at a 10000 feet above the story. Get this book as a good covering intro of the Spanish Civil War, but don't expect it to be like Stalingrad which grips you and never lets go..."}, {"review_sentiment": 1.0, "review_text": "For someone not familiar with Spain or the characters this book is too difficult to follow as keeping track of who is who and what side they are on is nearly impossible. This is not an overview."}, {"review_sentiment": 5.0, "review_text": "If you're going to read one book on the Spanish civil war this is THE book."}, {"review_sentiment": 5.0, "review_text": "Perfect. Top quality. Highly recommend"}, {"review_sentiment": 4.0, "review_text": "Full of great research.  Spain arguably was prologue to the Second World War.  Franco a forgotten brutal tyrant until 1975."}, {"review_sentiment": 2.0, "review_text": "Although i would advice the work of the author Pio Moa if you want a less biaised work about the Civil War . Away from the trap where MrBeevor falls which is to consider the spanish republic as a democratic regime ,therefore turning the war into a liberal vs fascism conflict.What took place in Spain BEFORE the civil war was a communist revolution directed by Russia,something thst became apparent after the war started. The tragedy for Spain was to have the foreign forces that where going to fight in WWII have a test run in our soil.It is kind of tragic as well that historians and public opinion that tend to favour the republic turned a blind eye over the fate of the republicans that crossed the border trying to find sanctuary in France. Most of them were handed either by the french or by the swiss to the germans who sent them to the concentration camps where their heroic stories are yet to be told. Another great story is that of the first soldiers who bravely entered the nazy occupied Paris.Whose nationality where they? You got it.The very first batallion that liberated Paris was \"la Nueve\" the batallion of republican soldiers."}]}, "authors": ["Antony Beevor"], "isbn": "014303765X", "longitude": 2.1774322, "periods": ["1900s"], "title": "The Battle for Spain: The Spanish Civil War 1936-1939", "word_cloud": "very comprehensive detail time bane place confuse excellent deal complexity well good history buff care author balance appraisal v come thoughtful informative rigorous easy care facts great job present conflict objectively impress author scholarship love high expectation never get go detailed give great insight back ground origin happen somehow never get personal consistently hover foot story good cover intro expect grip never let go someone familiar character difficult follow keep side nearly impossible overview go quality recommend great research arguably prologue second forget brutal tyrant work author want le biased work trap fall republic democratic regime turn liberal v fascism take place communist revolution direct something that become apparent start tragedy foreign force go fight test run kind tragic well historians public opinion favor republic turn blind eye fate republican cross border try find sanctuary hand french swiz german send concentration camp heroic story yet tell great story first soldier bravely enter zany occupied nationality get first battalion liberate battalion republican soldier", "genres": ["History"], "summary": "A fresh and acclaimed account of the Spanish Civil War by the bestselling author of Stalingrad and The Fall Of Berlin 1945 \r\n\r\nBeevor's Ardennes 1944: The Battle of the Bulge is now available from Viking Books \r\n\r\nTo mark the 70th anniversary of the Spanish Civil War's outbreak, Antony Beevor has written a completely updated and revised account of one of the most bitter and hard-fought wars of the twentieth century. With new material gleaned from the Russian archives and numerous other sources, this brisk and accessible book (Spain's #1 bestseller for twelve weeks), provides a balanced and penetrating perspective, explaining the tensions that led to this terrible overture to World War II and affording new insights into the war-its causes, course, and consequences.", "asin": "014303765X", "rank": "102252", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51kVQaZdKWL.jpg", "country": "Spain", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}