{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 13.7542529, "ratings": {"num_ratings": 247, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "I've read and re-read almost all of le Carre and this is his masterwork.  Rich and diverse characters, an insider's understanding of Asia.  Brilliant set pieces, the visit to the front with Lorraine from Santa Barbara, the \"shaking of the tree\" regarding Ricardo, above all the characters, minor and major, the humanity and complexity of Drake Ko. I could go on.  The definitive JLC."}, {"review_sentiment": 1.0, "review_text": "Could not make any sense of the book relative to Tinker,Tailor,Soldier Spy and Smileys People supposedly a trilogy. Maybe the UK TV series available on DVD changed the fantastic plot slightly.Not recommended."}, {"review_sentiment": 5.0, "review_text": "Brilliant"}, {"review_sentiment": 3.0, "review_text": "The plot line is too obscure and while the writing is colourful the purpose and motivation of the main character is unclear. He is presumably intended to be a rebel with a cause but he comes across much of the time as (unintentionally) frivolous."}, {"review_sentiment": 4.0, "review_text": "I like the detailed descriptions of the environments and places in the book. Also of the persons. It makes it even more readable. I sincerely recommend it."}, {"review_sentiment": 4.0, "review_text": "But I'm still not clear about what role exactly was played by Sam Collins? Was he there just to burn Lizzie Worthington and get her to co-operate? And what gave him his special access to the whitehall bigwigs?Otherwise an amazing, amazing story. So many dilemmas, so much conflicting emotions, collateral sacrifice packed into a few pages. Yes there were parts where I wish the pace was picked up a bit, for example, the introspection chapter of Jerry Westerby by the Mekong river. But the overall impact of the book is almost physical."}, {"review_sentiment": 5.0, "review_text": "First rate story. The best Smiley spy novel."}, {"review_sentiment": 5.0, "review_text": "Always liked Le Carre and having spent time in Asia it was enjoyable reading his depiction of it, along with the boozy journalists, officials and spies in and around British Hong Kong. Sad that those good old days are gone and the mainland is persistently chipping away at what makes Hong Kong Hong Kong but still this is a great story and certainly a lot of expats can relate to the recreational habits, at least, of many of the characters."}, {"review_sentiment": 5.0, "review_text": "Great Book."}, {"review_sentiment": 5.0, "review_text": "A very good follow-up book to Tinker, Tailor...  Suspenseful and intriguing.  Highly recommend the first story before reading this one."}]}, "authors": ["John le Carré"], "isbn": "0143119737", "longitude": 100.493087, "periods": ["1900s"], "title": "The Honourable Schoolboy", "word_cloud": "almost le masterwork diverse character insider understand set piece visit front shake tree regard character minor major humanity complexity definitive make sense relative supposedly trilogy series available change fantastic plot recommend brilliant plot line obscure write colorful purpose motivation main character presumably intend rebel cause come much time unintentionally frivolous like detailed description environment place also person make even readable sincerely recommend still clear role exactly play burn get give special access whitehall bigwig otherwise amaze amaze story so many dilemmas much conflicting emotion collateral sacrifice pack page part wish pace pick bit example introspection chapter river overall impact almost physical rate story best spy always like spend time enjoyable read depiction boozy journalist official spy british good old day go mainland persistently chip away make still great story certainly lot expat relate recreational habit least many character good intrigue recommend first story read", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "As the fall of Saigon looms, master spy George Smiley must outmaneuver his Soviet counterpart on a battlefield that neither can afford to lose.\r\n \r\nThe mole has been eliminated, but the damage wrought has brought the British Secret Service to its knees. Given the charge of the gravely compromised Circus, George Smiley embarks on a campaign to uncover what Moscow Centre most wants to hide. When the trail goes cold at a Hong Kong gold seam, Smiley dispatches Gerald Westerby to shake the money tree. A part-time operative with cover as a philandering journalist, Westerby insinuates himself into a war-torn world where allegiances—and lives—are bought and sold.\r\n\r\nBrilliantly plotted and morally complex, The Honourable Schoolboy is the second instalment of John le Carré's renowned Karla trilogy and a riveting portrayal of postcolonial espionage.\r\n \r\n“Not a page of this book is without intelligence and grace.” The New York Times\r\n", "asin": "0143119737", "rank": "31759", "city": "Bangkok", "image": "https://images-na.ssl-images-amazon.com/images/I/51iStuTnyeL.jpg", "country": "Thailand", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}