{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 2358, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Without a doubt, this is the best book you will ever read. No exaggerations."}, {"review_sentiment": 5.0, "review_text": "This novel is simply a masterpiece. Gorgeous, enchanting, fascinating. Storytelling at its best. Read it."}, {"review_sentiment": 4.0, "review_text": "This book has an element of Marmite to it – people either love it or hate it. But it appears to me, from amongst my friends list, that those that hate it are looking for something else within its pages, which isn’t necessarily to be found.So, what was I looking for in this book? A compelling story? An adventure? Something I’d never seen before? Hints of what people have raved about? Beautiful writing? Well, not particularly, as I view each new book as a unique adventure that I let the book itself take me on and reveal. I try to come along with as few preconceptions or ideas as possible. And yet, I did find just about all of these within. And, not only that, right at the beginning, just as I was starting to read, I found that it’s a book that *connects* people. I was barely twelve pages in when a lady comes up behind me on the tram and tells me that she is halfway reading through the same book (albeit the Dutch translation instead of the English), a little bit further on, and that with a little patience it slowly unfolds and flowers into a compelling story. And she wasn’t the only one to notice me reading the book – a few nods of approval later and I came to understand why people absolutely love the book, and also why others hate it.Starting the book, considering its location and setting, I thought back to a previous book I had read, set during the War years in Spain, Winter in Madrid, which gives much of the darkness of the times. It made me nervous as, even though it’s based around a different Spanish city, I’d already seen the war times depicted in a less-than-pleasing manner. But, luckily, the writing here reassured me that it would be a far different story, written much better, with the shadow of the war more of a backdrop than a main focus (although, rereading my review, it was more the ending that let down that previous book).So as the threads wound me through their various streets and alleys, from mountains to the sea, it becomes apparent that the story isn’t so much about books, as the effect of books, about the journey both outside and inside the pages, and what not only leads a young boy on to discover the story behind the book he had discovered, but leaves you just as intrigued as he and yearning for the truth.If it weren’t for the slower parts, the various monologues, I might have been more excited. I did thoroughly enjoy the book, but those minor moments of boredom during those slower monologues put a bit of a shadow on an otherwise fantastic book. Also, the fact that it is not so easy to see the character behind the monologues, especially ones you would like to understand, leaves a slight air of disappointment. I did, in the end, find sympathy with characters I didn’t expect to. The major reveal, I had suspected for quite some time before, although I was deceived previously into mistaking one character for another until at that moment when it was absolutely obvious. Yet all these monologues, the various loose threads, lead to reveal a story told from many sides with all the various interpretations on what had happened. The true story behind all those whispers and rumours shows a far more complex story than could be imagined in the first few pages. Overall, the author doesn’t do a bad job of tying it all together, but it’s the words, the beautiful lines that tie it all together in the end, and makes it a book that has to be loved."}, {"review_sentiment": 2.0, "review_text": "One thing I can say for this book is that it will not bore you. The plot moves quickly, from one bizarre, threatening episode to another. It is full of romance, Danger, and passion. However, the author does not even attempt at realism or subtlety. Even minor characters have bizarre or grotesque backstories. A setting of minor importance has  a former owner who collected fetuses in various stages of development. Even marginal figures die dramatically, eaten by animals or falling from large heights, when it seems a simple gunshot or heart attack might do once and a while. A servant moves to the city not to get a job but fleeing shame and abuse, led by demonic visions. In order to avoid spoilers, I am only mentioning minor plot points, but the heart of the narrative is no more realistic, subtle, or restrained. I do not particularly enjoy this style of writing, but I am sure it has its audience. If you like gothic melodrama chock full of grotesque detail with intense, evocative language at every breath, you will probably enjoy this. If you prefer Raymond Chandler and Cormac McCarthy, put the book down and run like hell."}, {"review_sentiment": 5.0, "review_text": "It's not a perfect book or great literature but it's lovely to read. Thoughtful and extremely well-written. Wonderful character development along with a good story. I enjoyed it thoroughly and highly recommend."}, {"review_sentiment": 5.0, "review_text": "I was recommended this book by a friend and decided to give it a shot. I’m so glad I did, this book was a page turner from the first sentence all the way to the last. Highly recommended!"}, {"review_sentiment": 3.0, "review_text": "Fun read interesting but not what I usually read."}, {"review_sentiment": 5.0, "review_text": "“Bea says that the art of reading is slowly dying, that it's an intimate ritual, that a book is a mirror that offers us only what we already carry inside us, that when we read, we do it with all our heart and mind, and great readers are becoming more scarce by the day.”― Carlos Ruiz Zafón, The Shadow of the WindThis was a great read. A page turner of a mystery that towards the end, I could not put down. I was a bit disappointed in the way the 'wrap up' was handled - a letter - but it did not distract from the enjoyment of the story"}, {"review_sentiment": 5.0, "review_text": "I'm not very used to reading books all at once, but this one got me a lot!Amazing story, probably one of the best books I have ever read.Thanks Zafón, you reminded me one can still feel emotions by reading a book!"}, {"review_sentiment": 3.0, "review_text": "Good book? Yes. Great book? No. Starts good. Slows down @ about 25%. Then slightly picks up again around 70%. Good enough to read, but like most overhyped books it just delivers and that’s all. And people (reviewers) need to look up the meaning of “gothic”. Just a few too many characters. Not enough going on to keep them all interesting. And as to the “big reveal”, if you don’t know they’re brother and sister, then you need to read more. “Emmeline” anyone? “The All Of It”? This could have been, and should have been 4 stars easy. Just didn’t get there."}]}, "authors": ["Carlos Ruiz Zafón"], "isbn": "0143034901", "longitude": 2.1774322, "periods": ["1900s"], "title": "The Shadow of the Wind", "word_cloud": "doubt best ever exaggeration simply masterpiece gorgeous enchant fascinate storytelling best read element people hate appear among st friend list hate look something else page necessarily look compelling story adventure something never see hint people rave beautiful write particularly view new unique adventure let reveal try preconception idea possible yet find right beginning start find people barely twelve page lady come tram tell halfway read translation instead little bit little patience slowly unfolds flower compel story notice read nod approval later come understand people absolutely love also others hate consider location set think back previous set year give much darkness time make nervous even base different spanish city already see war time depicted manner luckily writing reassure far different story write much better war backdrop main focus reread review end let previous thread wind various street alleys mountain becomes apparent story much effect journey page lead young boy discover story discovered leaf intrigue yearn slower part various monologue excite thoroughly enjoy minor moment boredom slower monologue put bit otherwise fantastic also fact easy see character monologue especially one understand leaf slight air disappointment end find sympathy character expect major reveal suspect quite time deceive previously mistake character moment absolutely obvious monologue various loose thread lead reveal story tell many side various interpretation happen true story whisper rumor show far complex story first page overall author bad job tie together word beautiful line together end make love thing say plot move quickly bizarre threaten episode full romance passion however author even realism subtlety even minor character bizarre grotesque backstories set minor importance former owner collect fetuses various stage development even marginal figure die dramatically eaten animal fall large height seem simple gunshot heart attack servant move city get job flee shame abuse lead demonic vision order avoid spoiler mention minor plot point heart narrative realistic subtle restrain particularly enjoy style writing sure audience gothic melodrama chock full grotesque detail intense evocative language breath probably prefer put run hell perfect great literature lovely extremely wonderful character development along good story enjoy thoroughly highly recommend friend decide give shot glad page turner first sentence way last recommend interest usually say art read slowly die intimate ritual mirror offer already carry heart mind great reader become scarce great page turner mystery end bit disappointed way handle letter distract enjoyment story use read get lot story probably best ever remind still emotion read good good then slightly pick enough over hyped delivers people reviewer need look mean gothic many character not enough go interesting big reveal know brother sister need anyone easy", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "\"Gabriel García Márquez meets Umberto Eco meets Jorge Luis Borges for a sprawling magic show.\" --The New York Times Book Review\r\n\r\nBarcelona, 1945: A city slowly heals in the aftermath of the Spanish Civil War, and Daniel, an antiquarian book dealer’s son who mourns the loss of his mother, finds solace in a mysterious book entitled The Shadow of the Wind, by one Julián Carax. But when he sets out to find the author’s other works, he makes a shocking discovery: someone has been systematically destroying every copy of every book Carax has written. In fact, Daniel may have the last of Carax’s books in existence. Soon Daniel’s seemingly innocent quest opens a door into one of Barcelona’s darkest secrets--an epic story of murder, madness, and doomed love.", "asin": "0143034901", "rank": "3218", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51naG-FeFpL.jpg", "country": "Spain", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}