{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 956, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "The seller gets all 5 stars, the writer only gets 4."}, {"review_sentiment": 5.0, "review_text": "I just adored this book. Read the whole series! You'll be sucked into a sad world where people keep trying to rise above their painful pasts."}, {"review_sentiment": 1.0, "review_text": "I'm puzzled by all the 5-star reviews - usually they're a big help in steering me toward a good read. In this case, I agree with the one-star reviews. After about 150 pages, I started skimming through to the disappointing conclusion. Not much of a thriller or a mystery here, just a disappointing, depressing read."}, {"review_sentiment": 4.0, "review_text": "This is a terrific series. Tana French's protagonists are so flawed, and not entirely likable much of the time. Still, they completely draw you in, and keep you reading. I've enjoyed the first three, and Book 4 is next on my kindle!"}, {"review_sentiment": 3.0, "review_text": "Couldn’t keep my attention with all its family relationship interaction.  Struggled to finish it."}, {"review_sentiment": 4.0, "review_text": "Talk about dysfunctional families!!  What might have happened if ….  I found the family interactions very disturbing because I wasn’t used to that type of behavior.  Once I mentally removed the family part from the equation, I was able to read the story.  For those who can disassociate themselves, I recommend this book."}, {"review_sentiment": 5.0, "review_text": "Definitely worth a read. Frank’s character isn’t a well developed as, say Cassidy, but this book has a much faster plot than the previous novels."}, {"review_sentiment": 4.0, "review_text": "Easy read, good twists and excellent character development."}, {"review_sentiment": 2.0, "review_text": "I know there is a segment of the population who use crude language however I found this book to be \"crude prolific\" unnecessarily. It was offensive."}, {"review_sentiment": 3.0, "review_text": "Nothing to add."}]}, "authors": ["Tana French"], "isbn": "0143119494", "longitude": -6.2602732, "periods": ["2000s", "Recent Releases"], "title": "Faithful Place", "word_cloud": "seller get star writer get adore whole series suck sad world people try rise painful past puzzle review usually big help steer good case agree review page start skim disappoint conclusion not much thriller mystery disappointing depressing terrific series protagonists flaw entirely likable much time still completely draw reading enjoy first next kindle attention family relationship interaction struggle finish dysfunctional family happen find family interaction disturb use type behavior mentally remove family part equation able story disassociate recommend definitely worth character well developed say much faster plot previous novel good twist excellent character development know segment population use crude language however find crude prolific offensive nothing add", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 3/5 in the Dublin Murder Squad Series\r\n\r\nFrom Tana French, “the most interesting, most important crime novelist to emerge in the past 10 years” (The Washington Post), the bestseller called “the most stunning of her books” (The New York Times) and a finalist for the Edgar Award. Don't miss her newest, The Trespasser, now available.\r\n\r\nBack in 1985, Frank Mackey was a nineteen-year-old kid with a dream of escaping his family's cramped flat on Faithful Place and running away to London with his girl, Rosie Daly. But on the night they were supposed to leave, Rosie didn't show. Frank took it for granted that she'd dumped him-probably because of his alcoholic father, nutcase mother, and generally dysfunctional family. He never went home again. Neither did Rosie. Then, twenty-two years later, Rosie's suitcase shows up behind a fireplace in a derelict house on Faithful Place, and Frank, now a detective in the Dublin Undercover squad, is going home whether he likes it or not. \r\n\r\nGetting sucked in is a lot easier than getting out again. Frank finds himself straight back in the dark tangle of relationships he left behind. The cops working the case want him out of the way, in case loyalty to his family and community makes him a liability. Faithful Place wants him out because he's a detective now, and the Place has never liked cops. Frank just wants to find out what happened to Rosie Daly-and he's willing to do whatever it takes, to himself or anyone else, to get the job done.", "asin": "0143119494", "rank": "19130", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51KeAbT-NbL.jpg", "country": "Ireland", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}