{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 108, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Extremely interesting and well written. I would recommend this to anyone visiting Venice!"}, {"review_sentiment": 5.0, "review_text": "I just loved this book!  I didn't know a thing about Venice, and the author communicated his love of the city to me through this book.  I like that he used primary documents.  It has lead me on to months of study into places, people and events I've known next to nothing about including: the Fourth Crusade, Constantinople/Istanbul, Genoa.  I'm still going.  Thanks Mr. Madden."}, {"review_sentiment": 5.0, "review_text": "Madden is the rare combination of a great scholar and great communicator."}, {"review_sentiment": 5.0, "review_text": "Intersting narration!!"}, {"review_sentiment": 4.0, "review_text": "This is definitely a history book, but is well written  to keep the reader interested. A must read for anyone going to Venice who is interested in the history of the islands and people."}, {"review_sentiment": 5.0, "review_text": "Great and easy reading of the history of Venice"}, {"review_sentiment": 4.0, "review_text": "This is a well-written and quite thorough history of a most unusual place.  At times, the author's enthusiasm for Venice tends to prejudice his historical judgement a bit in Venice's favor, but this never leads to very serious misstatements as far as I know."}, {"review_sentiment": 5.0, "review_text": "I very much enjoyed reading before, during and after our visit! I can recommend to anyone interested in the bigger story."}, {"review_sentiment": 5.0, "review_text": "Great Book, I would say this is one of my favorite history books.  I recommend it highly."}, {"review_sentiment": 5.0, "review_text": "A succinct, vividly-written, and sweeping history of the city on the lagoon, and, moreover, of the Most Serene Republic of Venice that dominated Mediterranean trade for centuries. It's a new history, more compact than the magisterial history of Venice by John Julius Norwich, but goes further by telling the history of Venice from the fall of the Republic in 1798 to Bonaparte, and brings it up to the present day. This book also tells us of the city's contributions to art, literature, cinema and the Grand Tour -- indeed, its long relationship to world tourism from 1700 on. It's eye-opening in its story, not just of a beautiful city, but of the Most Serene Republic that built it over a milennium, and its unique and separate identity: in a medieval Italy fraught with intramural and dynastic strife, the Republic was remarkably stable and worldly. Highest recommendation."}]}, "authors": ["Thomas F. Madden"], "isbn": "0147509807", "longitude": 12.3345898, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases", "1500s", "500-1400s"], "title": "Venice: A New History", "word_cloud": "extremely interesting well write anyone visit love know thing author communicate city like used primary document lead month study place people event know next nothing include still go rare combination great scholar great communicator interest narration definitely well write keep interested anyone go interested island people easy read quite thorough unusual place time author enthusiasm tend prejudice historical judgment bit favor never lead serious misstatement far know much enjoy read visit recommend anyone interested bigger story favorite recommend highly succinct sweeping city lagoon moreover dominate trade century compact magisterial go tell fall bring present day also tell city contribution art literature cinema indeed long relationship world tourism story beautiful city build millennium unique separate identity medieval fraught intramural dynastic strife remarkably stable worldly recommendation", "genres": ["History"], "summary": "A spellbinding new portrait of one of the world’s most beloved cities, from the author of Istanbul\r\n\r\nLa Serenissima. Its breathtaking architecture, art, and opera ensure that Venice remains a perennially popular destination for tourists and armchair travelers alike. Yet most of the available books about this magical city are either facile travel guides or fusty academic tomes. In Venice, renowned historian Thomas F. Madden draws on new research to explore the city’s many astonishing achievements and to set 1,500 years of Venetian history and the endless Venetian-led Crusades in the context of the ever-shifting Eurasian world. \r\n\r\nFilled with compelling insights and famous figures, Venice is a monumental work of popular history that’s as opulent and entertaining as the great city itself.\r\n\r\n\"Breezy, cheerful, evenhanded, Madden debunks myths about Venetian decadence, and brushes aside ugly whispers about greedy, unscrupulous merchants.  When a colorful character pops up (Marco Polo, Casanova), he makes the most of it in his brisk, no-nonsense prose.\" New York Times", "asin": "0147509807", "rank": "90929", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51sIgnTEb2L.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}