{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 44.8178131, "ratings": {"num_ratings": 18, "rating": 3.7, "reviews": [{"review_sentiment": 2.0, "review_text": "I don't read much contemporary fiction and I may have picked the wrong place to start. This novel, by a Serbian writer living in Canada, is a confusing mash of domestic violence, antisemitism and recent politics of the Balkans, all written in an unstructured stream of consciousness style without paragraphs. The English version was translated from the Serbian, which may be one of the problems. In any case I found it confusing, dense and difficult to finish. The meaning of the title is a mystery. The author is also an activist for the legalization of marijuana, which may explain a bit of the purple haze.The author has received literary awards for his 'postmodern' writing, whatever that means. I suspect that critics sometimes give awards to incomprehensible work, rather than admit they don't get it, or there is nothing to get."}, {"review_sentiment": 2.0, "review_text": "I buy a lot of the $3.99 and under books amazon offers and have been more then happy with most.  I was surprised when I saw this in the Amazon cheap list and on the Swarthmore list of summer recommendations.  I it does have a lot of historically ineresting info on eastern Europe, but not the level of entertainment I prefer."}, {"review_sentiment": 3.0, "review_text": "Strange prose, almost Finnegans Wake-like peppered with Kabbalistic symbolism (cover art is from Qabalist Robert Fludd's diagram on memory). The book, while demanding because the entire book is basically one, run-on paragraph without any chapters. While, I enjoyed it as a challenge, it was definitely something I was not ready for. The occult references were appealing to me and that made it more pallatable, but I am not sure one would enjoy this in the way of say, Foucault's Pendulum. Even there, there is some organization that one can cling to. While this, as the story unfolds, does take the idea of chaos theory in its most basic form, \"a butterfly flaps its wings in China, and a thunderstorm emerges in New York\".LEECHES is definitely an intelligent book and it is laced with subtleties that the author does not want to hand out, but leaves participation for the reader to take care of to deepen the experience.I am reviewing an Advanced Reading Copy, so some changes may have come since, but I would think the gist of it is obviously \"review ready\". Originally written in Serbian and translated, so there is a strong relationship to nationality and its political views that are many times intrinsically linked to religious views. There are few people I could recommend this book to, but I dont think its for the beach reader."}, {"review_sentiment": 5.0, "review_text": "Leeches is the first David Albahari novel I read - I tried Gotz and Meyer a while ago but it did not hook me so I marked it for later. The novel has a very striking beginning that takes you in and from there it proceeds in a continual \"whole book as one paragraph\" manner. At times there is a feeling of being overwhelmed by the words as they seem to come as in a deluge, so you need to put the book down and reflect on you read.The book's main conceit is in the grand tradition of conspiracy theories, though of the literate Eco kind not the junky Va Dinci (!) ones, but its Eastern European setting and the author's superb literary skills - and of course the translator skills as the novel reads very naturally and smoothly - kept me interested despite my \"meh\" feelings towards this genre.While a relatively slim 300 pages length, Leeches packs quite a lot of stuff and it reads like a book twice its size. There is action and drama and quite a lot of tense moments while the ending is very good. If there was one small niggle, I would have loved the book to be present tense rather than be narrated from six years later as a little suspense (eg the final outcome for the narrator) is lost.Overall a dense but very rewarding read."}, {"review_sentiment": 3.0, "review_text": "Is anything truly meaningless?In David Albahair's newest novel, Leeches, his protagonist battles with the concept of what is trivial and what is significant in his life.  A common enough problem for anyone, but for someone having gone through the political and ethnic war in the Balkans, it's more complex.  The novel begins with him witnessing a random act of violence:  a woman is slapped by a man.  The shock of it sears him, yet it seems tame compared to the violence perpetrated throughout the region during the conflict.  Now obsessed, he tries to find out who the woman is and why the incident took place.As he takes on his search, he finds himself looking for clues everywhere.  Suddenly everything has a broader meaning, and he feels enlightened to recognize signs that others ignore.  Graffiti, scraps of paper on the ground, the angle of a door opening;  all appear to him as related to his search.  His closest friend Marko tries to get him back to reality, cautiously but clearly pointing out the flaws in his thinking.  Is he suffering from some sort of post-traumatic stress disorder or is he simply paranoid?  Or could it be as they say, that even a paranoid person is right sometimes?The novel proceeds rapidly with him consulting a mathematical expert, Dragan Misovic (\"you must get over your fear of math\"), and Kabbalah mystics in order to piece together what he can accept as a reality.  The Belgrade setting is perfect for the labyrinth of the story, as he seeks answers through old and new portions of the city, amid ruins and new construction.In one portion of the novel, I came across what is possibly the best explanation for why people become racist, and why ethnic hatred is so prevalent.  It's a lengthy excerpt but worth the insight:\"Hatred of other ethnic groups is in effect hatred of oneself...It is not the other we fear, we fear ourselves, we fear the changes the presence of others may impose.  When I say that I dislike Jews, or Roma, or Croats-the list is endless-I am expressing the fear that under their influence, or under the influence of what they genuinely or symbolically represent, I will be forced to give up some of the convictions that matter to me.  Their uprooting of my convictions, no matter how irrational, represents uprooting of my personality.  And so...if I am not to change, they must be branded, isolated, expelled, and, if necessary, utterly destroyed.\"Given that the main character is Serbian in such a significant time frame (1998), it's surprising he doesn't discuss political issues more.  Or does he?  Maybe it's paranoia on my part, but one character's name 'Dragan Misovic' sounds an awful lot like Milosevic. Could he be saying that he is, in fact, Slobodan Milosevic, acting like a paranoid and irrational dragon?  If that may be, it would given an imagined perspective on what the war criminal may have been thinking?  Albahari creates two incredibly complicated characters no matter what, who can be wildly irrational and impeccably knowledgeable at the same time.At times, the book seemed to sink into repetitiveness, especially in the early portions when he's seeking insight from the disingenuous Kabbalah teachers.  At other points, the heavy-duty mathematical theories made my eyes cross.  Yet about midway, the novel is propelled forward and feels much more lean. But this is no easy read-it's lengthy and wordy and at times, easy to put down in frustration.  And yet, the story draws you back in. What I took from the book was that someone who is completely lost, whether idealogically or emotionally, will cling to whatever may comfort them or give them a sense of purpose, even if it may be destructive, shallow, or illogical.Special thanks to Houghton Mifflin Harcourt for the Review Copy."}, {"review_sentiment": 5.0, "review_text": "\"Leeches\" by David Albahari is a powerfully poetic and surreal work of fiction. I say \"fiction\" although it lies on the  bedrock of the ugliest of past and recent histories. Despite the first experience of reading a narrative with no paragraph breaks, the writing is not confusing nor chaotic but surprisingly fresh, original and confident. The plot - which seems non-existent at times, more like conversation - grabs one's interest as it piles mystery upon mystery. This is an excellentread. I could not put it down. I am so glad I am now familiar with Mr. Albahari's work."}, {"review_sentiment": 3.0, "review_text": "It's tough to review this book because I firmly believe that it is possible to dislike a book for reasons that have nothing to do with the quality of the writing.  This is such a book for me.  Lest I be accused of \"not getting it,\" let me also state my conviction that it's possible to both \"get\" what a book is trying to accomplish while at the same time not enjoying the read.  Again, this was such a book for me.The book is set in contemporary-ish Belgrade, when an unnamed freelance writer is walking by the river and sees a man slap a woman. The incident is odd and deeply resonant for him.  He uses the incident as a stepping off point for an investigation or quest to determine its meaning, its message and relevance for him -- and that quest leads him to an anti-Semitic conspiracy, experts in the Kabbalah, and a murder mystery of sorts.The style of the book, while symbolic of its author's view of society -- chaotic, jumbled, full of meaningless detail -- makes the book a tough read.  It's styled as a single paragraph, and is written in stream-of-consciousness style.  The narrator is somewhat unreliable, frequently smoking pot and suggesting to the reader that perhaps some -- all?  most? -- of his reaction to the bizarre events and his attempts to find significance in them are a sort of marijuana-induced paranoia.Readers who like absurdist fiction, who don't mind stream-of-consciousness style, who are willing to go along for the chaotic ride of a book like this will no doubt enjoy the book and find it original, creative and an interesting meditation on Serbian politics.  If your taste runs in a different direction, though, you will likely find this challenging, frustrating and perhaps unsatisfying, as I did."}, {"review_sentiment": 3.0, "review_text": "Words come and words go, but tiny fragments of them stay around forever. Piles of discarded words reflect light like diamonds and we can plunge in to see what we might retrieve, what gems we might capture.  David Albahari (and his fantastic translator) construct a word palace which doesn't exist, but then, after you read it, it does.  Or it doesn't, that's not important.  Serbia in the late 1990s was a dark place, full of awakened and polished hatreds, with all the words that go with them.  Anti-Semitism reared its ugly head once again, along with anti-Roma, anti-Albanian, anti-Croat sentiment and the game of all so-called patriots in this world---blame somebody else for your own shortcomings.  The Jews construct an elaborate plot to fend off impending attacks by the rabid right, roping in the (non-Jewish) author who is a free-lance journalist.  How they do it, and what kind of plot it is, and whether it is successful is what you are going to learn if you read this book.I warn surfers that it's not an easy read.  Albahari has a \"thing\" against quotation marks and paragraphs.  The whole 309 page text is one paragraph.  William Faulkner eat your heart out !  There is not a single quotation mark either.  The story is not clear.  The author confesses that he has no idea what he is getting into, or why.  You, the reader, often feel the same way.  You run across numerous aphorisms and slightly nutty semi-philosophical remarks fueled by excess ganja; the details of Belgrade life may interest you as you go.  The Kabbalah plays a major role in the story, so if you have zero idea what that is, I recommend you skip this novel entirely.  I felt that Albahari owes something to Stanislaw Lem, Milorad Pavic, and to Orhan Pamuk (especially \"The Black Book\").  If you are looking for a Pythonesque \"something completely different\" you have definitely come to the right place.  I think the writer is going to be better known in future and I would be willing to read something else by him, especially if he learned to love punctuation.  Albahari definitely uses brilliant language, has many original ideas, and is no writer of soap operas.  Try it, you might like it.  Or maybe not.  \"Leeches\" may refer to the blood-sucking propensities of fascist thugs, but otherwise, they don't play more than a crawl-on role here.  \"Marko Takes a Powder\"---could be an equally vague title.P.S.  The title of my review may be understood if you read the book."}, {"review_sentiment": 4.0, "review_text": "Several times throughout this wonderful novel the protagonist considers the parallels that his story shares with Borges' short story about a villainous and infinite text, \"The Book of Sand.\"  In that story, a fictional Borges initially stands in awe of the inexhaustible document, for which he very symbolically trades in an old family Bible.  The Book of Sand promptly turns from a treasure into a nightmare.The nameless narrator of Leeches is covertly gifted a similar text, a Kabbalistic manuscript that lures him into a web of political and cultural conspiracies rooted in the resurgence of Antisemitism in prewar Serbia.  He returns again and again to the manuscript, which he discovers is quite literally a living document.  Imbued with the secrets of Jewish mysticism, the animate words are in a constant state of movement and expansion - a textual golem.Not surprisingly, the narrator is confounded by the burning issues of semiotics.  Words are the substance by which we are able to give shape to the formlessness of thought and memory, just as in the Jewish tradition God spoke the universe out of the void.  But words are also unreliable, a point the narrator illustrates with his circular, stream-of-consciousness narration.  Due to the inevitable slippage between signifier and signified (that is between word and concept), meaning can never be fixed.  Reality is thereby essentially subjective, meaning that the narrator is tasked with recounting his story to us via a form that is incapable of expressing the truth.As this review no doubt indicates, this is a highly philosophical novel, and one that is not always easy to read.  It is so labyrinthine that, like the Book of Sand, I would not be surprised to pick it up for a second time and find a different story.  And a book like this practically demands subsequent readings.In addition to Borges and Eco, Leeches inspires comparisons to Gogol.  One cannot miss the gravity of the time and setting of the novel: Serbia on the eve of what is often bewilderingly referred to as the world's first \"humanitarian war.\"  I thought often of \"Diary of a Madman\" while reading this novel, and of Gogol's playful but profound revelation that it is frequently not the man who has lost his mind, but his world."}, {"review_sentiment": 3.0, "review_text": "I went through several different stages while reading this novel set in Serbia in the 1990s. It's written in a strange way, with long, curling, almost endless sentences and no paragraphs so that reading it sometimes feels like plowing through treacle. Also, the author is apt to spring abrupt time changes on us in mid-sentence or mid-narrative and he delights in playing mind-games with the reader. \"I was tired of everything else, tired of the stories that fed on themselves, that never moved forward, just as the colored point on a spiral always appeared to stay on the same spot, though it is constantly spinning,\" the narrator says at one point, perfectly anticipating the response of the readers -- or at least this reader. And then in another place, he comments, \"Stories are orderly, the threads of stories are harmoniously arranged, what I am doing here is more a reflection of life which is chaotic, with too much going on.\"The book begins with the narrator, a young journalist, witnessing a man slapping a young woman in the face near the shores of the Danube. This incident becomes an obsession and our hero, between bouts of smoking weed, soon finds himself embroiled in a complex web that seems to involve Jews, anti-Semitic thugs, mathematics and mysticism. My first response as this incoherent, and often illogical text unwound, was to evoke the name of Kafka. The narrator seems stuck in a nightmare of his own making. And the author self-consciously at one point seems to refer to Kafka when he cites an incident in which he and a neighbor get rid of an infestation of moles by clubbing them to death. \"The Burrow\" is just one paranoid story by Kafka involving moles.But as the book progresses, the references to the specific time and place become more pointed and the author's critique of the Serbia of Milosevic becomes more and more specific. \"The times we were living in required a haven from reality, which could only be found by living everyday life in a fantasy or by reading meanings into reality,\" the narrator comments. And some pages later he adds, \"We live in a country that does not exist, composed of refracted reflections in a game of light and dark, so we do not exist, or rather we exist only as shadows on a wall with no substance or duration.\"  And finally, \"Regrettably the entire system of government has been corroded by moral and political corruption ... the connection between organized crime and the political hierarchy is clear. ... Reality had reached a mind-boggling degree of ugliness; we were living under a dictatorship pretending to be a democracy which was closing in ever more tightly around anyone who dared voice a divergent opinion ... the feeling of powerlessness to change anything ate at people like a stomach ulcer.\"At this point, I was quite involved in this book and impressed by the way the author had slowly led me in, using sly, indirect narrative techniques to create a powerful critique of an evil society which he clearly equates to Nazism.Unfortunately, it all peters out into a highly weird, and to me difficult to decipher denouement relying on mystical mumbo-jumbo. As the book nears its climax, the author retreats once more from clarity into willful obscurity and a message that once seemed clear and strong loses its focus -- and its power."}]}, "authors": ["David Albahari", "Alexandra Rasic Radosavljevic"], "isbn": "0151015023", "longitude": 20.4568974, "periods": ["1900s", "Recent Releases"], "title": "Leeches", "word_cloud": "much contemporary fiction wrong place serbian writer live confuse mash domestic violence antisemitism recent politics write unstructured stream consciousness style english version translate serbian problem case find confuse dense difficult meaning title mystery author also activist legalization marijuana bit purple author receive literary award write mean suspect critic sometimes give award incomprehensible work rather admit nothing get buy lot amazon offer happy surprise saw cheap list list summer recommendation lot historically interest info eastern level entertainment prefer prose almost peppered symbolism cover art diagram memory demanding entire basically paragraph chapter enjoy challenge definitely something ready occult reference appeal make palatable sure way say organization cling story unfolds take idea chaos theory basic form butterfly flap wing thunderstorm emerge definitely intelligent laced subtlety author want hand leave participation take care deepen review change gist obviously review ready originally write translate strong relationship nationality political view many time intrinsically link religious view people font think beach first try hook mark later striking beginning take proceeds continual whole paragraph manner time feel overwhelmed word seem come deluge put main conceit grand tradition conspiracy theory literate kind hunky one set author superb literary skill course translator skills read naturally smoothly kept interested meh feeling towards relatively slim page length pack quite lot stuff read twice size action drama quite lot tense moment end good small niggle present tense rather narrate year later little suspense final outcome narrator dense reward be anything truly meaningless newest protagonist battle concept trivial significant life common enough problem anyone someone go political ethnic war complex begin witness random act violence woman slap man shock sear yet seem tame compare violence perpetrate region conflict now obsessed try find woman incident take take search find look clue everywhere suddenly everything broader meaning feel enlighten recognize sign others ignore scrap paper ground door open appear relate search closest friend try back reality cautiously clearly point flaw think suffer sort stress disorder simply paranoid even paranoid person right sometimes proceeds rapidly consult mathematical expert fear math mystic order piece together accept reality set perfect labyrinth story seek answer old new portion city ruin new portion come possibly best explanation people become racist ethnic hatred prevalent lengthy excerpt worth insight ethnic group effect hatred fear fear fear change presence others say dislike list express fear influence influence genuinely symbolically represent force give conviction matter uprooting conviction matter irrational represent uprooting personality change brand isolated expel necessary utterly destroy main character significant time frame surprising discus political issue paranoia part character name sound awful lot say fact act paranoid irrational dragon give imagined perspective war criminal create incredibly complicate character matter wildly irrational impeccably knowledgeable time seem sink repetitiveness especially early portion seek insight disingenuous teacher point mathematical theory make eye cross yet midway propelled forward feel much lean easy lengthy wordy time easy put frustration yet story draw take someone completely lose ideologically emotionally cling sense purpose even shallow thanks powerfully poetic surreal work fiction say fiction lie bedrock ugliest past recent history first experience read narrative paragraph break write confuse chaotic surprisingly fresh original confident plot seem time conversation interest pile mystery upon mystery excellent read glad familiar work tough review firmly believe possible dislike reason nothing quality write lest accuse get let also state conviction possible get try accomplish time enjoy set unnamed freelance writer walk river see man slap woman incident odd deeply resonant use incident step point investigation quest determine meaning message relevance quest lead conspiracy expert murder mystery style symbolic author view society chaotic jumble full meaningless detail make tough style single paragraph write style narrator somewhat unreliable frequently smoke pot suggest perhaps reaction bizarre event attempt find significance sort absurdist fiction mind style willing along chaotic ride doubt enjoy find original creative interesting meditation serbian politics taste run different direction likely find challenge frustrate perhaps unsatisfying word come word tiny fragment stay forever discard word reflect light diamond plunge see gem fantastic translator construct word palace exist important late dark place full awaken polished hatred word go reared ugly head along sentiment game patriot world somebody else shortcomings construct elaborate plot fend impend attack right rope author journalist kind plot successful go learn warn surfer easy thing quotation mark paragraph whole page text paragraph eat heart single quotation mark story clear author confess idea get often feel way run numerous aphorism slightly nutty remark fuel excess ganja detail life interest play major role story idea recommend skip entirely felt something especially look something completely different definitely come right place think writer go better know future willing something else especially learn love punctuation definitely use brilliant language many original idea writer soap opera try maybe propensity fascist thug otherwise play role equally vague title review several time wonderful protagonist considers parallel story share short story villainous infinite story fictional initially stand awe inexhaustible document symbolically trade old family promptly turn treasure nameless narrator covertly gift similar text manuscript lure web political cultural conspiracy root resurgence prewar return manuscript discovers quite literally live document secret jewish mysticism animate word constant state movement expansion textual surprisingly narrator confound burn issue semiotics word substance able give shape formlessness think memory jewish tradition speak universe void word also unreliable point narrator illustrate circular narration inevitable slippage signifies signify word concept mean never fix thereby essentially subjective meaning narrator task recount story form incapable express review doubt indicate highly philosophical always easy labyrinthine surprise second time different story practically demand subsequent addition inspire comparison miss gravity time set eve often bewilderingly referred world first humanitarian war think often read playful profound revelation frequently man lose mind world go several different stage read set write strange way long curl almost endless sentence paragraph read sometimes feel plow treacle also author apt spring abrupt time change delight play tire everything else tired story feed never move forward color point spiral always appear stay spot constantly spin narrator say point perfectly anticipate response reader least place comment orderly thread story harmoniously arrange reflection life chaotic much go begin narrator young journalist witness man slap young woman face shore incident become obsession hero bout smoke weed soon find embroiled complex web seem involve thug mathematics mysticism first response incoherent often illogical text unwound evoke name narrator seem stuck nightmare making point seem refer cite incident neighbor get rid infestation mole club death paranoid story involve progress reference specific time place become point author critique become specific time live required reality live everyday life fantasy read meaning reality narrator comment page later add live country exist compose refracted reflection game light dark exist rather exist shadow wall substance duration finally entire system government corrode moral political corruption connection organize crime political hierarchy clear reach degree ugliness living dictatorship pretend democracy close ever tightly anyone dared voice divergent opinion feeling powerlessness change anything ate people stomach ulcer point quite involve impressed way author slowly lead use sly indirect narrative technique create powerful critique evil society clearly equate peter highly weird difficult decipher denouement rely mystical nears climax author retreat clarity willful obscurity message seem clear strong loses focus power", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The place is Serbia, the time is the late 1990s. Our protagonist, a single man, writes a regular op-ed column for a Belgrade newspaper and spends the rest of his time with his best friend, smoking pot and talking about sex, politics, and life in general. One day on the shore of the Danube he spots a man slapping a beautiful woman. Intrigued, he follows the woman into the tangled streets of the city until he loses sight of her. \r\n\r\nA few days later he receives a mysterious manuscript whose contents seem to mutate each time he opens it. To decipher the manuscript—a collection of fragments on the Kabbalah and the history of the Jews of Zemun and Belgrade—he contacts an old schoolmate, now an eccentric mathematician, and a group of men from the Jewish community. \r\n\r\nAs the narrator delves deeper into arcane topics, he begins to see signs of anti-Semitism, past and present, throughout the city and he feels impelled to denounce it. But his increasingly passionate columns erupt in a scandal culminating in murder. Following in the footsteps of Foucault’s Pendulum, Leeches is a cerebral adventure into the underground worlds of secret societies and conspiracy theories.", "asin": "0151015023", "rank": "2453412", "city": "Belgrade", "image": "https://images-na.ssl-images-amazon.com/images/I/615FiBDoknL.jpg", "country": "Serbia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}