{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 21.015851, "ratings": {"num_ratings": 25, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "Good not great.  I enjoyed it but some parts were dragged out. The description of the country and the seasons were good. Story was ok."}, {"review_sentiment": 5.0, "review_text": "excellent writing"}, {"review_sentiment": 5.0, "review_text": "Poignant story of ex-pats living in the high mesa countryside of central Mexico. Exquisite, observational style of writing."}, {"review_sentiment": 4.0, "review_text": "well constructed and easy to read"}, {"review_sentiment": 5.0, "review_text": "A gem of a book.  Read this author's other two books.  They are all so descriptive and captivate.  Do not want to put them down"}, {"review_sentiment": 5.0, "review_text": "Great book, especially for those who've traveled to Mexico in the past."}, {"review_sentiment": 5.0, "review_text": "Wonderfully written. A book to be treasured - almost as good as her first."}, {"review_sentiment": 5.0, "review_text": "I discovered Harriet Doerr early last year when I first read Stones for Ibarra and quickly ordered The Tiger in the Grass.  I enjoyed both very much, so I had to read Consider This, Senora.  This one is my favorite!Doerr's authentic characters are so well drawn they feel like old friends -- both the American newcomers to this small village in Central Mexico, as well as the local families.  The landscape is as much a character as the people and it's wonderfully described through the change of seasons and years, fiestas and times of hardship, failures and triumphs.  It is obvious the author loved this part of Central Mexico and its people.There are heartbreaking moments, such as when a child's pup is killed, and the stunning acceptance of sadness that follows.  The juxtaposition of profound sadness and laugh-out-loud humor is common and authentic, too.  I especially enjoyed the way the novel was written in vignettes.  One chapter does not necessarily lead into the next.  Sometimes there are days or weeks in between and different characters hold center stage at different times, so it's a novel that can be read over a period of time, a chapter at a time.  I find when I do this with some books that I have to go back and re-read each time to remember characters and review the setting/situation.  Not so here.  The people and their predicaments, against the background -- beautiful and ugly, harsh and exciting -- are so well realized right from the start that it's easy to pick up where you leave off.This book was a joy to read and the \"happy ending\" was entirely believable and the timing just right."}, {"review_sentiment": 5.0, "review_text": "No one--NO ONE-- has the magical language of Harriet Doerr, and her  ability to take you to and hold you in a place so sensitively but so firmly that you respond as though your body is actually there, take you into that place, those people in such  dimension--tiny, secret, massive, crushing, every day and worn-to-a-shine. With Harriet Doerr, nature becomes an additional character, over arching and singing her song through everyone and everything she hosts. And through me, the reader, too! Holds me captive through her remarkable eye and exquisite language--at once so common and so uncommon. I would say to anyone who wants a full story with all of its heights and falls, its public and private faces, its layers and hearts of different shapes and sizes, \"Don't miss Harriet Doerr. She will give you magic you'll never forget, like the cook whose piecrust melts in your mouth in such a deeply delicious  way that you must carry it with you as if in your physical memory ever everafter."}, {"review_sentiment": 5.0, "review_text": "I loved this book. It's an easy read. I didn't have trouble connecting with the book or it's characters as some have said. The story is amazing and to each there own. It's a book that you don't want to lay down, it's a shame that the story wasn't longer."}]}, "authors": ["Harriet Doerr"], "isbn": "0151931038", "longitude": -101.2528698, "periods": ["1900s"], "title": "Consider This, Senora", "word_cloud": "good great enjoy part drag description country season good ok excellent write story live high mesa countryside central observational style write well construct easy gem author descriptive captivate want especially travel past wonderfully write treasured almost good first discover early last year first stone quickly order enjoy much favorite authentic character well draw feel old friend american newcomer small village well local family landscape much character people wonderfully describe change season year fiestas time hardship failure triumph obvious author love part heartbreaking moment child pup kill stunning acceptance sadness follow juxtaposition profound sadness humor common authentic especially enjoy way write vignettes chapter necessarily lead next day week different character hold center stage different time period time chapter time find go back time remember character review not people predicament beautiful ugly harsh excite well realize right start easy pick leave joy happy end entirely believable timing right magical language ability take hold place sensitively firmly body actually take place people dimension tiny secret massive crushing day nature become additional character arch singing song everyone everything host captive remarkable eye exquisite language common uncommon anyone want full story height fall public private face layer heart different shape size do give magic never forget cook piecrust melt mouth deeply delicious way physical memory ever eve rafter love easy trouble connect character say story amaze want lay shame story longer", "genres": ["Fiction & Literature"], "summary": "The long-awaited and highly praised second novel by the author of Stones for Ibarra. The American characters here find themselves waiting, hoping, and living in rural Mexico - a land with the power to enchant, repulse, captivate, and change all who pass through it. \r\n\r\nNamed a Best Book of the Year by Publishers Weekly and a Notable Book of the Year by the New York Times.\r\n\r\n\"A beautifully rendered novel in which the happy endings are more eloquent epiphanies than facile plot wrap-ups--and a second novel well worth the wait.\" Kirkus Reviews", "asin": "0151931038", "rank": "1353694", "city": "Guanajuato City", "image": "https://images-na.ssl-images-amazon.com/images/I/51nezC2ncKL.jpg", "country": "Mexico", "story_arc": ["Tragedy", "Things only get worse"]}