{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 293, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Written based upon his real-life experience as a scullery worker in a Paris hotel and a tramp in London, George Orwell's recounting of the stories of the impecunious stands alone in its authenticity of the content and veritability of the experiences  The substantiality of poverty was boredom and inconvenience, according to Orwell because poverty freed people from standard s of ordinary behaviors. Nevertheless, this book is not a book of socialist manifesto that urges the impecunious to revolt against the establishment, nor a pamphlet for advocating the right s thereof. It's an investigative report on the people on the lowest and/or lower rungs of a social ladder  Orwell hoped that his readers would at least change their acerbic views on the low and the lowest because their situations were created through no fault of their own or voluntarily. And I hope there will be more like this book in our time."}, {"review_sentiment": 5.0, "review_text": "This book is timeless"}, {"review_sentiment": 5.0, "review_text": "Great and such an unusual glimps of a different world"}, {"review_sentiment": 5.0, "review_text": "Greatbbook"}, {"review_sentiment": 4.0, "review_text": "Yup, that pretty much sums up what it was like in 30s. Still, there was a hint of hilarity to it. I wouldn't chose to read this again but it wasn't bad."}, {"review_sentiment": 5.0, "review_text": "This is an autobiography of George Orwell, known in real life as Eric Blair, when he spent some time on the streets of Paris and London when he, in his early years (1920s or 30s) was destitute. Then, Blair, who I shall refer to Orwell as his real name, was starting out as a journalism/writer, after World War I (The Great War). Eric Blair doesn't explain how he ended up in this situation of poverty in the first place, but does provide a good account of his life on the streets of Paris and London, and his struggle to survive day by day.It was rough. Blair live hand to mouth, and being among the tramps, beggars, the destitute, he always had to watch his back, for there was always someone out to take his money, clothes, food, anything, at the first chance he gets. Needless to say, Mr. Blair survived and was able to give a clear account.The book is evenly divided between his stints in Paris, then London. He covers Paris first. Paris is pictured as the lap of luxury, fashions, French architecture. I've been there myself, and it is amazing. Deep down below, in the unseen sections, are the workers, the dishwashers, those who do the dirty jobs to keep Paris glittering. Blair worked as a dishwasher and other similar, back breaking jobs at luxurious hotels, where the work was hard, conditions were unsanitary, and the pay was low. He literally had to pawn his clothes, look for the cheapest rooms to rent, and worked sometimes for 18 hours a day, with very little time to sleep. There were tough bosses and tough landlords, and he had to be tight with his money, buying the cheapest, and lowest quality food. Blair did have buddies to team up with, looking out for each other, and being there for the other when he was starving. Survival produces enemies off the streets, but it also produces great friendships. Blair had to take whatever job was available, for one hotel was opening up promising good paying jobs, but there were delays, so one could not depend on any \"promises,\" for anyone.London had it own adventure. Here Blair was traveling from spike (a hostel like place where tramps could spend one and only one night, with strict rules with a jail sentence for violating them) to spike, with a partner named Paddy. Again, there are situations where one smuggles in food and money against the rules, where other tramps steal them, and their clothes. If the tramp complained, he would go to jail. There were religious sponsored hostels, with strict rules also, and this simply tells of the travels of Blair and his buddy, obtaining money and food and shelter for the night.In this book, Orwell/Blair does sympathize with the tramp, where his present situation is not always his fault. These are situations where one loses a job, then his home because he was unable to pay for it, or could never find a job, or many other reasons. This is very similar to today's situations where people are evicted from their homes forcing them to live out on the street or in their cars.This book is a chronicle of what these people go through, and their actions are a result of their desperate attempt simply to survive."}, {"review_sentiment": 5.0, "review_text": "Very informative read. Especially if you've always had enough to eat."}, {"review_sentiment": 4.0, "review_text": "When I read tthis book the first time several years ago, I thought it was among the best I had ever read. Now, upon re-reading this quasi-journalistic account of Orwell's trysts with poverty and destitution, I still feel that it is quite up there as one of my most memorable reads, but I was slightly uncomfortable with the anti semitic messaging. Nevertheless - I am assuming that Orwell must have reflected upon this during the war that followed not long after he wrote the book - it contains some very memorable lines, such as the one noting that one has gone to the dogs and one can stand it, and that there is a relief in knowing oneself genuinely down and out.I think the second part on tramping was a bit of a drag compared to the first. Overall, a great read."}, {"review_sentiment": 5.0, "review_text": "This isn't one of those escapist books where you read about grand ballrooms and beautiful women who are spies with guns and also very rich.  This is actually the complete opposite. Dispatches from the trenches. And it's a great book..a part of history. Recommend highly."}, {"review_sentiment": 5.0, "review_text": "This is a classic - and it was fun to go back and re-read it decades later!"}]}, "authors": ["George Orwell"], "isbn": "015626224X", "longitude": 2.3514992, "periods": ["1900s"], "title": "Down and Out in Paris and London", "word_cloud": "base experience scullery worker hotel tramp recount story impecunious stand alone authenticity content veritability experience substantiality poverty boredom inconvenience accord poverty freed people standard ordinary behavior socialist manifesto urge impecunious revolt establishment pamphlet advocate right thereof investigative report people lowest lower rung social ladder hop reader acerbic view low lowest situation create fault voluntarily hope time timeless unusual gimp different world greatbbook pretty much sum still hint hilarity bad autobiography know real life spend time street early year destitute then real name start explain end situation poverty first place provide good account life street struggle survive day live hand mouth tramp beggar destitute always watch back always someone money clothes food anything first chance get say survive able give clear evenly divide stint cover first picture lap luxury fashion french architecture amaze unseen section worker dishwasher dirty job glitter work similar back break job luxurious hotel work hard condition unsanitary pay low literally pawn clothes look cheapest room rent work sometimes hour day little time sleep tough boss tough landlord tight money buying cheapest lowest quality food buddies team look starve produce enemy street also produce great friendship take job available hotel open promise good pay job delay promise adventure here travel spike hostel place tramp night strict rule jail sentence violate spike partner name situation smuggles food money rule tramp steal clothes tramp complain jail religious sponsor hostel strict rule also simply tell travel buddy obtain money food shelter sympathize tramp present situation always situation lose job home unable pay never job many reason similar today situation people evict home force live street chronicle people go action result desperate attempt simply survive very informative always enough eat this first time several year think best ever now account trysts poverty destitution still quite memorable read slightly uncomfortable anti semitic messaging assume war follow long write contains memorable line note go dog stand relief know genuinely think second part tramp bit drag compare first overall great escapist grand ballroom beautiful woman spy gun also rich actually complete opposite trench great part history highly classic fun go back decade later", "genres": ["Essay", "Social & Cultural Studies"], "summary": "Written when Orwell was a struggling writer in his twenties, it documents his 'first contact with poverty'. \r\n\r\nHere, he painstakingly documents a world of unrelenting drudgery and squalor - sleeping in bug-infested hostels and doss houses of last resort, working as a dishwasher in Paris's vile 'Hôtel X', surviving on scraps and cigarette butts, living alongside tramps, a star-gazing pavement artist and a starving Russian ex-army captain. \r\n\r\nExposing a shocking, previously-hidden world to his readers, Orwell gave a human face to the statistics of poverty for the first time - and in doing so, found his voice as a writer.", "asin": "B0041E7WHU", "rank": "2406738", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/4188m0qCLNL.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}