{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 64, "rating": 3.8, "reviews": [{"review_sentiment": 2.0, "review_text": "A well written very dull book. I could not finish it."}, {"review_sentiment": 2.0, "review_text": "First of all, let me begin by saying Robert Wilson is a good writer who seems to have written a disjointed and disappointing book. Secondly, I have rarely struggled so hard to get through a suspense-thriller... until I realized this book was not really in that genre (being neither suspenseful nor thrilling). Thirdly, some people will love this book... and apparently do based on the other reviews here. Fourthly, the Company of Strangers needs a better title. Still not sure what the title is about. Finally, Robert Wilson won't be hurt by a bad review. He sold enough copies of his debut thriller to stay in this industry for a long time. So although I rarely give 2 stars to anyone, here I go. Full disclosure: this is the first time I have ever reviewed a book without reading it cover to cover. I simply ran out of energy. Had to pick up a Joseph Wambaugh police mystery to get my blood stirring again.Robert Wilson writes with that sturdy English prose that almost always ensures a pleasurable read. Almost. I was looking for something that would read like Eric Ambler or John Le Carre or Philip Kerr. The cover blurb and title suggested I'd hit pay dirt. The opening chapters, focused on the German intelligence officer, Kurt Voss, and the WWII setting did the trick and drew me in. Then I met the female lead, an unsympathetic, unrealistic female named Andrea Aspinall. At first I assumed she was a minor character, an immature 20 year old who hates her mother. Then we discover she has a head for mathematics (how we know is never clear -- she is no Oxford or MIT grad school student -- just a self-centered, adolescent piano plinker). She goes to a shake-and-bake spy course and then on to Lisbon, Portugal where, in the span of 48 hours, she meets all of the country's elites, bumps into all the Portuguese, German, Romanian, Italian, American and British expatriates in the industrialist/smuggling/espionage/wife-swapping/mistress-murdering social scene, becomes the houseguest and object of obsession of a strangely spooky Irish castle lord and his mentally ill, Portuguese wife, blows her cover story to an Italian-Jewish double-agent AND starts an affair with the German Voss who, come to find out, is also a double-agent working for the British. Did you get all that? And in 48 hours! Full disclosure: I have been to Lisbon and am amazed at how easily our leading lady gets around town in those 48 hours -- not likely in the Lisbon I've visited!  Robert Wilson is a terrific descriptive writer. But in this book he is hot-dogging. The descriptive prose piles higher and higher on every page and for even the most obscure trifles of objects. I got lost in the sauce and found every chapter a slog. I skipped ahead and discovered that parts two and three take place decades in the future. Now I fear that the whole thing must be read in real time and it will take me decades to finish. So I stop... sorry. But hey, this is real gothic romance stuff complete with castle and deep female POV -- it should have been called The Dark Lord of Lisbon and sported a cover illustration of a woman in a nightgown fleeing a shadowy castle (a scene that occurs repeatedly in this novel). So if that kind of stuff suits your fancy, by all means, read on!"}, {"review_sentiment": 4.0, "review_text": "A very engaging book giving an insight into the unique position of Portugal in WWII. Well worth reading."}, {"review_sentiment": 5.0, "review_text": "The Company of Strangers Just finished the Kindle edition of A COMPANY OF STRANGERS by Robert Wilson -- WW2 story set in Lisbon and Germany and then post war moved to East Germany and England. This is a historic exploration of the spy organizations that began with SOE and the Abwehr. The ending was a twist I never saw coming. I loved that! And what made it even spicier was: WHAT IF IT WERE TRUE? Stranger things have happened."}, {"review_sentiment": 4.0, "review_text": "Thoughtful, provocative, and tightly woven tale of mixed and conflicting loyalties during and after World War II.  In an odd twist for the genre dominated by males writing about manly adventure, historical spy fiction, the protagonist is a woman, who, lured by patriotism becomes a British agent, who falls in love with a German agent, who is working a double, maybe a triple game.  She is lured again to provide information to the Russians, and then makes a discovery about her distant and cold mother that only makes sense if you read to the end.I have read several other of Wilson's books, and this is among his better efforts."}, {"review_sentiment": 2.0, "review_text": "I loved A Small Death in Lisbon, and I was prepared to love this book too.  However, I did not.  It had its moments.  The Lisbon setting in particular was engaging.  The character who seemed the most interesting and best defined was Voss.  But others, particularly Anne, were inconsistent.  She behaved foolishly and impulsively...not at all the way anyone with the slightest bit of spy training would behave.  That a person so young, whether a mathematician or not, would have been chosen to be a spy, strains crediblity.The plot was ambitious and seemed to flag as the story went on and on.  There were enough good moments to keep me going, for example, Anne's reunification with her mother, who turned out to be very interesting.  But I skipped more and more pages as the story lumbered on.The ending left me unsatisfied.  It was okay but I felt that having toughed it out for so long, there could have been a better payoff."}, {"review_sentiment": 5.0, "review_text": "Totally awesome book. Had to read his other book that takes place in Lisbon"}, {"review_sentiment": 5.0, "review_text": "A great spy story covering several decades from the second world war up till the fall of the iron curtain."}, {"review_sentiment": 4.0, "review_text": "I love his writing as it combines intrigue with well researched historical underpinnings. I would highly recommenced all of his novels"}, {"review_sentiment": 5.0, "review_text": "Great."}]}, "authors": ["Robert Wilson"], "isbn": "0156027100", "longitude": 13.3888599, "periods": ["1900s"], "title": "The Company of Strangers", "word_cloud": "well write dull let say good writer seem write disjoint disappointing secondly rarely struggle hard get realize really genre suspenseful thrill thirdly people love apparently base review need better title still sure title bad review sell enough copy debut thriller stay industry long time rarely give star anyone go full disclosure first time ever review read cover cover simply run energy pick police mystery blood stir write sturdy prose almost always ensure pleasurable look something cover blurb title suggest hit pay dirt opening chapter focused german intelligence officer set trick draw then meet female lead unsympathetic unrealistic female name first assume minor character immature year old hat mother then head mathematics know never clear grad school student adolescent piano plonker go spy course span hour meet country elites portuguese german romanian italian american british expatriate social scene become house guest object obsession strangely spooky castle lord mentally ill wife blow cover story start affair german come find also work hour disclosure amaze easily lead lady get around town hour likely visit terrific descriptive writer descriptive prose pile higher higher page even obscure trifle object get lose sauce find chapter slog skip ahead discover part take place decade future now fear whole thing real time decade so stop sorry hey real gothic romance stuff complete castle deep female call sport cover illustration woman flee shadowy castle scene occur repeatedly kind stuff suit fancy mean engage give insight unique position read finish edition story set war move historic exploration spy organization begin end twist never saw come love make even spicier thing happen thoughtful provocative tightly weave tale mixed conflict loyalty odd twist genre dominate male write manly adventure historical spy fiction protagonist woman lure patriotism becomes british agent fall love agent work double maybe triple game lure provide information make discovery distant cold mother make sense several better effort love prepare however moments set particular engage character seem interesting best define others particularly inconsistent behave foolishly impulsively way anyone slightest bit spy training person young mathematician spy strain plot ambitious seem flag story go enough good moment go example reunification mother turn interesting skip page story lumber end left unsatisfied okay felt toughed long payoff totally awesome take place great spy story cover several decade second world war till iron curtain love write combine intrigue well researched historical underpinnings highly novel great", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII"], "summary": "The stifling summer streets of Lisbon are teeming with spies and informers when Andrea Aspinall, an English mathematician turned spy, disappears under a new identity. Military attaché Karl Voss, experienced in the illusions of intrigue, arrives in Lisbon under the German Legation, though he is secretly working against the Nazis so that atomic and rocket technology do not find their way into Hitler's hands.\r\n\r\nIn the lethal tranquility of a corrupted paradise Andrea and Karl meet and attempt to find love. Tragically, a night of violence leaves Andrea the keeper of a secret that triggers a lifelong addiction to the clandestine world. From Portugal to England and finally Cold War Berlin, she gradually discovers that the deepest secrets aren't held by governments, but by those closest to you.\r\n\r\nAward-winning novelist Robert Wilson transcends the genre of spy novels in The Company of Strangers, a thrilling page-turner yet also an imaginative and affecting tale of romance. \r\n", "asin": "0156027100", "rank": "1101124", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/41tAsfiTB-L.jpg", "country": "Germany", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}