{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 15, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Regret is inevitably linked to time travel. This is so since harboring regret necessarily means one wishes to return to a time in the past and do things differently.Herman harbors regrets. An episode in his past ended badly. Even under the best of circumstances, he is not comfortable in the present. He finds refuge in the classics, where he finds more companionable associations than he does in the present.His death presents an opportunity to revisit the past. Alas, he is merely an observer, doomed to relive the events, powerless to change them. In the end, he realizes recounting events, rather than revising them, is sufficient to ensure passage to the other side. Yet it remains a story tinged with regret.This cyclical nature forms the basis of The Following Story and Nooteboom use it to deftly fashion a satisfying novel."}, {"review_sentiment": 5.0, "review_text": ":)"}, {"review_sentiment": 5.0, "review_text": "I will simply reiterate what many other reviewers have already mentioned. In a very thin volume, the author manages to weave existential musings, allusions to classical philosophy, and a tight plot that magically read like a much longer novel. The use of Portugal and a voyage to Brazil are wonderful touches that lend an air of mystery and sadness that intuitively seem more at home than were the events to entirely take place in the author's native Holland. Well worth a read, if not several."}, {"review_sentiment": 5.0, "review_text": "Anybody reading these words probably knows the Dutch poet and novelist Cees Nooteboom is one of the finest literary writers living in the world today.  Since there are a number of reviews already posted here, in the spirit of freshness, I would like to make several observations about The Following Story and the author in light of what 19th century German philosopher, Arthur Schopenhauer, has to say about aesthetics and the art of the novel.In the very first line of this short novel, Herman Mussert, the narrator and main character, tells us,  \"I have never had an exaggerated interest in my own person, but unfortunately that did not imply I could stop thinking about myself at will, from one moment to the next.\"  Indeed, Mussert is not interested in himself as a flesh-and-blood man of action; quite the opposite, he surrounds himself with books and reads all the time.  Within the first few pages, it becomes clear Mussert's world is the world of words.  We read:  \"Words of polished marble drive out the most evil fumes.\"  And to have such polish, Musset's words can't be the modern words ordinary people use in day-to-day conversation; rather, he goes on to tell us, \"Our modern languages are altogether too wordy, look at any bilingual edition: on the left the spare, measured Latin phrases, the sculptured lines, on the right the full page, the traffic jam, the jumble of words, blathering chaos.\"Let's pause and reflect on how such a life relates to Schopenhauer's aesthetics.  For Schopenhauer, aesthetic experience happens when we rise above our preoccupation with our own will, our own individual survival, and, using art as a medium, observe the material, mundane world from a conceptual distance.  For example: instead of participating in an actual love affair, we go to an art museum and stand before a painting of two people in love and behold the ideas (love, passion, yearning, attraction) the artist is portraying, and thus, as objective observers, we develop a clear, painless understanding of the dynamics of human emotion.Of course, such objective observation is precisely what Herman Mussert experiences with his immersion in Ovid, Tacitus, Cicero and other ancient writers.  At one point he reflects:  \"Whenever (I take off my glasses) I feel like a tortoise without a shell.  That is to say, in the intimate proximity of the female body I am the most defenseless of creatures.  Which explains why I kept largely aloof from those activities which everyone is always going on about and which, to me, have more to do with the animal kingdom than with human beings who concern themselves with less tangible aspects of existence.\"However, Mussert tells us he lost his objectivity once when he was thirty years old in Lisbon. \"Now for once I belonged to the ranks of ordinary people, the mortals, the rest, because I was in love with Maria Zeinstra.\"  A married woman driven to avenge her husband's infidelity, Maria pulls Herman down from his aesthetic observation post and thrusts him into the nitty-gritty of a passionate affair. \"And so now I was in love, and thus a member of the same weak, glutinous fraternity of one-track-minded automatons which I have always claimed to despise.\"  Schopenhauer would nod his head, understanding how the raw forces of the universe are too powerful for us to escape completely; aesthetic distance happens at points in our lives, it is not a permanent state.And Mussert's passionate affair has dire consequences.  He relays how on one sunny afternoon he was dragged out to the playground by Maria's enraged husband and became a public spectacle, beaten up and humiliated in plain sight of everyone - students, teachers, administrators.  For a man who lives his life at an aesthetic distance, a distance he creates through his books and ancient literature, this is a complete role reversal.  For once Mussert is the actor on life's stage and all those ordinary mortals he despises get to be the spectators. Is it any wonder years later he wakes up in Lisbon having gone to bed the night before in Amsterdam?  Such an experience would certainly make a deep impression on a sensitive man of letters predisposed to live his life in solitude, reading, surrounded by his books.According to Schopenhauer, drama, being a superb reflection of human existence, can show life unfolding in three ways: what is merely interesting, what is sentimental, and what is tragic -- specifically on the tragic, Schopenhauer's words are: \"At the highest and hardest stage the tragic is aimed at: grievous suffering, the misery of existence is brought before us, and the final outcome is here the vanity of all human striving.\"  Cess Nooteboom echoes Schopenhauer's tragic sense when he has Mussert reflect on a photograph taken by the Voyager at six billion kilometers away from the earth, \"That sort of thing does not impress me.  My tiny lifespan, the utter insignificance of my existence, they are no more microscopic for being viewed from such a distance.\"Respecting the writing of novels, here is a Schopenhauer quote: \"A novel will be the higher and nobler the more inner and less outer life it depicts . . . The art lies in setting the inner life into the most violent motion with the smallest possible expenditure of outer life; for it is the inner life which is the real object of our interest - The task of the novelist is not to narrate great events but to make small ones interesting.\"  The Following Story is a tour de force of the inner life.  And Mr. Nooteboom makes the small events in Mussert's life not only interesting for the reader but deeply probing and profound.*The above Schopenhauer quotes are from `Arthur Schopenhauer - Essays and Aphorisms' published by Penguin Books and translated by R.J. Hollingdale."}, {"review_sentiment": 4.0, "review_text": "I picked this up because there was a funny looking troll on the cover and it seemed to garner praise. Yikes! This book was an absolute delight. It's not often an author can address the big questions in so few pages, and Nooteboom writes with total originality. Of course, it's translated from the Dutch, so credit to the translator, too. Gah! The problem of translation. Anyhow, this book is worth a look. Get lost for half a day with this little killer."}, {"review_sentiment": 5.0, "review_text": "A novel which brings to mind Cristina Peri Rossi's dazzling The Ship of Fools cannot be too far from brilliant.A wonderful read with depth which will inspire many a return.For readers of Nooteboom (and Peri Rossi for that matter) it appears more than one lost paradise is to be found within."}, {"review_sentiment": 5.0, "review_text": "This book introduced me to Nooteboom and what an introduction it was! Nooteboom is a master, no words could do this work justice. Buy it, read it and i promise you, you will be re-reading it more times than you want to."}, {"review_sentiment": 5.0, "review_text": "Herman Musset, a quiet, introverted teacher of Latin and Greek, and who spends all of his time reading. He writes travel guides under the name of Dr Strabo, and calls it 'a moronic activity whereby I earn my living'. In his spare time - when he is not reading - he translates Ovid's Metamorphosis, a translation he wants nobody to see because, 'Our modern languages are altogether too wordy...the traffic jam, the jumble of words, blathering chaos.'He falls asleep one night in his home in Amsterdam, and awakens in Lisbon, twenty years previous. He is unsure if he is dead, or has been transported back through time, or whether he is hallucinating. Or, maybe, some other possibility that he cannot imagine. All he knows is that the room he woke up in, the room in Lisbon, is the very same place where he slept with another man's wife.In waking up in this room, he remembers the actions of all those years ago and the people that were affected. Lisa d'India, a talented, beautiful student, he remembers the best. She was loved by all for her intelligence, loved by Herman for the ideal she represented. He admired her, appreciated her skill with Greek, but he did not love her in the carnal sense, the way every else seemed to. For Herman, sexual love '[has] more to do with the animal kingdom than with human beings, who concern themselves with the less tangible aspects of existence.'Lisa d'India is loved, most especially, by Arend Herfst, a poet and basketball teacher. He begins a relationship with the girl, and it seems that everyone but Herman is aware of this. Arend's wife, Maria Zeinstra, begins an affair with Herman, an affair of revenge, not love or lust, and Herman is completely unaware of this fact. Happily, the plot never moves into confusing betrayals or empty, 'romantic' gestures. Instead, we follow the events through the absent-minded, bewildered eyes of Herman. His affair with Maria Zeinstra, an affair that he did not plan and did not really want, is somewhat beyond his talents in people interaction. He does not know how to handle her, and luckily, does not have to. Herman is used merely as a piece in the strategy game that husband and wife are playing. Yet, Maria's relationship with Herman is not malicious, as far as we can tell, and is oftentimes quite gentle.The clandestine cum love story plot is one that can easily be ignored, and indeed is for most of the novel. The true focus is Herman. He is an amazing character, a learned, intelligent, gentle man, who is 'as ugly as Socrates'. He quotes Ovid, Tacitus and Shakespeare in his meandering confessions, he considers this philosophy or that author, wonders about the state of art and culture, comments on everything with a wry wink to the reader. Herman is a man who enjoys words more than anything else in this world, he enjoys reading them and - while he considers his own talents to be of a poor quality, and useless when compared to the Latin and Greek greats - he loves writing down his thoughts. Through the sarcasm and the negativity towards popular culture, there is a timid yet kind man who just wants to love his books in peace.An explanation for Herman's sleeping in Amsterdam and awakening in Lisbon twenty years earlier is given, but I will not reveal it. Towards the end of the novel, when Herman has relived the most vivid, alive experience of his life, when he has finished recounting an episode when the real world intrudes on his careful, closed existence of words and rhyme, he boards a ship, travelling with six other people, swapping dream-like stories of time and reality. In this section, the sardonic, witty narrator - Herman - all but disappears, replaced with a lazily beautiful chronicler of events of the mind. The transition is seamless and works very well, building up a sort of confused, dreamy tension until the last two amazing pages, and then the final, perfect sentence when the cloud of unanswered questions are blown away and we are left with a brilliant clarity and understanding."}, {"review_sentiment": 5.0, "review_text": "A friend told me, because I love Jim Harrison, Milorad Pavic', and Walker Percy, that I must read Cees Nooteboom. I bought \"The Following Story\". I can't explain this book. Van Morrison meets Rilke. Tom Waits meets Gabriel Garcia Marquez. Bruce Cockburn meets Larry Brown. This mysterious and deeply touching tale reaches heights most only dream of. It is a story of love, questions, regret, hope, death, and desire.Vivillo"}, {"review_sentiment": 4.0, "review_text": "The story starts few minutes before death of Herman Mussert, a teacher of classical languages, and ends few minutes after his death. In this short period of time we learn all the important events of his life. The story is just like a journey to the eternity. It begins in Amsterdam, where Herman is dying of heart attack. It continues in Portugal, where he wakes up and remembers the things happened here years ago that were very important for all his life. The last part of the journey is a journey with the ship over the ocean to the origin of the river Amazon. This is the last part of the journey and it is where the eternity begins.This is also a story of two men and two women, or three teachers and one student. This is a story of love and jealousy or love and revenge. The very important thing in this book is a relationship between materialistic world of science with all his natural principals, and spirituality. The last moments of life are just the right ones to think about the connection between them.The novel is very short. In some way, it is cyclic and written in such a way that at the end the reader has a feeling that the story is beginning not ending. But there is already the time for a following story - the story of the next traveller on the journey to the eternity."}]}, "authors": ["Cees Nooteboom"], "isbn": "015600254X", "longitude": 4.8936041, "periods": ["1900s"], "title": "The Following Story", "word_cloud": "inevitably link time travel harbor regret necessarily mean wish return time past thing harbor regret episode past end badly even best circumstance comfortable present find refuge classic find companionable association death present opportunity revisit merely observer doom relive event powerless change end realizes recount event rather revise sufficient passage side remain ting cyclical nature form basis use deftly fashion satisfy simply many reviewer already mention thin volume author manages weave existential musing allusion classical philosophy tight plot magically much longer use voyage wonderful touch lend air mystery sadness intuitively seem home event entirely take place author native several anybody reading word probably know poet novelist finest literary writer live world today number review already post spirit freshness several observation author light century philosopher say aesthetic art first line short narrator main character tell never exaggerate interest person unfortunately imply think moment next indeed interested man action quite opposite surround read time first page becomes clear world world word word polish marble drive evil fume polish word word ordinary people use conversation rather go modern languages altogether wordy look bilingual edition leave spare measure phrase sculpture line right full page traffic jam jumble word blather chaos pause life relate aesthetic aesthetic experience happens rise preoccupation individual survival use art medium observe material mundane world conceptual distance example instead participate actual love affair go art museum stand paint people love behold idea love passion yearn attraction artist portray thus objective observer develop clear painless understand dynamic human course objective observation precisely experience immersion ancient writer point reflect take glass feel tortoise shell say intimate proximity female body defenseless creature explain keep largely aloof activity everyone always go animal kingdom human being concern le tangible aspect existence however tell lose objectivity thirty year old now belong rank ordinary people mortal rest love marry woman drive avenge husband infidelity pull aesthetic observation post thrust passionate affair love thus member weak glutinous fraternity automaton always claim despise head understand raw force universe powerful escape completely aesthetic distance happen point live permanent passionate affair dire consequence relay sunny afternoon drag playground enrage husband become public spectacle beaten humiliate plain sight everyone student teacher administrator man live life aesthetic distance distance create ancient literature complete role reversal actor life stage ordinary mortal despise get spectator be year later wake go bed night such experience certainly deep impression sensitive man letter predispose live life solitude read surround drama superb reflection human existence show life unfold way merely interest sentimental tragic specifically tragic word highest hardest stage tragic aim grievous suffer misery existence bring final outcome vanity human strive echo tragic sense reflect photograph take kilometer away earth sort thing impress tiny lifespan utter insignificance existence microscopic view distance respect write novel quote higher nobler inner outer life depict art lie set inner life violent motion smallest possible expenditure outer life inner life real object interest task novelist narrate great event make small one interest force inner life make small event life interest deeply probe profound quote publish translate pick funny look troll cover seem garner praise yikes absolute delight often author address big question page write total originality course translate credit translator problem translation worth look get lose day little killer brings mind dazzle far wonderful depth inspire many reader matter appear lost paradise find introduce introduction master word justice promise time want quiet introvert teacher spend time read write travel guide name call moronic activity whereby earn live spare time read translates translation want nobody modern language altogether wordy traffic jam jumble word blather chaos fall asleep night home awaken year previous unsure dead transport time hallucinate maybe possibility imagine know room wake room place sleep man wake room remembers action year ago people affect talented beautiful student remembers best love intelligence love ideal represent admire appreciated skill love carnal sense way else seem sexual love animal kingdom human being concern le tangible aspect existence love especially poet basketball teacher begin relationship girl seem everyone aware wife begin affair affair revenge love lust completely unaware fact plot never move confuse betrayal empty gesture instead follow event bewilder eye affair affair plan really somewhat talent people interaction know handle luckily use merely piece strategy game husband wife play relationship malicious far tell oftentimes quite clandestine cum love plot easily ignore indeed true focus amaze character learn intelligent gentle man ugly socrates quote meander confession considers philosophy author wonder state art culture comment everything wry wink man enjoy word anything else world enjoy read considers talent poor quality useless compare greek great love write thought sarcasm negativity popular culture timid yet kind man want love explanation sleep awaken year earlier give reveal towards end relive vivid alive experience life finish recount episode real world intrude careful close existence word rhyme board ship travel people swap story time reality section sardonic witty narrator disappear replace lazily beautiful chronicler event mind transition seamless work well build sort confuse dreamy tension last amazing page final perfect sentence cloud unanswered question blow away left brilliant clarity understanding friend tell love buy meet meet meet mysterious deeply touch tale reach height dream question regret hope death start minute death teacher classical language end minute death short period time learn important event life journey eternity begin die heart attack continue wake remembers thing happen year ago important life last part journey journey ship ocean origin river last part journey eternity also men woman teacher student jealousy revenge important thing relationship materialistic world science natural principal spirituality last moment life right one think connection short way cyclic write way end feel begin end already time next traveler journey eternity", "genres": ["Fiction & Literature"], "summary": "The hero of the novel is Herman Musset, a quiet man living in Amsterdam who teaches Classics and spends most of his life reading. It seems he has lived an unremarkable life until one morning Herman wakes up to find himelf in Lisbon twenty years earlier in a room where he once made love to a married woman.\r\n\r\nThis bizarre but touching novel will keep you guessing right up to the end. It is gloriously poetic and insighteful and full of literary references. Nooteboom has that rare ability to show wit whilst at the same time tugging on your heart-strings\r\n\r\nWinner of the European Literary Prize for Best Novel, and a New York Times Notable Book of the Year.", "asin": "015600254X", "rank": "1517273", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/511s9lGWQHL.jpg", "country": "The Netherlands", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}