{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 500, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "I found difficulty falling in love with this book. Warren's stark (sorry) portrayal of America's obsession with scandal that swims in the clouds of politics is wholly, unsympathetically, and brutally honest in this huge novel. And it is a huge novel, with interpersonal, interpolitical, financial, and scandalous connections between many characters, all of whom seem to support and promote the candidates that seem to have their own best interests at heart. When Stark comes along, there is no question that he is the people's, and corporation's best demagogue to put into office. He came from nothing and certainly lived the American political dream with all of its terrible consequences and choices along the way.The question for me became, do I care?That answer didn't come for me until about four-hundred pages in, for chapters seven and eight specifically, and straight through to the end of the novel. I enjoyed the opening, but the true heart of the plot begins to pay off as our narrator begins to uncover much of what the entirety of the novel's setup is built for. The writing in the book is excellent, and some paragraphs of description took my breath away (although I will say that there was a strange disconnectedness of some of the longer metaphors).  The narrator's story - one of a writer whose love and devotion, examination, persistence, obsession, investigative curiosity, and that of a man trying to find his place in the world - was much more beautiful to me than Willie Stark's. Unsurprisingly, in the final pages of the book, we meet him as someone resigned to the fact that it is just as much his story (even though he didn't know it at the time).Did I enjoy it? You know, I am not sure. I would say that the book has tremendous merits as an accurate document of American political operations. The book has some amazingly beautiful, funny, violent, and surprising passages, and Warren's prose handles them with an adept swiftness. But I felt like the book was a bit too long, and with a very Gatsby-esque central figure, I wonder if the book needed to be as big as Stark's ego. It was a great book, but one I will likely not pick up again – the Goodreads quotations section might suit my needs for revisiting what beautiful language I will miss when I put it down. The characters are three-dimensional, though, and it is a mirror to the political mess we find America in at times... But the story of the writer was what kept me reading. I do look forward to passing along my BookCrossing – marked copy to friends and hearing what they have to say!I read this book as a selection from two lists I am slowly getting through, the Esquire 75 and The Modern Library 100."}, {"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 5.0, "review_text": "Rich characters with beautifully scripted language. The author takes the reader on a circuitous journey into the lives of fascinating characters."}, {"review_sentiment": 5.0, "review_text": "One of the greatest books ever written."}, {"review_sentiment": 5.0, "review_text": "This is a book that will resonant in my mind for the rest of my life. I learned more about the realities of government and politics from reading this fictional story set in the 1930’s than from any government calls in high school or college. If you want to understand how our government really works – this is a must read. As the saying goes – sausage and laws – two things that we all enjoy but do not want to see made. True words! The egoism, greed, lust, vanity, deception and back-room deals displayed in All the Kings Men help you understand that government is a very corrupt, complicated and messy business.The main character, Willie Stark, is a charismatic man of the people, who appeals to the little man with promises of taking his business to the halls of power and seeing that the working people get a fare shake in government. As you may guess, all his best intentions are soon abandoned as his taste for power and position take hold. To retain his status he must play the game laid out by the powers-that-be – the moneyed establishment who control the true levers of power. At which point, his words do not change, but his conviction and effort on behalf of the people who believe in him diminish greatly.Lest on believe that this is a story of days gone by one need only reflect for a moment on our current government (local, state and federal). Most people hate the government, hate congress – but like their own representative. Year after year we elect candidates who promise reform, change, to end corruption, to shrink government, or solve all our problems or whatever it takes to get elected. I believe that many of these individuals believe that they can actually do some of these things if given the opportunity.Then they into the black hole of capital politics and their visions of serving the people and cleaning up the government get flushed down the toilet. No representative can solve our governmental crisis for us – it requires deliberate involvement by every citizen to do so – but we are way too busy trying to get through our own days to do such work – so we abandon it to our elected officials (can you say vicious circle?). And here we are!All the Kings Men is an education in individual responsibility. Looking behind the curtain to see the motivation and machination of government is a great reminder that each of us must take responsibility for maintaining the integrity of our political system. We must hold our elected officials accountable, know our history, understand the foundations of our system, recognize its importance and not allow the cult of personality to degrade it value or legitimacy. Don’t fall in love with the smile – listen to their words and  hold them accountable for what they say and do – failure to do so is to surrender your autonomy and independence.It is not uncommon to believe that our elected officials are off at the capital fighting on our behalf against all odds. We cannot accept they may be a part of the problem – active participants in it – and be profiting from it all the while. Without a lot of digging one can discover the number of congressman who leave office much richer than when they entered (Nancy Pelosi) and transition quickly into very high-paying private sector businesses who benefit greatly from their governmental connections and influence. The struggle for the independent in government is great and I have tremendous respect for anyone who gives it a go (Ron Paul & Rand Paul). Their plight makes me think of Jimmy Stewart in Mr. Smith Goes to Washington, a great Frank Capra film about an innocent, honest man who becomes a senator – is dismayed by the corruption and stands up for truth and integrity – and becomes a target of all who profit from business as usual. Great movie – give it a tumble."}, {"review_sentiment": 5.0, "review_text": "The descriptions of people, time, and place are phenomenal.  Many readers don't care for this book because it is written in a style evocative of the time and place of the 1930's south, which is slow and wordy.  However that is part of the genius of the writer.  There are so many levels to this novel and they creep up on you as the book progresses.  It's a great piece of literature and I thoroughly enjoyed it."}, {"review_sentiment": 4.0, "review_text": "The story line was interesting and compelling. There were some great descriptions and metaphors and well-crafted prose and interior monologue. Dialogue was good, but not as strong perhaps. Some parts were maybe a bit longer than I felt they deserved. I really enjoyed the book and struggled deciding between 4 and 5 stars."}, {"review_sentiment": 2.0, "review_text": "The conversation redundancy between the characters got to be to much. It's a very wordy book and not in a good way. Wasn't sorry when it ended."}, {"review_sentiment": 2.0, "review_text": "the print in this hardback edition was too small...way smaller than the paperback editions....which meant that i could not give the book as a gift to my father...very disappointing!"}, {"review_sentiment": 4.0, "review_text": "Great read!"}]}, "authors": ["Robert Penn Warren"], "isbn": "0156004801", "longitude": -90.0701156, "periods": ["1900s"], "title": "All the King's Men", "word_cloud": "find difficulty fall stark sorry portrayal obsession scandal swim cloud politics wholly unsympathetically brutally honest huge huge interpersonal inter political financial scandalous connection many character seem support promote candidate seem best interest heart come along question people corporation best demagogue put office come nothing certainly live american political dream terrible consequence choice question become care answer come page chapter specifically straight end enjoy open true heart plot begin narrator begin uncover much entirety setup build writing excellent paragraph description take breath away say strange disconnectedness longer metaphor narrator story writer love devotion examination persistence obsession investigative curiosity man try place world much beautiful final page meet someone resign fact much story even know time enjoy know sure tremendous merit accurate document american political operation amazingly beautiful funny violent surprising passage prose handle swiftness felt bit long central figure wonder need big ego great likely pick quotation section need revisit beautiful language miss put character mirror political mess find time story writer keep read look forward pass mark copy friend hear say selection list slowly get great rich character beautifully script language author take circuitous journey live fascinate character greatest ever write resonant mind rest life learn reality government politics read fictional story set government call high school college want understand government really work say go law thing enjoy want see make word egoism greed lust vanity deception deal display help government corrupt complicate messy main character charismatic man people appeal little man promise take business hall power see work people get fare shake government best intention soon abandon taste power position hold status game lay moneyed establishment control true lever power point word change conviction effort behalf people believe diminish believe story day go need reflect moment current government local state federal people hate government hate congress representative year year elect candidate promise reform change end corruption government problem take get elect believe many individual believe actually thing give black hole capital politics vision serve people clean government get flush toilet representative solve governmental crisis require deliberate involvement citizen way busy try get day work abandon elect official say vicious circle education individual responsibility look curtain see motivation machination government great reminder responsibility maintain integrity political system elect official accountable know history understand foundation system recognize importance allow cult personality degrade value legitimacy fall love smile listen word hold accountable say failure surrender autonomy uncommon believe elect official capital fight behalf accept part problem active participant profit lot dig discover number congressman leave office much richer entered transition quickly private sector business benefit greatly governmental connection influence struggle independent government great tremendous respect anyone give go plight make think great film innocent honest man become senator dismayed corruption stand truth integrity become target profit business usual movie give tumble description people time place phenomenal many reader care write style evocative time place south slow wordy however part genius writer many level creep progress great piece literature thoroughly enjoy story line interest compelling great description metaphor prose interior monologue good strong perhaps part maybe bit longer felt deserve really enjoy struggle decide star conversation redundancy character get much wordy good way sorry end print hardback edition small way smaller paperback edition meant gift father disappointing great", "genres": ["Fiction & Literature"], "summary": "Winner of the Pulitzer Prize, this classic book is generally regarded as the finest novel ever written on american politics. It describes the career of Willie Stark, a back-country lawyer whose idealism is overcome by his lust for power. New Foreword by Joseph Blotner for this fiftieth anniversary edition.\r\n\r\nThe central character of Willie Stark (often simply referred to as \"the Boss\") undergoes a radical transformation from an idealistic lawyer and weak gubernatorial candidate into a charismatic and extraordinarily powerful governor. In achieving this office Stark comes to embrace various forms of corruption and builds an enormous political machine based on patronage and intimidation. His approach to politics earns him many enemies in the state legislature, but does not detract from his popular appeal among many of his constituents, who respond with enthusiasm to his fiery populist manner.\r\n\r\nStark's character is often thought to be inspired by the life of Huey P. Long, former governor of Louisiana and that state's U.S. senator in the mid-1930s. Huey Long was at the zenith of his career when he was assassinated in 1935; just a year earlier, Robert Penn Warren had begun teaching at Louisiana State University.[10] Stark, like Long, is shot to death in the state capitol building by a physician. The title of the book possibly came from Long's motto, \"Every Man a King.\"", "asin": "0156004801", "rank": "160744", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51UIm5irUhL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}