{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 92, "rating": 3.8, "reviews": [{"review_sentiment": 2.0, "review_text": "If only I'd read a different Saramago for my first! I know he must be great, and the seeds of his greatness can definitely be detected here. Yet, this was one of the most boring reads of my life. I finished it only because I had promised a friend I would, to compare notes. What an odd book! It was published in 1997, yet it seems as if it could have been written in the 1950s. It's somehow an anachronistic effort. I think of it as something of a thought experiment; somewhat interesting; but not worth all the pages of deadly description of nothing much at all. Kafka-esuqe in style while being anti-Kafka, ultimately, but that makes it sound too interesting."}, {"review_sentiment": 4.0, "review_text": "not the best saramago book, but still a good read"}, {"review_sentiment": 4.0, "review_text": "In the spirit of Gabriel Garcia Marquez, This book seems to actually transform the way the readers mind works, blurring the distinctions between life and death, truth and deception, reality and subjectivity. A wonderful exploration by a brilliant writer."}, {"review_sentiment": 4.0, "review_text": "This book is unlike anything I've ever read before, and I guess that's part of why Jose Saramago won the Nobel Prize for Literature. It's kind of slow, and kind of boring, and kind of difficult to follow. I found myself thinking of other things while scanning the pages, only to get caught up in the story a few pages later. In the end, I liked it. I liked the protagonist, Senhor Jose, and wanted to find out if he ever found what he was looking for. I ask myself if I would ever read another novel by Saramago, and I probably would. Just not in the next could of months."}, {"review_sentiment": 5.0, "review_text": "Wow! Perfection!"}, {"review_sentiment": 3.0, "review_text": "These kind of stories leave me pondering life, and death. Am I just a 'name'? Or am I not my name at all?"}, {"review_sentiment": 4.0, "review_text": "Very interesting and thought provoking book.  Different than what I expected."}, {"review_sentiment": 2.0, "review_text": "I just could not get interested in this book.  I read about the first three or four chapters and put it aside for lack of interest"}, {"review_sentiment": 3.0, "review_text": "With All the Names, Jose Saramago once again leaves the reader hanging at the end of the book with no conclusions and many unanswered questions.  This is similar to what is experienced with Seeing.  I don't usually find this objectionable and recognize that many authors intentionally end books in a manner so as to encourage readers to consider their own conclusions or be curious enough to buy the next volume in a series; however, a little bit of this practice goes a long way.  Given his passing, Senor Seramago will not be writing any new material and unless I've missed something, my questions will remain unanswered and my curiosities will continue to be unsatisfied.  I can't recommend this book with any enthusiasm.  It's a mildly entertaining read with an abrupt, incomplete finish."}, {"review_sentiment": 5.0, "review_text": "Fascinating story of the individual in a complete bureaucracy, reminiscent of Kafka."}]}, "authors": ["Jose Saramago", "Margaret Costa"], "isbn": "0156010593", "longitude": -9.1365061, "periods": ["2000s"], "title": "All the Names", "word_cloud": "different first know great seed greatness definitely detect boring read life finish promise friend note odd publish yet seem write somehow anachronistic effort think something thought experiment somewhat interesting worth page deadly description nothing much style ultimately make sound interesting best saramago still good spirit seem actually way reader mind work blur distinction life death truth deception reality subjectivity wonderful exploration brilliant writer anything ever guess part kind slow kind bore kind difficult follow find think thing scan page get catch story page later end like like protagonist want find ever find look ask ever probably next month kind story leave ponder life death or name very interesting thought provoke expect interested first chapter put aside lack interest leave hang conclusion many unanswered question similar experience see usually find objectionable many author intentionally end manner encourage reader consider conclusion curious enough buy next volume series however little bit practice go long way pass write new material miss something question remain unanswered curiosity continue unsatisfied enthusiasm mildly entertain abrupt incomplete finish fascinate story individual complete bureaucracy reminiscent", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Senhor José is a low-grade clerk in the city's Central Registry, where the living and the dead share the same shelf space. A middle-aged bachelor, he has no interest in anything beyond the certificates of birth, marriage, divorce, and death that are his daily routine. But one day, when he comes across the records of an anonymous young woman, something happens to him. \r\n\r\nObsessed, Senhor José sets off to follow the thread that may lead him to the woman-but as he gets closer, he discovers more about her, and about himself, than he would ever have wished.\r\n\r\nThe loneliness of people's lives, the effects of chance, the discovery of love-all coalesce in this extraordinary novel that displays the power and art of José Saramago in brilliant form.", "asin": "0156010593", "rank": "475670", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/51tcpcr-QXL.jpg", "country": "Portugal", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}