{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 12, "rating": 3.4, "reviews": [{"review_sentiment": 4.0, "review_text": "MMcM at her best."}, {"review_sentiment": 4.0, "review_text": "Venice Observed is a short, but by no means a light read.  Mary McCathy packs a huge amount of detail and thought into her highly polished narrative dealing chiefly with the painting and politics with which Venice was traditionally associated over the ages.  But be warned, she does not always wear her scholarship lightly and some parts of this book can be a real slog.  In amongst the erudition are some delightful anecdotes such as the story of Veronese's recasting of his famous painting - initially intended to be the Last Supper but now known at the Wedding Feast of Cana - to conform with Vatican prescriptions.  Best taken in small sips and savoured like fine wine as you toast La Serenissima in all her glory."}, {"review_sentiment": 4.0, "review_text": "While this seems less known than its 1959 predecessor The Stones of Florence, I liked it more. McCarthy reveals in framing vignettes more about where she stays, and the irascible, over-familiar family she resides with. Also, the book is set up thematically in chapters that don't just roam over the abundant art, but focus on characters and topics that let this erudite author convey information better.I am reviewing a large-format illustrated edition of this 1963 book. With end-notes on the art photographed, and short essay by an art professor, it better meets the needs of readers who are not as familiar with the considerable context necessary for appreciating the displays written about and shown. She starts by noting that no corner of Venice can be kept from the tourist, and that residents must share its passageways with all, for all must walk its labyrinth. She then tells of how the ideally placed port gained its \"loot\" and why it prospered and then declined. The fate of its Jews in the ghetto and the rise of the Most Serene Republic's \"only thinker\" the friar Paolo Sarpi enliven the tales told.Its glory years with Giorgione and Carpaccio, Titian and Tiepolo follow. A trip to the islands of Murano and Burano conjures up their appeal, or the limits of such. McCarthy regales us from a time fifty-plus years ago when Burano's fisherfolk looked different than Venetians, and when beggar children still could be found in the ghetto. Her Venice already feels very distant to a traveler today.This is dated, of course, but for the way it conjures up some of the theme-park ambiance of Venice, recommended. It's an elegant but accessible introduction, and with the notes, one can learn about the artists and architects responsible for forging this island kingdom out of marble against the salty sea."}, {"review_sentiment": 4.0, "review_text": "Very nice"}, {"review_sentiment": 3.0, "review_text": "Interesting but difficult reading.  It wouold be great to take to Venice and see the actual churches and paintings she describes."}, {"review_sentiment": 2.0, "review_text": "VENICE OBSERVEDWhile this has become sort of a cult classic, there are better books about Venice to be read and enjoyed, written in the years since Mary McCarthy penned this book. It is a very particular, personal and peculiar look at the famed city.It may be that this work was cutting edge for travelers in the 'Fifties, but it has long since been surpassed both in content and in tone, by more recent books, be they guidebooks or works of a more literary bent such as the gorgeous \"Francesco's Venice\" (written by a native of Venice) or \"The City of Falling Angels\" (by the award winning author of \"Midnight in the Garden of Good and Evil\" which is a brilliant and affectionate look at the city and its people by an American) both of which I recommend highly, as in five stars--read them before considering reading this book.Mary McCarthy is knowledgeable but she makes every effort to let you know just how very smart she is with the implication that she is smarter than you. She often quotes in other languages and let the reader puzzle them out - if you don't speak the language, then be glad your computer will do free translations for you. She also assumes you have already studied the art, architecture and history of Venice thoroughly before turning to her book, and having been thus armed with the basics from elsewhere, she will now give you her added (she would say, correct) slant.The book is not quite painful as her book about Florence, but like that book, this too is not a volume pitched to endear one to Venice.McCarthy's approach is that Venice is an acquired taste and most readers are not sophisticated enough to acquire it. While one feels put down by such an attitude, it is so pervasive it cannot be accidental. McCarthy tells how much better, smarter, wiser, well-read and insightful she is than any of her readers, which is an odd stance for an author to take.And far from the reality of a visit to Venice.You see, the reality is this: A taste for Venice can be acquired instantaneously, spontaneously, immediately. One need not know the art, architecture and history, to enjoy the sights the sounds and the people. Although knowing these things will of course add to one's visit.Even so, all one need do is walk the winding paths from the train station to San Marco, or ride the Number 82 vaparetto full circuit to enjoy and appreciate the myriad wonders of the city on the lagoon.To really get to know a place, one must do so with one's eyes out of the guidebooks and maps, and filled with everything there that is to be seen. Your experience of Venice may not be all Ms. McCarthy would have it be, but then why put her blinders between you and this place that poets, writers, travelers and sojourners have loved for eons.For example, take a half-day on Murano for relief (the canals are bordered by walkways; easy to enjoy) and an inexpensive ride over to San Giorggio Maggiore to go up THAT campanile (cheaper and better views than the campanile of San Marco). See the \"Must See\" points of interest if you wish, but if you miss them, don't sweat it!There are lots of surprises around every corner, over every bridge and in every shop window. The Venetians are friendly, the food is good and it is impossible to take a bad photo there.And when you stand on the crest of the Rialto Bridge, breathe one brief, silent sigh of thanks that Mary McCarthy isn't with you correcting your impressions!If you find this review helpful you might want to read some of my other reviews, including those on subjects ranging from biography to architecture, as well as religion and fiction."}, {"review_sentiment": 3.0, "review_text": "Written in 1956, \"Venice Observed\" was a precursor to \"The Stones of Florence\" (1959), one of the better travel books ever written. As in \"The Stones of Florence,\" McCarthy weaves a tapestry of art, history, literature, sociology and cogent observation, but this earlier effort is not as well organized as the later book, leaving the reader to dig out the gems that lay within.Apparently the original hardback versions of both books contained high-quality photographs, and were experiments in presenting the two modes of communication together. Depending upon which edition you buy, the paperback versions either lack photographs altogether or contain low-quality reproductions. While that obviously detracts from the experience, the text standing alone bears witness to an extraordinarily well-disciplined and fine mind at work.Since McCarthy was born in 1912, she would have been 44 at the time this book was written, hardly the ingenue that other reviewers suggest. In fact, after reading both books, one suspects that this woman was born mature.It is interesting to note that throughout this book, McCarthy refers to John Ruskin's \"The Stones of Venice,\" which explains her choice of title for \"The Stones of Florence.\""}, {"review_sentiment": 1.0, "review_text": "Talk about taking the joy out of an experience.  I read this book prior to a week-long trip to Venice.  This book quite simply accomplished none of its objectives.  It is a poor \"guidebook\" and is poorly written and uninteresting in terms of a travelogue.  The history and art of Venice are covered better in books from those genres.  The only upside is that it is short.  Yuck, what a waste of time.  My advice is:  get a novel about Venice if you like novels, a guidebook if you want that, an art book, or a history book.  At least you'll get something out of those--this one tries all of these and fails.  Actually, in terms of a travelogue, \"Vendela in Venice\" far surpassess any other Venice book I have seen.  Although I originally bought it because it is considered a children's book, it is not dumbed down at all and adults will enjoy it..."}, {"review_sentiment": 5.0, "review_text": "This is one of McCarthy's most delightful books, although it may also be her least controversial. VENICE OBSERVED might be the best single travel book ever written on Venice, and MCarthy's tone is leisurely and informative, her style witty and engaging. Her asides about her personal experiences in the city complement her grander historical and artistic musings: you never feel alienated from her prose (the way you can in her earlier THE STONES OF FLORENCE). Her anecdotes about the doges, Tintoretto, Veronese, the Councils, etc. greatly enhanced one's understanding of the city, and her musings on the art are thoughtful and illuminating."}, {"review_sentiment": 4.0, "review_text": "Mary McCarthy's VENICE OBSERVED is neither history nor a guide book but rather a literary reflection written by a young 1950s \"single\" woman who has visited a beautiful place and now sits at her desk and muses over what she has seen.McCarthy was a writer and an educated woman in an age when educated women were few. She probably wore white gloves and a little hat and visited Europe after graduation from college. One can picture the author of THE GROUP traveling abroad, continuing her education. As part of her formal training, she read James and Ruskin and then she visited the sights they described and wrote her own impressions. I found McCarthy's book intriguing because she was intriguing and women like her don't exist any more. I picture her looking a bit like Katherine Hepburn arriving in Italy in \"Summertime.\"  Maybe McCarthy wasn't a \"career girl\" as single women sans husband and children who worked for a living were called in those days, but this is how I picture her on reading VENICE OBSERVED.I've just finished reading JJ Norwich's HISTORY OF VENICE and if you want history Norwich's book is the definitive history. VENICE OBSERVED is for women who want a bit of information to complement their education mixed in with another woman's reflections. VENICE OBSERVED is for educated women who travel alone.McCarthy includes some history, but only as a backdrop to her real interests which are art and literature.  She assumes you know who Tintoretto and Titian were and that you've at least seen pictures of their works. Where Norwich mentions Tintoretto in passing (Norwich is more interested in archtecture) McCarthy dwells on him.VENICE OBSERVED is not an art book however. McCarthy's writing reminds me of James or Ruskin, both of whom she quotes. They observed various places, buildings, paintings, etc. but always assumed you had some prior knowledge of the thing they were discussing.  VENICE OBSERVED is the sort of book you'd want to read after you have made your own visit to Venice.  You could read it before hand, but the text would be overwhelming if you come to it with no prior knowledge. If you want to read a more contemporary book, I recommend ITALIAN DAYS by Barbara Grizutti Harrison."}]}, "authors": ["Mary McCarthy"], "isbn": "015693521X", "longitude": 12.3345898, "periods": ["1900s"], "title": "Venice Observed", "word_cloud": "best short mean light pack huge amount detail think highly polished narrative deal chiefly paint politics traditionally associate age warn always wear scholarship lightly part real slog among st erudition delightful anecdotes story veronese recast famous paint initially intend last know prescription take small sip savor fine wine toast glory seem le know like reveals frame vignette stay irascible family resides also set thematically chapter roam abundant art focus character topic let erudite author convey information review illustrated edition art photograph short essay art professor better meet need reader familiar considerable context necessary appreciating display write show start note corner keep tourist resident share passageway tell ideally place port gain loot prosper decline fate ghetto rise thinker friar enliven tale glory year follow trip islands conjure appeal limit regale time year ago fisher folk look different beggar child still already feel distant traveler date course way conjure ambiance recommend elegant accessible introduction note learn artists architect responsible forge island kingdom marble salty sea very nice interest difficult read would great actual church painting describes sort cult classic better enjoy write year pen particular personal peculiar look famed cut edge traveler long surpass content tone recent guidebook work literary bent gorgeous write native win author brilliant affectionate look city people recommend highly star consider read knowledgeable make effort let smart implication smarter often quote language speak language glad computer free translation also assume already study art architecture history thoroughly turn thus arm basic elsewhere give add correct quite painful volume pitch approach acquire taste reader sophisticate enough feel put attitude pervasive accidental tell much better smarter wiser insightful reader odd stance author far reality visit see reality taste acquire instantaneously spontaneously immediately need know art architecture history enjoy sight sound people know thing course add need walk wind path train station ride full circuit enjoy appreciate myriad wonder city really know place eye guidebooks map fill everything see experience blinder place poet writer traveler sojourner love example relief canal border walkway easy enjoy inexpensive ride go campanile cheaper better view campanile point interest wish miss sweat lot surprise corner bridge shop window friendly food good impossible bad photo stand crest breathe brief silent sigh thanks correct impression find review helpful review include subject range biography architecture well religion fiction precursor better travel ever write weave tapestry art history literature sociology cogent observation earlier effort well organize later leave dig gem lay original hardback version contain photograph experiment present mode communication together depend edition buy paperback version lack photograph altogether contain reproduction obviously detract experience text stand alone bear witness extraordinarily fine mind born time write hardly ingenue reviewer suggest fact read suspect woman born interesting note refers explain choice title talk take joy experience prior trip quite simply accomplished none objectives poor guidebook poorly write uninteresting term travelogue history art cover better genre upside short waste time advice novel guidebook want art history least something try fail actually term travelogue far surpasses see originally buy consider child numb adult delightful also controversial single travel ever write tone leisurely informative style witty engage aside personal experience city complement grander historical artistic musing never feel alienated prose way earlier anecdotes doge greatly enhance understanding city musing art thoughtful illuminating history guide rather literary reflection write young single woman visit beautiful place sits desk mus writer educate woman age educate woman probably wear white glove little hat visit graduation college picture author travel abroad continue education part formal training visit sight describe write impression find intrigue intriguing woman exist picture look bit arrive career girl single woman sans husband child work live call day picture read finish read want history definitive history woman want bit information complement education mix woman reflections educate woman travel include history backdrop real interest art literature assume know least see picture work mention pass interested architecture dwell art however write reminds quote various place building painting etc always assume prior knowledge thing discuss sort want make visit hand prior knowledge want contemporary recommend italian", "genres": ["Art & Architecture", "History", "Travel Writing"], "summary": "Mary McCarthy takes readers on a captivating journey to one of the world’s most beloved cities\r\n\r\nMary McCarthy brings her novelist’s unerring eye to a book that blends art, politics, religion, music, and history to create a living portrait of “the world’s loveliest city.”\r\n\r\nLike a painter capturing the city’s essence on canvas, McCarthy uses words to create stunning visuals that bring both the old and new Venice to enchanting life. From her apartment overlooking the garden of a palazzo, McCarthy takes us into the museums and monasteries of this city of canals and gondolas, Machiavelli and Tintoretto. And she reveals some little-known facts: Venetians love pets, but prefer cats to dogs; during World War II, the Allies captured the city with a fleet of gondolas; and without Napoleon, Venice wouldn’t be what it is today.  \r\n\r\nFrom the ancient roots of The Merchant of Venice’s pound of flesh to the quotidian details of daily life, it’s all here—the magnificent frescoes, the sublime music of Mozart, the virgins, and the saints. At once a comprehensive travelogue and a powerful piece of reportage, Venice Observed is a testimony of McCarthy’s love affair with the City of Canals.\r\n\r\nThis ebook features superb color reproductions of the works of Giorgione, Veronese, Titian, Canaletto, Guardo, Bellini, and Tiepolo, and an illustrated biography of Mary McCarthy including rare images from the author’s estate.", "asin": "015693521X", "rank": "1144024", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/41uRgIgQmyL.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}