{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 60, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "A wonderful reading experience with beautiful passages and interesting imagery. Each chapter a distinctive stretch of one melodious babbling brook. It sketches a little dystopian world in the reader’s imagination. The main character a wise fool. Not sharing in the commonsense of his fellow citizens, his foolish wisdom seems more human and humane by comparison, as he readily excuses others’ their inhumanity on the basis that there is no place for being humane in the framework of their commonsense: “it’s not that men don’t wish to be humane, it just goes against common sense” (p. 3). A cog in a repressive system, his uncommon sense seems to allow him to preserve and exercise his humanity, albeit contorted under these conditions. But times and society are changing—with new technology—and, consequently, humans are changing, too—into technicians—such that room for the sort of oddly imaginative logic that has kept his inner world and humanity intact and alive thus far is being squeezed out.Too Loud of Solitude (1976) by Bohumil Hrabal, translated from the Czech by Michael Henry Heim, published by Harcourt (1990)."}, {"review_sentiment": 5.0, "review_text": "Great Condition"}, {"review_sentiment": 4.0, "review_text": "this book underscores the greatness that is inherent in every individual. great book not mention the intricate details that come alive through beautiful choice of words carefully chosen by the author"}, {"review_sentiment": 5.0, "review_text": "One of the best books I have ever read. Finished it in one sitting. Wept at the end and then I started reading it all over again."}, {"review_sentiment": 5.0, "review_text": "This is more poetry than prose, in my opinion. I recommended it for book club, and it did not get very good reviews from my co-workers. It's a beautiful work, a quick read, and I really enjoyed the almost musical quality of the words."}, {"review_sentiment": 4.0, "review_text": "really interesting novella.  short, lots for a bookclub to talk about."}, {"review_sentiment": 5.0, "review_text": "Good book and good time shipping."}, {"review_sentiment": 1.0, "review_text": "Very ugly book. Too bad as this guy is a fine writer."}, {"review_sentiment": 4.0, "review_text": "\"Too Loud a Solitude\" is Bohumil Hrabal signature work, but for me it is the least accessible of his three books I have read.  I think this is because it has virtually no narrative flow leaving the reader minimal background story against which to make sense of Hrabal's quirky, irreverent existential angst.  That said, the thoughts and memories of the book's hero / anti hero traverse widely from the sewers of Prague to the heavens in an unbroken monologue inspired by the books and paintings he has rescued from the waste packaging plant he operates.  Hanta builds meaning, incongruously making his bales of waste paper beautiful, while storing thousands of liberated books at home at increasing risk of being crushed under their weight.  Hrabal's sardonic style challenges his reader to look beyond the immediate to recognise how love, spirit, hope, friendship and sacrifice make Hanta into the unlikely Everyman."}, {"review_sentiment": 5.0, "review_text": "The book is fantastic.Though, the kindle version needs extensive proof-reading, editing, and formatting. It gave me a headache to read it!"}]}, "authors": ["Bohumil Hrabal"], "isbn": "0156904586", "longitude": 14.4212535, "periods": ["1900s"], "title": "Too Loud a Solitude", "word_cloud": "wonderful reading experience beautiful passage interest imagery chapter distinctive stretch melodious babble brook sketch little dystonia world imagination main character wise fool not share commonsense fellow citizen foolish wisdom seem human humane comparison readily excuse others inhumanity basis place humane framework commonsense men wish humane go common sense cog repressive system uncommon sense seem allow preserve exercise humanity contorted condition time society new consequently humans changing room sort oddly imaginative logic keep inner world humanity intact alive thus far squeezed translate publish condition underscore greatness inherent individual great mention intricate detail come alive beautiful choice word carefully choose author best ever finish sit end start read poetry prose opinion recommend club good review beautiful work quick really enjoy almost musical quality word really interesting novella short lot book club talk good good time shipping very ugly bad guy fine writer signature work least accessible think virtually narrative flow leave minimal background story make sense quirky irreverent existential angst say thought memory hero anti hero traverse widely sewer heavens unbroken monologue inspire painting rescue waste packaging plant operate build mean incongruously make bale paper beautiful store thousand liberate home increase risk crush weight sardonic style challenge look immediate recognize love spirit hope friendship sacrifice make unlikely kindle version need extensive edit format give headache", "genres": ["Fiction & Literature"], "summary": "Hantá rescues books from the jaws of his compacting press and carries them home. Hrabal, whom Milan Kundera calls “our very best writer today,” celebrates the power and the indestructibility of the written word. \r\n\r\nOne of Czechoslovakia's most popular authors, Hrabal ( I Served the King of England ) was never a dissident, nor are his books polemics; he is noted for his visceral, fabulistic prose and bizarre sense of humor. Hanta, the narrator of this absorbing novella, is a gentle alcoholic who has spent 35 years compacting wastepaper. \r\n\r\nIn his messy, subterranean world, the refuse of human life accumulates: bloody butcher paper, office correspondence, yellowed newspapers and, most importantly, books. Able to quote Kant, Goethe and Seneca, he is both \"artist and audience\" as he destroys or selects for his own enjoyment the printed matter others have discarded. \r\n\r\nHanta's unusual occupation--in a country which until recently suffered severe literary censorship--is an ironic backdrop as he reflects on the women he has loved or imaginary encounters between historical figures such as Jesus Christ and Lao-tze. \r\n\r\nThis fable about the modern-day equivalent of book-burning, although a showcase for Hrabal's dazzling writing talent, often slides into parody, under the weight of its obtrusive morality. ", "asin": "0156904586", "rank": "241612", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51hjqgmMlDL.jpg", "country": "Czechia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}