{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 11, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 1.0, "review_text": "A fantastic trAvel log ! Noteboom has deep knowledge about history and art historyI love it!"}, {"review_sentiment": 4.0, "review_text": "strange and absorbing about a history of which I knew very little.  I like his style of writing, the clarity of expression, the whimsical turn of phrase and the depth of description."}, {"review_sentiment": 5.0, "review_text": "Cees Nooteboom (born 1933) is a Dutch novelist and travel writer.  He wrote ROADS TO SANTIAGO in 1992, after having travelled in Spain off and on over the span of forty years.  I bought the book thinking that its focus would be the Camino de Santiago de Compostela.  And, indeed, the book ends, after 330 pages, in Santiago at the Cathedral and the Plaza de las Paterias, where a priest keeps the great hand-written ledger of the pilgrims who have arrived at the end of one of the three or so most ancient and venerable religious pilgrimages of humanity.  But that Santiago is the terminal point of the book owes more, I think, to literary effect and Nooteboom's conceit that Santiago \"is the true capital of Spain\" than to the religious Camino de Santiago.Instead, the book is, as indicated by the subtitle, a pilgrimage through Spain, with many diversions and musings.  The \"route\" crisscrosses and meanders all across the country, slipping once into Portugal and even taking a brief hop to the Canary Islands.  I doubt very much that the book is based on any one trip through Spain; rather it almost certainly is the result of several trips, one or more of which, based on internal evidence, occurred in the mid-1980's.  Nooteboom tends much more to the byways and backwaters of Spain than he does to the heavily travelled and touristed areas (indeed, there is no mention of the Mediterranean coastal areas or of Barcelona).  And, as a pilgrimage, the book is more historic and humanitarian in nature than religious, although Nooteboom is quite sensitive and attuned to the spiritual dimension of the places he visits.Here is how Nooteboom introduces the reader to his subject:  \"Spain is brutish, anarchic, egocentric, cruel.  Spain is prepared to face disaster on a whim, she is chaotic, dreamy, irrational.  Spain conquered the world and then did not know what to do with it, she harks back to her Medieval, Arab, Jewish and Christian past and sits there impassively like a continent that is appended to Europe and yet is not Europe * * *.\"  Nonetheless, Nooteboom clearly loves the land.Nooteboom scatters throughout the book germane historical discussions, so that by book's end one cannot help having learned, or been reminded of, a fair amount of Spanish history.  He also includes discussions of some of Spain's greatest painters and writers, including insightful chapters on Velásquez, Zurbarán, and Cervantes (among other things, he visited the cave where Don Quixote was born - i.e., the cave where Cervantes was imprisoned when he supposedly wrote the beginning chapters of the first great novel).  He is especially fascinated by, and knowledgeable about, Romanesque architecture, and time and again he goes out of his way to visit some remote, and often locked-up, 800- or 900-year-old Romanesque church.As a bonus, the book contains over sixty black-and-white photographs (most taken by Nooteboom's wife), which are well-coordinated with the text.  The book also includes a map of the Iberian peninsula that would have been more useful had it contained more of the places mentioned in the text.ROADS TO SANTIAGO is literary travel writing near its best.  It is NOT, however, a travelogue or travel guide, although anyone contemplating an extended stay in Spain or a leisurely journey through the country could profit from it.  Nor is it for the impatient.  Nooteboom is inclined to philosophical or historical musings, and he is prone to taking off on some rather Borgesian flights of fancy.  A few of his fanciful conceits were perplexing or silly (like Borges), and on occasion I found the book verbose.  But on the whole ROADS TO SANTIAGO is a very informative and charming pilgrimage through Spain, on both the spatial and temporal dimensions."}, {"review_sentiment": 5.0, "review_text": "I agree with the other 5-star reviews, and would only add that Ina Rilke's translation is masterful.  (I will read just about anything she translates from Dutch into English.)"}, {"review_sentiment": 5.0, "review_text": "This is a spectacular book, written by the best kind of travel writer.  Mr. Nooteboom's passion for Spain, Spanish art, and Spanish architecture is infectious.  I did the pilgrimage to Santiago in September of 2003, and understanding the Camino in the larger context of Spanish history (which Mr. Nooteboom limns so admirably) was invaluable. I don't believe I would have looked for, much less appreciated the Romanesque architecture I saw along the way.  Coincidentally, his love of the great Spanish painters Zurbaran and Velazquez inspired me to visit New York for the Velazquez to Manet exhibit.  I consider this one of the essential books to read before you set out for Santiago de Compostela.  Guide books will get you from A to B. This book will help you understand the importance of A, B, and all the points in between."}, {"review_sentiment": 5.0, "review_text": "first of all, cees nooteboom is a shining oasis in the arid intellectual desert of contemporary travel writing, and secondly, you should let go of everything that makes you unhappy, and set sail tomorrow.the sheer profundity and wit of nooteboom's observations left me, for one, in like total dumbstruck awe, and his seemingly divine ability to translate the most visceral of emotions into words (a medium of communication i had always, up till now, considered inferior) made me feel a little bit the same way i felt the first time i went skydiving. folks, this here is a man who knows how to travel, as well as being a freakin miracle of a writer--and anyone who is capable of firing a sincere philosophic-type synapse will LOVE HIM. also read \"the following story,\" all you existential types out there--he's like a dreamy, colorful Camus, and his prose will make your eyes feel clean for the first time in years."}, {"review_sentiment": 3.0, "review_text": "Am still trying to finish this book! Compared to some of the others on the subject, it's a hard read. I'll probably sell it."}, {"review_sentiment": 1.0, "review_text": "Spain becomes grist for the cracked mill wheel of Cees Nooteboom's mind. The book isn't  really about Spain, it's about the author and his obsessive fixation with certain Spanish topics.  He does this with painfully long  rambling descriptions of  various Spanish cultural icons that have caught  his attention, drilling down to the time when they first caught his  attention and the many times since then that he has pondered them.  The  topics themselves are interesting but almost irrelevant to the self  indulgent dredging of  the author's own mind.  You would learn more hard  facts about these topics from a museum brochure.  The twin pillars of this  tortuously slow moving narrative are the painter Zurban and Romanesque  architecture.  He drops and picks up these topics at random, throughout the  book, and prattles on about them as if he is possessed with a reoccurring  fever.  He also slathers his book  with an impressive amount of trite  clichés about Spain, Spain the land of contrasts, Castille La Mancha the  land of desolate panoramas, etc.  He goes on ad nauseum. He also plays a  little fast and loose with the few historical facts he deigns to use.  He  states that the aqueduct in Segovia was used until 1974; according to  Segovia's municipal web site it is still in use.  He states that Pizzaro  left from Extremadura with an invasion force for Peru; Pizzaro left from  Central America where he had been established for some years.  Obviously no  fact checker touched this book before publication.  There are many  wonderful books about Spain.  This isn't one of them."}, {"review_sentiment": 5.0, "review_text": "Very interesting view of selected Spanish history and culture. Superbly written. I have been reading lots of books from Spain and about Spain in the last 10 years, but this is certainly one of the best."}]}, "authors": ["Cees Nooteboom"], "isbn": "0156011581", "longitude": -3.7035825, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s"], "title": "Roads to Santiago", "word_cloud": "excellent fantastic travel log deep knowledge history art history i love strange absorb history know little like style write clarity expression whimsical turn phrase depth description cere bear novelist travel writer write travel span forty year buy think focus indeed end page priest keep great ledger pilgrim arrive ancient venerable religious pilgrimage humanity terminal point owe think literary effect conceit true capital religious indicate subtitle pilgrimage many diversion muse route crisscross meander country slip even take brief hop doubt much base trip rather almost certainly result several trip base internal evidence occur tend much byway backwater heavily travel tourist ed area indeed mention coastal area pilgrimage historic humanitarian nature religious quite sensitive attuned spiritual dimension place introduces subject brutish anarchic egocentric cruel prepare face disaster chaotic dreamy irrational conquer world know hark back sits impassively continent append yet clearly love scatter germane historical discussion end help learn remind fair amount spanish history also include discussion greatest painter writer include insightful chapter thing visit cave bear cave cervantes imprison supposedly write begin chapter first great especially fascinate knowledgeable architecture time go way visit remote often bonus contain sixty photograph take wife text also include map iberian peninsula contained place mention literary travel write best however travelogue travel guide anyone contemplating extend stay leisurely journey country impatient incline philosophical historical musing prone take rather borgesian flight fancy fanciful conceit perplex silly occasion find verbose whole informative charming pilgrimage spatial temporal dimension agree review translation masterful anything translate spectacular write best kind travel writer passion spanish art spanish architecture infectious pilgrimage understanding larger context spanish history limn admirably invaluable believe look much le appreciated architecture saw along way love great spanish painter inspire visit exhibit consider essential set help importance point first cede notebook shin oasis arid intellectual desert contemporary travel write secondly everything make unhappy set sail sheer profundity wit notebook observation leave total dumbstruck awe seemingly divine ability translate visceral emotion word medium communication always till consider inferior make feel little bit way felt first time go skydive folk man know travel well freaking miracle writer anyone capable firing sincere synapse also follow story existential type dreamy colorful prose make eye clean first time year still try finish others subject hard probably sell becomes grist crack mill wheel really author obsessive fixation certain spanish topic painfully long ramble description various spanish cultural icon catch attention drilling time first catch attention many time ponder topic interest almost irrelevant self indulgent dredge author mind hard fact topic museum twin pillars tortuously slow move narrative painter architecture drop pick topic random prattle possess reoccurring fever also slather impressive amount trite cliche land contrast land desolate panorama etc go ad nausea also play little fast loose historical fact deigns use state aqueduct use accord municipal web site still state leave invasion force leave establish year obviously fact checker touch publication many wonderful one very interesting view select spanish history culture write read lot last year certainly best", "genres": ["History", "Travel Writing"], "summary": "Roads to Santiago is an evocative travelogue through the sights, sounds, and smells of a little known Spain - its architecture, art, history, landscapes, villages, and people. And as much as it is the story of his travels, it is an elegant and detailed chronicle of Cees Nooteboom's thirty-five-year love affair with his adopted second country. He presents a world not visible to the casual tourist, by invoking the great spirits of Spain's past-El Cid, Cervantes, Alfonso the Chaste and Alfonso the Wise, the ill-fated Hapsburgs, and Velázquez. \r\n\r\nBe it a discussion of his trip to the magnificent Prado Museum or his visit to the shrine of the Black Madonna of Guadalupe, Nooteboom writes with the depth and intelligence of an historian, the bravado of an adventurer, and the passion of a poet. \r\n\r\nReminiscent of Robert Hughes's Barcelona, Roads to Santiago is the consummate portrait of Spain for all readers.", "asin": "0156011581", "rank": "683699", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51kDooqCORL.jpg", "country": "Spain", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}