{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 48, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "There is the story of the main character -a text corrector- in our day and age and there is the story of the Siege of Lisbon in the 12 th century. Both stories are intertwined in a clever way in the novel . What makes for greatness is the author's voice: iconoclastic, at times sarcastic and at other times extremely funny handling themes like historical truth, God and religion, the nature of man at war, communism and prejudice among other things. The book has to be read attentively to enjoy all the nuances. My favorite among Saramago's books."}, {"review_sentiment": 5.0, "review_text": "I have 10% left in the book but I feel that it is time to write this review.I have had several literary revelations in my life..Kundera was first, another was Salman Rushdie. These taught me several innovations in form, plot.. new and revised bonding of fiction to life, and took me from delight to delight. I can safely say that this book proves Saramago to be on the same excitement creating level.I have been reading this book for almost a year as per the records. on some level I never want it to end. I wholly recommend the AUDIBLE version for anyone who has difficulty reading it. I could not find who it is that reads but he does a fantastic job and pronounces all the Portuguese street names to satisfy your curiosity.Feels like I can go on and on about my utter excitement about this book, but what would be a solid point here... maybe the sympathy I feel as a lover of books to the story of a proof reader. The combination of like and contempt I tend to feel for historical novels that found a new friend in Raimundo's novel. As usual I find it pitifully hard to actually put my finger on it. But love love love love!!! Saramago is a genius full of tenderness, to the point of having each sentence romantic.I have no idea why his book is not more popular than it is. I fully recommend it to all book lovers, there is nothing missing in it! War, history, streets of Lisbon, love..."}, {"review_sentiment": 4.0, "review_text": "This was an interesting book to read though the reader probably didn't appreciate it enough. This is a \"what if\" story based on a translator intentionally adding a word to a translation which significantly changes the history the book writes about. This probably could have been a short story but the author uses his character well, adds detail, writes one of the lter native history,  adds a romantic/business interest and turns it into  good book. I recommend it even though I am probably not qualified to do so."}, {"review_sentiment": 4.0, "review_text": "This story is about twisting things around. It is about altering certain known ‘historical facts’ and then asking the reader to consider how much truth there was in these ‘historical facts’ to start with. The book challenges the credence we give to history, which in many instances is penned by those who were not even eyewitnesses to the events they write about. Even ‘miracles’, purportedly witnessed by ancient saints, are accepted without question.‘What a strange world,’ the author asks, ‘it must have been, that such things should have been believed and written, I’d prefer to say in which such things are not written, but believed even, today, We are positively mad,’Is part of what we call history the product of some historians’ fertile imagination? How much detail is added or erased due to the historians’ bias? How much meaning is lost in translations and misprints from one language to the other? Are some of the speeches, often written verbatim, attributed to the major historical figures mere embellishment of prose? Are some history books mere narrations of fiction and mutilations of facts?The story begins with Raimundo Silva, a long-time proof-reader in Lisbon. He is proofing the ‘history of the siege of Lisbon in 1147’ in which Christians defeated the Moors who had ruled the city for three hundred years.  The recorded history is that the Portuguese sought the aid of the Crusaders who were on their way to the holy land.The Crusaders agreed to help the Portuguese, but the proof-reader, Raimundo Silva, inserts a NOT-the Crusaders will NOT help the Portuguese. It is from this ‘NOT’ that main events in the book unfold. Fortunately, the proof reader’s deliberate error is discovered before the book goes to print, and an erratum is inserted warning the readers of the ‘mistake’.The author plays on this error, and once again asks how much of written history is due to conscious vandalism of the facts. The publishers, in reaction to Raimundo Silva’s error of the “NOT,” hire a new administrator, Maria Sara to be in charge of the proof-readers. Maria Sara far from being outraged by Silva’s deliberate error is fascinated by what had happened and challenges Silva to write his alternative version of the Lisbon siege-and from the point of view of his NOT.In altering the history of Lisbon, Silva also fundamentally, and even joyfully, alters his life. He had for many years lived a lonely existence, but consequent to his NOT, he finds love. He now no longer just walks past a florist shop, but stops, enters and buys flowers.The story continues, following his error, on two levels: the present, with Silva and Sara falling in love, and the past-Silva’s version of the siege.  In both stories, so much is made of the NOT, as Silva ponders and reconstructs the historical events of the siege. Even the revised version of the proof-reader canNOT be trusted since it teems with speculation. But, at the same time his conjured version may be closer to the truth than the ‘facts’ in modern history books.Even as the improbable relationship between the proof-reader and his boss blossoms, which Sara aptly describes as war with one trying to lay siege to the other’s heart, the NOT is a constant feature. As one reads the book, one gets the feeling that ours is as comical an existence as the blind asylum inmates from his other famous novel Blindness. Blind but seeing-barely seeing.The History of the Siege of Lisbon is a wonderfully written novel by a writer who had complete mastery of his craft.It is a humorous, ambitious, sophisticated and intelligent re-telling of known history, albeit with a slight twist, and a warm love story between two singular and lovable characters."}, {"review_sentiment": 4.0, "review_text": "AOK  not wonderful  in fact several members of our book club disliked it so much we decided on another book  I kept re adding it as it promised a romance"}, {"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 3.0, "review_text": "I like Saramago.  I've enjoyed \"Blind\", \"Blank\" and his book on the life of Christ; however, this book seemed a little difficult to follow.  I enjoyed the relationship between the proof-reader and his boss; but, the recounting of the siege of Lisbon, presented in fits and starts, seemed kind of disjointed."}, {"review_sentiment": 4.0, "review_text": "If you're in the mood to concentrate and take on  irrepressible wit wrapped in lengthy swirling sentences, and  plot layered with wry comments on the act of writing, the reality of fiction and its purpose or purposelessness--then take on Saramago's amazing novel The History of the Seige of Lisbon. It's worth the cerebral energy."}, {"review_sentiment": 5.0, "review_text": "A magical interweaving of past, present and imagined aspects of both that also details a critical period in Portuguese history."}, {"review_sentiment": 5.0, "review_text": "Raimundo Silva is a reclusive bachelor who works as proofreader for a publishing house. One day, carried away by an irresistible impulse when revising a historical text, he introduces a \"no\" where a \"yes\" should be, and so alters History. His bosses take notice and give him a severe reprimand, especially one Maria Sara, a new, young, and good-looking executive. So Raimundo goes on working, and the novel tells us about his everyday life and the relationship that begins to develop between he and Maria Sara, mixed with the false history of the Siege of Lisbon, occurred in 1147 when a band of Crusaders, on their way to the Holy Land, agreed to help Alphonse I of Portugal to recover the city, which had been in the hands of Moors for centuries.With his elaborate prose on long paragraphs, where voices, ages and situations get mixed up, but nevertheless lucid and beautiful, Saramago recounts the vicissitudes, travails and adventures of the besieging Crusaders and the resisting Moors, as well as the new life that begins to happen to Raimundo by gradually falling in love with Maria Sara and finding out that he is well-received. During his walks through the city, Raimundo recreates its history, the long and hazardous development that populated the hills surrounding the bay. During these walks he befriends a stray dog, who one day disappears leaving him feeling identified with that dispossessed and lonely being, just as he was before reuniting, at the same time, with Love and with his city, reborn under the magic of its history.Against my expectations, for I thought this would be a presumptuous and excruciating narrative, it turned to be a simple, warm, and lovely story, which elicits sympathy for the characters and an urgent desire to visit Lisbon. It is a good novel which, though it makes use of narrative techniques typical of the XX Century's vanguards, nevertheless is never a difficult text, but instead it flows smoothly and leaves one with a good aftertaste."}]}, "authors": ["Jose Saramago"], "isbn": "0156006243", "longitude": -9.1365061, "periods": ["1900s", "500-1400s"], "title": "The History of the Siege of Lisbon", "word_cloud": "story main character text day age story ht century story intertwine clever way make greatness author voice iconoclastic time sarcastic time extremely funny handle theme historical truth religion nature man war communism prejudice thing attentively enjoy nuance favorite leave feel time write several literary revelation first teach several innovation form new revise bonding fiction life take delight delight safely say prof excitement create read almost year record level never want end wholly recommend version anyone difficulty reading read fantastic job pronounces street name satisfy go utter excitement point maybe sympathy feel lover story combination contempt tend historical novel find new friend usual find pitifully hard actually put finger love love love genius full tenderness point sentence idea popular fully recommend lover nothing miss street love interesting though probably appreciate enough story base translator intentionally add word translation significantly change write probably story author use character well add detail write liter native add interest turn good recommend even probably qualify story twist thing alter certain known historical fact ask much truth historical fact start challenge credence give many instance pen even eyewitness event even miracle purportedly witness ancient saint accept strange world author ask thing believe write prefer say thing write believe even today positively mad part call product historian fertile imagination much detail add erased due historian bias much meaning lose translation misprint language speeches often write verbatim attributed major historical figure mere embellishment prose mere narration fiction mutilation facts story begin proof defeat moor rule city year recorded seek aid way holy agree insert main event unfold fortunately proof deliberate error discover go print erratum insert warn reader mistake author play error asks much write due conscious vandalism facts publisher reaction error new administrator charge far outrage deliberate error fascinate happen challenge write alternative version point view alter also fundamentally even joyfully alter life many year live lonely existence consequent find longer walk past florist shop stop enters buy story continue follow error level present fall version story much make ponders reconstruct historical event even revise version trust teems speculation time conjured version truth fact modern improbable relationship bos blossom aptly describe war try lay heart constant feature read get feel comical existence blind asylum inmates famous wonderfully write writer complete mastery humorous ambitious sophisticated intelligent know albeit slight twist warm love story singular lovable character wonderful fact several member club disliked much decide keep add promise romance great like enjoy life however seem little difficult follow enjoy relationship recount present fit start seem kind disjoint mood concentrate take irrepressible wit wrap lengthy swirl sentence plot layer wry comment write reality fiction purpose purposelessness amaze worth cerebral energy magical interweaving past present imagine aspect also detail critical period reclusive bachelor work proofreader publish house day carry away irresistible impulse revise historical text introduces yes alters boss take notice give severe reprimand especially new young executive go work tell everyday life relationship begin mixed false occur band way agree help city hand moor elaborate prose long paragraph voice age situation get mixed nevertheless lucid beautiful recount vicissitudes travail adventure besiege crusader resist moor well new life begin gradually fall find walk city recreate long hazardous development populate hill surround bay walk befriends stray dog day disappear leave feel identify dispossessed lonely reunite time city reborn magic expectation think excruciate narrative turn simple warm lovely story elicits sympathy character urgent desire visit good make use narrative technique typical xx vanguard nevertheless never difficult text instead flow smoothly leaf good aftertaste", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In this “ingenious” novel (New York Times) by “one of Europe’s most original and remarkable writers” (Los Angeles Times), a proofreader’s deliberate slip opens the door to romance and confounds the facts of Portugal’s past. Translated by Giovanni Pontiero.", "asin": "0156006243", "rank": "692953", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/51RxbdFr-lL.jpg", "country": "Portugal", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}