{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 69, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Saramago uses his beautiful prose and magical language to weave a story of love and history that entertains and informs the reader about life in 18th Century Portugal."}, {"review_sentiment": 5.0, "review_text": "Being one of the world's most celebrated writers and a winner of the Nobel Prize for literature, Saramago has outdone himself once again.His attention to detail is as eye-opening from page one until the very last page.Of all the books he has written, I enjoy this one the most, and I have read quite a few of his works.  The only book of his that I take exception to is The Stone Raft which I read prior to this one.  I really  had to force myself to stay on track to finish it.My son, Stephen, introduced me to Saramago and I am eternally grateful."}, {"review_sentiment": 5.0, "review_text": "A classic"}, {"review_sentiment": 5.0, "review_text": "This is the tale of a man and woman in 17th century Portugal.  It has all the elements of a love story but also fighting, blood, sex (from the man's point of view), aviation, and history.  One of the characters, Father Bartolomeu, actually existed and did invent a prototype flying machine.  The author has an interesting and poetic way of telling a story."}, {"review_sentiment": 5.0, "review_text": "Cynical and romantic, there's something enchanting about the authors unique writing style. Not a book you should expect to run through with much speed though."}, {"review_sentiment": 4.0, "review_text": "I wanted to give this book 5 stars, and would have \"But for\" the too-long and rather dry parts, here and there. Without those parts, the book would have been \"Exceptional\"."}, {"review_sentiment": 5.0, "review_text": "Saramago is OUTSTANDING!!!!!!!!!!!"}, {"review_sentiment": 4.0, "review_text": "I was preparing for a trip to Portugal and thought this would be an interesting book to read.  It was great historical background with a little fantasy and romance thrown in.  I  enjoyed the book from that perspective."}, {"review_sentiment": 2.0, "review_text": "Clumsy anti-monarchic, leftist style. I was deeply surprised knowing this author has won in 1998 the Nobel Prize for literature, mind you, one thousand nine hundred ninety eight, that is not 1793 when to be antimonarchist  was a challenge. The book was published  in 1982, simultaneously with the worst part of leftist terror in half of Europe, not contemporary to the French Revolution.  Atheist attitude in Voltaire times would be audacious, but in 1982... oh, come on! One might ask himself (or herself in this case) what the heck were the Noble Prize jury members thinking?I understand I am losing a lot of the syntactical beauty of the author's style by reading it in English. That might be true. Latin languages don't translate well into Germanic ones. But the propagandistic attitude is there, be they in long or short sentences.  I am not a monarchist myself but it gets on my nerves when someone tries to push it (or any other political attitude for that matter) down my throat under the cover of \"art\", not even bothering to wrap it under a gracious weave of persuasion.I might add the author has - again in 1982! - no idea of reading court rituals as what they are, that is gestures charged with supplementary meaning, symbolic gestures, not idiotic, time losing, moronic loss of time. Historians like Jacques le Goff are contemporary with Saramango, has Portugal never imported any kind of contemporary historical or cultural anthropology? Were they never translated into Portuguese?  The novelist understanding of the time he is dealing with is dramatically limited to the pure facts without any attempt to understand the context, the way the court members, grown and educated in this milieu understood their lives, their own rituals, their faith, their destiny.Totally disappointed."}, {"review_sentiment": 5.0, "review_text": "Took a side trip to Mafra, the Portuguese  town just north of Lisbon which is the setting of this book's main endeavor, the building of a grand and huge palace by King Jao in the 17th century. The title characters are the hapless, but resourceful victims of a clueless king who blows through all the wealth brought into his kingdom from Portuguese exploration to satisfy his ego.  The lack of punctuation is a challenge but one I was rewarded for taking on by my enjoyment of the wit and humor and sardonic observations of this prizewinning  author. Some what  fantastical  the tale includes flying machines, snippers of the Inquisition and clairvoyance.For me the book offered the opportunity to acquire a frame of reference  as a one week tourist in Portugal and to discover a wonderful writer whom I otherwise would not have sought-after ."}]}, "authors": ["Jose Saramago"], "isbn": "0156005204", "longitude": -9.1365061, "periods": ["1700s"], "title": "Baltasar and Blimunda", "word_cloud": "use beautiful prose magical language weave story love history entertain informs life be world celebrate writer winner literature outdone attention detail page last write enjoy quite work take exception prior really force stay track finish son introduce eternally grateful classic tale man woman century elements love story also fight blood sex man point view aviation history character actually exist invent prototype fly machine author interesting poetic way tell story cynical romantic something enchant author unique write style not much speed want give star rather dry part part outstanding prepare trip thought great historical background little fantasy romance thrown enjoy perspective clumsy leftist style deeply surprised knowing author literature mind hundred ninety anti monarchist challenge publish simultaneously worst part leftist terror half contemporary french attitude time case heck jury member think understand lose lot syntactical beauty author style read true languages translate well one propagandist attitude long short sentence monarchist get nerve someone try push political attitude matter throat cover art even bother wrap gracious weave author idea read court ritual gesture charge supplementary mean symbolic gesture idiotic time lose moronic loss time historians le contemporary never import kind contemporary historical cultural anthropology never translate novelist understanding time deal dramatically limited pure fact attempt understand context way court member grow educate milieu understood life ritual faith disappointed side trip town north setting main endeavor building grand huge palace century title character hapless resourceful victim clueless king blow wealth bring kingdom exploration satisfy ego lack punctuation challenge reward take enjoyment wit humor sardonic observation prizewinning author fantastical tale include fly machine snippet offer opportunity frame reference week tourist discover wonderful writer otherwise", "genres": ["Fiction & Literature", "Romance", "Historical Fiction"], "summary": "Baltasar and Blimunda is a novel by the Nobel Prize-winning Portuguese author José Saramago.\r\n\r\nIt is a love story set in the 18th century with the construction of the Convent of Mafra, now one of Portugal's chief tourist attractions, as a background. Two young lovers interact naturally with historical characters including the composer and harpsichordist Domenico Scarlatti and the priest Bartolomeu de Gusmão, recognized today as an aviation pioneer, all in the shadow of the Inquisition. The lovers are always at center stage wrapped in Saramago's language, which ranges from short simple sentences to surrealistic, unpunctuated paragraphs that help to intensify both the action and the setting.\r\n\r\nThe book served as the basis for the opera Blimunda (1990), composed by Azio Corgi.\r\n\r\nWikipedia", "asin": "0156005204", "rank": "188756", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/41oedCudAyL.jpg", "country": "Portugal", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}