{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 466, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Great read!"}, {"review_sentiment": 5.0, "review_text": "Great conditionNice narrativeGood book, fast delivery"}, {"review_sentiment": 5.0, "review_text": "I read this when it came out in '91, and have read it again several times since; because it is profoundly moving."}, {"review_sentiment": 5.0, "review_text": "A very good book.  Excellent historical novel with regard to italy and WWI.  The primary character was quite a philosopher and well.... I guess I would say he got me thinking.  The writing is excellent and I enjoyed the whole story even though this is a very long book."}, {"review_sentiment": 5.0, "review_text": "Starts off a little slowly, but definitely stick with it. Amazing story, amazing writing."}, {"review_sentiment": 5.0, "review_text": "A must read!"}, {"review_sentiment": 5.0, "review_text": "Excellent, interestingly written"}, {"review_sentiment": 5.0, "review_text": "Fast delivery, can't wait to read it"}, {"review_sentiment": 5.0, "review_text": "A great story that I enjoyed reading! Beautiful prose."}, {"review_sentiment": 5.0, "review_text": "I loved it! I am just finishing up a year living in the Dolomites of Italy. As I move through the mountains here, I see many bunkers used by soldiers in WWI and appreciated this book for bringing them to life. Helprin is a masterful storyteller who kept my attention through the entire 860 pages. I always enjoyed the opportunity to sit down and read. I especially loved this conversation between Alessandro and one of his captors Strassnitzky (p663):\"Rome is a training school for the heavenly city, a jumping-off place. You take earthly pleasures and gracefully translate them to the language of the divine.\"\"That's called art,\" Alessandro said.\"But what if death is only a void?\"\"Even if heaven doesn't exist, I will have experienced it beforehand, because I will have created it.\"Spoken like someone who truly lives each day, each moment (!) to the fullest and as if it could be his last."}]}, "authors": ["Mark Helprin"], "isbn": "0156031132", "longitude": 12.4829321, "periods": ["1900s"], "title": "A Soldier of the Great War", "word_cloud": "condition nice narrative good fast delivery come several time profoundly move good historical regard italy primary character quite philosopher well guess get think write excellent enjoy whole story even long little slowly definitely stick story amaze writing excellent interestingly write fast delivery story enjoy read prose love finish year living move mountain see many bunker use soldier appreciate bring life masterful storyteller keep attention entire page always enjoy opportunity sit especially love conversation captor train school heavenly city place take earthly pleasure gracefully translate language divine call art say death void even heaven exist experience beforehand create someone truly live day moment fullest last", "genres": ["Fiction & Literature", "Historical Fiction", "WWI"], "summary": "From acclaimed novelist Mark Helprin, a lush, literary epic about love, beauty, and the world at war.\r\n\r\nAlessandro Giuliani, the young son of a prosperous Roman lawyer, enjoys an idyllic life full of privilege: he races horses across the country to the sea, he climbs mountains in the Alps, and, while a student of painting at the ancient university in Bologna, he falls in love. Then the Great War intervenes. \r\n\r\nHalf a century later, in August of 1964, Alessandro, a white-haired professor, tall and proud, meets an illiterate young factory worker on the road. As they walk toward Monte Prato, a village seventy kilometers away, the old man—a soldier and a hero who became a prisoner and then a deserter, wandering in the hell that claimed Europe—tells him how he tragically lost one family and gained another. \r\n\r\nThe boy, envying the richness and drama of Alessandro's experiences, realizes that this magnificent tale is not merely a story: it's a recapitulation of his life, his reckoning with mortality, and above all, a love song for his family.", "asin": "0156031132", "rank": "46679", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51owrdIrtPL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}