{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 30, "rating": 3.2, "reviews": [{"review_sentiment": 3.0, "review_text": "A great description of author's travels through Portugal and his viewing of art in museums and churches.  Unfortunately, the figures are not included in the eBook."}, {"review_sentiment": 1.0, "review_text": "This book was not the travel companion I wanted."}, {"review_sentiment": 4.0, "review_text": "A very literary travel guide (as Umberto Eco in Italy or Gabriel Marquez visits Columbia). A bit repetitious about how he had to go look for someone to open a site for him to visit... until I went to Portugal and realized that's the way you have to do it!"}, {"review_sentiment": 5.0, "review_text": "Very nice copy, delivered on time, Thank-you very much!"}, {"review_sentiment": 5.0, "review_text": "I love travelogues and this one is no exception.  I'm planning a trip to Portugal and wanted to read this before going.  Saramago is a bit difficult to read at times but his wit and insight bring a warmth to the book that can sometimes be missing.  I'm already planning on reading it again."}, {"review_sentiment": 5.0, "review_text": "The best book to understand this small country of 10 million people with its outsized impact in shaping the world."}, {"review_sentiment": 2.0, "review_text": "I will say some of the negative reviews here are unfair.  Some reviews took the author to task for not writing a travel guide, and he expressly says that was not his intent.  I had hoped the book would be a mix of travel, history and ideas - in the manner of Bruce Chatwin's travels to Patagonia and the Austrailian Outback, or Peter Matthiesen's The Snow Leopard.  Unfortunately that does not happen here either.  Saramago's first person narrator referred to as \"the traveler\" throughout travels throughout Portugal, mostly to rural areas. He hardly ever meets anyone. The book is purely descriptions of landscapes.  I was expecting to get some insights into a country that has always fascinated me from a Nobel Prize writer.  That did not happen."}, {"review_sentiment": 5.0, "review_text": "Many gave one star to this book. My comment is: this is a book only for cultured Portuguese, Brazilians and whomever is familiar with the Portuguese culture, and familiar with the works of José Saramago. One looking simply for a tour guide of Portugal should look somewhere else.Outsiders will be rewarded with great treasures if they make the effort to read it little by little, getting help from researching the Internet at the same time."}, {"review_sentiment": 5.0, "review_text": "Interesting book by the eyes of a very knowledgeable man."}, {"review_sentiment": 1.0, "review_text": "Trying to get background on Portugal before traveling there but pretty disappointed in this one. Saramago drives around the country, spending most of his time in rural areas. But his favorite thing seems to be visiting churches and occasionally perusing old objects in museums. If you want architectural descriptions of countless rural churches, this is the book for you!  If you want to share in some interesting conversations, learn what the history or current challenges of each region are, look elsewhere. In fact, Saramago seems to go out of his way to avoid conversations and short of a few detailed descriptions of meals or a flat tire, you don't even get much of a sense of his journey. Contrast this with Paul Theroux's recent book Deep South where he drives around southern, rural USA and you share in history and conversations that allow you to come away with a distinct impression of what makes the area unique. I'd recommend Barry Hatton's book The Portuguese which written by an outsider (reporter who lived there for many years), gives a much better background on the country than what Saramago achieves here."}]}, "authors": ["Jose Saramago"], "isbn": "0156007134", "longitude": -9.1365061, "periods": ["2000s"], "title": "Journey to Portugal: In Pursuit of Portugal's History and Culture", "word_cloud": "great description author travel view art museum church unfortunately figure include e book travel companion want literary travel guide visit bit repetitious someone open site visit go realize way very nice copy deliver time much love travelogue exception plan trip want go bit difficult time wit insight bring warmth sometimes miss already plan read best understand small country people outsize impact shape world say negative review unfair review take author task write travel guide expressly say intent hop travel idea manner travel either first person narrator refer traveler travel mostly rural area hardly ever meet anyone purely description landscape expect insight country always fascinate writer many give star comment culture portuguese familiar portuguese familiar work look simply guide look somewhere reward great treasure make effort little little get help research time interest eye knowledgeable man try get travel pretty disappointed drive country spending time rural area favorite thing seem visit church occasionally peruse old object museums want architectural description countless rural church want share interesting conversation learn current challenge region look elsewhere fact seem go way avoid conversation short detailed description meal flat tire even much sense recent drive southern rural share conversation allow away distinct impression make area unique recommend write outsider reporter live many year give much better background country achieves", "genres": ["History", "Travel Writing"], "summary": "When José Saramago decided to write a book about Portugal, his only desire was that it be unlike all other books on the subject, and in this he has certainly succeeded. Recording the events and observations of a journey across the length and breadth of the country he loves dearly, Saramago brings Portugal to life as only a writer of his brilliance can. \r\n\r\nForfeiting the usual sources such as tourist guides and road maps, he scours the country with the eyes and ears of an observer fascinated by the ancient myths and history of his people. Whether it be an inaccessible medieval fortress set on a cliff, a wayside chapel thick with cobwebs, or a grand mansion in the city, the extraordinary places of this land come alive. \r\n\r\nAlways meticulously attentive to those elements of ancient Portugal that persist today, he examines the country in its current period of rapid transition and growth. Journey to Portugal is an ode to a country and its rich traditions.", "asin": "0156007134", "rank": "240439", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/51FcSFC6fhL.jpg", "country": "Portugal", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}