{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 21, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Terrific book, smartly written.  Readers must keep in mind that it was written more than 50 years ago, and outdated generalities of culture appear from time to time.  I enjoyed this read.  It brought me back to the alleys, canals and piazzas of Venice."}, {"review_sentiment": 5.0, "review_text": "This world classic of travel writing is a must in any scholarly library. In Venice Morris practically defines modern travel writing.  In my opinion one of the worlds top writers without need to include the term \"travel\".  Sadly Harcourt Press have done us the readers and Morris a serious disfavour in the way they printed this classic.  So tight are the lines, so poorly printed is the text and so unbelievable awful are the photo reproductions I can hardly say.  I own many Morris books both paper and hardback but none are so badly printed as this.  Harcourt seems to take pride in printing Venice on the cheapest paper, with the worst font available.  It is a absolute eye sore to read given the thin spacing of the text.  Do yourself a favour and DON'T BUY THIS EDITION.  Look for the UK version or any other publisher than Harcourt.  An extremely sad result given the importance of this book on travel writing world wide."}, {"review_sentiment": 5.0, "review_text": "Book arrived quickly and in \"new\" condition. All good."}, {"review_sentiment": 5.0, "review_text": "The esteemed author at her best relishing centuries of Venice's singular legacy."}, {"review_sentiment": 1.0, "review_text": "Overly verbose"}, {"review_sentiment": 5.0, "review_text": "This book was a great companion during my stay in Venice. It was delicious!"}, {"review_sentiment": 3.0, "review_text": "It is a difficult read.  Lots of things to learn here but the type is very small and it is taking forever to read."}, {"review_sentiment": 5.0, "review_text": "This is a delightful volume. The Venetian society that Morris so lovingly describes may be largely gone but if so the value of this book is increased for the traveler of 2015 and beyond. As Morris finds pleasure in the comments of earlier travelers so will later travelers take pleasure in hers."}, {"review_sentiment": 5.0, "review_text": "Great read in preparation for my trip to Venice."}, {"review_sentiment": 5.0, "review_text": "Couldn't get into the book, but the delivery and all was great."}]}, "authors": ["Jan Morris"], "isbn": "0156983567", "longitude": 12.3345898, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s"], "title": "The World of Venice", "word_cloud": "smartly write mind write year ago outdated generality culture appear time time enjoy bring alley canal piazzas classic travel write scholarly practically define modern travel write opinion top writer need include term travel do reader serious disfavor way print classic tight line poorly print text unbelievable awful photo reproduction hardly say many paper hardback none badly print seem pride print cheapest paper worst font available absolute eye sore give thin space text favor version publisher extremely sad result give importance travel write wide arrive quickly new condition good esteemed author best relish century singular legacy overly verbose great companion stay delicious difficult thing learn type small take forever delightful volume venetian society lovingly describe largely go value increase traveler find pleasure comment earlier traveler later traveler take pleasure preparation trip delivery great", "genres": ["History", "Travel Writing"], "summary": "A fascinating exploration of the history, sights, seasons, arts, food, and people of an incomparable city.\r\n\r\n“A highly intelligent portrait of an eccentric city, written in powerful prose and enlivened by many curious mosaics of information...a beautiful book to read and to possess.” The Observer", "asin": "0156983567", "rank": "759641", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51nxewuI%2BLL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}