{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 43.7698712, "ratings": {"num_ratings": 37, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent transaction."}, {"review_sentiment": 5.0, "review_text": "Love this book and Venice Observed too.  McCarthy is smart. Florence is fascinating and beautiful. Read book. Go there."}, {"review_sentiment": 5.0, "review_text": "A fascinating journey through Florentine history, art, and soul. We follow the author's stream of consciousness and immerse into the world of aesthetics and also feel the rhythm of after-WWII Florence. The language is beautiful, florid yet never over-complicated. I enjoyed every bit."}, {"review_sentiment": 4.0, "review_text": "Often meandering beyond reasonable, but well worth your time for its scatterring of sweeping and pointed pronouncements on Florence's artistic riches and historic significance. The author's views on Uccello's paintings is a great example of how an insightful and accessible opinion can illuminate a work of art and help make it a part of your world."}, {"review_sentiment": 5.0, "review_text": "Surprisingly detailed for its length, this history of the development of Florence, focusing on the city's premier role in the the Renaissance via artists such as Donatello and Brunelleschi, is educational as well as fascinating."}, {"review_sentiment": 5.0, "review_text": "An insightful glance into the history of the landscape from a '50's perspective."}, {"review_sentiment": 3.0, "review_text": "Bought for my wife to read before a trip to Florence. However, the author devotes the first chapter to problems with Florence especially in August (heat, crowds, etc.) so it didn't appeal to her. It's only later that the author demonstrates her admiration for the city. I read it after our visit and it gave me many ideas for the next time that are not the most common tourist attractions.  Know this is an old book, from the 50s, so much has changed, and much has not. Also, agree with other reviews that the book is unorganized, chapters are not named so she is very meandering with her thoughts and unless you are a Renaissance expert many references have to be looked up."}, {"review_sentiment": 2.0, "review_text": "This book is full of interesting facts about Florence.  But the organization of those facts is very poor.  It reads like a list of facts.  They aren't sorted in any particular order or woven into a story."}, {"review_sentiment": 5.0, "review_text": "Cynical story line and also negative about tourist with locals. Overall I found this book interesting and humorous for its time"}, {"review_sentiment": 5.0, "review_text": "I am not reviewing the Kindle version.  I want to point out that this book was written in 1959 and was not meant as a tour guide at all.  The original and the 1987 hardbound edition that I have both have plenty of photographs. I think it is a beautiful portrait of modern Florence almost 60 years ago.  It is unkind to tourists (like myself) though ;->"}]}, "authors": ["Mary McCarthy"], "isbn": "0156027631", "longitude": 11.2555757, "periods": ["1900s"], "title": "The Stones of Florence", "word_cloud": "excellent transaction smart fascinate beautiful fascinating journey history art soul follow author stream consciousness immerse world aesthetic also feel rhythm language beautiful florid yet never enjoy bit often meander reasonable well worth time scatter sweep pointed pronouncement artistic rich historic significance author view painting great example insightful accessible opinion illuminate work art help part world surprisingly detailed length history development focus city premier role artist educational well fascinate insightful glance history landscape perspective wife trip however author devotes first chapter problem especially heat crowd appeal later author demonstrate admiration city visit give many idea next time common tourist attraction know old much change much also agree review unorganized chapter name meander thought expert many reference look full interesting fact organization fact poor read list fact sort particular order weave story cynical story line also negative tourist local overall find interest humorous time review version want point write meant tour guide original hardbound edition plenty photograph think beautiful portrait modern almost year unkind tourist", "genres": ["Art & Architecture", "History", "Travel Writing"], "summary": "A beloved tribute to Florence that blends history, artistic reflection, and keen social observation\r\n \r\nRenowned for her sharp literary style, essayist and fiction writer Mary McCarthy offers a unique history of Florence, from its inception to the dominant role it came to play in the world of art, architecture, and Italian culture, that captures the brilliant Florentine spirit and revisits the legendary figures—Dante, Michelangelo, Machiavelli, and others—who exemplify it so iconically. Her most cherished sights and experiences color this timeless, graceful portrait of a city that's as famous as it is alluring.\r\n\r\n“Miss McCarthy is not only well versed in the subject but her taste is sure and her style—cool, astringently witty, yet eloquent—seems tailor-made for depicting the brilliant, mercurial, skeptical Florentines....no student of the Renaissance should be without The Stones of Florence.” The New York Times ", "asin": "0156027631", "rank": "295079", "city": "Florence", "image": "https://images-na.ssl-images-amazon.com/images/I/51pmbys7EvL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}