{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 97, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Read it after reading about it in the Economist. 30's young Londoners do resemble Millennials quite a bit."}, {"review_sentiment": 5.0, "review_text": "This book was not at all what I expected from G.O. I did love this book though. Fabulously descriptive and totally takes the reader to 1930s London. Gordon is not a very likable character, yet you are almost forced to like him. He is such a victim of circumstances and yet above all a \"gentleman\". This was set during a time of definite distinction in class. He is extremely poor but comes from a good family and is well read and fancies himself a poet. I really \"got\" Gordon and could understand exactly where he was coming from. His close friend and long suffering girlfriend never gave up on him. Loved these characters, and loved this book!!"}, {"review_sentiment": 2.0, "review_text": "Too slow. The repetitiveness of the poverty theme becomes tiresome with no real action to bring the story alive. A social commentary of the times it may be but I found Gordon's endless harping on about his lack of funds depressing. A conversation he has with his wealthy friend Ravelston in a pub tries to be philosophical but is too long winded and goes nowhere. There were moments I wanted to take hold of Gordon and give him a shake, because I just could not get to grips with why he purposefully plunges himself into poverty then complains about it. Maybe I've missed a trick here but for all of Orwell's place in the literary firmament, this is perhaps not his best offering."}, {"review_sentiment": 5.0, "review_text": "A+"}, {"review_sentiment": 4.0, "review_text": "Haven't read this in a while. Gordon gets a bit redundant. He is a socialist living in a capitalist's world. Complains about not having anything, but refuses to compromise his own values. We meet some interesting characters along the way. His love life is mysterious. He is friends with the very thing he hates. I think the story illustrates the fate of our starving artists relatively well."}, {"review_sentiment": 4.0, "review_text": "Typical George Orwell writing."}, {"review_sentiment": 4.0, "review_text": "I have read this novel several times and always enjoy Gordon Comstock's war against the \"money god\" even though I know the ultimate outcome. Orwell is not great about hopeful endings but it never taints readings both past and future. The novel will never be as highly regarded as Animal Farm or 1984 but is  a worthy addition to Orwell's work's and not be casually brushed off so casually as some lesser work. Any admirer of Orwell or anyone wanting to venture deeper to this author's remarkable insights should give this a chance ."}, {"review_sentiment": 3.0, "review_text": "It is a  little wordy and slow, but who can argue with George Orwell?"}, {"review_sentiment": 4.0, "review_text": "This book makes Darwin smile in his grave. As usual, reproduction triumphs!"}, {"review_sentiment": 5.0, "review_text": "I couldn't put this book down as it was a very enjoyable read, however, on finishing the book, I feel I have an insight into what being poor is really like.  Now I want to read 'Down and out in Paris and London'.  I think it is one of those books everyone should read."}]}, "authors": ["George Orwell"], "isbn": "0156468999", "longitude": -0.12574, "periods": ["1900s"], "title": "Keep the Aspidistra Flying", "word_cloud": "read young resemble quite bit expect love fabulously descriptive totally take likable character yet almost force victim circumstance yet gentleman set time definite distinction class extremely poor come good family well fancy poet really get exactly come close friend long suffer girlfriend never give character love too slow repetitiveness poverty theme become tiresome real action bring story alive social commentary time find endless harp lack fund depress conversation wealthy friend pub try philosophical long wind go nowhere moment want take hold give shake grip purposefully plunge poverty complains maybe miss trick place literary firmament perhaps best offering get bit redundant socialist live capitalist world anything refuse compromise value meet interesting character way love life mysterious friends thing hate think story illustrates fate starve artist relatively well typical write several time always enjoy war money god even know ultimate outcome great hopeful ending never taint reading future never highly regarded worthy addition work casually brush casually lesser work admirer anyone want venture deeper author remarkable insight give chance little wordy slow argue make smile grave usual reproduction triumph enjoyable however finish feel insight poor really now want think everyone", "genres": ["Fiction & Literature"], "summary": "Gordon Comstock is a poor young man who works in a grubby London bookstore and spends his evenings shivering in a rented room, trying to write. He is determined to stay free of the “money world” of lucrative jobs, family responsibilities, and the kind of security symbolized by the homely aspidistra plant that sits in every middle-class British window.", "asin": "0156468999", "rank": "310043", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/512jof2Hi7L.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}