{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 218, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "I absolutely loved this book. I don't know whether a knowledge of chess would have made it more enjoyable or not. If you don't know chess, this book will not be off-putting. At least it wasn't for me.They mystery surrounds a 15th century painting and artist when Julia, an art conservationist/restorer discovers hidden beneath some of the paint, a cryptic question: \"Who killed the knight?\" As Julia delves into the old mystery, to solve the murder, she finds herself embroiled in a modern day mystery, and her life is in danger.There are holes in the story, but I don't know if they are due to the author or the translator, or a combination of the two. The ending left a few questions, but nothing serious. However, I read fiction for the escape, and I found this a delightful escape. But, then, I'm a sucker for historical fiction. Even if it takes place is the modern era.I did do a bit of research about both the artist and the painting. The information is available on the web if any of you choose to do likewise.Highly recommended."}, {"review_sentiment": 4.0, "review_text": "A good book.  I'm a chess player and enjoyed very much the premise of the game telling a historical mystery.  It was highly recommended by a friend and I enjoyed it.  The characters don't always make much sense, but its a plot driven story that wants to be a character driven story, but its okay."}, {"review_sentiment": 5.0, "review_text": "I've read the 6 of the 7 \"Captain Alatriste\" young adult books and \"the Club Dumas\" a mystery. I recommend all of his books that have been translated from the Spanish originals. \"The Flanders Panel\" is a current time art related mystery. A most enjoyable read!!"}, {"review_sentiment": 4.0, "review_text": "Good, the interweaving of historical and present-day story line drives the action. A surprising twist at the end."}, {"review_sentiment": 5.0, "review_text": "I read this many years ago and just rediscovered it.  It ranks among the best books on chess for non-players along with \"The Eight\",  by Kathleen Neville.  Neither of these books is new - probably 20-, maybe 30 years old, but they still ring true today with their intricate plots, and chess backgrounds.  if you find a copy of either title, find a quiet place to read and be prepared to not surface until you're finished!  Enjoy!"}, {"review_sentiment": 5.0, "review_text": "Enjoyed very much!  Arturo Petez-Reverie is a very intriguing author and his novels are quite thought provoking.  Not easy to put down!"}, {"review_sentiment": 5.0, "review_text": "Well woven, imaginative story with astute presentation of chess angle and complex characters."}, {"review_sentiment": 4.0, "review_text": "The interplay of chess and the crimes is a significant part of the story.  If you have no interest in the game, look into another of the author's works."}, {"review_sentiment": 3.0, "review_text": "I'm not too interested in chess, I'm more interested in the art restoration and I think this is more about the chess game.  The plot was interesting and the end left the reader wondering which is good.  I try to work it out every now and then."}, {"review_sentiment": 2.0, "review_text": "If one doesn't play and have a deep understanding of chess .this book is not for you. Moves at a glacial pace with occasional thaws."}]}, "authors": ["Arturo Perez-Reverte"], "isbn": "0156029588", "longitude": -3.7035825, "periods": ["2000s"], "title": "The Flanders Panel", "word_cloud": "absolutely love know knowledge chess enjoyable know chess least mystery surround century paint artist art discovers hide beneath paint cryptic question kill knight delve old mystery solve murder find embroiled modern day mystery life hole story know due author translator combination end left question nothing serious however fiction escape find delightful escape sucker historical fiction even take place modern bit research artist paint information available web choose recommend good chess player enjoy much premise game tell historical mystery highly recommend friend enjoy character always make much sense plot drive story want character driven story okay captain young adult mystery recommend translated spanish original current time art relate mystery enjoyable good interweave historical story line drive action surprising twist end many year ago rediscover rank best chess new probably maybe year old still ring true today intricate plot chess background find copy title find quiet place prepare surface finish enjoyed much intrigue author novel quite think provoke not easy well woven imaginative story astute presentation chess angle complex character interplay chess crime significant part story interest game look author work interested chess interested art restoration think chess game plot interesting end leave wonder good try work play deep understanding chess glacial pace occasional thaw", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A fifteenth-century painting by a Flemish master is about to be auctioned when Julia, a young art restorer, discovers a peculiar inscription hidden in a corner: Who killed the knight? In the painting, the Duke of Flanders and his knight are locked in a game of chess, and a dark lady lurks mysteriously in the background. Julia is determined to solve the five-hundred-year-old murder, but as she begins to look for clues, several of her friends in the art world are brutally murdered in quick succession. Messages left with the bodies suggest a crucial connection between the chess game in the painting, the knight's murder, the sordid underside of the contemporary art world, and the latest deaths. Just when all of the players in the mystery seem to be pawns themselves, events race toward a shocking conclusion.\r\n\r\nA thriller like no other, The Flanders Panel presents a tantalizing puzzle for any connoisseur of mystery, chess, art, and history. \r\n", "asin": "0156029588", "rank": "231724", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51G9ilrvoWL.jpg", "country": "Spain", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}