{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 37.8044557, "ratings": {"num_ratings": 132, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "Already reads like 1950's SF.  Good writing -- Lethem is no bum -- but the novel just doesn't hold up."}, {"review_sentiment": 2.0, "review_text": "This is a hodgepodge of bits from Raymond Chandler, Ray Bradbury (Fahrenheit 451), Gary Wolf (Roger Rabbit), Cordwainer Smith (C'Mell). The description sounded like a fun read.  Sadly the quality of the writing is not anywhere near that of the aforementioned.  Actually the Chandler bits feel like they were taken second hand from B-movies rather than by actually reading Chandler.  I tried hard but after Chapter 5 both bored and annoyed."}, {"review_sentiment": 5.0, "review_text": "Gratbangle"}, {"review_sentiment": 3.0, "review_text": "A decent Chandler-esque novel in the distopian future."}, {"review_sentiment": 5.0, "review_text": "Great twist on a noir. Every chapter is a page-turner."}, {"review_sentiment": 3.0, "review_text": "Original concept, certain themes could have been explored further"}, {"review_sentiment": 3.0, "review_text": "It's a decent noir, set in a dystopian future. For the first half of the book I was increasingly annoyed that the author wasn't really shedding light on his future society. At the end of the book this is redeemed somewhat; we get more of a sense of how things came to this pass, by seeing things get even more messed up. But overall I found it frustrating."}, {"review_sentiment": 5.0, "review_text": "really good"}, {"review_sentiment": 4.0, "review_text": "I really enjoyed reading this. It's really funny in an extremely dark humor sort of way. It's fun, unusual and highly entertaining. Now, is it one of the greatest works of literature in the history of the universe? No, definitely not. But it is a fun, easy and quick read. I will be buying more of his novels."}, {"review_sentiment": 3.0, "review_text": "I really wanted to like this book because the cover and name are really great, I know, lame reason. There were some parts that the author could've skipped as they didn't add to the story, but then some really interesting developments, like the human-animals and drugs everyone does, that he doesn't really expand on, even though it would've helped with the story and interest factor. Also the characters are pretty basic except for the protagonist and at some points it can get a bit confusing of what exactly is happening and why. Overall it wasn't bad but nothing great."}]}, "authors": ["Jonathan Lethem"], "isbn": "0156028972", "longitude": -122.2713563, "periods": ["1900s"], "title": "Gun, with Occasional Music", "word_cloud": "already read write bum hold hodgepodge bits description sound fun quality write anywhere near aforementioned actually bit feel take second hand rather actually read try hard chapter bore annoyed gratbangle decent distopian future twist nor chapter original concept certain theme decent nor set dystonia future first half increasingly annoy author really shed light future society end redeem somewhat get sense thing come pas see thing get even mess overall find frustrate really good really enjoy read really funny extremely dark humor sort way fun unusual highly entertain now greatest work literature history universe definitely fun easy quick buy novel really want cover name really great know lame reason part author story really interesting development drug everyone really even story interest factor also character pretty basic protagonist point get bit confusing exactly happen overall bad nothing great", "genres": ["Fiction & Literature", "Mystery & Suspense", "Science Fiction"], "summary": "Gumshoe Conrad Metcalf has problems - there's a rabbit in his waiting room and a trigger-happy kangaroo on his tail. Near-future Oakland is a brave new world where evolved animals are members of society, the police monitor citizens by their karma levels, and mind-numbing drugs such as Forgettol and Acceptol are all the rage.\r\n\r\nMetcalf has been shadowing Celeste, the wife of an affluent doctor. Perhaps he's falling a little in love with her at the same time. When the doctor turns up dead, our amiable investigator finds himself caught in a crossfire between the boys from the Inquisitor's Office and gangsters who operate out of the back room of a bar called the Fickle Muse.\r\n\r\nMixing elements of sci-fi, noir, and mystery, this clever first novel from the author of Motherless Brooklyn is a wry, funny, and satiric look at all that the future may hold.\r\n", "asin": "0156028972", "rank": "132823", "city": "Oakland", "image": "https://images-na.ssl-images-amazon.com/images/I/41pM%2BgoGnxL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}