{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 361, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Onde of the best books I’ve ever read."}, {"review_sentiment": 2.0, "review_text": "The conversion from the text to Kindle is full of errors, making this version difficult to read."}, {"review_sentiment": 4.0, "review_text": "This was really quite good. It was interesting to read a book from that era and see first hand the relationship between the British and occupied India."}, {"review_sentiment": 1.0, "review_text": "Do not purchase this Kindle edition.  The text is broken four-line chunks, with no reference to the original paragraph structure.  This is a waste of money."}, {"review_sentiment": 1.0, "review_text": "Full of typos and missing chunks of text...unable to endure! Do not buy this version as it does not due justice to the original work."}, {"review_sentiment": 3.0, "review_text": "Surprised it appears on so many top novel lists.  First half was decent enough but second half really didn't hold my interest at all. I like some other works by Forster but this was just ok for me."}, {"review_sentiment": 5.0, "review_text": "Classic. Brilliant portrait of British Raj India and the ethnic conflicts between the different political and religious groups and genders. Forster captures the essence of India in his beautiful descriptive passages and the rhythm of the English spoken by Indians, Hindu and Muslim, alike. If you've seen 'Indian Summer' on PBS, you will feel it in the pages. It's topicality also brought to mind 'To Kill a Mockingbird', demonstrating a universal prejudice against men of colour by their Anglo-European invaders and oppressors."}, {"review_sentiment": 1.0, "review_text": "I'm sure this book is great but try as I might I couldn't get the first chapter on my kindle. Kinda put a link in my enjoyment of the book."}, {"review_sentiment": 1.0, "review_text": "I should have read the reviews before I bought this edition:  It's missing Chapter 1, the formatting is terrible, and there are typos everywhere.  Not worth 99 cents, and Amazon should be ashamed to sell such a piece of junk."}, {"review_sentiment": 1.0, "review_text": "This Kindle version is missing chapter 1."}]}, "authors": ["E.M. Forster"], "isbn": "0156711427", "longitude": 0.0, "periods": ["1900s"], "title": "A Passage to India", "word_cloud": "best ever conversion text full error make version difficult really quite good interesting era see first hand relationship occupy purchase edition text broken chunk reference original paragraph structure waste money typo miss chunk text unable endure version due justice original work surprised appear many top list half decent enough second half really hold interest like work ok classic portrait ethnic conflict different political religious group gender capture essence beautiful descriptive passage rhythm spoken alike see feel page topicality also bring mind demonstrate universal prejudice men color invader oppressor sure great try first chapter enjoyment review buy edition miss format terrible typo everywhere not worth cent ashamed piece junk version miss chapter", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A Passage to India (1924) is a novel by English author E. M. Forster set against the backdrop of the British Raj and the Indian independence movement in the 1920s. It was selected as one of the 100 great works of 20th century English literature by the Modern Library. The novel is based on Forster's experiences in India, borrowing the title from Walt Whitman's 1870 poem in Leaves of Grass.\r\n\r\nThe novel is set in the fictional city of Chandrapore, which is said to have been based on the city of Bankipur, a suburb of Patna in the state of Bihar in India.\r\n\r\nThe story revolves around four characters: Dr. Aziz, his British friend Mr. Cyril Fielding, Mrs. Moore, and Miss Adela Quested. During a trip to the Marabar Caves (modelled on the Barabar Caves of Bihar), Adela thinks she finds herself alone with Dr. Aziz in one of the caves (when in fact he is in an entirely different cave), and subsequently panics and flees; it is assumed that Dr. Aziz has attempted to assault her.\r\n\r\nAziz's trial, and its run-up and aftermath, bring to a boil the common racial tensions and prejudices between Indians and the British who rule India.\r\n\r\nWikipedia", "asin": "0156711427", "rank": "31713", "city": "Bankipur", "image": "https://images-na.ssl-images-amazon.com/images/I/51IaTtJ2bfL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}