{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 455, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "I am not a fan of this one."}, {"review_sentiment": 5.0, "review_text": "Everything great."}, {"review_sentiment": 5.0, "review_text": "For all you 1 star critics: 40 years ago (I'm 73) when I first encountered \"Mrs. Dalloway,\" what I remember is not reading it but experiencing it. I recall it as vividly now as when I first encountered it and getting involved in the story's stream of consciousness. I still remember the characters and the situation, including the conversations and as I write this, the feeling of the crisp weather as Clarissa goes about her day.There are some books that will always stay with me, including \"David Copperfield,\" \"War And Peace,\" the many short stories of Anton Chekhov, James Joyce's \"Ulysses\" and some of the plays of William Shakespeare.They're not for everyone, but If I can interest one person into giving themselves permission to enter these incredible worlds and experience the magic spells they cast, I will be happy. They are \"classics\" for a reason. \"Mrs. Dalloway\" is one.Mrs. Woolf's writing, though challenging, can be devastating. \"Jacob's Room,\" \"The Waves\" and \"To The Lighthouse\" are, with \"Mrs. Dalloway,\" mind-altering experiences, truly some of the greatest examples of modernism in literature. I will now order it on my Kindle to see if I can recapture Mrs. Woolf's magic again."}, {"review_sentiment": 5.0, "review_text": "Love this book"}, {"review_sentiment": 1.0, "review_text": "I can’t understand why people like this book. I’m not finished yet but it’s excruciating to read! It’s damndably boring! I suppose one is suppose to like it because it’s a “classic” but my word it drones on and isn’t really about anything. It has so many characters it switches back and forth from its difficult to follow. I’m no literary genius clearly, but if you’re like me and you like a book with an actual story that holds your attention don’t read this. It’s dull dull dull."}, {"review_sentiment": 5.0, "review_text": "I am quite pleased with the entire transaction"}, {"review_sentiment": 5.0, "review_text": "Really enjoyed reading this classic. Great discussion in my book club"}, {"review_sentiment": 5.0, "review_text": "I recommend the Oxford World's Classics edition particularly for it's Introduction by David Bradshaw. I read the Introduction after finishing the novel and it was very informative. A found that the introduction does an excellent job of clarifying the themes of the novel and does it by showing clear examples from the text of the novel. In particular the theme of the double between Clarissa and Septimus (for example they are both survivors of the deadliest events in their time, the Spanish Influenza epidemic and WWI)."}, {"review_sentiment": 5.0, "review_text": "excellent story"}, {"review_sentiment": 5.0, "review_text": "Book arrived in great condition."}]}, "authors": ["Virginia Woolf"], "isbn": "0156628708", "longitude": -0.12574, "periods": ["1900s"], "title": "Mrs. Dalloway", "word_cloud": "fan everything great star critic year first encounter remember read experience recall vividly first encounter get involved story stream consciousness still character situation include conversation write feel crisp weather go always include many short story play everyone interest person give permission enter incredible world experience magic spell cast happy classics reason write challenge devastate experience truly greatest example modernism literature order see recapture magic understand people finish yet excruciate damnably bore suppose suppose classic word drone really anything many character switch back forth difficult follow literary genius clearly actual story hold attention dull dull dull quite please entire transaction really enjoyed reading classic discussion club recommend edition particularly finish informative found introduction excellent job clarify theme show clear example text particular theme double example survivor deadliest event time spanish epidemic excellent story arrive great condition", "genres": ["Fiction & Literature", "WWI"], "summary": "Clarissa Dalloway goes around London in the morning, getting ready to host a party that evening. The nice day reminds her of her youth spent in the countryside in Bourton and makes her wonder about her choice of husband; she married the reliable Richard Dalloway instead of the enigmatic and demanding Peter Walsh, and she \"had not the option\" to be with Sally Seton. Peter reintroduces these conflicts by paying a visit that morning.\r\n\r\nSeptimus Warren Smith, a First World War veteran suffering from deferred traumatic stress, spends his day in the park with his Italian-born wife Lucrezia, where Peter Walsh observes them. Septimus is visited by frequent and indecipherable hallucinations, mostly concerning his dear friend Evans who died in the war. Later that day, after he is prescribed involuntary commitment to a psychiatric hospital, he commits suicide by jumping out of a window.\r\n\r\nClarissa's party in the evening is a slow success. It is attended by most of the characters she has met in the book, including people from her past. She hears about Septimus' suicide at the party and gradually comes to admire this stranger's act, which she considers an effort to preserve the purity of his happiness.", "asin": "0156628708", "rank": "11602", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51NpuQ0xPAL.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}