{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": -12.0621065, "ratings": {"num_ratings": 65, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Well written, even handed and informativs."}, {"review_sentiment": 5.0, "review_text": "If you really want to know about the conquests of Peru, read this book.  It undoubtedly will contain much more than any one person can absorb. However, the manner in which the history us told is fascinating."}, {"review_sentiment": 5.0, "review_text": "This was an exceptionally well-written and thorough treatment of the Spanish Conquest.  I read it BEFORE and then again AFTER a trip to Peru.  If you are considering a trip like ours to Lima, Machu Picchu, Cuzco, and Lake Titicaca I strongly urge you to read this book.  The background it provided was essential to understanding a lot of what we did and saw and enhanced the trip after our return by rereading it.  In combination with \"1491\" and \"1493\" it provides a solid foundation for understanding the effect of European empire-building on the west."}, {"review_sentiment": 4.0, "review_text": "classic"}, {"review_sentiment": 2.0, "review_text": "Generally well written but repetitive - some non-sequiturs.  What about the mysterious (to me anyway) Nicaraguan Indian.Where are the illustrations?  Table of Contents - List of Illustrations  Page 9.On page 452 \"The painting hangs, dusty and badly-lit, in a chapel of the pink baroque church  of the Compania on the main square of Cuzco(plate 4, lower picture).\"  My copy contains none of the illustrations in the List nor does it contain plate 4 or any other plates."}, {"review_sentiment": 4.0, "review_text": "The book has dated a bit but still worth s read, especially if you have been or are intending to travel to this region."}, {"review_sentiment": 4.0, "review_text": "Excellent book to read before visiting the sacred valley. Makes the places you visit vibrate with significance."}, {"review_sentiment": 4.0, "review_text": "After traveling to Peru and Machu Picchu as well as Cuzco I just couldn't get my head around how so few Spaniards were able to conquer an entire nation. This book really helped me understand the historical process of events the differences in Warfare and technology and was very interesting"}, {"review_sentiment": 4.0, "review_text": "Good book about the Spanish conquest of the Incas."}, {"review_sentiment": 5.0, "review_text": "This very readable book told the incredible story of the Spanish conquest of the Incas, 168 Spaniards with horses who defeated several Inca armies of 40,000 soldiers each.  The book never explicitly acknowledges the sad ending, but doesn't shy away from describing Spanish brutality toward the Indians and the Inca, and implicitly admits the hypocrisy of the Spanish/European theory that they were bringing Christianity to the Indians for their salvation.  Only the most naive of 21st century people could believe that the Spanish were really concerned about the souls of the Indians, when all they seemed to do was loot Inca treasure and melt it down for their own gain.  The only defense which seems at all plausible is the notion that the superior technology of the Spanish (horses, stirrups, steel weaponry and some arquebuses and cannons) simply overwhlemed the Inca armies and leaders, along with their lack of knowledge that Pizarro's little band was just the vanguard for an enormous number of rapacious invaders.  The long history of inhumanity exemplified by the Spanish to the Incas didn't start or end with them.  The Incas themselves were conquerors, and none too kind to the conquered either, although not on the scale of the Europeans.  Is it worth imagining what the Incas could have done had they had more than 100 years to expand and \"civilize\" the Americas?  Probably not, but their culture seemed poised to bring stability to a large region of South America.  Perhaps if they had reached Central America earlier, they could have protected their society.  It has only been in the last 100 years or so that the Peruvian people have been able to realize what they lost and what the Spanish invasion cost them.  1821 was an opportunity for the native people to overcome their years of enslavement, and they are making the most of it now.  Congratulations to them on their efforts to document the Quecha society at the heart of their culture."}]}, "authors": ["John Hemming"], "isbn": "0156028263", "longitude": -77.0365256, "periods": ["1500s"], "title": "The Conquest of the Incas", "word_cloud": "well write even hand informative really want know conquest peru undoubtedly contain much person absorb however manner history tell fascinate exceptionally thorough treatment spanish before after trip consider trip strongly urge background provide essential understanding lot saw enhanced trip return reread combination provide solid foundation understand effect european west classic generally well write repetitive mysterious anyway nicaraguan illustration table content list painting hang dusty chapel pink church main square plate lower picture copy contain none illustration contain plate plate dated bit still worth especially intend travel region excellent visiting sacred valley place visit vibrate significance travel well head able conquer entire nation really help historical process event difference technology interest good spanish readable tell incredible story spanish horse defeat several army soldier never explicitly acknowledge sad end shy away describe spanish brutality implicitly admit hypocrisy theory bring salvation only naive century people really concern soul seem loot treasure melt defense seem plausible notion superior technology spanish horse stirrups steel weaponry arquebuses cannon simply overwhelm army leader lack knowledge little band vanguard enormous number rapacious invader long history inhumanity exemplify spanish start conqueror none kind conquer scale be worth imagine do year expand culture seem poised bring stability large region perhaps reach earlier society last year peruvian people able realize lose spanish invasion cost opportunity native people overcome year enslavement make congratulation effort document society heart culture", "genres": ["History", "Ancient Civilizations"], "summary": "In 1532, the magnificent Inca empire was the last great civilization still isolated from the rest of humankind. The Conquest of the Incas is the definitive history of this civilization's overthrow, from the invasion by Pizarro's small gang of conquistadors and the Incas; valiant attempts to expel the invaders to the destruction of the Inca realm, the oppression of its people, and the modern discoveries of Machu Picchu and the lost city of Vilcabamba. \r\n\r\n\"Distinguished by an extraordinary empathy, a feeling of one's way into the minds of the sixteenth-century Spaniards and Indians . . . Provocative.\" New York Times\r\n\r\n\"An extraordinary book. Combining rigorous historical research and profound analysis with stylistic elegance, this work allows the reader to appreciate the tragic and fabulous history of the Incan empire in all its richness and diversity. It reads like the most skillful novel.\" Mario Vargas Llosa\r\n\r\n\"This authoritative, wide-ranging account, grounded in meticulous research and firsthand knowledge and told from the viewpoints of both protagonists, \"keeps all the complex issues to the fore . . . the deeper wonder of the conquest and the deeper horror of its results.\" Washington Post\r\n", "asin": "0156028263", "rank": "151303", "city": "Lima", "image": "https://images-na.ssl-images-amazon.com/images/I/51Bv8PXNTTL.jpg", "country": "Peru", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}