{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 17, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "a biography I have long wanted to read"}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "maravilloso"}, {"review_sentiment": 4.0, "review_text": "a Mexican icon...along with Gabriel Garcia Marquez and the Boom....loved the history as well in relationship to his story.  i did have a bit of trouble truly identifying, or caring that much about Laura Diaz tho."}, {"review_sentiment": 2.0, "review_text": "Does every book about this period in Mexican history HAVE to include the protagonist meeting and being part of the life ofFreida and Diego????  Laura just rambles around from person to person, place to place. I couldn't find the depth of the book. Why did Carlos Fuentes take the time?  More over, why was it published?"}, {"review_sentiment": 3.0, "review_text": "Fuentes aspires to cover over a hundred years of Mexican history in this family novel. Since I go to Mexico often, I was drawn in by the social, cultural, and political material -- which sometimes makes the novel read like a patriotic essay, relieved by plentiful critical comments on the government. And wouldn't you know it? Frida Kahlo and Diego Rivera make an appearance. The main character is drawn with partial success. To me she gets most interesting when she discovers a new vocation late in life. Some of the others, like her husband  and her lovers, are more interesting, perhaps only because they remain partly enigmatic. I'm 97% done reading this novel and I fully expect to finish it -- and that's a positive comment because I do not hesitate to abandon a novel that doesn't engage me. The book is passable as fiction. If you like to learn history by reading historical novels, it's worth a look."}, {"review_sentiment": 2.0, "review_text": "I love reading magical realism tales from Latin America.  And this novel had lots of promise, at its inception.  However, somewhere in the storyline, the author began to debate and relate the series of political events that led up to the modern processes of Mexican government.Just when I was reveling in the waves of emotion and description that magical realism offers, Senor Fuentes inserted lots and lots of political facts, in a rather non-fictional manner.  This constant change of tone and literary intent threw me off and eventually I gave up reading the book, which I rarely do.  Maybe I was expecting one kind of read but got another.  Maybe I'm less interested in Mexican political history than in the processes of Mexican culture mores.Maybe I will finish this novel but I will have to skim over the too dense and dry descriptions of the setting's historical facts, even though I know the author means to give more credence to his main characters' actions and thoughts.  If you like Latin American history and literature, this book is for you.If you're a magical realism fan, or wonder what this genre relates, do try reading Gabriela Garcia Marquez, Jorge Amado and Isabel Allende."}, {"review_sentiment": 5.0, "review_text": "I read the kindle version and though the formatting could use some work, particularly the lack of adequate space breaks between major shifts of scene or time.But upon finishing it my first reaction was \"this was magnificent.\"  I can not understand reviews  like some here, for instance the \"...bla, bla, bla...\" comment.  My only conclusion is perhaps some readers are not willing to invest time and patience to uncover the grandeur of a great piece of literature.These are some of the aspects of the work I think make it magnificent.1. It's scope.  The work covers a very long time period that includes; the political history of Mexicio at a key time in it's modern growth, the First World War as it relates to Spain and Fascism, love, marriage & infidelity, parenting, fascinating characters, etc, all well integrated in  a seamless  web through the ongoing development and interactions of the characters.2. The writing is so often poetic and beautiful and offers long beautiful poetic runs somewhat like a well crafted yet emotional long moving musical solo.3. The characters are well formed, real, human, complex, courageous,  flawed, soulful and moral, varied,  and interesting.  The conversations between them could almost be published as a stand alone University reader for a literature, cultural geography, or history seminar discussion course.4. The development and growing maturity of Laura Diaze, the main character, could be a novella on its own.  The evolution of her growth and emergence into a full giving maturity is worth the price of the novel.5.  The characters are well integrated with each other, the time, the historic/human context issues, and the geography of the setting.  This makes them living, believable people.  Their individual identities are given depth, vulnerability, strength, intelligence, heart, and the ability to love despite their very human limitations.I do not know how you could ask for more from a novel, or have a \"...blah, blah, blah\" reaction to such a great work.  I was sad to finish this novel, the first I have read by Fuentes.  I came out of the experience of reading The Years With Laura Diaz admiring Fuentes as a painter and poet of life through his writing.As a closing note, I really enjoyed the integration of Diego Rivera (some of whose Murals in Mexico City I have photographed) and Frida.  I also have spent time in some of the places and cities that are settings in the novel and it brought back memories of those places and the lovely Mexican people I got to know and work with  in those travels.  It made me want to go back and stay.  Still, I do not give my review based on a sentimental basis.  I love great literature and this stands up well with some of the works that have most moved me.  In that sense it was as moving as War and Peace for me.  Unforgettable."}, {"review_sentiment": 5.0, "review_text": "This is a book I wish I had written; it is of a life, I feel I have lived.  Senor Fuentes brilliantly composes a story that encompasses all that is grand and horrific about the evolution of a country, of a people, and of one life that reflected the emergence of the Mexico we know today.  If you know anything about Mexico in all its riches and contrasting hues, this book confirms why we love it so.  If you know nothing about Mexico, read it for the sheer poetry of one woman's life.  Bravo Carlos!  I can't wait to read whatever books you have written that I haven't read yet!!!"}, {"review_sentiment": 2.0, "review_text": "Carlos Fuentes is an amazing writer.  He writes in a beautiful, poetic style.  As a narrator, he notices even the minute details and brings them to life with his writing.  The problem for me is that with all this attention to detail and poetry, the story seems to get lost.  I would have liked the plot to move more quickly.  Mr. Fuentes does not seem to be in any hurry to tell the story or stay on track with the plot.  A scene my divert into a long, lovely description of nothing much, and the reader and characters are left waiting for Mr. Fuentes to return to the narration of the plot.  It is, as I stated, beautifully written, it is just not a style for which I care."}]}, "authors": ["Carlos Fuentes"], "isbn": "0156007568", "longitude": -99.1333416, "periods": ["1800s", "1900s"], "title": "The Years with Laura Diaz", "word_cloud": "biography long want excellent maravilloso mexican icon history well relationship story bit trouble truly identify care much tho period history include protagonist meeting part life of freida ramble person person place place depth take time more published fuentes aspires cover mexican history family go often draw social cultural political material sometimes make patriotic essay relieve plentiful critical comment government make appearance main character draw partial success get interest discovers new vocation late life others husband lover interesting perhaps remain partly enigmatic do reading fully expect finish positive comment hesitate abandon passable fiction learn history read historical novel worth look love read magical realism tale lot promise inception however somewhere story line author begin debate relate series political event lead modern process mexican revel wave emotion description magical realism offer insert lot lot political fact rather manner constant change tone literary intent throw eventually give read rarely maybe expect kind get maybe le interested mexican political history process mexican culture finish skim dense dry description set historical fact even know author mean give credence main character action thought latin american history literature magical realism fan wonder genre relate read kindle version formatting work particularly lack adequate space break major shift scene finish first reaction magnificent understand review instance alb alb alb comment conclusion perhaps reader willing invest time patience uncover grandeur great piece aspect work think work cover long time period include political history key time modern growth relate marriage infidelity parent fascinate character etc well integrated seamless ongoing development interaction writing often poetic beautiful offer long beautiful poetic run somewhat like well craft yet emotional long move musical character well form real human complex courageous flaw soulful moral vary interest conversation almost publish stand alone literature cultural geography history seminar discussion development grow maturity main character evolution growth emergence full give maturity worth price character well integrated time context issue geography set make live believable people their individual identity give depth vulnerability strength intelligence heart ability love human know blah blah blah reaction great work sad finish first fuentes come experience read admire fuentes painter poet life close note really enjoy integration mural photograph also spend time place city setting bring memory place lovely mexican people get know work travel make want back stay still give review base sentimental basis love great literature stand well work move sense move wish write life feel live brilliantly compose story encompasses grand horrific evolution country people life reflect emergence know today know anything riches contrast hue confirms love know nothing sheer poetry woman life write yet amazing writer write beautiful poetic style narrator notice even minute detail bring life write problem attention detail poetry story seem get lose plot move quickly seem hurry tell story stay track plot scene divert long lovely description nothing much character leave wait return narration state beautifully write style care", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A radiant family saga set in a century of Mexican history, by one of the world's greatest writers.\r\n\r\nCarlos Fuentes's hope-filled new novel sees the twentieth century through the eyes of Laura D'az, a woman who becomes as much a part of our history as of the Mexican history she observes and helps to create. Born in 1898, this extraordinary woman grows into a wife and mother, becomes the lover of great men, and, before her death in 1972, is celebrated as a politically committed artist. A complicated and alluring heroine, she lives a happy life despite the tragedies and losses she experiences, for she has borne witness to great changes in her country's life, and she has loved and understood with unflinching honesty.\r\n\r\nIn his most important novel in decades, Carlos Fuentes has created a world filled with brilliantly colored scenes and heartbreaking dramas. The result is a novel of subtle, penetrating insight and immense power.", "asin": "0156007568", "rank": "400289", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51eTcPC%2BDdL.jpg", "country": "Mexico", "story_arc": ["Tragedy", "Things only get worse"]}