{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 31.75, "ratings": {"num_ratings": 36, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I love it."}, {"review_sentiment": 2.0, "review_text": "Tedious to read.  Lack of names, although obviously purposeful in light of the theme, made reading difficult.  I kept having to refer back to remind myself which character we were talking about."}, {"review_sentiment": 5.0, "review_text": "great story,sad ,funny,  critical of society."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "I am really enjoying reading this book."}, {"review_sentiment": 2.0, "review_text": "There might be an interesting story in here, but the writing and translating are so bad I could not get through it. Seldom have I ordered a book that turned out to be so badly written--Sarah's Key comes to mind--that I could not finish the book.  Don't know if the translator here is inept in the English language, or if it was poorly written to begin with. Either way, don't waste your time."}, {"review_sentiment": 3.0, "review_text": "First part was the best."}, {"review_sentiment": 2.0, "review_text": "Well written but lost me as the story unfolded."}, {"review_sentiment": 4.0, "review_text": "Brilliantly written!"}, {"review_sentiment": 5.0, "review_text": "I just love Yehoshua. This story is less about Israel and more about how the press can create a story with incomplete information and by jumping to conclusions."}]}, "authors": ["A. B. Yehoshua"], "isbn": "0156031949", "longitude": 35.0, "periods": ["2000s", "Recent Releases"], "title": "A Woman in Jerusalem", "word_cloud": "love tedious name obviously purposeful light theme make read difficult keep back remind character talk great story sad funny critical society excellent really enjoy reading interest story write translate bad order turn badly write come mind translator language poorly write begin way waste time part best well write lose story unfolded brilliantly write love story le press create story incomplete information jumping conclusion", "genres": ["Fiction & Literature"], "summary": "A woman in her forties is a victim of a suicide bombing at a Jerusalem market. Her body lies nameless in a hospital morgue. She had apparently worked as a cleaning woman at a bakery, but there is no record of her employment. When a Jerusalem daily accuses the bakery of \"gross negligence and inhumanity toward an employee,\" the bakery’s owner, overwhelmed by guilt, entrusts the task of identifying and burying the victim to a human resources man. \r\n\r\nThis man is at first reluctant to take on the job, but as the facts of the woman’s life take shape—she was an engineer from the former Soviet Union, a non-Jew on a religious pilgrimage to Jerusalem, and, judging by an early photograph, beautiful—he yields to feelings of regret, atonement, and even love.\r\n\r\nAt once profoundly serious and highly entertaining, A. B. Yehoshua astonishes us with his masterly, often unexpected turns in the story and with his ability to get under the skin and into the soul of Israel today.", "asin": "0156031949", "rank": "1195020", "city": "Jerusalem", "image": "https://images-na.ssl-images-amazon.com/images/I/512k5z8yilL.jpg", "country": "Israel", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}