{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 54, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Very engaging.  The author is a very good writer.  Enjoyed it."}, {"review_sentiment": 5.0, "review_text": "Fantastic book. Became one of my top 5 favorites. I recommend it to everyone I know who likes to read."}, {"review_sentiment": 5.0, "review_text": "Thanks."}, {"review_sentiment": 5.0, "review_text": "Just read the damn book. Its really good."}, {"review_sentiment": 5.0, "review_text": "Good read and arrived on time."}, {"review_sentiment": 5.0, "review_text": "What an amazing book, but what sadness I feel knowing that a lot of people (not of paper but of meat) will never be exposed to it. It is this feeling what often takes me from thinking 'this is a good book' all the way to 'this is excellent.' The genres it is usually catalogued under run from Latin to Experimental, but I'm here to say that it should just be under Excellent Fiction. The author has a creative genius that transcends geography and time and returns the novel to what it should be, something new and fresh - the word novel should, after all, stand for something. All the praises to this book, one that I'll be happy to recommend to anyone looking for original literary and emotional research."}, {"review_sentiment": 4.0, "review_text": "This has got to be the most bizarre novel I have ever read. And yet, it's intriguing, beautiful and extremely well crafted. It is a work of art; a Paper-maché masterpiece formed of soul, soil and sweat to baptise the imagination.--Tristan Sherwin, author of *Love: Expressed*"}, {"review_sentiment": 5.0, "review_text": "A book about love in a strange kind of way."}, {"review_sentiment": 5.0, "review_text": "First class ticket for a train ride on the Feelings Express."}, {"review_sentiment": 5.0, "review_text": "he People of Paper by Salvador Plascencia is a novel that is in no way easy to categorize. According to Plascencia, the novel is “a war-novel, a memoir, it’s about immigration, it’s a meta-fiction, and it’s a love-story.” The heart of the novel is built around Federico de la Fe and his daughter, Little Merced, who leave Mexico for the United States after Federico’s wife, Merced, leaves him. Once in the U.S., Federico bands together with the locals, forming a group called the EMF who wage a war “against Saturn, against sadness, and against omniscient narration.” The novel is written in three sections, each including several chapters. Each chapter enlists the perspectives of a variety of characters, including Saturn, the omniscient narrator. The pages are laid out in columns, and, at one point, words are blacked out or, in certain editions, are cut from the page. The narrator himself makes an appearance as well. Weird in plot, characterization, genre, organization, and style, I cannot think of a book stranger and more exciting than The People of Paper."}]}, "authors": ["Salvador Plascencia"], "isbn": "0156032112", "longitude": -118.244476, "periods": ["2000s", "Recent Releases"], "title": "The People of Paper", "word_cloud": "very engage author good writer fantastic top favorites recommend everyone know like thanks just really good good arrive time amaze sadness feel know lot meat never expose feel often take think good way excellent genre usually catalog experimental say excellent author creative genius transcends geography time return something new fresh word stand something praise happy recommend anyone look original literary emotional research get bizarre ever yet intriguing beautiful extremely well craft art masterpiece form soul soil sweat baptist author love strange kind way first class ticket train ride way easy categorize accord memoir immigration heart build daughter leave wife leave once band together local form group call wage war sadness omniscient write section include several chapter chapter enlist perspective variety character include omniscient narrator page lay column point word black certain edition cut page narrator make appearance well plot characterization genre organization style think stranger excite", "genres": ["Fiction & Literature"], "summary": "THE PEOPLE OF PAPER is an astonishing debut novel about the anguish of lost love. Author Salvador Plascencia, a \"once-in-a-generation talent\" (George Saunders), weaves together the stories of a large cast of colorful characters, including: a disgruntled monk, a father and daughter, a gang of carnation pickers, and a woman made of paper.\r\n\r\n\"A nervy new voice . . . Finally, beyond all the experimental devices, fairy-tale antics and fabulist inclination, Plascencia's novel is a story of lost love.\" San Francisco Chronicle\r\n", "asin": "0156032112", "rank": "73862", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/41NkdZjJpYL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}