{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 351, "rating": 3.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Oldie but goody"}, {"review_sentiment": 3.0, "review_text": "I reread this book and found it beautifully written but could not help but dislike thegossipy relationship these women had with each other. \" The Group\" does give accurateinsights into many attitudes prevalent about female sexuality and mores in the mid-1930s.  Read the book with this historical perspective."}, {"review_sentiment": 3.0, "review_text": "I first read The Group in college & remembered loving it. Maybe it was reading it solo without the benefit of discussion with others, I wasn’t as enamored with it this go round. Regardless, I can appreciate its place in feminist literature."}, {"review_sentiment": 1.0, "review_text": "This book was just awful.  The author tries to insert $2.00 words into every other sentence.  The story line was watered down at best. No one in our book club enjoyed it.  Not sure how it sold for $10.00, but I'd sure like to get my money back."}, {"review_sentiment": 4.0, "review_text": "Well written.  It was based on a group of women who graduated Vassar '33.  I think it would have been better read in the 60's when it was written.  Definitely worth the read."}, {"review_sentiment": 5.0, "review_text": "About women from the class of '33 but fresh and current look at lives, our varied paths, intersections, separations.  Beautiful narrative."}, {"review_sentiment": 2.0, "review_text": "A bit too out of date for me. I thought it would be interesting., but I was wrong."}, {"review_sentiment": 1.0, "review_text": "This is the worst book I have read in a long while, couldn't wait to finish it"}, {"review_sentiment": 4.0, "review_text": "X this book set the stage for the women's movement.  McCarthy had excellent insights into American culture and knew how to make a story good."}, {"review_sentiment": 4.0, "review_text": "McCarthy knows how to put together interesting characters, learning about life,  love and the questions of those times.  I always wondered where my mother-in-law got her  strict  and Draconian parenting Style."}]}, "authors": ["Mary McCarthy"], "isbn": "0156372088", "longitude": 0.0, "periods": ["1900s"], "title": "The Group", "word_cloud": "goody reread find beautifully write the gossipy relationship woman accurate insights many attitude prevalent female sexuality more historical perspective first college remember loving maybe read solo benefit discussion others enamor round appreciate place feminist literature awful author try insert word sentence story line water best one club enjoy not sure sell sure get money back well write base woman graduate think better write woman class fresh current look life vary path intersection separation narrative bit date think worst long x set stage woman movement excellent insight american culture know make story good mccarthy know put together interest character learn life love question time always wonder get strict draconian parenting style", "genres": ["Fiction & Literature"], "summary": "Mary McCarthy’s most celebrated novel follows the lives of eight Vassar graduates, known simply to their classmates as “the group.” An eclectic mix of personalities and upbringings, they meet a week after graduation to watch Kay Strong get married. After the ceremony, the women begin their adult lives—traveling to Europe, tackling the worlds of nursing and publishing, and finding love and heartbreak in the streets of New York City. \r\n\r\nThrough the years, some of the friends grow apart and some become entangled in each other's affairs, but all vow not to become like their mothers and fathers. It is only when one of them passes away that they all come back together again to mourn the loss of a friend, a confidante, and most importantly, a member of the group.", "asin": "0156372088", "rank": "104076", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41mn9IRA7wL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}