{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 262, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "What, in all this great world can we possess or control? What do we understand and what, in any case, does it mean to understand? When we say, “I live here,” what can we possibly be talking about? “Invisible Cities” poses these questions and many others suggesting, without coming right out and saying it, that the key is to keep asking and that, when we live this way, question and answer arise together in the same breath."}, {"review_sentiment": 5.0, "review_text": "Lyrical and enigmatic. Calvino has given us a labyrinthine pearl whose passages we can ruminate over and over again."}, {"review_sentiment": 3.0, "review_text": "It worked for the assignment but the book was not as interesting as I hoped."}, {"review_sentiment": 1.0, "review_text": "Hard to undertand how this book had 4 stars!"}, {"review_sentiment": 5.0, "review_text": "I dearly love these tiny one page stories . these incredibly imaginative images of impossible cities. the city completely underground. the city so high in the sky the only  thing one could see was the poles that held it up. etc etc I read them over and over. before I go to bedIs there anywhere more Calvino stories like this, I have bought two other books and found them self indulgent, verbose  and much less interesting.anything remotely like this?anyone?"}, {"review_sentiment": 4.0, "review_text": "Confusing in some spots, but it helps if you think of it more as poetry than prose. Pithy statements on nearly every page."}, {"review_sentiment": 1.0, "review_text": "Posed as a dialog between Marco Polo and Genghis Khan, it abandons that era to speak of later inventions in a rambling daydream of imagined cityscapes. Don't bother with this. It gives no insights, just an annoying tangle of words."}, {"review_sentiment": 5.0, "review_text": "One of my favorite book"}, {"review_sentiment": 5.0, "review_text": "This is a series of brief vignettes about fantastical cities, as told by the explorer of an ancient empire. It's incredibly imaginative; fluidly written, almost poetic; and offers keen insights into human nature. The story of the explorer and the emperor is equally intriguing."}, {"review_sentiment": 4.0, "review_text": "interesting,but not totally understood"}]}, "authors": ["Italo Calvino"], "isbn": "0156453800", "longitude": 12.3345898, "periods": ["500-1400s"], "title": "Invisible Cities", "word_cloud": "great world posse control understand case mean understand say live possibly talk pose question many others suggest come right say key ask live way question answer arise together breath lyrical enigmatic give labyrinthine pearl passage ruminate work assignment interesting hop understand star dearly love tiny page stories incredibly imaginative image impossible city completely underground city high sky thing pole hold etc etc go bed is anywhere story buy find indulgent verbose much le remotely anyone confuse spot help think poetry prose statement nearly page pose dialog abandon era speak later invention ramble daydream imagine cityscape do give insight annoy tangle word favorite series brief vignettes fantastical tell explorer ancient empire incredibly imaginative fluidly write almost poetic offer keen insight human nature story explorer emperor equally intrigue interest totally understood", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "“Cities, like dreams, are made of desires and fears, even if the thread of their discourse is secret, their rules are absurd, their perspectives deceitful, and everything conceals something else.” From Invisible Cities\r\n\r\nIn a garden sit the aged Kublai Khan and the young Marco Polo — Mongol emperor and Venetian traveler. Kublai Khan has sensed the end of his empire coming soon. Marco Polo diverts his host with stories of the cities he has seen in his travels around the empire: cities and memory, cities and desire, cities and designs, cities and the dead, cities and the sky, trading cities, hidden cities. As Marco Polo unspools his tales, the emperor detects these fantastic places are more than they appear.\r\n\r\n“Invisible Cities changed the way we read and what is possible in the balance between poetry and prose . . . The book I would choose as pillow and plate, alone on a desert island.” Jeanette Winterson", "asin": "0156453800", "rank": "15759", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/31WiGsdx4%2BL.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}