{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 34, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Well written, almost mesmerizing."}, {"review_sentiment": 5.0, "review_text": "A powerful evocative description of Brownsville in the 1930s.  The sounds, the scents, and the smells of the city transport us back in time. Kazin is one of the greats."}, {"review_sentiment": 3.0, "review_text": "Well written. Good description of the Brownsville neighborhood of Brooklyn in the 1930's"}, {"review_sentiment": 3.0, "review_text": "He doesn't walk through the city... he plods. A good read for New Yorkers, I suppose."}, {"review_sentiment": 5.0, "review_text": "Mostly I read books as a means to an end and in that spirit I began \"Walker\".  It had received high marks as a model memoir and hoping to improve my memoir writing I began to read it.  Only time will tell whether that part of the project succeeded.  Meanwhile I thoroughly enjoyed the book as an interesting end in itself.  Even with an e-book you can almost hear and smell Brownsville."}, {"review_sentiment": 5.0, "review_text": "I read this for a book group. The author tells the story of growing up in Brooklyn. His descriptions are beautiful and moving. I could see what he saw, feel what he felt, even smell what he smelled. Very moving book."}, {"review_sentiment": 2.0, "review_text": "I found it very boring and I didn't really see what the plot was. it definitely sheds light on early American immigrants. If you are looking for that perspective, I think you will really like this book."}, {"review_sentiment": 5.0, "review_text": "What we have lost and what we have gained?"}, {"review_sentiment": 5.0, "review_text": "Wonderful. Dreamlike. Somehow it felt like my life he was remembering when my actual childhood couldn't have been more different. He's some kind of magician or hypnotist pulling you in with words. After reading this, I bought several other of his titles. A Walker in the City remains my favorite."}, {"review_sentiment": 4.0, "review_text": "This is a coming-of-age told as a Kazin reflects on his New York neighborhood of youth and the experience of one's inner world opening that it inspired. We walk with Kazin from his stuttering youth, to his teen self with a stirring eagerness to plunge into the depths of each moment.This memoir harkens back to Joyce's -Portrait of an Artist-, which Kazin sites as a book of his youth. The narrative is not plot driven, but driven by the interaction between the Kazin's inner world and his neighborhood. The intrigue is in the rich and often conflicting descriptions. The experience of reading is less like a watching a movie-like plot unfold, and more like walking through a collection of art depicting the Jewish New York neighborhood of Kazin's boyhood--Brownsville and surrounds. While some images may have a foreign feel to a non-New Yorker, the internal workings of young Kazin call out our common humanness and create common ground for reflection. With descriptions of summer nights \"with an easy unstitched look\" where \"people sat on the corner watching the flies buzz around the street lamps, or at bedroom windows openly yawning as they stared past us.\" And word paintings of women who \"occupy the tenement stoops, their hands blankly foulded in each other as if they had been sitting on these stoops from the beginning of time.\"This book invites us behind the veil of community life and trains us in the meditation of slowing down to listen to what the moment calls to in our own souls."}]}, "authors": ["Alfred Kazin"], "isbn": "0156941767", "longitude": 0.0, "periods": ["1900s"], "title": "A Walker in the City", "word_cloud": "well write almost mesmerize powerful evocative description sound scent smell transport back time great well write description neighborhood walk plod good suppose mostly mean end spirit begin receive high mark model memoir hop memoir write begin only time part project succeed meanwhile thoroughly enjoy interesting end even almost hear smell group author tell story grow description move saw felt even smell smell very move find bore really plot definitely shed light early american immigrant look perspective think really lose gain wonderful felt life remember actual childhood different kind magician hypnotist pulling word read buy several title remain favorite tell reflect neighborhood youth experience inner world open inspire walk stutter youth teen self stir eagerness plunge depth memoir hanker back sit youth narrative plot drive driven interaction inner world neighborhood intrigue rich often conflict description experience read le watch plot unfold walk collection art depict jewish neighborhood boyhood surround image foreign internal working young call common humanness create common ground reflection description summer night easy stitched look people sit corner watch fly buzz street lamp bedroom windows openly yawn star word painting woman occupy tenement stoop hand blankly foul sit stoop begin time invite veil community life train meditation slow listen moment call soul", "genres": ["Memoir"], "summary": "Kazin’s memorable description of his life as a young man as he makes the journey from Brooklyn to “americana” - the larger world that begins at the other end of the subway in Manhattan. \r\n\r\nA classic portrayal of the Jewish immigrant culture of the 1930s. Drawings by Marvin Bileck.", "asin": "0156941767", "rank": "70887", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51ibTEUb-3L.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}