{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 8, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Danilo Kis was born in 1935.  His father was Jewish; his mother was a Montenegrin of the Eastern Orthodox faith.  His father died in Auschwitz in 1944, and World War II also brought an end to the petite bourgeoisie of Central Europe.  GARDEN, ASHES is a requiem for both Kis's father and that Central European culture that had been Kis's birthright.  At the same time, it also is a memoir of Kis's own youth.  And what a distinctive requiem/memoir it is:  rich, flamboyant, phantasmagorical, and (ultimately and paradoxically) both sad and uplifting.The metes and bounds of the printed page do not confine the novel, which spills and sprawls everywhere.  It is wonderfully Promethean.  As told by Kis, everyday events from the life of his family (surnamed Scham, in the novel) become the stuff of myth, or, at the very least, fairy tale.  Prosaic details are keenly observed and creatively woven into an often dream-like narrative.  (A recurring theme is the confounding of dreaming and sleep, life and death.)  There are many crafty metaphors.  There is a brilliant ten-page retelling of the Old Testament story through the ten plagues of Egypt.  And there are encyclopedic lists, one of \"ologies\" of pre-War Mitteleuropa (an excerpt:  \"irrationalistic studies, studies in Judeophobia, juridical studies, Lamarckian, lexicographical, lexicological, literary, Machist, magical, magnetic, martyrological, Marxist, Masonic\") and another of the goods being piled on a cart of a Jewish family being relocated to the ghetto (an excerpt:  \"silverware chests lined with red cloth, like those cases designed to hold dueling pistols; an upright piano, a violin case like a small child's sarcophagus, bundles of documents, family portraits in baroque frames lifted out of their dusty repose and deprived of their eternal verticality\").Still, amidst the swirling visions, dreams, and fantasies of GARDEN, ASHES, what stands out most for me are the realistic snapshots of Central European life just before the events of World War II swept it all away, such as this description of a provincial railway station café, where the Scham family awaits a train:  \"It was a late summer afternoon, and flies swooped back and forth, intoxicated by their own flight and the heat.  The room smelled of goulash and floor wax.  A celesta stood in the corner, covered with cloth like a casket.  Flypaper swayed back and forth, gently and lazily, measuring out the minutes.  The bottles on the shelves were taking their siesta, crammed with the sun's rays and their own weight, like flower buds or artillery shells.\"Kis wrote the novel in Serbo-Croatian.  Translation into English must have been especially daunting, but William J. Hannaher pulled it off brilliantly.  I have added GARDEN, ASHES to my list of books I hope to re-read some day, which is my highest accolade for a book."}, {"review_sentiment": 5.0, "review_text": "I'd read two of Danilo Kis's short story collections (available on Amazon, too) and loved them.  He's a masterful (sometimes experimental) writer, and this is an amazing Holocaust-inspired fiction."}, {"review_sentiment": 5.0, "review_text": "The Holocaust, in the form of quick references to ghettos, cattle cars, and death camps, is in the background of GARDEN, ASHES. But the content of this book is dominated by the perceptions and sensibilities of Andreas, a young boy whose family life is abnormal because his brilliant father slips into a pathetic madness.In writing this story, Kis endows Andreas with \"...a sick hypersensitivity\" that \"turned everything into a memory, too quickly: sometimes one day was enough, or an interval of a few hours, or a routine change of place, for an everyday event with a lyrical value that I did not sense at the time, to become suddenly adorned with a radiant echo...\"Meanwhile, Edward, Andreas's father, has this to say about himself. \"There are people... who are born unhappy and to make other unhappy...They are titans without the power of titans, dwarf-titans whose only greatness was given them in the form of a rigid dose of sensitivity that dissolves their trifling strength...They follow their star, their sick sensibility, borne along by titanic plans and intentions, but then break like waves against the rocky banks of triviality. The height of cruelty allotted them in lucidity...\"To explore the interaction between this hypersensitive and impressionable boy and this amazing yet doomed father, Kis basically follows an ordinary developmental timeline. Here, Andreas discusses with his amazing lyricism such ordinary boyhood issues as his mother, childish sexuality, biblical stories, and the interaction of his extended family. At the same time, Andreas begins and ends his narration with his fear of death. Death, he initially hopes to outwit or outrun. But he is eventually able to manage his fear through narrative and literature and seems to breakout when he is able to tell his mother, \"I have written a poem.\"Andreas and his father are vivid and memorable characters. Even so, this fascinating novel, which presents the perceptions of an intense and brilliant child, is almost allegorical in style. GARDEN, ASHES is fine work but not recommended to anyone looking for plot-driven fiction."}, {"review_sentiment": 5.0, "review_text": "To convey the magical consternation, lyrical mayhem, structural pyrotechnics, dithyrambic drunkenness of Danilo Kis` stories approaches the impossible.  Few writers manage to confuse, baffle and simultaneously illuminate and enrapture their readers as does this sadly underappreciated Serbian genius of letters. While the least problematic border crossing into Danilo-land is with his excellent collection of short fiction, `Encyclopedia of the Dead,` his novel, `garden ashes,` ultimately rewards the dogged hunter of enriching literary experiences.The story of `garden, ashes` is straightforward enough:  a young boy in 1940`s Hungary recounts the ominous days before the Second World War and more precisely, the Holocaust, arrived on his family's doorstep.  Andreas Scham, second child of a doting Montenegrin mother and eccentric Jewish father unravels his family narrative as gypsy-like, they ramble from hamlet to hamlet in the Serbian Hungarian borderlands in an attempt to keep one step ahead of the increasingly virulent anti-Semitic authorities of Admiral Horthy`s Hungary.  Like in other Kis works (notably the `Hourglass`), the specter of the Holocaust is never directly addressed but hovers over the narrative like a vulture over carrion.  Instead, `garden, ashes` is  one boy's attempt to understand and eventually come to love a father as distant and terrifying as some god and as ridiculously pitiful as some circus clown.  That we know where Andreas` journey will ultimately end makes the narrative all the more powerful.Andreas Scham approaches his father with a mixture of awe and fear for Eduard Scham is one singular character.  Half-village drunkard, half-village philosopher, Eduard Scham roams the local taverns for weeks on end frightening the denizens with his brilliant soliloquies and boisterous singing.  When not in a pub, Eduard spends his nights traversing the local forest in pantheistic commune with the trees and flowers. Eduard Scham's singular achievement outside of his progeny is his monumental tome,` Bus, Ship, Rail and Air Travel Guide,` which he has been revising in various editions over the years.  In it, Mr. Scham hopes to illuminate the world to its global interconnectedness by showing the infinitesimal connections between place and travel mode.Needless to say, Andreas` father is something of an oddball to his fellow villagers and family alike.  Despite having to retrieve his father from ditches, meadows and front yards after nights of carousing, Andreas is nonetheless captivated by his enigmatic father. Moreover, Eduard`s stature in his son`s eyes grows as a result of his `heroic` confrontations with local authorities.  One of `garden`s` most poignant and humorous scenes in when Eduard is accosted by local villagers, in particular by members of its fascist vigilante group, The Village Christian Youth.  Frightened that Mr. Scham's Pan-like romps in the local woods are a secret cover for illicit communications with Allied bombers,  the thugs plan a lynch party. In order to thwart their brutish plan, Mr. Scham launches into one of his usual soliloquies on how such mob violence would actually fulfill his deepest desires.  He would become the first and founding martyr of his new creed.  \"Gentlemen, carry out your plan as soon as possible...enthrone by your act the first saint and martyr of the Religion of the Future.\"  Not only does Eduard`s sophisticated rhetoric go right over the heads of the yokels, his oratory is tapped out with a little jig as he fights back an attack of fear-provoked incontinency.While scenes of such pathos and dark humor occur throughout `garden, ashes,` its deadly serious theme is never forgotten.  Yet, actual references to the Holocaust and all its incomprehensible and nefarious machinery are all but left out.  Auschwitz is mentioned only once by name as is an oblique word about cattle cars, but there are no gas chambers, crematoriums, selection lines, sadistic guards here.  Instead, Kis sails a subtler tack, and thereby makes the impending abomination all the more foreboding and terrifying.  It lurks above every page like some dark cloud.For example, when the local Jews are given notice to collect their belongings and head for specified staging areas, everything is treated as normal.  One of Eduard`s neighbors, the wealthy shopkeeper, Mr. Rhinewine, has carts packed with everything from a steel sink to his entire assortment of farm animals.  Kis makes a darkly irreverent comparison with Noah`s situation but for many of the Holocaust`s victims, `death camp` was beyond the pale of imagination.  Orders to gather one`s belongings and move into ghettoes and assembly areas seemed innocuous enough. Eduard, the clown philosopher, shows rare insight into the tragedy looming on the horizon.  Asked by Mr. Rhinewine where his belongings are, he responds with the prophetic,\"Omnia mea mecum porto!\"  All I have is with me.While dark humor and even darker irony make `garden, ashes` hard to put down, its real treat lies in its language.  William Hannaher`s translation is simply delightful.  It captures the constant flow and lyrical melody of Kis` miraculous prose.  In fact, to call Kis` wordcraft, `prose` is misleading.  Like `Hourglass,` `garden, ashes` is really one giant narrative poem with lyrical interludes on every page.  Every other sentence contains delectable metaphors and witty allusions much like those found in the work of Kis` idol, Borges.That said though, reading Kis` prose can be a mind-boggling and draining task.  Often times I felt lost among the metaphorical jungle and struggled to recapture the narrative thread.  In fact, `garden, ashes` doesn`t really have a narrative thread per say; instead, it is just like its true author, Andreas Scham, would have it: a collection of dream-like anecdotes and rediscovered memories strung together by a boy searching for his father.  Those who dare to join Andreas on his journey will not be disappointed."}, {"review_sentiment": 5.0, "review_text": "The collapse of the USSR was the best thing that ever happened to American and western European opera houses. In a parallel fashion, the fall of the walls between East and West has enabled us to 'discover' a wealth of literature - some of it suppressed previously - of unexpected brilliance. Yugoslavian writer Danilo Kis (1935-1989) is a prime example.\"Garden, Ashes\" is anything but a 'novel' in the usual English-literature sense. Even the most perspicacious reader will be hard pressed to assemble a plot from it, or to impose any chronology on it. The jumble of childhood memories, the syntax of dreams, the exciting confusion of an old photo album in which the pictures have fallen out of order and lost their labels -- those are the compositional rules of Garden, Ashes. Yes, it's possible to declare, on the book cover, that Kis has written a semi-autobiographical tale of his  childhood in World War II Yugoslavia, with his demented father and family, and at times the child narrator reveals his age - nine, eleven - and attaches names to his people, his own being Andi Scham. Yes, the family is oddly endangered, forced to flee, afflicted with poverty and hunger. But no, this is not another Holocaust tale, or if it is, the boy Andi didn't experience it as such. For him, it was an adventure toward a heroic deed, the mastery of Death, the ability to control and indefinitely postpone Death - his own death, of course - through fantasy and fantastical redefinition of all perceptions. Don't expect to be able to articulate where the boy Andi emerged as the Author Danilo; they are simultaneous. Memory for both is the shadow of onrushing Death. Eleven-year-old Andi already mourns for the past he will remember when he sits down to write as thirty-year-old Kis; near the end of the book, he says:  \"And so, gradually and quite unconsciously, my mother poisoned me with her reminiscences, nurturing in me a passion for old photographs and mementos, for soot and patina. A victim of this sentimental education, I yearned along with her for the days that would never come back, for ethereal journeys and faded landscapes...\" Soot and patina! That's a succinct description of the 'affect' of this lovely, agonizing meditation on a boy's realization of mortality, of the sluggish brevity of life.I have no idea how splendid Kis's prose may be in his native language, but in this translation by William Hannaher it comes out as lyric poetry as fine as that of Nabokov or McEwan. Read it aloud to yourself, if you have the time. Trust me, death and starvation notwithstanding, this is an exhilarating book, a paean to vivid perceptions."}, {"review_sentiment": 5.0, "review_text": "It's heaven hell and purgatory - that is the three distinct metaphorical division of the book. you will find that sometimes bad is better than good and it is better to live in dream than in reality. The grey area between dream and reality in this book is unlimited. The author talks about his father - sometimes his father is like Don Quixote and on other occasions his father is the little tyrant without the crown. It is very close to a modern day Don Quixote. The transalation by William Hannaher is great and worth reading. I will recommend reading this book"}, {"review_sentiment": 5.0, "review_text": "For some reason I think of Bob Dylan in a distant way when I read this book, maybe because of the way it melts into the distance and then you squint your eyes and it all kind of falls into this pastoral, painful dream  and then you realize you're gazing into the pages, like there is some kind  of map staring back at you, a secret map that his father has written for  you, he's whispered the code in your ear and all you can do is hope it'll  come alive like Galatea"}, {"review_sentiment": 5.0, "review_text": "Garden, Ashes proves that after Borges someone could go beyond words, beyond meaning; defying & sculpting at the same time, celebrating & mourning, living & dying... garden & ashes"}]}, "authors": ["Danilo Kis"], "isbn": "015634548X", "longitude": 0.0, "periods": ["1900s"], "title": "Garden, Ashes", "word_cloud": "bear father mother faith father die also bring petite bourgeoisie requiem father central european culture birthright time also memoir youth distinctive rich flamboyant phantasmagorical ultimately paradoxically sad mete bound printed page confine spill sprawl everywhere wonderfully told everyday event life family surnames stuff myth least fairy tale detail keenly observe creatively woven often narrative recur theme confound dream sleep life death many crafty metaphor brilliant retell story ten plague encyclopedic list ology excerpt rationalistic study study juridical study lamarckian lexicographical toxicological literary magical magnetic martyrological good pile cart jewish family relocate ghetto excerpt silverware chest line red cloth case design hold duel pistol upright piano violin case small child sarcophagus bundle document family portrait baroque frame lift dusty repose deprive eternal verticality midst swirl vision dream fantasy stand realistic snapshot central european life event sweep description provincial railway station cafe family await train late summer afternoon fly swoop back forth intoxicated flight heat room smell goulash floor wax celesta stand corner cover cloth casket sway forth gently lazily measure minute bottle shelve take siesta cram sun ray flower bud artillery shell write especially daunt pull brilliantly add list hope day highest accolade short story collection available love sometimes experimental writer amaze fiction form quick reference ghettos cattle car death camp content dominate perception sensibility young boy family life abnormal brilliant father slip pathetic write story endow sick hypersensitivity turn everything memory quickly sometimes day enough interval hour routine change place everyday event lyrical value sense time become suddenly adorned radiant echo meanwhile father say people bear unhappy make unhappy titans power titan greatness give form rigid dose sensitivity dissolve trifle strength follow star sick sensibility borne titanic plan intention break wave rocky bank triviality height cruelty allot lucidity interaction hypersensitive impressionable boy amaze yet doom father basically follow ordinary developmental timeline here discuss amazing lyricism ordinary boyhood issue mother childish sexuality biblical story interaction extend family time begin end narration fear death initially hop outwit outrun eventually able manage fear narrative literature seem able tell mother write poem father vivid memorable character even fascinate present perception intense brilliant child almost allegorical style fine work recommend anyone look fiction magical consternation lyrical mayhem structural pyrotechnic dithyrambic drunkenness stories approach impossible few writer manage confuse baffle simultaneously illuminate enrapture reader sadly underappreciated serbian genius letter least problematic border cross excellent collection short fiction ultimately reward dog hunter enrich literary story straightforward enough young boy hungary recount ominous day precisely arrive family doorstep second child dot mother eccentric father unravels family narrative ramble hamlet hamlet borderlands attempt step ahead increasingly virulent authority work notably specter never directly addressed hovers narrative vulture carrion instead boy attempt understand eventually come father distant terrify god ridiculously pitiful circus clown know journey ultimately end make narrative approach father mixture awe fear singular character drunkard philosopher roam local tavern week end frighten denizen brilliant soliloquy boisterous sing pub spend night traverse local forest pantheistic commune tree flower singular achievement progeny monumental tome revise various edition year hop illuminate world global interconnectedness show infinitesimal connection place travel say father something oddball fellow villager family retrieve father ditch meadows front yard night carouse nonetheless captivate enigmatic father moreover stature eye grow result confrontation local authority poignant humorous scene accost local villager particular member fascist vigilante group frighten romp local wood secret cover illicit communication bomber thugs plan lynch party order thwart brutish plan launch usual soliloquy mob violence actually deepest desire first found martyr new creed carry plan soon possible enthrone act first saint martyr not sophisticated rhetoric right head yokel oratory tap little jig fight back attack scene pathos dark humor occur deadly serious theme never forget actual reference incomprehensible nefarious machinery leave mention name oblique word cattle car gas chamber crematoriums selection line sadistic guard instead sail subtler tack thereby make impend abomination forebode terrify lurk page dark example local give notice collect belonging head specify stag area everything treat normal neighbor wealthy shopkeeper cart pack everything steel sink entire assortment farm animal make darkly irreverent comparison situation many victim pale imagination belonging move ghetto assembly area seem innocuous enough clown philosopher show rare insight tragedy loom horizon belonging respond prophetic me cecum dark humor even darker irony make hard put real treat lie language translation simply delightful capture constant flow lyrical melody miraculous prose fact call woodcraft mislead really giant narrative poem lyrical interlude page sentence contain delectable metaphor witty allusion much find work idol say read prose drain task time felt lose metaphorical jungle struggle recapture narrative thread fact really narrative thread say instead true author anecdote rediscovered memory string together boy search father dare join journey disappoint collapse best thing ever happen american western european opera house parallel fashion fall wall enable literature suppress previously unexpected brilliance yugoslavian writer prime example anything usual sense even perspicacious hard press assemble plot chronology jumble childhood memory syntax dream excite confusion old photo album picture fall order lose label com positional rule possible declare cover write tale childhood demented father family time child narrator reveals age eleven attache name people family oddly endanger forced flee afflict poverty hunger tale boy experience adventure heroic deed mastery ability control indefinitely postpone death course fantasy fantastical redefinition perception do able articulate boy emerge simultaneous shadow onrushing already mourn past sits end say gradually quite unconsciously mother poisoned reminiscence nurture passion old photograph memento soot patina victim sentimental education yearn along day never back ethereal journey fade landscape patina succinct description lovely agonize meditation boy realization mortality sluggish brevity idea splendid prose language translation come lyric poetry fine aloud time death starvation notwithstanding exhilarate paean vivid perception heaven hell purgatory distinct metaphorical division sometimes bad better good better live dream reality grey area dream reality unlimited author talk father sometimes father occasion father little tyrant crown close modern day translation great worth read recommend read reason think distant way maybe way melt distance squint eye kind fall pastoral painful dream gazing page kind map star back secret map father write whispered code hope come alive prove someone word mean defy sculpting time celebrate mourn live die garden", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "From young Andi Scham's memories emerges the story of his father, who recedes from life in Yugoslovia and then disappears in the Holocaust. \r\n\r\n“Garden, Ashes will influence the most current trends in the art of the literary avant-garde—so much so that it may even shape the course of the novel.” (Le Figaro)\r\n\r\n“In Kis's case . . . it is the consistent quality of the local prose that counts. It is how, sentence by sentence, the song is built, and immeasurable meanings meant. It is the rich regalia of his rhetoric that leads us to acknowledge his authority. On his page, trappings are not trappings, but sovereignty itself.” New York Review of Books", "asin": "015634548X", "rank": "1389438", "city": "Novi Sad", "image": "https://images-na.ssl-images-amazon.com/images/I/41ZEECQY0WL.jpg", "country": "Auschwitz", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}