{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 7, "rating": 4.7, "reviews": [{"review_sentiment": 4.0, "review_text": "I read this book during a visit to Cuba.  It was amazing to see and walk through the streets amd plazas where the book takes place, to see the statue of Cecilia Valdes, and to understand what Cuba was like during the era of slavery.  It's a long book, written in an old style ( like a Dickens novel ).  But it is worth reading if you are planning a trip to Havana."}, {"review_sentiment": 5.0, "review_text": "Love the book."}, {"review_sentiment": 5.0, "review_text": "Loved listening to this book.  Just wished iti would have been the long original version"}, {"review_sentiment": 5.0, "review_text": "Cuban literature is known for the poetry and not for novels. Cecilia Valdez, nonetheless, is excellent, written by an expatriate in America who was active in the struggle for independence from the scummy Spaniards. It is a blistering denunciation of slavery in Cuba via the vehicle of a novel, akin to Uncle Tom's Cabin, only much harsher. It also offers a window of the times (aside from the issue of slavery).Having several memorable characters, the story is interwoven with contemporary details and minor historical events and descriptions of architectural, economic, political and agricultural facts. An importer of African slaves, also owning a sugar cane plantation has a wastrel son who is interested in a beautiful mulato girl, unbeknownst to him that she is his half-sister. Their father has seen to her financial means without her knowing who he is, and what is his relation to her, and is intent on keeping them apart in order to avoid an incestuous relationship.I read the story in Spanish so I cannot judge how good are the translations."}, {"review_sentiment": 5.0, "review_text": "A classic of Spanish-American literature, although not so well-known.  Set in nineteenth-century Cuba, it reveals in a lively way the nature, both charming and horrific, of the slave and white and black and mulatto society emerging toward revolution."}, {"review_sentiment": 5.0, "review_text": "Set in colonial Havana, Cecilia Valdés by Cirilo Villaverde opens a window to the evils of slavery and colonialism in early 19th century Cuba. Written in 1839, Villaverde was describing contemporary evils much as Harriet Beecher Stowe did. Think of it as the Cuban Uncle Tom's Cabin, even if it goes light on violence and heavy on flowery romance.Our eponymous heroine is a strikingly beautiful quadroon orphan who -- unbeknownst to her -- is the product of an adulterous union between Cándido de Gamboa, a lustful and wealthy landowner and slaveholder, and a mulata slave, who dies in childbirth. Eager to avoid a scandal, Don Cándido ships his illegitimate mixed-race daughter Cecilia to an orphanage. Her grandmother, Chepilla, after five years, is able to regain custody of the girl through threats of exposure, and brings Cecilia up, but Chepilla doesn't disclose Cecilia's paternity. The coquettish and beautiful Cecilia has many admirers, but she gains a dangerous one: Don Cándido's legitimate eldest son and heir, Leonardo.Leonardo Gamboa is engaged to the well-born and white Isabel Ilincheta from Alquízar, a good match arranged by Leonardo's mother with a girl Leonardo has known since boyhood. However, like his father, Leonardo has a roving eye. Leonardo unwittingly falls in love with Cecilia, his half-sister, and she with him. But the fickle Leonardo abandons Cecilia for Isabel Ilincheta and respectability. Needless to say, this tale of star-crossed lovers will end tragically.In addition to critcisms of slavery, the novel also shines a light on the racial and class system of colonial America. The Spanish-born oligarchs top the social hierarchy, followed by the white Cuban colonists (criollos), sorted by wealth and family distinction. Class distinctions also exist among those who are mixed race and those who are black, between those who are free and those who are still enslaved, those who toil on the sugar plantations and those in domestic service at the homes of the elite, between those who were born on Cuban soil and those who were plucked from Africa.The novel needs to be read in light of its 19th century origins. Like the Spanish literature of its day on which this Cuban classic was modeled, Cecilia Valdés is a great deal more flowery than Latin American or Spanish literature today -- or even than the novel's British or American contemporaries. Like 19th century novels, Cecilia Valdés reads as a melodrama. However, the story is still an interesting one, and Cecilia Valdés is still considered the greatest Cuban novel of the 19th century.This abridged Audible.com edition is an excellent introduction to 19th century Spanish literature (Cuba was still a Spanish colony then) for upper-level Spanish students and especially for hispanohablantes like me trying to get a firmer foundation in the great literature of heritage. The multi-cast recording makes the action easy to follow, and at just a little over two hours, this abridged version won't get too overwhelming. This isn't just for those trying to improve their Spanish."}, {"review_sentiment": 5.0, "review_text": "I don't like reviews that tell me the story--so let me simply say that this is a great read.  Some wonderful Cuban history is referenced here and led me to look up some of the specifics.  Strong story from a book written so long ago."}]}, "authors": ["Cirilo Villaverde"], "isbn": "0195143957", "longitude": -82.3658671, "periods": ["1800s"], "title": "Cecilia Valdés or El Angel Hill", "word_cloud": "visit amaze walk street amd plaza take place see statue understand era slavery long write old style worth read planning trip love listening wish is original version cuban literature know poetry novel nonetheless excellent write expatriate active struggle independence scummy blister denunciation slavery vehicle akin much harsher also offer window time aside slavery several memorable character story interwoven contemporary detail minor historical event description architectural economic political agricultural fact importer african slave also own sugar cane plantation son interested beautiful mulatto girl unbeknownst father see financial mean know relation intent keep apart order avoid incestuous story spanish judge good translation classic literature reveals lively way nature charm horrific slave white black mulatto society emerge revolution colonial open window evil slavery colonialism early century describe contemporary evil much even go light violence heavy flowery eponymous heroine strikingly beautiful squadron orphan unbeknownst product adulterous union lustful wealthy landowner slaveholder mulatto slave dy childbirth avoid scandal ship illegitimate daughter orphanage grandmother year able regain custody girl threat exposure bring paternity coquettish beautiful many admirer gain dangerous legitimate eldest son heir engage white good match arrange mother girl know boyhood however father rove eye unwittingly fall love fickle abandon respectability say tale lover end addition criticism slavery also shin light racial class system colonial oligarch top social hierarchy follow white colonist criollo sorted wealth family distinction distinction also exist mixed race black free still enslave toil sugar plantation domestic service home elite born soil pluck need light century origin spanish literature day classic model great deal flowery latin american spanish literature today even british american contemporary century novel read however story still interest still consider greatest abridge edition excellent introduction century spanish literature still spanish colony spanish student especially hispanohablantes try firmer foundation great literature recording make action easy follow little hour abridge version overwhelm try spanish like review tell story let simply great wonderful history reference lead look specific story write long ago", "genres": ["Fiction & Literature"], "summary": "Cecilia Valdés is arguably the most important novel of 19th century Cuba. Originally published in New York City in 1882, Cirilo Villaverde's novel has fascinated readers inside and outside Cuba since the late 19th century. \r\n\r\nIn this new English translation, a vast landscape emerges of the moral, political, and sexual depravity caused by slavery and colonialism. Set in the Havana of the 1830s, the novel introduces us to Cecilia, a beautiful light-skinned mulatta, who is being pursued by the son of a Spanish slave trader, named Leonardo. Unbeknownst to the two, they are the children of the same father. Eventually Cecilia gives in to Leonardo's advances; she becomes pregnant and gives birth to a baby girl. When Leonardo, who gets bored with Cecilia after a while, agrees to marry a white upper class woman, Cecilia vows revenge. A mulatto friend and suitor of hers kills Leonardo, and Cecilia is thrown into prison as an accessory to the crime.\r\n\r\nFor the contemporary reader Helen Lane's masterful translation of Cecilia Valdés opens a new window into the intricate problems of race relations in Cuba and the Caribbean. There are the elite social circles of European and New World Whites, the rich culture of the free people of color, the class to which Cecilia herself belonged, and then the slaves, divided among themselves between those who were born in Africa and those who were born in the New World, and those who worked on the sugar plantation and those who worked in the households of the rich people in Havana. \r\n\r\nCecilia Valdés thus presents a vast portrait of sexual, social, and racial oppression, and the lived experience of Spanish colonialism in Cuba.", "asin": "0195143957", "rank": "563629", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/510zENDV3JL.jpg", "country": "Cuba", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}