{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 44.8178131, "ratings": {"num_ratings": 3, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "I am rereading this book for the second time ahead of a trip to Serbia. This book is part cultural history and part guidebook. It is very well written by an expert on Serbian history and culture. A treat for anyone interested in Serbia and the Balkans."}, {"review_sentiment": 5.0, "review_text": "I would put this with Tim Judah's excellent The Serbs as part of the bibliography of contemporary books that are essential for Western readers who wish to know and understand more about this fascinating people and the multifaceted cultural history of the Balkans. This is a city where there is still--or again--much beauty and worth to be found.Many books are available on the Balkans, but most are either particular to the horrors of the early 1990s, or so dry they give you a sore throat. And many come with either a pro- or anti- agenda, sometimes hidden, which makes it tough to know whether you're reading dispassionate narrative or a stacked argument. For those who have been there, Norris's dignified, readable, authoritative book will take you back down the streets and into the neighborhoods, offering an absorbing and relevant history.But Belgrade: A Cultural History is not to be mistaken for either a travel memoir or a guidebook. For those who have not been there before, absorb this one before you set out on your journey. For that matter, if you weren't planning on visiting Belgrade, proceed with caution: after reading this book, you may not be able to resist.It's not hard to fall in love with Paris. I have an eternal soft spot for London. Many of us Westerners have our own favorite world cities. David Norris has firmly established Belgrade as a candidate for that kind of respect and appreciation."}, {"review_sentiment": 5.0, "review_text": "The cultural history of Belgrade is at once rich and dramatic, which is how this book reads. Norris doesn't dwell too much on the most recent history,nor does he take a narrow political view of recent events. Belgrade (and Serbia) is as much about Milosevic and the wars as America is about Bush and the Iraq Invasion/Occupation. There's just so much more. Norris understands this and gives us a broader understanding while painting a nuanced portrait of a city eternally at European and World crossroads."}]}, "authors": ["David A Norris"], "isbn": "0195376099", "longitude": 20.4568974, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases", "1500s", "500-1400s", "0-500s", "Pre Common Era"], "title": "Belgrade A Cultural History", "word_cloud": "reread second time ahead trip part part guidebook well write expert serbian culture treat anyone interested excellent part bibliography contemporary essential western reader wish know understand fascinate people multifaceted city still much beauty worth available particular horror early dry give sore throat many come agenda sometimes hidden make tough read dispassionate narrative stack argument dignify readable authoritative street neighborhood offer absorb relevant travel memoir guidebook absorb set journey matter planning visit proceed caution reading able hard fall eternal soft spot favorite world city firmly establish candidate kind respect appreciation rich dramatic read dwell much recent narrow political view recent event much war much understand give broader understand painting nuanced portrait city eternally european crossroad", "genres": ["History"], "summary": "Perched above the confluence of two great rivers, the Sava and Danube, Belgrade has been home to many civilizations: Celts, Romans, Byzantines, Bulgars, Magyars, Ottomans and Serbs. A Turkish fortress, the focus for a Serbian principality, an intellectual and artistic center, the city grew until it became capital of Yugoslavia. \r\n\r\nNow it is one of the largest cities in south-eastern Europe and capital of the Republic of Serbia. Despite many challenges, Belgrade has resisted assimilation and created a unique cultural identity out of its many contrasting sides, sometimes with surprising consequences.", "asin": "0195376099", "rank": "1606641", "city": "Belgrade", "image": "https://images-na.ssl-images-amazon.com/images/I/51QuIu4WpdL.jpg", "country": "Serbia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}