{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 46.2017559, "ratings": {"num_ratings": 36, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "This was the first book I read by Machado de Assis, and it will definitely not be my last. Very well written, interesting and, in its way, insightful. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "I bought this book and Dom Casmurro to give it as a gift to my daughter's English teacher. She loved it"}, {"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 5.0, "review_text": "One of the genious book of mankind"}, {"review_sentiment": 5.0, "review_text": "A delightful book, which plays with the concept of being a novel."}, {"review_sentiment": 1.0, "review_text": "stupid, boring"}, {"review_sentiment": 5.0, "review_text": "Though it may perplex some readers who are used to conventional novels, The Posthumous Memoirs of Bras Cubas is a masterpiece, and there is no need for me to write a review of the novel; instead I wanted to say a few words about the translation.  Rabassa's may well be the best available, as one reviewer here claims, but that is not saying much.  This edition is part of a series offering Latin American works that are hard to find in translation, and it comes with some helpful critical essays. Quincas Borba and Dom Casmurro are also available in the series.  I think it does improve some on William Grossman's 1951 translation (which was titled, \"Epitaph of a Small Winner\"), but that translation is still acceptable.There are essentially two problems with the present edition: first, there are numerous typos throughout the text that are not just annoying but maddeningly perplexing.  Errors such as \"statute\" instead of \"statue\" would not be so bad were it not for the number of them, but what is most disruptive are those errors that obscure the sense and thus disrupt the flow, as in \"what do I care if you exist or not, if you both the eyes of other people\" (p. 99) instead of, presumably, \"bother the eyes of other people.\"  There are more than a few sentences where the sense is garbled like this. The proofreader was not doing his job.  I read somewhere that the publisher intended to correct these errors in a subsequent printing, but as there has been no subsequent edition, we are stuck with these flaws.The second drawback is that the translation is still a little stiff in places and oddly unidiomatic at times, and I suspect that this derives from the translator's following the Portuguese constructions a little too closely.  He seems to have a tin ear when it comes to rendering colloquial English, and that detracts from the lively and colloquial style of the original.Other than that, I cannot recommend the book highly enough, and we can only hope that more translations will follow.  Why should the Russians be retranslated for each new generation of readers -- and to great fanfare, as in the case of Pevear and Volokhonsky -- and such titans as Machado de Assis be relatively neglected in this regard?  One cannot claim to be well read in the novel without being thoroughly conversant with the Latin American tradition and particularly such salient figures as Machado de Assis."}, {"review_sentiment": 3.0, "review_text": "Very uneven. Some strong passages."}, {"review_sentiment": 5.0, "review_text": "This is a book unlike any other book that I have ever read in its wording and its content.A dead man describes the follies and predicaments of human life with an omniscient and delicate satire and truthfulness. In describing every event, the narrator removes a veil that is an accepted wrap for that event which is  taken edible by the whole populace. So many of them excited me to cover them with color in my kindle book!The afterword is a complementary worthy piece. My many thanks to the translator for it and the novel."}, {"review_sentiment": 5.0, "review_text": ";}"}]}, "authors": ["Joaquim Maria Machado de Assis"], "isbn": "0195101707", "longitude": 6.1466014, "periods": ["1900s"], "title": "The Posthumous Memoirs of Brás Cubas", "word_cloud": "first definitely last very well write interesting way insightful recommend buy gift daughter teacher love excellent genius mankind delightful play concept stupid boring reader use conventional novel need write review instead want say word translation well available reviewer claim say much edition part series offering latin american work hard find translation come helpful critical essay also available series think translation title translation still essentially problem present edition first numerous typo text annoy maddeningly perplexing error statute instead statue bad number disruptive error obscure sense thus disrupt flow care exist eye people instead presumably bother eye people sentence sense garble proofreader job somewhere publisher intend correct error subsequent printing subsequent edition stick second drawback translation still little stiff place oddly unidiomatic time suspect derives translator follow portuguese construction little closely seem tin ear come render colloquial english detracts lively colloquial style recommend highly enough hope translation follow re translated new generation reader great fanfare case titan relatively neglect regard claim well thoroughly conversant latin american tradition particularly salient figure very uneven strong passage ever word dead man describe follies predicament human life omniscient delicate satire truthfulness describe event narrator remove veil accept wrap event take edible whole populace many excite cover color kindle afterword complementary worthy piece many thanks translator", "genres": ["Fiction & Literature"], "summary": "\"Be aware that frankness is the prime virtue of a dead man,\" writes the narrator of The Posthumous Memoirs of Brás Cubas. But while he may be dead, he is surely one of the liveliest characters in fiction, a product of one of the most remarkable imaginations in all of literature, Brazil's greatest novelist of the nineteenth century, Joaquim Maria Machado de Assis.\r\n\r\nBy turns flippant and profound, The Posthumous Memoirs of Brás Cubas is the story of an unheroic man with half-hearted political ambitions, a harebrained idea for curing the world of melancholy, and a thousand quixotic theories unleashed from beyond the grave. It is a novel that has influenced generations of Latin American writers but remains refreshingly and unforgettably unlike anything written before or after it. ", "asin": "0195101707", "rank": "570620", "city": "Geneva", "image": "https://images-na.ssl-images-amazon.com/images/I/51PRSyK50ZL.jpg", "country": "Switzerland", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}