{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 17, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "re: Oxford Wold's Classics edition -This is not only a fabulous translation, but an unbelievably helpful edition. I thoroughly recommend the Kindle version - even as someone who typically prefers print. Unless you're really, really up on your French history, you're going to be running across historical references - people, places, customs - that are nonsensical to you. The print edition of this book has thorough endnotes, but they require you flip between your place in the book and the end where the notes live. In the Kindle version, you can tap the annotation, read it, and then tap back to the book uninterrupted. I've gotten into a great rhythm with these and it makes the book infinitely more accessible.As far as the book, I suppose I could give a review, but let's be honest - if you're here, it's because you know what you're buying. This book isn't in the \"new authors\" or \"current best-sellers\" shelves at Barnes & Noble, and you didn't pick it up by mistake. If you're a Disney fan, be warned that Hugo was trenchantly political and that the conventions of epic novel writing in the 1820s differ substantially from modern storytelling. If you're on board for that, read the forward, because Krailsheimer does a fabulous job explaining what this book is, how it's written, and how it might defy your expectations. While I think this is a great novel, a reader in 2017 can't dive headfirst into a novel from the 1820s and expect it to feel completely modern. The translation is perfectly lucid, but the plot structure and the way ideas are conveyed is very contrary to the way modern books are organized. Exposition - which is often frowned upon in modern novels - is an art form here, and Hugo spends the first half of the book setting up the pieces in exquisite detail. I love it, but again, if you're not prepared, you'll struggle to figure out where the book is going.Basically - enjoy, but also be sure you understand what you're reading. Coming from any adaptation in existence, even the more faithful ones, this book will be startling. Keep an open mind. It's a masterpiece, but you have to read it on its own terms."}, {"review_sentiment": 3.0, "review_text": "One of my least favorite classics I have read.  It just seemed to meander....a LOT!  The story just seemed to have no real protagonist, no real direction.  And the writing did not bring this reader in.  (although maybe that was the translation)I guess its worth a read but compared to other classics by Tolstoy, Dickens etc.  this just didn't stand up!"}, {"review_sentiment": 3.0, "review_text": "The story is OK,not far from good as Les Miserables"}, {"review_sentiment": 5.0, "review_text": "A classic work that I am glad I finally had the pleasure of reading. Darker than Les Miserables, but perhaps not as subtle in its plot development. Overall, out of the two works, I think I prefer Les Miserables, but Notre-Dame de Paris is worth reading more than once."}, {"review_sentiment": 5.0, "review_text": "this translation is excellent! i prefer it over the others."}, {"review_sentiment": 5.0, "review_text": "This earlier book isn't Hugo's most polished story, but it's got enough likeable characters and interesting developments to be well worth reading. And I loved the discussion on architecture and changing communication platforms in society!"}, {"review_sentiment": 3.0, "review_text": "The message is clear: Against death penalty. Contempt for the judicial system in France in the 15th century.Could be better with shorter descriptions of the people and the sorroundings in the plot."}, {"review_sentiment": 5.0, "review_text": "I enjoyed this book because it was not what I expected.  I had read Les Miserables and loved it, and was expecting something similar.  I quickly saw that the comparison was of no value and began to enjoy this book on its own.  I very much enjoy the way Hugo drifted from interaction between characters to his thoughts on architecture and Paris. For me, literature is most enjoyable when it wanders."}, {"review_sentiment": 4.0, "review_text": "Originally published in 1831, Notre-Dame de Paris forces modern readers to slow down.Often a 300 page novel is now considered a ponderous read, when it comes to literary fiction, but this book weighs in at 561 pages of densely packed thought and action.The book, like many 19th Century books, is as much a sociological event as it is a narrative. Often the story is interrupted for a history of a group, a building, or a concept. This may put modern readers off who are in a hurry to move on to their next read. Genre readers will be particularly put off by this book, which requires a level of commitment most are unwilling to make.However, if readers will still with the story and take the time to get to know Quasimodo, Esmeralda, Claude Frollo, and the many other characters that make up the world of this Medieval Gothic Romance they will, hopefully, not be disappointed.Because it is Gothic, all actions, thoughts, and emotions are exaggerated and melodramatic. If you can accept the conventions of the Gothic Romance then you will enjoy this book as much as I have—this was my third reading of it. Firstly, I read it when I was in my late teens; then I read it at University; finally, I have read it again—thirty years on. During each reading I found something new to enjoy in the book.4 out of 5 stars. It lost one star because I have always found it to be a little over-written—even by the standards of the time."}, {"review_sentiment": 5.0, "review_text": "ok"}]}, "authors": ["Victor Hugo"], "isbn": "019955580X", "longitude": 2.3514992, "periods": ["1800s"], "title": "Notre-Dame de Paris", "word_cloud": "edition fabulous translation unbelievably helpful edition thoroughly recommend version even someone typically prefers print really really french history go run historical reference people place custom nonsensical print edition end notes require flip place end note live version tap annotation tap back uninterrupted get great rhythm make infinitely far suppose honest buy new author current shelf pick mistake fan warn trenchantly political convention epic write differ substantially modern storytelling board forward fabulous job explain write expectation think great headfirst feel completely modern translation perfectly lucid plot structure way idea convey contrary way modern organize often frown modern novel art form spend first half set piece exquisite detail love prepared struggle figure enjoy also sure understand reading come adaptation existence even faithful one startle open mind masterpiece term least favorite classic seem meander story seem real protagonist real direction write bring maybe translation guess worth compare classic stand story far good classic work glad finally pleasure read perhaps plot development work think prefer le read translation excellent prefer others earlier polish story get enough likable character interest development well read love discussion architecture change communication platform society message clear death penalty judicial system better shorter description people surroundings plot enjoy expect love expect something similar quickly saw comparison value begin much way drift interaction character thought architecture literature enjoyable wanders originally publish force modern reader slow page consider ponderous come literary fiction weighs page densely pack think many much sociological event narrative story interrupted history group build concept modern reader hurry move next reader particularly put require level commitment unwilling reader still story time know many character make world hopefully action thoughts emotion exaggerate melodramatic accept convention enjoy much third read late teen finally year reading find something new enjoy star lose star always find little standard time ok", "genres": ["Fiction & Literature"], "summary": "At the center of Hugo's classic novel are three extraordinary characters caught in a web of fatal obsession. The grotesque hunchback Quasimodo, bell-ringer of Notre-Dame, owes his life to the austere archdeacon, Claude Frollo, who in turn is bound by a hopeless passion to the gypsy dancer Esmeralda. She, meanwhile, is bewitched by a handsome, empty-headed officer, but by an unthinking act of kindness wins Quasimodo's selfless devotion. Behind the central figures moves a pageant of picturesque characters, including the underworld of beggars and petty criminals whose assault on the cathedral is one of the most spectacular set-pieces of Romantic literature.\r\n\r\nAlban Kraisheimer's new translation offers a fresh approach to this monumental work by France's most celebrated Romantic authors.", "asin": "019955580X", "rank": "242155", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51rItQcejzL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}