{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 36, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "The genre of Horrid or Gothic novels is a favorite of mine.  Ann Radcliffe  & others became an interest to me, when reading Jane Austin ' s wonderful books.  Through her books, I managed to find the Horrid Novels of N. Abbey & was introduced to these books.Poetry, terrors of reason,  morals are all a part of the experience.  As many of these novels are available free,  I read them voraciously.I highly recommend The Monk as 1 of these novels to be read slowly & savored. ..especially when storming!  Enjoy & answer the discussion questions in the back of the book...you may find yourself realizing a part of the plot you hadn't considered."}, {"review_sentiment": 5.0, "review_text": "Sensational Gothic tale at its best. This book will pummel your bosom into fits of uncomprehending laughter and rage in equal portions. Ennui will not fill the days it takes to finish this book, and though you will certainly need some Judith Butler to wash the sour taste of misogyny out of your mouth, try not to tell everyone you know to read this immediately after finishing."}, {"review_sentiment": 5.0, "review_text": "This novel proves that you can't judge a book by it's cover. What a wild ride! Worth the read, I'm serious."}, {"review_sentiment": 4.0, "review_text": "What a read. \"The Monk\" is a very well written story with good pacing and characters easily imagined. Although there were times I'd confuse the characters for one another (agnes & antonia), eventually all was cleared up and who said what was clarified.If ever I meet a man named Ambrosio he'll no doubt bring to mind the morally corrupted Abot exposed in the pages of this book.  After reading this classic I feel blessed to live by a faith that puts no man before God. And to live in times minus a torturing inquisition. For a book written over two centuries ago, the immoral acts and dirty deeds done by the few who were entrusted to be reflections of God's grace, can easily fit into today's criminal headlines. It just goes to show how the devil is always busy tempting and recruiting even the best of souls.Many quotable lines throughout; here's a favorite I plan to hold on to, straight out of the mouth of a Daemon: It is not virtue, which makes you reject my offer: You would accept it, but you dare not. 'Tis not the crime which holds your hand, but the punishment; 'Tis not respect for God which restrains you, but the terror of his vengeance!"}, {"review_sentiment": 4.0, "review_text": "Must-read classic for people interested in the Gothic novel."}, {"review_sentiment": 5.0, "review_text": "A great gothic horror. Slow but I still love it."}, {"review_sentiment": 3.0, "review_text": "It's a good story; but it does move slowly. This is partly due to numerous forays into pages of poetry.  The poems/songs are supposed to be enhancing a particular point or direction in the story (I think).  For me, these poetic inserts were just annoying.  I also think this was to emphasize the poetically romantic/tragic bent of the Spaniards in this historical context.  I will say that the ending almost justified the time it took for me to read this through.  The supernatural sub-plots didn't seem very developed, and were too minimal to be classified as a genuine Gothic.  It was amusing how many times the males affected moods and fainting spells traditionally favored by heroic-yet-tragic females."}, {"review_sentiment": 4.0, "review_text": "I was pleasantly surprised by Lewis's novel. Despite its length, I read it in a rather brisk two weeks given my work schedule. Wikipedia will tell you about the subplot involving supernatural characters like the Bleeding Nun and the Wandering Jew, as well as discussing the novel's use of the medieval morality tale with respect to the novel's eponymous character Ambrosio. It is true that evil is much more often represented than the forces of good, but you will have to read until the end to find out which ultimately prevails. In general, I highly recommend this novel."}, {"review_sentiment": 5.0, "review_text": "Love it!"}, {"review_sentiment": 4.0, "review_text": "I found it more of a drama or found more to disturb & upset me than a good romance to enjoy. It was a well written book and great story, but not what I was expecting. It's good, but not my favorite Gothic Romance."}]}, "authors": ["Matthew Lewis"], "isbn": "019953568X", "longitude": -3.7035825, "periods": ["1700s"], "title": "The Monk", "word_cloud": "genre novel favorite mine others become interest reading wonderful manage find horrid introduce terror reason moral part experience many novel available free highly recommend novel slowly savor storm answer discussion question back realize part plot consider sensational tale best pummel bosom fit uncomprehending laughter rage equal portion fill day take finish certainly need wash sour taste misogyny mouth everyone know immediately finish prove wild ride serious well write story good pacing character easily imagine time confuse character agnes antonia eventually clear say ever meet man name doubt bring mind morally corrupt expose page read classic feel bless live faith put man live time minus torture inquisition write century immoral act dirty deed do entrusted reflection grace easily fit today criminal headline go show devil always busy tempt recruit even best quotable line favorite plan hold straight mouth virtue make reject offer dare crime hold hand punishment respect restrain terror vengeance classic people interested great gothic horror still good story move slowly partly due numerous foray page poetry suppose enhancing particular point direction story think poetic insert annoy also think poetically bent historical context say end almost justified time take supernatural seem develop minimal classified genuine amuse many time male affect mood faint spell traditionally favor female pleasantly surprise length rather brisk week give work schedule tell subplot involve supernatural character well discuss use medieval morality tale respect eponymous character true evil much often represent force good end find ultimately prevail general highly recommend find drama find disturb upset good romance enjoy well write great story expect good favorite", "genres": ["Fiction & Literature"], "summary": "Set in the sinister monastery of the Capuchins in Madrid, The Monk is a violent tale of ambition, murder, and incest. The great struggle between maintaining monastic vows and fulfilling personal ambitions leads its main character, the monk Ambrosio, to temptation and the breaking of his vows, then to sexual obsession and rape, and finally to murder in order to conceal his guilt. The only edition of this key gothic novel available, The Monk now offers a new introduction and notes that make it especially accessible to the modern reader.\r\n", "asin": "019953568X", "rank": "590322", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51%2BdhTmUsKL.jpg", "country": "Spain", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}