{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 75, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "A good ref book on the old artists by someone who was there Rich"}, {"review_sentiment": 5.0, "review_text": "Great!"}, {"review_sentiment": 5.0, "review_text": "Very interesting for those who want the inside of Italian Renaissance Art."}, {"review_sentiment": 3.0, "review_text": "awesome"}, {"review_sentiment": 5.0, "review_text": "EXCELLENT"}, {"review_sentiment": 5.0, "review_text": "excellent"}, {"review_sentiment": 5.0, "review_text": "A valid excellent book written 600years ago."}, {"review_sentiment": 5.0, "review_text": "LOVE THIS BOOK"}, {"review_sentiment": 5.0, "review_text": "Comprehensive coverage of artists. Well-written. Excellent resource."}, {"review_sentiment": 5.0, "review_text": "Well, a book that has been red for mor than four centuries canot be anything less tham wonderfull."}]}, "authors": ["Giorgio Vasari", "Giorgio Vasari"], "isbn": "0199537194", "longitude": 12.4829321, "periods": ["1600s", "1500s", "1500s"], "title": "The Lives of the Artists (Oxford World's Classics)", "word_cloud": "good ref old someone rich great very interesting want italian art awesome excellent excellent valid excellent write ago comprehensive coverage resource well red nor century canto anything le than wonderful", "genres": ["Art & Architecture", "History", "Renaissance", "Biography", "Art & Architecture", "Renaissance"], "summary": "These biographies of the great quattrocento artists have long been considered among the most important of contemporary sources on Italian Renaissance art. Vasari, who invented the term \"Renaissance,\" was the first to outline the influential theory of Renaissance art that traces a progression through Giotto, Brunelleschi, and finally the titanic figures of Michaelangelo, Da Vinci, and Raphael. \r\n\r\nThis new translation, specially commissioned for the Oxford World's Classics series, contains thirty-six of the most important lives. Fully annotated and with a brand new package, Lives of the Artists is an invaluable classic to add to your collection.\r\n\r\n\"A book which has come to be recognised as the single most important contemporary source of information on hundreds of artists of the Italian Renaissance period.\" Irish Independent", "asin": "B0073UP9SS", "rank": 0, "city": "Rome", "image": "", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}