{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 19, "rating": 3.3, "reviews": [{"review_sentiment": 2.0, "review_text": "Part of the problem with this book was undoubtedly the translation but even so---my how writing craft has progressed  in the last 150 years!  This book's soap opera like plot seems to grind on and on...the second half of the book is particularly trying and the plot is full of holes. There is also a lot of sloppiness-- for instance Balzac forgot what age he assigned Baron Hulot earlier in the book....suddenly in the space of a paragraph he goes from 63 to 70 even though only 3 years have passed. This book cries to be edited down.This novel wanders and especially loses your interest in the interminable second half....the scene where the Brazilian finds out about Mme. Marneffe is particularly bad--- other comments remark on the bookkeeper like listing of money all of it meant to impress a la Dallas--I had to force myself to read the last hundred pages. The surprise ending was unexpected although it is famous---I remember having heard of it--a man of 80 clutching the servant girl promising to make her a baroness...I may read a less long Balzac in French and see if there in lies most of the problem...(the translation)...I suspect not. The Red and the Black by Stendahl was written earlier 1830 and it quit a bit better (but beware the Charter House of Parma (much later Stendahl) is truly terrible!...also Zola (1870-1900) is an author who is leagues more sophisticated particularly certain of his novels like The Soil.The bad translations were said to have killed off Jules Verne who was never that popular in the english sphere as he was else where.I think most of the problem is the sophistication of the average reader has increased dramatically since 1840s and the author'swrote to make money often in serial format... The readers of today are much more sophisticated and the authors also infinitely more sophisticated...e.g. the stupid part about the Brazil and the Brazilian just show an ignorance of the world....but I kept reminding myself ..  The Congo River was not discovered until the 1870s...30 years after this novel was written.I enjoyed Balzac's critique of taste.....good art versus bad art... it is also shallow.  Well we are so smart now eh??2 stars is all I can muster for this thing.  Try Zola instead."}, {"review_sentiment": 4.0, "review_text": "Great depiction of life in France in 1840s among the bourgeoisie.  Social and economic striving and acute income disparities.  Highly amusing social commentary rather than psychological exploration,"}, {"review_sentiment": 1.0, "review_text": "I stopped reading after the first half of the novel when I realized that only more of the same would be endured.  The frequency with which the cash-obsessed Balzac mentions a specific sum of money is amusing, then exasperating.  Simply try to find five pages in a row where he does not cite \"300,000 francs\", \"80,000 francs\" , \"192,000 francs\" or some other hefty sum in dowries, loans, debts, cost of furnishings, etc.  Deception and adultery are also tiresomely repeated throughout the implausible plot, which is solely concerned with money and philandering.  This is far from realism and indeed stalls at the level of mere soap opera.  Has there ever been another novelist that writes about money so persistently?  I remember that cash also was a main character in his better novel \"Lost Illusions\".  I have lost my illusion and I am weary with Monsieur Balzac.  I bid him adieu."}, {"review_sentiment": 4.0, "review_text": "To me, Balzac is the French George Eliot. In Cousin Bette, there are so many memorable quotes, just as many as in Middlemarch. The plot is terribly complicated, but worth the read."}, {"review_sentiment": 4.0, "review_text": "I guess people in the 19th Century had alot of time on their hands to spend reading a long book that goes over the same material again and again.I read this as a book on tape.  The book for me was alittle longish and dull so I doubt I would have been able to read it in its hardcopy form without giving up on it. However, thanks to books on tape, I was able to stick with the book until its end.Yes, do read the book!  Apparently Balzac, poor fellow, was himself a victim to debts and even penury.  I read in the bio that he never made much money from his writing.  I was sorry to hear that.  In this book there are innumerable mentions about the financial plight of his characters----their debts,  going into debt, mortgages on houses that can't be paid, borrowing money that can't be repaid, the threat of debtors prison and arrest imminent.  So, if you think you have \"financial problems\" your \"problems\" will seem miniscule compared with the characters in this book!Yes, this book is worth reading as long as you are patient and don't get bored too easily. I at first gave it 3 stars but then I felt sorry for Balzac so I raised it up to 4---I suppose a 3.5 would be more a more accurate guage of my opinion about this book.  Actually, it is well written.  Don't let me dissuade you from giving it a try.  You'll find alot in the book to enjoy and you will learn about what life was like in Paris during the first part of the 1800's.  The courtesans sounded interesting to me...but don't tell my wife!  :o)  Email Boland7214@aol.co"}, {"review_sentiment": 5.0, "review_text": "Balzac is so much fun!  He would be great to invite to dinner.  Please read this book - you will enjoy it.  The other reviews here go on at great length.  Don't worry about it - I guarantee you will be taken aback, shocked and dismayed, but very entertained.I highly recommend this book."}, {"review_sentiment": 4.0, "review_text": "Balzac is at his best in this very witty tale about a devious old maid who schemes against her family in nineteenth-century France.  It's so much fun to watch the contemptible Bette manipulate everyone around her, and to follow her pathetic and ill-placed obsession for a certain young Polish character who marries her young, beautiful cousin. Everything fun is in this book-courtesans, lecherous old men, unfaithful young lovers, and of course, the virtuous, who get treated terribly and die abandoned and alone.  Wretched Bette dies loved and valued.  You will have a lot of fun reading this book and enjoying-and getting disgusted with-all the characters."}, {"review_sentiment": 5.0, "review_text": "*Cousin Bette*, or Part One of 'Poor Relations,' is considered to be Honore de Balzac's last great novel, the capstone on an oeuvre that spanned nearly a hundred novels.  The author had already begun to ail from overwork by the time of its composition (1846-1847), his methods of genius - sixteen-hour writing days, coupled with crushing \"motivational\" debt and a penchant for gallons of black coffee - exacting a toll of stress that would claim his life three years later.  But if the physical shell was failing, the instrument of the mind retained its strength and perception, as *Cousin Bette*, equal and in some ways superior to Balzac's other masterworks (*Lost Illusions*, *Pere Goirot*), gives ample testament.  Of the ten or so works I've read of this French master, this novel was the easiest to dive into and, overall, the most spellbinding and page-turning, no doubt influenced by the manner of its creation.For although Balzac had published a sixteen-volume set of The Human Comedy by the mid 1840's, he had not found the accolades his oeuvre so justly deserved; in fact, he stood in the shadow of Eugene Sue, at the time an enormously popular author who serialized his work in easy tidbits.  The serialization of novels had only come about recently, with Dickin's *Pickwick Papers* and Balzac's *The Old Maid* appearing first in 1836.  The catch, however, was that Balzac was not an author to chop up and present in segments: his novels work best as a slow, steady read, the tension and enjoyment arising through hundreds of devoured pages until climax and, usually, a pessimistic but realistic denouement.  Thus: Sue wrote for the serial; Balzac wrote for himself, and suffered accordingly.  The man's ego had to have taken a bruising:\"The present situation requires me to write two or three masterful works which will topple the false gods of this bastard literature, and which must demonstrate that I am younger, fresher, and greater writer than ever before!\"Vainglorious statements, perhaps, yet proven true by ink, sweat and the stench of unroasted coffee beans: Balzac set to work, composing *Cousin Pons* and *Cousin Bette* as the final duology of his vast sociology opus, emerging from the toil with a final masterpiece and a very good companion novel.  Moreover, *Bette* benefited greatly from the conformity to serialization, making it a rare and unique jewel upon the author's tiara.An experienced reader can spot the difference almost immediately.  In every other novel I've read of the Human Comedy, the first forty to fifty pages are usually devoted to detailing the histories of the main characters and the environments they exist in.  This helps to firmly delineate the particulars in the brain, and makes the resultant tragedy and sarcastic farce all the more potent - yet difficult, I would imagine, for serial readers to cope with.  In *Bette*, however, we are thrown into the action immediately with the arrival of self-made magnate Captain Crevel to the House of Baron Hulot.  Without preamble he relates to the Baron's wife, the long-suffering and almost intolerably virtuous Adeline Hulot de'Evry, that her husband has stolen his mistress and, as revenge, Crevel plans on making the Baroness his own mistress - tit for tat! To secure his claim, Crevel dangles the financial future of the Baroness' daughter over her head.  The heated tension of this scene plunges the reader into the meat of the novel without them really realizing it: within one chapter we encounter the stigmatizing standards of high society, the lecherous egos of middle-aged adventurers, the wiles of the courtesan and the depths human beings will sink to reach a personal desire, a feverish vendetta; themes developed continually as the novel progresses through its almost 500 pages of psychological examination and high-drama theatrics.  At the heart of it all, spinning her webs like a black widow, is the negative force of Cousin Bette, the plain-faced, masculine cousin of Baroness Adeline.  Slights of the past, and of the present, gnaw at Bette's heart; she will employ the tactics of Machiavelli to destroy her family and benefactors, at any cost.  A truly frightening creature, this Bette...and *almost* sympathetic, for the origin of her vengeance can be easily understood, if not forgiven.  Thus the genius of Balzac shines through, painting gray within the villainous portrait, defying the archetypes serials require, all the while fashioning a set of character-clichés that epitomize the genre, from the hooker with the heart of gold to that murderously unpredictable Brazilian...Yet Balzac had more on his mind than simple plot-dynamics. The introduction of the novel compares the twin passions of the Baron de'Evry (eternal skirt-chaser) and Cousin Bette (the spinster) with the Freudian concepts of eros and thanatos - one ever questing the physical act of love, and in that quest ruining all those who love and esteem him; and the other, twisted by the wrench of unrequited obsession, deliberately plotting a horrific revenge:\"(Introduction): Freud, in his later works, presented eros and thanatos [sic] as two sides of the same coin.  Almost a century earlier, Balzac had imagined them as two members of the same family.\"The best literature is timeless: modern readers can glean important lessons about life from the dusty pages of centuries-past.  Balzac is timeless.  He paints the French society in broad strokes, but never neglects the details; he tackles the essential quandaries and inconsistencies of human behavior with a sardonic - though never superior - tone.  *Cousin Bette*'s ending, wherein we discover that the leopard cannot change its spots, will all at once inspire anguished tears, astonished laughter and a knowing shake of the head.Highest Recommendation."}, {"review_sentiment": 5.0, "review_text": "When Balzac set out to describe the entirety of human emotion, occupation, education, society and mores in France he focused many of the novels on life in Paris.  While some may view this book as \"soap\", it nevertheless artfully describes the incredible social undercurrents, from the high to the low, within Parisian life in that time (1830's).  Rich, and aspiring rich men, really did keep courtesans and flaunted their trophies in the same way the rich do today.  Their wives often tacitly tolerated these relations even when their husbands displayed their girlfriends in public.  Men also came to Paris from the outlying areas to achieve success, fame and become wealthy.  Balzac writes vividly about all of this and frames the story within plots and subplots that are interesting and realistic. I hope you enjoy reading it."}, {"review_sentiment": 4.0, "review_text": "Balzac's brilliant commentary on the newly born French republic and the struggle for power underneath Napoleon as the old order was guillotined and enterprise had free reign is a marvellous expose of a society in flux. Opening with subtle alacrity the novo homo Monsieur Crevel pays a visit to his son-in-law's mother, the aristocratic Baroness Hulot d'Ervy to explain that his reason (as a tied member of their family now through her son) behind his hindrance of supplying the Baroness' daughter, Hortense, with financial surety is due to two reasons: The first due to the vast debts his son-in-law has run up which he must cover, the second, in an delightfully narrated scene of wickedly humorous selfishness, because the Baroness' husband (his libertine comrade-in-arms) has `stolen' away Monsieur Crevel's mistress, the now infamous singer, Josepha.Monsieur Crevel insists that he must have the Baroness himself to avenge himself on her husband and, if she agrees, he will act as financial surety for her daughter Hortense. So, in true Balzac style, in the space of a few pages, we have a marvellously huge dilemma for the cuckolded Baroness for whom, within this society, social standing is everything. It is this sense of stolen love, echoing Moliere whom Balzac constantly refers to, that permeates the novel of revenge that is Cousin Bette.What unfolds is a perfidy to subtle and over such a long period of time that its eventual terrible denouement is a tragic tale of requited love, treacherous money motivated mistresses and selflessly loving wives.Cousin Bette has saved from suicide one Wencelas Steinbock, a Polish refugee, and has secreted him away in her tiny home for a few months financially caring for him whilst he begins to exercise his professed enormous artistic talent. Eventually she leaks her secret to her niece, Hortense who promptly falls in love with Wencelas and steals him away to marry her. In the interim, Josepha spurns Baron Hulot, who promptly turns his attentions to Madame Marneffe who lives next door to Cousin Bette. It is with Madame Marneffe that Cousin Bette finds the terrible instrument of he revenge as she inserts her into the Hulot social circle, Baron Hulot taking up with her and his lavish spending on his innocent mistress driving then entire family to penury. Madame Marneffe then comes to an agreement with Crevel to become his mistress thus stealing her from Baron Hulot and gaining his revenge on Hulot's stealing of Josepha. In the meantime the bewitching Marneffe secures herself more and more money from the slavering old men whilst carrying on with her returned Brazilian lover. Cousin Bette then gets Wencelas to obtain a loan from Madame Marneffe, knowing full well that he would fall in love with her causing Hortense's misery (and her mother's) to be absolute. By midpoint of the novel the plot is well in motion, the Hulot family is torn apart through husbands betrayals, their money is gone, wasted on a treacherous mistress who holds them all her thrall. A better siren there could not be all the time controlled by the wicked Cousin Bette.Having reached the pinnacle of her revenge the tables begin to turn with further disgrace on Baron Hulot's part as he is founding guilty of defrauding the government in Algiers of two hundred thousand francs. His uncle and brother commit suicide and he is forced to hide in Paris (with Josepha's help). His brother's death, the Marshal, to whom Cousin Bette has secured a marriage - and hence an income - to means she begins to be revealed as a `sword of Damocles' over the Hulot family. Victorin Hulot, the son, commences to rebuild the family fortunes. Determined to restore the family fortune, Victorin sanctions the downfall of Madame Marneffe and her new husband, Crevel, through the enigmatic Madame Nourrison firstly through revealing her relationship with Crevel to Baron Montes whose rage knows no bounds, then lastly through a debilitating disease that claims the life of the Mayor and his lover. As Cousin Bette watches her evil mechinations fall apart with the death of her instrument of despair and then with Victorin restoring the family fortunes and the prodigal father's return she eventually dies, though not without some minor satisfaction at their mourning of her passing.This is probably Balzac's most accomplished novel, a story of jealousy and envy spiralling into bitterness and a perfidious desire. Cousin Bette invents multiple reasons to hate her Hulot family and unerring hits the week points of their personalities in an attempt to ruin them and thence be seen as their saviour. The insatiably wandering eye of Baron Hulot, the vainglorious ineptitude of Wencelas, coupled with their wives who seek to retain the family dignity bring this once proud family to their knees until the son realises that by simply revealing the truths behind the lies will break apart Cousin Bette's tenuous web of despair and set them on the road to happiness again. Halfway through there is a pointed aside as Balzac gives his definition of what creates a great artist - namely hard work and fires a single shot across this reviewer by aptly pointing out that those who cannot themselves achieve greatness in their art end up being a critic of those who can. Still...this is one Balzac novel that is well worth the time."}]}, "authors": ["Honoré de Balzac"], "isbn": "0199553947", "longitude": 2.3514992, "periods": ["1800s"], "title": "Cousin Bette", "word_cloud": "part problem undoubtedly translation even write craft progress last year soap opera plot seem grind second half particularly try plot full hole also lot sloppiness instance forget age assign earlier space paragraph go even year pass cry edit wanders especially lose interest interminable second half scene brazilian find particularly bad comment remark list money meant impress force last hundred page surprise end unexpected famous heard man clutch servant girl promise make baroness long see lie problem translation suspect write earlier quit bit better beware much later truly terrible also author league sophisticate particularly certain novel bad translation say kill never popular english sphere else think problem sophistication average increase dramatically money often serial format reader today much sophisticated author also infinitely sophisticated stupid part show ignorance world keep remind discover year enjoy critique taste art versus bad art also shallow well smart eh star muster thing instead depiction life bourgeoisie economic strive acute income disparity amuse social commentary rather psychological exploration stop read first half realize frequency mention specific sum money amuse exasperate find page row cite franc franc franc hefty sum dowry loan debts cost furnishing etc adultery also tiresomely repeat implausible plot solely concerned money philander far realism indeed stall level mere soap opera ever novelist write money persistently remember cash also main character better lose illusion weary bid adieu many memorable quote many plot terribly complicate worth guess people a lot time hand spend reading long go material tape little longish dull doubt able hard copy form give however thanks tape able stick poor fellow victim debt even penury bio never make much money write sorry hear innumerable mention financial plight character debts go debt mortgage house borrow money threat debtor prison arrest imminent so think financial problem problem seem minuscule compare character read long patient get bore easily first give star felt sorry raise suppose gauge opinion actually well write give try find a lot enjoy learn life first part courtesan sound interest tell wife much fun great invite dinner review go great length worry guarantee take aback shocked dismay highly best witty tale devious old maid scheme family much fun watch contemptible manipulate everyone follow pathetic obsession certain young polish character marries young beautiful fun lecherous old men unfaithful young lover course virtuous get treat terribly die abandon alone die love lot fun read get disgusted character part consider last great capstone oeuvre span nearly hundred author already begin ail overwork time composition method genius write day couple crush motivational debt penchant gallon black coffee exact toll stress life year later physical shell fail instrument mind retain strength perception equal way superior masterworks give ample testament ten work french master easiest dive overall spellbind doubt influence manner publish mid find accolade oeuvre justly deserve fact stand shadow time enormously popular author serialize work easy tidbits serialization novel come recently appear first catch however author chop present segment novel work best slow steady tension enjoyment arise hundred devour page climax usually pessimistic realistic denouement write serial write suffer accordingly man ego take bruise present situation require write masterful work topple false god bastard literature younger fresher greater writer ever vainglorious statement perhaps yet prove true ink sweat stench roasted coffee bean set work compose final duo logy vast sociology emerge toil final masterpiece good companion moreover benefit greatly conformity serialization make rare unique jewel author experience spot difference almost immediately first forty fifty page usually devote detail history main character environment exist help firmly delineate particular brain make resultant tragedy sarcastic farce potent yet difficult serial reader cope however thrown action immediately arrival magnate preamble relates wife almost intolerably virtuous husband steal mistress revenge plan make mistress tit tat claim dangle financial future daughter head heated tension scene plunge meat really realize chapter encounter stigmatize standard high society lecherous ego adventurer wile courtesan depth human being sink reach personal desire feverish vendetta theme develop continually progress almost page psychological examination theatrics heart spin web black widow negative force masculine present gnaw heart employ tactic destroy family benefactor cost truly frightening creature sympathetic origin vengeance easily understand forgiven genius shine paint gray villainous portrait defy archetype serial require fashion set epitomize genre hooker heart gold murderously unpredictable brazilian mind simple introduction compare twin passion eternal spinster concepts thanatos ever quest physical act quest ruin love esteem twist wrench unrequited obsession deliberately plot horrific revenge later work present ore thanatos sic side coin almost century earlier imagine member family best literature timeless modern reader glean important lesson life dusty page timeless paint french society broad stroke never neglect detail tackle essential quandary inconsistency human behavior sardonic never superior tone end wherein discover leopard change spot inspire anguished tear astonish laughter know recommendation set entirety human emotion occupation education society more focus many novel life soap nevertheless artfully describe incredible social undercurrent high low parisian life time aspire rich men really courtesan flaunted trophy way rich today wife often tacitly tolerate relation even husband display girlfriend public also come outlying area achieve success fame become wealthy write vividly frame story plot subplots interest realistic hope read brilliant commentary newly bear republic struggle power old order guillotine enterprise free reign marvelous expose society flux subtle alacrity nova homo pay visit mother aristocratic explain reason tie member family son hindrance supply daughter financial surety due reason first due vast debt second delightfully narrated scene wickedly humorous selfishness husband libertine away mistress infamous singer revel insists avenge husband agree act financial surety daughter true style space page marvelously huge dilemma cuckold society social stand everything sense steal echo constantly refer permeates revenge unfolds perfidy subtle long period time eventual terrible denouement tragic tale requite love treacherous money motivate mistresses selflessly love save suicide refugee secrete away tiny home month financially care whilst begin exercise profess enormous artistic talent leak secret niece promptly fall love steal marry interim spurn promptly turn attention live next door find terrible instrument revenge insert social circle take lavish spending innocent mistress drive entire family penury come agreement become mistress thus steal gain revenge steal meantime bewitching secure money slaver old men whilst carry return brazilian lover get loan know full well cause misery mother absolute midpoint plot well motion family tear apart husband betrayal money go waste treacherous mistress hold better siren time control wicked reach pinnacle revenge table begin disgrace part found guilty defraud government hundred franc uncle brother commit suicide force hide brother death secure marriage hence income mean begin reveal family son commences rebuild family fortune determine restore family fortune sanction downfall new husband enigmatic firstly reveal relationship rage know bound lastly debilitate disease claim life lover watch evil machination fall apart death instrument despair restore family fortune father eventually die minor satisfaction mourn probably accomplish story jealousy envy spiral bitterness perfidious desire invent multiple reason hate family unerring hit week point personality attempt ruin thence see insatiably wander eye vainglorious ineptitude couple wife seek retain family dignity bring proud family knee son reality simply reveal truth lie break apart tenuous web despair set road happiness point aside give definition create great artist namely hard work fire single shot reviewer aptly point greatness art end critic still well worth time", "genres": ["Fiction & Literature"], "summary": "Cousin Bette (1846) is considered to be Balzac's last great novel, and a key work in his Human Comedy. Set in the Paris of the 1830s and 1840s, it is a complex tale of the devastating effect of violent jealousy and sexual passion.\r\n\r\nAgainst a meticulously detailed backdrop of a post-Napoleonic France struggling with massive industrial and economic change, Balzac's characters span many classes of society, from impoverished workers and wealthy courtesans to successful businessmen and official dignitaries.\r\n\r\nThe tragic outcome of the novel is relieved by occasional flashes of ironic comedy and the emergence of a younger generation which has come to terms with the new political and economic climate.", "asin": "0199553947", "rank": "963589", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41evCd5h6CL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}