{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 16, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "My first Zola book of the Les Rougon-Macquart series.  It is sad and the characters are well developed. I knew after reading this, that I had to read the other 19 books.  I am not disappointed."}, {"review_sentiment": 5.0, "review_text": "I honestly couldn't put this book down. Once you start reading Zola you are forever hooked!"}, {"review_sentiment": 5.0, "review_text": "very good and well written book."}, {"review_sentiment": 2.0, "review_text": "The characters in this novel are very poorly delineated. Too many cliches. I found after about a hundred pages that I didn't really care what happened to anyone. It was obvious that things were going to turn out badly, so I simply stopped reading."}, {"review_sentiment": 5.0, "review_text": "I read this novel in college, and I became a devoted fan of Emile Zola. This tragic story is all too real for thousands of people all over the world."}, {"review_sentiment": 5.0, "review_text": "Thank Goodness for Classics!  I read a lot - A LOT! I read everything new and interesting and popular and I take time to delve into obscure stuff and I love re-reading classics. (Just re-read Heart of Darkness/killed me with the beautiful writing.) But I hadn't read any Zola and I will be spending some considerable time and effort to do so in the future. It had been a long time since I literally couldn't put a book down. So INTERESTING, so heartbreaking, so detailed. I can't wait to dive into more of Zola's work. If it's been a long time since you adored a book, this is a book worth adoring. Is is easy? No. Is it predictable? No. Is it amazing? Certainmoi!"}, {"review_sentiment": 5.0, "review_text": "Can't go wrong with Zola. However, I was disappointed because I thought it was he French version and it was not. The title should not have been the French one but the translation. That led to the confusion."}, {"review_sentiment": 5.0, "review_text": "a great book by a great author, a must to have"}, {"review_sentiment": 5.0, "review_text": "Zola's masterpiece! The attention to detail about mid-19th century Paris is as much a historical textbook as it is a human comedy/melodrama."}, {"review_sentiment": 2.0, "review_text": "After decades of considering myself well read in fiction, this is surprisingly my first Zola novel.  I have liked the idea of Zola for years.  But finally having picked up an English translation of L'Assommoir, I am a bit disappointed - but in the end not surprised. First I should say, I read Arthur Symons's translation which was simply abominable. \"Bad\" doesn't begin to describe how dreadful it was. I do not know if this is a function of an attempt to write in colloquial English the colloquial working class Parisian French of the book, but the result is an at-times incomprehensible text that contains idioms, expressions and turns of phrase that are obscure and sometimes completely undecipherable.  And this is not just the direct dialogue of characters - the narrator also indulges in this strange way of speaking, which makes me wonder if the problem was with Symons.  If you have a choice between reading Symons's translation or not reading it at all, don't read it.  Its that bad.  I plan very soon to give this book a second chance either in French or in Margaret Mauldon's translation soon.Despite the translation problems, there is something fundamentally wrong about Zola's Assommoir which leaves me disappointed.  It is true that Zola is a masterful descriptive writer. Whoever coined the old cliche \"Show not tell\" no doubt had Zola's prose in mind as an example to follow.  His descriptions of daily life in Paris during the end of the Second Republic and the Second French Empire are sublime in their sensory (especially visual) depth and detail.  He paints an almost cinematographic picture of life.But the fundamentals of this narrative are atrocious.  Characters are shallow, behave in ways that are illogical or do not make any sense.  There is very little in the way of giving readers a feeling of understanding why characters behave as they do. I always say that to understand human action, you need to see human motives the way the actors see their own motives - even the most irrational behaviors can look perfectly sensible when viewed from the agent's own point of view.  But this is almost impossible to do with these characters.  There is almost no basis for a reader to find answers to simple questions like \"why did the character do/say that?\"  They come across continuously as unpredictable and I found myself even after spending more than 200 pages with these characters trying to understand why they did what they did or predict what they would do in the next situation. With Zola you only see the actions and the consequences, never the logic and complex dance of motives going into the actions (except in the basest, simplest terms, like \"she felt jealous\" or \"she felt like she had nothing to lose\".the overall spirit of the book comes across today as \"a portrait of the working classes as looked down upon from the nose of a bourgeois observer.\" It is easy to see why this book was a commercial success in its day.  It satisfied and confirmed what bourgeois readers already wanted to believe about the city's lower class: that poor people were poor because they chose to be poor, were unwilling to make the right choices in life, and deserved the lot the received in life.  Strangely I don't think this was Zola's intent, but his was just as problematic. As I understand it, Zola's intent was to demonstrate (\"prove experimentally\" I think was his way of putting it) that people have inherent, pre-determined, unchangeable qualities of character which, when placed in a particular milieu will yield a particular, predictable result.  In this case, Gervaise Macquart, because of her deep-seated tendency to want to make everyone happy, sense of conformism and lack of ambition, and uncontrolled predilection for gluttony and self indulgence, when thrust into the tough streets of working class Paris, has only one logical path to follow. It is the lawlike interaction of heredity and environment that Zola would claim merely to bear witness to and document.  In that sense, then, Zola felt no need to develop 3 dimensional character motives - Gervaise has about as much chance of surviving her milieu, given her pre-established character, as a mouse has when tossed into the sea.But that is why this book, when read in 2013, feels so weak. There is no humanity in there. Only cliches and stereotypes of the bourgeois about the working classes.  I found myself not caring about these characters about half way through the book because they didn't even seem like people - just algebraic placeholders of a pre-determined plot pattern, on top of which Zola slapped layers and layers of thick local content description to make his formula seem more \"life like\". But in the end it is just a book about a handful of people with unchanging, unchangeable pre-dispositions to behave in certain self destructive or morally repugnant ways which are thrust into an environment that enables and encourages those behavioral predispositions and prevents any counter-veiling behavioral checks and controls from preventing the inevitable \"tragic\" downfall and collapse. \"Tragic\" is in quotes because there is nothing tragic unless the fallen give us a sense of their humanity, a sense that they had free will, aspired to rise to something more than they or we could imagine, only to fail and fall back to the Earth. That would be tragic. In this case, it is just so many degenerate, flawed, wasted masses of humanity working away at the bottoms of the economic ladder, perpetuating their own failures with no hope of ever becoming more than they are. An easy view from the warm, comfortable apartment windows of the Bourgeoisie in Paris' Third Republic."}]}, "authors": ["Emile Zola"], "isbn": "0199538689", "longitude": 2.3514992, "periods": ["1800s"], "title": "L'Assommoir", "word_cloud": "first series sad character well develop know read disappoint honestly start read forever hook good well write character poorly delineate many cliche find hundred page really happen anyone obvious thing go turn badly simply stop read college become devoted fan tragic story real thousand people world lot everything new interesting popular take time delve obscure stuff love classic beautiful writing zola spend considerable time effort future long time literally so interesting heartbreaking detailed dive work long time adore adore easy predictable amaze go wrong however disappoint think french version title french translation lead confusion great great author masterpiece attention detail century much historical textbook human decade consider well fiction surprisingly first like idea year finally pick english translation bite disappointed end surprise say translation simply abominable begin describe dreadful know function attempt write colloquial colloquial work class result incomprehensible text contain idiom expression turn phrase obscure sometimes completely undecipherable direct dialogue character narrator also indulge strange way speaking make wonder problem choice reading translation read bad plan soon give second chance french translation translation problem something fundamentally wrong leave disappoint true masterful descriptive writer coin old cliche tell doubt prose mind example description daily life end sublime sensory especially visual depth detail paint almost cinematographic picture fundamental narrative atrocious character shallow behave way illogical make sense little way give reader feel understanding character behave always say understand human action human motif way actor see motif even irrational behavior look perfectly sensible view agent point view almost impossible character almost basis find answer simple question character come continuously unpredictable find even spend page character try understand predict situation see action consequence never logic complex dance motif go action basest simplest term felt jealous felt nothing lose overall spirit come today portrait work class look nose bourgeois easy commercial success day satisfy confirm bourgeois reader already want believe city lower class poor people poor chose poor unwilling make right choice life deserve lot receive life strangely think intent problematic understand intent demonstrate experimentally think way put people inherent unchangeable quality character place particular milieu yield particular predictable result case tendency want everyone happy sense conformism lack ambition uncontrolled predilection gluttony self indulgence thrust tough street work class logical path law like interaction heredity environment merely bear witness document sense felt dimensional character motif gervaise much chance survive give character mouse toss feel weak humanity only cliches stereotype work class find care character way even seem people algebraic placeholder plot pattern top slap layer layer thick local content description make formula seem life handful people unchanging unchangeable behave certain self destructive morally repugnant way thrust environment enables encourage behavioral predisposition prevents behavioral check control prevent inevitable tragic downfall collapse quote nothing tragic fall give sense humanity sense free aspire rise something fall back case many degenerate flaw wasted mass humanity work away bottom economic ladder perpetuate failure hope ever become easy view warm comfortable apartment window", "genres": ["Fiction & Literature"], "summary": "The seventh novel in the Rougon-Macquart cycle, L'Assommoir (1877) is the story of a woman's struggle for happiness in working-class Paris. At the center of the story stands Gervaise, who starts her own laundry and for a time makes a success of it. But her husband soon squanders her earnings in the Assommoir, a local drinking spot, and gradually the pair sink into poverty and squalor.. \r\n\r\nL'Assommoir was a contemporary bestseller, outraged conservative critics, and launched a passionate debate about the legitimate scope of modern literature. This new translation captures not only the brutality but the pathos of its characters' lives.", "asin": "0199538689", "rank": "165581", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51R4M7DQChL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}