{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 7, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "One of the world's great authors kicked off his real career with two gripping novels: this one and \"Eugénie Grandet\".  Though it contains much 19th century melodrama and Balzac could not resist lecturing readers on life's travails and he included many of those romantic soliloquies so favored in his times, PERE GORIOT introduces us to the Paris of that period (early 19th century) with all its color and sordid social niceties.  A mock headline could read \"Balzac to Readers: Paris is a Pit of Passion\".  As in several other Balzac novels, the title character is not necessarily the main one.  In this case, the author describes the ups and downs of an ambitious youth from the sticks, Eugene de Rastignac, as he makes his way into high society, seeking his fortune.  Social climbing and grabbing the attention of materialistic, idle society engrosses the lad.  He learns that the clothes and carriage make the man, that whom you know is everything, and the right invitations are a must.  Pere Goriot is a retired pasta maker living in the same boarding house where everyone is under the thumb of the penny-pinching, nosy Madame Vauquer.  The old man has two daughters who have married into the Parisian upper crust and are now ashamed of their humble origins.  As Rastignac slowly discovers, through his involvement with both daughters, their father is a martyr to his own children.  They manage to squander his immense fortune while shunning him completely.  An interesting combination of romanticism and cynicism like many of Balzac's novels, PERE GORIOT explores the different sides of passion or \"loves\"---Pere Goriot's love of his children, Vautrin (a jovial but wily, powerful criminal boss) and his love of power, and many characters' love of money, style and social position.  Balzac, as usual, lovingly describes the many aspects of annuities, stock transfers, bonds, and landed estates, on the realistic grounds that money was the focus of French society at the time.  A few people in the story actually love those with whom they are involved, but such individuals are rare.  It's not a Harlequin romance after all !  The novel provides a number of unexpected twists and turns and some very clever dialogues.  PERE GORIOT is one of the best novels in Balzac's vast series of books in which he attempted to describe French society in his times.  If you have never read Balzac, you should remedy that situation forthwith; he is certainly one of the greatest novelists who ever lived."}, {"review_sentiment": 5.0, "review_text": "fine book .Balzac clearly was familiar with King L:ear."}, {"review_sentiment": 5.0, "review_text": "Totally engaging."}, {"review_sentiment": 5.0, "review_text": "When a book has nothing but five-star reviews, as this one does, you might want to take note and order it and read it right away! This was among the top 5 books I have ever read. And I've read sooooooooooooo many books, married to Lit Prof. This book is so old that it seems to have been forgotten or shoved to the back of the stacks. This is a terrible shame, that people would miss a book of this magnitude. I only found it because I bought Harvard Classics of Literature (I own the 5-shelf hard copy of the Harvard Classics but never thought to actually READ them. Duh on me). But I didn't know they had a grouping of just Novels and poems, for Kindle. So I got it for free, I think? And the whole collection of all the novels was 500,000 pages. Gulp. But I thought, well I will be in no rush and just read along. OMG! OMG! IN SO DOING, I FOUND BOOKS that I doubt one would find anywhere else! I wanted to run in the streets and yell, \"Everyone! Read these obscure novels!\" But among them, I found the Hope Diamond of novels: Goirot by Balzac. Knew nothing of Balzac. Read his bio. Then I realized that Goirot is a true story of the struggle with morals in a young man in Paris early 1800s, who is so poor and wants to be so rich. (No spoilers, I promise). When a writer of Balzac's genius writes from life, you have hit a gold mine. The details are so stunning every inch of the way, because drawn from life, could never be thought up. The characters all were real people, and as unique as real people are. Within seconds of reading, you will never put this book down. My life came to a complete halt after I only half-interestedly started reading. OMG OMG. If I had missed this book, it would have been an actual tragedy. The only thing I could find the slightest fault with (and it is a thriller, shocker, surprise and twist-filled plot!) was in the last part, very last part. It got a little stretched out, what happened there (being 100% cautious not to spoil. Read on, safely), because the book was serialized and you know they have to stretch it out at the end a bit. But it was still detailed and commanding, and tho I confess to a little skimming, it returned to the ULTIMATE DILEMMA and CHOICE OF MORAL ROUTES BY THE HERO. You will be in another world as you watch the hero (WHO IS BALZAC, HIMSELF,, IN AUTOBIO FORM!) make that choice, and I doubt that you will guess what the hero will do. If I can beg, I BEG YOU TO READ THIS BOOK. And please, if it earns 5 stars (OH IT DOES!) please give it 5. To give it 4, it will never show 5 again, but only 4.5. If we can keep it at 5, more people will read it, and we will have done those people the favor of a lifetime. I plan to read this book many, many, many more times. PLEASE READ IT! -- Bethie"}, {"review_sentiment": 5.0, "review_text": "This is a very tender story and extremely well written."}, {"review_sentiment": 5.0, "review_text": "Enlightenting, with depth of understanding of human motivations, aspirations and acts of implimantation or restrain from. Such a discovery of wealth when dealving into the socioeconomicpolitical universe of that century.  A must to understanding the century and especially French Society and probably the evolution, if any, into the twenty first century of the western world."}, {"review_sentiment": 5.0, "review_text": "When you're trying to educate yourself without the service of an academic advisor, you still need something to point you in a profitable direction.  Sixty years ago I was groping around for a reading regimen and one book on the subject (I don't remember the title) declared that although Tolstoy's War and Peace was \"the world's greatest novel,\" Balzac (1799-1850) was \"the world's greatest novelist.\"  OK.  I went ahead and spent a couple years reading Tolstoy but I never got round to Balzac.  That is, until quite recently.It was David Harvey who woke me up.  In the introduction to his Companion to Marx's Capital (Verso, 2010) he said that Marx was a great admirer of Balzac and had the ambition to some day write a full study of la Comedie humaine.  Unfortunately for people who love classic novels, Marx never finished his work on Capital and so was never able to get seriously into his great love of French literature!  Harvey hadn't read much Balzac but he said that later, when reading one of his novels, \"I found myself often saying, 'Ah, that's where Marx got it from!'\"Its hard to know where to start with Balzac, but I picked up the Oxford World Classics edition of Pere Goriot (1834), probably the most widely read of his books.  It's a bit formidable for someone like myself who seldom reads novels and likes things short and simple.  Balzac's paragraphs in Pere Goriot often run to 800 words and his chapters to 75 or 80 pages.  Not a good format for my short attention span, but when I finally mustered the courage to begin, I soon saw why he ranks so high among the world's writers.Balzac quickly draws you into the world of a rundown, flea-bitten boarding house and its inmates, and on into their lives and relations with each other and early nineteenth century Paris.  What drove those lives is a principle theme of the book, and that theme is money.  From the translator's introduction, it is the humiliation of having too little, the obsession with acquiring more, and the moral bankruptcy of a society that defines all human relations in its terms.  I hadn't turned many pages before it was clear to me why Marx had been so fond of Balzac.Near the beginning of the book Balzac says, \"let me tell you, this drama is not fiction or romance, all is true.  It is so true,\" he continued, \"that everyone can recognize its elements in his own circle, perhaps in his own heart.\"  That's what novels are about, aren't they?  To make us recognize the truth of things?  This one does it."}]}, "authors": ["Honoré de Balzac"], "isbn": "0199538751", "longitude": 2.3514992, "periods": ["1800s"], "title": "Pere Goriot", "word_cloud": "world great author kick real career gripping novel contain much century melodrama lecture reader life travail include many romantic soliloquy favor time introduce period early century color sordid social nicety mock headline several novel title character necessarily main case author describe ups down ambitious youth stick make way high society seek fortune climb grab attention materialistic idle society engross learn clothes carriage make man know everything right invitation retired pasta maker live board house everyone thumb nosy old man daughter marry parisian upper crust ashamed humble origin slowly discovers involvement daughter father martyr child manage squander immense fortune shun completely interesting combination romanticism cynicism many novel explore different side passion love love child jovial wily powerful criminal bos love power many character love money style social position usual lovingly describe many aspect annuity stock transfer bond land estate realistic ground money focus french society time people story actually love involved individual rare provide number unexpected twist turn clever dialogue best novel vast series attempt describe french society time never remedy situation forthwith certainly greatest novelist ever live fine clearly familiar ear totally engage nothing review note order right away top ever sooooooooooooo many married old seem forget shove back stack terrible shame people magnitude find buy hard copy never think actually know group poem get free think whole collection novel page think well rush along find doubt anywhere else want run street yell read obscure novel find novel nothing then realize true story struggle moral young man early poor want rich spoiler promise writer genius write life hit gold mine detail stun inch way draw life never character real people unique real people second read never put life come complete halt start read miss actual thing slightest fault thriller shocker surprise plot last part last part get little stretched happen cautious spoil safely serialize know stretch end bit still detail command tho confess little skimming return world watch hero be make choice doubt guess hero beg earn star never keep people do people favor lifetime plan many many many time tender story extremely well write enlighten depth understand human motivation aspiration act implantation such discovery wealth deal socioeconomic political universe century understanding century especially french probably evolution twenty first century western world try educate service academic advisory still something point profitable direction year ago grope read regimen subject remember title declare world greatest world greatest novelist ok go ahead spent couple year read never get round quite wake introduction say great admirer ambition day full study la humane unfortunately people love classic novel never finish work capital never able get seriously great love french literature much say later read novel find often say get hard know start pick edition probably widely bite formidable someone seldom read novel like thing short simple paragraph often run word chapter page not good format short attention span finally muster courage begin soon saw rank high world quickly draw world rundown board house inmates live relation early nineteenth century drive live principle theme theme money translator introduction humiliation little obsession acquire moral bankruptcy society define human relation term turn many page clear fond begin say fiction romance true true continue everyone recognize element circle perhaps heart novels truth thing", "genres": ["Fiction & Literature"], "summary": "This fine example of the French realist novel contrasts the social progress of an impoverished but ambitious aristocrat with the tale of a father, whose obsessive love for his daughters leads to his personal and financial ruin.\r\n", "asin": "0199538751", "rank": "247148", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51a8uksC1vL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}