{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 7, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "A classic"}, {"review_sentiment": 4.0, "review_text": "Good, Just as described!"}, {"review_sentiment": 5.0, "review_text": "Abbey Prevost basically wrote a memoir of his own life, about a young man ruined and changed by his pursuit of a beautiful woman beneath his caste caste. The writing is exceptionally clear and lyrical and fast paced. A great read highly recommended."}, {"review_sentiment": 4.0, "review_text": "A young idiot besotted by love is hardly new literary territory, and Abbe Prevost isn't enough of a stylist to make you feel much sympathy for his protagonist.  The plot is neither inventive, nor intriguing.  However, this is a very worthwhile yarn because it is an unaffected glimpse into 18th century social mores, and conventions.  Though it doesn't intend to skewer the nearly unlimited powers of the aristocracy over the other classes, it does so.  The protagonist, and his lover, are pawns in a game they cannot win, and in that they gain at least a modicum of sympathy from readers. Manon's harsh sentence is a further indictment of a society which practiced a Christian version of Sharia Law.  So as a period piece, it is fun to learn what society was really like at the time. The book is also entertaining when considered as a \"roman a cles\".... how much of the tale is based on Prevost's own experiences?  Finally, the book scores some points when we, the readers, reflect on how much, in our own lives, we were like these foolish lovers! Mirror, mirror on the wall... : )"}, {"review_sentiment": 5.0, "review_text": "A chaste, handsome, and wealthy young man on his way home after finishing his first courses of a formal education, met the demon of love, Manon.The evil temptress draws him into her web of deceit by exhibiting a demure, shy, and vulnerable presence that is housed in a lovely, slight frame.He experiences all of the humiliation and pain that being in love with an unchaste, unethical person can bring to a trusting boy.I love the way that Jesuit trained Prevost uses words to bring the reader into the story and describe the complete destruction of the psyche of a young boy who had been so adored and protected by his father."}, {"review_sentiment": 4.0, "review_text": "The book is a classic, and I had it on my reading list at the university this year. If you are studying, you will be happy to hear that this edition comes with a long and thorough introduction, that is very much worth reading! It helped me a lot, and it's the main reason why I ended up choosing this book on my final exam!However, the digital version (the Kindle edition) could be better. When I read the samle I was impressed that all the notes in the introduction worked so well, (they are mostly source references), and therefore I assumed that the explanatory notes in the rest of the book also would be accessible at a click, but they are not.I'm hoping that the edition will be updated and the that the notes will be made more accessible. However, in the meantime I'll provide some help: The explanatory notes for the novel are at location 2533. It is a bit bothersome to flip back and forth but it can be done, especially if you bookmark it to begin with, before starting to read."}, {"review_sentiment": 5.0, "review_text": "\"Manon Lescaut\" is a novel where the hero is a scoundrel, and the heroine is a harlot.  But this realization comes slowly.  And it is a difficult realization for the reader, like when we begin a relationship with someone we greatly respect, only to discover their bad qualities later.  The disappointment that comes from losing respect for them is much like the disappointment the reader feels for the characters of this 18th century novel by Antoine François Prévost (or Abbé Prevost); although  our discovery only makes the characters more multi-dimensional and compelling.  While we first meet the teenage Manon as the \"innocent,\" \"angelic\" and \"most beautiful of all the world's creatures\" who is awaiting her entrance into a nunnery, we slowly find out through the account narrated to us by her boyfriend, Le Chevalier Des Grieux, that she is little more than an angel-faced harlot who cannot restrain herself from sleeping with older men for the money, gifts and affection they provide.  The couple's adventures take a  picaresque ride from Paris to the provinces, to colonial New Orleans as the couple lies, cheats and steals their way to fortune, to poverty, back to fortune, back to poverty, to prison, as so forth...  Des Grieux begins the story in seminary school, and leaves the holy life to become a cheat and a gambler, in hopes of earning the fortune that his expensive girlfriend would require to be faithful.  The fatal flaw of Manon that leads to tragedy is this: she loves pleasure, and if her young boyfriend doesn't obtain it for her, she will find a sponsor who will.  The fatal flaw of Des Grieux is that he loves Manon and will do anything to keep her faithful.  The events in the novel resemble the scandalous adventures of their author.  Abbé Prevost lived a life of travel.  He was religious novice who abandoned the church several times, for one reason or another (to become a professional soldier, to work in publishing, to get thrown in jail, etc.).  He had a relationship with a courtesan in Holland, which may have been the model for this story.  He wrote this book called \"L'Histoire du chevalier Des Grieux et de Manon Lescaut\" and tried to smuggle copies into France, but it was caught at customs and refused entry.  The book has since had an enormous influence on French literature, and the literature of the Western world.  Most critics put forth that Manon doesn't want to cheat, but that her love of pleasure forces her to, when  her young boyfriend cannot afford to give her what she desires.  I would put forth that Manon actually wants to cheat on Des Grieux, or at least, she has opposing wills within herself. First of all, she never asked for the relationship with Des Grieux.  He came to her rescue when she was waiting to be condemned to a nunnery and he literally saved her.  Then he astounded her with his perfect, unconditional, Christ-like love.  Women, however, often fall for the bad boy, leaving the meek nice-guy behind.  What Manon is uniting with in her affairs with wealthy, lecherous older men, is the corrupt masculine figure--while she leaves her weaker caregiver at home.  The relationship is doomed from the beginning as Manon's nature doesn't correspond to her lover's vision of her. Des Grieux believes the face of an angel must possess the soul of an angel.  We are reminded of Myshkin and Nastasia Fillipovna in Dostoevsky's \"The Idiot.\"  Alexander Dumas Fils works \"Manon Lescaut\" into the plot his novel \"La Dame aux Camelias,\" which tells the story of another innocent-looking courtesan.  The ending is powerful, so I won't give it away, and reading the book, you will form your own idea of how much Manon loves Des Grieux.  If you like \"Manon Lescaut,\" you will probably also be interested in \"Atala\" by Chateaubriand; \"Paul et Virginie\" by Bernardin de Saint-Pierre; \"Carmen\" by Prosper Mérimée; and \"Rooftop Soliloquy\" by Roman Payne."}]}, "authors": ["Abbé Prévost"], "isbn": "0199554927", "longitude": -90.0701156, "periods": ["1700s"], "title": "Manon Lescaut (Oxford World's Classics)", "word_cloud": "classic good described basically write memoir life young man ruin change pursuit beautiful woman beneath caste caste write exceptionally clear lyrical fast pace great highly recommend young idiot besotted love hardly new literary territory enough stylist make much sympathy protagonist plot inventive intriguing however worthwhile yarn unaffected glimpse century social more convention intend skewer nearly unlimited power aristocracy class protagonist lover pawn game win gain least modicum sympathy reader harsh sentence indictment society practice christian version period piece fun learn society really like time also entertaining consider roman clue much base experience finally score point reader reflect much life foolish lover mirror wall chaste handsome wealthy young man way home finishing first course formal education meet demon evil temptress draw web deceit exhibit demure shy vulnerable presence house lovely slight experience humiliation pain unchaste unethical person bring trust love way train us word bring story describe complete destruction psyche young boy adore protect father classic read list university year study happy hear edition come long thorough introduction much read help lot main reason end choose final exam however digital version edition same impressed note introduction work well mostly source reference therefore assume explanatory note rest also click hop edition update note make accessible however meantime provide explanatory note location bite bothersome flip back forth do especially bookmark begin start hero scoundrel heroine harlot realization come slowly difficult realization begin relationship someone greatly respect discover bad quality later disappointment come lose respect much disappointment feel character century discovery make character compel first meet teenage innocent angelic beautiful world creature await entrance nunnery slowly find account narrate little harlot restrain sleep older men money gift affection couple adventure take picaresque ride provinces colonial couple lie cheat steal way fortune poverty back fortune poverty prison forth begin story seminary school leave holy life become cheat gambler hope earn fortune expensive girlfriend faithful fatal flaw lead tragedy love pleasure young boyfriend find sponsor fatal flaw love anything event resemble scandalous adventure author live life travel religious novice abandon church several time reason become professional soldier work publish thrown jail relationship courtesan story write call dew chevalier try smuggle copy catch custom refuse entry enormous influence french literature literature western world most critic put want cheat love pleasure force young boyfriend afford desire forth actually want cheat least oppose will never ask relationship come rescue wait condemned nunnery literally save then astound perfect unconditional love however often fall bad boy leave meek unite affair wealthy lecherous older men corrupt masculine figure leave weaker caregiver home relationship doom begin nature correspond lover vision believe face angel soul remind work plot aux tell story courtesan end powerful read form idea much love probably also interested", "genres": ["Fiction & Literature"], "summary": "\"The sweetness of her glance, or rather my evil star already in its ascendant and drawing me to my ruin, did not allow me to hesitate for a moment.\"\r\n\r\nSo begins the story of Manon Lescaut, a tale of passion and betrayal, of delinquency and misalliance, which moves from early eighteenth-century Paris--with its theatres, assemblies, and gaming-houses-via prison and deportation to a tragic denouement in the treeless wastes of Louisiana. \r\n\r\nIt is one of the great love stories, and also one of the most enigmatic: how reliable a witness is Des Grieux, Manon's lover, whose tale he narrates? Is Manon a thief and a whore, the image of love itself, or a thoroughly modern woman? Prévost is careful to leave the ambiguities unresolved, and to lay bare the disorders of passion.", "asin": "0199554927", "rank": "659277", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/510Xn%2BPfK9L.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}