{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 45.7578137, "ratings": {"num_ratings": 28, "rating": 3.5, "reviews": [{"review_sentiment": 1.0, "review_text": "More Child abuse"}, {"review_sentiment": 4.0, "review_text": "I had to read this book for a college course and it was extremely graphic. It is very much about Justine's misfortunes with sexual abuse, public ridicule, kidnapping, and imprisonment. If you do not know much about Marquis de Sade, please research before you embark on this terrorizing adventure."}, {"review_sentiment": 5.0, "review_text": "I have read both 'Justine, or Good Conduct Well-Chastised' (Justine, Philosophy in the Bedroom, and Other Writings) and this one. Both excellent translations, however 'or the Misfortunes of Virtue' (Oxford Classics) is in my opinion the superior translation. It is eloquently written and reads beautifully. Without doubt one of the finest novels I have ever read. It is perverse, criminal, philosophical, evil and dangerous. Perhaps one day, which I highly doubt, an English translation of La Nouvelle Justine, the full length, will come to light."}, {"review_sentiment": 5.0, "review_text": "It's my favorite work of De Sade. First read this book way back in 2003 and I'm happy to revisit it again this time"}, {"review_sentiment": 1.0, "review_text": "Not as good as I remembered it.,"}, {"review_sentiment": 5.0, "review_text": "De Sades views on Nature vs God are very thought provoking."}, {"review_sentiment": 5.0, "review_text": "I love the introduction to this edition. Really puts the book in context."}, {"review_sentiment": 5.0, "review_text": "Gets a little dense sometimes but it was written in the 1800s so that's to be expected but the overall story is perfect."}, {"review_sentiment": 5.0, "review_text": "You may call me twisted AF but the book's story kinda turns the hell of me on. Great find! Will start reading 120 Days of Sodom next week."}, {"review_sentiment": 5.0, "review_text": "ADVENTURE,SEX,ROMANCE AND EXCITING.A GREAT READ."}]}, "authors": ["Marquis de Sade"], "isbn": "0199572844", "longitude": 4.8320114, "periods": ["1700s"], "title": "Justine, or the Misfortunes of Virtue", "word_cloud": "more child abuse college course extremely graphic much sexual public ridicule kidnap imprisonment know much please research embark terrorizing adventure good other excellent translation however opinion superior translation eloquently write read beautifully doubt finest novel ever perverse criminal philosophical evil dangerous perhaps day highly doubt english translation full length come light favorite work way back happy revisit time not good remember view think provoke love introduction edition put context get little dense sometimes write expect overall story perfect twisted story kinda turn hell find reading next week", "genres": ["Fiction & Literature", "Erotica"], "summary": "This is the first new translation in over forty years of Sade's novel Justine. It is also the first ever critical edition, based on the original 1791 version of the story, which is the most accessible and artistically successful of the three versions. \r\n\r\nThe novel tells the story of the beautiful and devout Justine, whose steadfast faith and naive trust destine her from the outset for sexual exploitation and martyrdom. The unending catalog of disasters that befall her, during which she is subject to any number of perverse practices, illustrate Sade's belief in the primacy of Nature over civilization. Virtue is no match for vice, and as criminality and violence triumph, Justine is doomed to suffer. Indeed, the novel mounts a ferocious physical and intellectual assault on absolute notions of good and evil. \r\n\r\nJohn Phillips's lively translation conveys the tone of Sade's original text and his introduction situates Sade's narrative in its historical, literary, and philosophical background, discussing such major themes as attitudes to women, the church, the justice system, and the world of finance, the sadistic and masochistic elements, and the novel's reception. The extensive notes shed light on religious and philosophical ideas and explain allusions to topical events.\r\n", "asin": "0199572844", "rank": "176760", "city": "Lyon", "image": "https://images-na.ssl-images-amazon.com/images/I/51UMPhWJZPL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}