{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 85, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "I read this as I was travelling around Cuba and found it really interesting.  (If you're going there, read it before you visit the Bay of Pigs Museum, Palace of The Revolution, Modern Art Museum, etc.)  I agree with others who say it's biased; just keep that in mind while you read. It has excellent background information. I only wish it were current (even the second edition feels dated) and that there were notes. Ms. Sweig provides suggestions for further readings but no end-notes. I find it stunning that an author could compile so much documentation and not list even one source. Unfortunately, such an omission adversely affects her credibility."}, {"review_sentiment": 5.0, "review_text": "Great, well written book. Although the chronicled events have passed, it is a very informative book.A must have for your library."}, {"review_sentiment": 3.0, "review_text": "There is a newer work that reflects the dynamic changes in Cuba. Get the newer version, here:https://www.amazon.com/dp/0190620374/ref=cm_cr_ryp_prd_ttl_sol_4"}, {"review_sentiment": 5.0, "review_text": "This is my third book about Cuba, where I am traveling in March."}, {"review_sentiment": 4.0, "review_text": "Just what everyone needs to know. Things are changing in US -Cuba relations so a 3rd edition is probably necessary, but the historical parts are excellent, perfect for the students I take to Cuba."}, {"review_sentiment": 5.0, "review_text": "Well organized and helpful"}, {"review_sentiment": 5.0, "review_text": "I found the book an easy read and very informative. I recommend it."}, {"review_sentiment": 4.0, "review_text": "Excellent historical review with up to date information on the political relationship with the United States."}, {"review_sentiment": 5.0, "review_text": "I am still reading this book to understand a lot of history that had been covered up in most history books.  Where Cuba and USA relations end up will defiantly be rooted in these facts."}, {"review_sentiment": 3.0, "review_text": "A lot of good information but oftentimes written in a way that makes it more confusing than clarifying. A very good book to read - or skim - before going to Cuba."}]}, "authors": ["Julia E. Sweig"], "isbn": "0199896704", "longitude": 0.0, "periods": null, "title": "Cuba: What Everyone Needs to Know", "word_cloud": "travel find really interesting go visit etc agree others say bias mind excellent information wish current even second edition feel date note provide suggestion reading find stunning author much documentation list even source omission adversely affect credibility well write chronicled event pass informative newer work reflect dynamic change newer version http third travel just thing change relation edition probably necessary historical part excellent perfect student take cuba well organize helpful find easy informative recommend excellent historical review date information political relationship still read understand lot history cover history relation end defiantly root fact lot good information oftentimes write way make confuse clarify good skim go", "genres": ["History", "Social & Cultural Studies", "Cold War", "Politics"], "summary": "Ever since Fidel Castro assumed power in Cuba in 1959, Americans have obsessed about the nation ninety miles south of the Florida Keys. America's fixation on the tropical socialist republic has only grown over the years, fueled in part by successive waves of Cuban immigration and Castro's larger-than-life persona. Cubans are now a major ethnic group in Florida, and the exile community is so powerful that every American president has curried favor with it. But what do most Americans really know about Cuba itself? \r\n\r\nIn this second edition of the widely hailed Cuba: What Everyone Needs to Know, Julia Sweig updates her concise and remarkably accessible portrait of the small island nation--and now includes material from her 2010 interview with Fidel Castro. The new edition covers the key events of the last few years: Raul Castro's assumption of power from his brother Fidel, economic and political reforms since Raul came to power, and the changes in Us-Cuba relations following the election of Barack Obama. Expansive in coverage and authoritative in scope, the book looks back over Cuba's history since the Spanish American War before shifting to recent times. Focusing equally on Cuba's role in world affairs and its own social and political transformations, Sweig divides the book chronologically into the pre-Fidel era, the period between the 1959 revolution and the fall of the Soviet Union, the post-Cold War era, and--finally--the post-Fidel era. \r\n\r\nInformative, pithy, and lucidly written, it is the best compact reference on Cuba's internal politics, its often fraught relationship with the United States, and its shifting relationship with the global community. \r\n\r\n\"Excellent and... evenhanded.... [It] packs a phenomenal amount of complex history into clear and simple prose.\" Los Angeles Times", "asin": "0199896704", "rank": "505036", "city": "", "image": "https://images-na.ssl-images-amazon.com/images/I/51FctchD3FL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}