{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 25, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Superb....Starr takes you back on a day to day walk in the decade. Such a great researcher and writer."}, {"review_sentiment": 5.0, "review_text": "Excellent book on the history of California. Highly recommended."}, {"review_sentiment": 2.0, "review_text": "If you enjoy reading encyclopedias, you'll enjoy this book. It's cram full of historical information, but the author barely mentions most characters before jumping to the next one and the next one and the next one, ad infinitum. If you really want to learn more about some of the people and events barely touched on in this treatise, you will have to look elsewhere. Having said that, the author does give decent coverage to California politicians, but mostly just governors."}, {"review_sentiment": 5.0, "review_text": "I was born in 1950 and grew up in Ventura, California. I am thoroughly enjoying this book! It describes in great detail many of the aspects of California living with which I am familiar. In addition, Kevin Starr presents behind-the-scenes information and history that brings this fascinating period of history alive. I find his style compelling. There is a fine blend of humor, detail, and wry observation that makes the telling of history come alive."}, {"review_sentiment": 5.0, "review_text": "Extremely well-written and documented--learning a lot about the state from Starr. Not pedantic at all--the facts and history well-presented."}, {"review_sentiment": 4.0, "review_text": "Came in good condition"}, {"review_sentiment": 2.0, "review_text": "Kevin Starr has a gift for exhaustive political narrative but often misses facets of California life that are at least equally important.In the DuBay-Cardinal McIntyre controversy, for instance, he makes the mistake of taking the issue out of the religious context. For him, the whole civil-rights movement was a political and legal issue that interested parties had to solve.He ignores completely the intense debate about the moral issues in segregation going on in all churches throughout the state and throughout the country. He implies that the California Real Estate Association was interested in the core issue of private value when it aggressively attacked the Rumford Fair Housing Act.He ignores completely the restrictive covenants that realtors required every home owner to sign, effecting a segregated society comparable to South Africa's apartheid. Kevin Starr, like the Cardinal, did not see segregation and the practices that create it as immoral. He ignores the personal cost of segregation. Parents in Compton and Watts struggled to keep their children from feeling hate and rage in the face of daily humiliations and insults of a segregated city.Starr ignores the repeated statements of the Popes and the bishops condemning not just racism but discrimination and segregation in all their forms. It may be true that McIntyre was not much worse than other American bishops of the time. It had long been their practice to issue lofty statements asserting Christian doctrine about the solidarity of the human race and the equality of all races. But then, they would  retreat to their respective dioceses and comply with the status quo of segregated communities as well as their own schools and churches.Starr and Cardinal McIntyre's spokesperson Msgr. Frank Weber see the Cardinal as caught in a political fight between conservatives and liberals, a victim of his times. Starr asserts that the Cardinal was unjustly vilified by the \"liberal and secular press\" following DuBay's removal. He gives no credit to non-Catholic religious press around the world who supported DuBay also saw the Cardinal's decisions as a violation of central Christian doctrine.Of course, the Catholic press, with few exceptions such as the Commonweal and Ave Maria magazines, had to vilify DuBay in every way possible for bringing his case to the public. That set an unforgivable precedent.The Cardinal's crime, like that of the German bishops who failed to speak out against Hitler's treatment of Jews, was a crime of silence. The Cardinal was sitting on the whole civil rights movement in CaliforniaThe Cardinal did finally join the other seven California bishops in August 1964 to oppose Proposition 14 opposing fair housing, it was too little and too late. The hierarchy and clergy had waited so long to give leadership in civil rights that the people were not ready to follow. On election day in November, the people voted to pass the proposition by a 2 to 1 vote.It was a lesson for religious leaders everywhere. For hundreds of years, the clergy not only overlooked the moral dimensions of segregation and discrimination. They encouraged it by allowing separate schools, segregated churches, and all-white religious groups.It was a turning point for the Catholic church as the Catholic conspiracy of silence on civil rights had ended. Even the Catholic press began to admit \"the failure of Catholic people to have any real knowledge of the Catholic teaching on the state, on the whole notion of the right and duty of civil government to enact legislate in areas of this kind.\" Jesuit professor William J. Kenealy described the problem as \"our failure as Catholics to practice in our daily lives the teachings of Christianity\" in racial justice.\"It is indeed unfortunate that a historian of Starr's standing did not recognize DuBay's expression of freedom of speech within the Church as a natural requirement of reform. Catholics were recognizing their Church as a human institution, as part of society and subject to the moral standards of the human race. This new recognition would eventually enable parents to take their bishops to court for clerical child abuse, which they had long held in silence.Starr ignores the heated debates in the Catholic Church about the autonomy of priests, nuns, and lay people in taking their beliefs out of the church and into the marketplace. In the Selma march of 1965, we saw priests and nuns from all over the country holding hands and marching with local activists, experiencing an unprecedented independence and freedom of movement. They needed no longer a prelate's permission to exercise their conscience in the public realm."}, {"review_sentiment": 2.0, "review_text": "Too much statistics, not enouch spirit and character of that period.I had great expectations because it is an interesting period, but got dissapointed, the book was too too much about neighborhoods developments, etc. Not interesting."}, {"review_sentiment": 2.0, "review_text": "Too detailed....one or two examples would suffice for each description but, no....why do when you can overdo?  I find myself skimming pages at a time."}, {"review_sentiment": 5.0, "review_text": "Starr's period of review--1950 to 1963--covered California's halcyon days, and I arrived in the state in 1961 to witness the last third of that period first hand.As a graduate Stanford student in journalism, I saw up close many of the personalities he describes, and his depiction rings true with my memory as a Baghdad by the Bay observer.Later in life I managed government affairs in Sacramento for one of the Kaiser companies and recall the \"happy warrior\" Pat Brown walking the legislative hallways and greeting everyone--and Starr's Brown is described accordingly.Starr's account allowed for me to relive those days when all Californians thought the golden sunsets beyond the Golden Gate would continue for ever.Starr's only shortcoming--but a necessary one to be a classic historian--is that he crams every detail and name into each chapter, and that can wear the reader down.Starr's capture what excellent historical narratives are--readable, enlivening and evocative of those times for the reader who lived then,Timothy J. Conlon"}]}, "authors": ["Kevin Starr"], "isbn": "0199832498", "longitude": -118.244476, "periods": ["1900s", "Recent Releases"], "title": "Golden Dreams: California in an Age of Abundance, 1950-1963", "word_cloud": "take back day day decade such great researcher writer excellent history recommend enjoy read encyclopedia cram full historical information author barely mention character jump next next next ad infinitude really want learn people event barely touch treatise look elsewhere say author give decent coverage politician mostly governor bear grow thoroughly enjoy describe great detail many aspect living familiar addition present information history bring fascinating period history alive find style compelling fine blend humor detail wry observation make tell history come alive extremely document learning lot state not pedantic fact history good condition gift exhaustive political narrative often miss facet life least equally controversy instance make mistake take issue religious context whole movement political legal issue interested party ignore completely intense debate moral issue segregation go church state country imply interest core issue private value aggressively attack ignore completely restrictive covenant reactor require home owner sign effect segregate society comparable apartheid see segregation practice create immoral ignore personal cost segregation struggle child feel hate rage face daily humiliation insult segregate ignores repeat statement bishop condemn racism discrimination segregation form true much worse american bishop time long practice issue lofty statement assert christian doctrine solidarity human race equality race respective diocese comply status quo segregate community well school spokesperson see cardinal caught political fight conservative liberal victim time assert unjustly vilify liberal secular press follow removal give credit religious press world support also saw decision violation central course press exception magazine vilify way possible bring case public set unforgivable crime german bishop fail speak treatment crime silence sit whole civil right movement finally bishop oppose oppose fair housing little late hierarchy clergy wait long give leadership civil right people ready follow election day people vote pas proposition lesson religious leader everywhere hundred year clergy overlooked moral dimension segregation discrimination encourage allow separate school segregate church religious turn point church conspiracy silence civil right end even press begin admit failure people real knowledge teach state whole notion right duty civil government enact area kind professor describe problem failure practice daily live teaching racial justice indeed unfortunate historian stand expression freedom speech natural requirement reform recognize human institution part society subject moral standard human race new recognition eventually parent bishop court clerical child abuse long hold ignores heat debate autonomy priest nuns lay people take belief church marketplace march saw priest nun country hold hand march local activist experience unprecedented independence freedom movement need longer prelate permission exercise conscience public realm too much statistic enough spirit character great expectation interesting period get dissapointed much neighborhood development etc not interest too detailed example description find skim page time period review cover halcyon day arrive state witness last third period first graduate student journalism saw close many personality describe depiction ring true memory life manage government affair company recall happy warrior walk legislative hallway greet everyone describe account allow relive day think sunset shortcoming necessary classic historian crams detail name chapter wear capture excellent historical narrative readable enliven evocative time live", "genres": ["History", "Pop Culture"], "summary": "A narrative tour de force that combines wide-ranging scholarship with captivating prose, Kevin Starr's acclaimed multi-volume Americans and the California Dream is an unparalleled work of cultural history. In this volume, Starr covers the crucial postwar period--1950 to 1963--when the California we know today first burst into prominence.\r\n\r\nStarr brilliantly illuminates the dominant economic, social, and cultural forces in California in these pivotal years. In a powerful blend of telling events, colorful personalities, and insightful analyses, Starr examines such issues as the overnight creation of the postwar California suburb, the rise of Los Angeles as Super City, the reluctant emergence of San Diego as one of the largest cities in the nation, and the decline of political centrism. He explores the Silent Generation and the emergent Boomer youth cult, the Beats and the Hollywood \"Rat Pack,\" the pervasive influence of Zen Buddhism and other Asian traditions in art and design, the rise of the University of California and the emergence of California itself as a utopia of higher education, the cooling of West Coast jazz, freeway and water projects of heroic magnitude, outdoor life and the beginnings of the environmental movement. More broadly, he shows how California not only became the most populous state in the Union, but in fact evolved into a mega-state en route to becoming the global commonwealth it is today.\r\n\r\nGolden Dreams continues an epic series that has been widely recognized for its signal contribution to the history of American culture in California. It is a book that transcends its stated subject to offer a wealth of insight into the growth of the Sun Belt and the West and indeed the dramatic transformation of America itself in these pivotal years following the Second World War.\r\n\r\n\"Kevin Starr's Golden Dreams...is marvellously cohesive and concise, and Starr's engaging style makes it a pleasure to read.\" -Times Literary Supplement", "asin": "0199832498", "rank": "482643", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51VgXNSFYJL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}