{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 107, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I recently saw the TV series from a few years ago and wanted to read the book. I'm only 50 pages into it, but it seems really good, more plot, better scene description, etc."}, {"review_sentiment": 3.0, "review_text": "Did not realize that author Zola was so detail oriented.  Book is full of technical information and although the pictures his words paint are beautiful, it does get tedious to read.  The references are interesting historically.  But the immense sadness, despair, and greed demonstrated by the characters make the book depressing.  I finished it in 3 days because I kept waiting/looking for the happiness/good.  I regret that I did not find what I wanted.  I would NOT read the others in this series by Mr. Zola."}, {"review_sentiment": 4.0, "review_text": "I didn't want to like this book. A novel about the birth of the modern department store? How could that be interesting? And once again, Zola proves me wrong. I think he could take any subject and make it gripping. Although it was set during the time of the Second Empire of France, much of the plot is as relevant today as when it was written.Two chapters were particularly captivating: one about the day of the first big sale—the imagery of the river sucking in the customers was addictive—and another about the demise of the artisan shopkeepers using the metaphor of a death and the subsequent funeral and mourning. The protagonist, Denise, is among the few of Zola's characters in the Rougon-Macquart cycle who is sympathetic and honorable throughout the story. The transformation of Octave Mouret, who we got to know in Pot Luck (Pot Bouille), is a pleasant surprise. He was such a unlikeable character in the earlier novel. In this story, we witness growth and admire his brilliance in business."}, {"review_sentiment": 5.0, "review_text": "Have enjoyed the book almost as much as the television series"}, {"review_sentiment": 5.0, "review_text": "Loved the book. Great used condition too."}, {"review_sentiment": 2.0, "review_text": "So much detailed description of shops and merchandise, not much of a plot - leaving this reader, who hates shopping (except for books) feeling very alienated. This book is not for me."}, {"review_sentiment": 5.0, "review_text": "would buy again"}, {"review_sentiment": 5.0, "review_text": "Zola is one of my favorite authors....I loved this book. Thank you!"}, {"review_sentiment": 4.0, "review_text": "I bought the book since I loved The Paradise TV Show. It is a little difficult to get into as it was originally written in French and translated to English. So it just doesn't flow as well as other books I love."}, {"review_sentiment": 5.0, "review_text": "Read the book after watching PBS series; Emile Zola's book provides much more depth to the characters"}]}, "authors": ["Emile Zola"], "isbn": "0199536902", "longitude": 2.3514992, "periods": ["1800s"], "title": "The Ladies' Paradise", "word_cloud": "recently saw tv series year want page seem really good plot better scene description etc author detail orient full technical information picture word paint beautiful get tedious reference interest historically immense sadness despair greed demonstrate character make depress finish day keep regret find want others series want birth modern department store prove wrong think subject gripping set time much plot relevant today chapter particularly captivate day first big imagery river suck customer demise artisan shopkeeper use metaphor death subsequent funeral mourn protagonist character cycle sympathetic honorable story transformation get know pleasant surprise unlikable character earlier story witness growth admire brilliance business have enjoy almost much television series love used condition so much detailed description shop merchandise much plot leave hate shop feel alienate favorite author love buy love tv little difficult originally write translate flow well love read watch series provide much depth character", "genres": ["Fiction & Literature"], "summary": "The Ladies Paradise (Au Bonheur des Dames), now a TV series called The Paradise based on this classic novel, recounts the rise of the modern department store in late nineteenth-century Paris. The store is a symbol of capitalism, of the modern city, and of the bourgeois family: it is emblematic of changes in consumer culture and the changes in sexual attitudes and class relations taking place at the end of the century. This new translation of the eleventh novel in the Rougon-Macquart cycle captures the spirit of one of Zola's greatest works.\r\n\r\n", "asin": "0199536902", "rank": "122080", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51JHtKm85cL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}