{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 2, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "The text here is that of the New York Edition, which is also the text used in the Penguin Classics edition.  I have yet to read the original version, although I have it in The Library of America edition of James's tales.  Originally, one character in the story was named \"Tita\"; then when James revised the story her name was changed to \"Tina.\"The Contents of this volume:Introduction, by editor Adrian PooleNote on the textsFurther readingChronology of Henry JamesPrefaces by Henry JamesTHE ASPERN PAPERSTHE PRIVATE LIFETHE MIDDLE AGESTHE DEATH OF THE LIONNotesVariant readingsLike so many of James's works, this gem had its origins in an incident from life that he overheard, of a woman who owned some of Byron's letters and burned one of them.  Henry James, we know, created one of Literature's great bonfires, in which he burned numerous letters to himself; and we know that he often ending a letter to a correspondent with the plea, \"Burn this!\"  And yet we know that James himself devoured editions of letters by writers.  In THE ASPERN PAPERS, James has created the myth of a famous American poet, Jeffrey Aspern, with whom the story's narrator is obsessed.  (Interestingly, three of the four tales in this volume are told in first-person narrative; none of James's novels are, with the exception of THE SACRED FOUNT.)  I found the story, as it unwound, hypnotic--it clutched my attention to its very end.  The characters are superbly imagined and brought to life.  The atmosphere of the haunted old house in ancient Venice, with its living spectres, one so close to death and the other never actually having had much of \"life,\" is woven with genius.  James has a wonderful sense of place.  One would not think that so intense a drama could be crafted from so slim an idea--an unscrupulous journalist, obsessed with a poet of genius, discovers that the poet's great love yet lives and has in her possession her love letters from the poet; the journalist becomes a lodger in the old inhabitant ad tries to find a way to get his hot hands on the ached-for letters.  That James could created a spellbinding story from what seems at first so pathetic an incident amazes me.The sense of hauntedness of the tale is captured in the 1947 film adaptation, THE LOST MOMENT.  I have not seen the newer 2010 film adaptation (where the story setting is moved to the jungles of Venezuela), and I'm curious about it.  If any of you have seen it, perhaps you could share your views in the comments below.The other tales in this volume reflect the lives of writers, the relation between those who write and they who read.  I highly recommend this edition of THE ASPERN PAPERS AND OTHER STORIES."}, {"review_sentiment": 5.0, "review_text": "Cool... please it was written in the 19th Century.  Yeah, I know Steven King would run circles around him with spell-check and online glossaries.  It is with writers like James that we have writers like King."}]}, "authors": ["Henry James"], "isbn": "0199538557", "longitude": 12.3345898, "periods": ["1800s"], "title": "The Aspern Papers and Other Stories", "word_cloud": "text also text use edition yet original version edition tales originally character story name revise story name change volume editor adrian texts further reading chronology readings like many work gem origin incident life woman own letter burn know create great bonfire burn numerous letter know often end letter correspondent plea yet devoured edition letter writer create myth famous american poet story narrator obsess tale volume tell narrative none exception find story unwound hypnotic clutch attention end character superbly imagine brought life atmosphere haunt old house ancient living specters close death never actually much life weave genius wonderful sense place intense drama slim idea unscrupulous journalist obsess poet genius discovers poet great love yet live possession love letter poet journalist becomes lodger old inhabitant ad try find way hot hand letter spellbind story seem first pathetic incident amaze sense hauntedness tale capture film adaptation see newer film adaptation story set move jungle curious see perhaps share view comment tale volume reflect live writer relation highly recommend edition cool please write know steven circle online glossary writers writer king", "genres": ["Fiction & Literature"], "summary": "'There's no baseness I wouldn't commit for Jeffrey Aspern's sake.'\r\n\r\nThe poet Aspern, long since dead, has left behind some private papers. They are jealously guarded by an old lady, once his mistress and muse, a recluse in an old palazzo in Venice, tended by her ingenuous niece. A predatory critic is determined to seize them. What can he make of the younger woman? What are his motives? What are the papers worth and what is he prepared to pay?\r\n\r\nIn all four stories collected here, including 'The Death of the Lion', 'The Figure in the Carpet', and 'The Birthplace', the figure of the artist is central. Extraordinarily prophetic, James explores the emergent new cult of the writer as celebrity, and asks, who cares about the work for itself? Can the man behind the artist ever truly be known, and does our knowledge explain the act of creativity? This new edition includes extracts from James's Prefaces and Notebooks which shed light on the\r\ngenesis of the stories.", "asin": "0199538557", "rank": "2450883", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51P-SYEkNmL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}