{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 138, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Ourstanding"}, {"review_sentiment": 4.0, "review_text": "The account is one-sided. I am sure later books dealt more seriously with the Turks as well as the Anzac Forces. What there is here is good history."}, {"review_sentiment": 4.0, "review_text": "A detailed account of the campaign but not overdone. I never knew the details before but found them fascinating. As a avid reader of military history I was not disappointed at all."}, {"review_sentiment": 5.0, "review_text": "We really like it!"}, {"review_sentiment": 5.0, "review_text": "Why do New Zealand and Australia celebrate the horrible loss of young lives in a bungled, useless and unnecessary campaign? Why do their governments not apologize to their people for entering a war on the other side of the world? The ruling class of England might gain, but not the working class.This is a first-rate war story. I have never read a more gripping account of battle than this --  the assault on the southern tip of the peninsula of Gallipoli.This is an interesting and well-written history of a famous military defeat in which Winston Churchill, as First Lord of the Admiralty, was deeply implicated. A war-monger all his life, he was responsible for so many deaths. He was in government only because of the influence of his very old and wealthy family. For the sake of decency alone, this man should have kept his mouth shut and confined himself to his luxurious estate instead of ever putting lives at risk. Gallipoli was one of his early blunders; there were to be many more in future wars. Yet he gets wonderful press from writers who don't care that poor men are forced or enticed into an army and sent to die for ends that have nothing to do with them.A tragic part of this history, as of so many histories, is the suffering of horses and mules. Wars were never to the advantage of the animal world, but always horses were involved and always their suffering was immense.At Gallipoli, it is hard to take sides -- for the Turks who had just slaughtered hundreds of thousands of innocent Armenian men, women and children, or for the British who had no valid reason to be on that Turkish peninsula.This history is written with an excellent style. The author is careful to make the battles understandable. He never leaves the reader in doubt about what is going on and who is involved.But long before the end, I began to wonder what insanity led the British into such a horrible waste of life."}, {"review_sentiment": 5.0, "review_text": "Excellent history of a significant moment of WW1. Very readable!"}, {"review_sentiment": 4.0, "review_text": "A great explanation of this depressing subject matter"}, {"review_sentiment": 5.0, "review_text": "Great book. Good read"}, {"review_sentiment": 5.0, "review_text": "To read Peter FitzSimon's GALLIPOLI is to realize how great an evening it would be to have the man in front of a crackling fire in your living room telling a good tale.For it is the telling of a tale that FitzSimon promises us, a tale of how Australia 'became a nation' in the wrenching experiencing of bleeding for the British Empire on the hills of the Turkish coast.FitzSimons puts a lot of himself in this story, not always a promising approach for a history writer. Yet this manages to illuminate rather than obscure the Gallipoli narrative. The author's full-disclosure explanation of how his own understanding of the battle has changed gives the non-Australian reader a glimpse into the various ways in which that antiopodean nation itself has moved through various stages of engagement with one of its defining moments.There is little to nothing *good* to say about a battle of this ferocity, one that concluded with surviving Anzac forces withdrawing to the sea under cover of darkness. But one can tell the awful story well. FitzSimons manages to write in—to speak in, for the reader can almost hear his voice—Australian, not a generic academic English.The result is winsome, savage, and accessible. One emerges from reading this book made wiser not only about the flawed execution of what might otherwise have represented a victorious thrust by the Allied forces into the belly of the Turkish 'sick man of Europe', but also more intelligent about how Australian soldiers fought for the mother country's Empire but died for Australia.FitzSimons recognizes that many have told the Gallipoli story before him. His contribution is to write, one hundred years on, for Australians and friends of Australians like this reader, several generations hence.A century is long enough for a certain empathy with the enemy of one's forebears to develop in a way that does not trivialize the complex developments that led a country to war on a land whose name they barely knew. FitzSimons ably captures the privilege of this retrospective distance, not least by recording a recent re-encounter of Turkish and Anzac veterans on this very savage and sacred soil, and by resurrecting Mustafa Kemal's generous words penned in 1934:'Those heroes that shed their blood and lost their loves ... You are now lying in the soil of a friendly country. Therefore rest in peace. There is no difference between the Johnnies and the Mehmets to us where they lie side by side now here in this country of ours ... you, the mothers, who sent their sons from faraway countries wipe away your tears; your sons are now lying in our bosom and are in peace. After having lost their lives on this land they have become our sons as well.'Has it really been a century?Peter FitzSimon's fine and well-researched retelling makes it seem just yesterday."}, {"review_sentiment": 5.0, "review_text": "A brilliant piece of work!  Peter Fitzsimons sews together innumerable pieces of history, including personal accounts, into a beautiful quilt.  The clear and concise summary of the events leading up to WWI enhances the highly readable story.  I highly recommend this book especially for its factual accounts of the incredible courage of the ANZACS, Turks and others, together with the heart rending tragedy of the campaign itself."}]}, "authors": ["Peter Hart"], "isbn": "0199361274", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Gallipoli", "word_cloud": "outstanding account sure later dealt seriously well force good history detailed account campaign overdone never know detail find fascinate avid military history disappoint really celebrate horrible loss young live bungled useless unnecessary campaign government apologize people enter war side world rule class work war story never grip account battle assault southern tip peninsula interest history famous military defeat deeply implicate life responsible many death government influence old wealthy family sake decency alone man keep mouth shut confine luxurious estate instead ever put life risk early blunder many future war get wonderful press writer care poor men force enticed army send die end nothing tragic part history many history suffer horse mule never advantage animal world always horse involved always suffer hard take side slaughter hundred thousand innocent armenian men woman child british valid reason turkish history write excellent style author careful make battle understandable never leave doubt go long end begin wonder insanity lead british horrible waste life excellent history significant moment readable great explanation depress subject matter good great even man crackle fire living room tell good tell tale promise tale nation wrench experience bleed british hill put lot story always promising approach history writer manage illuminate rather obscure narrative author explanation understanding battle change give glimpse various way antipodean nation move various stage engagement define little nothing say battle ferocity conclude survive force withdraw sea cover darkness tell awful story well manage write speak almost hear generic academic result winsome savage accessible emerge read make wiser flaw execution otherwise represent victorious thrust force belly turkish man also intelligent australian soldier fight mother country die recognize many tell story contribution year friend several generation century long enough certain empathy enemy forebears way trivialize complex development lead country war land name barely know ably capture privilege retrospective distance least record recent turkish veteran savage sacred soil resurrect generous word pen hero shed blood lost love lie soil friendly country rest peace difference lie side side country mother send son faraway country wipe away tear son lie bosom peace lose life land become son well really century fine retelling make seem yesterday brilliant piece work sew together innumerable piece history include personal account beautiful quilt clear concise summary event lead enhance highly readable story highly recommend especially factual account incredible courage others together heart rend tragedy campaign", "genres": ["History", "WWI"], "summary": "One of the most famous battles in history, the WWI Gallipoli campaign began as a bold move by the British to capture Constantinople, but this definitive new history explains that from the initial landings--which ended with so much blood in the sea it could be seen from airplanes overhead--to the desperate attacks of early summer and the battle of attrition that followed, it was a tragic folly destined to fail from the start.\r\n\r\nGallipoli forced the young Winston Churchill from office, established Turkey's iconic founder Mustafa Kemal (better known as \"Ataturk\"), and marked Australia's emergence as a nation in its own right. Drawing on unpublished eyewitness accounts by individuals from all ranks--not only from Britain, Australia and New Zealand, but from Turkey and France as well--Peter Hart weaves first-hand stories into a vivid narrative of the battle and its aftermath. Hart, a historian with the Imperial War Museum and a battlefield tour guide at Gallipoli, provides a vivid, boots-on-the-ground account that brilliantly evokes the confusion of war, the horrors of combat, and the grim courage of the soldiers. He provides an astute, unflinching assessment of the leaders as well. He shows that the British invasion was doomed from the start, but he places particular blame on General Sir Ian Hamilton, whose misplaced optimism, over-complicated plans, and unwillingness to recognize the gravity of the situation essentially turned likely failure into complete disaster.\r\n\r\nCapturing the sheer drama and bravery of the ferocious fighting, the chivalry demonstrated by individuals on both sides amid merciless wholesale slaughter, and the futility of the cause for which ordinary men fought with extraordinary courage and endurance--Gallipoli is a riveting account of a battle that continues to fascinate us close to a hundred years after the event.", "asin": "0199361274", "rank": "1023284", "city": "Gallipoli", "image": "https://images-na.ssl-images-amazon.com/images/I/41R6JgODhhL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}