{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 26, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Florent Quenu “espoused an ideal of pure virtue and sought refuge in a world of absolute truth and justice” and “became a republican, entering the realm of republican ideals as girls with broken hearts enter a convent; and unable to find a republic where sufficient peace and kindness prevailed to soothe his troubled mind, he created one of his own.” His delusional, Christ-like (his brother being his only disciple) naiveté feeds and nurtures the petty intrigue of the families who inhabit the Parisian food market, Les Halles. The result is one of Zola’s more masterful stories filled with intricate subplots that cause the reader to have ever-changing allegiances and impressions about the characters.Zola was a master of descriptive writing. In The Belly of Paris he creates scenes that the reader can see, feel, taste and, most impressively, smell the market, all of which are integral to the story. As in many of his stories, hypocritical, vicious gossip does much to drive the narrative. The highlight in this novel is a scene in which Zola intertwines the voices of the women at the market with the stench of the cheeses surrounding them as their chattering sets off the events that lead to the inevitable conclusion. As the “great explosion of smells“ combined, “The stench rose and spread, no longer a collection of individual smells, but a huge, sickening mixture. It seemed for a moment that it was the vile words of Madame Lecœur and Mademoiselle Saget that had produced this dreadful odour.”Unlike many of the other novels I’ve read in the Rougon-Macquart cycle, the first part of the story is filled with sympathetic characters. Reading on, it was like a being in a constant, unbalanced state and compelled me to keep reading. The Belly of Paris would be a great starting point for anyone interested in learning about Zola’s writing."}, {"review_sentiment": 4.0, "review_text": "I usually like Zola's writing but could not really find the center of interest in this novel. His protagonist returns to Paris after a long absence and his brother has taken over the bakery and married a dominant wife. The protagonist is not in himself interesting. HIs surroundings are interesting. I have to finish the book and hope I do. I got a little depressed at the lack of life in the main character."}, {"review_sentiment": 2.0, "review_text": "We read this book for our annual gastronomic December book club meeting. The abundance of detail was astounding to the point of exhaustion!"}, {"review_sentiment": 5.0, "review_text": "Well worth the read. A perennial favorite of Anthiny Bourdain, Zola brings to life a place and time that bursts with the joy, farce, and horror of the late Nineteenth Century in the City of Lights."}, {"review_sentiment": 5.0, "review_text": "Fun to read."}, {"review_sentiment": 4.0, "review_text": "Good book"}, {"review_sentiment": 5.0, "review_text": "Given as gift.  Recipient very pleased"}, {"review_sentiment": 5.0, "review_text": "I had heard about this book for many years and am glad that I finally own it.  Thanks so much!"}, {"review_sentiment": 1.0, "review_text": "Zola discrived the market as the digestive system in all its parts. And Walk us througt the lives and st.of the neighborhood with carefull detail. Masterfull."}, {"review_sentiment": 1.0, "review_text": "It's obvious that Zola excels in descriptive verbiage. There is, however, exponentially way too much of it. The theme is drummed home over and over of the smells and textures of greasy meat and rotting food. I could not finish this book. I could not care about the characters in it."}]}, "authors": ["Emile Zola"], "isbn": "0199555842", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Belly of Paris", "word_cloud": "espouse ideal pure virtue seek refuge world absolute truth justice become republican enter realm republican ideal girl broken heart enter convent unable find republic sufficient peace kindness prevail soothe troubled mind create delusional brother disciple naivete feed nurture petty intrigue family inhabit parisian food market halley result masterful story fill intricate subplots cause allegiance impression master descriptive writing create scene see feel taste impressively smell market integral story many story hypocritical vicious gossip much drive highlight scene intertwine voice woman market stench cheese surround chatter set event lead inevitable conclusion great explosion smell combine stench rise spread longer collection individual smell huge sicken mixture seem moment vile word produce dreadful many novel cycle first part story fill sympathetic character read constant unbalanced state compel keep read great start point anyone interested learn writing usually like writing really center interest protagonist return long absence brother take bakery married dominant wife protagonist interest surroundings interest finish hope get little depressed lack life main character annual gastronomic club meet abundance detail astound point exhaustion well perennial favorite bring life place time burst joy farce horror late nineteenth fun good give gift please hear many year glad finally thank much disc rived market digestive system part through life careful detail obvious excels descriptive verbiage however exponentially way much theme drum home smell textures greasy meat rot food character", "genres": ["Fiction & Literature"], "summary": "Unjustly deported to Devil's Island following Louis-Napoleon's coup-d'etat in December 1851, Florent Quenu escapes and returns to Paris. He finds the city changed beyond recognition. The old Marche des Innocents has been knocked down as part of Haussmann's grand programme of urban reconstruction to make way for Les Halles, the spectacular new food markets. Disgusted by a bourgeois society whose devotion to food is inseparable from its devotionto the Government, Florent attempts an insurrection. Les Halles, apocalyptic and destructive, play an active role in Zola's picture of a world in which food and the injustice of society are inextricably linked. \r\n\r\nThe Belly of Paris (Le Ventre de Paris) is the third volume in Zola's famous cycle of twenty novels, Les Rougon-Macquart. It introduces the painter Claude Lantier and in its satirical representation of the bourgeoisie and capitalism complements Zola's other great novels of social conflict and urban poverty", "asin": "0199555842", "rank": "438918", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/515sF0gEtFL.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}