{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 10, "rating": 4.8, "reviews": [{"review_sentiment": 4.0, "review_text": "How a fantastic artist could do so many wrong things? How could so many friends just do nothing to help?"}, {"review_sentiment": 5.0, "review_text": "I read this book in about 3 nights...couldn't put it down, well researched and written, tells the tragic story on and off the field of Mane Garrincha...what a talent...go check on youtube some of his games, they have full 1958 and 1962 World Cup complete games. Well worth your time, this Brazil team was out of this world."}, {"review_sentiment": 5.0, "review_text": "Very good book. Written in a racy style. very interesting. got to tell my friends about it. Wiating for more."}, {"review_sentiment": 5.0, "review_text": "A great book about a controversial sport celebrity of middle 20th century;I'll never understand why the English edition simply did not translate literally the original title in Portuguese \"Lone Star.\"Much more flashy... especially to the general public, not particularly fond of football. After all, more than the story of a (almost now-forgotten) great footballer, is a unique story about the stunning Rise and melancholic Fall of a celebrity (of sports) in the early days of television, fueled by alcohol (drug), sex and music... Sounds familiar?Now, remembering the death's date of Garrincha (january 20), I say that I'll never understand how some people (and they are not few, including some footballers) think that, the stars of a time when the games were filmed in black & white, with no stratospheric salaries, pockmarked lawns, poorly lit stadiums, primitive and inefficient doping, sports medicine idem (see the infiltrations then made ​​in the knees of athletes), are 'less' talented than those from the age of color TV,  'carpeted' lawns (at least the major European ones) , well lit arenas etc etcFor me it's the same thing as saying that Sidney Sheldon would be a \"better\" writer than Shakespeare, simply because he uses computer, or that Genghis Khan was a lesser military genius compared with any famous 20th century general, simply because his troops were to use horse archery... No sense at all.Not to mention the staff who avoids opine about \"old\" footballers for not having seen them in action, alive... \"Oh, I don't know if Isaac Newton was all that as a scientist, after all I have not seen him in action with my own eyes\" (sic)"}, {"review_sentiment": 5.0, "review_text": "Great read for those out there who actually understand real soccer and its players who have been forgotten. Great photographs in this book of Garrincha and his early years. Thank you."}, {"review_sentiment": 5.0, "review_text": "This book is simply the best sports autobiography that I have ever read. This story is expertly written and has been researched to the finest detail. This is a must read and a must own. The book is both funny, deeply moving and very sad all at the same time. Never has a book moved in such a way.Garrincha's talent for dribbling was amazing and his attitude to the game is refreshing to read in a society where all todays players seem to care about is the big money contract. He womenised, charmed and smiled his way through life and I for one wish i had met such an amazing man.The sadness of the final section of the book is moving. With Garrincha's struggle with alcohol slowly distroying his life.AMAZING BOOK, MUST BUY!!"}, {"review_sentiment": 5.0, "review_text": "A calmly scintillating biography of the greatest match-winner in the history of football, this book delves richly into the man behind \"Mane\" as he was often called in the shortened from of his first baptismal name Manuel (full name Manuel Franciso Dos Santos), tracing his ancestry and birth on October 28,1933 in Pau Grande right through to his alcoholism-induced death on January 20,1983 in a Rio De Janeiro clinic. His early exploits in his mountainside hometown; his torturous relationship with his first wife Nair Marques and the eight daughters she bore him; his many and varied exploits with the fairer sex; his exciting performances for Botafogo and Brazil which often demoralized opponents; the drama-laden relationship with singer Elsa Soares; and many other aspects of Garrincha's life are recounted in absolutely riveting detail that would surely increase the admiration and love for the greatest right-winger in the history of the beautiful game. An unreserved \"five stars\" for this book. Get your copy today!!"}, {"review_sentiment": 5.0, "review_text": "This book is fantastic. Ruy Castro is such a great writer and moving. You get to tears reading this. This is the story of a man that is considered by many to be a better soccer player than Pelé here in Brazil. If you are an admirer of Pelé's, Zico's and Ronaldinho's magic inside the field, you will love to read all about the \"original magician\" Garrincha and what he did in the WC of 1958 and 1962 and how his game moved people and drove them crazy here in Brazil. If you like to hear stories about geniuses like Maradona, that are so great and yet so tragic, you will love to hear the funny and insane stories of Garrincha's great, crazy and tragic life. If you think Cristiano Ronaldo love life is interesting, you won't believe when you read the stuff you're gonna read here about Garrincha's sexual appetite and how he drove ladies crazy --and made babies-- back in the day. I really, really recomend this book to everyone that likes football and also for the ones who don't like it. It is a great tale of sex, alcohol, football and tragedy."}, {"review_sentiment": 5.0, "review_text": "I first read Ruy Castro's 'Bossa Nova' and wanted more! Then I found his book 'Rio de Janeiro', and loved it. I then went on to read Ruy Castro's next book (translated into English) Garrincha which is about a Futebol star. I am not into soccer but I loved the book."}, {"review_sentiment": 5.0, "review_text": "Although some people may disagree - the entire population of Argentina, I suspect - Brazil are widely considered the top dogs of world soccer. As a nation they've won the World Cup five times and the Maracanã - where Brazil play their home games - is one of the sport's most famous stadiums. Any discussion about the soccer's greatest players will feature several Brazilians - Pelé, Jairzinho, Zico, Romário, Bebeto, Falcão, Sócrates and Ronaldinho would surely be in contention. Manuel Francisco dos Santos, most commonly known as \"Garrincha\", may not be as widely known as his countrymen but he fully deserves to be included on that list. He is, however, quite clearly honoured in his home country where he is still known as the \"Joy of the People\".Garrincha was born in 1933 in a small town called Pau Grande. Amazingly, for such a gifted sportsman, he was born with 'bent' legs - his left bent out and his right bent in. When young, he was also smaller than the kids his own age and was christened 'garrincha' (the local name for a 'little bird') by his sister. His hometown was founded by the English in the 1870s and was centred around the América Fabril factory - the factory, it seems, practically employed the town's entire population. The town's soccer club - Sport Club Pau Grande - was founded in 1908 and, although an amateur team, was the first senior club Garrincha played for. He eventually moved to Botafogo, one of Rio's professional teams - it was here he played his best football, and he won the Carioca (Rio's State Championship) several times. He played for Brazil 60 times, winning the World Cup twice; he dismantled and demoralised the highly-rated USSR team in the 1958 Finals and, some say, won the tournament nearly single-handedly in 1962. Garrincha, however, played primarily for enjoyment - he didn't always turn up for training and still enjoyed playing with his friends on Pau Grande's dangerous pitch. Money seemed nearly irrelevant to him and he was practically taken advantage of by his club's directors. He'd regularly sign a blank contract, with the salary to be filled in later - as the team's star player he was then paid less than he was worth.Garrincha's life was also hugely colourful off the pitch. He was, allegedly, very well endowed, which may help explain why he was so popular with the ladies. He fathered (at least) 14 children by 5 different women, including eight daughters with his first wife, Nair, and a son in Sweden - conceived while on tour with Botafogo. It seems he was anything other than a devoted husband to Nair. Throughout his marriage to her, he regularly chased other women - he had a number of girlfriends and one-night stands and had children with several of them. Only one woman came close to 'taming' him : Elza Soares, a well-known singing star and every Brazilian man's fantasy. The pair met in 1961 and began their affair the following year. However, the public were less than impressed when news of their relationship broke, something that caused a great deal of trouble for them. Garrincha also suffered from alcoholism - cachaça, made from fermented sugar cane, was a particular favourite - and it was this affliction that led to his death at the age of 49. It also caused a great deal of trouble for his friends, relations and colleagues.The book is subtitled \"The Triumph and Tragedy of Brazil's Forgotten Footballing Hero\" and, as time goes by, the tragedies become more and more commonplace. At times, it is very difficult not to feel sorry for Garrincha, Nair and Elza - I certainly felt a great deal of regret that things didn't work out differently. The book was written by Ruy Castro, and was originally published in 1995 - he has quite clearly researched the book meticulously and has written a very engaging book. A great deal of credit must also go to Andrew Downie, who translated the book into English in 2004. A highly recommended book, that should appeal to more than just the soccer fan - largely because of Garrincha's colourful personal life. However, because of his personal life, I wouldn't think it's ideal reading for the kids !"}]}, "authors": ["Ruy Castro"], "isbn": "0224092197", "longitude": 0.0, "periods": ["1900s"], "title": "Garrincha: The Triumph and Tragedy of Brazil's Forgotten Footballing Hero", "word_cloud": "fantastic artist many wrong thing many friend nothing help night well research write tell tragic story field talent go check you tube game full complete game well worth time team world very good racy style interest get tell friend wait great controversial sport celebrity middle century never understand english edition simply literally original title flashy especially general public particularly fond football story almost great footballer unique story stun melancholic celebrity sport early day television fuel alcohol drug sex music sound familiar now remember death date january say never understand people include footballer think star time game film black white stratospheric salary pockmark lawn poorly light stadium primitive inefficient dope sport medicine idem see infiltration make knee athlete talented age color tv lawn major european one well arena etc etc for thing say writer simply use computer lesser military genius compare famous century general simply troop use horse archery sense mention staff avoids opine old footballer see action alive know scientist see action eye sic actually understand real soccer player photograph early year thank simply best sport autobiography ever story expertly write research finest detail funny deeply move sad time move talent dribble amazing attitude game refresh society today player seem care big money contract womanize charm smiled way life wish meet amazing sadness final section move struggle alcohol slowly destroy calmly scintillate biography greatest history football delve richly man often call shorten first baptismal name full name trace ancestry birth right death clinic early exploit mountainside hometown torturous relationship first wife daughter bore many varied exploit fairer sex excite performance often demoralize opponent relationship singer many aspect life recount absolutely rivet detail surely admiration greatest history beautiful game unreserved star get copy today fantastic great writer move get tear read story man consider many better soccer player admirer magic inside field love original magician game move people crazy hear story geniuses great yet tragic love hear funny insane story great crazy tragic life think life interest stuff hon sexual appetite drove lady crazy make baby back day really really everyone like football also one great tale sex alcohol football first want then find love go next translate english star soccer love people entire population suspect widely consider top dog world soccer nation time play home game sport famous stadium discussion soccer greatest player feature several surely do commonly know widely know countryman fully deserve included list however quite clearly honor home country still know bear small town call gift sportsman born leg leave bent right bent young also smaller kid age christen local name bird sister hometown found english center factory factory seem practically employ town entire population town soccer club found amateur team first senior club play eventually move professional team play best football several time play time win twice dismantle demoralized team final say tournament nearly however play primarily enjoyment always turn train still enjoy play friend dangerous pitch seem nearly irrelevant practically take advantage club director regularly sign blank contract salary fill later team star player pay le life also hugely colorful pitch allegedly well endow popular lady father least child different woman include daughter first wife son conceive seem anything devoted husband marriage regularly chase woman number girlfriends stand child several only woman come close sing star brazilian man fantasy pair meet begin follow year however public le impressed news relationship break something cause great deal trouble also suffer alcoholism cachaça make fermented sugar cane particular favorite affliction lead death age also cause great deal trouble friend relation subtitle time go tragedy become commonplace time difficult feel sorry certainly felt great deal regret thing work differently write originally publish quite clearly research meticulously write engage great deal credit also translate highly recommend appeal soccer fan largely colorful personal life however personal life ideal reading kid", "genres": ["Biography", "Sport"], "summary": "The World Cup Finals, Sweden 1958. Brazil vs the fearsome USSR. In the opening three minutes - 'the greatest three minutes in the history of football' - one man wrote himself into the record books alongside the game's greatest players, men like Pelé, Di Stefano, Puskas and Maradona. Brazil went on to win the cup, and, in Garrincha, a star was born.\r\n\r\nGarrincha was the unlikeliest of footballers - with a right leg that turned inwards and a left that turned out, he looked as if he could barely walk, but with a ball at his feet he had the poise of an angel. He played for the love of the game, uninterested in money, and ignoring tactical advice. And he was as wild off the pitch as he was mesmerising on it - mischievous, audacious and dripping with sex appeal. \r\n\r\nIt was his affair and subsequent marriage to the singer Elza Soares that caught the imagination of a nation - their mouth-watering combination of soccer and samba made them the toast of 1960s Rio. But by the age of forty-nine, Garrincha was dead, destroyed by the excesses that made him so compelling.", "asin": "0224092197", "rank": "1520667", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/51CAWEeNRSL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}