{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 22, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "thanks"}, {"review_sentiment": 5.0, "review_text": "Algren's view of Chicago in rich prose. Perfect for anyone who wants the feel as well as the sense of the city."}, {"review_sentiment": 2.0, "review_text": "This is another one right out of the Studs Terkel realm. Be bop gibberish writing - why can't I find a good book about Chicago??"}, {"review_sentiment": 5.0, "review_text": "Great history."}, {"review_sentiment": 5.0, "review_text": "great read"}, {"review_sentiment": 2.0, "review_text": "I've read very positive reviews on the way this book is written but personally I didn't like the way it read."}, {"review_sentiment": 4.0, "review_text": "Bought as a gift. Receiver of this item was happy with it."}, {"review_sentiment": 5.0, "review_text": "Being a native of Evanston, just north of Chicago, I understand Chicago. Algren understood the city, and then some. I appreciated then what he wrote. It's still true today. An excellent book, but largely forgotten."}, {"review_sentiment": 4.0, "review_text": "I love Chicago and love reading about it. I've lived here just about my entire life.Somehow, I'd missed Algren's classic dark ode to the Chicago of the first half of the 20th century, in all its gritty glory.I loved that fact that it included Algren's lengthy afterword, written 10 years later, in 1961, responding to the literary, cultural, and political establishment that was so critical of his essay.I rarely read the footnotes and other supplemental text but, in this case, reading the annotations was almost as interesting as the essay itself.The book contained so many classic lines, such as about how Chicago can be \"leaving you loving the joint for keeps.\" How \"every day is D-Day under the El.\"Another favorite Algren quote about the city: \"Yet once you've come to be part of this particular patch, you'll never love another. Like loving a woman with a broken nose, you may well find lovelier lovelies. But never a lovely so real.\"This is definitely not for everyone but it was a quick read that I enjoyed. I need to track down more Nelson Algren books."}, {"review_sentiment": 5.0, "review_text": "I read this book as part of a class and am so happy that I did. Algren's language is delicious and the book made me smile. Maybe that is because I am a lifelong Chicagoan."}]}, "authors": ["Nelson Algren"], "isbn": "0226013863", "longitude": -87.6244212, "periods": ["1900s"], "title": "Chicago: City on the Make: Sixtieth Anniversary Edition", "word_cloud": "thanks view rich prose anyone want well sense right realm bop gibberish writing good history great positive review way write personally like way gift item happy be native north understand understood appreciate write still true today excellent largely forget love read live entire miss classic dark ode first half century gritty love fact include lengthy afterword write year later respond literary cultural political establishment critical rarely footnote supplemental text case read annotation almost interest essay contain many classic line leave love joint keep day favorite quote come part particular patch never love love woman break nose well lovelier lovely never lovely real definitely everyone quick enjoy need track part class happy algren language delicious make smile maybe lifelong", "genres": ["History"], "summary": "“Once you’ve become a part of this particular patch, you’ll never love another. Like loving a woman with a broken nose, you may well find lovelier lovelies. But never a lovely so real.”\r\n\r\nErnest Hemingway once said of Nelson Algren’s writing that “you should not read it if you cannot take a punch.” The prose poem, Chicago: City on the Make, filled with language that swings and jabs and stuns, lives up to those words. In this sixtieth anniversary edition, Algren presents 120 years of Chicago history through the lens of its “nobodies nobody knows”: the tramps, hustlers, aging bar fighters, freed death-row inmates, and anonymous working stiffs who prowl its streets.\r\n\r\nUpon its original publication in 1951, Algren’s Chicago: City on the Make was scorned by the Chicago Chamber of Commerce and local journalists for its gritty portrayal of the city and its people, one that boldly defied City Hall’s business and tourism initiatives. Yet the book captures the essential dilemma of Chicago: the dynamic tension between the city’s breathtaking beauty and its utter brutality, its boundless human energy and its stifling greed and violence.\r\n\r\nThe sixtieth anniversary edition features historic Chicago photos and annotations on everything from defunct slang to Chicagoans, famous and obscure, to what the Black Sox scandal was and why it mattered. More accessible than ever, this is, as Studs Terkel says, “the best book about Chicago.”\r\n\r\n“Algren’s Chicago, a kind of American annex to Dante’s inferno, is a nether world peopled by rat-faced hustlers and money-loving demons who crawl in the writer’s brilliant, sordid, uncompromising and twisted imagination. . . . [This book] searches a city’s heart and mind rather than its avenues and public buildings.” New York Times ", "asin": "0226013863", "rank": "400362", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51R-QR3sc6L.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}