{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 35, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "This novel provides a very good insight into local politics, particularly in Boston, in the first part of the 20th century. It has a good balance between the positive and the negative actions of the politician. The population and cultural changes of the time are used adroitly by the politician and when they change and he doesn't, his power fades."}, {"review_sentiment": 4.0, "review_text": "gives a good understanding of the way it was."}, {"review_sentiment": 5.0, "review_text": "What amazes me with our political climate is, invariably people say things like, 'it ain't like when I was a kid,' or that times are changing and we are in unprecedented territory. I've heard people say this every year for the past thirty years! Now to be clear, I am not taking a political position as to my opinion on the state of affairs, I am merely commenting on the fact that human behavior repeats itself. And again. And again. And again. That's one aspect of this book I very much enjoy. Frank Skeffington in many ways in the every man of politics. It's a really funny read, nice forward-moving writing style, with some interesting twists."}, {"review_sentiment": 5.0, "review_text": "WONDERFUL.  AT AGE 78 IT IS GREAT TO READ SOMETHING THAT HAPPENED IN MY TIME."}, {"review_sentiment": 5.0, "review_text": "It's one of the best books of an age in politics that no longer exists."}, {"review_sentiment": 5.0, "review_text": "Classic old politics"}, {"review_sentiment": 4.0, "review_text": "So interesting to read after the presidential election of 2016.  Some parallels and some departures, but certainly interesting."}, {"review_sentiment": 5.0, "review_text": "Great tale of \"old style politics\" and Irish community life that brought back loving memories from my childhood.Enjoy!"}, {"review_sentiment": 4.0, "review_text": "The last hurrah  by Edwin O'Connor Newspaper worker watching the polls and attending meetings that the politicians are speaking at as they run for mayor.Others around town show up when the candidates are speaking about the town issues.  After the heart attack the mans son comes to find out what happened and how others saw things occuring."}, {"review_sentiment": 4.0, "review_text": "It meets my expectations!!!"}]}, "authors": ["Edwin O'Connor"], "isbn": "022632141X", "longitude": -71.0595678, "periods": ["1900s"], "title": "The Last Hurrah: A Novel", "word_cloud": "provide good insight local politics particularly first part century good balance positive negative action politician population cultural change time use adroitly politician change power fade give good understanding way amaze political climate invariably people say thing ai kid time change unprecedented territory hear people say year thirty year now clear take political position opinion state affair merely comment fact human behavior repeat aspect much many way man politics really funny nice write style interesting twist wonderful be great time best age politics longer exists classic old politics so interesting presidential election parallel departures certainly interesting tale old style politics community life bring loving memory hurrah worker watch poll attend meeting politician speak run town show candidate speak town issue heart attack man son come find happened others saw thing occur meet expectation", "genres": ["Fiction & Literature", "Politics"], "summary": "“We’re living in a sensitive age, Cuke, and I’m not altogether sure you’re fully attuned to it.” So says Irish-American politician Frank Skeffington—a cynical, corrupt 1950s mayor, and also an old-school gentleman who looks after the constituents of his New England city and enjoys their unwavering loyalty in return. But in our age of dynasties, mercurial social sensitivities, and politicians making love to the camera, Skeffington might as well be talking to us.\r\n\r\nNot quite a roman á clef of notorious Boston mayor James Michael Curley, The Last Hurrah tells the story of Skeffington’s final campaign as witnessed through the eyes of his nephew, who learns a great deal about politics as he follows his uncle to fundraisers, wakes, and into smoke-filled rooms, ultimately coming—almost against his will—to admire the man. Adapted into a 1958 film starring Spencer Tracy and directed by John Ford (and which Curley tried to keep from being made), Edwin O’Connor’s opus reveals politics as it really is, and big cities as they really were. \r\n\r\nAn expansive, humorous novel offering deep insight into the Irish-American experience and the ever-changing nature of the political machine, The Last Hurrah reveals political truths still true today: what the cameras capture is just the smiling face of the sometimes sordid business of giving the people what they want.\r\n\r\n“The best novel about American politics and the best novel about Irish-Americans I have ever read. . . . A superb job of vigorous, humorous writing—funny, engaging, and tolerantly mellow. . . . So good, so enormously readable, and so authoritatively persuasive.” New York Times", "asin": "022632141X", "rank": "466197", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/510b5fGatfL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}