{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 40.8359336, "ratings": {"num_ratings": 9, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I love Shirley Hazzard's writing style - she is vivid in descriptions, adding to my limited imagination and expanding my view point.  It is interesting that she writes in the first person as a man, yet one does not get the feeling of femineity or overt heroism.  There is good balance although tedious plotting.  It's a very good read."}, {"review_sentiment": 5.0, "review_text": "The book is immediately cativating and heart-warming.  Shirley Hazzard and Francis Steegmuller take the reader along with them to love Naples and I never looked back.  I willingly let them force me to love their City just as I imagine they love it."}, {"review_sentiment": 2.0, "review_text": "It is not difficult to be impressed with Shirley Hazzard's command of the english language. But to weigh down one's writing with unnecessary complication is counter productive, if you seek to gain a wide audience. It might be me but I struggled with this book. It was, as I put it, over written with a surprising number of adjectives used to place the reader in the moment. Francis Steegmuller was as we know, a literary scholar, famous for his study of Flaubert. I can see his influence in this book. You could be forgiven for thinking that the sheer volume of historical information about Haples and particularly its history, was unnescssary to convey a reader's view of the place. I enjoyed Ms Hazzard's \"Greene on Capri\" book for it simple but effective descriptions of places and her's and Greene's time on Capri. Why not that simplicity here in her Naples book?A demonstration of one's vocabulary is not needed to paint the picture. The flowing elegance of Gore Vidal is proof enough of this. Ezra Pound used to tell Hemingway \"to avoid adjectives at all cost\". Not bad advice as his economical, pared down style was effective in letting the reader fill in where needed with imagination. His success was put down to ease of reading as one reason for him to successfully reach the widest possible audience.Academic writing has its place I suppose, maybe in college but not on the pages destined for general readership.Two stars for cleverness. I really did want this to flow, as I looked forward to a study of Naples, a place I wanted described to me in easy to read prose.Bill Hanson."}, {"review_sentiment": 5.0, "review_text": "In poetic language, this book doesn't shy away from some of the more harsh realities of Napoli, but brings to light its many beauties, too. Hazzard's book reads like a collection of love letters, or the journal entries of a mother to her child--her affection unmistakable and unconditional (though I think she's willing to see this 'child' more clearly and honestly than most mothers assess their offspring).It's easy to become weary and frustrated with Naples at times (I have occasion to visit regularly because of family), but this book provides welcome reminders to look deeper, to appreciate the privilege of slowly coming to know a place of such complexity and long history, so many colors, textures, tastes and, yes, smells; and a people of such vitality, resourcefulness and resilience.This is a wonderful book that offers Napoli the respect and admiration it is due, despite its shortcomings, and will hopefully inspire readers to visit, to stop being afraid of it, to appreciate and perhaps even, one day, to love it as Hazzard clearly does."}, {"review_sentiment": 4.0, "review_text": "The Ancient Shore is a very erudite collection of meditative essays on Naples, that ancient, mysterious Italian city that combines the ancient, the beautiful, the comedic, the diabolical and the grotesque into an admixture both arcane and awesome. Shirley Hazzard is an erudite author and her prose is learned and languid like the city she admires, although at times her writing can seem more somnambulant than sophic.  The book includes a nice collection of black and white photographs."}, {"review_sentiment": 5.0, "review_text": "Having lived in a suburb of Naples for two and a half years I could relate to much of what was written.  The writing is so poetic and delicious that you will want to reread some of it to others just to enjoy it again.  I only wish I had read this book before I moved to Naples so I could have pondered that unique perspective before facing the angels and demons that awaited me."}, {"review_sentiment": 5.0, "review_text": "I love her books- her style, the language, the contents (never dull, yet never heavy)- just perfect! I love her fiction and now, also her essays! Must read if you love Napoli and surroundings... Brava!"}, {"review_sentiment": 5.0, "review_text": "An incredibly poetic book of essays by a wonderful writer -- you don't even have to have been to Naples to enjoy these!"}, {"review_sentiment": 5.0, "review_text": "Ms. Hazzard and Mr. Steegmuller have written a most astute and heart-warming book about Naples, Italy.  They have felt the pulse of Naple,  the temperament of the locals and written about it in beautiful prose.Naples is always a mixture of chaos and calm; of shouting and respect; of colors and light.  As they write, \". . . Neapolitans move among their extraordinary architecture as in a natural element:  Even the gradest edifices are not \"monuments\" but expressions of temperament in their nobility, their strangeness or sweetness, their theatricality.\"  Thankfully Naples is still relatively unvisited by hordes of tourists and remains our personal, secret jewel.  Thank you to these authors for capturing its essence and loving (most) all of it !"}]}, "authors": ["Shirley Hazzard", "Francis Steegmuller"], "isbn": "0226322025", "longitude": 14.2487826, "periods": ["1900s"], "title": "The Ancient Shore: Dispatches from Naples", "word_cloud": "love write style vivid description add limited imagination expand view point interest writes first person man yet get feeling femininity overt heroism good balance tedious plot good immediately activate never look willingly let imagine difficult impressed command english language weigh write unnecessary complication counter productive seek gain wide audience struggle put write surprising number adjective use place moment know literary scholar famous study see influence think sheer volume historical information particularly history unnecessary convey view place enjoy simple effective description place time simplicity demonstration vocabulary need paint picture flow elegance proof enough use avoid adjective cost not bad advice economical par style effective letting fill need imagination success put ease read reason successfully widest possible write place suppose maybe college page destine general star cleverness really want flow look forward study place want described easy poetic language harsh reality brings light many beauty read collection love letter journal entry mother child affection unmistakable unconditional think willing see clearly honestly mother assess offspring easy become weary frustrate time occasion visit regularly family provide welcome reminder look deeper appreciate privilege slowly come know place complexity long history many color texture taste yes smell people vitality resourcefulness wonderful offer respect admiration due shortcoming hopefully inspire reader visit stop afraid appreciate perhaps even day clearly erudite collection meditative essay mysterious italian city combine beautiful comedic diabolical grotesque admixture arcane awesome author prose learn languid city admires time write seem somnambulist sophic include nice collection black white photograph have live suburb half year much write write poetic delicious want reread others enjoy wish move unique perspective facing angel demon await love style language content never dull yet never heavy perfect love fiction also essay surroundings incredibly poetic essay wonderful writer even enjoy write astute felt pulse temperament local write beautiful always mixture chaos calm shout respect color light write move extraordinary architecture natural element even grade edifice monument expression temperament nobility strangeness sweetness theatricality still relatively unvisited horde tourist remain personal secret jewel author capture essence loving", "genres": ["Essay", "Art & Architecture", "History"], "summary": "Born in Australia, Shirley Hazzard first moved to Naples as a young woman in the 1950s to take up a job with the United Nations. It was the beginning of a long love affair with the city. The Ancient Shore collects the best of Hazzard’s writings on Naples, along with a classic New Yorker essay by her late husband, Francis Steegmuller. For the pair, both insatiable readers, the Naples of Pliny, Gibbon, and Auden is constantly alive to them in the present.\r\n\r\nWith Hazzard as our guide, we encounter Henry James, Oscar Wilde, and of course Goethe, but Hazzard’s concern is primarily with the Naples of our own time—often violently unforgiving to innocent tourists, but able to transport the visitor who attends patiently to its rhythms and history. A town shadowed by both the symbol and the reality of Vesuvius can never fail to acknowledge the essential precariousness of life—nor, as the lover of Naples discovers, the human compassion, generosity, and friendship that are necessary to sustain it.\r\n\r\nBeautifully illustrated by photographs from such masters as Henri Cartier-Bresson and Herbert List, The Ancient Shore is a lyrical letter to a lifelong love: honest and clear-eyed, yet still fervently, endlessly enchanted.\r\n\r\n“Deep in the spell of Italy, Hazzard parses the difference between visiting and living and working in a foreign country. She writes with enormous eloquence and passion of the beauty of getting lost in a place.” Los Angeles Times\r\n", "asin": "0226322025", "rank": "191536", "city": "Naples", "image": "https://images-na.ssl-images-amazon.com/images/I/51JPiPeU8BL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}