{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 30, "rating": 4.0, "reviews": [{"review_sentiment": 1.0, "review_text": "Book only states a couple of points and they are repeated throughout the entire text. This book is weak!"}, {"review_sentiment": 5.0, "review_text": "Excellent study of a truly unique place such as Chungking Mansions, with an affectionate view of its inhabitants and their stories and great insight and analysis of the symbolic role of the Mansions as crossroads of the world. If you have visited the building and experience its unique atmosphere, this book will help to complete the picture and deepen your understanding."}, {"review_sentiment": 5.0, "review_text": "Good"}, {"review_sentiment": 5.0, "review_text": "Excellent reading!  I passed by the Chungking Mansion few years ago and wondered what is this anachronism doing here!?"}, {"review_sentiment": 5.0, "review_text": "Ghetto at the Center of the World is an incredible book about an incredible place. Chungking Mansions is a 17-storied building in Hong Kong that has become an international trade hub because of it’s low prices and central location, gathering at any given time about 4 thousand people in it’s guest houses, stores and restaurants. It is one of the most cosmopolitan places on Earth, the author counted no less than 129 nationalities in the three years of research for the book.One of the central concepts of the book is the one of “low-end” globalization, described thus by the author: “Low-end globalization is very different from what most readers may associate with the term globalization—it is not the activities of Coca-Cola, Nokia, Sony, McDonald’s, and other huge corporations, with their high-rise offices, batteries of lawyers, and vast advertising budgets. Instead, it is traders carrying their goods by suitcase, container, or truck across continents and borders with minimal interference from legalities and copyrights, a world run by cash. It is also individuals seeking a better life by fleeing their home countries for opportunities elsewhere, whether as temporary workers, asylum seekers, or sex workers. This is the dominant form of globalization experienced in much of the developing world today.”“It is amazing how much can be obtained in Chungking Mansions, from lodging to a haircut to halal barbecue, to whiskey of all price ranges, to sex, to computer repairs, to TV remotes, to spy cameras installed in pens and glasses, to stationery, to groceries, to laundry service, to medicines, to legal advice for asylum seekers, to spiritual sustenance for Christians and Muslims. As one well-read informant explained, “There is a self-sufficient ecosystem in Chungking Mansions.” One might never leave the building for weeks or months on end, since virtually all that one might need is in the building itself.”The book brings a fascinating ethnography about how these different nationalities and cultures manage to live side by side. Racism exists and is rampart, specially from the Hong Kong and Mainland Chinese against South Asians and Africans, but grievances are largely put aside in the everyday struggle to make money. It is not a Disney-perfect relationship, but a human and imperfect one, with highs and lows.The book is very well researched and organized in chapters dedicated to the place, the people, the goods, the laws and the future. It is one of the books that really made me feel like I have traveled to this fascinating place. Highly recommended."}, {"review_sentiment": 3.0, "review_text": "It's ok and an interesting read, although the book goes on a bit and could have dome with a bit more careful editing!"}, {"review_sentiment": 5.0, "review_text": "this book is very well researched and captivating to read"}, {"review_sentiment": 3.0, "review_text": "Some interesting insights but a lot of repetition.  As someone who has visited Hong Kong, it provided a lot of insight into what happens behind the scenes."}, {"review_sentiment": 5.0, "review_text": "Professor Mathews lived in the Mansion part time for three years and he traveled with his subjects to Africa for the sake of research.  Wow!  It's not just a book on the Chungking, it is a book about Hong Kong's position in the world."}, {"review_sentiment": 5.0, "review_text": "I've been to Chungking Mansions a number of times, and have heard the varied myths, rumours and some truths about what goes on within its seventeen floors. When I saw that such a book existed, I felt compelled to look further into such a building.Gordon Mathews explores Chungking Mansions like few can, gaining the trust of residents, traders and tourists alike and dedicating his professional life to this project. The final article does not disappoint, and cuts through much of the building's reputation to successfully portray its core.Although primarily an anthropological study, this book appeals to those less interested in the field of study and more interested in the content- the Mansions itself. You hear first hand accounts of the many different categories of people, and learn just what Chungking means to those who walk through its corridors and stay in the guesthouses.I never knew Chungking was THAT important to the world's trade, and my respect for the place has only increased.There are a couple of drawbacks that I feel are worth mentioning. Firstly, as a study, Mathews engrossed himself with the Mansions so much that he regularly refers to his subjects as 'friend'... Perhaps they are, but in my opinion a field study should not be so 'intimate', and instead be an observation from a small distance. This is furthered when Mathews engages to evade the police with one such 'subject' (though Mathews does insist that his friend was innocent in the matter). But don't let that detract you from the book as a commentary of the mansions.Next, as an article on the Mansions themselves, I find this book to be far too short. At the end, I felt that the Mansions had so much more to offer, and I felt an urge to find out more. This, to me, is a testament of just how well Mathews portrays a place so often seen as a shallow, seedy location. He proves that, though some safety issues still exist, Chungking Mansions are so much more than that."}]}, "authors": ["Gordon Mathews"], "isbn": "0226510204", "longitude": 114.1628131, "periods": ["2000s", "Recent Releases"], "title": "Ghetto at the Center of the World: Chungking Mansions, Hong Kong", "word_cloud": "state couple point repeat entire text weak excellent study truly unique place affectionate view inhabitant stories great insight analysis symbolic role crossroads world visited building experience unique atmosphere complete picture understanding good excellent reading pass year ago wonder anachronism incredible incredible place building become international trade hub low price central location gather give time people guest house store restaurant cosmopolitan place author count le nationality year research central concept globalization describe thus author globalization different reader term activity huge corporation office battery lawyer vast advertise budget instead trader carry good suitcase container truck continent border minimal interference legality copyright world run cash also individual seek better life flee home country opportunity elsewhere temporary worker asylum seeker sex worker dominant form globalization experience much develop world amaze much obtain lodge haircut halal barbecue whiskey price range sex computer repair tv remote spy camera instal pen glass stationery grocery laundry service medicine legal advice asylum seeker spiritual sustenance informant explain ecosystem never building week month end virtually build brings fascinate ethnography different nationality culture manage live side side exist rampart specially grievance largely put aside everyday struggle make money relationship human imperfect high well research organize chapter dedicated place people good law future really make feel travel fascinate place recommend ok interest go bit bit careful edit well research captivating interesting insight lot repetition someone visit provide lot insight happen scene live part time year travel subject sake research position world mansion number time heard vary myth truth go seventeen floor saw exist felt compel look explore gain trust resident trader tourist alike dedicate professional life project final article disappoint cut much building reputation successfully portray primarily anthropological study appeal le interested field study interested hear first hand account many different category people learn mean walk corridor stay never know important world trade respect place couple drawback feel worth mention firstly study engross much regularly refers subject perhaps opinion field study instead observation small distance further engage police insist friend innocent matter detract commentary article find far short end felt mansion much offer felt urge testament well portray place often see shallow seedy location prove safety issue still exist mansion much", "genres": ["History", "Urbanism"], "summary": "There is nowhere else in the world quite like Chungking Mansions, a dilapidated seventeen-story commercial and residential structure in the heart of Hong Kong’s tourist district. A remarkably motley group of people call the building home; Pakistani phone stall operators, Chinese guesthouse workers, Nepalese heroin addicts, Indonesian sex workers, and traders and asylum seekers from all over Asia and Africa live and work there—even backpacking tourists rent rooms. In short, it is possibly the most globalized spot on the planet.\r\n\r\nBut as Ghetto at the Center of the World shows us, a trip to Chungking Mansions reveals a far less glamorous side of globalization. A world away from the gleaming headquarters of multinational corporations, Chungking Mansions is emblematic of the way globalization actually works for most of the world’s people. Gordon Mathews’s intimate portrayal of the building’s polyethnic residents lays bare their intricate connections to the international circulation of goods, money, and ideas. We come to understand the day-to-day realities of globalization through the stories of entrepreneurs from Africa carting cell phones in their luggage to sell back home and temporary workers from South Asia struggling to earn money to bring to their families. And we see that this so-called ghetto—which inspires fear in many of Hong Kong’s other residents, despite its low crime rate—is not a place of darkness and desperation but a beacon of hope.\r\n\r\nGordon Mathews’s compendium of riveting stories enthralls and instructs in equal measure, making Ghetto at the Center of the World not just a fascinating tour of a singular place but also a peek into the future of life on our shrinking planet.\r\n\r\n\r\n\"Hong Kong's Chungking Mansions is the most notorious flophouse in Asia. . . . The shabby tenement is today as much about global commerce as tourism. What the building should be renowned for, argues Gordon Mathews in his fluid and enjoyable field study \"Ghetto at the Center of the World\", is the ingenious way 'low-end globalists' eke out profits from petit arbitrage. . . . It reads like a first-rate business book.\" Wall Street Journal", "asin": "0226510204", "rank": "186243", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/51zgcwSntuL.jpg", "country": "China", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}