{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 5, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "This book is a collection of letters with no analysis of the events the letters represent. I read the letters of Alice B. Toklas last year and the author carefully reconstructed some of the relevant events and relationships that were characterized in the letters and this made it a much more interesting read."}, {"review_sentiment": 5.0, "review_text": "I love this collection of letters.  Sylvia Beach was a hero to me as I love books.  What could be more romantic, perhaps, than owning a bookshop in Paris in the time between the wars.  She met every one and helped many.  Ms. Walsh did a great job of footnoting to enlighten the reader.  One gets a good sense of Sylvia Beach--her humor, her integrity, her intellect.  I wish Woody Allen had had his character meet her in her bookshop in Midnight in Paris as she was to me a more important figure in that era than Gertrude Stein!  I only wish there had been more letters!"}, {"review_sentiment": 4.0, "review_text": "Letters sent from Paris and other points by Sylvia Beach to her many friends, over many years. It helps that many of these friends became giants of literature, such as Gertrude Stein, James Joyce, and Ernest Hemingway.While Ms. Beach was a good writer, these letters tend to be of a more family, friendship, or book-business nature. Not much talk of current politics or general social trends. For example, no discussion of her time while interned in France during World War II. However any one interested in the literary life and personalities--especially Joyce--of Paris in the first half of the last century would profit from this book.Keri Walsh has done a superior editing job with this collection of letters. Her occasional comments on the text are clear, unobtrusive, and helpful.(I especially enjoyed this book because it came to me as a gift from my youngest son, whose own birthday happens to fall on Bloomsday. He bought it in Paris at Shakespeare and Company, the successor bookstore named in homage to Sylvia Beach's original.)"}, {"review_sentiment": 5.0, "review_text": "These precious letters from Sylvia Beach to some of the world's most important literary figures of the last century are essential reading for anyone whose interest lies in the expat, modernist movement in 20th Century Paris. Such a wonderful peek into the past though Sylvia's own voice. HIghly recommended."}, {"review_sentiment": 5.0, "review_text": "SO GRATEFUL TO HAVE THESE LETTERS OF THE WONDERFUL SYLVIA BEACH, A PERSON SO IMPORTANT IN THE PARIS LITERARY WORLD OF THE 20'S AND 30'S."}]}, "authors": ["Sylvia Beach"], "isbn": "0231145365", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Letters of Sylvia Beach", "word_cloud": "collection analysis event represent last year author carefully reconstruct relevant event relationship characterize make much interesting love collection hero love perhaps own bookshop time war meet help many great job footnote get good sense humor integrity intellect wish character meet bookshop important figure era wish send point many friend many year help many friend become giant literature good writer tend family friendship nature not much talk current politics general social trend example discussion time intern however interested literary life personality especially first last century do superior edit job collection occasional comment clear unobtrusive helpful especially enjoy come gift youngest son birthday happen fall buy successor bookstore name homage original precious world important literary figure last century essential reading anyone interest lie expat modernist movement such wonderful peek voice recommend so", "genres": ["Memoir"], "summary": "Founder of the Left Bank bookstore Shakespeare and Company and the first publisher of James Joyce's Ulysses, Sylvia Beach had a legendary facility for nurturing literary talent. In this first collection of her letters, we witness Beach's day-to-day dealings as bookseller and publisher to expatriate Paris. Friends and clients include Ernest Hemingway, Gertrude Stein, H. D., Ezra Pound, Janet Flanner, William Carlos Williams, F. Scott Fitzgerald, James Joyce, and Richard Wright. As librarian, publicist, publisher, and translator, Beach carved out a unique space for herself in English and French letters.\r\n\r\nThis collection reveals Beach's charm and resourcefulness, sharing her negotiations with Marianne Moore to place Joyce's work in The Dial; her battle to curb the piracy of Ulysses in the United States; her struggle to keep Shakespeare and Company afloat during the Depression; and her complicated affair with the French bookstore owner Adrienne Monnier. These letters also recount Beach's childhood in New Jersey; her work in Serbia with the American Red Cross; her internment in a German prison camp; and her friendship with a new generation of expatriates in the 1950s and 1960s. Beach was the consummate American in Paris and a tireless champion of the avant-garde. Her warmth and wit made the Rue de l'Odéon the heart of modernist Paris.", "asin": "0231145365", "rank": "1608499", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51jI3mSsEvL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}