{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 10, "rating": 4.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Classic book about a Jewish myth. I bought another book about the Golem at the same time and will continue to buy more."}, {"review_sentiment": 5.0, "review_text": "This is a short (80 pages) story told in simple words about the plight of Jews in the 19th century and how a mystical creature saved lives but created some mischief in a small town in Europe...A small gem!"}, {"review_sentiment": 5.0, "review_text": "Isaac Bashevis Singer has not equal, in this classic, simply told, droll gem."}, {"review_sentiment": 5.0, "review_text": "Great read! Singer makes you dive into Prague and the story about the Golem at tremendous speed, with his unique style while constantly referring to jewels of the Jewish tradition. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "There is a reason Isaac B. Singer won the Nobel Prize for literature, and it can be found in the novella, THE GOLEM. In very conversational, precise language, this is the quintessential storyteller at the height of his full narrative power. A page-turner, for sure."}, {"review_sentiment": 4.0, "review_text": "I remember reading this book from a 1980's edition. The illustrations were all in black & white. I liked this version of the Golem because it give a background into Jewish life in Prague in the Middle Ages, and how the Jews were pretty much at the mercy of the local populace and how the Jews were required by law to be second-class citizens.My problem with the book is the last chapter, where the wife uses the Golem for some far-out treasure hunting project, breaking the \"safety mechanism\" in the Golem (in the original story the Rabbi just gets careless and uses the Golem for \"help\"). The part where the servant falls in love with the \"evolving\" Golem was silly. The story doesn't need a romantic subplot, and I can't see a love-struck teenage girl being attracted to a large clay statue.Nonetheless, the illustrations are great and any kid who likes Harry Potter ought to like this story."}, {"review_sentiment": 5.0, "review_text": "The Golem, as told by IB Singer, is a traditional Jewish mystical short story of a superhuman giant, made of clay, who is brought to life by the most religious rabbi in order to save Jews in times of trouble.  And although it is a \"children's\" story, there are many layers of symbolism to keep adults interested.  This particular edition was especially well done.  I appreciated the artwork and overall esthetic presentation of the book.I came to this book after reading Michael Chabon's Pulitzer Prize winning The Amazing Adventures of Kavallier and Clay, the \"Clay\" in the title being the last name of one of the main characters, but also the substance from which the rabbi made the golem.  Chabon heavily alludes to and borrows from this story, the Golem of Prague, though never quite lets the reader know that this is what he's referring to, almost assuming that the reader already knows about it, which is for most people not the case.  So it was especially rewarding to finally read the story."}, {"review_sentiment": 5.0, "review_text": "This seeming children's story is really a parable for adults (which children can enjoy and eventually get on another level when they are ready).  There are many well crafted sentences about the spiritual life, how to surrender into trusting God to take care of your life, about the hidden saints who help our life on Earth work, how to use our free choice, how to live in community with others, how to relate to believers and nonbelievers, how to handle being falsely accused, and how to be humble with power.  You can taste a whole way of life behind the story which might be worth living or open it at random and find some messages that relate to challenges we meet in daily life."}, {"review_sentiment": 5.0, "review_text": "The Golem is one fo the best known Singer short stories.  Its theme is a Golem, a mythical figure imbued with life by cabalistic magic to help the Jewish people in a time of need.This story begins with persecutions on Jews in Prague, which is when the Golem is sent to Reb Leib.  After helping the Jews in their objective, Reb Leib decides to use the Golem, with its incredible strenght, for a less noble pursuit, which is when the Golem starts to disobey him.  The story unfolds with the Golem, a creature made of clay, turning more and more human, with the mauturity of a child but enormous strenght.  The probelms mount as the Golem destroys all in his way, falls in love (reciprocatedly) and gets drafted by the emperor.The short story evokes many deep issues, such as what it means to be human, what one should do with unending power, what one should do to preserve the peace, and many others.  Though originally a childrens story, any adult would enjoy it.  It is the type of story that leaves one reflecting about certain issues for days."}, {"review_sentiment": 5.0, "review_text": "El Golem tiene todos los ingredientes que necesita un relato para funcionar, pero en este caso, además, está escrito por Singer. Esto significa que el cuento está bellamente narrado. Singer cuenta de manera  simple aún las historias más complejas."}]}, "authors": ["Isaac Bashevis Singer"], "isbn": "0233975349", "longitude": 14.4212535, "periods": ["1800s"], "title": "The Golem", "word_cloud": "classic jewish myth buy time continue short page story tell simple word plight century mystical creature save life create mischief small town small gem equal classic simply tell droll gem great make dive story tremendous speed unique style constantly refer jewel jewish tradition recommend reason literature find conversational precise language quintessential storyteller height full narrative power sure remember read edition illustration black white like version give background life pretty much mercy local populace require law problem last chapter wife use treasure hunt project break safety mechanism original story get careless us help part servant fall evolve silly story subplot teenage girl attract large clay illustration great kid like story tell traditional short story superhuman giant make clay brought life religious rabbi order save time trouble child story many layer symbolism adult interested particular edition especially well do appreciate artwork overall aesthetic presentation come read win title last name main character also substance rabbi make heavily allude borrows story never quite let know refer almost assume already know people case especially reward finally story seem child story really parable adult child enjoy eventually level ready many well crafted sentence spiritual life surrender trust care life hidden saint help life work use free choice live community others relate believer nonbeliever handle falsely accuse humble power taste whole way life story live open random find message relate challenge daily life few best know short story theme mythical figure imbue life cabalistic magic help people time story begin persecution send help objective decide use incredible strength le noble pursuit start story unfolds creature make clay turn human maturity child enormous strength problem mount destroy way fall love reciprocatedly get draft short story evokes many deep issue mean human unending power preserve peace many others originally children story adult type story leave reflect certain issue day tine dodo locus ingredients we necesita un relate para functionary pore est case además est escrito pro significant we e cuento est bellamente narrado cuenta simple an lei historians m completes", "genres": ["Fiction & Literature", "Folklore & Mythology", "Children's Books"], "summary": "A clay giant miraculously brought to life by a saintly rabbi saves a Jewish banker who has been falsely accused in the Prague of Emperor Rudolf II.\r\n\r\n\"Isaac Bashevis Singer's retelling of the legend of the golem is magical and compassionate, redolent with the warmth and philosophical wisdom for which this Nobel laureate is celebrated.\" The New York Times", "asin": "0233975349", "rank": "13617106", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/41itXLvrTcL.jpg", "country": "Czechia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}