{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 4.5980772, "ratings": {"num_ratings": 16, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I read this while I was in Bogota. Feiling's writing style keeps an interesting pace while giving you plenty of historical facts and fun anecdotal stories which truly added to the novel. Made my trip more enjoyable and helped me appreciate all of Colombia."}, {"review_sentiment": 5.0, "review_text": "Very interesting and informative book that is easy to read and provides very good information about the recent history of Colombia and the current culture and flavor of Bogota and other unique areas around the country.  I read it in preparation for my first trip to Colombia and felt very much up to speed on the culture and recent history of Colombia.  Highly recommend."}, {"review_sentiment": 5.0, "review_text": "A great read which added to my impressions and understanding of Colombia. Combines stories and anecdotes with very accessible history and politics.  A wonderful primer for anyone travelling in Colombia."}, {"review_sentiment": 5.0, "review_text": "A nice guide through recent Colombian history."}, {"review_sentiment": 3.0, "review_text": "I was expecting a bit more from this book as there is a fascinating history to be told about Colombia.Tom Fieling is an englishman who previously wrote about Colombia in 'the candy machine' (I think it's called), a book about the Colombian drug trade.  Although the book title specifically mentions Bogota, it really deals with the history of Colombia as a whole.A few things disappointed me about this book.  Firstly, the use of footnoted everywhere gives it a dry, academic feel.  I didn't really need to know at the bottom of each page about the Spanish-language books that he referenced.  Surely that could have been referenced at the back of the book.  I found the footnotes a bit distracting and then just ignored them completely.  I also found the lack of a back story made it hard to just work out the author's angle.  How old was he?  What was he even doing in Colombia in the first place?  That's what separates (IMHO) an interesting read (ala Bill Bryson) from something a bit dry and a chore to read.  The short walks never really had much excitement in them except as an intro to the next chapter.Secondly, the story is very Bogota-centric. To be fair, this is implicit in the book title, but the book is really about the history of Colombia with the 'short walks' device simply splitting up the various chapters.  So it was a bit disappointing to see the interesting history of Cartagena (sacked by the pirate Captain Morgan, among other things) completely ignored.  Likewise, Pablo Escobar is only addressed at the periphery.  Surely that guy deserved a chapter of his own at the very least.  Where was the chapter about the succession of Panama and political interference by the US government to control the canal?Portraying the political elite of Colombia as hypocrites who live in fancy suburbs of Bogota and to hell with the poor people is fair enough.  But I felt the history was written through that same lens.  Certainly it seemed condescending to costenos (coastal people) who are simply described as 'having thicker accents the closer we got to the coast'.I did learn many things from this book.  And Colombia does have a fascinating yet tragic history.  I suspect there might be better or easier reads out there though."}, {"review_sentiment": 4.0, "review_text": "Very worthwhile primer on modern Colombia. Lots to wade through in the chapters about the paramilitaries and the guerrillas, and I would have wished for more discussion of Colombian life and its cities, but clearly those are important issues and I found the book helpful."}, {"review_sentiment": 5.0, "review_text": "If you're literally looking for short walks from Bogotá, you have arrived at the wrong place.On the other hand, if you are looking for a deeper understanding of not just Bogotá but a sense of the history and circumstances that have led to the evolution of contemporary Colombia, you are in for a treat. Tom Feiling's outsider-in perspective is knowledgable, open-minded, perceptive and very well-written. There are traces on-and-off that hints at the author's personality, which is very welcome, but for the most part the writing is journalistic in nature and errs on the side of objectivity.I really liked hearing anecdotes from people in various walks of Colombian life: demobilized guerrillas, costeños, llanos, bogotanos, local politicians, indigenous tribes, expats. This makes for a rather all-encompassing viewpoint.As you might expect, there is no one source for Colombia's problems and no easy answer for its future -- that would be very simple-minded -- and Feiling doesn't pretend to try to hand you either. Without being a tome, Feiling still manages to paint you a pretty comprehensive picture of the country's recent history and its current affairs.It's also worth noting that the tone of the book is not as grim as you might think, but charmingly dispassionate, sprinkled with signs of hopefulness (or wishful thinking?). Highly recommended."}, {"review_sentiment": 2.0, "review_text": "This book has disappointed me and I gave up trying to read it after about 1/3. I found the tone patronising and cynical and this was backed up by the angles taken on various topics, such as simply dismissing the efforts of a Colombian woman (Marta) to talk up her country's culture and positives eg it's literature. He went on to dismiss Colombia's greatest cultural icon, Gabriel Garcia Marquez, whose contribution to journalism and literature are gigantic. Considering this book is meant to step into Colombia's skin to try and understand her current mood, I would have thought listening to her people and respecting the voice of its greatest writer would be a good idea. But no, he seemed more interested in his own opinions, judgements, experiences and journalistic investigations. I thought quite a lot about what was going wrong with this book and ultimately decided the author is stuck in his head in a country that has a deep heart. So I put the book down when it kept annoying me and picked up one by a Colombian - Oblivion by Hector Abad. It is remarkable, loving, tender, tragic and truly beautifully expressed. If you want to delve into the Colombian psyche, be guided by a Colombian."}, {"review_sentiment": 5.0, "review_text": "I read this book after living in Colombia for four months, and found it both enjoyable and some ways enlightening. Colombia is a complex, complicated country, and Feiling's book strikes a good balance between description and analysis. We tend to think of the violence in Colombia as a result of guerrillas vs. the Army, and this book convincingly shows the huge role of paramilitary right wing groups in destabilizing society."}, {"review_sentiment": 5.0, "review_text": "A very insightful analysis of the current issues facing Colombia. It was a pleasure to read and gave me a more rounded perspective on the culture and history."}]}, "authors": ["Tom Feiling"], "isbn": "024195990X", "longitude": -74.0761028, "periods": ["2000s", "Recent Releases"], "title": "Short Walks from Bogotá: Journeys in the New Colombia", "word_cloud": "bogota ceiling write style keep interest pace give plenty historical fact fun anecdotal story truly add trip enjoyable help very interesting informative easy provide good information recent history current culture flavor unique area country preparation first trip felt much speed culture recent history great added impression understand story anecdotes accessible history politics wonderful primer anyone travel nice guide recent colombian history expect bit fascinating history tell previously write candy machine think call colombian drug trade title specifically mention really deal history thing disappoint firstly use footnote everywhere give dry academic feel really need know bottom page reference surely find footnote bit distract ignore completely also find lack back story make hard work author old even first place separate interest ala something bit dry chore never really much excitement intro next story implicit title really history device simply split various chapter so bit disappointing see interesting history sack pirate thing completely ignore address periphery surely guy deserve chapter least chapter succession political interference government control canal political elite hypocrites live fancy suburb hell poor people fair enough felt history write lens certainly seem condescend co stenos coastal people simply describe thicker accent closer get learn many thing fascinate yet tragic history suspect better read very worthwhile primer modern wade chapter paramilitary guerrillas discussion colombian life city clearly important issue find helpful literally look arrive wrong hand look deeper understand sense history circumstance lead evolution contemporary treat perspective knowledgeable perceptive trace hint author personality welcome part write journalistic nature errs side really like hearing anecdote people various colombian life demobilize guerrilla costeños llano bogotanos local politician indigenous tribe expats make rather source problem easy answer future try hand tome still manage paint pretty comprehensive picture country recent history current also worth note tone grim charmingly sprinkled sign hopefulness wishful think recommend disappointed give try find tone patronize cynical back angle take various topic simply dismiss effort colombian woman talk country culture positives eh literature go dismiss greatest cultural icon contribution journalism literature gigantic meant step skin understand current mood listen people respect voice greatest writer idea seem interested opinion judgment experience journalistic investigation think quite lot go wrong ultimately decide author stick head country deep heart put keep annoy pick colombian remarkable love tender tragic truly beautifully express want delve colombian psyche guide colombian live month find enjoyable way enlighten complex complicate country strike good balance description analysis tend violence result guerrilla convincingly show huge role paramilitary right wing group destabilize society insightful analysis current issue face pleasure give round perspective culture history", "genres": ["History", "Travel Writing"], "summary": "For decades, Colombia was the 'narcostate'. Now travel to Colombia and South America is on the rise, and it's seen as one of the rising stars of the global economy. Where does the truth lie?\r\n\r\nWriter and journalist Tom Feiling, author of the acclaimed study of cocaine The Candy Machine, has journeyed throughout Colombia, down roads that were until recently too dangerous to travel, to paint a fresh picture of one of the world's most notorious and least-understood countries. He talks to former guerrilla fighters and their ex-captives; women whose sons were 'disappeared' by paramilitaries; the nomadic tribe who once thought they were the only people on earth and now charge $10 for a photo; the Japanese 'emerald cowboy' who made a fortune from mining; and revels in the stories that countless ordinary Colombians tell.\r\n\r\nHow did a land likened to paradise by the first conquistadores become a byword for hell on earth? Why is one of the world's most unequal nations also one of its happiest? How is it rebuilding itself after decades of violence, and how successful has the process been so far? Vital, shocking, often funny and never simplistic, Short Walks from Bogota unpicks the tangled fabric of Colombia, to create a stunning work of reportage, history and travel writing.", "asin": "024195990X", "rank": "93276", "city": "Bogota", "image": "https://images-na.ssl-images-amazon.com/images/I/51uwzWcYnsL.jpg", "country": "Colombia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}