{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 528, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Capote's writing is captivating.  Although he is best known for In Cold Blood, I prefer these earlier stories.  Breakfast at Tiffany's  was a good movie but the original story by Truman Capote is captivating in another way, delving into a broader range of characters and life in the New York of the late 50s.Also notable in this collection is A Christmas Memory, one of my favorite Christmas stories. It is beautifully written about interesting people.  Capote at his best."}, {"review_sentiment": 1.0, "review_text": "Meh.  I didn't like one person in the book, so I didn't enjoy it at all."}, {"review_sentiment": 5.0, "review_text": "I chose my rating as having only ever seen the movie I decided to read the book...It is very powerful and evokes a tale as old as time."}, {"review_sentiment": 5.0, "review_text": "Truman Capote fantastic as always. Poetry as prose. Three separate stories. Capote, like Ray Bradbury, can enchant the mundane with magical fire."}, {"review_sentiment": 4.0, "review_text": "I will not go into a summary of the book as has been done very adequately in previous reviews.  I purchased the audio version of this book because I’m a fan of borh Mr. Hall and Capote.  I’ve seen the movie as well as having read the book (MANY years ago).  However, hearing the book read was a bit of a revelation.  The movie was somewhat different because back in the 60s, when it was made “required” several changes according to studio heads.  All of the gay references were removed.  If I’m not mistaken, Paul was even gay in the book. In any event, the time period in which the book is set is the 40s so the reader  is.saddled with some racial perjoratives.  Small criticism since those were quite “appropriate” for the time period.  As indicated above, I was most impressed with MCH’s narration.  The voices he used for different characters were excellent.  I honestly thought they had a female narrating Holly’s voice for about the first quarter of the book.  Is there anything MCH can’t do?  I won’t explain here why I gave it four stars instead of five as that might be considered a spoiler.Recommended."}, {"review_sentiment": 1.0, "review_text": "I didn’t even realize the book even ended and continued to read the next short story thinking it had some connection and of course it didn’t. Disappointing. Had to google some descriptions in the book from the lighting of a cigarette part lol that was the first time hearing this “saying” why are there such good reviews on this??"}, {"review_sentiment": 5.0, "review_text": "In rereading this book it makes me sad to realize he’s gone and no longer producing quiet masterpieces like this."}, {"review_sentiment": 5.0, "review_text": "With the possible exception of the Herbert Clutter family of IN COLD BLOOD, Miss Holiday Golightly, \"Traveling,\" has to be Truman Capote's best-known figure.  Those who have seen the movie with Audrey Hepburn may be surprised to read Capote's World War II-set novella and learn that \"Holly\" was more of a demimondaine -- and a bit of a racist -- compared to the beguiling movie.  Still, it's captivating reading.  Perhaps better yet, this volume includes Capote's etheral first novel, OTHER VOICES OTHER ROOMS, written in a style of literary symbolism that captures so well the changes a young orphan goes through when he leaves home, connects with distant relatives in a distant location, and realizes his sexuality.  These two stories are so rich and enjoyable that a hardcover is really the way to go for repeat readings."}, {"review_sentiment": 3.0, "review_text": "Breakfast at Tiffany's -  Maybe I'm spoiled by the movie, or maybe I just don't like Capote? Either way I wasn't overly charmed with the book. Truly, I prefer protagonists I like, and Holly isn't terribly likeable...  It's a classic, probably deservedly so, but it's not my cup of tea. 2 stars.House of Flowers -  I actually really enjoyed this one.  The descriptions, the plot, characters, and just the general flow was lovely to read. I didn't like the last sentence one bit but I can overlook that. 5 starsDiamond Guitar - I have no strong opinion on this story. Nice enough, but quite short. 3 starsA Christmas Memory - 4 stars"}, {"review_sentiment": 5.0, "review_text": "Such a beautifully written story! It is different from the movie and more subversive.Nice to have included some other lovely stories, especially \"A Christmas Memory\"."}]}, "authors": ["Truman Capote"], "isbn": "0241951453", "longitude": 0.0, "periods": ["1900s"], "title": "Breakfast at Tiffany's", "word_cloud": "write captivate best know prefer earlier story good movie original story captivate way delve broader range character life late notable collection favorite stories beautifully write interesting people best like person enjoy choose rating ever see movie decide powerful evokes tale old time fantastic always prose separate story capote enchant mundane magical fire go summary do adequately previous review purchase audio version fan both see movie well year ago however hear bit revelation movie somewhat different back make require several change accord studio head gay reference remove mistake even gay event time period set racial pejoratives small criticism quite appropriate time period indicated impress narration voice use different character excellent honestly think female narrate voice first quarter be anything explain give star instead consider even even end continue next short story think connection course google description light cigarette part first time hear say good review reread make sad go longer produce quiet masterpiece possible exception family figure see movie surprise novella learn demimondaine bit racist compare beguiling movie still captivate read perhaps better yet volume include ethereal first write style literary symbolism capture well change young orphan go leave home connects distant relative distant location realize sexuality story rich enjoyable hardcover really way go repeat reading spoil movie maybe like way overly charm prefer protagonist like holly terribly likable classic probably deservedly cup tea flower actually really enjoyed description plot character general flow lovely like last sentence bit overlook stars diamond strong opinion story enough quite short stars a star such beautifully write story different movie include lovely story especially", "genres": ["Fiction & Literature"], "summary": "In this seductive, wistful masterpiece, Truman Capote created a woman whose name has entered the American idiom and whose style is a part of the literary landscape. Holly Golightly knows that nothing bad can ever happen to you at Tiffany's; her poignancy, wit, and naïveté continue to charm.", "asin": "0241951453", "rank": "59350", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/510PX5YX7SL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}