{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 54, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Fascinating new perspective on Second World War and use of drugs by German military and political leaders,  The benefits they gained from use of crystal meths was essential for the rapid victories in 1940-1 but produced enormous negative effects as the war dragged on. The detailed exposure of Hitler's drug addictions was presented in a lucid convincing argument."}, {"review_sentiment": 4.0, "review_text": "Very interesting and a great insight into the third reich"}, {"review_sentiment": 4.0, "review_text": "An amazing account on the use of drugs by Hitler and the German forces during the 2nd world war"}, {"review_sentiment": 4.0, "review_text": "Fascinating suggestion and partial explanation for what could have possibly moved a country in this direction. Very interesting distinction between the Hitler who came to power and the Hitler who lost power, as well as potential motivations and actions of the people around him."}, {"review_sentiment": 5.0, "review_text": "I am a doctor. I know addiction too well.  I love history. Reading this book and the evidence provided I suddenly begin to realize why the downfall of the German Reich never made sense to me - until now!"}, {"review_sentiment": 3.0, "review_text": "Received."}, {"review_sentiment": 5.0, "review_text": "Very interesting. It all adds up now. Thank god it went the way it did."}, {"review_sentiment": 3.0, "review_text": "Fascinating idea, the idea alone is worth 5 stars. However, although well researched some conclusions seem a bit of a reach, and the book does drag overall, hammering the same points over and over."}, {"review_sentiment": 5.0, "review_text": "For those who wish to understand how the powers at be get the little guy in the street to pick up arms and defend the motherland against all logic, this is the book you should not miss."}, {"review_sentiment": 4.0, "review_text": "Excellent insights and revelations. Rambles a little towards the end and becomes a little repetitive but over all eye opening."}]}, "authors": ["Norman Ohler"], "isbn": "0241256992", "longitude": 13.3888599, "periods": ["1900s", "Recent Releases"], "title": "Blitzed: Drugs in Nazi Germany", "word_cloud": "fascinate new perspective second use german military political leader benefit gain use crystal meth essential rapid victory produce enormous negative effect war drag detailed exposure drug addiction present lucid convincing argument very interesting great insight third reich amazing account use german force world war fascinate suggestion partial explanation possibly country direction interesting distinction come power lose power well potential motivation action people doctor know addiction well love history evidence provide suddenly begin downfall never make sense receive very interest add god go way fascinate idea idea alone worth star however well research conclusion seem bit reach drag overall hammering point wish understand power get little guy street pick arm defend motherland logic miss excellent insight revelation little towards end becomes little repetitive eye opening", "genres": ["History", "WWII"], "summary": "The sensational German bestseller on the overwhelming role of drug-taking in the Third Reich, from Hitler to housewives. \r\n\r\nThe Nazis presented themselves as warriors against moral degeneracy. Yet, as Norman Ohler's gripping bestseller reveals, the entire Third Reich was permeated with drugs: cocaine, heroin, morphine and, most of all, methamphetamines, or crystal meth, used by everyone from factory workers to housewives, and crucial to troops' resilience - even partly explaining German victory in 1940.\r\n\r\nThe promiscuous use of drugs at the very highest levels also impaired and confused decision-making, with Hitler and his entourage taking refuge in potentially lethal cocktails of stimulants administered by the physician Dr Morell as the war turned against Germany. While drugs cannot on their own explain the events of the Second World War or its outcome, Ohler shows, they change our understanding of it. Blitzed forms a crucial missing piece of the story.\r\n\r\n'Extremely interesting ... a serious piece of scholarship, very well researched' Ian Kershaw", "asin": "0241256992", "rank": "493470", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/512oKp2xL4L.jpg", "country": "Germany", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}