{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 25, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "A fantastic and incredibly well written book.  Highly recommended."}, {"review_sentiment": 5.0, "review_text": "I enjoyed reading this book. It's set on the Asian steppe but, since I've never been there, in my mind I imagined the story unfolding in the high deserts of Nevada by the Amtrak train that runs through Lovelock and Winnemucca.  From this book I also learned about the Aral Sea, a place that until recently I'd never heard of.  It's a slow, poetic, beautiful read."}, {"review_sentiment": 4.0, "review_text": "Sarah McNally said (that's what you want to hear, right? She is sharp.) : She liked it but it is a mishmash. Industrial Revolution, Big Brother Watching, Cutting edge space technology center, life as lived going back as far as anyone knows, legends. She is glad she doesn't have to teach the book. As SciFi it barely qualifies. Yedigei was clearly delighted with the family Abutalip but what would we readers think? Later she said in reference to Yedigei and Zaripa that she doesn't believe in unrequited love. Say what?  What about celebrity crushes? Student crushes on teachers who basically think students are a demanding bunch of babies? The neighborhood kid the other kids are giggling about since he is head over heels in love with Queen Amidala. She's never going to write back. Maybe the comment pertained to a private conversation with the reader who brought it up.A group member points out that ten people live in the town. I think the camel represents Yedigei's animal nature that has to be reined in for society to function, and their railroad crossing does have to function, harmoniously. The fox is the reader cautiously approaching this community in hopes of food, a brilliant way to start a novel.My favorite line from Day, p. 158: \"the land was not to blame. It was up to the individual to decide whether to live here or not...\""}, {"review_sentiment": 5.0, "review_text": "One of my favorite books. Wonderful."}, {"review_sentiment": 5.0, "review_text": "Excellent book. The way the story develpes is amazing.Learned about the local culture.Higly recommanded to read for everyone."}, {"review_sentiment": 3.0, "review_text": "I made friends with camels - an interesting book. But to mention the author as a modern Pasternak seems exaggerated."}, {"review_sentiment": 4.0, "review_text": "This is exactly the sort of book I was hoping to find when I started my world fiction challenge: a truly excellent and accessible novel that deserves to be much more widely read. Fiction in translation covers a wide spectrum, sometimes feeling very foreign and bizarre, but there's something wonderful and life-affirming about finding a book like this, that's perfectly relatable and understandable despite (for most English-speaking readers) an enormous cultural gap.The book is about an old man named Yedigei, who works at a tiny railway junction out in the empty steppe of Kazakhstan. His oldest friend, Kazangap, dies at the beginning of the book, and Yedigei leads the other men of the junction out to an ancient cemetery for the burial. On their trip to the cemetery, he reminisces about his life, particularly about an ill-fated family he grew close to in the 1950s. There are also a couple of folk tales included, as well as a science fiction subplot about a first contact with an alien civilization. Which may sound like a lot, but it all comes together very well--even the sci-fi bit, which seemed clumsy until its thematic reason for being in the story became clear.Overall, this is simply an excellent book. It's a compelling story, featuring interesting, three-dimensional characters. The evocative writing brings to life a remote corner of the world, and the translation, including the dialogue, is very readable without being dumbed-down. The author incorporates a lot of 20th century Soviet history while still keeping the focus on the characters. It's also definitely a \"big ideas\" kind of book, with a lot to say about cultural memory, international relations, and the Soviet system (among other things), but again, Aitmatov manages this in a subtle, nondidactic way, keeping the primary focus on the characters and their story.I regret that my Russian isn't nearly up to reading novels, because had I read this in the original, it likely would have gotten 5 stars. As is, the language is quite good, and so it's a very solid 4.5. It would have been nice had the foreword been more about providing the reader with helpful background information (like where in Kazakhstan this actually takes place!) and less about its writer showing off, but as for the novel itself, I have no complaints. Definitely recommended--if you can get your hands on a copy."}, {"review_sentiment": 5.0, "review_text": "This is a used book about the Silk Road. I ordered it through Amazon. It arrived right away in perfectly good condition. I am totally satisfied with the transaction."}, {"review_sentiment": 5.0, "review_text": "I read this book a while ago and could easily some up as one of the best books I ever read. Even though it's a story going on in far Kazakhstan and seems almost historical, its very relevant today and deals with dilemmas and worries we life in today. A book that stays with you ..."}, {"review_sentiment": 4.0, "review_text": "Aitmatov is a Kyrgyz writer who passed away this year. I have never heard of him or his books, but a friend recommended this book to me recently. As is usually the case with friends' recommendations, this book turned out to be a real gem.The story takes place over the course of one day, and includes one major plot and one short sub-plot. Yedigei, a railroad worker in remote Kazakhstan, sets out to bury his old friend, Kazangap, in an old cemetery. Throughout the long journey to the cemetery, Yedigei recounts his personal history and that of the few other souls that live with him at the remote railroad station. The shorter sub-plot involves the discovery of extraterrestrial life by an American astronaut and a Soviet cosmonaut. The location of the Soviet launch site near Yedigei's station serves as the background for this science-fiction background story.I will not go into the plot itself; it is far too elaborate and clever for me to try to summarise it in a few short paragraphs. Aitmatov paints an achingly beautiful picture of hardships of life in the remote steppes of central Asia under Soviet rule. He succeeds in describing the rich tradition and history of the local people and how their culture and practices are challenged by the laws of the Communist regime. The animal world plays a major role in the story, with Yedigei's camel, Karanar, being one of the main characters in the book. There is an ever-present criticism of the Soviet regime, but it is so subtle that the book does not become an anti-government manifest.The sub-plot about the extraterrestrials seems, at first, to be entirely disconnected from the main story. However, as details about the discovery become more apparent, and especially the reaction of the leaders of the USA and the USSR to the discovery, it all comes together. Yedigei's earthly worries and dealings are interwoven with galactic events, to make a strong statement about the human condition. The past, present and future are interwoven in an intricately designed masterpiece.It's hard to do justice to this book by attempting to review it. I learnt a lot about Kazakh culture and the hard-working rural inhabitants of the Sarozek desert. But mostly I learnt that one can tackle the big questions in life through a simple story. In two words, my recommendation is: read it."}]}, "authors": ["Chingiz Aitmatov"], "isbn": "0253204828", "longitude": 0.0, "periods": ["1900s"], "title": "The Day Lasts More than a Hundred Years", "word_cloud": "fantastic incredibly well write recommend enjoy read set steppe never mind imagine story unfolding high desert train run also learn place recently never hear poetic beautiful say want hear right sharp like mishmash edge space technology center life live go back far anyone know legends glad teach barely qualify clearly delight family say reference believe unrequited love say celebrity crush crush teacher basically think student demand bunch baby neighborhood kid kid giggle head heel love never go write back maybe comment pertain private conversation bring group member point ten people live town think camel represent animal nature rein society function railroad cross function harmoniously fox cautiously approach community hop food brilliant way favorite line land blame individual live favorite wonderful excellent way story develpes local recommend everyone make friend camel interest mention author modern seem exaggerated exactly sort hop find start world fiction challenge truly excellent accessible deserves much widely translation cover wide spectrum sometimes feel foreign bizarre something wonderful find perfectly repeatable understandable reader enormous cultural old man name work tiny railway junction empty steppe oldest friend die begin lead men junction ancient cemetery burial trip cemetery reminisce life particularly family grow close also couple folk tale include well science fiction subplot first contact alien civilization lot come together well even bit seem clumsy thematic reason story become simply excellent compel story feature interesting character evocative writing bring life remote corner world translation include dialogue readable author incorporate lot century history still keep focus character also definitely big idea kind lot say cultural memory international relation soviet system thing manage subtle non didactic way keep primary focus character regret russian nearly read novel original likely star language quite good solid nice provide helpful background information actually take place le writer showing complaints definitely recommended get hand copy use order arrive right away perfectly good condition totally satisfied transaction ago easily best ever even story go far seem almost historical relevant today deal dilemma worry life today stay writer pass away year never hear friend recommend recently usually case friend recommendation turn real story take place course include major plot short railroad worker remote set bury old friend old cemetery long journey cemetery yedigei recount personal history soul live remote railroad station shorter involve discovery extraterrestrial life american astronaut soviet cosmonaut location launch site station serve background background go plot far elaborate clever try summary short paragraph paint achingly beautiful picture hardships life remote steppes central rule succeed describe rich tradition history local people culture practice challenge law regime animal world play major role story camel main character criticism soviet regime subtle become extraterrestrial seem first entirely disconnect main story however detail discovery become apparent especially reaction leader discovery come together earthly worry dealing interwoven galactic event make strong statement human condition past present future interweave intricately design hard justice attempt review learn lot culture rural inhabitant desert mostly learn tackle big question life simple story word recommendation", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "By revered Kyrgyz novelist Chingiz Aitmatov, the greatest novel ever written set in Kazakhstan. It is at once a description of Kazakh culture and the hard life in the steppes, a crushing indictment of Soviet policy, a science-fiction story, and a book that makes you think about life.\r\n\r\nSet in the vast windswept Central Asian steppes and the infinite reaches of galactic space, this powerful novel offers a vivid view of the culture and values of the former Soviet Union’s Central Asian peoples.\r\n\r\n\"... a rewarding book.\" ―Times Literary Supplement", "asin": "0253204828", "rank": "231251", "city": "Kazakhstan", "image": "https://images-na.ssl-images-amazon.com/images/I/51xPq4epF4L.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}