{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 5, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I ordered this book for someone else and the person was very satisfied"}, {"review_sentiment": 5.0, "review_text": "It's a tragedy that more of Hessel's work isn't available in English translation. This is lumped in with other flaneur pieces that take a worm's eye view of interwar/ Weimar Germany, but Hessel's descriptive power, his sense of humor, and his knowledge of German history are too keen for this work to be limited or categorized. It's just great literature.The heart of the work is \"The Tour,\" a long Feuilleton piece that describes a day trip the author took with several tourists through Berlin's gardens, markets, arts districts, and statuary-lined streets. The other pieces are uniformly strong, although standouts in my opinion include his description of the seedy Alexanderplatz neighborhood and his narration of what goes on inside Berlin's factories and slaughterhouses (the Germans at the time had an obsession with rationalization and efficiency and American iterations of the same, such as Henry Ford's assembly lines).Someone once quipped that Los Angeles is like your brain; you can only utilize ten percent or so. The same could be said of Berlin, which is mysterious, sad, grim, exciting, and beautiful all at the same time. Berlin started as a swampy military garrison of the Brandenburg-Hohenzollern empire and somehow grew into the cultural capital of Germany and for a time became the dividing line between the two primary political systems of our time.  David Bowie captured close to one-hundred percent of the city's tone in his music. Hessel has achieved something approximating singularity with the city in this book, despite his assertions that he wasn't much more than skimming the surface when he was walking the streets and making his observations. He makes understanding the city's past, present, and future seem effortless, but it can't be easy because so many have failed (at least for this reader) where this book succeeds. Highest recommendation, for travelers, historians, and general literature fans."}, {"review_sentiment": 3.0, "review_text": "Was hoping for a brisk and enlightening jaunt of a read, a mix of Benjamin and Sebald, perhaps. Sadly, no. This book, while in parts interesting, is laregly amazingly dull. Leave it to the scholars and those familiar with Weltvongestern Germany."}, {"review_sentiment": 4.0, "review_text": "Late 1920s Berlin is the time and setting for this walking and driving tour of Germany's capital by a very capable writer, one with an eye toward historical and social detail.If you have had the opportunity to visit or live in Berlin, Franz Hessel's essays will be of keen interest, with more than some of his materiel on buildings, monuments, and districts still relevant today. Disappointingly, there is not much here about the political undercurrent then throbbing that would soon lead to the Second World War and the Holocaust.A preface is provided by Walter Benjamin, who, as an aside and to my mind, was a clearly superior writer to Mr. Hessel."}, {"review_sentiment": 4.0, "review_text": "A physically delightful book, the unusual pink and turquoise cover really caught my eye. A perfect book to take to Berlin to get under the granite and stones facades of this imposing and historically rich city, and gain a real sense of perspective of the legacy evident all around today.Franz Hessel saw himself as a flâneur, someone who sauntered about the capital on foot, and sometimes by car. He would observe the buildings and the people as they went about their daily business. Meandering at times, incisive at others, he brings to life an era that is usually accessible only through blurred black and white photos.He chooses a theme or a “Kiez” (an area, but I doubt if they were called that then) and ponders the historical associations combined with what he could see then and there. There is a real sense of immediacy, as he glides through the streets and stops and reflects. At the heart of his musing he felt that “to date, perhaps, Berlin hasn’t been loved enough” and this memoir is his ode to this city.He considered periods of history and happenings as he made his rounds. His eyes alighted, for example, on the gilded picture frames that came into vogue after the austerity of WW1and the later inflation; the need for people to have something glittery and showy was paramount. How Charlottenburg was created out of the village of Lietzow and how the exotic animals in the Tiergarten each had buildings to reflect their provenance – the camel house for example was a mosque. Statues in the Tiergarten were called the Puppen and later the phrase “bis in die Puppen” was absorbed into everyday language (Google Translate will have you believe it mean “up in the dolls” but in fact means “into the wee small hours” or “very late”). Wine, even, used to be produced in the environs of the city, sour as it was. Tempelhof, the original airport, was named after the Knights Templar, and that, at that point in the 1920s he says “there’s really no reason to visit Neukölln“, actually one of the up-and-coming neighbourhoods of today.He observed how the original Alexanderplatz was already being rebuilt in the 1920s, and this led me in turn to ponder how much change this particular city has seen. Alexanderplatz today would be utterly unrecognisable to the citizens a century ago, having undergone a further major reform when the city was divided. The Fernsehturm (pictured with the book) was the status symbol of the Eastern sector (and when the sun shines it is possible to see a cross on the globe, thought to be an irony in the design as religion was eschewed under Communism). It was erected in 1969.Walking in Berlin is a guide to enlighten and please, aimed, I imagine at those who know the city reasonably well already. For anyone who is unfamiliar with Berlin there can be simply too much information to assimilate and link with the city as it is today. Plenty of footnotes, however, do help to guide the reader a little further.The translation still has the feel of the original German, it retains a slightly stilted structure, underlining that this is indeed a work of translation. I felt this was an intended device, to anchor it in the 1920s, although there were slang turns of phrase such as “the hideous staircase was gotten rid of” which left me questioning some of the quality of the translation.Overall an interesting read for someone who is reasonably familiar with the city and who would like to get a sense of the history, manners and feel of Berlin of the 1920s and how much of that era still echoes today."}]}, "authors": ["Franz Hessel"], "isbn": "0262036355", "longitude": 13.3888599, "periods": ["1900s"], "title": "Walking in Berlin: A Flaneur in the Capital", "word_cloud": "order someone else person satisfy tragedy work available english translation lump piece take worm eye view descriptive power sense humor knowledge german history keen work limit categorized great heart work long piece describes day trip author take several tourist garden market art district streets piece uniformly strong standouts opinion include description seedy neighborhood narration go factory slaughterhouse time obsession rationalization efficiency american iteration assembly line quip brain utilize ten percent say mysterious sad grim excite beautiful time start swampy military garrison empire somehow grow cultural time become dividing line primary political system time capture close percent city tone music achieve something approximate singularity city assertion much skim surface street make observation make understanding city past present future seem effortless many fail least succeed recommendation traveler historians general literature fan hop brisk enlighten jaunt mix perhaps sadly part interest largely amazingly dull scholar familiar late time set drive tour capable writer eye historical social opportunity visit live essay keen interest materiel building monument district still relevant today disappointingly much political undercurrent throb soon second preface provide aside mind clearly superior writer physically delightful unusual pink turquoise cover really catch eye perfect take granite stone facade impose historically rich city gain real sense perspective legacy evident saw flâneur someone saunter foot sometimes car building people go daily business time incisive others bring life era usually accessible blurred black white chooses theme area doubt call ponders historical association combine real sense immediacy glide street stop reflect heart muse felt date perhaps love enough memoir ode consider period history happening make round eye alight example gilded picture frame come vogue austerity later inflation people something glittery showy create village exotic animal tiergarten building reflect provenance camel house example mosque call later phrase bi die absorb everyday language believe mean doll fact mean small hour late even use produced environs city sour original airport name point say really reason visit actually neighborhood observe original already rebuild lead ponder much change particular city see today utterly unrecognizable citizen century undergone major reform city divide picture status symbol sector sun shine possible see cross globe think irony design religion eschew erect guide enlighten please aim imagine know city reasonably well already anyone unfamiliar simply much information assimilate link city today footnote however little translation still original german retain slightly stilted structure underline indeed work translation felt intend device anchor slang turn phrase hideous staircase gotten rid leave question quality interest someone reasonably familiar city sense history manner feel much era still echo today", "genres": ["Travel Writing", "Urbanism"], "summary": "Franz Hessel (1880--1941), a German-born writer, grew up in Berlin, studied in Munich, and then lived in Paris, where he moved in artistic and literary circles. His relationship with the fashion journalist Helen Grund was the inspiration for Henri-Pierre Roche's novel Jules et Jim (made into a celebrated 1962 film by Francois Truffaut). In collaboration with Walter Benjamin, Hessel reinvented the Parisian figure of the flaneur. This 1929 book -- here in its first English translation -- offers Hessel's version of a flaneur in Berlin. In Walking in Berlin, Hessel captures the rhythm of Weimar-era Berlin, recording the seismic shifts in German culture. Nearly all of the essays take the form of a walk or outing, focusing on either a theme or part of the city, and many end at a theater, cinema, or club. Hessel deftly weaves the past with the present, walking through the city's history as well as its neighborhoods. Even today, his walks in the city, from the Alexanderplatz to Kreuzberg, can guide would-be flaneurs.\r\n\r\nWalking in Berlin is a lost classic, known mainly because of Hessel's connection to Benjamin but now introduced to readers of English. Walking in Berlin was a central model for Benjamin's Arcades Project and remains a classic of \"walking literature\" that ranges from Surrealist perambulation to Situationist \"psychogeography.\" This MIT Press edition includes the complete text in translation as well as Benjamin's essay on Walking in Berlin, originally written as a review of the book's original edition.\r\n\r\n\"An absolutely epic book, a walking remembrance.\" -- Walter Benjamin", "asin": "0262036355", "rank": "545423", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/41WVHoUy2ZL.jpg", "country": "Germany", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}