{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 36.1662859, "ratings": {"num_ratings": 19, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "good good"}, {"review_sentiment": 5.0, "review_text": "Read it on the plane to Vegas, good read."}, {"review_sentiment": 5.0, "review_text": "Great read. Very informative."}, {"review_sentiment": 4.0, "review_text": "Short, readable and about the classic move to post modernism in Architecture"}, {"review_sentiment": 5.0, "review_text": "The production quality is low. I think someone else mentioned that it seems to be a bound mimeograph of an older version of the book. And, as the introduction of the book warns, this is an abridged version of the original report. I glanced at the original in the library and was delighted to have the shorter copy.  I think that all the parts that a general architectural tourist might want are here."}, {"review_sentiment": 5.0, "review_text": "This book inspired me to write my final essay for my BA and now to start an Mphil. I love Venturi's realism and I am looking forward to read all of his work"}, {"review_sentiment": 5.0, "review_text": "It was for daughter of my friend for school. She is satisfied. Thanks."}, {"review_sentiment": 5.0, "review_text": "Urban design and architecture from the dynamic duo of venturi and scott brown,"}, {"review_sentiment": 5.0, "review_text": "ROBERT VENTURI WAS ONE OF MY PROFESSORS AT PENN,  DENISE SCOTT BROWN WAS A CLASSMATE.WE ARE STILL LEARNING FROM THEM, 55 YEARS LATER."}, {"review_sentiment": 3.0, "review_text": "This book had a good premise, and within the book there were a few interesting gems I was able to walk away with. But the book is plagued by a poor writing style that didn't convey thoughts coherently or hold the attention of the reader."}]}, "authors": ["Robert Venturi", "Steven Izenour", "Denise Scott Brown"], "isbn": "026272006X", "longitude": -115.149225, "periods": ["1900s"], "title": "Learning from Las Vegas: The Forgotten Symbolism of Architectural Form", "word_cloud": "good good plane good great very informative readable classic move post modernism architecture production quality low think someone else mention seem mimeograph older version introduction warns abridge version original report glance original library delight shorter copy think part general tourist inspired write final essay start love realism look forward work daughter friend school satisfy thanks design architecture dynamic duo venture scott brown good premise interest gem able walk away plagued poor write style convey thought coherently hold attention", "genres": ["Essay", "Art & Architecture"], "summary": "Learning from Las Vegas created a healthy controversy on its appearance in 1972, calling for architects to be more receptive to the tastes and values of \"common\" people and less immodest in their erections of \"heroic,\" self-aggrandizing monuments.\r\n\r\nThis revision includes the full texts of Part I of the original, on the Las Vegas strip, and Part II, \"Ugly and Ordinary Architecture, or the Decorated Shed,\" a generalization from the findings of the first part on symbolism in architecture and the iconography of urban sprawl. (The final part of the first edition, on the architectural work of the firm Venturi and Rauch, is not included in the revision.) The new paperback edition has a smaller format, fewer pictures, and a considerably lower price than the original. There are an added preface by Scott Brown and a bibliography of writings by the members of Venturi and Rauch and about the firm's work.", "asin": "B00A2LXZD6", "rank": "1904401", "city": "Las Vegas", "image": "https://images-na.ssl-images-amazon.com/images/I/312Hpz53k8L.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}