{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 6, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Frank Graziano is a scholar of religion, not a social scientist, but a visit to the Dominican Republic lured him into the subject of Dominican yola (boat) migration.  He searched out passengers and smugglers who would tell him their story—mainly, the ones who have repeatedly failed.  Then he interviewed the Dominican Navy,  the U.S. Coast Guard and Border Patrol, and he also took simple but powerful black-and-white portraits of the migrants. The result is not just informative but profoundly moving.Most yola passengers are drawn from the Dominican poor, a peasant population squeezed off the land by agribusiness and population growth.  They are now totally dependent on cash income in a stagnant economy that cannot employ them in the formal sector.Graziano is amazed by the bravery required to step into a small boat to cross a treacherous strait in which hundreds, perhaps thousands, of migrants have drowned. But most Dominicans are so unfamiliar with the sea, and he sees so many signs of carelessness, that he suspects that rational calculation is actually minimal, and that they take to the sea with the kind of emotional decision-making with which young men volunteer for a war and then expect to step into a war movie.Many of the boats with which Dominicans attempt to cross the Mona Passage to Puerto Rico are not very functional in terms of nautical design, nor are the smugglers very reliable, which leads some migrants to place their faith in relatives  who have even less idea of what they’re doing.According to Graziano, many Dominican wannabes fail to grasp the existence of a large underclass in the U.S., with the result that they are most likely to end up working in the informal sector for Puerto Ricans.  Whether they get no farther than the next island or make it to the U.S. mainland, especially the New York metropolitan area, the Dominicans are part of bumper-ball migration stretching from Haiti to the northeastern United States.I am fascinated by how the experience of the Dominicans parallels that of the many Guatemalans I interviewed for El Norte or Bust!  The boat trips themselves cost only a fraction of what coyotes charge Guatemalans for the overland journey through Mexico to a US safe house, but the rate of failure seems to be much higher.  Graziano believes that 70-80% of yolas are interdicted and the percentage of men who send back remittances seems to be much lower than in the case of Guatemalans.  In a neighborhood surveyed by other investigators, 77% of the households had family members in the US but only  26% were receiving remittances.  From his many interviews Graziano concludes that migration continues even after the sought-after labor market in Puerto Rico or the U.S. mainland is saturated, with the result that migrants cannot pay back the high cost of the trip and lose everything—“without Puerto Rico, without a farm, and without a house” in the words of Dominican observer.When people feel they need to take to the sea in small boats to realize their dreams, there is something very wrong with the society that induces those dreams."}, {"review_sentiment": 5.0, "review_text": "Human, creative and scholarly rigorous a book that gently touches the private stories of migrants then to energetically reveal the multiple causes contributing to their departures. A must read that focuses on the local but compels readers to make connections with the global. I enthusiastically recommend this book."}, {"review_sentiment": 5.0, "review_text": "In addition to the structural factors that are commonly treated in sociological studies, this book treats the personal (frustration, love, ambition) and cultural factors that contribute to migration. The analyses of Coast Guard operations and US Attorney prosecutions are fascinating and enlightening, as are the discussions of border enforcement and US immigration policy generally. Another strength of the book is its empathy, for migrants but also for the Coast Guard, without romanticizing or apologizing for anyone. This study is a major accomplishment and will likely become the definitive work in the field."}, {"review_sentiment": 5.0, "review_text": "Frank Graziano's outstanding book focuses on the Caribbean, but many of its insights are equally applicable to migration to Europe. The book is engaging and moving throughout, and in many places, particularly the mini-biographies of migrants, it reads like a novel. The research and documentation are impeccable. Very highly recommended."}, {"review_sentiment": 5.0, "review_text": "This is one of the rare books that are written to the highest scholarly standards and at once are accessible to nonacademic readers-like me-who are simply interested in the topic. Graziano is perfecting a kind of creative scholarship, a hybrid genre, that is equally satisfying on its surface and in its depth. A must read for anyone interested in undocumented immigration and the US response."}, {"review_sentiment": 5.0, "review_text": "\"Undocumented Dominican Migration\" is an extraordinary book on illegal Dominican migration to Puerto Rico and to the US mainland. This book, well written and well documented, has been accomplished under intense scientific approach. Touched by the great devotion and humanism of its author, American Professor Frank Graziano, the book is the product of several years of research in which Graziano compiled everything written on Dominican migration and made repeated trips to interview in person many migrants in the Dominican Republic, Puerto Rico and, the United States mainland. From all three countries, he also interviewed coastal and migration authorities and visited prisons and contacted prosecutors that had information on the issue at hand. Now armed with large amounts of data, information, and with the precision of his academic integrity and his great social sensitivity, Graziano proceeded to examine closely the undocumented Dominican migration via yola, resulting in his priceless work.  In this book, the author presents undocumented Dominican migration with a depth never seen before. He explores the geographic, economic, political and cultural aspects of it without neglecting the great human drama of the migrants themselves who, in his book, convey directly their own stories before they get touched by the cold statistics and sociological interpretations. Without ceasing to be an eminently academic work, \"Dominican Undocumented Migration\" is also a very entertaining book that is easily read and understood. With a great realism, this book takes us to the lives of poor Dominican migrants and their environment of hope, despair and misery.  With this book, Frank Graziano has made an incalculable contribution to give a deeper insight into the issue of the Dominican Republic undocumented migration. The result of his hard work must be received by the governments of the countries involved with the high valuation it deserves. Graziano's book is worthy of being a required reading in the classrooms of the Dominican Republic and Puerto Rico as well as a reference book for journalists, historians and sociologists. For Dominican governments, this book should serve as a motivation for them to finally take actions to make emigration of Dominican citizens a matter of choice, and not what it is today: an escape hatch through which Dominicans risk their lives to uncertainty, trying to flee from economic and social problems that seem to perpetuate themselves under the shadow of ineptitude, corruption, and impunity."}]}, "authors": ["Frank Graziano"], "isbn": "0292761988", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Undocumented Dominican Migration", "word_cloud": "scholar religion social scientist visit lure subject cola boat search passenger smuggler one repeatedly fail then interview also take simple powerful portrait migrants result informative profoundly cola passenger draw poor peasant population squeeze land agribusiness population growth totally dependent cash income stagnant economy employ formal amazed bravery required step small boat cross treacherous strait hundred perhaps thousand migrant drown unfamiliar sea see many sign carelessness suspect rational calculation actually minimal sea kind emotional young men volunteer war expect step war boat attempt cross functional term nautical design smuggler reliable lead migrant place faith relative even le idea many wannabe fail grasp existence large underclass result likely end work informal sector farther next island make mainland especially metropolitan area part stretch northeastern fascinate experience parallel many interview boat trip cost fraction coyotes charge overland journey safe house rate failure seem much higher believe cola interdict percentage men send back remittance seem much lower case neighborhood survey investigator household family member receive remittance many interview conclude continue even labor market mainland saturate result migrant back high cost trip lose farm house word people feel need take small boat realize dream something wrong society induces dream creative scholarly rigorous gently touch private story migrant energetically reveal multiple cause contribute departures local compels reader make connection global enthusiastically recommend addition structural factor commonly treat sociological study treat personal frustration ambition cultural factor contribute analysis operation prosecution fascinate enlighten discussion border enforcement immigration policy generally strength empathy migrant also romanticize apologize anyone study major accomplishment likely become definitive work field outstanding focus many insight equally applicable engaging move many place particularly migrant read research documentation impeccable very highly recommended rare write highest scholarly standard accessible nonacademic simply interested topic perfect kind creative scholarship hybrid genre equally satisfy surface depth anyone interested immigration response extraordinary illegal mainland well write well document accomplish intense scientific approach great devotion humanism author product several year research compile everything write make repeat trip interview person many migrant mainland country also interview coastal authority visit prison contact prosecutor information issue hand now arm large amount data information precision academic integrity great social sensitivity proceed examine closely cola result priceless work author present depth never see explore geographic economic political cultural aspect neglect great human drama migrant convey directly story get touch cold statistic sociological interpretation cease eminently academic work also entertain easily understand great realism take live poor migrant environment hope despair misery make incalculable contribution give deeper insight issue result hard work government country involve high valuation deserves worthy require reading classroom well reference journalist historians sociologist government serve motivation finally take action make emigration citizen matter choice today escape hatch risk life uncertainty try flee economic social problem seem perpetuate shadow ineptitude corruption impunity", "genres": ["History", "Social & Cultural Studies", "Politics"], "summary": "Undocumented Dominican Migration is the first comprehensive study of boat migration from the Dominican Republic to Puerto Rico. It brings together the interactive global, cultural, and personal factors that induce thousands of Dominicans to journey across the Mona Passage in attempts to escape chronic poverty. The book provides in-depth treatment of decision-making, experiences at sea, migrant smuggling operations, and U.S. border enforcement. It also explores several topics that are rare in migration studies. These include the psychology of migrant motivation, religious beliefs, corruption and impunity, procreation and parenting, compulsive recidivism after failed attempts, social values in relation to law, marriage fraud, and the use of false documents for air travel from Puerto Rico to the mainland United States.\r\n\r\nFrank Graziano’s extensive fieldwork among migrants, smugglers, and federal agencies provides an authority and immediacy that brings the reader close to the migrants’ experiences. The exhaustive research and multidisciplinary approach, highly readable narrative, and focus on lesser-known emigrants make Undocumented Dominican Migration an essential addition to public and academic debates about migration.", "asin": "0292761988", "rank": "3129725", "city": "Puerto Rico", "image": "https://images-na.ssl-images-amazon.com/images/I/51XFSyaI1oL.jpg", "country": "Santo Domingo", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}