{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 4, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "This book talk about a romence, Aurelia got maried to Seixas after she got rich. She wants to see if he loves her or not, because she was poor in the past and he didn`t get married to her when she was poor. I do not recommend it because this book is a little slow."}, {"review_sentiment": 4.0, "review_text": "Alencar was Brazil's first great novelist, at a time when the country was still developing its own identity.  \"Senhora\", published in 1875, is one of his best.  Alencar was nothing if not prolific, he wrote dozens of novels, plays, and poetry, and worked as a journalist and politician.  \"Senhora\" is interesting because it came out during a period when so little serious fiction featured strong women as protagonists.  Aurelia, the title character, is a beautiful young woman who comes into a huge inheritance in 19th-century Rio de Janeiro and overturns social conventions by buying the husband of her choice.  So the story's real depth and primary point of discussion revolves around Brazil's upper class norms, women's social roles, and the power of wealth.  It is interesting in this regard.  Alencar's Romanticism is rooted in a sort of pre-revolutionary distaste (if not disgust) for established social conventions.  He was a wealthy intellectual criticizing his own milieu.Perhaps his descriptions of wealth --pages dedicated to the delicate inlays in a single piece of furniture or the passion of a waltz-- are overwrought, and may strike some readers as being born of Alencar's lust for upper class pursuits, rather than of any detached criticism of them.  Readers must be prepared for these careful descriptions of wealthy follies, for by modern standards very little happens in the story.  Alencar was a Romanticist, meaning that he cultivated in his writing elements of anti-classicism, of free-form emotion, and of descriptions of settings rather than tracing the chronology of a plot.  This is a story driven on one level by its complicated prose and on another by its social criticism and the depth of its characters.  Modern readers looking for plot and action may not have the patience for this book, and may also find the ending (called a \"surprising twist\" by some critics) to be a bit of a cop-out.  It's as though Alencar didn't want to write any longer or didn't want to disappoint what he imagined to be a primarily female audience thirsting for romantic closure."}, {"review_sentiment": 5.0, "review_text": "A read this book a long time ago, in high school, and enjoyed it very much. For those of you who know nothing about brazilian literature, here goes a little profile about the author: \"JOSÉ MARTINIANO DE ALENCAR  was born in Mecejana, Ceará, on 1 May, 1829, and died in Rio de Janeiro on  12 December, 1877. He studied law in São Paulo and Olinda, and then threw  himself into the journalistic world of Rio de Janeiro. He later entered  politics becoming a deputy and eventually Minister of Justice. The refusal  of the Emperor, however, to accept his nominatiou as senator caused him to  retire from public life. One of the most prolific of Brazilian writers,  José de Alencar was at the same time journalist, novelist, dramatist and  poet. He was widely read in French literature, and romantic writers such as  Dumas, Chateaubriand and Hugo had a profound influence on him. To the  romantic mood of the day he added a fervent patriotism, which found its  ideal subject in the history of his conntry, and especially in the life and  legends of the Brazilian Indian, whose champion he became (c. f. Gonçalves  Dias in poetry). His interest ranged the whole length and breadth of  Brazil, and there are few regions of that vast country which did not  provide subjectmatter for his pen. He practically created the Brazilian  historical novel, and achieved wide popularity with the publication of such  works as O Guarani (Rio, 1857); As Minas de Prata (Rio, 1862); and Iracema  (Rio, 1865). The exuberance of his frankly avowed romanticism and a  pompous, declamatory style are now very foreign to our modem taste, but his  gifts as a story-teller and his patriotic spirit will always ensure him a  place among Brazil's most popular writers. Other major works: O Gaúcho  (Rio, 1870); O Tronco do Ipê (Rio, 1871); Ubirajara (Rio, 1874); Senhora  (Rio, 1875).\""}, {"review_sentiment": 5.0, "review_text": "This book is amazing!  Very romantic in a unique, intense, vivid, ironic, and poetic way. The author geniously has created a most remarkable woman whom, through money, will buy her ex into marriage with hope that he will  be torn enough between love and their game of ironic humiliation to break  out his profound feelings of love for her and see how hers painfully never  faded. an excellent novel, one of the best i have ever read!-----Esta  novela es increíble!  Es MUY romantica de una manera única, intensa,  brillante, irónica y poetica.  El autor ha creado geniosamente a una mujer  extraordinaria, quien tras el dinero comprará el matrimonio con su ex, con  esperanza que el amor y su juego de humiliación irónica le desgarrará y  librará sus sentimientos profundos de amor para ella y verá cómo los de  ella nunca habían desaparecido.  (how's that translation?  ¿qué tal la  traducción?)"}]}, "authors": ["José de Alencar"], "isbn": "029270450X", "longitude": 0.0, "periods": ["1800s"], "title": "Senhora: Profile of a Woman", "word_cloud": "talk romance get marry get rich want see love poor past get marry poor recommend little slow first great novelist time country still develop identity publish best alencar nothing prolific write dozen novel play poetry worked journalist politician interesting come period little serious fiction feature strong woman protagonist title character beautiful young come huge inheritance overturn social convention buy husband choice story real depth primary point discussion revolve upper class norm woman social role power interest regard root sort distaste disgust establish social convention wealthy intellectual criticizing description wealth page dedicate delicate inlay single piece furniture passion waltz overwrought reader born lust upper class pursuits rather detached criticism reader careful description wealthy folly modern standard little happens story meaning cultivate write element emotion description setting rather trace chronology plot story drive level complicate prose social criticism depth character reader look plot action also end call surprising twist critic bite want write longer want disappoint imagine primarily female audience thirst romantic closure long time ago high school enjoy much know nothing brazilian literature go little author bear die study law throw journalistic world later enter politics become deputy eventually refusal however accept nomination senator cause retire public life prolific brazilian writer time journalist novelist dramatist poet widely french literature romantic writer profound influence romantic mood day add fervent patriotism find ideal subject history country especially life legends brazilian indian champion become interest range whole length breadth region vast country provide subject matter pen practically create brazilian historical achieve wide popularity publication work exuberance frankly avow romanticism pompous declamatory style foreign modem taste gift patriotic spirit always place popular writer other major work amazing romantic unique intense vivid ironic poetic way author ingeniously create remarkable money ex marriage hope tear enough love game ironic humiliation break profound feeling love see painfully never fade excellent best ever novel e incredible romantic mantra intense brill ante ironical poetics auto ha credo geniosamente tuna mugger extraordinarily quine trey e diner comprará e matrimonial con sew con esperanza we armor sew ego ironical le desgarrará library such sentiment profundos ella vert como locus nun ca habían desaparecido translation lat la traducción", "genres": ["Fiction & Literature"], "summary": "\"It is a truth universally acknowledged . . .\" that a single woman in possession of a good character but no fortune must be in want of a wealthy husband—that is, if she is the heroine of a nineteenth-century novel. Senhora, by contrast, turns the tables on this familiar plot. Its strong-willed, independent heroine Aurélia uses newly inherited wealth to \"buy back\" and exact revenge on the fiancé who had left her for a woman with a more enticing dowry.\r\n\r\nThis exciting Brazilian novel, originally published in 1875 and here translated into English for the first time, raises many questions about traditional gender relationships, the commercial nature of marriage, and the institution of the dowry. While conventional marital roles triumph in the end, the novel still offers realistic insights into the social and economic structure of Rio de Janeiro in the mid-1800s. With its unexpected plot, it also opens important new perspectives on the nineteenth-century Romantic novel.", "asin": "029270450X", "rank": "2210447", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/41667XTXvvL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}