{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 21.161829, "ratings": {"num_ratings": 100, "rating": 4.9, "reviews": [{"review_sentiment": 5.0, "review_text": "I am absolutely blown away by how amazing this book is. History, biology, food, geography, photography. I couldn't even begin to absorb it all in one sitting. I love the Yucatan. I've been there numerous times, eaten well, and am very interested in the culture of the Maya. That said, I clearly only scratched the surface in three trips. This book clearly demonstrates the beauty of what can happen when one spends 10 years researching and fine-tuning something that is clearly the core of one's heart. I would love to meet David Sterling one day, and shake his hand for creating a \"cook book\" that is worthy of passing down to my 12-year-old son as a family heirloom. This book is simply fantastic."}, {"review_sentiment": 5.0, "review_text": "Lovely and complete."}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 5.0, "review_text": "David was a very good friend and excellent chef. He spent eleven years traveling to different parts of Mexico to come up with this marvelous book."}, {"review_sentiment": 5.0, "review_text": "As one who has lived in Yucatan off and on for 20 years, and who cooks traditional dishes as often as I can, this is an amazing volume. So sorry to hear that the author has passed away. I surely wanted to visit him at his cooking school in Merida."}, {"review_sentiment": 5.0, "review_text": "I bought this beautiful book as a gift for my daughter but I simply had to read it from cover to cover before gifting it.  I have followed all the Mexican chefs on TV for years, Rick Bayles, Diana Kennedy, Susanna Trillling, etc. but when I saw David on Rick Bayles' show, I could see the depth of his love and knowledge for the food of a state in Mexico that lures me back over and over.  I truly feel that these recipes are stiff competition for the classical French cooking compendiums."}, {"review_sentiment": 5.0, "review_text": "Details and background and great photos"}, {"review_sentiment": 5.0, "review_text": "VERY NICE!"}, {"review_sentiment": 5.0, "review_text": "Beautiful  pictures.  Lots of great recipes!"}, {"review_sentiment": 3.0, "review_text": "Excellent book, though hard to look things up. Some things are not listed with page numbers in index, and since book is organized by region, it can take forever to find something you're looking for.  Great recipes, explanations and stories.  **My only problem is that the book came with a section of pages not attached inside - I could not return as my parents brought it overseas for me and I couldn't make the take it back and deal with returning it."}]}, "authors": ["David Sterling"], "isbn": "0292735812", "longitude": -86.82505, "periods": ["Recent Releases"], "title": "Yucatán: Recipes from a Culinary Expedition", "word_cloud": "absolutely blow away amazing biology food geography photography even sit love numerous time eaten well interested culture say clearly scratch surface trip clearly demonstrate beauty spend year research something clearly core heart meet day hand create cook worthy pass son family heirloom simply fantastic lovely complete great good friend excellent chef spend eleven year travel different part come marvelous live year cook traditional dish often amazing volume sorry hear author pass away surely want visit cook school buy beautiful gift daughter simply cover gift follow chef tv year etc saw show depth knowledge food state lure back truly feel stiff competition classical french cooking compendium detail background great photo very nice beautiful picture great excellent hard look thing thing list page number index organize region forever something look explanation story problem come section page attach parent brought overseas deal returning", "genres": ["Food and Wine"], "summary": "Winner, James Beard Foundation Best Cookbook of the Year Award, 2015\r\nJames Beard Foundation Best International Cookbook Award, 2015\r\nThe Art of Eating Prize for Best Food Book of the Year, 2015\r\n\r\nThe Yucatán Peninsula is home to one of the world's great regional cuisines. With a foundation of native Maya dishes made from fresh local ingredients, it shares much of the same pantry of ingredients and many culinary practices with the rest of Mexico. Yet, due to its isolated peninsular location, it was also in a unique position to absorb the foods and flavors of such far-flung regions as Spain and Portugal, France, Holland, Lebanon and the Levant, Cuba and the Caribbean, and Africa. In recent years, gourmet magazines and celebrity chefs have popularized certain Yucatecan dishes and ingredients, such as Sopa de lima and achiote, and global gastronomes have made the pilgrimage to Yucatán to tantalize their taste buds with smoky pit barbecues, citrus-based pickles, and fiery chiles. But until now, the full depth and richness of this cuisine has remained little understood beyond Yucatán's borders.\r\n\r\nAn internationally recognized authority on Yucatecan cuisine, chef David Sterling takes you on a gastronomic tour of the peninsula in this unique cookbook, Yucatán: Recipes from a Culinary Expedition. Presenting the food in the places where it's savored, Sterling begins in jungle towns where Mayas concoct age-old recipes with a few simple ingredients they grow themselves. He travels over a thousand miles along the broad Yucatán coast to sample a bounty of seafood; shares \"the people's food\"at bakeries, chicharronerías, street vendors, home restaurants, and cantinas; and highlights the cooking of the peninsula's three largest cities—Campeche, Mérida, and Valladolid—as well as a variety of pueblos noted for signature dishes. Throughout the journey, Sterling serves up over 275 authentic, thoroughly tested recipes that will appeal to both novice and professional cooks. He also discusses pantry staples and basic cooking techniques and offers substitutions for local ingredients that may be hard to find elsewhere. Profusely illustrated and spiced with lively stories of the region's people and places, Yucatán: Recipes from a Culinary Expedition is the long-awaited definitive work on this distinctive cuisine.", "asin": "0292735812", "rank": "95208", "city": "Cancun", "image": "https://images-na.ssl-images-amazon.com/images/I/61DPE4pV%2BzL.jpg", "country": "Mexico", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}