{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 10, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "great! best service. Nice and valuable. just buy one for myself, An absolutely great product! I was able to thin cut a baguette that usually I struggle with. Perfectly smooth cutting!"}, {"review_sentiment": 5.0, "review_text": "Great book... but rather sad seeing all those beautiful old buildings falling into dis-repair. Maybe now, tho, good things might start to happen in that respect and also for the Cuban people."}, {"review_sentiment": 3.0, "review_text": "Meh"}, {"review_sentiment": 3.0, "review_text": "Very short."}, {"review_sentiment": 5.0, "review_text": "Great!"}, {"review_sentiment": 5.0, "review_text": "For those who think Castro has done something right in Cuba, this will show part of the Havana pre-communism. Many of the buildings featured are already destroyed."}, {"review_sentiment": 3.0, "review_text": "The book relies too much on photographs without explaining what is being shown in the photographs. This is not really representative of Michener's typical style. There is so much he could have taught us about the people and culture of Cuba and all he came up with was a slick photo essay that teaches virtually nothing."}, {"review_sentiment": 5.0, "review_text": "This book is wonderful.  Escorted a group to Cuba, read this book before taking the trip.  Amazing how little Cuba has changed from the time Michener wrote this book.  A truly must read book if you have interest in Cuba.  ss"}, {"review_sentiment": 3.0, "review_text": "I will admit right off that I am biased because, as Public Affairs Officer in the U.S. Interests Section, I hosted James Michener's stay in Havana while he collected data for \"Caribbean\" and later collaborated with John Kings on the photography used in the book. Despite his glowing praise for my services (page 27), Michener was an old hand at adapting to circumstances and hardly needed me to orient him. He arrived with a fixed agenda and stuck with it. We departed from the agenda from time to time as his curiosity grew and Cuban contacts of mine beguiled him. As for his impressions, they are lucid, provocative, insightful and of course superficial. To know Cuba requires years of delving into the psychology of the quixotic Cuban people and their turbulent history. Michener's kitchen Spanish was adequate in restaurants but hardly up to a good conversation. I wondered how his early masterpiece \"Iberia\" could be so complete without a solid knowledge of Spanish? Anyway, he asked me to take 1000 photos of Havana which I did happily under the watchful eyes of Cuban security forces. His editors selected 70 or so of mine and 12 of Kings for inclusion. (No reference to my photopgraphy is given in the book by my own request as a diplomat shouldn't be caught moonlighting for the presses). I believe Michener used them for references to his quick glimps into Cuban society. His light comments tell the tale of a tourist abroad who is infected with the aura of Cuban life under the tyrant...,excuse me \"comandante en jefe\" Castro. Not a bad read for someone who likes their rum with coke--better known as a Cuba Libre. Viva Michener!  Comments to jerrywscott1@cs.com"}, {"review_sentiment": 4.0, "review_text": "\"Six Days in Havana\" is Michener's companion volume to the novel \"Caribbean.\" Though the narrative is rather short, Michener's tradition of never failing to please holds up here, and the brevity is more  than made up for by John Kings' absolutely fantastic color photos of Cuba.  This volume serves both as a behind-the-scenes tour of the Cuban chapters  of \"Caribbean\" and as the closest tour of Cuba an American is  likely to get anytime soon. Perfect for the almost-complete Michener  collection. (Also features a short section by Kings.)"}]}, "authors": ["James A. Michener", "John Kings"], "isbn": "0292776292", "longitude": -82.3658671, "periods": ["1900s"], "title": "Six Days in Havana", "word_cloud": "great best service valuable absolutely great product able thin cut baguette usually struggle perfectly smooth cut rather sad see beautiful old building fall maybe tho good thing respect also people meh very short great think do something right show part building feature already destroy relies much photograph explain show photograph really representative typical style much people culture come slick photo essay teach virtually nothing wonderful group take trip little change time write truly interest s admit right bias host stay collect data later collaborate photography use glow praise service page old hand adapt circumstance hardly need orient arrive fixed agenda stuck depart agenda time time curiosity grow contact mine beguile impression lucid provocative insightful course superficial require year delve psychology quixotic people turbulent history kitchen spanish adequate restaurant hardly good conversation wonder early masterpiece solid knowledge spanish ask photo happily watchful eye security force editor select mine inclusion reference photography give request diplomat catch moonlight press believe use reference quick gimp society light comment tell tale tourist abroad infect aura life tyrant excuse com andante not bad someone like rum better know comment companion volume narrative rather short tradition never fail please hold brevity make absolutely fantastic color photo volume serve tour chapter closest tour likely get anytime soon collection also feature short section king", "genres": ["Essay", "Art & Architecture", "History", "Travel Writing"], "summary": "When James Michener visited Havana with his associate John Kings, he was only researching Cuba for a new novel on the Caribbean, but he found much more to excite his interest. Michener's insightful text and Kings's evocative photographs record their impressions of Havana thirty years after the Revolution.\r\n\r\nIn a brief text for ''Six Days in Havana,'' Mr. Michener gives his sympathetic impressions of the people and especially of the well-fed and educated children. He visited many public and private places, soaking up the atmosphere that he needed for ''Caribbean,'' and was treated cordially by those he met and interviewed. He paid homage to La Vigia, where Ernest Hemingway lived during his productive years in Cuba.\r\n\r\nMr. Michener and Mr. Kings did not get to see Fidel Castro during their brief, nonpolitical stay, and they do not presume to pass instant judgment on the effects of the revolution. But both discovered that there are two American heroes in Castro's Cuba. Hemingway is the second. The first is the Cuban-born Jose Canseco, one of the star players for the Oakland Athletics. Children chant his name in the streets; his batting average is followed as closely in Cuba as in California. It's not hard to guess who they were rooting for in Havana during the World Series.\r\n\r\nNew York Times", "asin": "0292776292", "rank": "996743", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/5144V2YDNVL.jpg", "country": "Cuba", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}