{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 18, "rating": 3.1, "reviews": [{"review_sentiment": 2.0, "review_text": "It was just OK, not great character development."}, {"review_sentiment": 1.0, "review_text": "Just didn't care about the characters, and with little storyline to capture my imagination, I didn't finish."}, {"review_sentiment": 5.0, "review_text": "Classic ... a must read for any political junkie."}, {"review_sentiment": 1.0, "review_text": "Ok, I get it. This is supposed to be a book about Austin and Texas politics in the 1960s. It was written by a guy who was on LBJ's staff. All I have to say is that he must have been asleep. Texas politics was a great deal more hard hitting than this book. I seldom give up on a book. This one is really three novels in one. The first one starts off slow and maintains that same pace. The second one slows it down even more. It wanders around with a bunch of characters that have no depth, but I guess, there wasn't much depth in Austin in 1960. It is supposed to be a Texas Classic ( my reason for buying it). I do not think it will add much to anyone's body of knowledge much less their enjoyment."}, {"review_sentiment": 3.0, "review_text": "I read this because in a recent interview Larry McMurtry said it was one of the two best books about Texas, the other being one of his. I've enjoyed three or four of his novels and I like Texas so that was good enough for me. Mistake. The writing was good, description, narration and characterization, but there's really no plot. If you don't care about the people then what's the point and the people were too uniformly a depressed bunch of heavy drinkers whose unhappiness was difficult to understand or empathize with."}, {"review_sentiment": 3.0, "review_text": "This book is about Texas, for me one of the least likely states to be called \"The Gay Place.\"  But, hey, the book was written in 1961, before gay people were invented, so it's no surprise that the term then had a different meaning.  What is that meaning?  I was never quite sure.  There are no gay people (in today's sense) in this novel.  But there are certainly lots of interesting characters, the governor being perhaps the most intriguing.  He appears in all three of the novellas that compose the novel, and is the major character in the third.I recently read two of Robert Caro's volumes on LBJ, so thought this book might provide the frosting on the cake, at around 500 pages, after I plowed through the other two at around a thousand pages each.  But this one was a bit disappointing.  Nothing significant really happens, although that's not necessarily a drawback.  I've enjoyed many books in which character development is so striking that the absence of major plot twists doesn't matter.  But in this book the main activities are drinking and political manipulation.  Not surprising for Texas, of course, although that state certainly doesn't have a monopoly on such actions.  Talking about sex is also prominent, but relatively few actual sex scenes are included.I notice that reviewers from Austin give the book high marks, perhaps partly because of references to places they know and love, and partly because at the time of writing Austin was just beginning to take off from being a sleepy backwater into becoming a major urban metropolis.  (If I lived in Texas, it would certainly be in Austin.)I see why Lady Bird frowned on this book being published, right during the height of LBJ's rise to power, but in a sense the novel's depictions show that Johnson was not by any means the only crude, manipulative, power seeking, ruthless person in the state.  In that sense, LBJ seems not so different from his peers.  Since I can appreciate LBJ for the \"good\" things he did, I can also perhaps forgive him more readily for the bad moments, given that so many others seem to have had the same profile.Billy Lee Brammer worked for LBJ, but suffered an early demise.  I wonder which part of the book is his autobiography, and whether excessive drinking and carousing played a part in this death.  (3-1/2 stars.)"}, {"review_sentiment": 3.0, "review_text": "This book is made up of two novels.  I slogged through the first one.  Billy Lee Brammer should have written his own life story -it would have been much more interesting.  Actually, this is probably a part of his personal experience in this slice of life story.I never found any part that made me feel engaged, much less sympathy, for any of the aimlessly wandering characters.Maybe the second novel would have been better, but I was eager to move on to a different book."}, {"review_sentiment": 4.0, "review_text": "One of the most famous watering holes in Austin, Texas, where legislators, lobbiests, government officials, businessmen, and university students hung out, was a gay, happening place that attracted all comers. Into this beer-infused environment, came much of the \"bidness\" of government and other fascinating transactions. Billy Lee Brammer, author of The Gay Place, definitely knew where the bodies were buried, and for reasons all his own, he decided to reveal a lot of it here. Austinites, who sat up night after night, matching information from the novel with assorted colorful, non-fictional characters, were intrigued with backstories that gave legs to whispered rumors. Over time, many changes have occurred, not only with the characters and places themselves, but also with the words used to describe them. A sneak peek into the colorful citizens of a smallish Texas town on the cusp of exploding into a sophisticated city, this three-books-in-one novel is a fun read for those who have moved in later and heard the stories."}, {"review_sentiment": 3.0, "review_text": "I might have gone with four stars if not for the format of three interlocking novellas. I would have preferred one long, fully connected story. The three novels revolve around the LBJ-like Texas governor Arthur Fenstermaker, although he is, oddly, almost a minor character in the first two novels. They focus more on the younger, less influential political players in the governor's orbit. When Fenstermaker does make an appearance, he demonstrates the raw power of the good ol' boy network of politicking.All of the novels follow the self-inflicted downward spiral of the '50s-era Austin-tatious new rich, in all their debauched and vulgar incarnations. These were people who had started out in a highly idealistic, progressive political movement. They dissolved their lofty liberal hopes for the nation in an endless wash of booze and general moral degradation.Billy Brammer was a staffer for Lyndon B. Johnson, so I have no doubt this is an accurate fictionalization of the time and place. Brammer was a fine writer with a special ability to probe the minds and hearts of characters who recognize their own weaknesses but can't seem to detach themselves from the thrill of power and the fun of being one of the beautiful people.I had some difficulty remaining sympathetic toward the characters. Somewhere around the second chapter of the third novel, I was weary of them, and bored with their faux-apologetic drunken fumbling for each other's fleshy protuberances and dangling bits. It's a credit to Brammer that he created them so convincingly, and I'm grateful to have been reminded of why I stepped away from greater involvement in politics after my own experiences with people of this ilk in college."}, {"review_sentiment": 4.0, "review_text": "Billy Lee Brammer's THE GAY PLACE deserves its acclaim as one of the great political novels. Brammer beautifully--and that really is the right word to describe Brammer's ear for dialogue--recreates the political world of 1950s Texas of which LBJ was the undisputed king. Governor Arthur Genstemaker is pure LBJ, so much so that one gets the sense that this novel was must reading for Robert Caro when Caro set out to write the definitive biography of the one time president. What is also obvious with the book is how much politics is not a happy place, that the lives of the participants are empty, that relationships are ruined, and that alocohalism and unfaithfulness are givens.It is anything but a gay place.Why not then a five star review given the praise above? The three pieced together extended stories--\"The Flea Circus,\" \"Room Enough to Caper,\" and \"Country Pleasures\"--really should have been novels each on their own. In extending each, Brammer would have been able to work through some of his pacing issues and also the conclusion to \"Room Enough to Caper.\""}]}, "authors": ["Billy Lee Brammer"], "isbn": "0292708319", "longitude": -97.7436995, "periods": ["1900s"], "title": "The Gay Place", "word_cloud": "great character development just care character little story line capture imagination finish classic political junkie ok get suppose politics write guy staff say politics great deal hard hitting seldom give really novel first start slow maintains pace second slow even wander bunch character depth guess much depth suppose reason buying think add much anyone body much le enjoyment recent interview say best enjoy novel like good enough mistake writing good description narration characterization really care people point people uniformly depress bunch heavy drinker unhappiness difficult understand least likely state call hey write people invented surprise term different mean mean never quite sure people today sense certainly lot interest character governor perhaps intrigue appear novella compose major character recently volume think frost page plow page bit disappointing significant really happen necessarily enjoy many character development strike absence major plot twist matter main activity drink political manipulation not surprising course state certainly monopoly action talk sex also prominent relatively actual sex scene notice reviewer give high mark perhaps partly reference place know partly time write begin sleepy backwater become major urban metropolis live certainly see lady frown publish right height rise power sense depiction show mean crude manipulative power seek ruthless person state sense seem different peer appreciate good thing also perhaps forgive readily bad moment give many others seem work suffer early demise wonder part autobiography excessive drinking carouse played part death star make novel slog first write life story much actually probably part personal experience slice life never find part make engaged much le sympathy aimlessly wander second eager different famous water hole legislator lobbies ts government official businessmen university student hang happen attract comer environment come much badness government fascinate transaction author definitely know body bury reason decide reveal lot sit night night match information assort colorful character intrigue backstories give leg whispered rumor time many change occur character place also word use sneak peek colorful citizen smallish town cusp explode sophisticated city fun move later hear story go star format interlock novella long fully connect story novel revolve governor oddly almost minor character first novel focus younger le influential political player governor orbit make appearance demonstrates raw power good lo boy network novel follow downward spiral new rich debauch vulgar incarnation people start highly idealistic progressive political movement dissolve lofty liberal hope nation endless wash booze general moral staffer doubt accurate fictionalization time fine writer special ability probe mind hearts character recognize weakness detach thrill power fun beautiful difficulty remain sympathetic character somewhere second chapter third weary bore drunken fumbling fleshy protuberance dangle bit credit create convincingly grateful remind step away greater involvement politics experience people ilk college billy deserve acclaim great political novel beautifully really right word dialogue recreates political world undisputed king pure much get sense set write definitive biography time president also obvious much politics happy live participant empty relationship ruin alcoholism unfaithfulness anything star review give piece together extend stories really novel extend able work pace issue also conclusion", "genres": ["Fiction & Literature", "Politics"], "summary": "Set in Texas, The Gay Place consists of three interlocking novels, each with a different protagonist—a member of the state legislature, the state's junior senator, and the governor's press secretary. The governor himself, Arthur Fenstemaker, a master politician, infinitely canny and seductive, remains the dominant figure throughout.\r\n\r\nBilly Lee Brammer—who served on Lyndon Johnson's staff—gives us here \"the excitement of a political carnival: the sideshows, the freaks, and the ghoulish comedy atmosphere\" (Saturday Review).\r\n\r\nOriginally published in 1961, The Gay Place is at once a cult classic and a major American novel.\r\n\r\n\"An American classic in which a Johnsonian figure named Arthur 'Goddam' Fenstemaker strides through the pages, large, earthy, intelligent, threatening, working it seemed more often on the side of the angels than against them.\" Gore Vidal", "asin": "0292708319", "rank": "259809", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51pKYRq7SJL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}