{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 25, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I live in the Seattle area and heard about this book while reading another book. I'm so glad I wrote it down and ordered it, because I learned a great deal about Seattle, and thoroughly enjoyed it.  The writing is welcoming and easy while still giving a very good overview of this city."}, {"review_sentiment": 5.0, "review_text": "Good"}, {"review_sentiment": 4.0, "review_text": "This is my favorite way of encountering the history of a place as a series of portraits of interesting and often eccentric characters who are either emblematic of an age, or played a unique role in the unfolding of providence. Morgan's portraits are all of those who were in some way related to Skid Road of Seattle, the path down which the logging industry drug its logs, creating many a \"skid\" and the unofficial dividing line between the wealthier of the city (or at least the respectable) and that part of town where the rest of the U.S. got the nickname Skid \"Row\". Here you'll find portraits of pioneers, yellow journalists, importers of women, vaudeville promoters, whorehouse investors, rabble rousers, and labor organizers all trying to make it in Seattle. A great read whether or not you know any other of the city's or the Pacific N.W.'s history, but it is limited to glimpses (albeit very entertaining glimpses) rather than a thorough historical survey of the city."}, {"review_sentiment": 4.0, "review_text": "Thanks!"}, {"review_sentiment": 5.0, "review_text": "We live in such a COLORFUL city!!"}, {"review_sentiment": 5.0, "review_text": "if you want to know about the Northwest this is the book to read.  A Tacoma librarian recommended it to me. Outstanding book of the trials and tribulations of east to west immigration too let alone the interface between \"white settlers\" and the Northwest's native Americans."}, {"review_sentiment": 5.0, "review_text": "Great book on history"}, {"review_sentiment": 4.0, "review_text": "A little dry in places but perhaps the best account of Seattle's early history beyond - yet including - the early mudflat days."}, {"review_sentiment": 5.0, "review_text": "Great history of Seattle, I am really enjoying it.  Lots of interesting stories, embarrassing to read of the mistreatment of Chinese people who helpef build the city.  I wish the folks who made \"Deadwood\" would do these stories, too!"}, {"review_sentiment": 5.0, "review_text": "Mr. Morgan came and talked to our grade school class in the 1960s about this book.  Finally I'm reading his book and enjoying it."}]}, "authors": ["Murray Morgan"], "isbn": "0295958464", "longitude": -122.3300624, "periods": ["1800s", "1900s"], "title": "Skid Road: An Informal Portrait of Seattle", "word_cloud": "live area heard read glad write order learn great deal thoroughly enjoy write welcoming easy still give good overview city good favorite way encounter history place series portrait interest often eccentric character emblematic age play unique role unfold providence portraits way related path log industry drug log create many unofficial divide line wealthier city least respectable part town rest get nickname here find portrait pioneer yellow journalist importer woman vaudeville promoter whorehouse investor rabble rous labor organizer try make great know city history limited glimpse entertain glimpse rather thorough historical survey city thanks live city want know librarian recommend trial tribulation east west immigration alone white settler native history little dry place perhaps best account early history yet include early mudflat day history really enjoy interest story embarrass mistreatment chinese people help build city wish folk make come talk grade school class read enjoy", "genres": ["History"], "summary": "Informal and picturesque, Skid Road is the story of Seattle during its first hundred years, seen through the lives of the vigorous personalities of its settlers and early citizens. \r\n\r\nThis handsomely illustrated revised edition brings Seattle’s history up-to-date and provides a vivid portrayal of its past: pioneering, Indian warfare, lumber, railroads, the great fire of 1889, the Alaska gold rush, the amusement business, newspapers, the general strike of 1919, and the tumultuous politics of city and state that have made history in the Northwest.", "asin": "0295958464", "rank": "285167", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/5107HY92AKL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}