{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 31, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Franco: A Personal and Political BiographyThere are so many so-called \"Histories\" on the Man usually from a hostile albeit read leftist persuasion behind the book,this book is balanced and fair and at times seems to me to be too much so,it does not endorse His dictatorship but lays bare the facts of The Spanish Civil War and how he was an unwilling participant he wasn't the leader that distinction someone else already had,he is a reaction and with all good reason to leftist violence and failure of the so-called Republic and \"Republicans\".As the Author so finely points out ,The Book's conclusion is the best part, I could have gone without the many personal(too personal) items regarding his last days such as what were the things he said on his deathbed or his cries. The Author used many good sources, I feel Franco Got too soft on times as he was neither A Fascist or a Monarchist,He praised the Falange but wasn't entirely convinced,Praised Monarchy but wasn't completely Monarchist,He was a Ally of The Axis not out of any true Fascist desire or principle but because he believed he was part of a strengthening Europe and he even didn't care for Much Capitalism,more of a State Planner which I dislike.He was Anti-Masonic which I like,Devout Catholic which again speaks to me and most importantly Anti-Communist.He was a big a character as De Gaulle but more consistent.There are many things to praise him about and Spain is Better off just as Chile was Better off because of Pinochet. Franco wasn't an extreme Right-winger sadly,he did give in to pragamtism and sometimes would come around hence why he had Carlists and Falagists surround him he felt both represented the Nationalist movement as well as the Monarchists,so in esscence despite what you read of him he remains a mystery on some fronts much Like De Gaulle,the only Thing for Sure not to be debated was his Patriotism for La Patria.¡Arriba España!"}, {"review_sentiment": 4.0, "review_text": "Reads like  novel"}, {"review_sentiment": 2.0, "review_text": "Paine and Palacios start the book by expressing their ambition to present a more balanced view of the Franco era than published so far. This is of course a very ambitious goal, and I am afraid that they did not succeed. Instead of a balanced view, their book reads like an attempt to rehabilitate Franco towards his many critics, at times even becoming an outward hagiography (e.g. “Franco has been the most important Spanish head of state since Philip II”).I must admit that for first-time readers, the book looks pretty balanced. It reads well and I did enjoy reading it. But unfortunately, many of the historical facts are presented either incorrectly or with the wrong emphasis (e.g. by omitting certain historical facts and emphasizing others). Therefore, I would recommend interested readers to also consult other books / sources about Spanish history in general and modern Spanish history in particular. Probably the Wikipedia articles about these topics are a good starter. Below, a number of examples is listed where I believe that the authors are incorrect and/or unbalanced.Second republic. The authors state that the root cause of breakdown of the 2nd republic (1931-36) was that the entire Left was undemocratic, and that it was aiming to initiate a Soviet-style violent revolution. However, in reality most of political Spain in those days was undemocratic at heart, both Left and Right. Root cause of the breakdown of the republic was the fact that society was extremely polarized (a bit like the US today). As a result, it was impossible to govern the country democratically (which always involves making compromises).Post-war repression. The authors do not deny that the post-(civil) war repression was severe, but they trivialize this by stating that in history, “at the end of a civil war, there is always a severe repression of the vanquished by the victors”. For the case of the Spanish civil war, that is absolutely beside the point. Severe repression took place mainly because of Franco’s intransigence towards the Republicans (“anti-Spain”). There was no effort whatsoever towards national reconciliation once the war had ended. As part of the repression, not only mass executions of leading Republicans and soldiers who committed “war crimes” were carried out, but also mass detentions took place of relatively “harmless” people with Republican sympathies. Perhaps worst of all was the fact that former Republicans were often denied work and food, because access to work and food ration cards meant getting identity cards that involved certificates of “good behaviour” from local Falangist officials and parish priests. Also, widows of fallen Republican soldiers were not given any state pensions, the latter only being reserved for the widows of former Nationalist soldiers. Finally, fallen Republican soldiers were not granted a place in the bombastic monument of the Valle de los Caidos near Madrid. From the above, it is clear that Franco, by dividing the Spanish population in “good guys” (“Spain”) and “bad guys” (“anti-Spain”), he kept alive the existing polarization, and it is therefore no wonder that the name “Franco” is a topic of substantial controversy which persists to this day.Autarky. This topic is hardly touched upon by the authors, whereas it deserves an entire chapter on its own, being one of the blackest periods in Spanish modern history. Franco’s economic policy of autarky during the years 1939-59 further contributed to the repression of the defeated and also delayed eventual economic growth. Autarky in Spain brought economic and social disaster with widespread famine and untold misery, especially in the lower strata of the population. Inevitably, it was those close to the regime who benefited, and the (Republican) defeated who suffered. State interventionism in every aspect of the  planting, harvesting, processing,  sale and distribution of wheat was so corrupt that it made fortunes for officials while creating huge food shortages that saw food prices rocket on the black market (estraperlo). After 1959, autarky was abandoned and the economic ‘Spanish miracle” took place, more despite Franco than thanks to Franco. And in spite of the Spanish miracle, around 1970 a considerable number of Spaniards were still living in caves for lack of affordable housing, and many city residential neighbourhoods were still entirely unpaved.Period of ostracism. The authors state that Spanish ostracism post-WWII resulted from the fact that all Western democracies had ‘Leftist’ (social democratic) governments which naturally did not like Franco’s ‘Rightist’ regime. At that time, however, Franco’s regime was correctly viewed as the last surviving Fascist state so no wonder that one was not particularly sympathetic towards it. Only when the Cold War started in earnest, Western opportunism led to diplomatic relationships with Spain. By the way, it is the same Cold War opportunism that led Western leaders to hail Tito – purely because he had detached himself from the Iron Curtain. And not, as suggested by the authors, because the ‘Leftist’ Western governments detested right-wing dictatorships but had no problem at all with left-wing dictatorships.40-years dictatorship. In their chapter “Conclusion”, the authors provide a number of justifications for Franco’s 40-year dictatorship, it being the “best possible alternative for Spain” after the Civil War. These justifications are very similar to Franco’s own raison d’être, who consistently stated that “the Spanish people are not ready for a parliamentary democracy”. Whilst there may be some truth in this for the period immediately following the Civil War, it does not justify an isolated iron-fist dictatorship for 40 years within a world of parliamentary democracies. In fact, it is fair to state that Franco’s regime was an anachronism starting with the end of WWII latest, i.e. Spain had to endure an anachronistic dictatorship for 30 years or more."}, {"review_sentiment": 1.0, "review_text": "I was expecting something that was more of a biography on General Franco.  After pushing my eyeballs back in their sockets from reading long droning monologues, I got to chapter Five.  I read a ton of biographies, but this one was better used as a doorstop, or that pesky table leg that is just a little shorter than the others."}, {"review_sentiment": 4.0, "review_text": "There are not that many English language bios out there on this dictator, so it was good to find this one.  Four chapters in, it is fascinating.  A physically little guy, with grit, luck and pluck, moves up the ladder in military rank and society.  Payne shows how many major players on the future Nationalist side in the Spanish Civil War interacted with each other, and how Franco's views were shaped.  Especially interesting were the portions of the book that cover the brutal war in Spanish Morocco, including a military collapse that rivalled any other European colonial war disaster.  On campaign, Franco shoots a mutinous soldier in the head, so he's definitely not just a desk murderer.So far the book is giving me what I want - things I did not know.  As to bias, that remains to be seen - the jury is still out.  I've Read Preston's Civil War, so I thought I would try this book for perspective.  So far, I'm glad I did.Update:  upon finishing the book, my rating remains the same.  As a biography, the book is stronger on Franco's family and personal life than on how his governing decisions affected Spain and its citizens.  For example, following the Civil War, political and blood crimes were tried by military tribunals.  Franco believed in legality. As an authoritarian, following the rules was important to him.  However the trials are not gone into in any depth.  There is not much detail on what crimes were prosecuted, and whether there was any fairness in the process.  The tribunals could have operated with grudging moderation or been \"bloody assizes\".  Another area was Franco's push to re-establish Catholicism after the war.  It is discussed in broad terms, but its impact on the average citizen is not covered in any detail.  Rebuilding churches burnt by Republicans, promoting religion in the schools, and concordats are covered, but not whether being a non-practicing Catholic created problems.  Persecution of Protestants was an occasional issue, and talked about in general terms - without much detail.The biography covers a lot, but can't cover every aspect of Spain in the Francoist era.  It is also limited by the fact that Franco kept his own counsel, and left little in the way of written documents, letters or diaries.  There is not a lot of hand-wringing over the cost to the opposition; but rather a cold assessment that while the Civil War and aftermath was bloody, it could have been much worse.  Payne and Palacios rate Franco as the most important Spaniard in centuries in regard to his country's development.  All in all, the book provides more balance to the large number of pro-republican works available."}, {"review_sentiment": 3.0, "review_text": "enjoyable read. would recommend it to others that like that period in time"}, {"review_sentiment": 5.0, "review_text": "I was an expat student who lived in Spain in the last years of Franco's life, and found this book an excellent chronicle of a complex man.  To me, as a young student, Franco was merely a remote charicature.  However this book shows how he was able to achieve supremacy in a very socially conservative (and reactionary) society in the 20's and 30's, and how he was able to cope with the changes that swept through Spanish society before and during his regime.  A fascinating portrait; the book does not sugar-coat his faults and misdeeds, but also doesn't present him as the fascist stooge that many other biographers (with other political agendas) have tried to do."}, {"review_sentiment": 5.0, "review_text": "Great for its brevity. Good, easy, quick read. On the money for Americans who have little cognizance concerning methods used by power-hungry despots to acquire power over entire nations."}, {"review_sentiment": 5.0, "review_text": "I admire the description of the effort."}, {"review_sentiment": 5.0, "review_text": "A very interesting and balanced historical account of Francisco Franco and the Spanish civil war."}]}, "authors": ["Stanley G. Payne", "Jesús Palacios"], "isbn": "0299302105", "longitude": 2.1774322, "periods": ["1900s"], "title": "Franco: A Personal and Political Biography", "word_cloud": "many usually hostile leftist persuasion balanced fair time seem much dictatorship lay bare facts spanish unwilling participant leader distinction someone else already reaction good reason leftist violence failure finely point conclusion best part go many item regard last day thing say deathbed cry use many good source feel soft time praise entirely convince praised completely ally true desire principle believe part strengthen even much like speak importantly big character many thing praise extreme sadly give pragmatism sometimes hence car lists fatalist surround felt represent movement well monarchists essence remains mystery front much debate read start express ambition present balance view era publish far course ambitious goal afraid instead balanced view read attempt rehabilitate towards many critic time even become hagiography important spanish head state reader look pretty balance read well enjoy read unfortunately many historical fact present either incorrectly wrong emphasis omit certain historical fact emphasize others interested reader also consult source spanish history general modern spanish history particular article topic good starter number example list believe author incorrect republic author state root cause republic entire undemocratic aim initiate violent revolution however reality day undemocratic heart breakdown republic fact society extremely polarized bit today result impossible govern country democratically always involve make compromise repression author deny civil war repression severe trivialize state history end civil war always severe repression vanquish victor case civil war absolutely beside point repression take place mainly intransigence towards effort whatsoever national reconciliation war end part repression mass execution lead soldier commit war crime carry also mass detention take place relatively harmless people republican sympathy perhaps worst fact former often deny work food access work food ration card mean get identity card involve certificate good behavior local official parish priest also widow fall republican soldier give state pension latter reserve widow former soldier fall soldier grant place bombastic monument clear divide spanish population good guy bad guy keep alive exist polarization therefore wonder name topic substantial controversy persist topic hardly touch author whereas deserves entire chapter blackest period spanish modern history economic policy autarky year contribute repression defeat also delay eventual economic growth bring economic social disaster widespread famine untold misery especially lower stratum population close regime benefit defeat suffered interventionism aspect plant harvest process sale distribution wheat corrupt make fortune official create huge food shortage saw food price rocket black market estraperlo autarky abandon economic spanish miracle take place thanks spite spanish miracle considerable number still live cave lack affordable housing many city residential neighborhood still entirely author state spanish ostracism result fact western democracy leftist social democratic government naturally regime time however regime correctly view last surviving state wonder particularly sympathetic towards only start earnest western opportunism lead diplomatic relationship way opportunism lead western leader hail purely detach suggest author western government detest dictatorship problem dictatorship chapter author provide number justification dictatorship best possible alternative justification similar raisin consistently state spanish people ready parliamentary democracy period immediately follow justify isolate dictatorship year world parliamentary democracy fact fair state regime anachronism start end latest endure anachronistic dictatorship year expect something push eyeball back socket read long drone monologue get chapter ton biography better use doorstop pesky table leg little shorter others many english language bios dictator good find chapter fascinate physically little guy grit luck pluck move ladder military rank society show many major player future side interact view shape especially interesting portion cover brutal war spanish include military collapse rival european colonial war disaster campaign shoot mutinous soldier head definitely desk far give want thing know bias remain see jury still read think perspective far glad finish rating remain stronger family life govern decision affect citizen example follow blood crime try military tribunal believe legality authoritarian follow rule important however trial go depth much detail crime prosecute fairness process tribunal grudge moderation bloody assizes area push war discuss broad term impact average citizen cover detail rebuild church burnt promote religion school concordat cover create problem occasional issue talk general term much cover lot aspect era also limit fact keep counsel leave little way write document letter diary lot cost opposition rather cold assessment aftermath bloody much rate important century regard country development provide balance large number work available enjoyable others period time expat student live last year life find excellent chronicle complex man young student merely remote caricature however show able achieve supremacy socially conservative reactionary society able cope change sweep spanish society regime fascinating portrait fault misdeed also present fascist stooge many biographer agenda try brevity easy quick money little cognizance concern method use despot power entire nation admire description effort interesting balanced historical account civil war", "genres": ["Biography", "History", "WWII", "Politics", "Spanish Civil War"], "summary": "General Francisco Franco ruled Spain for nearly forty years, as one of the most powerful and controversial leaders in that nation's long history. He has been the subject of many biographies, several of them more than a thousand pages in length, but all the preceding works have tended toward one extreme of interpretation or the other. This is the first comprehensive scholarly biography of Franco in English that is objective and balanced in its coverage, treating all three major aspects of his life—personal, military, and political.\r\n\r\nThe co-authors, both renowned historians of Spain, present a deeply researched account that has made extensive use of the Franco Archive (long inaccessible to historians). They have also conducted in-depth interviews with his only daughter to explain better his family background, personal life, and marital environment, as well as his military and political career.\r\n\r\nFranco: A Personal and Political Biography depicts his early life, explains his career and rise to prominence as an army officer who became Europe's youngest interwar brigadier general in 1926, and then discusses his role in the affairs of the troubled Second Spanish Republic (1931–36). Stanley G. Payne and Jesús Palacios examine in detail how Franco became dictator and how his leadership led to victory in the Spanish Civil War that consolidated his regime. They also explore Franco's role in the great repression that accompanied the Civil War—resulting in tens of thousands of executions—and examine at length his controversial role in World War II. This masterful biography highlights Franco's metamorphoses and adaptations to retain power as politics, culture, and economics shifted in the four decades of his dictatorship.", "asin": "0299302105", "rank": "452452", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51l1Xx9CAHL.jpg", "country": "Spain", "story_arc": ["Tragedy", "Things only get worse"]}