{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 26, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "I love the way this book isn't just about the author's external travels, but also about the inner growth she experiences while visiting new countries and cultures. By sharing her own honest, personal thoughts and feelings, Jones captures the inner struggles and conflicts that come up for all of us when we travel to new places. In fact, she captures these inner conflicts on a philosophical and analytical level that I have never encountered before in a travelogue or memoir. The conflicts and questions she raises while traveling - that inner, emotional landscape - stayed with me long after I finished the book. It's a powerful book that manages to be funny, smart, AND emotionally satisfying."}, {"review_sentiment": 5.0, "review_text": "This is the first travel memoir I've read and I was hooked from first page to last. Alden Jones has piqued my interest in reading more travel writing, although I'm afraid I've already started with one of the best travel memoirs out there! The vivid, funny and wise chapters take the form of lyric essay, personal reflection, and plot-driven narrative, all bound by the search for the answer to the question: what is the right way to travel? Alden Jones explores both exterior and interior worlds in seamless, beautiful prose. As a narrator she is approachable, honest and self-aware. It was a great pleasure to read this book and travel vicariously."}, {"review_sentiment": 5.0, "review_text": "I loved everything about this book -- and knew I would right from the Introduction where the author talks about the difference between a tourist and a traveler. It was clear that, like Jones, I was a traveler, always looking for the \"thrill of a new perspective.\" But, then, all of a sudden she left me behind, referring to herself as an exoticist. And, indeed she was! From that point on I was content to sit back and let her bring me along to the most amazing places, opening up new worlds and showing me how she fit into them. Exotic worlds that a part of me yearned to travel to, but knowing that physically I never would. So, I did the next best thing. I traveled vicariously with a masterful story teller."}, {"review_sentiment": 2.0, "review_text": "The book deals with Jones's attitude toward travel--to be a tourist or a participant in local life. Since the chapters globe hop, you never find out much about any one country."}, {"review_sentiment": 5.0, "review_text": "This is not your normal travel book, this is so much more!  Jones takes the reader on her journeys while developing her character.  By the end of the book I found myself just as curious about her personal life as her last trip.  Great read.  I highly recommend this book."}, {"review_sentiment": 5.0, "review_text": "The Blind Masseuse is a must-read traveler's book no matter where--or if--you travel.  Because rather than focusing on the visuals of a destination, Jones takes the reader on an incredibly vivid journey into the cultures and communities of her hosts. She draws you into adventures with keen, detailed, and often eloquently simple aspects of her adopted communities in places like Bolivia, Costa Rica, and Cuba.  She relays boldly honest confrontations between her own, American-raised self and the people she comes in contact with during these travels, eloquently detailing the changes to her own perspectives on life--humorously, insightfully and strikingly relatable in a manner that allows a reader to reflect on their own perspectives and their own travels. Warning--her sustained pursuit of coffee and its varying degrees of accessibility will make you crave it while you read!  While quenching a bit of wanderlust for those of us temporarily home-bound by jobs or family. This book is a sensual, colorful, delicious, and enlightening set of adventures that will have you mentally packing your own bag!"}, {"review_sentiment": 5.0, "review_text": "i loved this book. what i loved is that jones brings us with her to costa rica, bolivia, nicaragua, cuba, cambodia, burma, and on a cruise around the world (!!), but she doesn't just tell us what she sees and what she learns (though she does do that), she carries us, the reader of her book, like we are her little best pal that she keeps close in her pocket, and she shares with us her sharp insights, joking with us, telling us everything. and i was dazzled not only by the scope of her travels, but by the breadth. the stories in here are charming, and intimate, and honest. and jones has a very distinctive sass.it was hard when this book ended. i wanted to spend more days with jones, as the little best pal in her pocket, in more cities and towns around the world."}, {"review_sentiment": 4.0, "review_text": "4.5 stars: A thoroughly enjoyable read. Alden Jones takes the reader around the world, and while visiting the different destinations is part of the fun of reading this book, what makes THE BLIND MASSEUSE stand out from other travelogues is how Jones takes the reader through her own struggles and thoughts on what traveling means in today's world, especially for women. In different situations she is both a traveler and a tourist and I enjoyed her thoughts and honesty on what that means. Her strong, easy-going writing style and memorable characters are the highlights.More a memoir of Jones' reflections and growth than a book about a place (which is why I finally rated it 4 not 5 stars...personal preference), I highly recommend THE BLIND MASSEUSE to anyone who travels or thinks about traveling and the world we live in."}, {"review_sentiment": 5.0, "review_text": "A great piece of travel writing and a deserving bearer of the title \"best travel book of 2013\" (Huffington Post), \"The Blind Masseuse...\" tells the age-old tale of the perpetual struggle between good (traveler) and evil (tourist) though a new lens. Author Alden Jones beautifully recreates the memorable landscapes and relationships that are the hallmarks of all great travels. The book is a true must-read for anyone who has ever caught the travel bug."}, {"review_sentiment": 5.0, "review_text": "This is a great book for people struggling with a balance of family life and travel. It shows that it can be possible to have a stable family and home life while making adventures abroad. Alden Jones does a great job reliving her experiences throughout the book and makes the reader excited about the opportunities abroad!"}]}, "authors": ["Alden Jones"], "isbn": "0299295702", "longitude": 31.243666, "periods": ["2000s", "Recent Releases"], "title": "The Blind Masseuse: A Traveler's Memoir from Costa Rica to Cambodia", "word_cloud": "love way author external travel also inner growth experience visit new country culture share honest personal thought feeling capture inner struggle conflict come travel new place fact capture inner conflict philosophical analytical level never encounter travelogue conflict question raise travel inner emotional landscape stay long finish powerful manages funny smart emotionally satisfy first travel hook first page last pique interest reading travel write afraid already start best travel memoirs vivid funny wise chapter take form lyric essay personal reflection narrative bound search answer question right way travel explore exterior interior world seamless beautiful prose narrator approachable honest great pleasure travel vicariously love everything knew author talk difference tourist traveler clear traveler always look new perspective sudden left refer exoticism indeed point content back let bring amazing place open new world show fit exotic world part yearn travel know physically never so next best thing travel vicariously masterful story teller deal attitude travel tourist participant local life chapter globe hop never find much country normal travel much take journey develop character end find curious personal life last trip highly recommend traveler matter travel rather focus visuals destination take incredibly vivid journey culture community host draw adventure detail often eloquently simple aspect adopt community place relay boldly honest confrontation self people come contact travel eloquently detail change perspectives life humorously insight fully strikingly repeatable manner allow reflect perspective travel warn sustained pursuit coffee vary degree accessibility make crave quench bit wanderlust temporarily job family sensual colorful delicious enlighten set adventure mentally pack bag love love jones brings bolivia nicaragua cuba burma cruise world tell see learns carry little best pal keep close pocket share sharp insight joke tell everything dazzle scope travel breadth story charm intimate honest jones distinctive hard end want spend day jones little best pal pocket city towns world star thoroughly enjoyable take world visit different destination part fun reading make stand travelogue take struggle thought travel mean today world especially woman different situation tourist enjoy thought honesty mean strong writing style memorable character reflection growth place finally rat star personal preference highly recommend anyone travel think travel world live great piece travel write deserve bearer title best travel tell tale perpetual struggle good traveler evil tourist new lens beautifully recreate memorable landscape relationship hallmark great true anyone ever catch travel bug great people struggle balance family life travel show possible stable family home life make adventure abroad great job relive experience make excited opportunity abroad", "genres": ["Travel Writing", "Humour"], "summary": "Finalist for the PEN/Diamonstein-Spielvogel Award for the Art of the Essay\r\n\r\nThrough personal journeys both interior and across the globe, Alden Jones investigates what motivates us to travel abroad in search of the unfamiliar.\r\n\r\nBy way of explorations to Costa Rica, Bolivia, Nicaragua, Cuba, Burma, Cambodia, Egypt, and around the world on a ship, Jones chronicles her experience as a young American traveler while pondering her role as an outsider in the cultures she temporarily inhabits. Her wanderlust fuels a strong, high-adventure story and, much in the vein of classic travel literature, Jones's picaresque tale of personal evolution informs her own transitions, rites of passage, and understandings of her place as a citizen of the world. With sharp insight and stylish prose, Jones asks: Is there a right or wrong way to travel? The Blind Masseuse concludes that there is, but that it's not always black and white.\r\n\r\n\"Wonderful travel writing, in the line of Innocents Abroad by Mark Twain. Alden Jones is humorous like Twain without being cynical; she treats all her amazing encounters and strangers with mucho love. She makes highly entertaining and fresh stories out of culture clash, traveling as an observant gringa, fluent in Spanish. She arrives at many deep insights about other cultures and ours, while transcending the form of travelogue into amazing and dramatic story-telling.\" Josip Novakovich, Man Booker International Prize finalist, 2013", "asin": "0299295702", "rank": "1733337", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51N5I%2BQzd3L.jpg", "country": "Egypt", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}