{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": -12.9822499, "ratings": {"num_ratings": 14, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "I like it"}, {"review_sentiment": 5.0, "review_text": "Not the most famous but the greatest of Amado's many stories of Brazil and its people. The changing perspectives brings a fresh approach to storytelling and makes for an engaging read even for the most jaded of readers. Magical realism merged with Latin American myth and a healthy dose of humor makes for a classic."}, {"review_sentiment": 5.0, "review_text": "Excellent. Well-written. Tent of Miracles is a wonderful novel filled with colorful characters and an intriguing storyline."}, {"review_sentiment": 5.0, "review_text": "Others here have done a great job describing this masterpiece, with the interweaving lines of the present and past, the rewriting of history and obsession with celebrity, the past, and Pedro Archanjo. Fabulous!  But for me, in it all is a humanity and love that blasts out from subtle observations, the turn of a phrase, or a magical digression.I read Gabriella Clove and Cinnamon first and completely loved it.  (I was 80 pages in before I realized that Amado was becoming my favorite author of all time.) The same flavor of life, colors, cadence, and humanity are here, and so wonderfully told that I found myself reading a page, half a page, or less and just stopping to savor it and delight.  Yeah, I'm gushing and that's unprofessional, but Amado's masterpieces are just too great, and I'm strugging here.If you just love a good book that will deliver you to another world and time, this should make a great read.  If you love literature, classics, you'll love this book too.  (And maybe study it at some point.) Please take a chance and read this or Gabriella or Dona Flore; all absolute must-read classics of modern literature.  There are colors and smells and characters; and a wisdom and love comes through so naturally.  This book is a delight, and one of my absolute favorites of all time."}, {"review_sentiment": 5.0, "review_text": "This is all the wonderful storytelling and remarkable characters that one expects from Amado.  If you have read other works by him you will not be disappointed and if this is the first you will want to read more."}, {"review_sentiment": 5.0, "review_text": "This is a ribald, subtle, funny, and culturally informed novel about race, class, and culture in the northeast of Brazil.  Some think that Amado is either too ideological in his early works or too formulaic in his later books.  Others say that he, like Gilberto Freyre, tends to romanticize and perpetuate the myth of Brazil's racial democracy.  Others find his erotic descriptions sexist and stereotypical.  But I think Amado's critics miss the spirit and power of this book.  Contained in TENT OF MIRACLES is one of the great narratives -and comedies- of cultural expropriation and commodification that you'll ever read.  I think it's a classic."}, {"review_sentiment": 2.0, "review_text": "Since this is the only non-glowing review of this book, I feel some responsibility to say a bit about the reviewer.  I read about 40 books a year, mostly non-fiction.  Maybe 10% of the time I will not finish a book, or will scan it.  My tastes in fiction run towards the classics including modern classics, authors who command my attention, who create a compelling and instructive world that informs this world we live in.  Authors, to my mind, must engage the reader, and if they are to draw us into their world, if they are to move us from a place of lesser understanding to one of greater, they must reach us where we are.This book did not engage me.  After 100 pages I still felt a stranger to the characters.  I just did not care what they were going to do next.  To paraphrase Ernest Dimnet in \"The Art of Thinking\",  \"life is short.  Only read the great books; don't waste time on the merely good.\"  (And of course, the \"great\" and the \"good\" apply only in our own appreciation.)Again, I did not finish this book.  Maybe the last 270 pages redeems the first 100.  Maybe you will love it as did the other reviewers."}, {"review_sentiment": 5.0, "review_text": "When I first read \"Tent of Miracles\" in the early 1970s, I fell in love with it. Of all of Jorge Amado's novels I have read, this is probably my favorite. I say \"probably\", because it's hard to pick a favorite out of so many fine works. Reading it again after more than thirty years, I am pulled in all over again to the streets of Salvador, Bahia, following the mulatto Pedro Archanjo in his rambles, his conversations, his love affairs and his obsession with telling the story of his people in four books published by friend and \"brother\", the miracle painter Lidio Corró.\"Tent of Miracles\" is about Bahia's African and mestizo people, their rich culture, their poverty, and their struggle against the racism, with Pedro as their advocate and champion. It's also about his \"rediscovery\" by the North American Nobel Prize winner and scholar, James D. Levenson, whose attention makes Archanjo the focus of a major \"cultural event\" that celebrates the 100th anniversary of his birth. The celebration turns out to be a monumental farce in which Pedro Archanjo's memory is laundered and turned into a commercial icon. In 1969 he's still too uncomfortable to the political powers to leave him as he was in \"real life\", a \"donnadie\" (Mr. Nobody), a self-educated man of the people whose life ended at age 75 when he died of a heart attack on the way to the room an old friend had given him in a brothel.It's too bad Amado has been largely forgotten by North American readers; he is far too good for that. It wasn't too long ago that I could find him on the shelves of Barnes & Noble and all of his books on Amazon. Amado, who died in 2001 (he was born in 1912), is one of America's foremost writers. For me, rereading him is like getting together with old friends and taking up where we left off the last time we met. I know exactly what neighborhood I am in, where we're going next, and who we'll meet. I can hear the talk and the laughter, smell the smells of the street and the food, and hear the singing and the sounds of the guitar, berimbau and drum.If you haven't read \"Tent of Miracles\", buy a copy and read it. The New York Times called it \"a most enjoyable romp\", which is like calling a drop-dead beauty \"a nice-looking gal\": way, way too insipid to fit the reality.My hat is off to the University of Wisconsin Press for bringing this book out in this fine paperback edition. It sure has set me on fire again!George PolleySapporo, JapanTent of Miracles (THE AMERICAS)"}, {"review_sentiment": 5.0, "review_text": "Tent of Miracles (THE AMERICAS)Another Masterpiece by Jorge AmadoAlthough not as fast a read as \"Dona Flor and her Two Husbands\" or \"Gabriela, Clove and Cinnamon\", \"Tent of Miracles\" is an outstanding piece of work which relates the entire life and the posthumous celebration of the Centennial of Birth of the mulatto Pedro Archanjo, alias Ojuobá- the Eyes of the King-.  Archanjo's struggle throughout his entire life centers around racism, the wellbeing of the mix breed and the understanding of miscegenation in the Brazilian area of Bahia from the early 1900's until the time of his death around the end of WWII. Archanjo is a womanizer, a studhorse who could have only sons, an autodidact who mastered several languages, a grand buddy and companion, a performer of voodoo ceremonies with a free laugh, a dancer, a great conversationalist and listener, a sociologist, an anthropologist, an ethnologist, and, principally, an utterly excellent reader and writer.Nevertheless, he does not put pen to paper on anything: the core of his work lies on the lives and struggles of the mestizo race and on proving, without little doubt, that the Brazilian face is a mestizo face and its culture is mestizo.  He actually accomplishes to put in writing four books, rather pamphlets, namely: \"Daily Life in Bahia\", \"The African Influence on the Customs of Bahia\", \"Notes on Miscegenation in the Families of Bahia\" and a \"Cookbook\".  \"Notes on Miscegenation...\" was written when he was about fifty years old and proves that no single family in the area was pure white.  As a matter of fact, pure or Aryan race was a thing that did not exist in Bahia or in Brazil for all that matters. These facts, which were supported with great evidence, brought about great controversies among the stiff nosed so-called whites of the region.  The voodoos ceremonies were prohibited and prosecuted by the police, the intermarriages were just about forbidden or very badly considered and the mulattos, Negroes or mestizos were considered no better than animals.But what really stroke me was the real friendship that Archanjo was able to pursue with his - so called- twin brother: Lidio Corro, the Miracle Painter at the Tent of Miracles.  They both were in love with the same woman, Rosa de Oxalá, however, Archanjo, who could have had the woman he wanted, let go of her for Lidio's sake.  The book is also filled with myriad voodoo ceremonies, dances, faithfulness, enchantments, convictions and terminology.And last, but not least, you get the benefit of a myriad examples of \"magical realism\" within this wonderful prose.It is definitely worth the read."}, {"review_sentiment": 5.0, "review_text": "This is an excellent book!  This novel will take you on a grand adventure through Brazilian culture, starting with the birth of the protagonist, Pedro Archanjo, in the late 19th century to the 1960's.  The story is of the life of Pedro Archanjo, a man of humble means who matures into a novelist and chronicler of the culture and customs of the Bahia state within Brazil.  Major themes within the book are the Brazilian prejudices and biases against blacks/mulattoes and the religion that they practise --what we would calll vodoo.  The origins of vodoo, and a helpful index of its terms, are discussed at well.The book is quite entertaining and replete with ribald and nuanced characters.  This novel definitely left me with a greater appreciation for the history, culture and development of Brazil."}]}, "authors": ["Jorge Amado"], "isbn": "029918644X", "longitude": -38.4812772, "periods": ["1900s"], "title": "Tent of Miracles", "word_cloud": "like not famous greatest many story people change perspective brings fresh approach storytelling make engage even jade reader magical realism merge latin american myth healthy dose humor make classic excellent wonderful fill colorful character intrigue story line others do great job describe masterpiece interweave line present rewrite history obsession celebrity humanity love blast subtle observation turn phrase magical first completely love page realize become favorite author time flavor life color cadence humanity wonderfully tell find read page half page le stop savor delight gush unprofessional masterpieces great struggle good deliver world time make great love literature classic love maybe point chance absolute classic modern literature color smell character love come naturally delight absolute favorites time wonderful storytelling remarkable character expect work disappoint first want ribald subtle funny culturally inform race class culture northeast think ideological early work formulaic later others say tend perpetuate myth racial democracy find erotic description sexist stereotypical think critic miss spirit power great narratives cultural expropriation commodification ever think classic review feel responsibility say bit reviewer year mostly time finish scan taste fiction towards classic include modern classic author command attention create compel instructive world inform world live mind world move place lesser understand greater page still felt stranger character care go next life short only great waste time merely good course great good apply appreciation finish maybe last page redeem first maybe love reviewer first early fell love novel probably favorite say probably hard pick favorite many fine work read thirty year pull street follow mulatto ramble conversation love affair obsession tell story people publish friend brother miracle painter mestizo people rich culture poverty struggle racism advocate champion also rediscovery north american winner scholar attention make major cultural event celebrates anniversary celebration turn monumental farce memory launder turned commercial icon still uncomfortable political power leave real life donnadie man people life end age die heart attack way room old friend give bad largely forget north american reader far good long ago shelf die born foremost writer reread get together old friend take leave last time meet know exactly neighborhood go next meet hear talk laughter smell smell street food hear sing sound guitar berimbau copy call enjoyable romp call beauty gal way way insipid fit bring fine paperback edition sure set fire fast outstanding piece work relate entire life posthumous celebration mulatto alias struggle entire life center racism well being mix breed understand miscegenation brazilian area early time death end womanizer stud horse autodidact mastered several language grand buddy companion performer voodoo ceremony free laugh dancer great conversationalist listener sociologist anthropologist ethnologist principally utterly excellent put pen paper anything core work lie live struggle race prove little doubt brazilian face mestizo face culture mestizo actually accomplish put write rather pamphlet namely daily write fifty year old prove single family area pure white matter fact pure race thing exist matter fact support great evidence bring great controversy stiff nose white region voodoo ceremony prohibit prosecuted police intermarriage forbid badly consider mulatto mestizo consider better really stroke real friendship able pursue brother love woman however woman want let also fill myriad voodoo ceremony dance faithfulness enchantment conviction last least benefit myriad example magical realism wonderful definitely worth excellent take grand adventure brazilian culture start birth protagonist late century story life man humble mean matures novelist chronicler culture custom state theme brazilian prejudice bias religion practice origin voodoo helpful index term discuss quite entertaining replete ribald nuanced character definitely left greater appreciation history culture development", "genres": ["Fiction & Literature"], "summary": "Tent of Miracles is a Brazilian Modernist novel. Written in 1967, it was later adapted to a 1977 Cinema Novo film by director Nelson Pereira dos Santos.\r\n\r\nTent of Miracles was written three years after the military overthrew Brazilian democracy, and it is part of a series Amado called \"The Bahia Novels\", works exploring the region's past. The novel chronicles the chaos that results when a prominent Columbia University professor arrives in Brazil, with nothing but praise on his lips for a long-forgotten local Bahian writer and self-taught social scientist named Pedro Archanjo. The year is 1968, which Levinson announces is the centennial of Archanjo's birth, setting off a media stampede to figure out who Archanjo was so that they can profit from a celebration of his life. When a few people finally uncover who Arcanjo was and what he espoused, media barons and advertisers are horrified to discover that he was an Afro-Brazilian social critic, womanizer and heavy drinker who died penniless in the gutter. So, they invent their own Pedro Archanjo, which they hype in various advertising-driven events, enlisting some Brazilian academics who are as superficial and self-promoting as Levinson.\r\n\r\nBeyond Amado's treatment of women and Afro-Brazilian culture, Tent of Miracles is a powerful[according to whom?] satire of modern Brazilian institutions, especially the mass media and parts of academia. Notably spared from the author's knife is the Brazilian military, which in 1967 was detaining, torturing and exiling some of Amado's political friends. A few scholars have suggested that the novel hides in its story a parable critical of the military dictatorship, particularly through the portrayal of a repressive but ineffectual assistant police commissioner, Pedrito Gordo. If so, the ridicule was mild, perhaps urging Brazilians to not be afraid of the regime, and so well disguised that the novel was not censored.\r\n\r\nWikipedia ", "asin": "029918644X", "rank": "1171765", "city": "Salvador", "image": "https://images-na.ssl-images-amazon.com/images/I/41XSC6V0PAL.jpg", "country": "Brazil", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}