{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 27, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Provides the details I was looking for, and the author explains very well when he is providing his viewpoints and theories."}, {"review_sentiment": 5.0, "review_text": "Very informative. A must read  for the Hispanics  whom are from the Caribbean."}, {"review_sentiment": 1.0, "review_text": "Too cumbersome"}, {"review_sentiment": 5.0, "review_text": "Informative and useful information"}, {"review_sentiment": 5.0, "review_text": "Really enjoyed reading this very informative and well written book. A lot of great scholarly research, detailed analysis and presentation went into this book."}, {"review_sentiment": 5.0, "review_text": "learning about my roots bitches!!! wompwomp!!"}, {"review_sentiment": 3.0, "review_text": "It's was a bit complicated to follow aa a visual learner...  : /"}, {"review_sentiment": 4.0, "review_text": "Good book on the history of the Tainos"}, {"review_sentiment": 4.0, "review_text": "A great and concise book on this subject.  The author is honest enough to provide competing views, along with sources, but in my opinion this author provides an excellent history of the Tainos.  I have read many sources on this subject, dating back about one hundred years, and many were obviously written in a biased manner reflecting the authors at that time.  This book provides many sources for the viewer to decide for themselves, while also giving what the author feels is most accurate.I highly recommend this book to anyone researching this subject."}, {"review_sentiment": 5.0, "review_text": "This is a very good and comprehensive book about the pre-columbian indigenous inhabitants of the islands in the Caribbean. An up to date thesis on just about every aspect of the inhabitants since the fist ones arrived in the various islands, how and when they got there and their distribution. If I had to choose one book about this subject, this would be my first choice."}]}, "authors": ["Irving Rouse"], "isbn": "0300056966", "longitude": 0.0, "periods": ["1500s", "500-1400s", "0-500s", "Pre Common Era"], "title": "The Tainos: Rise and Decline of the People Who Greeted Columbus", "word_cloud": "provides detail look author explains well provide viewpoint theory very informative cumbersome informative useful information really enjoyed reading informative well write lot great scholarly research detail analysis presentation go learn root bitch wompwomp bit complicate follow aa visual learner good history taint great concise subject author honest enough provide compete view source opinion author provide excellent history many source subject date year many obviously write biased manner reflect author time provide many source viewer decide also give author feel highly recommend anyone researching subject good comprehensive indigenous inhabitant islands date thesis aspect inhabitant fist one arrive various island get distribution choose subject choice", "genres": ["History", "Ancient Civilizations"], "summary": "A noted archaeologist and anthropologist tells the story of the Tainos of the northern Caribbean islands, from their ancestry on the South American continent to their rapid decline after contact with the Spanish explorers.\r\n\r\nYale University Press", "asin": "0300056966", "rank": "241379", "city": "Puerto Rico", "image": "https://images-na.ssl-images-amazon.com/images/I/61PQ1knn4PL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}