{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 42, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a well written and informative book. I read the book while on holiday in Vietnam and really enjoyed it.  Vietnam is a country of much ambiguity, colour and chaos but completely fascinating for the visitor. Bill Hayton brings insight and depth to the political, social and economic realities for the people who live in today's Vietnam."}, {"review_sentiment": 5.0, "review_text": "Prepares the visitor for seeing Vietnam as it exists today"}, {"review_sentiment": 5.0, "review_text": "Bought this for my husband, and he says it's a really good look at contemporary Vietnamese culture."}, {"review_sentiment": 5.0, "review_text": "Very well written, understandable and informative.  It was well worth the time.  I learned a lot."}, {"review_sentiment": 4.0, "review_text": "Long read but well written and very informative."}, {"review_sentiment": 5.0, "review_text": "Excellent, easy read. Was perfect for my trip to Vietnam."}, {"review_sentiment": 5.0, "review_text": "I have been spending three months every year for the past seven years in Vietnam where I teach conversational English. The book has helped me to understand the complexities of life in a communist controlled country. I am convinced that the people of Vietnam will overcome the oppression of the government in a very short time."}, {"review_sentiment": 4.0, "review_text": "A fascinating recent history of Vietnam.  Excellent reading for anyone who wants to understand how Vietnam ticks in the 21st Century."}, {"review_sentiment": 2.0, "review_text": "Scarse context to a complex society where history and ethnicity play a crucial role in the country's past, present and future. Extreme simplification to make the reader believe that western style democratic society is the goal to be achieved."}, {"review_sentiment": 4.0, "review_text": "A very good overview of where the country is coming from and of the remaining challenges. Sympathetic yet not un-critical tone."}]}, "authors": ["Bill Hayton"], "isbn": "030017814X", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Vietnam: Rising Dragon", "word_cloud": "well write informative holiday really enjoy country much ambiguity color chaos completely fascinating visitor bring insight depth political social economic reality people live today prepares visitor see exist today husband say really good look contemporary vietnamese culture very well write understandable informative well time learn lot long well write informative excellent easy perfect trip spend month year year teach conversational helped understand complexity life communist control country convince people oppression government short time fascinating recent history read anyone want understand tick context complex society history ethnicity play crucial role country present future simplification make believe western style democratic society goal achieve good overview country come remain challenge yet tone", "genres": ["Business & Finance"], "summary": "The eyes of the West have recently been trained on China and India, but Vietnam is rising fast among its Asian peers. A breathtaking period of social change has seen foreign investment bringing capitalism flooding into its nominally communist society, booming cities swallowing up smaller villages, and the lure of modern living tugging at the traditional networks of family and community. \r\n\r\nYet beneath these sweeping developments lurks an authoritarian political system that complicates the nation’s apparent renaissance. In this engaging work, experienced journalist Bill Hayton looks at the costs of change in Vietnam and questions whether this rising Asian power is really heading toward capitalism and democracy.\r\n\r\nBased on vivid eyewitness accounts and pertinent case studies, Hayton’s book addresses a broad variety of issues in today’s Vietnam, including important shifts in international relations, the growth of civil society, economic developments and challenges, and the nation’s nascent democracy movement as well as its notorious internal security. His analysis of Vietnam’s “police state,” and its systematic mechanisms of social control, coercion, and surveillance, is fresh and particularly imperative when viewed alongside his portraits of urban and street life, cultural legacies, religion, the media, and the arts. \r\n\r\nWith a firm sense of historical and cultural context, Hayton examines how these issues have emerged and where they will lead Vietnam in the next stage of its development.\r\n", "asin": "030017814X", "rank": "399025", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51rSxxC41wL.jpg", "country": "Hanoi", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}