{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 13, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "It will be difficult to imagine a more comprehensive book on the preparation of the Spanish Armada for its attack on England in 1588.  I specially liked the careful analysis of all the military and political angles.  At times it feels like you are in Phillip's head.  The use of argument and counter-argument in the analysis is excellent and gives the reader more insight into the personalities, their preferences and the conditions that forced their hand. Masterful!"}, {"review_sentiment": 5.0, "review_text": "This book takes it context during the 1400 and 1500s. The Series King Philip and King Philip II and the dynasties of King George begin the finalize with the Spanish Civil War as a tied with the later American Civil War."}, {"review_sentiment": 1.0, "review_text": "A year after the defeat of the Armada, a similar English Counter Armada was defeated by Spanish forces in La Coruña and Lisbon ( curiously enough Parker does not even mention this episode). Spain's empire was not in decline after Philip II's death, quite on the contrary, it achieved its maximum expansion in the XVIII century. Neither England ( until the mid XIX century) nor the Netherlands ( ever)  were actually able to create empires similar to the one bequeathed by Philip II to his successors. Neither were both Protestant nations able to elbow out Spain from the core of its territories in America and Asia. Drake and Hawkins both failed to conquer Central America and the Dutch were defeated thrice when they tried to conquer the Philippines in the XVII century."}, {"review_sentiment": 5.0, "review_text": "This is a great book for the serious student of history, but it is even more than that.First of all, this is not a general history of 16th Century Europe, nor even of 16th Century Spain.  It is not even a general history of the Spanish Armada nor of Philip II.  It is, instead, a detailed analysis of planning and decision making in a turbulent world, when communications were slow and unreliable and religious idealism tainted or inspired men.The author attempts (with only partial success) to draw parallels with modern times.  In fact, Philip II was an unusual man in unusual times.  This book goes into great detail about how Philip's decisions were made, paying particular attention to the information that was available to him and the often conflicting forces that were at play in his decision making.  Philip was, after all, faced with a task that (while he had his own personal failures) most likely no man (no matter how perfect) could have successfully managed.I especially appreciate that the author details the problems in 16th Century communication and how every decision was impacted by its imperfections.  Letters took weeks to deliver.  This meant that replies to one set of instructions would cross other, sometimes conflicting, instructions.  Since Philip ruled an extensive empire, massive amounts of information flowed into and out of Spain, all of it outdated.  Even with today's near instantaneous communications, Philip would have faced a daunting task.This is an impressive book, well researched and excellently presented.  I consider it must-reading for anyone wanting to understand late-16th Century Spain.  I came away from it with a great appreciation of the tremendous problems that faced Philip in dealing with his far-flung empire.  Without judging the merits of his goals or beliefs, a lot can be learned from analyzing his decision making."}, {"review_sentiment": 4.0, "review_text": "This is a good read, particularly if you had an English schooling in history that painted Philip II as a 'black hearted tyrant' intent on destroying the 'happy peace loving English'.  Read this book !"}, {"review_sentiment": 5.0, "review_text": "THE GRAND STRATEGY OF PHILIP II BY GEOFFREY PARKER SHOULD BE REQUIRED READING FOR ANYONE IN STRATEGIC POLICY MAKING POSITIONS OR FOR THAT MATTER ANYONE WHO JUST WANTS TO READ GREAT HISTORY. RICH IN DETAILS AND LARGE IN SCOPE. THIS BOOK IS TRULY A MASTERPIECE. EVEN IF YOU DON'T HAVE MUCH KNOWLEDGE ABOUT THE ERA THE AUTHOR GUIDES THE READER THROUGH ONE OF THE MOST COMPLEX TIMES IN EUROPEAN HISTORY. THIS BOOK AND GEOFFREY PARKER'S ANALYTICAL WORK ON THIS SUBJECT WILL STAND AS THE MOST INFORMATIVE AND STIMULATING WORK FOR MANY YEARS TO COME."}, {"review_sentiment": 5.0, "review_text": "This is history the way it ought to be written . The text is well organized ;the argument is tight and persuasive . The result is  a delight to read . Read Parker side-by-side with the younger set of historians (the 40-50 year olds )and the reader can only ask \" What went Wrong ??"}, {"review_sentiment": 3.0, "review_text": "It would be helpful for historians to write something of their own philosophies and belief systems and values at the beginning of their writings, to aid us evaluating where they are coming from.What I see is that Parker tries to evaluate El Prudente based upon Parker's apparently modern, non-catholic, and generally unspiritual worldview.If I were to try to find Philip's grand strategy, I would look at these as starters:He attempted to introduce mathematics training in towns throughout Spain, and supporting all manner of scientific thrusts. This was part of his strategy to  enlighten his realms and people.He supported Saint Teresa of Avila and such movements as hers for intense spiritual virtue in the monasteries. This was part of his strategy to spiritualize and enlighten his realms and people, and combat mindless materialism.He worked to bring justice and end crime throughout his realm, with great effectiveness.He worked to keep the Calvinist legions out of Spain and thwarted their inroads, which would have led to civil war and the deaths of thousands.He supported all manner of artists including Titian in fostering beauty and philosophical perspectives in his realms.He worked to bring Christianity to the new world and just treatment to the people's there.  He did well, or at least as best he could considering his resources and limited influence in New Spain, though not without some unfortunate  errors.  [If he had take some actions there would have been serious general rebellions in New Spain, and he could well have lost all influence.]He worked successfully to keep the Muslim's from over-running Europe. This was part of his strategy to guard his people and civilization against those who would destroy it.Part of his grand strategy of life was to be a good father, and he did well in that regard.  No man is a failure who does such.His striving to conquer his personal weakness, to make his life conform to a Christ-like pattern and spiritual principles as he saw them, this is also an important aspect of evaluating a person.Thus,  Philip strategized in other ways and fostered many positive cultural/religious.  The fact that they did not take hold was not remotely in his control.I see it as a modern, Calvinistic influenced world-view that judges things disproportianately  by the \"geo-political\" and economic viewpoint, and devalues other aspects of life. It also devalues the motives and love which a person puts into their work, all in obeisance to \"the bottom line.\"Regarding his management work, there are many cases where Philip's micro-management and waiting as long as possible ['until an elephant steps on your foot'] led to excellent decisions.Further, one might ask what would have been the result if Philip had NOT micro-managed things like Lepanto?  Walsh shows how it would not have gone well.It is fine to blithely say \"delegate\" but who was he to delegate to?  Alba?  He was not balanced to make such decisions?  Margaret?  Too weak and influenceable. Parma turned down the offer to go the Netherlands before  it went to Alba.I would say that in the things that Philip actually could control he did very well.  He was not at his best when dealing with dishonest rulers such as Elizabeth and her pirates, nor with duplicitous characters generally. And sometimes his fervor for good led to impractical policies.I would give Philip an A- overall.An A++ for effort and motive."}, {"review_sentiment": 5.0, "review_text": "\"The Grand Strategy of Philip II\" is a rare book.  On the one hand, it is a convincing scholarly reassessment of Spanish imperial policy during the pivotal late 16th century.  In that sense, the book is written to the high standards of the academy: exhaustive primary research - much of it in the original Spanish, Latin, Italian and French - and close consideration of competing theories from previous, notable works on the period.  On the other hand, the book is an exemplary work of modern strategic studies, with a dash of business school case study analysis.  This is a piece of academic history that cites such distinguished and diverse authorities as Peter Drucker, Carl von Clausewitz and John Lewis Gaddis and uses a broad range of historical analogies - from the Vietnam War, the Second World War and the US Civil War - to illuminate and contrast critical points.  The end result is one of the more compelling works on strategy written in the past few decades.Geoffrey Parker very much wrote this book in response to Paul Kennedy's poor treatment of Philip II and the decline of the Spanish empire in Kennedy's enormously popular and influential 1987 book \"The rise and fall of the Great Powers.\"  On the surface, Parker seeks to refute the conventional academic wisdom that Philip II had no grand strategy in any sense of the term.  While the issue of \"grand strategy\" is discussed throughout, the book really revolves around Philip's planned 1588 invasion of England, which featured the legendary Spanish Armada and ended in utter catastrophe before it really began.The book is broken into three more-or-less equal components.  The first section offers a fascinating overview of the world Philip lived in and the unmanageable world of paperwork and decision-making that he created for himself.  Parker is none too kind to Philip in this book.  Most of the challenges and failures of Philip's half-century reign Parker attributes to Philip's insistence on the centralization and compartmentalization of all information and decision-making (Parker openly compares his style and system to that of Hitler).  Parker suggests that if Philip had been born 500 years later in similarly privileged circumstances, he might have been an awful CEO of a family-owned business.  One of his great faults, in Parker's estimation, was his \"zero-defects mentality\" - the fear of failure that so dominated his actions that it paralyzed his ability to act on anything but certain knowledge.Parker describes stunning scenes of Philip working 18-hours-a-day like some Wall Street attorney, hunched over a mountain of papers and embroiled in the most arcane details of imperial appointments and financial management (of which he had little understanding).Much has been made of the long time it took for messages to travel from place to place in the 16th century.  Parker argues that it was more the uncertainty of communications that presented the truly vexing problem of the age, not necessarily the long time it took for information to travel.  For instance, a message from Venice to Paris could take anywhere from one to six weeks to arrive.  It was the unknown margin that led leaders to fits of despair and uncertainty.  Finally, Parker raises an issue in this first section that forms a central part of his indictment against Philip II - his profound and unshakeable conviction that the mission of Spain and that of God were one in the same, and thus any obstacle or shortfall could be overcome by the miraculous intervention of the Lord himself, a phenomenon that Parker calls \"messianic imperialism.\"  The issue of religion - Catholic vs. Protestant - trumped all other considerations and Philip consistently and confidently undertook any effort that involved upholding or reclaiming the faith with the sincere expectation of a Moses-parting-the-Red-Sea style miracle to carry him to victory.The second section is a review of the situation in the Netherlands and foreign relations with England's Elizabeth Tudor.  As background, these chapters are necessary and highly informative, but they aren't nearly as absorbing and exciting to the layman as the first and final sections.The third and final section offers a focused treatment of the question: \"Why did the Armada fail?\"  For contemporary strategists, this section is by far the most compelling.  He addresses in turn the three topics most often cited as the reasons for the failure of the Armada to link with the ground forces under the duke of Parma in the Netherlands and then to launch the cross channel conquest of England.First, Parker addresses the fact that the planned invasion of England was \"the worst kept secret in Europe.\"  Parker likens the intelligence situation facing Elizabeth to that of the US government before Pearl Harbor.  Yes, much of the enemy's plan was compromised, but the high noise-to-signals ratio and the repeated false warnings of impending invasion meant that strategic surprise, especially the well-concealed intended landing site of Kent, was still achieved.  Like the FDR administration in 1941, Elizabeth knew everything, and yet knew nothing.Second, and perhaps most dramatically given the generally sober and academic tone of the rest of the book, Parker vigorously defends the actions and preparations of the invasion forces commander in the Netherlands, the duke of Parma.  He argues that Parma achieved unparalleled logistical feats to get his 27,000-man invasion force in place and ready to embark within a day-and-a-half, so any notion that the plan failed because Parma either intentionally sabotaged the invasion or was incompetent must be rejected, if one accepts Parker's reasoning.Finally, Parked concludes that the superior English naval capabilities - better ships, bigger guns, more effective leadership, better tactics, more experience in general - ultimately doomed the Armada and thus the invasion plans to failure.  Everything hinged on the ability of the Spanish to establish sea control in the Channel to get Parma's forces to England, and the British naval superiority made that basic objective nearly impossible.  The British advantage is very much described in terms that we today would refer to a \"revolution in military affairs \" (RMA).  Indeed, Max Boot used the defeat of the Armada as one of his case studies in his recent, excellent review of the RMA argument in \"War Made New.\"  Parker writes that the Spanish fully anticipated English tactics and appreciated their advantages in long-range gunnery and maneuverability, and were simply unable to overcome them.Parker sums up the Armada's failure and Philip's direct role in causing the disaster this way:  \"Philip's flawed 'management style' frustrated the Armada's success far more than the loss of secrecy, the lack of communication between the two theater commanders, and the technical differences between the two fleets.  His refusal to delegate, his 'zero-defects mentality', his self-generated information overload and his messianic outlook produced grave strategic errors that rendered operational success almost impossible.\""}, {"review_sentiment": 5.0, "review_text": "The author weaves this chapter in Spanish history with ease. The result is very impressive. Comparisons to other periods in history prove very enlightening, especially those related to the follies of micromanagement."}]}, "authors": ["Professor Geoffrey Parker", "Geoffrey Parker"], "isbn": "0300082738", "longitude": -3.7035825, "periods": ["1500s"], "title": "The Grand Strategy of Philip II", "word_cloud": "difficult imagine comprehensive preparation attack specially like careful analysis military political angle time feel head use argument analysis excellent give insight personality preference condition force hand take context dynasties spanish tie later year defeat similar defeat spanish force curiously enough even mention episode empire decline death quite contrary achieve maximum expansion century mid xix century ever actually able create empire similar bequeath successor nation able elbow core territory fail conquer defeat thrice try conquer century great serious student history even general history even even general history instead detail analysis planning decision make turbulent world communication slow unreliable religious idealism taint inspired author attempt partial success draw parallel modern time fact unusual man unusual time go great detail decision make pay particular attention information available often conflict force play decision making face task personal failure likely man matter perfect successfully especially appreciate author detail problem communication decision impact imperfection take week meant reply set instruction sometimes conflict instruction rule extensive empire massive amount information flow outdated even today instantaneous communication daunt impressive well research excellently present consider anyone wanting understand come away great appreciation tremendous problem face deal empire judge merit goal beliefs lot learn analyze decision making good particularly english school history paint heat tyrant intent destroy peace love do history way write text well organize argument tight persuasive result delight younger set historian year old go wrong historian write something philosophy belief system value begin writing aid evaluate come see try evaluate base apparently modern generally nonspiritual try starter attempt introduce mathematics training town support manner scientific thrust part enlighten realm support movement intense spiritual virtue monastery part enlighten realm people combat mindless work bring justice end crime realm great work keep legion thwart inroad lead civil war death support manner artist include titian foster beauty philosophical perspective work bring new world treatment people well least best consider resource limit influence unfortunate error take action serious general rebellion well influence work successfully keep part guard people civilization life good father well man failure strive conquer personal weakness make life conform pattern spiritual principle saw also important aspect evaluate strategized way foster many positive fact hold remotely modern influence judge thing disproportionately economic viewpoint devalues aspects life also devalue motif love person put work obeisance bottom line regard management work many case wait long possible elephant step foot lead excellent thing show go fine blithely say delegate delegate balance decision weak influence able karma turn offer go thing actually well best deal dishonest ruler pirate duplicitous character generally sometimes good lead impractical effort motive rare hand convince scholarly reassessment spanish imperial policy pivotal late century sense write high standard academy exhaustive primary research much original spanish italian close consideration compete theory previous notable work period hand exemplary work modern strategic study dash business school case study analysis piece academic history cite distinguish diverse authority use broad range historical analogy contrast critical point end result compelling work write past much write response poor treatment decline empire enormously popular influential rise fall surface seek refute conventional academic wisdom sense term issue discuss really revolve plan invasion feature legendary spanish end utter catastrophe really broken equal component first section offer fascinate overview world live unmanageable world paperwork create none kind challenge failure reign attribute insistence centralization compartmentalization information openly compare style system suggest year later similarly privilege circumstance business great fault estimation mentality fear failure dominate action paralyzed ability act anything certain describes stun scene work attorney hunch mountain paper embroil arcane detail imperial appointment financial management little understanding make long time take message travel place place century argue uncertainty communication present truly vex problem age necessarily long time take information travel instance message anywhere week arrive unknown margin lead leader fit despair uncertainty raise issue first section form central part indictment profound unshakable conviction mission thus obstacle shortfall miraculous intervention phenomenon call messianic imperialism issue religion trump consideration consistently confidently undertook effort involve upholding reclaim faith sincere expectation style miracle carry second section review situation foreign relation background chapter necessary highly informative nearly absorb excite layman first final third final section offer focus treatment question fail contemporary strategist section far compel address turn topic often cite reason failure link ground force duke launch cross channel conquest address fact plan invasion worst keep secret liken intelligence situation face government much enemy plan compromise high ratio repeat false warning impend invasion mean strategic surprise especially intend land site still achieve administration know everything yet know perhaps dramatically give generally sober academic tone rest vigorously defend action preparation invasion force commander duke argue achieve unparalleled logistical feat get invasion force place ready embark notion plan fail intentionally sabotage invasion incompetent accept conclude superior naval capability better ship bigger gun effective leadership better tactic experience general ultimately doom thus invasion plan failure everything hinge ability spanish sea control get force naval superiority make basic objective nearly impossible british advantage much described term today revolution military affair indeed use defeat case study recent excellent review argument write spanish fully anticipate english tactic appreciate advantage gunnery maneuverability simply unable overcome sum failure direct role cause disaster way flaw style frustrate success far loss secrecy lack communication theater commander technical difference fleet refusal mentality information overload messianic outlook produce grave strategic error render operational success almost impossible author weave chapter spanish history ease result impressive period history enlighten especially related folly micromanagement", "genres": ["History"], "summary": "This fascinating book is highly original, in that it specifically analyses how Philip II of Spain ruled the first global empire in history, from 1556 to his death in 1598. \r\n\r\nGeoffrey Parker investigates the strengths and weaknesses of Philip's strategic vision, the priorities that underlay his policies, the practices and prejudices that influenced his decision-making, and the external factors that affected the achievement of his goals. \r\n\r\nGeoffrey Parker is Andreas Dorpalen Professor of History at The Ohio State University, and winner of the 2012 Heineken History Prize.", "asin": "0300082738", "rank": "1357798", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51PhRqrqc7L.jpg", "country": "Spain", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}