{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 29, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Exactly as described.  Perfect"}, {"review_sentiment": 5.0, "review_text": "Will be reading it and taking book with me on Galapagos trip."}, {"review_sentiment": 5.0, "review_text": "bought it as a gift and the recipient really enjoys as a precursor to their trip."}, {"review_sentiment": 5.0, "review_text": "Well researched, more of a reference book than a travel guide, more in depth on the science and nature."}, {"review_sentiment": 5.0, "review_text": "I am going to the Galapagos Islands next month and this was a great introduction to the geology, plant, animal, and sea life of the Islands. The photos were incredible and enhanced the text.  I had a generaI idea of the characteristics of the islands but Stewart's book provided great examples of the plants and wildlife endemic to each island and why they differ from island to island. It was a fascinating read and I feel much better prepared for my bucket list adventure to this wonder of the world."}, {"review_sentiment": 5.0, "review_text": "Love the pictures and its just what i needed"}, {"review_sentiment": 5.0, "review_text": ":)"}, {"review_sentiment": 4.0, "review_text": "Love it!"}, {"review_sentiment": 4.0, "review_text": "ok"}, {"review_sentiment": 5.0, "review_text": "Good Intro- I hope to take my daughter, her wife, and my granddaughter there."}]}, "authors": ["Paul D. Stewart"], "isbn": "0300122306", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Galápagos: The Islands That Changed the World", "word_cloud": "exactly describe read take trip buy gift recipient really enjoy precursor trip well research reference travel guide depth science nature go next month great introduction geology plant animal sea life photo incredible enhance text genera i idea characteristic provide great example plant wildlife endemic island differ island island fascinate feel much better prepared bucket list adventure wonder picture need ok good hope daughter wife granddaughter", "genres": ["History", "Travel Writing", "Science & Nature", "Guide Books"], "summary": "Rocky, fragile, beautiful, strange—the Galápagos archipelago is unlike any other place on earth. Its geology, its unique flora and fauna, and its striking role in human history intersect in surprising and dynamic ways. \r\n\r\nThis book is the most wide-ranging and beautifully illustrated book available on the famous islands. Not since Darwin’s Naturalist’s Voyage has a book combined so much scientific and historic information with firsthand accounts that bring the Galápagos to life.\r\n\r\nGalápagos: The Islands That Changed the World describes how tragedy and murderous pirates curtailed settlement of the islands and how the islands’ pristine nature, spectacular geology, and defining isolation inspired Darwin’s ideas about evolution. \r\n\r\nThe book explores the diverse land and marine habitats that shelter Galápagos species and considers the islands’ importance today as a frontier for science and a refuge for true wilderness.\r\n\r\nThe book’s extensive gazetteer provides details about endemic plants and animals as well as travel advice about visitors’ sites, diving, photography, when to go, and what to take. Vividly illustrated throughout, this guide is an indispensable reference for natural history enthusiasts, armchair travelers, and island visitors alike.", "asin": "0300122306", "rank": "104532", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/51LhZn0pFrL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}