{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 22, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "good sale"}, {"review_sentiment": 5.0, "review_text": "This very well written book by Peter Russell conceivably could be an extension of Isabell Stillwell's historical novel, “Philippa of  Lancaster,” for it begins where the latter leaves off with the Portuguese taking of Ceuta.  Russell's non-fiction detailed work not only digs out the chronicles of the events of Henry's life but provides comparison and argues the respected chroniclers words of the time on their respective reports.  This is a fascinating story!Much of the materials revealed in this text was not familiar to me and I thought I knew this biography. What I did know was Henry's horoscope on his birth predicted he would be a crusader and explorer. Chapter 4 reveals Henry laid claim and profited greatly to three groups of Atlantic islands: uninhabited Madeira group, Azores, and Cape Verde Islands during his time on the planet.  By continuous coercion over a 40 year period he attempted to obtain the Canaries from Castile settlers and aboriginals without setting foot on a ship or any of them.Chapter 6 takes the reader into the story of Henry's unsuccessful invasion of the Sultanate of Morocco with originally planned 15,000 men on a shoestring budget.  After arguing civil and church law, Henry sets sail with a Christian Army for Tangiers in August 1437.  Here he finds himself confronted by Salih ben Salih the ousted Ceuta leader 22 yrs prior.  Unfortunately, he could only muster 7,000 and ended up being humiliated (due to his poor planning) by his rival and surrenders at Tangiers, allowing his younger brother Fernando to be held hostage. This cascades into Fernando's dying in captivity in Fez, thus influencing the untimely death of his older brother the king, Duarte I.  This overzealous undertaking for such a small kingdom reveals how headstrong and uncivil Henry was toward anyone who opposed his will.A product with his siblings of a very pious union, as favorite son of his father, Joao I, and “The tip Of The Spear” of the Illustrious Generation,” Henry, never married, spent the first third of his life proving himself a knight; the middle third as administrator but never knight of the “Order of Christ”discovering and cultivating lands from exploration of Atlantic islands; and the last third exploring (through his monopoly) the West Africa Coast looking for gold from the interior of the continent.  This led to a settling for very lucrative trade of horses for African slaves in the name of convenient papal approved christian conversion.As we look at Portuguese history up until this Hernrican Period it is quite plausible his time was the spark that caused the economic impetus to propel this small country to great riches and world power status. I personally will be in Sagras, Lagos, and Tomar next month to view this Hernrican legacy."}, {"review_sentiment": 5.0, "review_text": "An excellent work.  Russell's clear writing, solid scholarship, and general knowledge of the era, nation, and man provide for an excellent biography.  This is, bar none, the best biography of Prince Henry of Portugal there is (and probably, will be for a long time).  Russell takes the slender thread of information on Henry's personal life and extrapolates outward, never making strained judgement or off-the-wall contentions.  There are more (but still spotty) records on Henry's official life as wouldbe crusader and actual sponsor of trading and exploring voyages in the eastern Atlantic, and Russell  plumbs these deftly and ably.Overall, Henry was not the \"Navigator\" or nineteenth-century historians (the Germans first gave him that name, the Brits picked it up and ran with it), nor was he a pre-Enlightenment Renaissance man-of-science-and-rationality.  Henry, as Russell shows, was a late medieval crusader knight who just happened to be forward thinking enough and, this is important, desirous of fame enough to find ways to seek fame and money.  And if that meant exploring and trading in the Atlantic and along the African coast, so be it.  Of course, crusading and reconquest was his other goal, and exploring and trading fit into this too.  If you can get around Islam and find the Christian Prester John in Ethiopia, you could attack Islam from the rear.  So.  Thus the twin moving factors of Henry's life, fight Islam and explore/trade, could be boiled down to \"fight Islam,\" and, if we want to go one step further, it could be boiled down to: seek fame and fortune.  Russell does a fine job of ferreting out and explaining Henry's motivations and can even explain them when they seem contradictory.The exploration of the Atlantic is, for most readers, why they would pick up this book.  They won't be disappointed.  You will find here a great store of information on the boats heading south and west, the exploration of the African coast, the encounters with African peoples, etc.  This is perhaps the best book in that regard, unless you want to sit down and read (assuming you can find) the volumes of <i>Monumenta Henricina</i>.Two issues.  There is but one map and a somewhat confusing family tree.  The book could have stood to have a map of Portugal and separate one for the discoveries, each more detailed and helpful.  The images were nice, but I would have liked to have had a discussion on the possibility that the portrait of Henry we've grown accustomed to, the one from the polyptych of S. Vicente de Fora, is not Henry.  Only a doubt is mentioned in a caption.  (See Wikipedia for what I'm talking about.)"}, {"review_sentiment": 4.0, "review_text": "Interesting book"}, {"review_sentiment": 5.0, "review_text": "Ladino, Sephardic language!It is an ancient language you.And this is not even a verse.You migration triptych.Govorimy, you are great.And all live phonemes.Those customs guard.Relationship with nature.And the stories of the people.Here Ibero-Romance subgroup.And Giudecca is very necessary.Spagnolo has always loved.Dzhudezmo it holy.Hebroneo many faces.Developed as an instant.Curacao in the Netherlands.And in Brazil there is tango.Turkey and Greece.And of course Mexico.France, Serbia, Bulgaria.We are proud of you all.Romania, Bosnia, Portugal.Immediately and Italy.Herzegovina, Northern Africa.Izrail and the Arctic.Goya, as mail for us.Fado, Prince Enrico caravels.And Columbus traveled light.What opened, so something for everyone.As Strabo all describe.Herodotus, he knew all about it.Atlantis us sweet.Communication that was an eternity.Plato was looking for you.Gallery!https://www.createspace.com/6255781?ref=1147694&utm;_id=6026http://www.amazon.com/Africa-Heart-Gush-Sholom-Aleichem/dp/1500314234/ref=sr_1_fkmr0_1?s=books&ie;=UTF8&qid;=1462520094&sr;=1-1-fkmr0&keywords;=Iliyan+yurukov+Afrika+heart+of+Hushdanhttp://www.amazon.com/Velasquez-Spain-Portugal-forgotten-symbolics/dp/1512338273/ref=sr_1_67?s=books&ie;=UTF8&qid;=1462520238&sr;=1-67&keywords;=Iliyan+Yurukovhttp://www.amazon.com/Ladino-Africa-ethnicity-language-immigration/dp/1533108757/ref=sr_1_14?s=books&ie;=UTF8&qid;=1462520317&sr;=1-14&keywords;=iliyan+yurukovhttp://www.amazon.com/Bin-Gur-Resettlement-jewelry-associations-painting/dp/1514721384/ref=sr_1_fkmr0_1?s=books&ie;=UTF8&qid;=1462520434&sr;=1-1-fkmr0&keywords;=Ben+Gur+Iliyan+Yurukov"}, {"review_sentiment": 3.0, "review_text": "It is almost a crime. This is an academic book in desperate need of a populist writer. The biography Prince Henry the Navigator will need some re-writing in order to be memorable. The casual reader may find this book hard to get excited about once reading begins. The book's subject, Prince Henry, is a legend of the late medieval Portuguese court and his exploits furthered the Portuguese Empire and established a colonial legacy (good or bad) that remains today in Western Africa. So, why did Sir Peter Russell make such a man so dull? It seems the author lost his zeal for his subject before he even started writing. Perhaps Mr. Russell became burdened by his own legacy - born in 1914, he fought and flew in and over Northern and Western Africa during World War II, later establishing a highly distinguished career as an academic wunderkind at Oxford University in England where he oversaw the Department of Portuguese Studies. Prince Henry seems to fall into the unfortunate category of a \"legacy book\". In other words, Mr. Russell felt compelled to write a biography, or as he calls it \"a history of Portuguese expansion guided by Prince Henry\" to secure his legacy. Mr. Russell's longtime position atop the Oxford Portuguese Department chair demanded an attempt at something great  - a magnum opus. Mr. Russell sleepwalks through the history relying on his knowledge (which is prodigious) and one or two key sources to analyze and evaluate the history. He uses the tried and true theme of Crusading as a window to view Prince Henry - a pious yet realistic leader who used his influence to expand Portuguese territory and the Catholic faith of Christianity. Mr. Russell's surprising lack of enthusiasm for his subject absolutely cripples the reading experience for audiences; many will realize this after reading the first chapter. There is definitely a lot of information in this book, but it is so dryly constructed that it feels like it should be sped read instead of savored or studied. So, then why read this book at all? Read this book because, despite Mr. Russell's attempt, Prince Henry is still too interesting to forget."}, {"review_sentiment": 5.0, "review_text": "Excellent biography"}, {"review_sentiment": 4.0, "review_text": "This is not the Henry The Navigator from your grade school history book or the scientific Henry holding a caraval while contemplating the Ocean Sea from his monument. The man portrayed in this finely written biography is a Prince driven by a combination of commercial ambition and religious zealotry to expand his personal influence using the means most readily available to him in a country bounded by a much larger neighbor blocking landward expansion and facing the sea. Henry's enterprise begins with the conquest of Cuetta on a peninsula in Morocco where he gains some experience of administration and develops a taste for further colonization of the Atlantic Islands ultimately leading to an exploration and exploitation of the African coast.Sir Peter Russell is neither a iconographer or a debunker but a serious historian that approached his subject objectively and used the limited original source material to allow his readers to understand the complex political,religious and commercial motivations that led to Henry's activities and the subsequent age of exploration that Henry initiated.This is an informative and in depth study that brings the period of the Henrican expeditions to life like no other book that I've found."}, {"review_sentiment": 5.0, "review_text": "A well-written, well-documented history of one of the great figures of 15th century Europe. A fascinating view of beginning of the Age of Discoveries."}, {"review_sentiment": 4.0, "review_text": "As a boy given a Eurocentric education, I was enamored with the great explorers of the world - Columbus, Cabot, Magellan, Drake, et al.  Prince Henry the Navigator was among the \"et al\", but I don't recall much of what I learned about him as a boy other than that he was a genius of open seas navigation who pushed Portuguese seafarers beyond the bounds of the known pre-Columbian flat earth.  Now, a half century later, Sir Peter Russell tells me that that was partly myth.Perhaps the greatest misimpression about Henry (b. 1394, d. 1460) was that he was a skilled seaman.  In truth, while he was a sponsor of Portuguese exploration down the western coast of Africa and an avid student of navigational science, he did not personally participate in any voyages of exploration and discovery.  Still, he is an historical figure of considerable if not overriding importance and one who merits the sort of knowledgeable and well-written study that Russell has given us.Among other things, Henry was an ardent Crusader against the Muslim infidel (it is primarily due to Henry's zeal along these lines that Portugal ended up with possessions and colonies in Northwest Africa), he was thoroughly imbued with and practiced the ethos of chivalry, he was an early champion of organized and crown-sponsored oceanic discovery, and he was a driving force behind the model of commercial exploitation of discovered/conquered lands that evolved into European colonialism.  He also promoted and profited from slave-trading.It is primarily because of his role in the expansion of slave-trading that Henry's current stature in history is as much villain as hero.  And the rationale by which he, as a devout Christian, justified slave raiding and trading is scarcely believable at this remove.  \"The Prince * * * thought of his role in turning Portugal into a major slave-trading country as an evangelizing achievement of which he could be proud, and one which would make a major contribution to his posthumous fame in history as a tireless battler to bring the Christian message to infidels and pagans.\" For Henry, conversion and enslavement were essentially interchangeable terms.  \"[A]ny `inconveniences' the converted slave might have to endure in this life being as nothing when compared with the certainty of eternal salvation that conversion brings with it.\" Russell believes that Henry actually believed this malarkey.  But lest we overheap opprobrium on Henry, it should be noted that he and the Portuguese did not initiate the Atlantic slave trade:  before the first Portuguese slave-raiding expedition landed with its human cargo in Lagos in 1444, Genoese, Catalan, and Castilian merchants had long been in the habit of buying in the Atlantic ports of Morocco black slaves imported from the Sudan by trans-Saharan caravans.PRINCE HENRY `THE NAVIGATOR' is solid history.  It also, in its magisterial way, is very British history.  But even for British history, it is very well-written.  Here is one example from early in the book: \"A more certain contributory cause of the Prince's future relentless pursuit of personal fame was his status as a third son; from an early age he seems to have made it plain to those around him that he was unlikely to turn out to be a man content to settle for the subordinate role that this accident of birth seemed to have assigned to him.\"At one point, Russell describes Henry as \"a thoroughly traditional late-medieval Christian of his time\".  That sort of person is now quite alien.  Much of the value of this book inheres in its explication of just what is entailed by \"a thoroughly traditional late-medieval Christian\" of the early 15th Century.  PRINCE HENRY `THE NAVIGATOR' is not only a biography of a notable figure from history, it also is a profile of an age.  I cannot pretend that it in any way is \"essential reading\", but no reader would be poorer for the experience.P.S.:  Javier Marías dedicated his magnum opus, the three-volume novel \"Your Face Tomorrow\", to Sir Peter Russell.  Russell, who when he wrote PRINCE HENRY (in his 80s) was the most distinguished scholar in the English-speaking world on matters of Iberian history, had been a mentor of sorts to Marías.  Russell also was the thinly disguised model for Sir Peter Wheeler, who is the wise elderly mentor to the protagonist Jaime Deza in \"Your Face Tomorrow\".P.S.S.:  The quote used as the title for this review is from Shakespeare's \"King Henry the Fourth, Part I\".  Russell used it as an epigraph to the book and it does encapsulate the complexity of Prince Henry, something this review cannot begin to approximate."}]}, "authors": ["Sir Peter Russell", "Peter Russell"], "isbn": "0300091303", "longitude": -9.1365061, "periods": ["500-1400s"], "title": "Prince Henry the Navigator", "word_cloud": "good sale well write conceivably historical begin latter leave portuguese take detailed work dig chronicle event life provide comparison argues respect chronicler word time respective report fascinate story much material reveal text familiar think know biography know horoscope birth predict explorer chapter reveals lay claim profit greatly group island uninhabited group time planet continuous coercion year period attempt settler aboriginal set foot ship take story unsuccessful invasion originally plan men shoestring budget argue civil church law set sail here find confronted ben oust leader yr prior unfortunately end humiliate due poor plan rival surrender tangier allow younger brother hold hostage cascade die captivity thus influence untimely death older brother king overzealous undertake small kingdom reveals headstrong uncivil anyone oppose product sibling pious union favorite son father tip never marry spent first third life prove knight middle third administrator never knight discover cultivate land exploration islands last third explore monopoly look gold interior continent lead settle lucrative trade horse slave name convenient papal approve christian look portuguese history quite plausible time spark cause economic impetus small country great rich world power status personally next month view legacy excellent work clear write solid scholarship general knowledge era nation man provide excellent biography bar none best biography probably long time take slender thread information personal life extrapolate outward never make strained judgment contention still spotty record official life would be crusader actual sponsor trading explore voyage eastern plumb deftly historian first give name pick ran show late medieval crusader knight happen forward think enough important desirous fame enough find way seek fame money meant explore trading coast course crusade reconquest goal explore trading fit find christian twin move factor life fight fight want step seek fame fortune fine job ferret explain motivation even explain seem exploration reader disappoint find great store information boat head south west exploration coast encounter african people etc perhaps best regard want sit assume find volume issue map somewhat confusing family tree map separate discovery detail image nice discussion possibility portrait grown accustom polyptych doubt mention caption talk interest language ancient language even migration live custom story always many course proud mail travel open something know look http tum ie id cir keywords ie id cir keywords ie id cir keywords ie id cir keywords almost crime academic desperate need populist biography order casual hard get excite reading begin subject legend late medieval portuguese court exploit further portuguese establish colonial legacy good bad remains today make man dull seem author lose zeal subject even start write perhaps become burdened legacy bear fought flew later establish highly distinguish career academic wunderkind seem fall unfortunate category legacy word felt compel write biography call history portuguese expansion guide secure legacy longtime position chair demand attempt something great magnum opus sleepwalk history rely knowledge prodigious key source analyze evaluate history use tried true theme window view pious yet realistic leader use influence expand territory faith surprising lack enthusiasm subject absolutely cripple read experience audience many realize read first chapter definitely lot information dryly construct feel speed instead savor study so read attempt still interest forget excellent biography grade school history scientific hold caravel contemplate monument man portray finely write biography drive combination commercial ambition religious zealotry expand personal influence use mean readily available country bound much larger neighbor block landward expansion face sea enterprise begin conquest peninsula gain administration develop taste colonization ultimately lead exploration exploitation iconography debunked serious historian approach subject objectively use limited original source material allow reader understand complex political religious commercial motivation lead activity subsequent age exploration informative depth study bring period expedition life find history great figure century fascinating view begin discovery boy give education enamor great explorer world al et al recall much learn boy genius open sea navigation push portuguese seafarer bound know flat earth now half century later tell partly greatest misimpression b skilled seaman truth sponsor exploration western coast avid student navigational science personally participate voyage exploration discovery still historical figure considerable override importance merit sort knowledgeable study give thing ardent infidel primarily due zeal line end possession colony thoroughly imbue practiced ethos chivalry early champion organize oceanic discovery drive force model commercial exploitation land evolved european colonialism also promote profit primarily role expansion current stature history much villain hero rationale devout justify raid trade scarcely believable think role turn major country evangelize achievement major contribution posthumous fame history tireless battler bring christian message infidel pagan conversion enslavement essentially interchangeable term ny convert slave life nothing compare certainty eternal salvation conversion bring believe actually believe malarkey lest overhear opprobrium note portuguese initiate slave trade first portuguese expedition land human cargo castilian merchant long habit buying port black slave import solid history also magisterial way british history even british history here example early certain contributory cause future relentless pursuit personal fame status third son early age seem make plain unlikely turn man content subordinate role accident birth seem assign point describe thoroughly traditional christian time sort person quite alien much value inhere explication entail thoroughly traditional early biography notable figure history also profile age pretend way essential reading dedicate magnum face write distinguish scholar world matter iberian history mentor sort also thinly disguised model wise elderly mentor protagonist quote use title review use epigraph encapsulate complexity something review begin approximate", "genres": ["History"], "summary": "A re-evaluation of the life of the legendary 15th-century Portuguese prince, Henry the Navigator. It examines the full range of the Prince's activities as an imperialist and as a maritime, cartographical and navigational pioneer.", "asin": "0300091303", "rank": "651095", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/51OK5-UtxzL.jpg", "country": "Portugal", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}