{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 124, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "One of the earliest English translations of Modiano’s work following his award of the 2014 Nobel Prize in Literature, Suspended Sentences is a collection of three novellas and an excellent introduction to his oeuvre.The first, Afterimage, showcases Modiano’s alluring use of gracefully thin plotting, and his spare efforts to keep us anchored in time.  The experience is a bit like viewing an abstract painting—one just looks, and listens, and feels one’s way along.  The sounds of Paris, the silky air of memories of the City of Light, with clues so slight they’re like tasty tidbits marking the way forward.  Turn the page, mon ami, profiter du voyage.The second, Suspended Sentences, is a tale of an almost-orphaned childhood, in which a less-than-honorable backstory emerges very slowly—as in most of our lives.  In the third, Flowers of Ruin, the protagonist strolls through his former neighborhood, sorting through personal memories and Parisian apocrypha, feeling the City of Light—and gloom—seeping into his bones, latent in the stairways and flagstones he and his Jacqueline once trod.  In both these stories, memories intersect then interweave but broad spaces never close, questions don’t resolve.  Eventually, in what feels like a bit of metafiction, a vocation emerges for our unnamed protagonist, and another parcel of shameful patrimony arrives.Reading Modiano is a cheap ticket to Paris, for an opera box seat onto the post-war generation it spawned."}, {"review_sentiment": 4.0, "review_text": "Spellbinding prose and narrative.  The only drawback to this novel is that it references so many places, streets, and venues in Paris, of which I am not familiar, especially in the last few pages of the book--so much so that it was hard for me to finish it, although I did.  Nevertheless, I was captivated by this novel in some way I can't explain."}, {"review_sentiment": 5.0, "review_text": "I am trapped in a Modiano time loop, i simply cannot stop reading or re-reading his books: his characters, places, sentences... merge into a continuum, and then feed into my own memory. These three novellas feature all the recurrent modianesque themes, which are also those of Proust's A larecherche: time, loss, identity and memory. For some reasons i couldn't stop thinking of Godard's Band of Outsiders when reading this book, it's almost as if scenes of that film jumped out of the pages. So, out of curiosity i googled Modiano+Godard. Bingo. I discovered that Modiano's mother had a part in Godard’s film, and the views of the Louvre across the Seine in that movie were shot from Modiano’s bedroom!"}, {"review_sentiment": 5.0, "review_text": "Very difficult to write actual  memories. \"Specialist\" reading."}, {"review_sentiment": 3.0, "review_text": "The stories just wandered around and then ended. Excessive Paris geography. I wanted more plot development. Never felt any sense of engagement with characters."}, {"review_sentiment": 2.0, "review_text": "I don't care if he won the Nobel prize (or whatever other prize he won): this is a self-indulgent minor travelogue, in which the author shows off how much he knows of Paris side-streets.  Big deal!"}, {"review_sentiment": 5.0, "review_text": "I loved it and I am anxious to read it again. This was my introduction to Modiano's work. It made me think of Virginia Woolf and Marcel Proust.For me, the plot was not so important as the feeling evoked by the novellas. It has made me more mindful of time, people and places."}, {"review_sentiment": 1.0, "review_text": "I fail to understand the popular and critical praise that has been heaped on this book - a collection of three loosely related novellas that are, singly and collectively, pointless.  Perhaps because of this author's apparent fixation on the \"mystery\" of his father's ultimate fate in the aftermath of WWII - a mystery that plays out in all three of the novellas - this is a singularly unsatisfying book.  Nothing really happens, nothing is ever resolved, everything is vague, and there are lists that add nothing to the prose or the story.  I read this for my book club, which I joined because it makes me read things I wouldn't otherwise read.  Sometimes that's a good thing, but this wasn't one of those times."}, {"review_sentiment": 4.0, "review_text": "The three novellas in this collection by Patrick Modiano, a French writer who won the 2014 Nobel Prize in literature read like reminiscences, walks down memory lane by the author donning the guise of his three main protagonists. The author provides so many recognizable (or verifiable) details that these fictional accounts hover constantly along the edges of reality. And, maybe this is what ties these novellas together—that stories we tell, however fictional or even fantastical, somehow always come back to things that are (or were) real in the author’s life. Fiction, for most writers explains and extends who they are.For Modiano, a French Jew who was born at about the end of World War II, the holocaust is what looms large in that past, and consequently, in his “being.” He makes allusions to it in each of these three novellas, all set just a few years after the war. A major aspect of those allusions relates to his sense of losing someone whose “being” is now condensed in memories. It’s no wonder he won the coveted Nobel “for the art of memory with which he has evoked the most ungraspable human destinies and uncovered the life-world of the Occupation.”The sad, inevitable fact of life that threads through these novellas may be this—the uncertainty and finite life of memories, and our inability to grasp them fully, even when we can recount details. In life, as in fiction, those recollected details can only hover along the edges of what really happened. But Modiano tries his darnedest to recall them, sometimes street by street, as if he’s afraid to forget them.As you read Patrick Modiano’s narrations of the unique stories of his main characters, you’re likely to be drawn into his meditative mood, to look back at your own life. Buried in the nostalgia of that past are little nuggets of ourselves. Nuggets that come to us as memories we coax out of neurons in our brain, or call up from things stashed in garaged boxes. Either way, we have to deal with the fact that not only are those memories foggy, they fleet away after awhile. Maybe, Modiano’s compulsion to rehearse his experience (and that of others he knew) of the holocaust is his way of keeping it alive."}, {"review_sentiment": 4.0, "review_text": "Beautifully written but emotionally elusive yet in the end compelling."}]}, "authors": ["Patrick Modiano"], "isbn": "0300198051", "longitude": 2.3514992, "periods": ["1900s"], "title": "Suspended Sentences: Three Novellas", "word_cloud": "earliest english translation work follow award collection excellent introduction first showcases allure use gracefully thin plot spare effort anchored time experience bit view abstract look listen feel way sound silky air memory clue slight tasty tidbit mark way forward page mon aim profiteer dew second tale childhood backstory emerge live third protagonist stroll former neighborhood sort personal memory parisian feel bone latent stairway flagstone trod story memory intersect interweave broad space never close question resolve eventually feel bit meta fiction vocation emerge unnamed protagonist parcel shameful patrimony cheap ticket opera box seat generation spawn spellbind prose narrative drawback reference many place street venues familiar especially last page much hard finish nevertheless captivate way trap time loop simply read character place sentence merge continuum fee memory feature recurrent modianesque theme also proust la recherche time loss identity memory reason think read almost scene film jump page curiosity google discover part film view movie shot bedroom very difficult write actual memory specialist read story wander end geography want plot development felt sense engagement character care minor travelogue author show much know deal love anxious introduction work make plot important feeling evoke make mindful time people place fail understand popular critical praise heap collection loosely related singly collectively pointless perhaps author apparent fixation mystery father ultimate fate aftermath mystery play singularly unsatisfying really happen nothing ever resolve everything vague list add nothing prose story club join make thing otherwise sometimes good thing time collection writer literature reminiscence walk memory lane author don guise main protagonists author provide many recognizable verifiable detail fictional account constantly edge reality maybe tie story tell however fictional even fantastical somehow always come thing real author life writer explain extends born end holocaust loom large past consequently make allusion set year war major aspect allusion relate sense lose someone condensed memory wonder coveted art memory evoke ungraspable human destiny uncover sad inevitable fact life thread uncertainty life memory inability grasp fully even detail life fiction recollect detail hover edge really happen try darnedest recall sometimes street street afraid forget narration unique story main character likely drawn meditative mood back life past little nugget come memory coax neuron brain call thing stash garage box way deal fact memory foggy away awhile compulsion rehearse experience others know holocaust way keep alive beautifully write emotionally elusive yet end compelling", "genres": ["Fiction & Literature"], "summary": "A trio of intertwined novellas from the 2014 Nobel laureate for literature\r\n\r\nIn this essential trilogy of novellas by the winner of the 2014 Nobel Prize in Literature, French author Patrick Modiano reaches back in time, opening the corridors of memory and exploring the mysteries to be encountered there. Each novella in the volume--Afterimage, Suspended Sentences, and Flowers of Ruin—represents a sterling example of the author’s originality and appeal, while Mark Polizzotti’s superb English-language translations capture not only Modiano’s distinctive narrative voice but also the matchless grace and spare beauty of his prose.\r\n\r\nAlthough originally published separately, Modiano’s three novellas form a single, compelling whole, haunted by the same gauzy sense of place and characters. Modiano draws on his own experiences, blended with the real or invented stories of others, to present a dreamlike autobiography that is also the biography of a place. Orphaned children, mysterious parents, forgotten friends, enigmatic strangers—each appears in this three-part love song to a Paris that no longer exists.\r\n\r\nShadowed by the dark period of the Nazi Occupation, these novellas reveal Modiano’s fascination with the lost, obscure, or mysterious: a young person’s confusion over adult behavior; the repercussions of a chance encounter; the search for a missing father; the aftershock of a fatal affair. To read Modiano’s trilogy is to enter his world of uncertainties and the almost accidental way in which people find their fates.", "asin": "0300198051", "rank": "135700", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51pt%2Ba3kQcL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}