{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 45.6500335, "ratings": {"num_ratings": 50, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "My first Jan Morris book - it won't be my last!  Reading this was like being back in my most engaging college humanities classes."}, {"review_sentiment": 5.0, "review_text": "I was a member of the US Army, 351st Infantry Regt 1952-1953 in Trieste.The book is accurate and well written."}, {"review_sentiment": 4.0, "review_text": "I first came across Jan Morris on a tv programme with Michael Palin in 1997 when they were in Trieste.  It looked fabulous and they were both so complimentary about it so I visited that year and have been back about 25/30 times with different people since. It's mix of cultures make it fascinating and never fails to disappoint.I have reread the book recently and have filled in a lot of the gaps in my knowledge.  I never did forget the last line of this book and hope that our ghosts will meet someday below the Castle Miramar Jan."}, {"review_sentiment": 1.0, "review_text": "Worst book I have ever read. The author had a bizarre and grim attitude from the beginning. He rambles on jumping from historical facts to courteous drivers and restaurants in the present. Very strange."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "Having recently visited Trieste for the first time, and then read this book, I am awed by the mastery of Jan Morris, as a writer, historian, and colorist, for yes, she provided me with color I could not see with my own eyes, the richness of that place and its people. Everything one could possibly want to know about Trieste, a tapestry of great beauty! A fascinating book that I could not put down..."}, {"review_sentiment": 5.0, "review_text": ",that is, Trieste, which is the “epitome of Mitteleuropa – of Europe distilled, as it were.” So wrote Jan Morris, who started life as James Morris, about one of those delightful “niche’’ places on the map, whose original purpose has long been superseded. Can the purpose for its existence be “re-invented”? Morris cites similar other places, like Danzig or Tangiers. I thought of an air force base in eastern New Mexico that was given three years to find a purpose for its existence, or it would be closed down. (Sure enough, they found one!)Trieste was founded as the port city for the Austro-Hungarian Empire, which was dissolved at the end of World War I. Its natural hinterland was present day Czech, Slovakia, Hungary, et al. Morris identifies 1897 as the imperial high water mark, when the band played the Radetzky March in the Plaza, of which only hints of its former grandeur remain (I listened to the March on YouTube trying to obtain a feeling for that time.) On the edge of three ethnic “tectonic plates,” Slav, German and Italian, the city truly has been a political football. It took “the world” almost a decade after the Second World War to decide what to do with it: should it be part of Yugoslavia, an Independent City, or part of Italy? The last won out, so the city found itself at the far eastern end of “nowhere,” cut off from its hinterland by the “Iron Curtain.”Morris provides an outstanding historical narrative of Trieste during the days of the Empire. She relates how Guglielmo Oberdan, who fled Austrian conscription, and became an Italian, returned to Trieste in an unsuccessful effort to kill the Emperor, Franz Joseph, in 1882. It was a precursor of the ethnic hatreds that led to the assassination of the Archduke Franz Ferdinand, which would commence World War I. Of particular interest are her descriptions of the writers who found nurture in Trieste, in particular, James Joyce, who wrote A Portrait of the Artist As a Young Man there. She is less complementary concerning another fellow traveler and writer, Sir Richard Burton, who ended his days there as a British Consular official. Of personal interest, I had just read and reviewed my first book written by John Berger. Morris quotes from Berger’s novel “G,” about a doctor who could not speak the language of his patients with the rationale: “… a cow didn’t have to explain its symptoms to a vet.” A memorable quip that encapsulates ethnic contempt.Morris provides thoughtful description of the natural world in which Trieste is set, the harbor, and the high stony infertile Karst that dominates its background. She also describes the Istria peninsula, just to the south of Trieste, which once had a significant Italian population that had to relocate after WWII, as this peninsula was allocated to Yugoslavia.The lead review on this book, published in 2002, entitled “Trieste Mia” gives some useful insights into the city from another who lived there. The review said that Morris viewed the city with far too much melancholy, and I would agree. Morris appears to have always been alone there, which might account for this outlook. Trieste might be better seen with a friend, though I’m not sure “Trieste is for lovers” is an expression that has gained tractions. I remain impressed with Morris’ erudition, and insights into one of those fascinating places in the world where different forces collide. I thank a fellow Amazon reviewer for this excellent recommendation. 5-stars."}, {"review_sentiment": 1.0, "review_text": "The author tries to use as many big, unrelated words as possible in every sentence. The effect is to confuse the reader. This may be the ONLY book written about Trieste, but it's like watching someone else masturbate and never reach a climax."}, {"review_sentiment": 5.0, "review_text": "It is a great and excellent story of the great city  of Trieste"}, {"review_sentiment": 5.0, "review_text": "I have enjoyed a half dozen or so of Jan Morris' stories over the years, and \"Trieste\" was no exception to this experience.  I read the book in part because Trieste was one of the most productive literary locations for Sir Richard Burton, one of my exploration heroes, and it was the city of his passing.  I have also traveled throughout this region in recent years and am fascinated by the confluence of eastern and western Christianity, and Islam.Morris brings this all together in her interpretation of Trieste as a \"city of nowhere\", because its glory seems to be all in the past; which has become a \"city for everyone\", a riff on Pico Iyer's \"Global Soul\".  I loved her comparison of an aged Trieste with those of us who are aging people, wherein both this city and us septuagenarians come to realize that one of the things that matters most in life is simply being kind to other people, which she observes is a singular quality of the denizens of Trieste.This is a thoughtful, intelligent, loving story of a place dear to the heart of Ms Morris.  You will enjoy it."}]}, "authors": ["Jan Morris"], "isbn": "0306811804", "longitude": 13.7706559, "periods": ["1900s"], "title": "Trieste And The Meaning Of Nowhere", "word_cloud": "first last back engage college humanity class member accurate well write first come tv programmer look fabulous complimentary visit year back different people mix culture make fascinate never fail reread recently fill lot gap knowledge never forget last line hope ghost someday ever author bizarre grim attitude begin ramble jump historical fact courteous driver restaurant present strange excellent have recently visit first time awe mastery writer historian colorist yes provide color eye place people everything possibly know tapestry great beauty fascinating epitome distil so write start life delightful niche place map original purpose long supersede existence cite similar place think air force base eastern give year find purpose existence enough find found port city dissolve end natural hinterland present day al identifies imperial high water mark band play hint former grandeur remain listen try feeling time edge ethnic tectonic plate slav german italian city truly political football take world almost decade second part part last city find far eastern end cut hinterland provide outstanding historical narrative day relate flee austrian conscription become italian return unsuccessful effort precursor ethnic hatred lead assassination particular interest description writer find nurture particular write less complementary concern fellow traveler writer end day official personal interest review first write quote doctor language patient rationale cow explain symptom memorable quip encapsulate ethnic provide thoughtful description natural world set harbor high stony infertile dominate also describe peninsula south significant italian population relocate peninsula allocate lead review publish entitled give useful insight city live review say view city far much melancholy appear always alone outlook see friend sure lover expression gain traction remain impressed erudition insight fascinating place world different force collide thank fellow reviewer excellent recommendation author try use many big unrelated word possible sentence effect confuse write watch someone else masturbate never reach climax great excellent story great city enjoy half dozen story year exception experience part productive literary location exploration hero city passing also travel region recent year fascinate confluence eastern western bring together interpretation city glory seem past city everyone riff love comparison age age people wherein city septuagenarians come realize thing matter life simply kind people observe singular quality denizen thoughtful intelligent love story place dear heart enjoy", "genres": ["Travel Writing"], "summary": "Here's a book for lovers of all things Italian. This city on the Adriatic has always tantalized Jan Morris with its moodiness and changeability. \r\n\r\nAfter visiting Trieste for more than half a century, she has come to see it as a touchstone for her interests and preoccupations: cities, seas, empires. It has even come to reflect her own life in its loves, disillusionments, and memories. \r\n\r\nHer meditation on the place is characteristically layered with history and sprinkled with stories of famous visitors from James Joyce to Sigmund Freud.\r\n\r\nA lyrical travelogue, Trieste and the Meaning of Nowhere is also superb cultural history and the culmination of a singular career-\"an elegant and bittersweet farewell.\" Boston Globe", "asin": "0306811804", "rank": "303449", "city": "Trieste", "image": "https://images-na.ssl-images-amazon.com/images/I/51pA00hHSkL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}