{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 42, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Good reading."}, {"review_sentiment": 5.0, "review_text": "my husband loved it!"}, {"review_sentiment": 4.0, "review_text": "This is a well written and researched history of the Zulu Nation. I found it completely engrossing and difficult to put down."}, {"review_sentiment": 5.0, "review_text": "fast moving and well written..."}, {"review_sentiment": 4.0, "review_text": "I foolishly thought that this would be downloaded to my kindle. I had previously bought this book from you in paperback form, but the print is so small I was unable to read it. I have started to read this book and it is very good, just very hard to read."}, {"review_sentiment": 5.0, "review_text": "This is an excellent history of the Zulu people in South Africa.  The author wrote a concise and studied history of the major tribe in Southern Africa.  It gave me a new outlook on the British army's difficulties with the Zulu and the problems they had trying to get their campaigns going."}, {"review_sentiment": 1.0, "review_text": "This book is a historical non- objective hack job. It is severely racist and poorly written. Only pseudo-intellectuals would protest otherwise. What I found interesting about the ex-CIA agent’s book is its focus on the sexuality of Shaka. Don Morris made a great effort to project the idea that Shaka Zulu was a latent homosexual, yes! He expresses this idea several times in this horrible book.From that point on, I stopped reading.Objective this book is not. It is created by racist to create a false history of African people in the southern portion of Africa.Finally, do not be fooled by the Buthelezi forward since he is a known traitor propped up by the racist apartheid regime that is still in economic power in southern Africa.I recommend African people read” Emperor Shaka the Great: A Zulu Epic (UNESCO Collection of Representative Works African Authors Series)” by Mazisi Kunene.As for this book it will either be resold or place in the garbage where it belongs."}, {"review_sentiment": 5.0, "review_text": "Bought this edition to re-read an excellent history of rise and fall of Zulus; had given my first copy away so a friend could enjoy it."}, {"review_sentiment": 2.0, "review_text": "The attention to detail in this book is beyond what is required for an understanding of South African history, unless you are a scholar.  You will spend hundreds of tiny-type pages bogged down in minute details that really don't matter.  Read \"The Covenant\" by James Michener if you want to understand South Africa."}, {"review_sentiment": 5.0, "review_text": "Excellent narrative of the period.  Donald Morris created a detailed account of the actions and the personalities in what must have seemed an impenetrable era.  Though daunting for its size and small print the accounts move along at a good pace and pieces of the puzzles all fall into place."}]}, "authors": ["Donald R. Morris"], "isbn": "0306808668", "longitude": 18.417396, "periods": ["1800s"], "title": "The Washing Of The Spears: The Rise And Fall Of The Zulu Nation", "word_cloud": "good reading husband love well write research history find completely engross difficult put fast move well write foolishly think kindle previously buy paperback form print small unable start good hard excellent history people author write concise study history major tribe give new outlook british army difficulty problem try campaign go historical objective hack job severely racist poorly write only otherwise find interest agent focus sexuality make great effort project idea latent homosexual yes express idea several time horrible point stop create racist create false history african people southern portion fool forward know traitor prop racist apartheid regime still economic power southern recommend african people resold place garbage belongs edition excellent history give first copy away friend attention detail require understanding south african history scholar spend hundred page bogged minute detail really matter want understand excellent narrative period create detailed account action personality impenetrable era daunt size small print account move along good pace piece puzzle place", "genres": ["History"], "summary": "In 1879, armed only with their spears, their rawhide shields, and their incredible courage, the Zulus challenged the might of Victorian England and, initially, inflicted on the British the worst defeat a modern army has ever suffered at the hands of men without guns. \r\n\r\nThis definitive account of the rise of the Zulu nation under the great ruler Shaka and its fall under Cetshwayo has been acclaimed for its scholarship, its monumental range, and its spellbinding readability. \r\n\r\nThe story is studded with tales of drama and heroism: the Battle of Isandhlwana, where the Zulu army wiped out the major British column; and Rorke's Drift, where a handful of British troops beat off thousands of Zulu warriors and won eleven Victoria Crosses.", "asin": "0306808668", "rank": "346592", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/516PAsovmWL.jpg", "country": "RSA", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}