{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 410, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Norma Wallace glides so gracefully through the decades as NOLA's most successful madam one begins to think she'll live forever."}, {"review_sentiment": 5.0, "review_text": "Enjoyed the read"}, {"review_sentiment": 5.0, "review_text": "Very good book, Really interesting piece of history in New Orleans!!"}, {"review_sentiment": 4.0, "review_text": "A Great History of New Orleans"}, {"review_sentiment": 3.0, "review_text": "Not exactly what I expected but a good read all the same. Seemingly accurate documentary on the life of Norma Wallace, New Orleans madam.  While it was an interesting read, the style of writing g tended to drag a bit and go too slowly."}, {"review_sentiment": 5.0, "review_text": "Great history concerning New Orleans—"}, {"review_sentiment": 5.0, "review_text": "Had no Idea that New Orleans had a going business of that type, in modern times. Knew Vegas did, but also know that it is legal in Nevada.Found the book very entertaining and she was certainly quite a business woman."}, {"review_sentiment": 1.0, "review_text": "Such a boring book, it only held my longest for the first few chapters. Then, it becomes a bog of who was mayor or police chief. Ugh, where's the steamy bits?"}, {"review_sentiment": 4.0, "review_text": "What a life!  Interesting how the business was protected all those years by city officials.  Also interesting was the contridictions in Madams life -hardness and generosity all dealt with cunning slyness.  The length of the book and repetitious behavior became tedious before the last page."}, {"review_sentiment": 1.0, "review_text": "Poorly written"}]}, "authors": ["Chris Wiltz"], "isbn": "0306810123", "longitude": -90.0701156, "periods": ["1900s"], "title": "The Last Madam: A Life In The New Orleans Underworld", "word_cloud": "glide gracefully decade successful madam begin think live forever enjoyed very good interesting piece history not exactly expect good accurate documentary madam interest style write g tend drag bit go slowly history concern go business type modern time also know legal entertain certainly quite business woman such boring held longest first chapter then become bog mayor police chief steamy bit interest business protect year city official also interest contradiction generosity deal cunning slyness length repetitious behavior become tedious page poorly write", "genres": ["Biography", "History"], "summary": "In 1916, at age fifteen, Norma Wallace arrived in New Orleans. Sexy and shrewd, she quickly went from streetwalker to madam and by 1920 had opened what became a legendary house of prostitution. There she entertained a steady stream of governors, gangsters, and movie stars until she was arrested at last in 1962. Shortly before she died in 1974, she tape—recorded her memories-the scandalous stories of a powerful woman who had the city's politicians in her pocket and whose lovers included the twenty-five-year-old boy next door, whom she married when she was sixty-four. \r\n\r\nCombining those tapes with original research, Christine Wiltz chronicles not just Norma's rise and fall but also the social history of New Orleans, thick with the vice and corruption that flourished there—and, like Midnight in the Garden of Good and Evil and Philistines at the Hedgerow, resurrects a vanished secret world.", "asin": "0306810123", "rank": "54251", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/517R2al-DBL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}