{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 43.7009358, "ratings": {"num_ratings": 95, "rating": 2.9, "reviews": [{"review_sentiment": 4.0, "review_text": "I little on the worn side but nonetheless okay condition!"}, {"review_sentiment": 1.0, "review_text": "a lot of filler, You get a lengthy bio of every person just mentioned in the book, I hate authors that do that. no need for it!"}, {"review_sentiment": 5.0, "review_text": "Robert Greenfield's 'Exile on Main Street, A Season in Hell with The Rolling Stones' is a vivid and mesmerizing look into the harsh drug fueled atmosphere at Nellcote in 1972 where the Rolling Stones recorded their double album Exile on Main Street. Greenfield captures all the explicit and debauchery details of how under impossible conditions the Stones recorded each song and how they lived that Summer. A must read if you are a Stones fan."}, {"review_sentiment": 3.0, "review_text": "Okay if you want a load of stories about drugs and some about music. Full of cheezy quotes from other people's songs. I read all of it."}, {"review_sentiment": 5.0, "review_text": "Great book on possibly the Greatest Stones album of all time!"}, {"review_sentiment": 1.0, "review_text": "This a completely stupid book, that was thrown together to make money. The \"author\" interviews  the people involved with the making the album or who were part of the entourage at the time, 30 years later. The fact that they were on heroin at the time does not factor in the author deciding that their accounts are factual and truthful. Typical nonsensical fodder from a typical wanna be rock \"journalist\"."}, {"review_sentiment": 4.0, "review_text": "A fascinating story behind the making of one of the Rolling Stones' greatest albums.It's a wonder it ever got made."}, {"review_sentiment": 5.0, "review_text": "Great inside look at a band in tax exile and the clapper trap methods used to record a classic album."}, {"review_sentiment": 4.0, "review_text": "For as much that has been written about \"Exile\", I still found little nuggets in this book that, while not a revelation, were entertaining. Probably the most decadent record ever made in terms of what was going on behind the scenes. Or should I say, borderline criminal records ever made."}, {"review_sentiment": 1.0, "review_text": "The whole book is written in the present tense.  That's all you really need to know right there.  It's a pretentious gimmick that does nothing to further one's enjoyment of the material, but actually makes it harder to read.  There is hardly anything in the book about the making of the album \"Exile on Main Street,\" from which the book takes its title.  Misleading."}]}, "authors": ["Robert Greenfield"], "isbn": "030681563X", "longitude": 7.2683912, "periods": ["1900s"], "title": "Exile on Main Street: A Season in Hell with the Rolling Stones", "word_cloud": "little worn side nonetheless okay condition lot filler get lengthy bio person mention hate author need vivid mesmerize look harsh drug fuel atmosphere record double album capture explicit debauchery detail impossible condition record song lived fan want load story drug music cheesy quote people song possibly album time completely stupid together money author interview people involve make album part entourage time year later fact heroin time factor author decide account factual truthful typical nonsensical fodder typical wan rock journalist fascinating story make greatest wonder ever get make inside look band tax clapper trap method use record classic album much write still find little nugget revelation entertain decadent record ever make term go scene say borderline criminal record ever make whole write present tense really need right pretentious gimmick nothing enjoyment material actually make harder hardly anything make album take title mislead", "genres": ["Biography", "History", "Music", "Pop Culture"], "summary": "Recorded during the blazing hot summer of 1971 at Villa Nellcôte, Keith Richards's seaside mansion in southern France, Exile on Main Street has been hailed as one of the greatest rock records of all time. \r\n\r\nYet its improbable creation was difficult, torturous...and at times nothing short of dangerous. In self-imposed exile, the Stones-along with wives, girlfriends, and an unrivaled crew of hangers-on-spent their days smoking, snorting, and drinking whatever they could get their hands on, while at night, Villa Nellcôte's basement studio became the crucible in which creative strife, outsized egos, and all the usual byproducts of the Stones' legendary hedonistic excess fused into something potent, volatile, and enduring. \r\n\r\nHere, for the first time, is the season in hell that produced Exile on Main Street.", "asin": "030681563X", "rank": "660367", "city": "Nice", "image": "https://images-na.ssl-images-amazon.com/images/I/51C%2BgWmshuL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}