{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 30, "rating": 3.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I was unfamiliar with Matt Gross before picking this book up at the Dollar Tree. I loved it! While my traveling hasn't been as extensive as Matt's, I could really empathize with his chapters on loneliness while traveling and on coming home. I liked that he approached topics that most don't want to think or talk about when traveling (e.g. poverty, prostitution), but that you are most certainly going to face when traveling to other countries.I really enjoyed this book."}, {"review_sentiment": 2.0, "review_text": "I almost didn't read this book because of the fact my mother picked it up for me in a dollar store, and in the end I think it hit its price point. Gross is a good writer and structures the book in a clever way, but this was a tough slog.Being an ex-journalist and travel addict, I wanted to connect with people in his travels and learn something about the places he went. As other reviewers have mentioned, Gross fails in this respect. Instead we're subjected to the anxieties and psycho-babbling of a tourist (because aren't we all?) channeling his inner Woody Allen. Sure Gross can order (and likely even make) a cassoulet and drop the names of obscure place names around the globe, and the problem for me was there wasn't a STORY associated with it. The result is a self-serving disconnected journey through the life of Matt Gross, which frankly isn't that interesting. In his chapter about getting lost, he mentions he has never been lost in his life, which begs the question: How hard is he really trying?"}, {"review_sentiment": 3.0, "review_text": "It was alright. The more I read it, the less I liked the author. He sounds like a self-centered jerk who enjoys bizarre food. I thought it would be funny travel stories but they're more like themed essays and he uses lots of bits of stories in his essays so you never really get a lot of meat. The turk who loved apples? He was mentioned in the book for about two sentences and he didn't even speak English so the author never actually said a word to him. I'm pretty surprised they chose that as a title. It was an alright book, but I wouldn't read it again. His travel blog is probably more what I was looking for?"}, {"review_sentiment": 5.0, "review_text": "This book provides much food for thought.  World travelers have a whole new set of ethics to consider when foisting themselves on other cultures - in the name of what?  Exactly."}, {"review_sentiment": 3.0, "review_text": "Too dry and smug.  I don't enjoy his writing style.  Did not finish it.  Maybe sometime when I am desperate for something to read I will go back to it."}, {"review_sentiment": 5.0, "review_text": "Great travelogue book & an easy read."}, {"review_sentiment": 2.0, "review_text": "As a well-traveled author and blogger, I enjoyed the fact that a lot of his travels were not sugar-coated. Let's face it; travel is not always glamorous, exotic, or fun. However, it is always a lesson.I had hoped for more description of places, food, and unique characters along the way. To be completely honest, I was disappointed, slightly bored, and almost didn't finish. However, as an author myself, I wanted to see if he could connect with me. And, finally he did on the second to last page with, \"All I know is that I want to live somewhere I'll have to relearn everything: how to cross the street, how to order coffee....I want to figure it out all over again, to savor the small good moments...\"I believe that this quote highlights why I and others travel: to constantly learn, shift our perspective, and appreciate the small moments that sometimes are lost in a normal routine at home. I keep travel and adventure in my life as it is my form of meditation. I write about it in my books and blogs."}, {"review_sentiment": 5.0, "review_text": "Although it takes a while to get used to his sudden changes of place and time, this is a charming way to think about travel and his anecdotes about the people he encounters (including the said Turk) are wonderful and funny.  I love to travel and perhaps non-travelers will not find it as cool as I do, but it may incite non-travelers to take a chance on going out into the wider world."}, {"review_sentiment": 4.0, "review_text": "I was a big fan of the Frugal Traveler column by Matt Gross in the New York Times. Based on observations from a career based on travel, this book combines travelogue, humor column and keen insight into the world of travel. The book is really about the world of the travel writer.The book wanders at times and includes some brilliant observations about people, his family, foreign culture and places. These comments are both witty and, sometimes, sad. In the writing, Matt Gross touches on the traveler’s dilemma that we all face when we travel to strange new places.I have read some of the negative reviews on this site and I believe some of these comments are well noted. However, I believe Matt Gross has written a valuable book for us on the traveler’s lament.The Turk Who Loved Apples is both funny and sad in parts, but, Matt Gross writes about some of the truths for the traveler that all dedicated travelers can enjoy."}, {"review_sentiment": 1.0, "review_text": "Too much talk about bodily functions.  Kept reading in hopes it would become more interesting.  But I could only get through about a third of the book."}]}, "authors": ["Matt Gross"], "isbn": "030682115X", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "The Turk Who Loved Apples: And Other Tales of Losing My Way Around the World", "word_cloud": "unfamiliar pick travel extensive really chapter loneliness travel come home like approached topic want think talk travel poverty prostitution certainly go face travel really enjoy almost fact mother pick dollar store end think hit price point good writer structure clever tough travel addict want connect people travel learn something place go reviewer mention fails respect instead subject anxiety tourist channel inner order likely even cassoulet drop name obscure place name globe problem associate result disconnect journey life frankly interest chapter get lose mention never lose life begs question hard really try alright less like author sound jerk enjoy bizarre food think travel story theme essay use lot bit story essay never really lot apple mention sentence even speak english author never actually say word pretty surprised chose title alright travel blog probably look provide much food think traveler whole new set ethic consider foist culture name exactly dry smug enjoy write style sometime desperate something go back travelogue easy author blogger enjoy fact lot travel face travel always glamorous exotic fun however always hop description place food unique character completely disappoint slightly bore almost finish however author want see finally second last page know want live somewhere relearn everything cross street order coffee want figure savor small good moment believe quote highlight others travel constantly learn shift perspective appreciate small moment sometimes lose normal routine home keep travel adventure life form meditation write blog take get use sudden change place time charm think travel anecdote people encounter include say wonderful funny love travel perhaps cool chance go wider big fan column based observation career base travel combine travelogue humor column insight travel really travel wanders time include brilliant observation people family foreign culture place comment witty sometimes sad write touch traveler dilemma face travel strange new negative review site believe comment well note however believe write valuable traveler funny sad part write truth traveler dedicate traveler enjoy too much talk function reading hope interesting third", "genres": ["Memoir", "Travel Writing"], "summary": "While writing his celebrated Frugal Traveler column for the New York Times, Matt Gross began to feel hemmed in by its focus on what he thought of as “traveling on the cheap at all costs.” When his editor offered him the opportunity to do something less structured, the Getting Lost series was born, and Gross began a more immersive form of travel that allowed him to “lose his way all over the globe”—from developing-world megalopolises to venerable European capitals, from American sprawl to Asian archipelagos. \r\n\r\nAnd that's what the never-before-published material in The Turk Who Loved Apples is all about: breaking free of the constraints of modern travel and letting the place itself guide you. It's a variety of travel you'll love to experience vicariously through Matt Gross—and maybe even be inspired to try for yourself.\r\n\r\n\"The Turk Who Loved Apples is exactly the kind of travel book you should read while traveling. Filled with the moments of absurdity, sadness, madness, wisdom, beauty, realization, and Weltschmerz familiar to the chronic, lifelong traveler.\" Anthony BourdainVie", "asin": "030682115X", "rank": "547169", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51nJLx641ML.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}