{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 233, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "The novelish writing was a personal favorite. Copious quoted dialogue and vivid descriptions made the story jump off the page. And although at times Negi seemed a little dramatic, attributes of a great storyteller, overall this was a tremendously personable and enlightening memoir about a young girl growing up in Puerto Rico and moving to New York.."}, {"review_sentiment": 5.0, "review_text": "OMG!  Reminded me of my youth.  Loved it."}, {"review_sentiment": 5.0, "review_text": "Such a beautifully written, important book!"}, {"review_sentiment": 4.0, "review_text": "A vivid well told memoir and educational. It gave  me an inside glimpse into a life of a wonderful Puerto Rican writer. You don't have to be Puerto Rican to enjoy reading this."}, {"review_sentiment": 4.0, "review_text": "I read this for memoir style and form.  It was a very satisfying memoir and I liked that she was kind to all her characters."}, {"review_sentiment": 5.0, "review_text": "Truly an inspiring coming-of-age memoir about a Puerto Rican girl in an impoverished environment where parent-figures seek the American Dream, while constantly drinking and fighting along the way. I was captivated from start to finish, with Esmeralda's loss of childhood innocence--she even having to gaze upon a baby in a coffin--and how children were expected to take on adult responsibilities."}, {"review_sentiment": 5.0, "review_text": "It was a cool book, very nice. I only had to read it for my American history class, other wise I wouldn't have read it. But it is interesting"}, {"review_sentiment": 4.0, "review_text": "Great!!!"}, {"review_sentiment": 5.0, "review_text": "Classic book, esp of interest to young Puerto Rican females. Recommeneded"}, {"review_sentiment": 5.0, "review_text": "Worked great for my class"}]}, "authors": ["Esmeralda Santiago"], "isbn": "0306814528", "longitude": 0.0, "periods": ["1900s", "2000s"], "title": "When I Was Puerto Rican: A Memoir", "word_cloud": "novelist writing personal favorite quote dialogue vivid description make story jump page time seem little dramatic attribute great storyteller overall tremendously personable enlighten young girl grow move youth love such beautifully write important vivid well tell educational give inside glimpse life wonderful writer rican enjoy reading style form satisfy like kind character truly inspire girl impoverish environment seek american constantly drink fight way captivate start finish loss childhood innocence even gaze baby coffin child expect take adult responsibility cool nice american history class wise interest great classic esp interest young rican female recommend work great class", "genres": ["Memoir"], "summary": "Esmeralda Santiago's story begins in rural Puerto Rico, where her childhood was full of both tenderness and domestic strife, tropical sounds and sights as well as poverty. Growing up, she learned the proper way to eat a guava, the sound of tree frogs in the mango groves at night, the taste of the delectable sausage called morcilla, and the formula for ushering a dead baby's soul to heaven. \r\n\r\nAs she enters school we see the clash, both hilarious and fierce, of Puerto Rican and Yankee culture. When her mother, Mami, a force of nature, takes off to New York with her seven, soon to be eleven children, Esmeralda, the oldest, must learn new rules, a new language, and eventually take on a new identity. \r\n\r\nIn this first volume of her much-praised, bestselling trilogy, Santiago brilliantly recreates the idyllic landscape and tumultuous family life of her earliest years and her tremendous journey from the barrio to Brooklyn, from translating for her mother at the welfare office to high honors at Harvard.", "asin": "0306814528", "rank": "34094", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/513RJ2gFWdL.jpg", "country": "Puerto Rico", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}