{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 98, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "This book had interesting premises: a sister’s love for her brother, dying of AIDS and the plight of immigrants in Paris in the 1980’s. The poetry that Willow taught and her research into an obscure Indian poet was also part of the story. It had a lot of potential though it somehow fell a little flat as it was a bit difficult to connect completely with Willow’s character."}, {"review_sentiment": 1.0, "review_text": "It was OK. Would not really recommend it to my friends"}, {"review_sentiment": 3.0, "review_text": "I LOVE Paris but I struggled to connect with this story.At the beginning, I was sucked into the section about the main character's work with the immigrants at the detention centre. It was so promising!! I expected so much more with regards to the girls seeking asylum in France and the main character's relationship with these girls. That’s what I was really looking forward to.Then the story line about the main character's brother takes over.You get the impression that this is a case of two short stories that have been linked and that the author intended the immigrant story to be the main one but maybe changed her mind along the way, so that the story about her brother takes precedence. I was disappointed.But it's not a bad story.3.5 stars for this one."}, {"review_sentiment": 3.0, "review_text": "A story of an American women in Paris, a teacher of poetry, who tries to use it help save girls from other countries trying to gain citizenship. The story also includes a love interest, a family illness, and a trip to India for research to write a book.This story had good potential, but I do not feel that the main three parts of the story blended very well. First she's helping the girls for a large portion at the beginning of the book, which then ends suddenly. Then her trip to India comes and goes quickly, along with a miscarriage that is over and moved past before you knew it started, without any mention of it again. I also understand the connection of her and her father's love for maps by having a lot of streets names throughout the story, but it got tiring reading every street she turned down anytime she went anywhere. It became too much.I do like that it came full circle in the end, but feel this book would have been much better if it was blended a little more, and some things just left out."}, {"review_sentiment": 5.0, "review_text": "I feared this might be to oriented to female writers, but not so.  Conley has a great voice, provocative and easy.  Beautiful story."}, {"review_sentiment": 3.0, "review_text": "A little long winded but I liked how clipped and short the thoughts were and the transition from scene to scene went."}, {"review_sentiment": 4.0, "review_text": "I enjoyed all the discoveries of Paris.  I visited approx 5 years ago and could relate to some of the places as described....really loved the cityAnd marvelous stories, people,"}, {"review_sentiment": 4.0, "review_text": "Slow to start but worth the wait"}, {"review_sentiment": 4.0, "review_text": "Good reading. Not exceptionally exciting. Bettter than much of the mindless reading one finds."}, {"review_sentiment": 3.0, "review_text": "found it depressing"}]}, "authors": ["Susan Conley"], "isbn": "0307739872", "longitude": 2.3514992, "periods": ["2000s", "Recent Releases"], "title": "Paris Was the Place", "word_cloud": "interesting premise sister brother die plight immigrant poetry teach research obscure indian poet also part story lot potential somehow fell little flat bit difficult connect completely character really friend love struggle connect beginning suck section main character work immigrant detention center promise expect much regard girl seek asylum main character relationship girl really look forward story line main character brother take impression case short story link author intend immigrant story main maybe change mind way story brother take precedence bad star story american woman poetry try use help girl country try gain citizenship story also include love interest family illness trip research write story good potential feel main part story blend well help girl large portion begin end suddenly then trip come go quickly along miscarriage move past knew start mention also understand connection father love map lot street name story get tire read street turn anytime go anywhere become like come full circle end feel much better blend little thing leave fear orient female writer great voice provocative easy story little long wind like clip short thought transition scene scene go enjoy discovery visit year ago place describe loved city and marvelous story people slow start wait good reading not exceptionally excite much mindless read find find depressing", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "When Willie Pears arrives in Paris, she’s looking for adventure and to reconnect with her brother, Luke. Even so, when she takes a job teaching at a center for immigrant girls who are all hoping for French asylum, she does not expect to feel so connected to the ups and downs of their lives—or to find romance with their attractive and committed lawyer, Macon. \r\n\r\nBut as Willie learns the girls’ histories, the lines between teaching and mothering quickly begin to blur, leading her to make a risky move that will threaten to upend the life and relationships she’s found. ", "asin": "0307739872", "rank": "1707509", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51EIC4PtzCL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}