{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 113, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "Haven't read it yet, the print is so small, I had to get new glasses.  Just got the glasses yesterday so I will give it a try."}, {"review_sentiment": 4.0, "review_text": "Very interesting book."}, {"review_sentiment": 1.0, "review_text": "Love it! Very enlightening, fascinating look inside a Muslim family life and thought."}, {"review_sentiment": 4.0, "review_text": "A fascinating look at Muslim life in Cairo at the beginning of the 20th century.  The cloistered lives of the women seem almost like exaggerations at times;  they are expected to live their lives entirely inside the home and under cover.  In fact, a hidden life is seen as a privilege that is not provided to women of the lower classes.  Yet the women live in comfortable innocence, with great faith in god, and enormous, protective love for their families. The daily coffee hour, attended by all the family except the father, is full of teasing, love, news, and debate.  The lives of the women seem so good, so safe and happy, especially in contrast to the hypocritical, vice-ridden lives of the autocratic, adulterous, self-important adult men. (Yet even these men are depicted with compassion and understanding, so that one understands the roots of their hypocrisy and sees their humanity.) The one pure and honest man pays for his integrity -- in fact, the whole family pays.  And the young boy, emerging slowly from his childhood in this first book of the trilogy, appears to be the hope for the future."}, {"review_sentiment": 5.0, "review_text": "Remarkable story!"}, {"review_sentiment": 1.0, "review_text": "How did the word fiesta find it's way into a book about Arabs living I  Cairo?There were so many superfluous descriptions of inner thoughts that I could skip four to six pages and not lose the thread of the story."}, {"review_sentiment": 5.0, "review_text": "Magnificent!"}, {"review_sentiment": 4.0, "review_text": "Beautifully written, gently flowing story of a Muslim family in Cairo in the early part of the 1900's. Wonderful characterisation of all the family members from the despotic father who enjoyed the best of both worlds, his peace making but submissive wife Amina and his very different offspring.My favourite being Kamal with his quest for knowledge and his wide eyed innocence.Will hopefully get to the other two novels in the series very soon. A different way of life, a different culture but at heart the story of a family."}, {"review_sentiment": 5.0, "review_text": "My first encounter with Naguib Mahfouz and one that I have thoroughly enjoyed. In spite of the fact that Sayed Abd El Jawab is a hypocrite and extremely cruel at times, his character and the way that he interacts with the other characters is not forced at all. Although I would despise him as a real human being, I admire him as a book character and by that I mean the craftsmanship in the way that he was put together."}, {"review_sentiment": 4.0, "review_text": "Excellent translation.  Depicted the cultural and sociological world ofEgypt at the time.  The book needed alot of patience to read but welll worth the effort."}]}, "authors": ["Naguib Mahfouz"], "isbn": "0307947106", "longitude": 31.243666, "periods": ["1900s"], "title": "Palace Walk: The Cairo Trilogy, Volume 1", "word_cloud": "have yet print small get new glass get glass yesterday give try very interesting very enlighten fascinate look family life think fascinating look life begin century cloistered life woman seem almost exaggeration time expect live life entirely home cover fact hidden life see privilege provide woman lower class woman live comfortable innocence great faith god enormous protective love family daily coffee hour attend family full teasing news debate life woman seem good safe happy especially contrast hypocritical life autocratic adulterous adult men yet even men depict compassion understand understands root hypocrisy see humanity pure honest man pay integrity fact whole family pay young boy emerge slowly childhood first trilogy appear hope future remarkable story word fiesta find way living many superfluous description inner thought page lose thread story magnificent beautifully write gently flow story family early part characterization family member despotic father enjoy best world peace make submissive wife different favorite quest knowledge wide eye hopefully novel series soon different way life different culture heart story family first encounter thoroughly enjoy spite fact hypocrite extremely cruel time character way interact character force real human admire character mean craftsmanship way put together excellent translation cultural sociological world of egypt time need a lot patience well worth effort", "genres": ["Fiction & Literature"], "summary": "This is a sweeping and evocative portrait of both a family and a country struggling to move toward independence in a society that has resisted change for centuries. Set against the backdrop of Britain's occupation of Egypt immediately after World War I, Palace Walk introduces us to the Al Jawad family.\r\n\r\nAhmad, a middle-class shopkeeper runs his household strictly according to the Qur'an while at night he explores the pleasures of Cairo. A tyrant at home, Ahmad forces his gentle, oppressed wife and two daughters to live cloistered lives behind the house's latticed windows, while his three very different sons live in fear of his harsh will.", "asin": "0307947106", "rank": "110520", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/511OLM%2Bx-0L.jpg", "country": "Egypt", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}