{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 124, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "This was a dark story about a wealthy man who runs a private school in Vietnam during the war. It is very well written, but be warned that there are several disturbing scenes of war atrocities. The book shows how violent and difficult this period of time was in Vietnam. The only reason I didn't give it five stars is I don't generally like violent, war stories. I didn't realize how much of that would feature in the book when I bought it. Other than that it was a great read."}, {"review_sentiment": 4.0, "review_text": "Interesting, atmospheric, and well written."}, {"review_sentiment": 4.0, "review_text": "The mood described in the book in Vietnam during the War is rather interesting. Its how people view each other in times of war and outside of it. I found the Headmaster to be a very complex character by himself, choosing to ignore and live out his life looking down on others until he is hit home with a few truths. Its good for a one-time read."}, {"review_sentiment": 5.0, "review_text": "One of the best books I have ever read, once you get started.  I think that \"All the Light We Cannot See\" is slightly better,I was intrigued by  the food descriptions and the stress with the American presence in Vietnam was well described,  The fates of the  characters was unpredictable and  it was a good read, IF you stuck with it"}, {"review_sentiment": 5.0, "review_text": "very good historical novel centering on an area of the world with which  I was unfamiliar with  customs very different than ours.  suspenseful and intriquing."}, {"review_sentiment": 5.0, "review_text": "A wonderful story of Vietnam's history from a Vietnamese-Chinese perspective."}, {"review_sentiment": 5.0, "review_text": "I loved this book. Told from the perspective of a Chinese man living in Vietnam both before during and after the Vietnam war. Beautifully portrayed  and gives insight into a recent period of history from an unusual perspective."}, {"review_sentiment": 4.0, "review_text": "I couldn't put it down!  I would recommend this book for book clubs, plenty to discuss, and for anyone who enjoys family stories  or books set against a background of tumultuous historical events.  The main character is more than a tad irritating at times, but he feels real, and his decisions drive the story.  (I knocked off one star because some of those decisions seemed a bit unlikely.) The book was also culturally very interesting for me, knowing as I do, very little about Vietnam, or the Chinese people who have moved there over the years.  Enjoyed it!"}, {"review_sentiment": 4.0, "review_text": "Enjoyed the story and the period and became attached to the characters.  I guess the sign of a good book is you don't want it to end and that was the case with this book.  There definitely could be a sequel the way it ended."}, {"review_sentiment": 4.0, "review_text": "I ordered this book because the title sounded interesting. It's not my usual read, but it was a good choice.I grew up during the Vietnam was era, and lived through the horrors of my friends getting shipped over to a war we all knew we couldn't win. But this book tells the story from the Vietnam and Asian perspective.The characters are fictional, but I'm sure the events are based on fact. It opened my eyes to the horror that the Vietnamese, and Chinese were subjected to. It is a troubling account to read."}]}, "authors": ["Vincent Lam"], "isbn": "0307986462", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "The Headmaster's Wager", "word_cloud": "dark story wealthy man run private school war well write warn several disturb scene war atrocities show violent difficult period time reason give star generally like violent war story realize much buy other great interest atmospheric well write mood describe rather interest people view time war find complex character choose ignore live life look others hit home good best ever get start think slightly better intrigue food description stress american presence well describe fate character unpredictable good stuck good historical center area world unfamiliar custom different suspenseful intriguing wonderful story history perspective love perspective man live war portray give insight recent period history unusual perspective club plenty discuss anyone enjoy family story set background tumultuous historical event main character tad irritate time feel real decision drive story knock star decision seem bit unlikely also culturally interest know little people move year story period become attached character guess sign good want end case definitely way end order title sound interest usual good grow era live horror friend get shipped war know tell story character fictional sure event base fact open eye horror vietnamese subject trouble account", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A superbly crafted, highly suspenseful, and deeply affecting debut novel about one man’s loyalty to his country, his family and his heritage\r\n\r\nPercival Chen is the headmaster of the most respected English academy in 1960s Saigon, and he is well accustomed to bribing a forever-changing list of government officials in order to maintain the elite status of his school. Fiercely proud of his Chinese heritage, he is quick to spot the business opportunities rife in a divided country, though he also harbors a weakness for gambling haunts and the women who frequent them. He devotedly ignores all news of the fighting that swirls around him, but when his only son gets in trouble with the Vietnamese authorities, Percival faces the limits of his connections and wealth and is forced to send him away.\r\n\r\nIn the loneliness that follows, Percival finds solace in Jacqueline, a beautiful woman of mixed French and Vietnamese heritage whom he is able to confide in. But Percival's new-found happiness is precarious, and as the complexities of war encroach further into his world, he must confront the tragedy of all he has refused to see.\r\n\r\nGraced with intriguingly flawed but wonderfully human characters moving through a richly drawn historical landscape, The Headmaster's Wager is an unforgettable story of love, betrayal and sacrifice.\r\n\r\n“[A] sumptuously plotted first novel... Lam goes for the jugular, combining an operatic love story…with evocations of Vietnam’s occupation by the Japanese and the later horrors of the Vietcong’s persecution of the city of Hue… His most provocative character is the shadowy Teacher Mak, Chen’s longtime aide-de-camp, whose shifting masks of comrade and adversary potently embody the intricate survival tactics required of aliens afloat in a country of fractured allegiances.” New York Times", "asin": "0307986462", "rank": "1869768", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51%2B7jCcWuCL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}