{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 56, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Gift"}, {"review_sentiment": 5.0, "review_text": "I found this book fascinating.  And Peter Ackroyd's writing is excellent as usual."}, {"review_sentiment": 5.0, "review_text": "I am a new big fan of Peter Ackroyd"}, {"review_sentiment": 5.0, "review_text": "The information in this book was clearly used by Neil Gaiman to write \"Neverwhere\". Reading this book makes reading his book much more fun & interesting!"}, {"review_sentiment": 5.0, "review_text": "I’ve walked Fleet Street and Cannon Street in London. And Whitehall. I’ve taken the underground or tube more times than I can count. I’ve ridden buses down Charing Cross and up to Hampstead Heath. My knowledge of what was underneath my feet was, like most visitors and even many residents of London, was limited to the tube. Little did I know that I was walking over more than 2,000 years of buried history, secret tunnels, abandoned air raid shelters, closed tube stations, channeled rivers (several of them), old wells, and both formal and informal sewer systems.Peter Ackroyd, writer, biographer, and cultural historian, has set me straight in ”London Under.” It’s a fascinating, readable account of what lies under the streets, sidewalks, and buildings of one of the world’s great cities. It’s also made me aware of the outlines of abandoned tube stations, unobtrusive doors that lead downward, and the possible implications of what we mean when we say “underground.”And what’s under London has shaped what’s on the surface. Streets often follow paved-over and channeled rivers (which explains a lot of strange twists and turns in the City of London, that square mile that is the city’s origin and financial district). Bus rides to and from Hampstead Heath on the surface are simultaneously boat rides down various rivers.London’s history generally goes down about 26 feet. Ackroyd notes that one perhaps one of the few benefits of the German air blitz of London in 1940 and 1941 was the uncovering of a considerable portion of the city’s Roman history. All Hallows by-the-Tower Church was hit by a bomb and fire bombs, and the floor of a Roman residence was discovered. (Much later, excavations under the Guildhall uncovered the site of a Roman amphitheater.) Above the Roman layer is the Anglo-Saxon layer, topped by the medieval, Tudor and more modern layers.Ackroyd looks at how London has channeled and enclosed its rivers; how underground London came to be associated with the criminal underworld; the history of London’s sewers (at one time synonymous with its rivers and streets); the construction of the underground rail system; the tunnels built for various reasons (including a tunnel which stretches from Trafalgar Square down Whitehall almost all the way to Parliament); and the use of the tube system and its stations during both world wars as air raid shelters.For all of the iconic scenes in World War II movies showing people taking shelter in tube stations during the blitz, what Ackroyd points out was that it was a practice forced on the government by the citizens. At first, the Ministry of Transport forbade people using the stations as shelters, which the people obligingly ignored.“London Under” is filled with unknown facts and well-researched insights, but it is more than a collection of trivia. Ackroyd is too good a writer simply to publish a trivia collection. Instead, he plumbs the terrain that is beneath London’s streets and buildings with a practiced and experienced eye, and sees through the darkness this great city is built upon."}, {"review_sentiment": 5.0, "review_text": "What an interesting book! Who knew there were rivers flowing alongsideancient Roman wells and walls deep underneath the city of London? Oldsubway tubes, closed off in dust were brought back to life as places ofprotection during both world wars. All of London underground, up toNinety feet in some places, is inter-leaved by ancient and evensomewhat recent caverns and tunnels. This book explains the answers toWhy? Where? and When? I recommend this for anyone who loves mysteryand history."}, {"review_sentiment": 5.0, "review_text": "Fascinating. Full of little known facts. I will never hike to Harrods again without wondering what lies below my feet."}, {"review_sentiment": 4.0, "review_text": "It has some really cool information in it, but it reads like a history book."}, {"review_sentiment": 3.0, "review_text": "Not what I hoped for."}, {"review_sentiment": 5.0, "review_text": "Reading now."}]}, "authors": ["Peter Ackroyd"], "isbn": "0307473783", "longitude": -0.12574, "periods": ["1800s", "1900s", "2000s", "Recent Releases"], "title": "London Under: The Secret History Beneath the Streets", "word_cloud": "gift find fascinate write excellent usual new big fan information clearly use make read much fun interest walk take underground tube time count ride bus knowledge underneath foot visitor even many resident limit tube know walk year bury tunnel abandon air raid shelter close tube station channel river several old well formal informal sewer writer biographer cultural historian set straight fascinate readable account lie sidewalk building world great city also make aware outline abandon tube station unobtrusive door lead downward possible implication mean say shape surface often follow channeled river explain lot strange twist turn square mile city origin financial district rid surface simultaneously boat ride various generally go foot note perhaps benefit german air uncover considerable portion city hit bomb fire bomb floor residence discover much later excavation uncover site amphitheater layer layer top medieval modern look channel enclosed river underground come associate criminal underworld sewers time synonymous river construction rail system tunnel build various reason include tunnel stretch almost way use tube system station world war air raid iconic scene movie show people take shelter tube station blitz point practice force government citizen first forbid people use station shelter people obligingly fill unknown fact insight collection good writer simply publish trivia collection instead plumb terrain building practice experienced eye see darkness great city build interesting know river flow alongside ancient well wall deep underneath city tube close dust bring life place of protection world war underground to ninety foot place ancient even somewhat recent cavern tunnel explain answer to why recommend anyone love mystery and fascinate little known fact never hike harrod wonder lie foot really cool information read not hop read", "genres": ["History", "Urbanism"], "summary": "From the author of the bestselling London: The Biography, a poetic and powerful urban history of life and legend beneath London. \r\n\r\nThis is a wonderful, atmospheric, historical, imaginative, oozing little study of verything that goes on under London, from original springs and streams and Roman amphitheatres to Victorian sewers and gang hide-outs. The depth below is hot, much warmer than the surface and this book tunnels down through the geological layers, meeting the creatures that dwell in darkness, real and fictional -- rats and eels, monsters and ghosts. \r\n\r\nThere is a bronze-age trackway under the Isle of Dogs, Wren found Anglo-Saxon graves under St Paul's, and the monastery of Whitefriars lies beneath Fleet Street. In Kensal Green cemetery there was a hydraulic device to lower bodies into the catacombs below -- \"Welcome to the lower depths\". A door in the plinth of statue of Boadicea on Westminster Bridge leads to a huge tunnel, packed with cables -- gas, water, telephone. When the Metropolitan Line was opened in 1864 the guards asked for permission to grow beards to protect themselves against the sulphurous fumes, and called their engines by the names of tyrants -- Czar, Kaiser, Mogul -- and even Pluto, god of the underworld.\r\n\r\nGoing under London is to penetrate history, to enter a hidden world. \"The vastness of the space, a second earth,\" writes Peter Ackroyd, \"elicits sensations of wonder and of terror. It partakes of myth and dream in equal measure.\"", "asin": "0307473783", "rank": "354706", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/61nw7F1M9LL.jpg", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}