{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 58, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "I thought this was a really weird book.  I was looking for a book about New Orleans, and, of course, this didn't fill the bill, but it was odd in a lot of ways.  Why Sam, the main character, would have been responsible for the kidnapping of a child from the department store where he worked was a mystery to me.  And, why he continued to behave as though the family of the girl was more important to me than his own family was also odd.  Well, enough said.  Weird book."}, {"review_sentiment": 5.0, "review_text": "Excellent writing, never a dull moment (or reason to stop reading). You can feel the heat of the Louisiana country and the real emotions of a man drawn to \"make things right\" for the things he caused, and the things he was forced to endure.It's not a fairytale where everything goes perfectly; yet I came away with hope and encouragement.Looking forward to reading another book by Tim Gautreaux."}, {"review_sentiment": 4.0, "review_text": "I really like this author's writing style. His use of vocabulary, pacing and atmosphere is fantastic. The only reason I didn't give this 5 stars is because this particular book has a plot line that goes all over the place. Between flashbacks, the main character's motives, his movements back and forth, etc., it was hard for me to continue my involvement with the story. I'd still recommend this book."}, {"review_sentiment": 4.0, "review_text": "Loved it."}, {"review_sentiment": 3.0, "review_text": "The good: showed life in the Deep South.The bad: characters not developed enough.Entertaining though not a book I'd recommend."}, {"review_sentiment": 5.0, "review_text": "I love everything I've read by this author.  He has a great gift for creating memorable characters.  His description of life on the Mississippi and what it was like in the day of the riverboats is fascinating.  I had never thought about how dirty and polluted it must have been back then, when people dumped any and every thing into the waters.  Life itself was dirty and hard, and no one had ever heard of pollution or conservation.  When Tim Gautreaux writes, he puts you there - you see, smell, taste, hear and feel the story as it unfolds."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed the flow of the story as well as the plot.  Mr. Gautreaux mixes heightened tension from the plot with vivid accounts of everyday routines which gives a more rounded mental picture of the lives of his characters."}, {"review_sentiment": 5.0, "review_text": "Excellent story taking place in the south just after the turn of the century. A young girl goes missing on the lead character's watch as a floor walker in a department store, for which he gets fired.  The rest of the story is his search for the girl and in the process explores his own life. I've read 2 of Tim Gautreaux other books and like the others, he does an excellent job on incorporating his knowledge of Louisiana history and geography into an engaging story. The Missing had good historical references,  the plot was engaging and an overall entertaining read.  I highly recommend this book."}, {"review_sentiment": 5.0, "review_text": "If you are just a casual reader, I would tell you that this is a gripping detective story without a detective, or a story about the grittier side of steamboat life and the townfolk along the Mississippi, or it's the story of a kidnapping and related murders that could have been ripped from newspaper headlines.  If you are an avid reader, I would describe this as a sweet-yet-violent, character-driven story, a polished, engrossing tale of the South.  In post-WWI New Orleans, Sam holds himself responsible for not preventing the kidnapping of a 3-year old girl.  His search for the girl and her kidnappers turns up links to murders of his own family 26 years before.  But The Missing is not just about one kidnapping; like a Greek chorus, other characters all tell about the hurt of losing family under untimely circumstances.  This is a magnificent, many-layered novel, compellingly readable.  Everyone I have ever recommended it to has loved it."}, {"review_sentiment": 5.0, "review_text": "Really well written, unusual and interesting plot progression, good people dealing with bad in uncommon settings."}]}, "authors": ["Tim Gautreaux"], "isbn": "0307454681", "longitude": -90.0701156, "periods": ["1900s", "Recent Releases"], "title": "The Missing", "word_cloud": "think really weird look course fill bill odd lot way main character responsible kidnap child department store work mystery continued behave family girl important family also odd well enough say excellent write never dull moment reason reading feel heat country real emotion man draw make thing right thing cause thing force fairy tale everything go perfectly yet come away hope forward read really author write style use vocabulary pacing atmosphere fantastic reason give star particular plot line go place flashback main character motif movement back forth hard continue involvement story still recommend love good show life bad character develop recommend love everything author great gift create memorable character description life day riverboats fascinate never think dirty pollute people dump thing water dirty hard ever hear pollution conservation write put see smell taste hear feel story unfolds really enjoy flow story well plot mix heighten tension plot vivid account everyday routine give rounded mental picture live character excellent story take place south turn century young girl go lead character watch floor walker department store get fire rest story search girl process explore life tim others excellent job incorporate knowledge history geography engage story good historical reference plot engage overall entertain highly recommend casual grip detective story detective story grittier side steamboat life townsfolk story kidnapping related murder newspaper headline avid story polish engross tale hold responsible prevent kidnap old girl search girl kidnapper turn link murder family year kidnapping chorus character tell hurt lose family untimely circumstance magnificent compellingly readable everyone ever recommend love really well write unusual interesting plot progression good people deal bad uncommon setting", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A masterful novel set in 1920s Louisiana, The Missing is the story of Sam Simoneaux, a floorwalker at a New Orleans department store. When a little girl is kidnapped on Sam’s watch he is haunted by guilt, grief, and ghosts from his own troubled past. Determined to find her, Sam sets out on a journey through a world of music and violence, where riverboats teem with drinking and dancing, and where dark swamplands conceal those who choose to live by their own laws. With the fate of the stolen child looming, The Missing vividly depicts an America lurching away from war, where civilization is only beginning to penetrate the hinterlands, and a man must choose between compassion and vengeance.", "asin": "0307454681", "rank": "746010", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51MKdDbJHaL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}