{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 139, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Loved this book, I will follow up reading on slave uprisings in the US and Caribbean, lost of interesting history. I loved the different perspectives shown, from slvaes, criollos, and spaniards."}, {"review_sentiment": 5.0, "review_text": "it was a gift"}, {"review_sentiment": 5.0, "review_text": "The moment I started reading this book, I couldn't put it down. I read it in the middle of the nights when I woke up several times throughout, in the mornings, on my breaks at work. I felt as if I could see and understand  the lives of my family that I have traced back to the early 1,800\"s in Old San Juan. My family members were too from Spain, in the military, slave owners and born from slaves as well. I learned so much about the history of my people. Thankful to Ms.Santiago for bringing it to life for me. And thankful to my cousin Ron for finding me and filling in the missing gaps of our family tree."}, {"review_sentiment": 5.0, "review_text": "Whenever I read a book this good, it saddens me to have it end. History, romance,  strong character and determination, all set in beautiful Puerto Rico is the perfect mix. Thank you, what a great trip it has been. I can't wait to read it again to practice more spanish and see what I missed by being so hasty to find out what happens."}, {"review_sentiment": 4.0, "review_text": "I am in the Chicano book club, so therefore this book was chosen for the month.  This character, Ana,  reminds me of Scarlett O'hara from Gone with the Wind.  Both will do almost anything for their land.  A little slow at the beginning, but after about 40 pages the book takes off."}, {"review_sentiment": 4.0, "review_text": "Couldn't put it down. Characters stayed with me. A lot of Spanish I had to translate which is easy on kindle."}, {"review_sentiment": 4.0, "review_text": "I enjoyed the history of the island. The lives of the cane workers was very interesting. Life was very difficult.  The family history and life style was well described."}, {"review_sentiment": 1.0, "review_text": "Didn't finish it--disgusting."}, {"review_sentiment": 3.0, "review_text": "It was a good read. And there was an attempt to give some sense of the inner lives of the slaves."}, {"review_sentiment": 4.0, "review_text": "Good yarn."}]}, "authors": ["Esmeralda Santiago"], "isbn": "030738859X", "longitude": 0.0, "periods": ["1500s"], "title": "Conquistadora", "word_cloud": "love follow read slave uprising lose interesting history love different perspective show slave criollo spaniard gift moment start read middle night wake several time morning break work felt understand life family trace back early family member military slave owner bear slave well learn much history people bring life thankful cousin find fill miss gap family tree good saddens end romance strong character determination set beautiful perfect mix great trip practice spanish see miss hasty find happens club therefore chosen month character remind almost anything land little slow beginning page take put stay lot spanish translate easy kindle enjoy history island life cane worker interesting difficult family history life style well describe disgusting good attempt give sense inner live slave good yarn", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "As a young girl growing up in Spain, Ana Larragoity Cubillas is powerfully drawn to Puerto Rico by the diaries of an ancestor who traveled there with Ponce de Leon. And in handsome twin brothers Ramon and Inocente—both in love with Ana—she finds a way to get there. \r\n\r\nMarrying Ramon at the age of eighteen, she travels across the ocean to Hacienda los Gemelos, a remote sugar plantation the brothers have inherited. But soon the Civil War erupts in the United States, and Ana finds her livelihood, and perhaps even her life, threatened by the very people on whose backs her wealth has been built: the hacienda’s slaves, whose richly drawn stories unfold alongside her own in this epic novel of love, discovery and adventure.  ", "asin": "030738859X", "rank": "888732", "city": "Puerto Rico", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZyeWoCQpL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}