{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 13.7542529, "ratings": {"num_ratings": 212, "rating": 3.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I like the whole series. This is either the 5th or 6th."}, {"review_sentiment": 5.0, "review_text": "Terrific fiction as always from John Burdett. This one travels from Thailand to deep in Cambodia and as always very surprising."}, {"review_sentiment": 5.0, "review_text": "An interesting series, well-written, enjoyable, etc."}, {"review_sentiment": 3.0, "review_text": "Interesting book, fast delivery, fair price.  Content was a little unrealistic."}, {"review_sentiment": 2.0, "review_text": "I would not recommend this book if you are looking for an old-fashioned detective novel. If you like to read about artificial intelligence gone wrong on an international level, this is the book for you. I much preferred the earlier books in the series that highlighted Sonchai's internal conflict between morality and reality."}, {"review_sentiment": 3.0, "review_text": "This is a great series but this particular chapter is really odd and even disappointing.  On one hand there are a number of interesting, novel and thought provoking ideas and on the other hand, there is a lot of over the top nonsense.  Similarly the plot has some interesting twists and turns and then just meanders off into meh at the end. Perhaps there is a point to this style of story telling but it comes across as poorly edited, rushed and not well executed.  Love the central characters and the setting but this is the least satisfying of the Sonchai series to date."}, {"review_sentiment": 5.0, "review_text": "If you have not read his novels before this. You should start at the beginning to truly understand Sonchai's spiritual world. These novels are exotic, complex and I canever put them down once I start.  A wonderful character in an edge of your seat exciting book."}, {"review_sentiment": 5.0, "review_text": "This is one of my fav series ever.  Interesting to learn about Thai customs and beliefs and a great character in Sonjai Jittlecheep.  This particular novel seems to have more than one voice.  It's odd, I don't know much about writing or authors but this seemed to have been written at least in part by someone else, or maybe writers evolve like everything else.  Regardless, this is a good read and I thoroughly enjoyed this as well as the other books in the series."}, {"review_sentiment": 1.0, "review_text": "The book was depraved and like a dirty book. Very disappointing. I wanted to enjoy Southeast Asia culture and history and this was too much sex and drugs."}, {"review_sentiment": 4.0, "review_text": "I absolutely love this series of books by John Burdett, this latest novel is no exception. For anyone intrigued by Thailand and the waythat it operates, combined with various mysteries, this is a must read series.Happily, this latest ends up in the air, so I know that I will have another to enjoy in the future."}]}, "authors": ["John Burdett"], "isbn": "0307474305", "longitude": 100.493087, "periods": ["2000s", "Recent Releases"], "title": "The Bangkok Asset: A Royal Thai Detective Novel", "word_cloud": "like whole series fiction always travel deep always surprise interesting series enjoyable etc interest fast delivery fair price little unrealistic look artificial intelligence go wrong international level much prefer earlier series highlight internal conflict morality reality great series particular chapter really odd even disappoint hand number interesting thought provoke idea hand lot top nonsense plot interest twist turn meander meh end perhaps point style story tell come poorly edit rush well execute central character set least satisfy series date novel start begin truly understand spiritual world novel exotic complex ca never put start wonderful character edge seat excite fab series ever learn custom belief great character particular seem voice odd know much write author seem write least part someone else maybe writer evolve everything else regardless good thoroughly enjoy well series deprave dirty disappointing want enjoy culture history much sex drug absolutely love series latest exception anyone intrigue operate combine various mystery latest end air know enjoy future", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Sonchai Jitpleecheep—the brash and beguiling Royal Thai Police Force detective who has been our guide through John Burdett’s five previous acclaimed Bangkok novels—is back. The former monk and devout Buddhist, forever battling to protect his karma from the assaults of morally compromising cases, is now faced with the most horrifying technological innovation to make its way to the streets of Bangkok, and a conspiracy of almost unfathomable reach. \r\n\r\nWith Sonchai on this case is the young female inspector Krom. Like Sonchai, she’s an outsider on the police force, but unlike him, she is socially savvy and a technological prodigy. When they’re called to a demonstration—in the midst of a typhoon—of the deadly, superhuman strength of an American man who is seemingly controlled by a CIA operative, they have no idea what they’re actually witnessing or why. Their reliably obtuse and unequivocally crooked boss, Colonel Vikorn, explains some of it, but the most telling questions remain unanswered: Could the Americans have figured out a way to create a physically and psychologically enhanced supersoldier? Are they testing him—or it—on Thai soil? And why is everyone, from the Bangkok police to the international community, so eager to turn a blind eye? \r\n\r\nSearching for the answers to these questions, Sonchai and Krom find themselves in a remote Cambodian jungle compound for aging American ex-soldiers, where they will discover just how far a government will go to protect its worst secrets—both past and present. But the case will also have much more personal repercussions for Sonchai, shaking his world to its very foundation and perhaps finally forcing him to confront his long-lost American father.\r\n\r\n“Burdett’s fever-dream mysteries, set in Bangkok, recast the police procedural as psychedelic peep show. . . . written with such louche authority that, by the end, one cheers the seemingly infinite multiplicity of Burdett’s universe.” The New Yorker", "asin": "0307474305", "rank": "65748", "city": "Bangkok", "image": "https://images-na.ssl-images-amazon.com/images/I/61E9XkPo9WL.jpg", "country": "Thailand", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}