{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 43.6044622, "ratings": {"num_ratings": 579, "rating": 4.3, "reviews": [{"review_sentiment": 1.0, "review_text": "Just couldn't get into the story."}, {"review_sentiment": 4.0, "review_text": "This book was an enjoyable quick read as I learned about French history during WW2 and about life in a small village.  The characters were built out well and I look forward to reading the next in the series."}, {"review_sentiment": 1.0, "review_text": "Very slow paced. Could not get past 50 pages."}, {"review_sentiment": 5.0, "review_text": "Bruno is a hell of a guy, wish all policemen were like him and is was lovely to read about an area I have been to several times. Most satisfying."}, {"review_sentiment": 5.0, "review_text": "Always enjoy Martin Walkers books about ‘Bruno, Chief of Police’.  Can’t wait til the next one!."}, {"review_sentiment": 5.0, "review_text": "Nice writing style, good characters. I learned a piece of Viche French history I didn't know. I'm looking forward to the next book."}, {"review_sentiment": 5.0, "review_text": "Good product, fast delivery."}, {"review_sentiment": 3.0, "review_text": "Though the outcome was interesting, the main character's flaws as a lawman are not acceptable.  It is difficult to appreciate a lawman, who, due to his allegance to a town, warns a suspect that law men have staked out a location and the time is not right to commit a crime."}, {"review_sentiment": 5.0, "review_text": "This is a wonderful well written story. I especially liked the authors character development of Bruno,the one and only local police officer, and his relationship with his friend the mayor of st Denis.  Bruno,s familiarity with local families and their history was a huge asset in aiding his investgative skills.  Both Bruno and the mayor had strong emotional ties to the residents and the area.  They were not going to let some Parisian bureaucrat decide what was best for st Denis.  Go Bruno!"}, {"review_sentiment": 5.0, "review_text": "Very well written. No blood and guts. Just a Easy Book To Read. Already Reading Book #2."}]}, "authors": ["Martin Walker"], "isbn": "030745469X", "longitude": 1.4442469, "periods": ["2000s", "Recent Releases"], "title": "Bruno, Chief of Police", "word_cloud": "just story enjoyable quick learn french history life small village character build well look forward read next series very slow paced past page hell guy wish policeman lovely area several time most satisfying always enjoy wait til next one nice write style good character learn piece history know look forward next good product fast delivery outcome interesting main character flaw lawman acceptable difficult appreciate lawman due allegiance town warn suspect law men stake location time right commit crime wonderful well write story especially like author character development local officer relationship friend mayor st familiarity local family history huge asset aid investigative skill mayor strong emotional tie resident area go parisian bureaucrat decide best st very well write blood gut", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "The first installment in the delightful, internationally acclaimed series featuring Chief of Police Bruno.\r\n\r\nMeet Benoît Courrèges, aka Bruno, a policeman in a small village in the South of France.  He’s a former soldier who has embraced the pleasures and slow rhythms of country life. He has a gun but never wears it; he has the power to arrest but never uses it.  But then the murder of an elderly North African who fought in the French army changes all that.  Now Bruno must balance his beloved routines—living in his restored shepherd’s cottage, shopping at the local market, drinking wine, strolling the countryside—with a politically delicate investigation.  He’s paired with a young policewoman from Paris and the two suspect anti-immigrant militants.  As they learn more about the dead man’s past, Bruno’s suspicions turn toward a more complex motive.\r\n\r\n“Bruno is a delightful character and Walker’s handling of long-held grudges is intelligent and sympathetic.” The Guardian ", "asin": "030745469X", "rank": "14382", "city": "Toulouse", "image": "https://images-na.ssl-images-amazon.com/images/I/517h2dc6R7L.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}