{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": -12.9822499, "ratings": {"num_ratings": 42, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Gift for a friend. She loved so much she rationed the last part of rhe book so it would take her many days to read it. Would give it 6 stars ifnpossible!"}, {"review_sentiment": 5.0, "review_text": "Well written and delightful!"}, {"review_sentiment": 5.0, "review_text": "I love this book and continue to be stunned by how much great literature is not yet in kindle format."}, {"review_sentiment": 4.0, "review_text": "I started reading Jorge Amado novels about fifty years ago.  Though I think I liked them better when I first found them, and when I was a lot younger, they still pack a wallop.  Full of humor, sly digs at social norms, politicians, and hypocrisy, they are nothing if not sexy.  Not only that but they constantly reveal in most colorful terms the society of the Brazilian city of Salvador de Bahia full of its Afro-Portuguese culture, the mysteries of the African religion called candomblé, and a spicy cuisine second to none.  Is this picture totally accurate?  Does it really matter?  Perhaps it is a fantasy Brazil, but it is a nice place to dwell while you read the adventures of various picaresque characters and sensuous women.  Is this novel \"politically correct\"?  Definitely not, but if that's what you are looking for, give Jorge Amado a miss.  He doesn't give a damn, but plows full speed ahead, but unlike Donald Trump, he's always kind.This novel, which I think could have been cut because the author repeats himself quite a bit, tells the fanciful story of a rather demure young woman who marries a rake, a gambler, a vagabond who spends every penny he ever gets his fingers on in the back street casinos and whorehouses of Bahia.  They live a crazy life for seven years, he betraying her at every step.  She suffers but loves him anyway.  She sets up a cooking school which enables her to survive.  Suddenly Vadinho, the gambler, drops dead in the middle of Carnival antics.  I'm not spoiling anything....that's on page 5 of this 518 page monster.  Then there's an interlude of sad times, of longing, and a parade of useless suitors.  At last Dona Flor, for that is her name, meets Dr. Teodoro, a bassoon-playing, pharmacist straight arrow.  They marry.  But Vadinho returns.  How and what happens is what you have to find out by reading this entertaining (if overly long) book.  If you stick with it, you'll get into some wacky magico-realism and a lot of other stuff.  Enjoy."}, {"review_sentiment": 1.0, "review_text": "Too hard to follow and a rather unlikely plot.  Did provide cultural insight into latin culture.  We used as a book club book and only one person out of 10 got past the first 40 pages.  And, these are avid readers.  Say no more."}, {"review_sentiment": 4.0, "review_text": "Good South American novel.  Most are hard to understand."}, {"review_sentiment": 5.0, "review_text": "A wonderful story - it's particularly evocative for me since I've spent some time in Salvador in my youth and I'm familiar with many of the general places described here and used in the film of the same name.  To a degree I suspect that it helps to be comfortable with both the Brazilian culture and Latin American literature in general but the story is timeless and so beautifully drawn that I think almost anyone can get to grips with it.  The book is of course a translation from the original Portuguese but it's very rare that you notice this - it's an easy read for a native English speaker."}, {"review_sentiment": 5.0, "review_text": "This is one of my all time favorite books.It's sexy, sultry, and funny all at the same time.I love the scene where she was teaching a cooking class and segues into a memory of her first husband eating with the palm oil on his lips. Perfect."}, {"review_sentiment": 5.0, "review_text": "Great books"}, {"review_sentiment": 5.0, "review_text": "Jorge Amado's story-telling ability is masterful. I love a book that I can insert myself into as an invisible observer. This is such one."}]}, "authors": ["Jorge Amado"], "isbn": "0307276643", "longitude": -38.4812772, "periods": ["1900s"], "title": "Dona Flor and Her Two Husbands", "word_cloud": "gift friend love much ration last part the many day star impossible well write delightful love continue stun much great literature yet kindle format start read novel fifty year think like better first find lot younger still wallop humor sly dig social norm politician hypocrisy nothing sexy not constantly colorful term society brazilian city full culture mystery religion call candomblé spicy cuisine second none be picture totally accurate really perhaps fantasy nice place dwell adventure various picaresque character sensuous woman be politically correct look give miss damn plow full speed ahead always think author repeat quite bite tell fanciful story rather demure young woman marries rake gambler vagabond spends penny ever get finger back street casino whorehouse live crazy life year betray step suffer love anyway set cook school enables survive suddenly gambler drop dead middle antic spoil anything page page monster then sad time long parade useless suitor last name meet pharmacist straight arrow marry return happen find read entertain overly long stick get wacky lot stuff too hard follow rather unlikely plot cultural insight latin culture use person get first page avid reader say good hard understand wonderful story particularly evocative spend time youth familiar many general place describe used film name suspect help comfortable brazilian culture latin american literature general story timeless beautifully draw think almost anyone get grip course translation original rare notice easy native speaker time favorite sexy sultry funny love scene teach cook class segue memory first husband eat palm oil lip great ability masterful love insert invisible one", "genres": ["Fiction & Literature"], "summary": "It surprises no one that the charming but wayward Vadinho dos Guimaraes–a gambler notorious for never winning—dies during Carnival. His long suffering widow Dona Flor devotes herself to her cooking school and her friends, who urge her to remarry. She is soon drawn to a kind pharmacist who is everything Vadinho was not, and is altogether happy to marry him. But after her wedding she finds herself dreaming about her first husband’s amorous attentions; and one evening Vadinho himself appears by her bed, as lusty as ever, to claim his marital rights.", "asin": "0307276643", "rank": "299486", "city": "Salvador", "image": "https://images-na.ssl-images-amazon.com/images/I/51Cbx7nX-SL.jpg", "country": "Brazil", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}