{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 20, "rating": 3.4, "reviews": [{"review_sentiment": 2.0, "review_text": "This book was referred to in another story (“The Terra-Cotta Dog” by Andrea Camilleri, trans. By Stephen Sartarelli, © 2002), when I saw a copy in a bookstore, I bought it. I was not really enjoying this story, so I put it away, and only just now came across it again.  I think I will just pass it on. A reporter goes to see some airplane daredevils that have come to perform in New Orleans.  He gets to know them, and is entranced with the female (go figure!).  He gets most of their history.  They perform, and one gets dead :( .About here is where I stopped reading. This book was written to fill the time and goose the author trying to finish “Absalom, Absalom!”"}, {"review_sentiment": 3.0, "review_text": "Having read most of Faulkner's major novels, I was anxious to give this--one of his less-read works--a try. One reviewer has described _Pylon_ as a novel for Faulkner completists, and let me begin by saying that I agree. You will not find the unforgettable characters or the devastating human drama of _The Sound and the Fury_ here. Neither is this an exploration of family, history or race, the topics one expects to see developed in Faulkner's work after reading _As I Lay Dying_, _Absalom, Absalom!_, and _Go Down, Moses_. I guess the best way to describe _Pylon_ is as a diversion in Faulkner's oeuvre. Is it his worst novel? I haven't read all of them, but the consensus is that that title goes to _A Fable_. I have read, however, _Requiem for a Nun_ and _Intruder in the Dust_, and I found both of these inferior to _Pylon_.One of the issues with _Pylon_ has to do with the year in which it appeared: 1935. Here we have a novel about unorthodox barnstormers, set in New Valois, Franciana (read, New Orleans, Louisiana), right between the two literary masterpieces that are _Light in August_ and _Absalom..._.The central figures of _Pylon_ are an unnamed reporter (who plays the part of observer), the pilot Roger Shumann, his wife Laverne, and her lover Jack Holmes. Laverne has a son, Jack, and part of the problem is that no one knows which of the two men is Jack's father. The setting is an air show, in which Roger hopes to win a big prize, and the reporter to write a decent piece of news.I personally have two main problems with _Pylon_. First, the style. It is definitely Faulkner, it is even the Faulkner of the great novels, and that is precisely the issue: the intricacy and grandiloquence that works perfectly in _Absalom..._ is simply inadequate in _Pylon_. (Please note, however, that the style of _Pylon_ is not nearly as baroque as that of _Absalom..._.) Secondly, while the novel does include human drama (\"the problems of the human heart in conflict with itself,\" the only thing worth writing about, as Faulkner said in his Nobel Prize acceptance speech), I feel that it is not sufficiently developed, and it surfaces only towards the end of the novel.Why, then, read _Pylon_? Why the three stars? Here are my three reasons:1. I found the novel to be not merely readable, but also engaging. I would not say the characters are memorable, but I was interested in them, and wanted to know whether they would achieve some sort of balance and/or attain some type of glory by the end of the novel. I was also curious to see what I would find outside Yoknapatawpha.2. This is Faulkner writing about one of his passions: airplanes. His enthusiasm for the topic can be felt, even if many of his readers do not enjoy this enthusiasm.3. The human drama is present. It may not, as I said before, be as developed as it could have been, but it is definitely there. One cannot help but wish that Faulkner had spent more time revising _Pylon_, maybe altering the structure a bit so that what emerges rather abruptly at the end would have been developed gradually throughout. But then, as was said before, he was writing about a topic he was passionate about, and even geniuses get carried away._Pylon_ is emphatically not the place to begin with Faulkner (that would be _As I Lay Dying_ or _The Unvanquished_), but I encourage those familiar with his masterpieces to give this novel a chance. If you'd rather stay in Yoknapatawpha, though, I can't say I blame you.Thanks for reading, and enjoy the book!"}, {"review_sentiment": 5.0, "review_text": "The nameless reporter who is obsessed with the racing pilot Shumann & his wife Laverne is death. Every description of this gaunt reporter is an image of death. However, like the critics who comment on Pylon, the reporter himself doesn't know he is death. It is this identity that makes Pylon a great novel. Critics who miss this are in the wrong profession."}, {"review_sentiment": 3.0, "review_text": "There is nothing of Yoknapatawpha in this novel.  In a thinly disguised New Orleans (called New Valois in the novel), a newspaper reporter covering an airshow at the dedication of the new airport meets a stunt pilot/racer, his parachutist and mechanic, a woman who shares her bed with the pilot and jumper, and a young boy fathered by one of them and bearing the pilot’s name.  The reporter is fascinated by the clan, and infatuated with the woman.  Probably because of his lust for the woman, the reporter attempts to befriend the penniless group, allowing them to sleep in his apartment.  He and the mechanic, a disgusting man called Jiggs, proceed to get extremely drunk, an event which indirectly ultimately leads to the death of the pilot Shumann.  Of course, a lot happens along the way.Faulkner was working on <i>Absalom, Absalom!</i>when this book was written.  Whereas the characters in that wonderful book are consumed by the past and a sense of place, the characters in this one seem to have no past, and no concern for place.  They are like nomads or gypsies.  Faulkner has stated that he wrote this just to get relief from the trouble <i>Absalom</i> was causing him.  Perhaps that explains it."}, {"review_sentiment": 2.0, "review_text": "I wanted to like a book taking place in a fictional place meant to mirror New Orleans, my new home.  This was so boring though, and my book club at NOMA agrees."}, {"review_sentiment": 5.0, "review_text": "Early Faulkener, with a sparse story and some very blunt symbolism.  It seems to me, Faulkner has placed himself into the story in the way of Jiggs and the reporter, and what a loathsome reporter he seems, drooling at the debauchery of a three-way romance.  Faulkner writes a very long line in which he mentions the reporter as a shoe in a garbage pail.  So it's got some humor.  Although far from Faulkner's most human, complex or even complete narrative, this one shines!"}, {"review_sentiment": 5.0, "review_text": "A master like Faulkner needs no critique; only readers who appreciate his particular style. Those who don't can read something else. I think for those who love Faulkner, this is one of his best."}, {"review_sentiment": 3.0, "review_text": "Reading Faulkner is very much like walking through someone else's hallucinatory dream. Confusing at best, and, if you blink, you'll lose your place entirely. Pylon lies somewhere in the middle of Faulkner's extremes. It's more comprehensible than, say, Fable (though one has to wonder, is it possible to be *less* comprehensible than Fable?), but still a more difficult read than the likes of the Snopes trilogy. At the end of the book, what we're left with are a whole lot of words about some very simple (and sensationalized) events. Still, it gets a few extra points from me, simply because its barnstorming subject has a special place in my heart."}, {"review_sentiment": 2.0, "review_text": "Not sure why this book was written except to perhaps extend Faulkner's fantasy about being a qualified pilot.  Typical of the author is the use of too many adjectives and adverbs which distort the actual subject and leaves the reader wondering.Nice jacket though."}, {"review_sentiment": 4.0, "review_text": "PYLON is adrenalin-charged; moving at the speed of the work's live-fast die-young dare devil pilots and their machines. The motion like a whirlwind, however; circular, like the airplanes around and around the pylon (pole marking boundary of a race). Dizzying. The characters talk like they're on acid. The unnamed Reporter of the novel is a complete mystery: How to account for his Christ-like devotion to the pilots? A devotion that far exceeds Good Samaritanism. He gains nothing by association. He is an oddity--like Melville's Bartleby. Maybe he is Christ. Maybe the Holy Ghost. Who knows? It is baffling."}]}, "authors": ["William Faulkner"], "isbn": "0307946789", "longitude": -90.0701156, "periods": ["1900s"], "title": "Pylon", "word_cloud": "refer story trans saw copy bookstore buy really enjoy story put come think pass reporter go airplane daredevil come get know entranced female figure get history perform get dead stop read write fill time goose author try finish have major novel anxious give work reviewer described completists let say agree find unforgettable character devastate human drama exploration family history race topic expect see develop work reading guess best way describe diversion oeuvre be worst consensus title go however find inferior issue year appear here unorthodox barnstormer set right literary masterpiece central figure unnamed reporter play part pilot wife lover son part problem know men father set air show hop big prize reporter write decent piece personally main problem style definitely even great novel precisely issue intricacy grandiloquence work perfectly simply inadequate note however style nearly baroque secondly include human drama problem human heart conflict thing worth write say acceptance speech feel sufficiently develop surface towards end star here find merely readable also engage character memorable interested want know sort balance attain type glory end also curious see write passion airplanes enthusiasm topic felt even many reader enjoy human drama present say develop definitely help spent time revise maybe alter structure bit emerge rather abruptly end gradually say write topic passionate even geniuses carry emphatically place begin encourage familiar masterpiece give chance rather stay blame read enjoy nameless reporter obsess race pilot wife death description gaunt reporter image death however critic comment reporter know death identity make great miss wrong profession nothing yoknapatawpha thinly disguised call newspaper reporter cover airshow dedication new airport meet stunt parachutist mechanic woman share bed pilot jumper young boy father bearing pilot reporter fascinate clan infatuate woman lust woman reporter attempt befriend penniless group allow sleep apartment mechanic disgust man call proceed extremely drunk event indirectly ultimately lead death pilot course lot happen work write character wonderful consume sense place character seem past concern place like nomad gypsy state write relief trouble cause perhaps explains want take place fictional place mean mirror new home boring club agrees early sparse story blunt symbolism seem place story way reporter loathsome reporter seem drool debauchery romance write long line mention reporter shoe garbage pail get humor far human complex even complete narrative shine master need critique reader appreciate particular style something else think best read much walk someone else hallucinatory dream best blink lose place entirely lie somewhere middle extremes comprehensible say fable wonder possible comprehensible still difficult like trilogy end leave whole lot word simple sensationalized event still get extra point simply barnstorm subject special place heart not sure write perhaps fantasy qualify pilot author use many adjective adverbs actual subject leave jacket move speed work dare devil pilot machine motion whirlwind however circular airplane pole mark boundary race dizzy character talk acid unnamed complete mystery account devotion pilot devotion far exceed good samaritan ism gain nothing association know baffle", "genres": ["Fiction & Literature"], "summary": "One of the few of William Faulkner’s works to be set outside his fictional Yoknapatawpha County, Pylon, first published in 1935, takes place at an air show in a thinly disguised New Orleans named New Valois. \r\n\r\nAn unnamed reporter for a local newspaper tries to understand a very modern ménage a trois of flyers on the brainstorming circuit. These characters, Faulkner said, “were a fantastic and bizarre phenomenon on the face of the contemporary scene. . . . That is, there was really no place for them in the culture, in the economy, yet they were there, at that time, and everyone knew that they wouldn’t last very long, which they didn’t. . . . That they were outside the range of God, not only of respectability, of love, but of God too.” \r\n\r\nIn Pylon Faulkner set out to test their rootless modernity to see if there is any place in it for the old values of the human heart that are the central concerns of his best fiction", "asin": "0307946789", "rank": "471755", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/41dqgBHZNlL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}