{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 51.7520131, "ratings": {"num_ratings": 18, "rating": 3.7, "reviews": [{"review_sentiment": 3.0, "review_text": "I previously read “A Heart So White” by the same author and prefer that novel to “All Souls”.  They share a common style and some common themes.  I enjoy the style which involves long sentences and a fair amount of repetition.  The long sentences are not at all challenging to follow, and communicate an air of trying to get things correct, by elaboration, yet one of Marias’ themes is the difficultly of being accurate about anything, and not just due to the problems with memory, another theme.  The repetition sounds off putting, but in general is not – kind of like a refrain. While “All Souls” is a campus novel, its satire of the professors at Oxford is not funny, for the most part, nor insightful.  I do not find Marias particular insightful in general.  There is a lack of human warmth, even the love affair is depicted in a detached manner.  At the same time, there are many interesting conversations and ruminations, and the novel never bogs down."}, {"review_sentiment": 2.0, "review_text": "The Infatuations, Thus Bad Begins…Javier Marías is a wonderful writer - but I’m afraid I just couldn’t take to this novel at all. All Souls was first published in translation in 1992 and is the account (one could not quite say ‘story’) of a 30-year old Spanish lecturer’s two-year sojourn at Oxford University. With its yard-long paragraphs, maddening phantasmal characters and an elusive quality that one feels is not quite worth the effort, this is like the bastard love-child of Bolaño and Proust. With the virtues of neither."}, {"review_sentiment": 1.0, "review_text": "I chose this novel because I enjoy mysteries set in Oxford but gave up halfway through. Most of the narrative relates the protagonist's thoughts about events and people, sliced into minutia and presented in long, long paragraphs. Too tedious for me."}, {"review_sentiment": 5.0, "review_text": "One of the most compelling authors of the 21st century!"}, {"review_sentiment": 5.0, "review_text": "Wonderful."}, {"review_sentiment": 3.0, "review_text": "But not fulfiñling in any deep way. It makes life at Oxford seem essentially lifeless with petty dons whose lives are empty and lonely and who can't communicate on a real human level. It is a depressing book. Enen the affair the Spanish professor has seems dull. A way to pass the time, at least for the females, but the Spanish professor retains some passion, and indeed falls in love, but that's too messy for his beloved who is obsessed with her mother's suicide back in India when she was a child. This event connects in a fascinating way with the old books the professor collects as a pastime. The long paragraphs swallow the reader up in the hazy and lifeless world that Oxford seems to be in this novel. People die but it doesn't seem to matter much because essentially they were spiritually dead even when they were technically alive. They really seemed to have no purpose in life. Even their students seem like a major inconvenience. The book is neither the inferno nor the paradiso -- it's limbo. There is time, but no growth. Everyone is stuck in a relatively meaningless existence. The humor of of the high table professorial dinners is hilarious. All these academic luminaries prove to be little more than a pack of lust-driven, vicious, pedantic, small-minded fools. The narrator was lucky to get back to Madrid, but unfortunately seems to have been infected by some of the deathly attitudes he had been steeped in while at Oxford. I'm glad I read it but relieved to be done with it."}, {"review_sentiment": 4.0, "review_text": "While I liked this book, I preferred A Heart So White. I writing is beautiful and profound, yet the structure of the novel is meandering. There is no strong storyline so at times the book is slow. I am a huge fan of Marias and have enjoyed his other books more than All Souls which is highly touted. Perhaps someone who attended Oxford or Cambridge would enjoy this book more. I would read A Heart So White for a taste of Marias rather than All Souls. Still, any Marias is more rewarding than most of the other books out right now."}, {"review_sentiment": 3.0, "review_text": "Interesting Oxford setting and style with a lot of potential. Characters flat and not very interesting. Reminds me of a 50s pseudo-existential novel."}, {"review_sentiment": 5.0, "review_text": "THIS GUY CAN WRITE AND DEFINITELY MAKES YOU THINK! I DO NOT UNDERSTAND WITH WRITERS LIKE THIS HOW BOOKS LIKE DONNS TART'S LATEST CAN POSSIBLY GET THE BIG BOOK AWARDS FRANKLY ITS RIDICULOUS!"}, {"review_sentiment": 5.0, "review_text": "While Javier's prose is masterful (even through translation), the American reader must understand this a European novel, meaning it is not a John Grisham or James Patterson mystery or thriller.  Distinctive to Javier's prose are the long, narrative expositions that reveal internal character commentary, an analysis, really, of the particular human dilemma encountered by the narrator.  American's would call this a \"thinking\" piece, and this is why enjoy reading Javier Marias.  Extended, cumulative sentences meander through the jungle of human trials and tribulations."}]}, "authors": ["Javier Marias"], "isbn": "0307950778", "longitude": -1.2578499, "periods": ["1900s"], "title": "All Souls", "word_cloud": "previously author prefer share common style common theme enjoy style involve long sentence fair amount repetition long sentence challenge follow communicate air try thing correct elaboration yet theme difficultly accurate anything due problem memory theme repetition sound put general kind refrain campus satire professor funny part insightful find marisa particular insightful general lack human warmth even affair depict detached manner time many interesting conversation rumination never bog wonderful writer afraid take first publish translation account story old spanish lecturer sojourn paragraph madden phantasmal character elusive quality feel quite worth effort bastard virtue choose enjoy mystery set give halfway narrative relates protagonist thought event people slice minutia present long long paragraph tedious compelling author century wonderful fulfil deep way make life seem essentially lifeless petty don life empty lonely real human level depress affair professor seem way pas time least female spanish professor retain passion indeed fall love messy beloved obsessed mother suicide back child event connect fascinate way old professor collect pastime long paragraph swallow hazy lifeless world seem seem matter much essentially spiritually dead even technically alive really seem purpose life even student seem major inconvenience inferno paradise limbo time growth stick relatively meaningless existence humor high table professorial dinner hilarious academic luminary prove little pack vicious pedantic fool narrator lucky back unfortunately seem infected deathly attitude steep glad relieve do like prefer write beautiful profound yet structure meander strong story line time slow huge fan enjoy highly tout perhaps someone attend taste rather still reward right interest set style lot potential flat interesting reminds do prose masterful even translation american european meaning mystery thriller prose long narrative exposition reveal internal character commentary analysis really particular human dilemma encounter narrator think piece enjoy read cumulative sentence meander jungle human trial tribulation", "genres": ["Fiction & Literature"], "summary": "By one of the most important voices in contemporary world literature, a darkly comic novel about that most British of institutions, Oxford University.\r\n\r\nIn All Souls, a visiting Spanish lecturer, viewing Oxford through a prismatic detachment, is alternately amused, puzzled, delighted, and disgusted by its vagaries of human vanity. A bit lonely, not always able to see his charming but very married mistress, he casts about for activity; he barely has to teach. Yet so much goes into simply \"being\" at Oxford: friendship, opinion-mongering, one-upmanship, finicky exchanges of favors, gossip, adultery, book-collecting, back-patting, backstabbing. Marías demonstrates a sweet tooth for eccentricity in this sly campus novel and love story.", "asin": "0307950778", "rank": "761719", "city": "Oxford", "image": "https://images-na.ssl-images-amazon.com/images/I/51C-mLOWRML.jpg", "country": "United Kingdom", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}