{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 43.6044622, "ratings": {"num_ratings": 266, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Bruno, chief-of-police, has quickly become my favorite mystery solver-of-crimes!  Could also be called, Bruno, \"Chef-of-Police,\" as his meal preparations take up as much time as his pursuit of bad guys.  Make sure your arteries are flushed out after reading each book in the series, as there is enough butter and duck fat to kill a dinosaur in each meal."}, {"review_sentiment": 5.0, "review_text": "Loved the first one, but definitely felt as though I was getting an introduction to the Dordogne and and more specifically to Bruno.  Reading on and into the community  in this one is a delight-- there are some awkward moments and a few plot gaps, and some francophilia, but certain pages will be read aloud for their perfect capture of the moment.  The description that connections national identity of the Brits and the Irish to the style of rugby play delighted us all (until we got to the French bit I mentioned).  The food, the traditions, and the meting of justice all make for a good read."}, {"review_sentiment": 5.0, "review_text": "Excellent plot and complex situations leading to end"}, {"review_sentiment": 5.0, "review_text": "A wonderful read, combined with the cuisine and beauty of the French countryside. Throw in a little bit of crime and away you go!"}, {"review_sentiment": 5.0, "review_text": "I like this book so well I'm in the process of ordering his entire series."}, {"review_sentiment": 5.0, "review_text": "I'm in love with the France depicted in this series of novels set in the French countryside.  My only problem with them is that I tend to blaze right through them, intent on getting to the solution and miss so much of the lovely writing.  Answer to this?  Read it again!"}, {"review_sentiment": 5.0, "review_text": "I love the character, Bruno.  Really he is outstanding!!"}, {"review_sentiment": 5.0, "review_text": "A great read, with a deep sense of place."}, {"review_sentiment": 5.0, "review_text": "Wonderful"}, {"review_sentiment": 5.0, "review_text": "like this kind of a book interesting to keep reading"}]}, "authors": ["Martin Walker"], "isbn": "0307454711", "longitude": 1.4442469, "periods": ["2000s", "Recent Releases"], "title": "The Dark Vineyard", "word_cloud": "quickly become favorite mystery also call meal preparation take much time pursuit bad guy make sure artery flush read series enough butter duck fat dinosaur meal love first definitely felt get introduction specifically community delight awkward moment plot gap francophilia certain page aloud perfect capture moment description connection national identity style rugby play delight get french bit mention food tradition meting justice make good excellent plot complex situation lead end wonderful combined cuisine beauty french countryside little bit crime away like well process order entire series love depict series novel set french countryside problem tend blaze right intent get solution miss much lovely write love character outstanding great deep sense place wonderful kind interesting keep reading", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "When a bevy of winemakers descend on Saint-Denis, competing for its land and spurring resentment among the villagers, the idyllic town—where Benoit “Bruno” Courreges is the town’s only policeman—finds itself the center of an intense drama, with suspicious fires at the agricultural research station that is working on genetically-modified crops.\r\n \r\nTwo young men—Max, an environmentalist who hopes to make organic wine, and Fernando, the heir to an American wine fortune—become rivals for the affections of Jacqueline, a flirtatious, newly arrived Québécoise student of wine. Events grow ever darker, culminating in two suspicious deaths, and Bruno finds that the problems of the present are never far from those of the past. \r\n\r\n\"Captivating...Sure to appeal to readers with a palate for mysteries with social nuance and understated charm.\" The Wall Street Journal\r\n\r\n\"A gentle reminder to slow down and smell the grapes.... [Walker] beguiles the reader.\" The New York Times ", "asin": "0307454711", "rank": "35289", "city": "Toulouse", "image": "https://images-na.ssl-images-amazon.com/images/I/51rrx7YtHaL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}