{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 32.0804808, "ratings": {"num_ratings": 151, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "Algerian author Khadra (a pseudonym) started his career by writing crime novels, so it shouldn't be surprising that he uses some of the similar procedural framework for this excellent attempt to explain why a seemingly fully integrated upper middle-class Arab woman becomes a suicide bomber in Israel. The protagonist, Dr. Jaafari, is a respected Israeli Arab doctor living in a nice Tel Aviv house, socializing with plenty of Jewish friends. The book opens with his hospital receiving a score of victims from a suicide bomb attack, one that apparently his wife delivered.The plot hook of a spouse with a secret life is a classic one, and here it's well-used as the hook for the doctor to try and understand what happened to the woman he loved and why she would do this. This takes him down the mean streets of Bethlehem, Jenin, and elsewhere, trying to meet with shadowy mullahs, and various factions of Islamist groups. As with the classic detective plot, no one wants him sticking his nose in, stirring up trouble, but he persists until he can learn the full truth of his wife's secret life.As far as I can recall (I read the original novel more than ten years ago), this adaptation is fairly faithful. The one aspect that can get a little confusing is keeping track of the the profusion of various family members of different generations that the doctor encounters in his journey. The compression of the story in this format makes that a bit tough. I didn't love the art -- it's too loose and simple for my taste. Overall, worth checking out if you're looking for a graphic novel with a nuanced and provocative story, alas, one that's just as relevant as when it was written. As a final note, I should add that the film adaptation of the novel is very good."}, {"review_sentiment": 3.0, "review_text": "I've expected better information when discussing such honoring actions.I expected the book to have a better ending.Hope to read better books from Yasmina Khadra"}, {"review_sentiment": 5.0, "review_text": "This is such an amazing book! It starts off with a suicide bombing attack and bring the reader along for a gripping tale. It's been a while since I've actually read it, so I don't remember a lot of the details, which is probably for the best. I wouldn't want to risk ruining it for you. I do remember it was an awesome read though, so pick up a copy. Trust me- you'll enjoy it."}, {"review_sentiment": 4.0, "review_text": "Good read on a scary subject"}, {"review_sentiment": 5.0, "review_text": "Definitely a story that leaves you deep in thought at its calamitous end.  Set in modern Israel and Palestine, the book raises the question of why a wealthy, educated and fully accepted member (albeit an Arab woman) of Israeli society would choose to become a suicide bomber.  The storyline follows the turbulent investigation undertaken by the woman's husband--a successful Arab-Israeili surgeon--to find out why his wife abandoned her life (literally) and him in order to make a political statement.This is a highly emotional experience for the reader and raises all kinds of moral questions outside the Arab-Israeli context.  For Americans, the question could be, \"Can the affluent members of our society fully enjoy their lives in the midst of lingering poverty?\"  In any event, this is a well-crafted book with plenty of substance."}, {"review_sentiment": 5.0, "review_text": "Fantastic book and film!"}, {"review_sentiment": 4.0, "review_text": "“The Attack” screams out that the Israeli Palestinian conflict is one of conflicting dreams.  The hero Amin is eventually crushed between the conflicting dreams of Israel and the Palestinian second  intifada.The books factual content is painful to read but I think truthful, Unfortunately the book itself is flawed by either bad translation or poor writing or both, and overly one dimensional  characters. However I think it does a good job of exposing the  isues associated with \"Freedom Fighter\" terrorist attacks.The Author (I think) aligns himself with Amin who has not let persecution sour his outlook and when facing death holds on to a better future for his people.  “Dream that you’re beautiful, happy, and immortal ------ you’ll always have your dreams, so you can reinvent your stolen world.”  Amin’s world view is in fact very Jewish - namely contributing in his own way to building a better world.  However not very Jewish in that  he opts out of taking any responsibility for the future of his people.The police official - Navid - states his world view in the speech he gives to Amin in which he identifies the insanity of terrorists who have already given themselves up to another world and only look forward to the celebration of their heroic deaths,  This view  is insensitive to the root causes of terrorist acts which are performed  in the name of nation building. Unfortunately this amplifies the underlying causes and perpetuates violence against violence with no possible  end except  eradication of one's foe.The terrorist leader justifies his efforts in the speech he gives to Amin in which he clearly separates his motivations from those of an Islamist and certainly from that of a Jihadist.  He sees himself as a freedom fighter with no other tools left to fight with. Unfortunately this view ignores the clearly immoral act of murder under any name and also ignores that it perpetuates the cycle of death ending in eradication of the terrorists themselves and thwarting of their dreams for statehood,The novel is successful in stating the moral questions but I think leaves a poor taste in one’s mouth by illustrating that none of the three choices portrayed work.  Moral action with insufficient acceptance of responsibility, terrorism with no concern for innocent lives shattered  as well as the use of overwhelming  force against  terrorism with no attention paid to root causes -- all lead  to perpetuation of the conflict.Bad taste aside --  perhaps this is exactly the message intended."}, {"review_sentiment": 4.0, "review_text": "It is a story about how strong influence of cultural and religious believe can alter people's mind and life."}, {"review_sentiment": 3.0, "review_text": "I won a copy of this book from Goodreads Giveaways.The core of the story is set against the backdrop of the Israeli-Palestinian conflict. We follow the main character Amin Jaafari, an Arab and a naturalized Israeli citizen, living and working as a surgeon in Tel Aviv, as he tries to make sense of the tragedy of a suicide bombing.Hovering over the story is the shadowy identity of one of the mutilated bodies found at the site of the explosion: the suicide bomber’s. To the fundamentalists she is a hero, a martyr, a person who’s made the ultimate sacrifice to defend the cause of a suffering people dispossessed of their homeland. In the eyes of her victims, however, she’s an extremist, a fanatic, a murderer of innocent children.A very solid read for me. The book avoids giving easy resolutions to the questions it raises; and the illustrations are fittingly grim and gritty."}, {"review_sentiment": 5.0, "review_text": "This is one of my favorite books. My sister recommended it (German version) - I read it in 2 days, could not put it down. Still get chills just thinking about it."}]}, "authors": ["Yasmina Khadra"], "isbn": "0307275701", "longitude": 34.7805274, "periods": ["2000s"], "title": "The Attack", "word_cloud": "algerian author pseudonym start career write crime novel surprise us similar procedural framework excellent attempt explain seemingly fully integrated upper woman become suicide protagonist respect doctor live nice house socialize plenty jewish friends open hospital receive score victim suicide bomb apparently wife plot hook spouse secret life classic hook doctor try understand happen woman love take mean street elsewhere try meet shadowy mullah various faction islamist group classic detective plot want stick nose stir trouble persists learn full truth wife secret far recall original year ago adaptation fairly faithful aspect little confuse keep track profusion various family member different generation doctor encounter journey compression story format make bit tough love art loose simple taste worth check look graphic nuanced provocative story relevant write final note add film adaptation good expect better information discuss honoring expect better better amaze start suicide bombing bring grip tale actually remember lot detail probably best risk ruin remember awesome pick copy enjoy good scary subject definitely story leave deep thought calamitous end modern raise question wealthy educate fully accepted member woman society suicide story line follow turbulent investigation undertaken woman husband successful surgeon find wife abandon life literally order political highly emotional experience raise kinds moral question context question affluent member society fully enjoy life midst linger poverty event plenty substance fantastic film scream conflict conflicting dream hero eventually crush conflict dream second factual content painful think truthful unfortunately flaw bad translation poor write overly dimensional character however think good job expose sue associate terrorist think aligns let persecution outlook face death hold better future people beautiful happy immortal always dream reinvent steal world view fact namely contribute way building better world however jewish opts take responsibility future police official state world view speech give identifies insanity terrorist already give world look forward celebration heroic death view insensitive root cause terrorist act perform name nation build amplifies underlie cause perpetuate violence violence possible end eradication terrorist leader justifies effort speech give clearly separate motivation certainly see freedom fighter tool leave fight unfortunately view ignore clearly immoral act murder name also ignore perpetuates cycle death end eradication terrorist thwart dream statehood successful state moral question think leaf poor taste mouth illustrate none choice portray work action insufficient acceptance responsibility terrorism concern innocent life shatter well overwhelm force terrorism attention pay root cause lead perpetuation taste aside perhaps exactly message intend story strong influence cultural religious believe alter people mind life copy core story set backdrop conflict follow main character naturalize citizen live work surgeon try make sense tragedy suicide story shadowy identity mutilate body find site explosion suicide bomber fundamentalist hero martyr person make ultimate sacrifice defend cause suffer people dispossessed homeland eye victim however extremist fanatic murderer innocent solid avoids give easy resolution question raise illustration fittingly grim gritty favorite sister recommended german version day still chill think", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "From the bestselling author of The Swallows of Kabul comes this timely and haunting novel that powerfully illuminates the devastating human costs of terrorism.\r\n\r\nDr. Amin Jaafari is an Arab-Israeli surgeon at a hospital in Tel Aviv. As an admired and respected member of his community, he has carved a space for himself and his wife, Sihem, at the crossroads of two troubled societies. Jaafari’s world is abruptly shattered when Sihem is killed in a suicide bombing.As evidence mounts that Sihem could have been responsible for the catastrophic bombing, Jaafari begins a tortured search for answers. \r\n\r\nFaced with the ultimate betrayal, he must find a way to reconcile his cherished memories of his wife with the growing realization that she may have had another life, one that was entirely removed from the comfortable, modern existence that they shared.\r\n\r\n\"Dr. Amin Jaafari, an Israeli Arab, seems fully assimilated into Tel Aviv society, with a loving wife, a successful career as a surgeon, and numerous Jewish friends. But after a restaurant bombing kills nineteen people, and it becomes apparent that his wife was the bomber, he plunges into the world of Islamic extremism, trying to understand how he missed signs of her intentions. Khadra (the nom de plume of Mohammed Moulessehoul) vividly captures Jaafari's anguish and his anger at the fanatics who recruited his wife. The Israelis don't escape lightly, either, as their army marches over law-abiding Arab citizens in an attempt to stamp out the militants. Khadra's writing has a tendency toward cliché, but the book's dark vision of the conflict is powerful.\" The New Yorker", "asin": "0307275701", "rank": "316741", "city": "Tel Aviv", "image": "https://images-na.ssl-images-amazon.com/images/I/51PiPX2XYvL.jpg", "country": "Israel", "story_arc": ["Tragedy", "Things only get worse"]}