{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 84, "rating": 3.6, "reviews": [{"review_sentiment": 1.0, "review_text": "Tedious.  Certainly not literary.  Amateurish.  Puerile travelogue about uninteresting people with no purpose."}, {"review_sentiment": 5.0, "review_text": "Obviously the author has great insight into the cultural norms of both countries! Loved this book."}, {"review_sentiment": 1.0, "review_text": "An overrated author in my book. Nothing interesting from beginning to end, neither amusing nor insightful. And to think he has been compared to Amis."}, {"review_sentiment": 4.0, "review_text": "Read the 2009 James Wood review: From Venice to Varanasi, The New Yorker."}, {"review_sentiment": 5.0, "review_text": "This is an amazing novel. I believe that Jeff Atman who attends the biennial is the same man who goes to Varanasi. While Jeff remains distant from the goings on in Italy, when he is in Varanasi, he becomes completely absorbed by the people and the culture. I don't want to give away any spoilers beyond that. At the end of the book, I was completely blown away by the artistry of Dyer's writing, as he pulls off an incredible, and believable ending."}, {"review_sentiment": 1.0, "review_text": "Jeff in Venice was really, really dry and boring from the start; eventually there is a lot of sex, if that's enough of a story line for you.  Death in Varanasi:  I feel that I wasted my time as I went through the entire thing expecting a plot to show up at some point, didn't happen.  As someone else mentioned, Death in Varanasi was more like a travelogue."}, {"review_sentiment": 4.0, "review_text": "So far I've just read the Jeff in Venice part. I enjoyed it. It was artist, writers, insiders at a very cool and illusive art conference in Venice. It was snarky and snappy and full of itself - in the best of ways. The affair was pure fantasy-again in the best of ways.I loved how he was so smitten with the woman, afraid that she would forget him, missing her before she was gone. Yet once she was out of sight, he leaves her precious memory gift behind at his first opportunity. Hilarious."}, {"review_sentiment": 4.0, "review_text": "well written and very interesting.  second half (Varanasi) can be experienced as a vicarious spiritual journey along with the author."}, {"review_sentiment": 3.0, "review_text": "Dyer's an interesting writer. I'm not sure what my verdict is yet. I think I've read all of his books by now, but I'm not sure. That's one of the problems. He's enjoyable to read, generally, but unmemorable. While reading him, I sometimes think \"Oh, I'd like to tell a friend about this,\" but then, when I finish, I'm kind of glad that I'm done and just want to read something, anything else. Because I think I get sick of his worldly, wised-up tone.There's definitely an aspect here of out-hipping everyone, even by way of self-deprecation. Geoff Dyer's just too cool. I don't think I'd want to be his roommate or even share a meal with him. Everything he writes is like one long magazine article, and his insights are on that level, end of story."}, {"review_sentiment": 5.0, "review_text": "Smart. sexy, well written and about something!"}]}, "authors": ["Geoff Dyer"], "isbn": "0307390306", "longitude": 12.3345898, "periods": ["2000s", "Recent Releases"], "title": "Jeff in Venice, Death in Varanasi", "word_cloud": "tedious literary travelogue uninteresting people purpose obviously author great insight cultural norm country love overrated author interesting begin amuse insightful compare review amazing believe attend biennial man go remain distant going become completely absorbed people culture want spoiler end completely blow away artistry write pull incredible believable end really really dry bore start eventually lot sex enough story line feel waste time go entire thing expect plot show point someone else mention travelogue so far part enjoy artist writer insider cool illusive art conference snarky snappy full best way affair pure best love smitten woman afraid miss go yet sight leave precious memory gift first opportunity well write interesting second half experience vicarious spiritual journey author interesting writer sure verdict yet think sure problem enjoyable generally unmemorable read sometimes think like tell friend finish kind glad do want something anything else think get sick worldly definitely aspect everyone even way cool think want even share meal write long magazine article insight level end story sexy well write something", "genres": ["Fiction & Literature"], "summary": "A New York Times Notable Book\r\n\r\nIn Venice, at the Biennale, a jaded, bellini-swigging journalist named Jeff Atman meets a beautiful woman and they embark on a passionate affair. \r\n\r\nIn Varanasi, an unnamed journalist (who may or may not be Jeff) joins thousands of pilgrims on the banks of the holy Ganges. He intends to stay for a few days but ends up remaining for months.  \r\n\r\nTheir journey—as only the irrepressibly entertaining Geoff Dyer could conjure—makes for an uproarious, fiendishly inventive novel of Italy and India, longing and lust, and the prospect of neurotic enlightenment.", "asin": "0307390306", "rank": "207351", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51vkcbMmOIL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}