{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 6199, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "This book was magical from start to finish.  Unbelievable storytelling and vividly described imagery made this a story that I will never forget. I’m just sad that it’s over!"}, {"review_sentiment": 5.0, "review_text": "Ms. Morgenstern's book, like the circus it so lovingly portrays, is a staggering wonder, like a dream that is nearly more real than reality, magnetic and hypnotic and lovely. I am almost afraid to reread it, for fear of the magic being lost, but I know some dull day I will be drawn back into the circus, and I am sure it will be just as magnificent with every reread."}, {"review_sentiment": 5.0, "review_text": "Took me forever to finish but was a great read"}, {"review_sentiment": 5.0, "review_text": "Not the easiest or lightest of reads, but this book is securely cemented as part of my top favorites of all-time!"}, {"review_sentiment": 3.0, "review_text": "Eh, was an okay book, the reader did a great job for sure, it just was... odd."}, {"review_sentiment": 5.0, "review_text": "A lovely tale that will make you wish it were a place you could visit yourself.Lovely characters you will wish to meet yourself."}, {"review_sentiment": 5.0, "review_text": "This book grabbed me in the first sentence and I could not put it down.  I surely hope someone will make this into a visually stunning movie!!  Excellent...."}, {"review_sentiment": 5.0, "review_text": "This book gets all the stars possible. It was fantastic. There wasn't a single thing I didn't like about it."}, {"review_sentiment": 5.0, "review_text": "I absolutely loved this book. This was the first book in a while that I literally didn't want to put down. The story is complex and layered. Even many of the secondary characters have storylines and character development that are integral to the main plot. The prose is poetic and effortless. The transition between the different characters and timelines never seemed forced. I would reread this in a heartbeat."}, {"review_sentiment": 5.0, "review_text": "Different than anything I have ever read. I have recommended it to several people."}]}, "authors": ["Erin Morgenstern"], "isbn": "0307744434", "longitude": -0.12574, "periods": ["1800s", "Recent Releases"], "title": "The Night Circus", "word_cloud": "magical start finish storytelling vividly describe imagery make story never forget sad lovingly portray stagger wonder dream nearly real reality magnetic hypnotic lovely almost afraid reread fear magic lose know dull day draw back sure magnificent reread forever finish great not easiest lightest read securely cement part top favorite great job sure odd lovely tale make wish place character wish meet grab first sentence surely hope someone make visually stunning movie excellent get star possible fantastic single thing like absolutely love first literally want put story complex layer even many secondary character story lines character development integral main plot prose poetic effortless transition different character timeline never seem forced heartbeat different anything ever recommend several people", "genres": ["Fiction & Literature", "Historical Fiction", "Fantasy"], "summary": "In this mesmerizing debut, a competition between two magicians becomes a star-crossed love story.\r\n\r\nThe circus arrives at night, without warning. No announcements precede it. It is simply there, when yesterday it was not. Within nocturnal black and white striped tents awaits a unique experience, a feast for the senses, where one can get lost in a maze of clouds, meander through a lush garden made of ice, stand awestruck as a tattooed contortionist folds herself into a small glass box, and gaze in wonderment at an illusionist performing impossible feats of magic.\r\n\r\nWelcome to Le Cirque des Rêves. Beyond the smoke and mirrors, however, a fierce competition is underway - a contest between two young magicians, Celia and Marco, who have been trained since childhood to compete in \"a game,\" in which each must use their powers of illusion to best the other. Unbeknownst to them, this game is a duel to the death, and the circus is but the stage for a remarkable battle of imagination and will.\r\n", "asin": "0307744434", "rank": "3348", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51GfkFJuPCL.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}