{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 4, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "The Amazing Absorbing Boy, by Rabindranath Maharaj, is an amazing, absorbing novel about a teenaged boy who leaves his home in Trinidad after the death of his mother to join his estranged father in the Regent Park area of Toronto. His love of comic book heroes gives him a set of unusual survival skills that both sets him apart and smooths his way as an immigrant to Canada. At the end there's a glossary of Trinidadian words like \"nowhereian\" that is a real treat."}, {"review_sentiment": 4.0, "review_text": "Maharaj is a wonderful writer, great imagination, creates memorable characters, like Uncle Boysie and the boy's father. In a few places i thought the comic book analogies were too much, but overall the novel creates a fascinating sense of the immigrant's place, both in Trinidad and Canada. I enjoyed this book as much I enjoyed Homer in Flight. This writer takes chances, leaps of faith, and is rewarded with an unusual, quirky literature that will last."}, {"review_sentiment": 5.0, "review_text": "Very compelling, I am not a fiction reader, but I eagerly wanted to continue reading. The characters are very interesting. The main character is innocent, searching, and troubled and offers an novel view of the city. Very funny, especially aunty umbrella. I highly recommend!"}, {"review_sentiment": 4.0, "review_text": "There have been some wonderful books written from the perspective of a child with a limited and specific point of view that reveals a very adult world to the reader. Some that come to mind are Mark Haddon's The Curious Incident of the Dog in the Night-Time, Stephen Kelman's Pigeon English, and Jonathan Safran Foer's Extremely Loud and Incredibly Close. This book fits neatly into that sub-genre. The main character is a young man from Trinidad who tries to make sense of his new life in Toronto by imagining comic book heroes (and villains) everywhere he goes. In places I felt the author could have taken this premise even further, but fans of superhero comics will certainly appreciate the subtle references.For more reviews, please visit my blog, CozyLittleBookJournal."}]}, "authors": ["Rabindranath Maharaj"], "isbn": "0307397289", "longitude": -79.387207, "periods": ["2000s", "Recent Releases"], "title": "The Amazing Absorbing Boy", "word_cloud": "teenage leave home death mother join estrange father area love comic hero give set unusual survival skill set apart smooth way immigrant end glossary trinidadian word nowhereian real treat wonderful writer great imagination create memorable character father place think comic analogy much overall creates fascinate sense immigrant place enjoy much enjoy writer take chance leap faith reward unusual quirky literature last very compel fiction eagerly want continue read character interest main character innocent search troubled offer view city funny especially aunt umbrella highly recommend wonderful write perspective child limit specific point view reveals adult world come mind fit neatly main character young man try make sense new life imagine comic hero villain everywhere go place felt author take even fan superhero comic certainly appreciate subtle review visit blog", "genres": ["Fiction & Literature"], "summary": "Seventeen-year-old Samuel, naïve and inexperienced, leaves his home in Trinidad for Canada following the death of his mother. He hasn't seen his father since he was six years old and now, thrust into a new life together, Samuel soon realizes that he is considered a burden. Undaunted, though still wide-eyed, and propelled by a comic book sensibility, Samuel begins to explore the vast foreign landscape that is Toronto. There he encounters molemen, super-villains,\r\nchimeras, trolls and a host of sidekicks. \r\n\r\nWith his fourth novel, Rabindranath Maharaj gives us his best work yet, a powerful and funny story of a naive young immigrant who is wise in the culture of comic books, and a portrait of big-city Canada we have never seen before.\r\n\r\n“Maharaj . . . offers an exhilarating interpretation of immigrant experience. . . . Maharaj superbly articulates the longing for home, on the one hand, and the dream of success in Canada on the other.” The Globe and Mail", "asin": "0307397289", "rank": "3486081", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/410AYC-cBZL.jpg", "country": "Canada", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}