{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 7528, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Loved the book, great thriller/mystery. Constantly guessing who the real bad guys were, great story twist. Left me wanting more."}, {"review_sentiment": 2.0, "review_text": "For an author that claims to do research, his sloppy research on this book just turned me off.  The main protagonist is flown 3,000 miles in an F-14 Tomcat without refueling - all at Mach 2.2!  Apparently the fact than an F-14 needs to be on after burners to go Mach 2.2 - and would have enough fuel to last about 10 minutes at that speed - or to go about 250 miles - escapes him.  What trash.  What's even funnier, after dropping off it's passenger, the Tomcat apparently takes off and returns without refueling - a round trip of 6,000 miles.  I wonder if it traveled home at Mach 2.2. also!"}, {"review_sentiment": 5.0, "review_text": "best dan brown everspellbinding adventure  The twists and turns left me spell bound till the end of the book"}, {"review_sentiment": 5.0, "review_text": "With every passing chapter I formulated my own plot, and each time I was wrong. What an amazing story. I didn't want it to end."}, {"review_sentiment": 3.0, "review_text": "The book was more like a 3.5 than a 3. Somewhat predictable, but very intelligently written. Definitely not amazing, however."}, {"review_sentiment": 2.0, "review_text": "A true deception, but from Dan Brown. A good elaborated idea with true scientific facts that engages you with the story, but he turned it into a soap opera with mission impossible paraphernalia.He is writing novels like film scripts, making sure there is enough 3D effects justification, to hide the story lack of a truthful ending."}, {"review_sentiment": 5.0, "review_text": "This book kept me interested from beginning to end.  The mixture of topics...White House,  NASA, geology...kept producing one event after another.  The descriptions were perfect and just the right length so one did not become bored and skim over the wording."}, {"review_sentiment": 5.0, "review_text": "A very exciting story that makes it almost impossible to put it down. The movie is good but the book is so much better. Just be careful, you might just learn something. Dan brown really does the research. I recommend this book very highly."}, {"review_sentiment": 2.0, "review_text": "This is not the real Dan Brown as I have read all his other books and really love the way he uses science and symbolism to intertwine his story but this one was boring. I read half the book and put it down as there was no interest in it fir me. I just hope his new one is as good as all his others but this one does not stand up to the real Dan Brown."}, {"review_sentiment": 5.0, "review_text": "Great Story!  recommended read for sure.  What are you waiting for.... go get it.  Its great!"}]}, "authors": ["Dan Brown"], "isbn": "0307474275", "longitude": 12.4829321, "periods": ["2000s", "Recent Releases"], "title": "The Da Vinci Code", "word_cloud": "love great constantly guess real bad guy great story twist leave want author claim research sloppy research turn main protagonist flown mile tomcat refuel fact need burner enough last minute speed go mile escape trash even funnier drop passenger apparently take return refuel round trip mile wonder travel home also best dan ever spellbinding adventure twist turn leave spell bound end passing chapter formulate plot time wrong amazing story want end like predictable intelligently write amazing however true deception good elaborate idea true scientific fact engage story turn soap opera mission impossible write novel film script make sure enough effect justification hide story lack truthful end keep interested begin mixture topic geology keep produce event description perfect right length become bore skim wording exciting story make almost impossible put movie good much better careful something really research recommend highly real really way use science symbolism intertwine story boring half put interest fir hope new good others stand real recommend sure wait great", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Simultaneously lightning-paced, intelligent, and intricately layered with remarkable research and detail, Dan Brown's novel is a thrilling masterpiece—from its opening pages to its stunning conclusion.", "asin": "0307474275", "rank": "6353", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51oD1Z3VLDL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}