{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 33.3024309, "ratings": {"num_ratings": 23, "rating": 4.2, "reviews": [{"review_sentiment": 2.0, "review_text": "undeserving of the praise it's gotten; not a surprise to learn he was never in Iraq before writing this"}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 4.0, "review_text": "Good book. Came in good condition."}, {"review_sentiment": 5.0, "review_text": "This book is just devastating! The end had me too weepy to actually read. The story begins in a Beirut hotel where the unnamed narrator is about to carry out a mission he refers to as “the greatest operation ever carried out on enemy territory.” We learn that he was a university student from a small village in Iraq but after the invasion the university closes and her returns to his small village. For awhile life is as it has always been. He is restless and wishes he could return to school or at least find work but then reminds himself that at least the war has not affected his village. Then things change.Following the killing of a mentally handicapped village boy by soldiers at a checkpoint and the then the bombing of a wedding party, young men from the village grow increasingly restless and begin leaving for Baghdad, hoping to fight back. The narrator grows increasingly frustrated. When his family home is invaded and his father humiliated in front of the family, he can no longer bear it and he too leaves for Baghdad. At first he tries to lead a normal life but conditions there make that impossible. He winds up on the street and after weeks of being homeless he discovers his cousin Sayed has a prosperous business selling appliances. Sayed takes him in and gives him a job. In no time the narrator discovers that his cousin's appliance business is a front for much more dangerous operations, which he is ultimately recruited into.One of the things I found most touching about this story was the way the young men of the village, trying to make sense of the invasion, cling to the belief that sooner or later the West will understand the beauty of their culture and leave them alone. They cannot believe that technology and capitalism are any match for their long history of art, music, mathematics, and creativity. They say, “when the West realizes how much beauty we have, they will leave us alone.”The ending of this book is just shattering. I won't ruin it for other readers but let me say that the mission he eventually undertakes is so horrible and the reason for his ultimate decision is so beautiful it just tore at my heart. I will not forget this book for a very long time."}, {"review_sentiment": 5.0, "review_text": "I enjoy non-fiction, historical fiction from other cultures.I enjoyed this book very much!"}, {"review_sentiment": 5.0, "review_text": "The Sirens of Baghdad is the third book in Yasmina Khadra's fundamentalist trilogy about the cultural conflicts both within Islam and between the Islamic World and the West. The setting for this book is Iraq after the American invasion. The narrator, an unnamed Bedouin youth from Kafr Karam, is a naive former college student, forced to leave the university by the war, who becomes gradually more radicalized by the outrages of the American occupation. When American \"GIs\" humiliate his father during a search for weapons, he leaves his village for good to join the resistance and avenge his family's honor. Along the way, he meets various characters portraying the contrasting elements of Iraqi society. These portrayals are meant to showcase different Arab perspectives about Islam and the West and, while obvious literary devices, are very well-handled by the author. Khadra is the Arab literary descendent of fellow Algerian Albert Camus and this is high-end existential literature. But the setting, conflicts and action are more unsettling and interesting than anything by Camus. You know you are getting inside the head of an Arab mind that recognizes all of the perplexing ironies and torturous complexities not just of the Iraq war but of the larger Islamic conflict with the West. The book's Beirut ending, when the narrator's humanity finally overcomes his outrage, is wrenching. Actually, the entire Beirut episode comes off a bit artificial as the protagonist discovers that his provincial attitudes, Bedouin sense of honor and nascent Iraqi nationalism are all at odds with the larger apocalyptic ideas of fundamentalist Islam. But, having recently read two other books on the biological terror threat against the West, this part of the book also struck very close to home. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "An amazing, important novel which probes the psychological factors which turn a disgruntled youth into a suicide bomber."}, {"review_sentiment": 5.0, "review_text": "Excellent book, even though many traumatic events are narrated."}, {"review_sentiment": 4.0, "review_text": "Devastatingly real. The book puts you inside the mind and soul of the Itaqi people as they endure loss and privation as their world crumbles in the path of the American invasion."}, {"review_sentiment": 3.0, "review_text": "I loved the story and the writing but thought the development of the events was too predictable!! Perhaps the author needed to do a little bit more research on Iraqi culture/history."}]}, "authors": ["Yasmina Khadra"], "isbn": "0307386163", "longitude": 44.3787992, "periods": ["1900s", "2000s"], "title": "The Sirens of Baghdad", "word_cloud": "undeserving praise gotten surprise learn never write excellent good good condition devastate end weepy actually story begin hotel unnamed narrator carry mission refers greatest operation ever carry enemy learn university student small village invasion university close return small village awhile life always restless wish school least find work reminds least war affect village then thing kill mentally handicapped village boy soldier checkpoint bomb wed party young men grow increasingly restless begin leave hop fight back narrator grow increasingly frustrate family home invade father humiliate front family longer bear leave first try lead normal life condition make impossible wind street week homeless discovers cousin prosperous business selling appliance take give job time narrator discovers cousin appliance business front much dangerous operation ultimately recruit thing find touch story way young men try sense invasion cling belief sooner later understand beauty culture leave alone believe technology capitalism match long history art music mathematics creativity say realize much beauty leave end shattering reader mission eventually undertake horrible reason ultimate decision beautiful heart forget long time enjoy historical fiction enjoy much third fundamentalist trilogy cultural conflict set american invasion narrator unnamed youth naive former college student force leave university war become gradually radicalize outrage occupation humiliate father search weapon leave village good join resistance avenge family honor way meet various character portray contrast element society portrayal mean showcase different perspective obvious literary device author literary descendant fellow existential literature set conflict action unsettle interesting anything know get head mind recognize perplex irony torturous complexity war larger conflict end narrator humanity finally overcome outrage wrench actually entire episode come bit artificial protagonist discovers provincial attitude sense honor nascent nationalism odds larger apocalyptic idea fundamentalist recently biological terror threat part also strike close home recommend amazing important probe psychological factor turn disgruntle youth suicide bomber excellent even many traumatic event narrate devastatingly real put mind soul people endure loss privation world crumble path american invasion love story write think development event predictable perhaps author need little bit research", "genres": ["Fiction & Literature", "Mystery & Suspense", "Politics"], "summary": "The third novel in Yasmina Khadra's bestselling trilogy about Islamic fundamentalism has the most compelling backdrop of any of his novels: Iraq in the wake of the American invasion.\r\n\r\nA young Iraqi student, unable to attend college because of the war, sees American soldiers leave a trail of humiliation and grief in his small village. Bent on revenge, he flees to the chaotic streets of Baghdad where insurgents soon realize they can make use of his anger. Eventually he is groomed for a secret terrorist mission meant to dwarf the attacks of September 11th, only to find himself struggling with moral qualms.\r\n\r\nThe Sirens of Baghdad is a powerful look at the effects of violence on ordinary people, showing what can turn a decent human being into a weapon, and how the good in human nature can resist.\r\n\r\n“Compelling. . . . Khadra brings us deep into the hearts and minds of people living in unspeakable mental anguish.” Los Angeles Times", "asin": "0307386163", "rank": "726545", "city": "Baghdad", "image": "https://images-na.ssl-images-amazon.com/images/I/416VsB%2BY7lL.jpg", "country": "Iraq", "story_arc": ["Tragedy", "Things only get worse"]}