{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 4, "rating": 3.4, "reviews": [{"review_sentiment": 4.0, "review_text": "This is the first book written by artist Tom McCarthy (not to be mistaken for the film director.) As with much of McCarthy's writing, it takes a while to get the hang of reading it, but the shifting frame of reference, the sharp specificity of description, the deluge of foreign place names and geographic inclusion will keep the reader focused and wondering where it is all leading. Do not be fooled - pay attention along the journey, for that is what makes the eventual destination worthwhile.Men in Space"}, {"review_sentiment": 2.0, "review_text": "I found this book very odd & didn't like the author's writing style at all. The only reason I finished it was b/c it was chosen by my book club."}, {"review_sentiment": 4.0, "review_text": "The Lit major in me wants to give McCarthy's MEN IN SPACE five stars for its detailed symbolism, its highly intricate analogies, and its artistic complexity. The lover of stories in me, however, wants to give it two stars for its almost aggressively dense plotting, its alienating cartography, and its oh-so-palpable disdain for anything even approaching entertainment. Let's call it an even 3.5 and round up.This is the third McCarthy book I've read. As a more overt puzzle novel, C exhausted me, and although its opaqueness kept me at a distance, its overall shape and weft was obviously the work of genius. Even more accessible, Remainder did get repetitive and tiresome, but the writing flowed so quickly and with such sumptuous detail that every other page seemed to give me a second and third (and so on) wind. This novel -- about failed transcendence, about isolation and human detritus, and about the existential inevitability of ignorance (or just misunderstanding) -- seemed, however, to belabor its message to the point of abstraction. I could not wait to be done with it long before I was halfway through.The novel follows a large cast of characters who enter and leave each other's lives obliquely. If it can be said to be about anything, it centers around the reproduction of a stolen piece of artwork -- the novel's biggest symbol and MacGuffin Deluxe. Depicting a saint (?) falling or descending from an ellipsis of nothing, the painting represents different things to different people, but the end result for all is essentially the same. Everyone is hovering between knowing and not, between learning and forgetting, and between being and dying. It is, as I've said, a truly dizzying allegory about the shifts that take place when people try to understand or simply move forward.As a theme, this is pretty much par for the course for McCarthy, I'm learning. All of his novels, it appears, are about essentially the same thing. The problem with this book, though -- and maybe this is a flaw only because it is actually his first book -- is that it has no interest in being accessible, interesting, or enlightening. Not really. In fact, anti-enlightenment is the underpinning theme, and as such, the book is almost like an intellectual billy club. While I admire (hell, envy and respect) the technical prowess and the erudite attention to detail, it is disappointing that McCarthy doesn't try harder to make his point in a way that can capture the imagination as well as the intelligence. After all, Literature may be a serious affair, but you must tantalize audiences if you also want to engage them, and this book treats its readers with as much solipsistic disdain as most of its characters treat each other.All in all, like the dew-dappled and intricate web of some horrifically poisonous spider, this book is just as beautifully complex as it is off-putting and alien, and although I feel richer for having read it, I didn't really enjoy the process. For highly cerebral readers only."}, {"review_sentiment": 4.0, "review_text": "Published in the US for the first time, this is Tom McCarthy's first book.  If you were at all intrigued by either of his other novels books, Remainder or C, I think this book gives more clues about what Mr. McCarthy is trying to accomplish with his writing.  And for those unfamiliar with his work, this is (or at least was for me) an easier read than the other two.  Less remote.On the other hand, I think at least Remainder is a more successful book, and both are more coherent novels than this book, which is a series of closest observed scenes with a connected set of characters, but not much of a plot.  There is a randomness to the end of the book, as though the author had hundreds of stories to tell and stopped abruptly because someone blew a whistle rather than because the story had come to an end.And what exactly is the story?  In Prague, at the end of 1992, there are thugs, intellectuals, artists, visitors and refugees.  And all of their worlds intersect at various points.  So when a thug wants a copy made of a stolen icon, it is easy to traverse that world to find the perfect person for the assignment.  But everything goes wrong, lots of people die, and plop, the book  ends.A reoccurring theme in the author's novels is to destroy the allusion that books mirror life and that both are these well-rounded emotionally satisfying worlds.  Instead he creates flat, limited worlds and makes the reader determine what meaning exists, since the very act of flattening the world, particularly emotionally, is that the reader has difficulty making easy assumptions like Anton is a good person, or I like Heidi or I sure hope Roger doesn't die.The books are filled with detailed and obsessively observed facts, and this is particularly true of Men in Space.  There are lectures on how icon painting were painted (long, long ingredient lists and formulas for making pigments and veneers).  We are given equally detailed instructions on such arcane subjects as  the pulley system used to move objects in and out of Amsterdam buildings and how to thread a movie projector.  Emotional vacuums, random scenes and thousands of random facts.The result is a novel mirroring an icon painting.  Obsessively detailed, yet driven by a purely stylized view of the world.  A typical icon feature is its axonometric  treatment of figures.  There is no variation in distances between the viewer and the various figures in the painting.  And thus it is for the various characters and scenes in the novel,.  We are with Heidi at a party while she adds up the cool things she has seen since arriving and then we are reading the report of an unnamed cop who is monitoring the tapped phones of Anton.  One scene following another with a cast of related person and related scenes.  But none of the characters takes a lead, and the book fails to move forward.  It simply revolves from one scene to another.There are numerous references to space and space men in the book, from the  transvestite dressed in a spacesuit for a New Year's Eve party, to an old movie of one character as a toddler in front of the TV showing the first moon landing, to jokes about the cosmonaut who went in space while the Soviet Union existed, and now he has no country to which he can return.  Like the figures in an icon, these spacemen are all two dimensional abstracts.  They are representations of something, they are not individuals with names and distinct identities.The book is filled with arcane facts well described, closely observed details well chosen.  Anton listens to the tram announcement that the door is about to close, and he notes the Czech sentence structure of the announcement  \"it's a participle adjective.  You get them a lot in Julius Caesar's Wars.\"  The author defeats the reader's desire for some overreaching meaning in the book.  There is only one character who searches for meaning, the operative who spends his life listening to other people's conversations, obsessively writing  them down, while asking himself why he does this.  By the end of the book he is without employment, deaf and homeless.  He certainly failed in the search for meaning.  The other characters (still alive at the end) are just living, carrying on in a way typical of modern Western society.  So what's the point of these lives?  So what makes you think there should be a point?"}]}, "authors": ["Tom McCarthy"], "isbn": "0307388220", "longitude": 14.4212535, "periods": ["1900s", "Recent Releases"], "title": "Men in Space", "word_cloud": "first write artist film director much write take get hang reading shift frame reference sharp specificity description deluge foreign place name geographic inclusion focused wonder lead fool attention journey make eventual destination find odd author write style reason finish chosen club major want star detailed symbolism highly intricate analogy artistic complexity lover stories however want give star almost aggressively dense plot alienate cartography disdain anything even approach entertainment even round third overt puzzle exhaust opaqueness keep distance overall shape weft obviously work genius even accessible get repetitive tiresome writing flow quickly sumptuous detail page seem give second third wind fail transcendence isolation human detritus existential inevitability ignorance misunderstanding seem however belabor message point abstraction do long halfway follow large cast character enter leave life obliquely say anything center reproduction steal piece artwork biggest symbol saint fall descend ellipsis nothing paint represent different thing different people end result essentially hover know learn forget die say truly dizzying allegory shift place people try understand simply theme pretty much par course learn novel appear essentially thing problem maybe flaw actually first interest accessible interest enlighten not really fact underpinning theme almost intellectual billy club admire hell envy respect technical prowess erudite attention detail disappoint try harder make point way capture imagination well intelligence serious affair audience also want engage treat reader much solipsistic disdain character treat intricate web horrifically poisonous spider beautifully complex feel richer really process highly cerebral reader publish first time first intrigue novel think give clue try accomplish writing unfamiliar work least easier le hand think least successful coherent novel series closest observe scene connect set character much plot randomness end author hundred story tell stop abruptly someone blow whistle rather story exactly story end thug intellectual artists visitor refugee world intersect various point so thug want copy make steal icon easy traverse world find perfect person assignment everything go wrong lot people die reoccurring theme author novel destroy allusion mirror life emotionally satisfy world instead create flat limited world make determine meaning exists act flattening world particularly emotionally difficulty make easy assumption good person sure hope fill detailed obsessively observed fact particularly true lecture icon painting paint long long ingredient list formulas make pigment give equally detailed instruction arcane subject pulley system use move object building thread movie projector vacuum random scene thousand random result mirror icon paint obsessively detail yet drive purely stylize view world typical icon feature axonometric treatment figure variation distance viewer various figure paint thus various character scenes party add cool thing see arrive read report unnamed cop monitoring tap phone scene follow cast relate person relate scene none character take lead fails move forward simply revolve scene numerous reference transvestite dress spacesuit party old movie character toddler front tv show first moon land joke cosmonaut go exist country return figure icon spaceman dimensional abstract representations something individual name distinct fill arcane fact well describe closely observed detail well choose listen tram announcement door close note czech sentence structure announcement participle adjective get lot author defeat desire overreach meaning character search mean operative spends life listen people conversation obsessively write ask end employment deaf homeless certainly fail search mean character still alive end live carry way typical modern western society point life so make think point", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "The first novel written by Booker finalist Tom McCarthy—acclaimed author of Remainder and C—Men in Space is set in a Central Europe rapidly fragmenting after the fall of communism. It follows an oddball cast—dissolute bohemians, political refugees, a football referee, a disorientated police agent, and a stranded astronaut—as they chase a stolen painting from Sofia to Prague and onward. Planting the themes that McCarthy’s later works develop, here McCarthy questions the meaning of all kinds of space—physical, political, emotional, and metaphysical—as reflected in the characters’ various disconnections. What emerges is a vision of humanity adrift in history, and a world in a state of disintegration.\r\n\r\n“Sophisticated. . . . A rich, encyclopedic text whose knowledge isn’t confined to aesthetics. . . . An intellectually voracious cross section of a historical moment, and a thrilling indication of the vitality of the contemporary British novel.” The New York Times", "asin": "0307388220", "rank": "1108613", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51hFTBm-2-L.jpg", "country": "Czechia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}