{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 100, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent book"}, {"review_sentiment": 5.0, "review_text": "Arrived on time and in good shape.  To understand Gangbanging today you have to know the history of it in the past.  This book helps you get at the roots of the problem that is still plaguing us in the inner-cities all over America as I speak.  It is a must read!"}, {"review_sentiment": 4.0, "review_text": "informative  and interesting"}, {"review_sentiment": 1.0, "review_text": "My purpose was to acquire a felt knowledge of Lower Manhattan. Book perfect for my purpose."}, {"review_sentiment": 5.0, "review_text": "A great book, very informative and timeless."}, {"review_sentiment": 5.0, "review_text": "This was a fascinating history and good resource book. ."}, {"review_sentiment": 5.0, "review_text": "I love this book.  I could care less if it's historically accurate.  The first half of Gangs of New York is one of the most fun reads you can have, if you're into that period of history."}, {"review_sentiment": 5.0, "review_text": "Informative book!"}, {"review_sentiment": 3.0, "review_text": "none"}, {"review_sentiment": 1.0, "review_text": "This book could be subtitled, \"One Damn Thing After Another\". The breakneck speed of the narrative may have been thrilling in the 1920s, when the book was written, but today one would expect a book of its type to be thoroughly researched and annotated. There is simply no way that Asbury could know what he purports to know, and he gives no references for his pronouncements. He reports minute details of conversations, private assignations, etc., which he must have made up completely out of thin air, as he cites no references.As we read the book in the twenty-first century, I understand that we need to allow for his early twentieth-century viewpoints; however, his vile reportage of the behavior and mindsets of the Irish are really too much too credit. His prejudices overwhelm his narrative. And yet, when reporting on the horrific torture and deaths of Black residents of Manhattan, he writes in a strangely antiseptic fashion, without fully elucidating the horrors being inflicted upon innocent people caught up in the Draft Riots. He does not describe in full the real issue of the Draft Riots, namely, that conscripted men could \"buy their way out\" of going to the Civil War by paying a three hundred dollar fee. This necessarily required poor immigrants to fight to the death to protect Blacks, especially in the South. While today, we may believe that this conscription was honorable, I believe that that view needs to be weighed against the fact that young men of wealthy families had no such duty. Asbury whitewashes the whole episode. I could not read any more beyond this point in the book as the tone became ridiculous to me."}]}, "authors": ["Herbert Asbury"], "isbn": "0307388980", "longitude": 0.0, "periods": ["1800s"], "title": "The Gangs of New York: An Informal History of the Underworld", "word_cloud": "excellent arrived time good shape gang banging today know help root problem still plague speak informative interesting purpose felt knowledge perfect purpose great informative timeless fascinating good resource love le historically first half fun read period informative none breakneck speed narrative thrill write today type thoroughly research annotate simply way purport know give reference pronouncement report minute detail conversation private assignation completely thin air cite century understand need allow early viewpoint however vile reportage behavior mindset really much credit prejudice overwhelm narrative yet report horrific torture death resident write strangely antiseptic fashion fully elucidate horror inflict innocent people catch describe full real issue namely conscript men way go pay hundred dollar fee necessarily require poor immigrant fight death protect especially today conscription honorable believe view need weigh fact young men wealthy family duty whitewash whole episode tone become ridiculous", "genres": ["History", "Social & Cultural Studies"], "summary": "First published in 1928, Herbert Asbury's whirlwind tour through the low-life of nineteenth-century New York has become an indispensible classic of urban history. \r\n\r\nFocusing on the saloon halls, gambling dens, and winding alleys of the Bowery and the notorious Five Points district, The Gangs of New York dramatically evokes the destitution and shocking violence of a turbulent era, when colorfully named criminals like Dandy John Dolan, Bill the Butcher, and Hell-Cat Maggie lurked in the shadows, and infamous gangs like the Plug Uglies, the Dead Rabbits, and the Bowery Boys ruled the streets. A rogues gallery of prostitutes, pimps, poisoners, pickpockets, murderers, and thieves, The Gangs of New York is a dramatic and entertaining glimpse at a city's dark past.", "asin": "0307388980", "rank": "50663", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51otG6hRHeL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}