{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 5464, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "great for zombie fans"}, {"review_sentiment": 5.0, "review_text": "The book is great and the audiobook was fantastic to listen to on my way to and from work. I would recommend getting the unabridged version rather than the selected interviews."}, {"review_sentiment": 5.0, "review_text": "I've never liked zombie TV or movies apart from action-loaded entertainment, but the actual concept of this book intrigued me (while I just made fun of the movie.)  The style and the story absolutely blew my mind, and finally got me into the zombie genre for the first time.  I suspected (correctly) that the author had some history background, because it reads like a genuine collection of real stories surrounding a disturbingly-believable global zombie crisis.  Brooks has given his zombies and his zombie virus a set of firm rules in which to exist, and made them incredibly convincing.  Too bad the producers who bought the rights to the movie couldn't see the potential, but maybe it just can't translate from page to screen.  The book shows both the best and worst of humanity and all the gray areas in between that result from a crisis of unimaginable magnitude, and the shape of the world when it's over.  I really wish he'd write more in this universe - it was absolutely stellar."}, {"review_sentiment": 5.0, "review_text": "Different from conventional zombie war book; tried to outline the complexity of war against zombies.  It’s the people who are at stake; not the thrill."}, {"review_sentiment": 5.0, "review_text": "This was an interesting, well researched, and well written novel. I enjoyed reading and it was SO MUCH BETTER than the film based off of it, though before I read the book I had enjoyed the film! The movie really oversimplified the plot and left out a lot of the things that made the book great to read."}, {"review_sentiment": 2.0, "review_text": "2.5 🌟I will admit that I am not a huge fan of zombies. However, there are some zombie related books or shows I have enjoyed in the past.I didn't really care for this book. I love that they got different actors and directors to do the voice acting for all of the different characters. Some of the voice cast that I knew of was Alan Alda, David Ogden Stiers, Alfred Molina and Mark Hamil to name a few. But I found my mind wondering often while listening to this. I also found it confusing that there seemed to be two different ways they referred to the zombies, G's and Zach's, even by the same person. What was the point of the two names and did they ever explain where the names came from? A lot of the narrative seemed to be similar just from different people's perspectives. I did like the story about the soldiers who worked with K9's though.I feel like this needed less perspectives and more of a continuous story."}, {"review_sentiment": 4.0, "review_text": "Good.....thanks"}, {"review_sentiment": 5.0, "review_text": "On par with TWD to depict “what if” the Zombies came. The global story is truly effective, unfortunately not completely captured in the movie."}, {"review_sentiment": 3.0, "review_text": "Put a couple of hours in it, but its kinda boring."}, {"review_sentiment": 5.0, "review_text": "I love this book! It is brilliantly thought out. The movie can't even compete."}]}, "authors": ["Max Brooks"], "isbn": "0307346617", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "World War Z: An Oral History of the Zombie War", "word_cloud": "great fan great audio book fantastic listen way work get unabridged version rather select interview never like tv movie apart entertainment actual concept intrigue make fun movie style story absolutely blow finally get genre first time suspect correctly author background read genuine collection real story surround global crisis give zombie virus set firm rule exist make incredibly convince bad producer buy right movie potential maybe page screen show best worst humanity gray area result crisis unimaginable magnitude shape really wish write universe absolutely stellar different conventional try outline complexity zombies people stake thrill interesting well research well write enjoy read so much film base enjoy film movie really oversimplified plot leave lot thing make great admit huge fan zombie however related show enjoy really love get different actor director voice act different character voice cast know name find mind wonder often listen also find confuse seem different way refer zombie even person point name ever explain name come lot narrative seem similar different people perspectives story soldier work feel need le perspective continuous story good par depict zombie come global story truly effective unfortunately completely captured movie couple hour kinda bore love brilliantly think movie even", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "The Zombie War came unthinkably close to eradicating humanity. Max Brooks, driven by the urgency of preserving the acid-etched first-hand experiences of the survivors from those apocalyptic years, traveled across the United States of America and throughout the world, from decimated cities that once teemed with upwards of thirty million souls to the most remote and inhospitable areas of the planet. He recorded the testimony of men, women, and sometimes children who came face-to-face with the living, or at least the undead, hell of that dreadful time. World War Z is the result. Never before have we had access to a document that so powerfully conveys the depth of fear and horror, and also the ineradicable spirit of resistance, that gripped human society through the plague years.\r\n\r\nRanging from the now infamous village of New Dachang in the United Federation of China, where the epidemiological trail began with the twelve-year-old Patient Zero, to the unnamed northern forests where untold numbers sought a terrible and temporary refuge in the cold, to the United States of Southern Africa, where the Redeker Plan provided hope for humanity at an unspeakable price, to the west-of-the-Rockies redoubt where the North American tide finally started to turn, this invaluable chronicle reflects the full scope and duration of the Zombie War.\r\n\r\nMost of all, the book captures with haunting immediacy the human dimension of this epochal event. Facing the often raw and vivid nature of these personal accounts requires a degree of courage on the part of the reader, but the effort is invaluable because, as Mr. Brooks says in his introduction, “By excluding the human factor, aren’t we risking the kind of personal detachment from history that may, heaven forbid, lead us one day to repeat it? And in the end, isn’t the human factor the only true difference between us and the enemy we now refer to as ‘the living dead’?”", "asin": "0307346617", "rank": "10627", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51iP%2Behot4L.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}