{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 27, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "A book to read again and again for its tasty images and thought provoking choices."}, {"review_sentiment": 3.0, "review_text": "Theme gets lost in 'Polish grief' Excellent thoughts regarding impact of man's attempts to control water and it's impact on those displaced!"}, {"review_sentiment": 5.0, "review_text": "This is one of the best novels I've read in the past 10 years (and I've read a lot of novels).  I'm waiting eagerly for Michaels' next book."}, {"review_sentiment": 5.0, "review_text": "I love Michaels’ writing.She has a wonderful way with words and images stay indelibly in my mind. In this novel a young Canadian couple Avery and Jean who meet on the banks of the St Lawrence river, embark on a journey to Egypt. They live in a houseboat moored on the Nile close to where Avery is overseeing the dismantling of the temple of Abu Simberl and its reconstruction further downriver. Jean is a botanist by vocation and passion and observes the transition of the historical monument and the environmental changes brought about by the building of the dam with mixed emotions.The descriptions of the landscape, the heat and the people are gorgeous and we get a sense of the desert's beauty. The marriage begins to unravel after the loss of a child and there is a huge sense of sadness and pathos as they return to separate lives in Toronto. They long for healing and yet are torn apart by the death of their baby. The story shifts to an affair Jean has with a Polish artist and Avery begins architecture school. We meet more characters who are beautifully drawn.I loved this book because Michaels puts together beautiful sentences, uses words carefully and is evocative in her writing. She also really 'gets' people and translates their emotions well into a story. This is a beautiful book!She is also the author of Fugitive Pieces which has been made into a great film."}, {"review_sentiment": 3.0, "review_text": "It's alright. It was a difficult read for me personally!"}, {"review_sentiment": 5.0, "review_text": "Exquisite prose telling  a compelling story - couldn't put it down!"}, {"review_sentiment": 1.0, "review_text": "I did not understand thw theme I was reading,I thought it was about something else.It tookMe a long time to finish it. I am an avid reader and ussually finish my books in a day or two at the most"}, {"review_sentiment": 3.0, "review_text": "I struggled with what to rate this, because Anne Michaels is clearly brilliant, however, in the end, I felt that the book was 'okay.' It's the struggle between the work of a great author, and a story and characters that just didn't appeal to me personally. I quite enjoyed the historical elements throughout, and Michaels did an outstanding job in describing place."}, {"review_sentiment": 1.0, "review_text": "I thought this novel would be set in Egypt, in the time of the building of the Aswan Dam, but it wanders all over the place, disguising with poetic language the lack of any coherent plot.  The paper jacket is the best part of the book."}, {"review_sentiment": 5.0, "review_text": "After reading Fugitive peaces I wonted to read Ann next book. This book is really nice but very different from first one."}]}, "authors": ["Anne Michaels"], "isbn": "0307455769", "longitude": -79.387207, "periods": ["1900s", "Recent Releases"], "title": "The Winter Vault", "word_cloud": "tasty image think provoke choice get lose grief thought regard impact man attempt control water impact displace best novel past year lot novel wait eagerly next love michael wonderful way word image stay indelibly mind young canadian couple meet bank river embark journey live houseboat moor close oversee dismantle temple reconstruction downriver botanist vocation passion observe transition historical monument environmental change bring build dam mixed description landscape heat people gorgeous get sense desert beauty marriage begin unravel loss child huge sense sadness pathos return separate life long heal yet tear apart death baby story shift affair artist begin architecture school meet character beautifully love put together beautiful sentence use word carefully evocative write also really people translates emotion well story beautiful also author piece make great film alright difficult personally prose tell compelling story understand the theme read think something took me long time finish avid usually finish day struggle rate clearly brilliant however end felt struggle work great author story character appeal personally quite enjoyed historical element outstanding job describe place think time build wanders place disguise poetic language lack coherent plot paper jacket best part read fugitive peace wonted really nice different first one", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The long-awaited novel by the internationally celebrated author of Fugitive Pieces, the debut novel that catapulted Anne Michaels into the forefront of literary superstars.\r\n\r\n“The future casts its shadow on the past. In this way, first gestures contain everything . . .”\r\n\r\nAnne Michaels’s first work of fiction in more than a decade, The Winter Vault is a stunning, richly layered, and timeless novel that is everything we could hope for for Michaels’s second novel — and more. Set in Canada and Egypt, and with flashbacks to England and Poland after the war, The Winter Vault is a spellbinding love story that juxtaposes momentous historical events with the most intimate moments of individual lives.\r\n\r\nIn 1964, a newly married Canadian couple settle into a houseboat on the Nile just below Abu Simbel. At the time of the building of the Aswam dam, Avery Escher is one of the engineers responsible for the dismantling and reconstruction of a sacred temple, a “machine-worshipper” who is nonetheless sensitive to their destructive power. Jean is a botanist by avocation, passionately interested in everything that grows. They met on the banks of the St. Lawrence River, witnessing the construction of the Seaway as it swallowed towns, homes, and lives. Now, at the edge of another world about to be inundated in the name of progress, much of what they most believe in is tested.\r\n\r\nWhen a tragic event occurs, nearing the end of Avery’s time in Egypt, he and Jean return to separate lives in Toronto; Avery to school to study architecture and Jean into the orbit of Lucjan, a Polish émigré artist whose haunting tales of occupied Warsaw pull her further from her husband, while offering her the chance to assume her most essential life.\r\n\r\nBreathtaking, vivid in its exploration of both the physical and emotional worlds of its characters, intensely moving and lyrical, The Winter Vault is a radiant work of fiction and contains all the elements for which Anne Michaels is celebrated.", "asin": "0307455769", "rank": "742526", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51gBUCFBnmL.jpg", "country": "Canada", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}