{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 34, "rating": 4.7, "reviews": [{"review_sentiment": 4.0, "review_text": "A fun read, might be able to do some of the recipes in the book."}, {"review_sentiment": 5.0, "review_text": "A beautiful and interesting book. They go back to the real authentic dishes but updating them."}, {"review_sentiment": 5.0, "review_text": "This place is so unique I had to get the book!They have their own take on traditional JewishDelicatessenSome recipes are not at all Jewish but Pseudo Jewish! What currant Jewish Americans surmiseAre potato latches in this book are the Americanized version! True Jewish latchesAre hand finely graded with some matza mealThe book has that new generation vibeWhich separates this book From the rest😃When you go to their restaurant you could relateTo the book better"}, {"review_sentiment": 5.0, "review_text": "Lots of interesting information."}, {"review_sentiment": 4.0, "review_text": "Don't know how many recipes I'll make but it was a fun read"}, {"review_sentiment": 4.0, "review_text": "After a meal at Mile End, found by accident, and feeling totally perplexed as to how this could have been called a deli in the article we read before going, I finally understand what it's all about.  That's good, because now we are likely to return. When we have a lot more money, that is. Expensive, but at least I know why now.That said, the explanations are crucial to understanding the food, at least for New Yorkers . And get there early, they were out of most everything the evening we went."}, {"review_sentiment": 5.0, "review_text": "Excellent read, enjoyed the story and loved the recipes. I highly recommend."}, {"review_sentiment": 5.0, "review_text": "Great stories and great recipes.  Now you can make all those classics from your favorite Jewish deli.  A great read."}, {"review_sentiment": 5.0, "review_text": "What memories this cookbook brought back.  It evoked dishes Ionly vaguely remembered.  Trips to the one deli in town where weChildren were invited to the courtyard to choose our pickles and pickled tomatoes from the barrels....then off to the bakery in the cellar of a building redolent with smells of caraway, salt, poppySeeds, onions, etc.  Then the joy of eating all of these delicious morsels.  Thanks to this cookbook I will be able to recreate someOf those long lost memories."}, {"review_sentiment": 5.0, "review_text": "Very nice!"}]}, "authors": ["Noah Bernamoff", "Rae Bernamoff"], "isbn": "030795448X", "longitude": -73.6103642, "periods": ["2000s", "Recent Releases"], "title": "The Mile End Cookbook: Redefining Jewish Comfort Food from Hash to Hamantaschen", "word_cloud": "fun able recipe beautiful interesting go back real authentic dish update place unique get take traditional recipe currant surmise are potato latch version latches are hand finely grade matzo new generation vibe which separate restaurant better interesting information know many recipe make fun meal find accident feeling totally perplexed deli article go finally understand good likely return lot money least know say explanation crucial understanding least early everything evening go excellent enjoy story love recipe highly recommend stories great recipe now make classic favorite deli great memories cookbook bring evoke dish vaguely remember deli town we children invite courtyard choose pickle pickle tomato barrel bakery cellar building redolent smell caraway salt poppy seeds onion etc then eat delicious morsel thank cookbook able recreate some of long lose memory very nice", "genres": ["Food and Wine"], "summary": "WHEN NOAH AND RAE BERNAMOFF OPENED MILE END, their tiny Brooklyn restaurant, they had a mission: to share the classic Jewish comfort food of their childhood. \r\n\r\nUsing their grandmothers’ recipes as a starting point, Noah and Rae updated traditional dishes and elevated them with fresh ingredients and from-scratch cooking techniques. The Mile End Cookbook celebrates the craft of new Jewish cooking with more than 100 soul-satisfying recipes and gorgeous photographs. \r\n\r\nThroughout, the Bernamoffs share warm memories of cooking with their families and the traditions and holidays that inspire recipes like blintzes with seasonal fruit compote; chicken salad whose secret ingredient is fresh gribenes; veal schnitzel kicked up with pickled green tomatoes and preserved lemons; tsimis that’s never mushy; and cinnamon buns made with challah dough. Noah and Rae also celebrate homemade delicatessen staples and share their recipes and methods for pickling, preserving, and smoking just about anything.\r\n\r\nFor every occasion, mood, and meal, these are recipes that any home cook can make, including:\r\n\r\nSMOKED AND CURED MEAT AND FISH: brisket, salami, turkey, lamb bacon, lox, mackerel\r\n\r\nPICKLES, GARNISHES, FILLINGS, AND CONDIMENTS: sour pickles, pickled fennel, horseradish cream, chicken conﬁt, sauerkraut, and soup mandel\r\n\r\nSUMPTUOUS SWEETS AND BREADS: rugelach, jelly-ﬁlled doughnuts, ﬂourless chocolate cake, honey cake, cheesecake, challah, rye \r\n\r\nALL THE CLASSICS: the ultimate chicken soup, geﬁlte ﬁsh, corned beef sandwich, latkes, knishes\r\n\r\nWith tips and lore from Jewish and culinary mavens, such as Joan Nathan and Niki Russ Federman of Russ & Daughters, plus holiday menus, Jewish cooking has never been so inspiring.", "asin": "030795448X", "rank": "258006", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/51o67-vHCrL.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}