{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 1543, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Great!"}, {"review_sentiment": 4.0, "review_text": "Growing up near the headquarters of Scientology, I have long been accustomed to the sight of the maritime uniformed ranks outside their converted blue-painted Hollywood hospital. What is hidden from view are those in the dark basement, fed on rice and beans, as punishment. As Lawrence Wright notes in this careful 2013 study, such inmates here and at their desert \"Happy Valley\" compound are held not against their will but by the force of their will. That is, depending financially and emotionally on their committed family and friends, they assent to their rehabilitation, as penitents.They fear their eternal doom, too, for what their founder writes teaches them that the universe has existed quadrillions of years and that their fate is determined in this life. Some sign as teens a billion-year contract of servitude in SeaOrg; many of those most diligent in fidelity to the tenets of this entity have wound up the most degraded, in \"the hole\" under hellish conditions. As a former leader found out when he had to run around a pole in the heat, twelve hours a day, \"until his teeth fell out.\" (172)A skilled investigator into movements on the fringe, his first book looking at the reality behind the romanticized Amish, Wright documents as best as he can the saga. Overlapping with Janet Reitman's \"Inside Scientology,\" (2011) we benefit from two prominent journalists backed by respectively Rolling Stone and The New Yorker (the latter with formidable fact-checkers pitted against 48 binders of counter-arguments assembled by the entity's lawyers in a showdown of wits) in their in-depth books. I read Reitman years before, and while she elaborates better the predicaments of everyday people who gave their lives over to this \"engineered\" faith, Wright expands his profile of Paul Haggis to focus more on the celebrity insiders such as Tom Cruise and John Travolta along with Anne Archer and her spokesman son, Tommy Davis, and defectors willing to speak out. Wright admits: \"A reporter can only talk to people who are willing to talk to him.\" (377) Davis and lawyers for the entity provide a deadpan footnoted commentary as denials of allegations in the text itself by many witnesses and participants are countered in careful, bland legalese. Wright shows here his attempt to be fair-minded.With considerable patience, Wright tries to be even-handed as much as he can towards the believers. He includes whenever possible their objections. He notes their denials as they proliferate. He quotes those who were there and he listens to those who tell what their leaders later contradict or denounce.For it's intriguing how he early on wonders about its founder: if it was a sham, why so ego-driven, hours, days, years, to write down what any must admit is an astonishing level of typing and frenetic attempts to articulate something that has at least glimmers of insight among much that baffles or defies logic. Same as with any faith-system, perhaps; like the Mormons, here we have the first stages of what has not yet been codified into custom over many centuries or millennia to seem as if normal.Davis near the book's end echoes Wright. (Pp. 120/ 359) Why the determination to perpetrate fraud, if the founder did not somehow believe in his mission? Wright accounts for its creation as the juncture of the pulp science fiction the founder was deft at churning out, joined to theology, invention, some kind of crusade against the medical profession, and wartime bravado if in dubiously defended events.Wright avers the founder created his self as a religious leader who craved followers. In turn, his flock put him into his own \"prison of belief\" as he had to please those he'd cajoled. While this stage dips and dashes--how the bestseller got to be so, how the early success faltered, and suddenly how it all recovered to fund worldwide expansion and immense wealth remains sketchy. Reitman took a steadier path as she trudged through these formative years, but Wright has to elide events, it seems, to make room for his shift to the context within which Paul Haggis and his colleagues signed up in the heyday of counter-cultural movements pitched at restless and idealistic youth tired of conformity.The title of this was used for an HBO documentary (2015) by Alex Gibney. That barely scratches the surface of an immense topic, but it's valuable for the video footage allowing an insider's view of the collaboration of Cruise with the present leader of the entity. You do get in the book a good look at the base and running of what caters to that star and other celebrities and their entourages, financed as those who labor there may make a few dollars a day. The disparity continues, for many followers joined as teens or increasingly were raised as such, and their education may end as teens. This draws many adherents into a lifelong dependence on their network and support group, as synonymous with believers. It is sobering to read how spouses and intimates of their leaders have been \"spirited away.\"The founder certainly drove himself by various excesses into an earlier grave than he probably would have found. By early 1986, he went on to some other dimension, as far as his followers put it. \"Whatever powers Scientology was supposed to bestow were no more evident in the death of its founder as they had been in his life.\" (183) A feature of this chronicle is how the sordid and the violent elements around this movement pursued and beat down resistance, whether the IRS, defectors, or the press who dared to call out the movement's gap between the assertions that its members after costly programs had achieved elevated moral and physical attributes, even as many of them were found in disfavor under the new management, whose own minions found themselves purged and sent to gulags as rapidly and unpredictably as in Stalinism or under Mao. The telling gap between the high-minded claims of the teaching and the profit-driven and brutally perpetuated reality persists throughout this account. Until more choose to tell their versions, Wright as with Reitman will be the go-to sources for what outsiders can glean from the inside workings of a formidable power."}, {"review_sentiment": 5.0, "review_text": "Mist read to expose a cult."}, {"review_sentiment": 5.0, "review_text": "This book was also made into a documentary in which they summarize the material an interview some of the subjects on camera. Read the book to learn about Scientology inside and out."}, {"review_sentiment": 5.0, "review_text": "I find it very difficult to stick to a book once I begin it and that was not the case with Going Clear. I find the topic of Scientology very interesting so I had no trouble at all with getting through it, especially considering how well written it is. I recommend everyone to give this book a shot... it's shocking to understand what exactly goes on with this so-called religion."}, {"review_sentiment": 5.0, "review_text": "Everyone who said this was plodding and doesn't give new material is wrong.  This book covers things the movie ignored, probably due to the very real constraints of time... 10 hour long documentary films would not get watched.And its s well written book that is far more fair than other, similar books.  Even Scientologys web paged dedicated to to attacking it is tame compared to their attacks on guys like mike rinder.  Its almost as tho they acknowledge the writers attempt at fairness and attack his work more because its expected they do than hes said anything not true.With that said, i wanna caution people who are anti Scientology right now.  Its cool to attack them... and yet most of these works are terribly one sided.  Admittedly the churches policy of silence and defamation does not help.  And yet, remember this every time you read about him or see him on the TV, a guy mike rinder is an unreliable source by his pwn admission.What is the truth about Scientology?  It probably lies in the middle ground, somewhere between what its biggest detractors and biggest adherents claim about it.This book, tho very heavily weighted by its dependence on people who feel slighted by the church, is probably closer to that mid point than most other work you see that is either pro or con.  Because it doesn't seek to be for or against, and instead tries to find truth, its probably one of the more objective works one can find."}, {"review_sentiment": 5.0, "review_text": "Eye opening and utterly disturbing. How this cult continues to operate and continues to retain their tax exempt status is mystifying. This \"organization\" needs to be shut down once and for all."}, {"review_sentiment": 1.0, "review_text": "This book is complete garbage. The author has no idea what he's talking about. I've been a Scientologist my entire life and it's done nothing but help me and everyone I know who has some things in it too. Maybe get the true facts and find out for yourself before listening to the false interpretation of another.Www. Scientology.org"}, {"review_sentiment": 5.0, "review_text": "OMG.  Very well documented. An incredible story of greed and power. Share this with everyone and maybe save someone."}, {"review_sentiment": 5.0, "review_text": "I watch the HBO special that was based on this phone and found it immensely entertaining. The book covers the same ground but I'm slightly more detail. It's amazing that so many successful people have fallen into this hot deals are nothing but ludicrous."}]}, "authors": ["Lawrence Wright"], "isbn": "0307745309", "longitude": -118.244476, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Going Clear: Scientology, Hollywood, and the Prison of Belief", "word_cloud": "great grow headquarters long accustom sight maritime uniformed rank convert hospital hide view dark basement feed rice bean punishment note careful study inmate desert happy compound hold force depend financially emotionally commit family friends assent rehabilitation fear eternal doom founder write teach universe existed quadrillion year fate determine life sign teen contract servitude many diligent fidelity tenet entity wound degrade hole hellish condition former leader find pole heat twelve hour day teeth fell skilled investigator movement fringe first look reality romanticized document best saga overlap benefit prominent journalist back respectively roll latter formidable pitted binder assemble entity lawyer showdown wit year elaborate better predicament everyday people give life engineer faith expand profile focus celebrity insider spokesman son defector willing speak admit reporter talk people willing talk lawyer entity provide deadpan footnoted commentary denial allegation text many witness participant counter careful bland legalese show attempt considerable patience try much towards believer include possible objection note denial proliferate quote listens tell leader later contradict intrigue early wonder founder sham hour day year write astonish level type frenetic attempt articulate something least glimmer insight much baffle defies logic perhaps first stage yet codify custom many century millennia seem near end echo wright determination perpetrate fraud founder somehow believe mission account creation juncture pulp science fiction founder deft churn joined theology invention kind crusade medical profession wartime bravado dubiously defend avers founder create self religious leader crave follower turn flock put please cajole stage dip dash bestseller get early success falter suddenly recover fund worldwide expansion immense wealth remain sketchy take steadier path trudge formative year elide event seem make room shift context colleague sign heyday movement pitch restless idealistic youth tire title use documentary barely scratch surface immense topic valuable video footage allow insider view collaboration present leader entity get good look base run caters star celebrity entourages finance labor dollar day disparity continue many follower join teen increasingly raise education teen draw many adherent lifelong dependence network support group synonymous believer sober spouse intimate leader spirit away founder certainly drive various excess earlier grave probably early go dimension far follower put power suppose bestow evident death founder life feature chronicle sordid violent element movement pursue beat resistance defector press dare call movement gap assertion member costly program achieve elevated moral physical attribute even many find disfavor new management minion find purge sent gulag rapidly unpredictably tell gap claim teach brutally perpetuate reality persist account choose tell version source outsider glean working formidable power expose cult also make documentary material interview subject camera learn find difficult stick begin case clear find topic interest trouble get especially consider well write recommend everyone give shot shock understand exactly go religion everyone say plod give new material wrong cover thing movie ignore probably due real constraint time hour long documentary film well write far fair similar even web page dedicate attack tame compare attack guy mike tinder almost tho acknowledge writer attempt fairness attack work expect he say anything say wan an caution people anti right cool attack yet work terribly side admittedly church policy silence defamation help yet time tv guy tinder unreliable source pwn truth probably lie middle ground somewhere biggest detractor biggest adherent claim tho heavily weighted dependence people feel slight church probably closer mid point work see pro con seek instead try find truth probably objective work find open utterly disturb cult continue operate continue retain tax exempt status mystify organization need shut complete garbage author idea talk scientologist entire life do nothing help everyone know thing maybe get true fact find listen false interpretation well document incredible story greed power everyone maybe someone watch special base phone find immensely entertain cover grind slightly detail amaze many successful people fall hot deal nothing ludicrous", "genres": ["Business & Finance", "History", "Religion"], "summary": "The Basis For The New HBO Documentary. A National Book Award and National Book Critics Circle Award Finalist. \r\n \r\nScientology presents itself as a scientific approach to spiritual enlightenment, but its practices have long been shrouded in mystery. Now Lawrence Wright—armed with his investigative talents, years of archival research, and more than two hundred personal interviews with current and former Scientologists—uncovers the inner workings of the church. We meet founder L. Ron Hubbard, the highly imaginative but mentally troubled science-fiction writer, and his tough, driven successor, David Miscavige. We go inside their specialized cosmology and language. We learn about the church’s legal attacks on the IRS, its vindictive treatment of critics, and its phenomenal wealth. We see the church court celebrities such as Tom Cruise while consigning its clergy to hard labor under billion-year contracts. Through it all, Wright asks what fundamentally comprises a religion, and if Scientology in fact merits this Constitutionally-protected label. Brilliantly researched, compellingly written, Going Clear pulls back the curtain on one of the most secretive organizations at work today.\r\n\r\nA New York Times Notable Book", "asin": "0307745309", "rank": "17819", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51Z90pn06SL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}