{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 89, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "An absolutely phenomenal collection. Clear, concise, and enthralling. This book is a must-read for anyone interested in the Eastern Front."}, {"review_sentiment": 5.0, "review_text": "Well worth it."}, {"review_sentiment": 5.0, "review_text": "Vasily Grossman was Russia's preeminent war correspondent in World War II. He wrote for Krasnaya Zvezda (Red Star) and Znamya (Banner). The troops loved him because he wrote about their lives and wasn't afraid to interview them at the front lines. He barely escaped during the early German advances on Kiev and Orel, later was at Stalingrad and at the great tank battle of Kursk, and in the end at the fall of Berlin. This book is a collection of his articles and and his unpublished notes saved by his daughter. The editor has added some footnotes and historical background. Grossman is masterful in his descriptions -- sometimes something as simple as a cat sitting on the windowsill of a ruined house. The book includes his Nov. 1944 article on the Treblinka death camp published in Znamya -- the first detailed description of the Holocaust anywhere, and initially dismissed by the western Allies as Stalinist propaganda.  He never joined the Party despite others' urging and as a Jew his position could have been precarious, but his writing was so good even Stalin and the censors mostly left him alone. (He got in trouble later over his novel \"Life and Fate\" but that was later, and does not figure here.) This is war journalism at its best."}, {"review_sentiment": 4.0, "review_text": "Read \"Life and Fate\" and try be satisfied."}, {"review_sentiment": 4.0, "review_text": "Very good account of the Eastern Front.  Grossman's commentary, aided by Beevor's context, gives the reader a first-hand account of the Russian/German conflict.  The chapter on Treblinka is reason enough to read this.  The only negative is the repetition of Grossman's description of the horrors of war."}, {"review_sentiment": 5.0, "review_text": "Up close and personal. An important work by the Soviet Union's premier war reporter. In my opinion, memoirs are the purest form of history. The most gut-wrenching part was when Grossman became aware of the magnitude of what the Germans had done to his people, the Jews of occupied Russia."}, {"review_sentiment": 4.0, "review_text": "This book is a biography of Vasily Grossman and helps you understand the novels and times of the author.  Very interesting.  Describes the highs and lows of the author's life as well as that of the Russian people during the period of the 1930 to the 1070."}, {"review_sentiment": 5.0, "review_text": "Very excellent read"}, {"review_sentiment": 5.0, "review_text": "A classic story of the Russian point-of-view of World War II. Anthony Beevor provides context and clarity.  It's hard to beat for history buffs."}, {"review_sentiment": 5.0, "review_text": "An outstanding account by an outstanding writer and journalists, on the trail and in the very front lines of the Soviet defence and counterattack from Stalingrad to Berlin. An in-depth profile of the Soviet fighting mans physicality and psychology. Also subtle references to the political infighting and paranoia within the Soviet army."}]}, "authors": ["Vasily Grossman"], "isbn": "0307275337", "longitude": 13.3888599, "periods": ["1900s"], "title": "A Writer at War: A Soviet Journalist with the Red Army, 1941-1945", "word_cloud": "absolutely phenomenal collection concise enthral anyone interested well worth easily preeminent war correspondent write troop love write life afraid interview front line barely escape early german advance later great tank battle end fall collection article unpublished note save daughter editor add footnote historical background masterful description sometimes something simple cat sit windowsill ruin house include article death camp publish first detail description anywhere initially dismissed western ally stalinist never join others urge position write good even censor mostly leave alone get trouble later later figure war journalism best read try satisfy very good account commentary aid context give account chapter reason negative repetition description horror war up close personal important work war reporter opinion memoir purest form history part become aware magnitude do people occupy biography help novel time author very interesting high low author life well russian people period very excellent classic story russian provide context clarity hard beat history buff outstanding account outstanding journalist trail front line defense counterattack profile fighting man physicality psychology also subtle reference political infighting paranoia army", "genres": ["WWII", "Journalism"], "summary": "When the Germans invaded Russia in 1941, Vasily Grossman became a special correspondent for the Red Star, the Soviet Army's newspaper, and reported from the frontlines of the war. A Writer at War depicts in vivid detail the crushing conditions on the Eastern Front, and the lives and deaths of soldiers and civilians alike. \r\n\r\nWitnessing some of the most savage fighting of the war, Grossman saw firsthand the repeated early defeats of the Red Army, the brutal street fighting in Stalingrad, the Battle of Kursk (the largest tank engagement in history), the defense of Moscow, the battles in Ukraine, the atrocities at Treblinka, and much more. \r\n\r\nAntony Beevor and Luba Vinogradova have taken Grossman's raw notebooks, and fashioned them into a gripping narrative providing one of the most even-handed descriptions --at once unflinching and sensitive -- we have ever had of what Grossman called “the ruthless truth of war.”", "asin": "0307275337", "rank": "172241", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51DPJLmaq5L.jpg", "country": "Germany", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}