{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 832, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "I am saddened to learn of how this family was treated and their rights taken from them. A powerful story reminding all my is that we can never take our freedoms for granted. Our country's method for dealing with natural disasters and the aftermath need work. I am inspired by this family and their love for their community."}, {"review_sentiment": 1.0, "review_text": "Not much to say,  boring"}, {"review_sentiment": 4.0, "review_text": "good work"}, {"review_sentiment": 4.0, "review_text": "This book feels especially relevant right now as parts of the country are again trying to recover after a massive hurricane. I wish I could say that the relief efforts have improved since Katrina, but I'm not sure that would be true. This book follows Abdulrahman Zeitoun (originally from Syria) and his wife Kathy as they navigate Hurricane Katrina and the aftermath. The Islamophobia of the time is evident from the way Zeitoun is treated by the \"authority figures\" sent to clean up the city. Eggers does a great job showing how difficult this disaster was for the city of New Orleans, the people forced to stay, and the ones able to evacuate."}, {"review_sentiment": 5.0, "review_text": "Loved this book !"}, {"review_sentiment": 4.0, "review_text": "Good book"}, {"review_sentiment": 5.0, "review_text": "This book was a gut wrenching account of what happened in NOLA after Katrina. My admiration for such a man as Zeitoun seemed to grow and grow as the book progressed. I'm infuriated and ashamed of what happened to him but so thankful Eggers told his story, so his pain didn't go unnoticed."}, {"review_sentiment": 5.0, "review_text": "Katrina was a mess.  Zeitoun was a kind good man. helping neighbors & pets.  We live in a country with too much hatred because of skin color, religion . Sadly he was treated so poorly.  I lived through Sandy in NY.  There are still homes that haven't been completely  fixed yet in Long  Beach NY. Now Henry is hitting Texas."}, {"review_sentiment": 5.0, "review_text": "This book is outside of my usual reading list; however I'm so glad I picked up this book.  It is an easy read that provides excellent insight into the experience of a 'good American family' who found themselves on the wrong side of the American gov't.  Near the end of the book the author provides some insight how the gov't came to it's conclusion's altho as is usual there is zero accountability.Our country's reaction to the tragedy of 911 was driven by fear; I can think of no decision that is made in a state of fear that turns out well."}, {"review_sentiment": 5.0, "review_text": "Very interesting book and the story was awesome!"}]}, "authors": ["Dave Eggers"], "isbn": "0307387941", "longitude": -90.0701156, "periods": ["2000s", "Recent Releases"], "title": "Zeitoun", "word_cloud": "sadden learn family treat right take powerful story remind never take freedom grant country method deal natural disaster aftermath need work inspire family love community not much say bore good work feel especially relevant right part country try massive hurricane wish relief effort improve sure true follow originally wife navigate time evident way treat authority figure send clean city great job show difficult disaster city people force stay one able evacuate love good gut wrench account happen admiration man seem grow grow progress infuriate ashamed happen thankful edger tell story pain go unnoticed mess kind good man help neighbor pet live country much hatred skin color religion sadly treat poorly live still home completely fix yet now hit outside usual reading list however glad pick easy provide excellent insight experience american family find wrong side end author provide insight come conclusion alto usual country reaction tragedy drive fear think decision make state fear turn well very interesting story awesome", "genres": ["Biography"], "summary": "A New York Times Notable Book \r\n\r\nThe true story of one family, caught between America’s two biggest policy disasters: the war on terror and the response to Hurricane Katrina.\r\n \r\nAbdulrahman and Kathy Zeitoun run a house-painting business in New Orleans. In August of 2005, as Hurricane Katrina approaches, Kathy evacuates with their four young children, leaving Zeitoun to watch over the business. In the days following the storm he travels the city by canoe, feeding abandoned animals and helping elderly neighbors. Then, on September 6th, police officers armed with M-16s arrest Zeitoun in his home. Told with eloquence and compassion, Zeitoun is a riveting account of one family’s unthinkable struggle with forces beyond wind and water.", "asin": "0307387941", "rank": "29037", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/510WBUPoz7L.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}