{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 59.9132694, "ratings": {"num_ratings": 1167, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "great writing / translation"}, {"review_sentiment": 5.0, "review_text": "One of my favorite Jo Nesbo books in the Harry Hole series! Nesbo has a knack of making his reader think one thing is happening.....but is it really? There were many times where I just could not put this book down! Although this can be a stand alone book, I found it to have a lot more of an impact because I felt I knew the characters from previous books."}, {"review_sentiment": 3.0, "review_text": "It was hard to keep track of all the characters."}, {"review_sentiment": 3.0, "review_text": "Similar to other books in the series I’ve read It takes a while to get going. I was torn as part of me enjoyed it because I couldn’t figure out who the killer was, and feeling like the story was dragging on at some points.  For about the first quarter of the book I nearly gave up but I’m glad I didn’t because as always it’s a well thought out plot.  Overall, I think it’s an interesting ‘who done it’ read but could have a bit more action or movement the plot a bit quicker."}, {"review_sentiment": 2.0, "review_text": "I've enjoyed other Harry Hole stories much more.  Even 2 stars is stretching my appraisal."}, {"review_sentiment": 5.0, "review_text": "All kinds of red herrings - tied up neatly leading into the next one!! Keep on writing Mr. Nesbo. Looking forward"}, {"review_sentiment": 2.0, "review_text": "I've read several - most? - Harry Hole books. Were they all so gimmicked up with weird cliffhangers and red herrings? There's a weird scene where a cop is with another investigator, who goes to the trunk of his car and the cop hears a metallic clink that he doesn't quite understand. Cut to some other scene. Nothing ever comes of that clink. I call it BS (and I don't mean bachelor of science!)"}, {"review_sentiment": 5.0, "review_text": "Nesbo at his best; keeps you guessing until near the end."}, {"review_sentiment": 5.0, "review_text": "Five stars because Nesbo delivers a cracking good mystery weaving in the old with the new. Unexpected deaths and a litany of other atrocities wound into the mysteries of the human psyche. If this is your first Harry Hole novel, go back to the beginning. Plenty of good reads await you."}, {"review_sentiment": 5.0, "review_text": "More please. Por favor otra vez"}]}, "authors": ["Jo Nesbo"], "isbn": "0307951162", "longitude": 10.7391112, "periods": ["2000s", "Recent Releases"], "title": "Police: A Harry Hole Novel", "word_cloud": "great write translation favorite series knack make think thing happen really many time stand alone find lot impact felt know character previous hard track character similar series take go torn part enjoy figure feeling story drag point first quarter nearly give glad always well think plot overall think interest do action movement plot bit quicker enjoy story much even star stretch appraisal kind red herring tie neatly lead next writing forward several gimmick ed weird cliffhanger red herring weird scene cop investigator go trunk car cop hear metallic clink quite understand scene ever come clink call mean bachelor science best keep guess end star delivers crack good mystery weave old new unexpected death litany atrocity mystery human psyche first back begin good read await more please favor rota vex", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Harry Hole returns--or does he?--in a terrifyingly paced, vertiginous new roller coaster of a thriller by the internationally best-selling author of The Snowman and The Redeemer, \"the king of Scandinavian crime fiction\" (Kirkus). \r\n\r\nThe police urgently need Harry Hole . . . A killer is stalking Oslo's streets. Police officers are being slain at the scenes of crimes they once investigated but failed to solve. The murders are brutal, the media reaction hysterical.  \r\n\r\nBut this time, Harry can't help . . . For years, detective Harry Hole has been at the center of every major criminal investigation in Oslo. His dedication to his job and his brilliant insights have saved the lives of countless people. But now, with those he loves most facing terrible danger, Harry is not in a position to protect anyone. \r\n\r\nLeast of all himself . . .", "asin": "0307951162", "rank": "50013", "city": "Oslo", "image": "https://images-na.ssl-images-amazon.com/images/I/51adNvPqpdL.jpg", "country": "Norway", "story_arc": ["Tragedy", "Things only get worse"]}