{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 286, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "The book goes on long after the movie ended in Kitties life and it takes a different path. Also, the marriage is described differently than in the movie. Fun to compare the two stories."}, {"review_sentiment": 5.0, "review_text": "Seller is a 5, book is a 3."}, {"review_sentiment": 5.0, "review_text": "So, so good"}, {"review_sentiment": 5.0, "review_text": "Unsympathetic characters become frail and fragile humans in this love - gone - wrong tale set in the Far East.  Maugham is a master at depicting stunning, exotic locales and their magical effects on mere mortals and sinners.  No cardboard heroes in this tome --- just haunted humans doing the best they can."}, {"review_sentiment": 5.0, "review_text": "I’m quite stingy when it comes to rating books and normally would not give more than 4 stars, even for a book I thoroughly enjoyed. However, in the case of W. Somerset Maugham’s classic The Painted Veil, the first thought that came into my head after finishing the book is that this is a masterpiece that absolutely deserves nothing less than 5 stars!The entire book is beautifully and tightly written, using what I would categorize as “classical” language, but in a style that is simple and easy to understand. Maugham did a fantastic job telling the story of how the main character Kitty Fane’s adulterous affair and the aftermath of it causes her to re-assess and make changes in her life that she never thought possible. In all honesty, from the beginning of the story to the very end, I did not like Kitty one bit. I felt she was silly and foolish (and vain, immature, self-centered, etc.) and even when she “changes for the better” later on, I still couldn’t bring myself to like her. No doubt that Kitty grew a lot after her experiences in China, but I actually still saw a bit of the same characteristics in her, albeit to a much lesser degree. As I was reading, my feelings towards Kitty went from despising her in the beginning to pitying her later on in the story (the pity comes from acknowledgement of the fact that, in a sense, part of her plight truly WAS due to societal conventions and how she was raised).Since I read this book for one of my book clubs, I don’t intend to write a long review on it, as I prefer to save more in-depth analysis for when we discuss the book. However, for anyone who may be considering whether to read this book or not, my response is a wholehearted YES! The amount of ground that Maugham was able to cover – love, betrayal, redemption, society norms and conventions, culture, marriage and relationships, religion, gender roles and stereotypes, class structure, etc. – in such a short book (my Kindle version was less than 200 pages) is not only astounding but also extremely rare. Don’t let the “classic” label fool you into thinking this will be a difficult book to get through because it definitely won’t be – this book is an easy read, yet still invokes much insight into numerous topics that are still relevant today.Lastly, I know there was a movie adaptation of this book that came out around 10 years ago, but I actually don’t plan on watching it, at least not any time soon. I’m very particular when it comes to book to movie/tv series adaptations, especially ones that turn out to be very different from the book due to changes made by the producers/directors. I don’t want my memory of the book to be ruined if I end up disliking the movie’s interpretation of the story/characters.(Read in January 2017)"}, {"review_sentiment": 5.0, "review_text": "Excellent book.  I have always been impressed with his writing style and this book is a good read"}, {"review_sentiment": 5.0, "review_text": "Classic. Brilliant."}, {"review_sentiment": 4.0, "review_text": "Maugham exhibits his considerable insight into the human heart and mind, as well as great descriptive writing powers.  A good, old-fashioned tale."}, {"review_sentiment": 5.0, "review_text": "Book received in good condition"}, {"review_sentiment": 4.0, "review_text": "I decided to read this book because it sounded like an interesting self-discovery book. I can't say that I was disappointed, but it wasn't quite what I expected. I would label this book a classic, primarily because of its language and content. I actually found it was quite interesting although I'm not quite sure why.The story follows Kitty Fane. She is a young (mid-20s) woman living with her husband Walter in the English colony in Hong Kong, China in the 1920s. Kitty had only married her husband in order to be married before her younger sister, and there is no love in her heart for her husband. She has an affair that her husband found out about. He gave her two choices he divorces her (leaving her ruined socially) or she goes with him to a remote Chinese village to help fight a cholera epidemic. After fighting with her lover, she consents to go to the village.When she gets to the village, she is in a severe depression and the rest of the story is how she comes to view herself and those around her. There is the local English Customs official for the town that she finds herself in company with a lot, her husband Walter, and the local nuns that she spends the bulk of her time with and help to shape her ideas. The nuns in particular have a profound impact on her as she slowly changes her views of the world.I think this book was a wonderful cultural read. You learned quite a bit about the English in China in the early 1900s. There's prejudice and racism. Kitty in particular is quite racist, but for the time the language and opinions wouldn't have been at all unusual. The first third of the book is Kitty having and being caught about her affair. After that, you move into rural china where a lot of the interesting aspects of the book are. You learned about nuns and why they become missionaries and how they are happy in their work. They reference traveling by chair all the time. I was correct in what I thought that meant, but was still surprised by this mode of travel. It is carried by collies (indentured servants) from the front and back.Overall I thought it was an interesting read. I can't say way in particular I thought it was good, but it was just the general impression of writing style, language, culture, and emotional growth. I can't say Kitty grew by leaps and bounds, but she did grow some. I liked that the romance scenes happened 'off stage' by being alluded to and then a scene change. I enjoyed the language and writing style as well. The chapters are extremely short, some only a page or two long. It made it easy to stop as needed.I'd recommend this book to anyone who enjoys classical fiction. Also, anyone interested in early 1900s China or the English colonization of China in that time frame might enjoy this, as long as they keep in mind it is still fiction and the story focuses on the emotions and life of a young woman. I'm giving it three cheese slices only because I think this is a one and done read. I can't think that I'll go back and read it, but it was an enjoyable read the first time through."}]}, "authors": ["W. Somerset Maugham"], "isbn": "0307277771", "longitude": 114.1628131, "periods": ["1900s"], "title": "The Painted Veil", "word_cloud": "go long movie end life take different path also marriage describe differently movie compare story seller so good unsympathetic character become frail fragile human love go wrong tale set master depict stunning exotic locale magical effect mere mortal sinners cardboard heroes tome haunt human best quite stingy come rating normally star even thoroughly enjoy however case classic first think come head finish masterpiece absolutely deserve nothing le star entire beautifully tightly write use classical language style simple easy understand fantastic job tell story main character adulterous affair aftermath cause make change life never think possible honesty begin story end like bit felt silly foolish vain immature even change better later still bring doubt grow lot experience actually still saw bit characteristic albeit much lesser degree read feeling towards go despise begin pity later story pity come acknowledgment fact sense part plight truly due societal convention raise club intend write long review prefer save analysis discus however anyone consider response wholehearted amount ground able cover betrayal redemption society norm convention culture marriage relationship religion gender role stereotype class structure short version le page astound also extremely rare let classic label fool think difficult definitely easy yet still much insight numerous topic still relevant know movie adaptation come year ago actually plan watch least time soon particular come series adaptation especially one turn different due change make want memory ruin end dislike movie interpretation excellent always impress writing style good classic exhibit considerable insight human heart mind well great descriptive writing power good tale receive good condition decide sound interest disappointed quite expect classic primarily language content actually find quite interesting quite sure story follow young woman live husband colony marry husband order marry younger sister heart husband affair husband find give choice divorce leave ruin socially go chinese village help fight cholera epidemic fight lover consent go get village severe depression rest story come view local official town find company lot husband local nun spend bulk time help nun particular profound impact slowly change view think wonderful cultural learn quite bit english early prejudice racism particular quite racist time language opinion unusual first third catch affair move rural china lot interesting aspect learn become missionary happy work reference travel chair time correct think meant still surprise travel carry collie indenture servant front think interest way particular think good general impression write style language culture emotional growth grow leap bound grow like romance scene happen stage alluded scene change enjoy language writing style well chapter extremely short page make easy stop recommend anyone enjoy classical fiction also anyone interested early colonization time frame long keep mind still fiction story focus emotion life young woman give cheese slice think do go back enjoyable first time", "genres": ["Fiction & Literature"], "summary": "First published in 1925, The Painted Veil is an affirmation of the human capacity to grow, change, and forgive.\r\n\r\nSet in England and Hong Kong in the 1920s, this beautifully written character study is an affirmation of the human capacity to grow, change, and forgive. The Painted Veil is the story of the beautiful but shallow young Kitty Fane, who marries for money rather than love. When her husband, a quiet doctor, discovers her adulterous affair, he forces her to accompany him to a remote region of China ravaged by a cholera epidemic. \r\n\r\nThere, stripped of the British society of her youth and overwhelmed by the desolation around her, Kitty's conscience begins to awaken. As she takes up work with children at a convent and experiences some of the burden her husband has taken on, she and her husband begin to rediscover each other in a new light. \r\n\r\nWhen her husband is tragically killed, Kitty is forced to return to England to raise her unborn child. Though it is too late for her marriage, she has learned humility, independence, and at last, how to love.\r\n\r\n''The modern writer who has influenced me the most.'' George Orwell\r\n", "asin": "B007C47Y1A", "rank": "520087", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/41nsu6vtQXL.jpg", "country": "China", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}