{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 7, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "full of helpful info"}, {"review_sentiment": 4.0, "review_text": "Checked this out on my vacation to Cannes and Italy. Good selection for my trip. Only so wished it was longer."}, {"review_sentiment": 5.0, "review_text": "Pure velvet, I lingered on each word like a sip of fine wine as I was transported in vivid detail to another place and time.The author delicately weaves enchanting stories of various characters in a seemingly unconnected way until they unexpectedly converge into one beautiful lace."}, {"review_sentiment": 2.0, "review_text": "I just felt like this book left a lot of unfinished business with the ending. It was an ok book, but not much was resolved at the end."}, {"review_sentiment": 5.0, "review_text": "A very satisfying read!  Holthe gets inside the heads of her very varied subjects in a way that makes them real.  Her descriptions are so vivid I felt that I was actually on the train, in the cafes, in the towns.  This was a series of short stories that were all interconnected - an intriguing approach.  Holthe is a very skilled and imaginative writer.  I can't wait for her next work."}, {"review_sentiment": 5.0, "review_text": "No point beating about the bush. Might as well get the finale over with right now at the top, instead of coyly building to it with flourishes of logic and neat exempla. Here goes.This is one terrific book Tess Uriza Holthe has written. It's tough, slapstick, delicate, witty, bawdy, rueful and superbly crafted. One minute she throws her head back in laughter; the next she whips out a blade and knifes you in the ribs. Can't trust her at all, meaning she's the best sort of writer. There are lots of good characters, too, women and men: a Scots enforcer, three widows all once married to the same man, a band of gypsy pickpockets, a hard ex-con who finds happiness with a street urchin and vice versa, a Jewish mother and son, a master lace maker, a snoopy wife who suffers migraines, a young French woman who marries a rich good-hearted American only to discover that he's mentally ill and drug-addicted. These characters are unusual and engrossing, including the not-so-likable ones. In fact, now I think of it, most of the good ones aren't so good all the way around, and the bad ones aren't so bad all the way around - which is to say that they have dimension and are recognizably human.However hard the surfaces are sometimes, and they do get hard, there are knots of love in these stories. But this ain't chick lit. No way. Rakish heroes and heaving bosoms do not abound in Holthe's worlds. She's too Annie Oakley smart. Miss Sure Shot, you know. Can throw a dozen glass balls in the air and get 'em all before they hit the ground. That good. A champ. And the dust jacket design is very nice, too, by the bye, and useful to see the locations, which are mostly the Italian and French Rivieras, the Côte d'Azur. So, to put the conclusion before the facts: I highly suggest you pedal your Schwinn to an independent bookstore and buy this collection of interrelated short fictions by Holthe. Read it. Savor it. Dig it. You'll be glad you plunked down your bucks. You'll be advising your friends to do the same.So now that's clear, time for some convincing details. How about this fine, calm image of the exterior of a wealthy château in Cannes that the protagonist, Claudette, comes back to after a few years' absence in the U.S.:The château is heartbreakingly beautiful in the soft twilight. Mauve and rose light upon the clay-colored exterior and black wrought-iron railing...Blue cornflowers and red poppies rustling in the warm breeze. Cypress and plane trees leaning in to shade the house. Ivy climbing alongside magenta bougainvillea. Two small red birds flutter and hop on the faded red-tiled roof, craning necks down, small jerks of their heads as they listen to her fumble for the copper skeleton key...And those two birds!Or how about this, a nice contrast, in which Clara thinks Alberto, the man she has just intentionally knocked into the bushes, is a thief, and confronts him. He will become her husband, of course.[S]ince she was certain Alberto was a thief, albeit a good-looking one, ...she said, \"You can stuff your hand up a pig's behind, you pig!\" He blinked. \"A pig's behind?\" But she had called him a pig. Did she then mean for him to stick his hand up his own behind?The superbly crafted aspect of these stories turns up in their interrelations, not only in the excellent, concise writing. A character who is the protagonist in one story will turn up as a minor character in the next. Three typical, young, American male tourists pass through a couple of stories. That street urchin links the Scots heavy to the ex-con. The gypsy pickpockets have two stories, but figure prominently in a third, the one in which the rich American meets his unkind fate. And so on.A different facet of Holthe's craft is on display in the bashing but comic story \"The Bruiser.\" She takes a big chance in this story with her Scots protagonist, Colin Fergusen. He's not exactly your typical enforcer: He likes yoga and aromatherapy, can't get a Ricky Nelson tune out of his head and admires American advertising. But even more, when he speaks or thinks, it's in the brogue of his country. Like this:In America ye couldnay smoke in certain public places. That's what he heard telt. Nay joke. Imagine that. People claiming the air around ye. He'd never make it there. He inhaled deeply and let the smoke oot through his nostrils. Worked like a charm in calming yer nerves. If he couldnay had a smoke at will he'd be a goner.Hoot mon, dialects are tricky. Some readers will turn off if it's not done perfectly. Well, Holthe not only pulls it off for Colin's speech and his interior monologues, she also has some fun by making the omniscient narrator's voice in brogue as well. Note above, for example, \"He inhaled deeply and let the smoke oot through his nostrils.\" A sight quibble in this matter, though: To me, \"yin\" does not equal Scots for \"one,\" and so every time this word appears it's a minor distraction.Is every story equally good, then? Almost, but not quite. \"Weightless,\" about a young American woman who steps into an affair with an Italian fisherman who is having an affair with his brother's wife, goes on too long. And it also seems not very well borrowed from a Henry James American-innocent-abroad-in-Europe narrative.Nonetheless, she's a sly, funny coyote, Holthe is, when she tells her tales. And most of them, BTW, do not have little, pink bows at the end. Whew. Thank goodness. Just like life.Okay, that's it. Enough. End of review. Go to your independent bookstore; buy a copy of The Five-Forty-Five to Cannes. You'll be glad you did, but I already said that, didn't I?"}, {"review_sentiment": 4.0, "review_text": "Tess Uriza's Holthe's novel, The Five-Forty-Five to Cannes, weaves together a number of stories centering around the city of Cannes and the French Riviera.In the opening chapter, Chazz Jorgenson is traveling to Cannes on a whim, fleeing his wife and all the complications of his life. He has his medications, and when he is taken up by two brothers who are set upon relieving him of as much of his money and valuables as possible, he is both suspicious and too delusional to shake them off. As he exits the five-forty-five train in Cannes he sets out at a run, fleeing them, compelled by his fear and drug-fueled anxiety. He runs into traffic and is killed by a passing taxi, We pick up the story with another character who has witnessed the event.The gypsy brothers are indeed criminals--pickpockets of long standing, with a third brother who is trying to shake off their life and start new. They thread their way through all of the chapters of this book--whether Holthe is writing of three lace-making widows, the sorrowing mother of a son who has deserted her for a woman she doesn't like, the released criminal who is trying to make a new life without the complications of relationships, or the young boy who is abandoned in a doorway and picks out a new grandfather.This much complication and interweaving of stories takes a great deal of skill. This collection never quite achieves the satisfying level of integration that the premise should offer to a reader. Some of the characters are fascinating portraits of a time, a place, a culture--like the three widows of Alberto Moretti. Others are a little too much like a Hollywood movie of the poor little waitress who marries money and love. Still, the setting and the glimpses of everyday life of people who are not in Cannes for the film festival is charming and attractive.Armchair Interviews says: If you're looking for an engaging read with plenty of action and lots of scenery, The Five-Forty-Five to Cannes is for you."}]}, "authors": ["Tess Uriza Holthe"], "isbn": "0307351866", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "The Five-Forty-Five to Cannes", "word_cloud": "full helpful info check vacation selection trip only wish longer velvet linger word sip fine wine transport vivid detail place author delicately weave enchant story various character seemingly unconnected way unexpectedly converge beautiful lace felt left lot unfinished business end ok much resolve end satisfy get inside head vary subject way make real description vivid felt actually train cafe town series short story interconnect intriguing approach skilled imaginative writer next work point beat bush well finale right top instead coyly building flourish logic neat example here terrific write tough slapstick delicate witty bawdy rueful superbly craft minute throw head back laughter next whip blade knife rib trust meaning best sort writer lot good character woman men enforcer widow marry man band gypsy pickpocket hard find happiness street urchin vice versa jewish mother son master lace maker snoopy wife suffers migraine young french woman marries rich american discover mentally ill character unusual engross include one fact think good one good way bad one bad way say dimension recognizably hard surface sometimes hard knot story ai chick lit way rakish hero heave bosom world smart know dozen glass ball air get hit ground good champ dust jacket design nice bye useful see location mostly italian french put conclusion fact highly suggest pedal independent bookstore buy collection interrelate short fiction glad plunked buck advise friend clear time convince detail fine calm image exterior wealthy chateau protagonist come back year chateau heartbreakingly beautiful soft twilight rise light exterior black rail cornflower red poppy rustle warm breeze plane tree lean shade house climb alongside magenta bougainvillea small red bird flutter hop fade roof crane neck small jerk head listen fumble copper skeleton key bird nice contrast think man intentionally knock bush thief confronts become husband course nice certain thief say stuff hand pig pig blink pig behind call pig stick hand superbly craft aspect story turn interrelation excellent concise write character protagonist story turn minor character typical young american male tourist pass couple story street urchin link heavy gypsy pickpocket story figure prominently third rich american meet unkind fate different facet craft display bash comic story take big chance story protagonist exactly typical enforcer like aromatherapy tune head admire american advertising even speak think brogue country could nay smoke certain public place hear tel joke claim air around ye never make inhale deeply let too nostril work charm calm yer nerve could nay smoke mon dialects tricky reader turn do perfectly pull speech interior monologue also fun make omniscient narrator voice brogue well example inhale deeply let nostril sight quibble matter equal time word appear minor story equally good quite young woman step affair italian fisherman affair brother wife go long also seem well borrow sly funny coyote tell tale little pink bow end goodness review independent bookstore buy copy glad already say weave together number story center city open chapter travel whim flee wife complication life medications take brother set relieve much money valuable possible suspicious delusional shake exit train set run flee compel fear anxiety run traffic kill pass taxi pick story character witness gypsy brother indeed criminal pickpocket long stand third brother try shake life start new thread way chapter write widow sorrow mother son desert woman release criminal try new life complication relationship young boy abandon doorway pick new much complication interweave story take great deal collection never quite achieve satisfy level integration premise offer character fascinate portrait time place culture widow little much movie poor little waitress marries money love still set glimpse everyday life people film festival charm say look engage plenty action lot scenery", "genres": ["Fiction & Literature", "Mystery & Suspense", "Women's Fiction"], "summary": "The 5:45 to Cannes. It links northern Italy with the French Riviera while running like a thread through lives that touch one another in unexpected and often secret ways: Chazz, the heir to a great fortune, suffers debilitating mood swings that threaten his once-perfect marriage. GianCarlo, a kindhearted young Italian, looks for a way out of the life of thievery he leads with his impoverished and orphaned brothers. Anais feels the insults of old age too acutely when her beloved son marries a woman who seems to despise her. Sophie, a talented young photographer reeling from the sudden death of her family, finds herself vulnerable to the pangs of a lovesick heart. And then there is the accident—if in truth it is an accident—that joins each of these lives to the others in ways both profound and mundane. At the center we find beautiful, bereaved Claudette, wife of the doomed Chazz, taking the eponymous train to Cannes where she, like all the others, remembers her past and draws from it irresolvable feelings of strength and fragility, meaning and emptiness, permanence and loss.\r\n\r\nIn these stories, Tess Uriza Holthe peers deeply into the inner lives of these women and men, while evoking with sensual grace the richness of the land and culture they share: the time-stopping quality of an exquisite and leisurely meal taken at a tiny ristorante in an unmapped village; the salty breeze that wafts through the open bedroom window of an elegant chateau by the sea; the pulse of life at the festival in Rapallo, in the bullrings of Pamplona, and on the streets of Cannes when the movie people have gone. Sad and lovely, often at the same time, The Five-Forty-Five to Cannes takes us to places where we are happy to linger, in the world and in the human heart.", "asin": "0307351866", "rank": "924608", "city": "Cannes", "image": "https://images-na.ssl-images-amazon.com/images/I/51j5qGnsroL.jpg", "country": "Pamplona", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}