{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 59.3251172, "ratings": {"num_ratings": 157, "rating": 4.1, "reviews": [{"review_sentiment": 2.0, "review_text": "A bit outdated, and slow."}, {"review_sentiment": 2.0, "review_text": "Not much character development."}, {"review_sentiment": 5.0, "review_text": "Really good read"}, {"review_sentiment": 5.0, "review_text": "Outstanding book.  Well-written.  I plan to continue to read the series."}, {"review_sentiment": 4.0, "review_text": "Straight forward, well-written crime novel. No extra verbiage."}, {"review_sentiment": 4.0, "review_text": "Set in Sweden and written by Swedish authors about forty years ago, the novel is a pure example of Scandinavian crime.  It is a full on police procedural with each minute detail including long boring stake outs and meaningless conversations among the police.  Still and all it was a fascinating study of police work and the frustration of solving a crime."}, {"review_sentiment": 4.0, "review_text": "Reminiscent of Stieg Larsson's novels."}, {"review_sentiment": 4.0, "review_text": "Henning Mankell's intro helpfully explains how this book figured in the evolution of Scandinavian crime fiction and how it strongly influenced Mankell and other authors who would follow. It's also a very enjoyable read."}, {"review_sentiment": 4.0, "review_text": "This book was written in the 60s (or the 70s?) and in Swedish. This translation isn't particularly new, so there were parts in the English were I wished I could read Swedish. However, considering this book was written decades ago, it was a great read. Good detective fiction doesn't go stale. I was to read more from these two authors."}, {"review_sentiment": 5.0, "review_text": "Excellent book, interesting and sympathetic police characters investigate a murder in Sweden.  I enjoyed learning about how the police operate there. The murderer was well-drawn psychologically.  Won't spoil the ending, but will say the conclusion was realistic.  I will probably read the other nine books in the series."}]}, "authors": ["Maj Sjöwall", "Per Wahlöö"], "isbn": "0307390462", "longitude": 18.0710935, "periods": ["1900s", "Recent Releases"], "title": "Roseanna: A Martin Beck Police Mystery", "word_cloud": "bit outdated slow not much character development really good outstanding plan continue series forward crime extra verbiage write swedish author forty year ago pure example scandinavian crime full procedural minute detail include long boring stake out meaningless conversation still fascinate study work frustration solve crime reminiscent novel genning helpfully explain figured evolution crime fiction strongly influence author also enjoyable write translation particularly new part english wish however consider write decade ago great good detective fiction go stale author excellent interesting sympathetic character investigate murder enjoy learn operate murderer psychologically spoil end say conclusion realistic probably series", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Book 1\r\n\r\nWith a New Introduction by Henning Mankell. The masterful first novel in the Martin Beck series of mysteries by the internationally renowned crime writing duo Maj Sjöwall and Per Wahlöö (\"the best writers of police procedurals in the world\"), finds Beck hunting for the murderer of a lonely traveler.\r\n\r\nOn a July afternoon, a young woman's body is dredged from Sweden's beautiful Lake Vattern. With no clues Beck begins an investigation not only to uncover a murderer but also to discover who the victim was. Three months later, all Beck knows is that her name was Roseanna and that she could have been strangled by any one of eighty-five people on a cruise. \r\n\r\nAs the melancholic Beck narrows the list of suspects, he is drawn increasingly to the enigma of the victim, a free-spirited traveler with a penchant for casual sex, and to the psychopathology of a murderer with a distinctive--indeed, terrifying--sense of propriety.\r\n\r\n\"The first great series of police thriller....Truly exciting.\" Michael Ondaatje\r\n", "asin": "0307390462", "rank": "66376", "city": "Stockholm", "image": "https://images-na.ssl-images-amazon.com/images/I/51mvpOruwsL.jpg", "country": "Sweden", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}