{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 278, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "Based on a true story so it was pretty good once you got into it.  Took a little while to get into though."}, {"review_sentiment": 5.0, "review_text": "This was a very interesting and fun book to read."}, {"review_sentiment": 4.0, "review_text": "I don't necessarily think the writing here is fabulous, but the content was very compelling. It opened my eyes to a lot of things about the culture of Ghana, some wonderful, some leaving much to be desired. I would love a sequel updating where things are in her village now."}, {"review_sentiment": 5.0, "review_text": "Superb read and a great way to learn about Ghanaian culture.Hard to put down. I look forward to an update."}, {"review_sentiment": 3.0, "review_text": "Interesting true story, but the style makes the reading tedious."}, {"review_sentiment": 5.0, "review_text": "King Peggy is a delightful read about the heart of a ruler and the transformation of small African community. You cheer her success, feel her pain when betrayed and are thankful for her gracious spirit."}, {"review_sentiment": 5.0, "review_text": "The outcome is unexpected. I watched it with my other half. I really like the props in this movie. It's quite realistic. The actors performed very well. Very pretty. The plot is very subtle."}, {"review_sentiment": 5.0, "review_text": "I loved this book. I loved King Peggy. I remember seeing an interview with King Peggy a few years ago and thinking that I should track down this book, and I know now that my instinct was correct. Throughout the book, I was impressed by Peggy's spirit, her resolve, and her ass-kicking attitude. The way she faced down the corruption in her village was remarkable. She was determined to make positive changes and she did! I would recommend this book to anyone looking for a great story about an incredible woman."}, {"review_sentiment": 3.0, "review_text": "Liked learning about customs, but didn't think it was well written."}, {"review_sentiment": 3.0, "review_text": "Interesting peek into the culture of a poor African village. Forces an American reader to pay attention to our land of plenty."}]}, "authors": ["Peggielene Bartels", "Eleanor Herman"], "isbn": "0307742814", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "King Peggy", "word_cloud": "base true story pretty good get little get interesting fun necessarily think write fabulous content compel open eye lot thing culture wonderful leave much desire sequel update thing village great way learn put look forward update interest true story style make read tedious delightful heart ruler transformation small community cheer success feel pain betray thankful gracious spirit outcome unexpected watch half really prop movie quite realistic actor perform well very pretty plot subtle love love remember see interview year thinking track know instinct correct impress spirit way face corruption village remarkable determine positive change anyone look great story incredible woman like learning custom think well write interest peek culture poor african village force american pay attention land plenty", "genres": ["Memoir"], "summary": "An American Secretary, Her Royal Destiny, and the Inspiring Story of How She Changed an African Village\r\n\r\nThe charming real-life fairy tale of an American secretary who discovers she has been chosen king of an impoverished fishing village on the west coast of Africa.\r\n \r\nKing Peggy chronicles the astonishing journey of American secretary, Peggielene Bartels, who suddenly finds herself king to a town of 7,000 people on Ghana's central coast, half a world away. Upon arriving for her crowning ceremony in beautiful Otuam, she discovers the dire reality: there's no running water, no doctor, no high school, and many of the village elders are stealing the town's funds. To make matters worse, her uncle (the late king) sits in a morgue awaiting a proper funeral in the royal palace, which is in ruins. Peggy's first two years as king of Otuam unfold in a way that is stranger than fiction. In the end, a deeply traditional African town is uplifted by the ambitions of its decidedly modern female king, and Peggy is herself transformed, from an ordinary secretary to the heart and hope of her community.", "asin": "0307742814", "rank": "360853", "city": "Ghana", "image": "https://images-na.ssl-images-amazon.com/images/I/51CWUeGJAIL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}