{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 71, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Wonderful book.  I wish the author had not smoked and drunk so much so that he would have had a longer life."}, {"review_sentiment": 1.0, "review_text": "The book arrived timely and in good condition.Wasn't a good read, erratic writing style that was hard to follow. Couldn't connect with any of the characters."}, {"review_sentiment": 5.0, "review_text": "Love his writing style! Huge Vonnegut fan and Richler is now up on that pedestal as well."}, {"review_sentiment": 5.0, "review_text": "To truly appreciate \"Barney's Version\" for all its multiplicity of levels, a familiarity with its author's life is essential. Mordecai Richler was born January 27, 1931. William Shatner was born March 22, 1931. Both went to Baron Byng High School in Montréal. \"Barney's Version\" is a show business autobiography, albeit about a fictional person drawn from Richler's own life (as do his other books) with its \"wink and a nod\" inclusion of his high school friends discreetly (but transparently) fictionalized. As a repeated dilemma in \"Barney's Version,\" the protagonist struggles with sexual victimization perpetrated by women in his life (except for one) starting with Barney being deflowered by a high school teacher -- a Catholic woman obsessed with Jews and overwhelmed by hatred of Jews, who resolves that since Jews are the damned, screwing young boys was righteous as a cancellation of sins. \"Barney's Version\" and \"The Horseman of St. Urbain Street\" as well as \"Duddy Kravitz\" recount a successful Hollywood actor \"from the neighborhood.\" Logically, equestrian Shatner provided the basis of the title character in \"The Horseman of St. Urbain Street.\" Query the odds this public school teacher deflowered Shatner, too?All of Mordecai Richler's novels deserve a read. They plow the same lush Canadian soil. In the final analysis, \"Barney's Version\" is about growing up as a minority figure in Canada; it speaks to that more than onset of Alzheimer's Disease. Proper mention should be made for the literary principle of amplification. This may be the first fictional work where, more than simple cognitive declination, a character has Alzheimer's. Despite decades of loyal sexual restraint, cognitive impairment cost him his marriage. Comparison could be made to Shakespeare's King Lear, but Barney's children come through for him. Also, more than a class-conscious poor boy succeeding to middle class wealth, Barney is a Canadian worldly figure. Consistent name dropping bootstraps the show business bio's veracity painting a clear contrasting impression this protagonist is \"real.\" Richler's comments on those popular culture giants of his day are too delicious to go unmentioned. The challenge is to absorb what he says in the \"mirror\" about being an outsider in the U.S.A., or the U.K., or anywhere a predominant society \"tolerates\" any ethnic subculture.For all of that, Richler's fiction polarizes his readership and loses commercial value inasmuch as average Protestant and Catholic Canadians have near zero interest in Jews. Without the brilliant performances of Paul Giamatti and Dustin Hoffman, the movie version would not have achieved its artistic height. Sadly and similarly, South Asians and East Asians immigrants to Canada today have their own second generation Canadians and still the predominant society has benign disregard for minority protagonists' stories. If readers can understand the redolent Yiddishkeit, the non-mainstream nature of the story, and absorb the delightful complexity, this vibrant, masterful work of literature deserves reading because it speaks to universal truths."}, {"review_sentiment": 5.0, "review_text": "Another Richler anti-hero.  Enjoy!"}, {"review_sentiment": 4.0, "review_text": "Good yarn with a lot of Canadian and Quebec references. Mordecai Richler was a unique person and his writing reflects this."}, {"review_sentiment": 5.0, "review_text": "Brilliant!"}, {"review_sentiment": 4.0, "review_text": "Good reading, especially after seeing the movie."}, {"review_sentiment": 5.0, "review_text": "Saw the movie first, and found it interesting enough to get the book.  Astonished that the book is in the form of a memoir, an interior monologue reviewing the marriages of the protagonist.  No holds barred, no secrets untold it makes for roller coaster reading.  But the book, like the movie has depth to it and a solid structure, and leaves us with empathy for a complex, flawed, even tragic narrator."}, {"review_sentiment": 5.0, "review_text": "Read this because of the movie. Loved Loved Loved the movie (one of my top 10). The book is good, but this is one of the few times where I think I like the movie better--not because the book is bad, but because the movie is great."}]}, "authors": ["Mordecai Richler"], "isbn": "030747688X", "longitude": -73.6103642, "periods": ["1900s"], "title": "Barney's Version", "word_cloud": "wonderful wish author smoke drunk much life arrive timely good good erratic writing style hard follow connect character write style fan pedestal well appreciate multiplicity level familiarity author life essential bear go show business autobiography fictional person draw life wink inclusion high school friend discreetly transparently fictionalize repeat dilemma protagonist struggle sexual victimization perpetrate woman life start deflower high school teacher woman obsess overwhelm hatred resolve damn screw young boy righteous cancellation sin well recount successful actor neighborhood equestrian provide basis title character odds public school teacher deflower novel deserve plow lush canadian soil final analysis grow minority figure speak onset mention make literary principle amplification fictional work simple cognitive declination character decade loyal sexual restraint cognitive impairment cost marriage child come also poor boy succeed middle class wealth worldly figure consistent name drop bootstrap show business bio veracity paint clear contrast impression protagonist real comment popular culture giant day delicious go unmentioned challenge absorb say mirror outsider anywhere predominant society tolerate ethnic fiction polarize readership lose commercial value inasmuch average interest brilliant performance movie artistic height sadly similarly immigrants today second generation still predominant society benign disregard minority protagonist story reader understand redolent nature story absorb delightful complexity vibrant masterful work literature deserve read speaks universal truth good yarn lot canadian reference unique person write reflect brilliant good reading especially see movie movie first find interest enough get form memoir interior monologue review marriage protagonist hold bar secret untold make roller coaster read movie depth solid structure leave empathy complex flaw even tragic narrator read movie movie top good time think like movie better bad movie great", "genres": ["Fiction & Literature", "Humour"], "summary": "Barney Panofsky—Canadian expat, wily lover of women, writer, television producer, raconteur—is finally putting pen to paper so he can rebut the charges about him made in his rival’s autobiography.  \r\n\r\nWhether it’s ranting about his bohemian misadventures during the 1950’s in Paris, his tumultuous three marriages, or his successful trashy TV company, Totally Unnecessary Productions, he quickly proves that his memory may be slipping, but his bile isn’t.  But when he’s charged with the murder of his own best friend—caught in bed with the second Mrs. Panofsky—Barney’s version of things might not be enough to keep him out of trouble.", "asin": "030747688X", "rank": "328167", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/51raVs625xL.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}