{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 50, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "absorbing, funny, touching. a delight to read."}, {"review_sentiment": 4.0, "review_text": "I appreciate the way non-native speakers \"mistakes\" and simplicity bring insight to our culture.  Xiaolu Guo is a master."}, {"review_sentiment": 5.0, "review_text": "Funny, raw and witty. This is one of my all-time favorite books! Xiaolu Guo is now one of my favorite writers."}, {"review_sentiment": 4.0, "review_text": "This book shined a light on both the complex differences and the fascinating attraction between these two  cultures. It struck close to home."}, {"review_sentiment": 5.0, "review_text": "Excellent book!"}, {"review_sentiment": 3.0, "review_text": "Had to read and analyze for a collage class. Decent read. Story of a woman exploring cultural differences and her sexuality. More sexual than I expected lol. Quick read, nothing super special."}, {"review_sentiment": 5.0, "review_text": "It's a modern classic. The author's Chinese, wrote it in English but through the lens of a Chinese speaker learning English. This gimmick might sound tiresome, but it's connected to an authentic story of falling in love in a foreign land. Overall, quite charming and affecting. I peeked into the author's other works, but none of them seem to compare to the raw simplicity of this novel."}, {"review_sentiment": 4.0, "review_text": "Entertaining, humorous and insightful. It felt like I was reading somebody's diary, but the story moved a long at a nice pace.  The author's description and expression of scenarios and just simple things as they might be perceived from the eyes of a foreigner and someone of a completely different ethnicity was great, and I found myself laughing out loud several times while reading this book.  Learning mandarin as a second language, I gained an even deeper understanding of the trials and tribulations of someone learning English as a second language and why different tenses are difficult for Chinese people to incorporate into their English speaking and mindset.  Also liked gaining more understanding into how Chinese people view and value family, food, etc. compared to the west.  Really enjoyed this book and will seek out more work by Guo."}, {"review_sentiment": 4.0, "review_text": "Zhuang (who insists on going by just \"Z\", as she says Europeans struggle to pronounce her name properly) is a 23 year old Chinese girl whose parents send her to London to take English courses. They believe if Zhuang can master not only the English language but take in European culture & etiquette, she can come back to the village and help successfully grow the family business. Z is nervous yet excited to jump into her classes, but soon feels overwhelmed by it all. It doesn't help that her English instructor only seems to offer a modicum of help with Z's struggles. The teacher keeps noting that Z is mixing up her sentence structure in both speaking and written assignments, which confuses Z because, as she explains, in the Chinese language time and place are put before people while in English, the person is generally put before location. Also, Z humorously points out I'm backwards? Have you read this guy Shakespeare? His structure is all over the place! {I'm paraphrasing here}.While attending her classes, Z meets and falls in love with an Englishman. They pretty quickly decide to move in together, and it is after this new living arrangement that Z is surprised to learn her new lover is bisexual. She is not upset when she finds out, but over time starts to feel jealous, feeling that he'd probably wish to spend more time with his man than her. Not only is there a cultural divide between Z and her lover, but also quite the age gap -- him being about 20 years her senior.Z's lover suggests she take a European tour through surrounding countries, not only to see more of the world but for them to have a chance apart, maybe break her of her clinginess.This novel is inspired by Guo's own personal memories, when she once took a similar trip to the UK and journaled all her thoughts and experiences. She uses an interesting format to tell the story. It's sort of a blend of dictionary and journal. In her journal, Z explains that she writes down all the English words (and their definitions) that she doesn't understand and that are not being taught in her classes. There's a different word at the beginning of each chapter, and that word sort of foreshadows or hints at what is to come in that chapter. In the early chapters, Z has very broken English, so the writing is very jumbled up, which may turn off some readers but I urge you to stick with it. About forty pages in, the reader sees a significant improvement in Z's writing and by novel's end, you almost have to really look for the spelling or structure errors. I just thought this was a really cool way to really bring Z's story to life. There's a beauty and a poignancy to the way her English unfolds. Sometimes the simplicity of her sentences, the almost child-like way she expresses herself really hits right in the heart.I didn't really love the character of Z's lover. Sometimes he was nice to her and said pretty things to her, but as the story progressed, it seemed more and more like he was taking advantage of her naivety and the fact that his way of life was foreign to her.It just felt like he sometimes toyed with her, sometimes led her to believe there was a deeper bond between them than what actually was, and he just got more and more moody and intolerant of her. Kept wanting to say \"Go get yourself something better, girl!\" But people fall for who they fall for, whether anyone else likes it or not.Highly recommend trying this one if you are looking to branch into more culturally diverse reading. The writing is really stunning in its simplicity and much of what Z talks about lingered in my mind for quite awhile.Note To Sensitive Readers: There is some profanity here and there is some sexually explicit content, particularly when Z, in her curiosity about exploring London, comes upon a sex shop and a place to see peep shows on Charing Cross Rd."}, {"review_sentiment": 5.0, "review_text": "This book makes you laugh out loud, nod your head, cringe in pain and sigh in relief. It's a great, quick read as amusement the first time around and a deeper more thought-provoking read the second time around. I've bought an extra copy as a gift."}]}, "authors": ["Xiaolu Guo"], "isbn": "0307278409", "longitude": -0.12574, "periods": ["2000s", "Recent Releases"], "title": "A Concise Chinese-English Dictionary for Lovers", "word_cloud": "absorb funny touch delight appreciate way speaker mistake simplicity bring insight culture master raw witty favorite xiaolu favorite writer shin light complex difference fascinate attraction culture strike close home excellent analyze collage class woman explore cultural difference sexuality more sexual expect lo nothing super special modern classic author write lens chinese speaker learn gimmick tiresome connect authentic story fall foreign land quite charm affect peek author work none seem compare raw simplicity entertain humorous insightful felt read somebody diary story move long nice pace author description expression scenario simple thing eye someone completely different ethnicity great find laugh loud several time read mandarin second language gain even deeper understanding trial tribulation someone learn english second language different tense difficult chinese people incorporate english speaking mindset also like gain understand chinese people view value family food etc compare west really enjoyed seek work insist go say struggle pronounce name properly year old girl parent send take english course believe master language european culture etiquette come back village help successfully family business nervous yet excite jump class soon feel overwhelm instructor seem offer modicum help struggle teacher keep note mix sentence structure speak write assignment confuses explain chinese language time place put people person generally put location also humorously point backwards have guy structure place paraphrase attend class meet fall love pretty quickly together new living arrangement surprise learn new lover bisexual upset find time start feel jealous feeling probably wish spend time man not cultural lover also quite age gap year lover suggests take european tour surround country see world chance apart maybe inspired personal memory take similar trip journal ed thought experience use interesting format tell story sort blend journal journal explain write english word definition understand taught class different word begin chapter word sort foreshadow hint come chapter early chapter break write jumble reader urge stick forty page see significant improvement write end almost really spell structure error think really cool way really bring story life beauty poignancy way english unfolds sometimes simplicity sentence almost way express really hit right really character lover say pretty thing story progress seem take advantage naivety fact way life foreign felt sometimes toy sometimes lead believe deeper bond actually get moody intolerant want say get something better girl people fall fall anyone else like try look branch culturally diverse read write really stun simplicity much talk linger mind quite sensitive profanity sexually explicit content particularly curiosity explore come sex shop place see peep show make laugh loud nod head cringe pain sigh relief great quick amusement first time deeper second time buy extra copy gift", "genres": ["Fiction & Literature", "Humour"], "summary": "From one of our most important contemporary Chinese authors: a novel of language and love that tells one young Chinese woman's story of her journey to the West—and her attempts to understand the language, and the man, she adores. \r\n\r\nZhuang—or “Z,” to tongue-tied foreigners—has come to London to study English, but finds herself adrift, trapped in a cycle of cultural gaffes and grammatical mishaps. Then she meets an Englishman who changes everything, leading her into a world of self-discovery. \r\n\r\nShe soon realizes that, in the West, “love” does not always mean the same as in China, and that you can learn all the words in the English language and still not understand your lover. And as the novel progresses with steadily improving grammar and vocabulary, Z's evolving voice makes her quest for comprehension all the more poignant. \r\n\r\nWith sparkling wit, Xiaolu Guo has created an utterly original novel about identity and the cultural divide.", "asin": "0307278409", "rank": "76987", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51fWTgcxGIL.jpg", "country": "England", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}