{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1085, "rating": 3.6, "reviews": [{"review_sentiment": 1.0, "review_text": "I cannot believe she won any prize for this mess, let alone a Pulitzer."}, {"review_sentiment": 4.0, "review_text": "A good unchallenging read. Very creatively written, with a nonlinear storyline, and unique ways of portraying characters. Not earth shattering, but very engaging."}, {"review_sentiment": 3.0, "review_text": "I did not feel that this book deserved a Pulitzer Prize!  It was entertaining, but not profound.  In no way can it compare to greats like To Kill A Mockingbird, as literature.  I disliked the constant shifting of time in this book.  I felt that made the story a disruptive experience more than a coherent experience, as a reader."}, {"review_sentiment": 3.0, "review_text": "A series of very vivid and compelling stories but I never was able to pull them all together. When it ended, I was hoping for an afterword that explained how it all fit together. Probably have to read it a second time to see the overall theme."}, {"review_sentiment": 5.0, "review_text": "Hard to understand,much less reduce to words, just how this book works its magic. Not so much a narrative as a series of open ended reflections"}, {"review_sentiment": 5.0, "review_text": "Great book! Shipped in a timely manner, too. :)"}, {"review_sentiment": 5.0, "review_text": "LOVE IT"}, {"review_sentiment": 5.0, "review_text": "Egan weaves a tale of interrelated characters, with timelines and stories from the recent past to an imagined near future. The music business is the backdrop, but it's Megan's fully realized characters that keep the pages turning."}, {"review_sentiment": 3.0, "review_text": "Too avant-garde for me.  But portrayal of who 'we' become as we age was well done."}, {"review_sentiment": 1.0, "review_text": "Predictable and self indulgent. A waste of time!"}]}, "authors": ["Jennifer Egan"], "isbn": "0307477479", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "A Visit from the Goon Squad", "word_cloud": "believe prize mess alone good unchallenging creatively write nonlinear story line unique way portray character not shatter engage feel deserved entertain profound way compare great literature dislike constant shifting time felt make story disruptive experience coherent experience series vivid compel story never able pull together end hop afterword explain fit together probably second time overall theme understand much le word work magic not much narrative series open end reflection timely manner weave tale interrelated character timeline story recent past imagine future music business backdrop fully realize character page turn too portrayal become age well do predictable self indulgent waste time", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Bennie is an aging former punk rocker and record executive. Sasha is the passionate, troubled young woman he employs. Here Jennifer Egan brilliantly reveals their pasts, along with the inner lives of a host of other characters whose paths intersect with theirs. With music pulsing on every page, A Visit from the Goon Squad is a startling, exhilarating novel of self-destruction and redemption.", "asin": "0307477479", "rank": "5835", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51I-285kyRL.jpg", "country": "San Francisco", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}