{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 58, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "I bought this book for my husband. He never read it, but I did. I read it in 2006 and don't remember the details but I do remember liking it and recommending it to several friends at the time."}, {"review_sentiment": 5.0, "review_text": "Full bodied, funny, very human and great insight into the art world."}, {"review_sentiment": 5.0, "review_text": "FantasticFailure to read = failureDon't be dumbRead it"}, {"review_sentiment": 2.0, "review_text": "I found it very confusing as to who was speaking . I was not interested in the charecters.I would not recommend it to anyone"}, {"review_sentiment": 5.0, "review_text": "Found the characterizations fascinating. the 2 protagonists device made it even more compelling. Peter Carey never fails to entertain & enthrall."}, {"review_sentiment": 3.0, "review_text": "As always, great quirky characters, including a formerly famous artist who's career has taken a dump and his mentally challenged brother.Love Peter Carey, but this story of art theft was a bit too bogged down in technical details."}, {"review_sentiment": 3.0, "review_text": "The over-the-top style of this book reminds me a little of A Confederacy of Dunces by John Kennedy Toole, with its crazed lead character Ignatius J. Reilly.Instead of a New Orleans fantasist and a host of other bizarre characters, Theft is about a painter in Sydney, with a brother who is as grotesque as Ignatius J. Reilly, and his attempts to persuade the world to recognize him for the genius he thinks he is.It is not nearly as good as A Confederacy of Dunces but is very funny especially when the reader receives the conflicting views of the same situation by the two brothers.However, the plot is a bit weak and the sheer pace eventually tired me out. If you have more stamina then you might enjoy it."}, {"review_sentiment": 3.0, "review_text": "I found it a bit confusing on first read.  might try it again just to get the flow better and not concentrate on which brother was speaking so much.  I did love the writing though and the descriptions, etc."}, {"review_sentiment": 5.0, "review_text": "Rollicking good time; wonderful way he gets his characters across.  The switching from brother to brother is ingenious and especially vivid."}, {"review_sentiment": 5.0, "review_text": "I enjoyed every last damn page of it. I laughed out loud at the extraordinary turns of phrases by the two narrators, brothers and world apart.  The plot was curly and desparate, and I kept wanting these no-hoping brothers to win, but I often feared the worst for them.  Terrific writing and so memorable."}]}, "authors": ["Peter Carey"], "isbn": "0307263711", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Theft: A Love Story", "word_cloud": "buy husband never remember detail remember like recommend several friend time body funny human great insight art world fantastic failure failure do dumb read find confuse speak interested anyone characterization fascinate protagonist device make even compelling never fail entertain enthrall always great quirky character include formerly famous artist career take dump mentally challenge art theft bit bogged technical detail style remind little craze lead character fantasist host bizarre character theft painter brother grotesque attempt persuade world recognize genius think nearly good funny especially receive conflict view situation plot bit weak sheer pace eventually tired stamen find bit confuse first flow better concentrate brother speak much write description etc rollick good time wonderful way get character switch brother brother ingenious especially vivid enjoy last damn page laugh loud extraordinary turn phrase narrator brother world apart plot curly desperate keep want brother win often fear worst write memorable", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "From the two-time Booker Prize–winning author and recipient of the Commonwealth Prize comes this new novel about obsession, deception, and redemption, at once an engrossing psychological suspense story and a work of highly charged, fiendishly funny literary fiction.\r\n\r\nMichael—a.k.a. “Butcher”—Boone is an ex–“really famous” painter: opinionated, furious, brilliant, and now reduced to living in the remote country house of his biggest collector and acting as caretaker for his younger brother, Hugh, a damaged man of imposing physicality and childlike emotional volatility. Alone together they’ve forged a delicate and shifting equilibrium, a balance instantly destroyed when a mysterious young woman named Marlene walks out of a rainstorm and into their lives on three-inch Manolo Blahnik heels. Beautiful, smart, and ambitious, she’s also the daughter-in-law of the late great painter Jacques Liebovitz, one of Butcher’s earliest influences. She’s sweet to Hugh and falls in love with Butcher, and they reciprocate in kind. And she sets in motion a chain of events that could be the making—or the ruin—of them all.\r\n\r\nTold through the alternating points of view of the brothers—Butcher’s urbane, intelligent, caustic observations contrasting with Hugh’s bizarre, frequently poetic, utterly unique voice—Theft reminds us once again of Peter Carey’s remarkable gift for creating indelible, fascinating characters and a narrative as gripping as it is deliriously surprising.\r\n\r\n“In addition to historical, behavioral, and playful storytelling dimensions, there is an emphatically physical dimension of conflict to [Carey’s] work, conveyed not through words but in between them. The air in his novels can feel charged and changeable, thinning to ghostliness or thickening to sluggishness, as before a storm. Carey’s latest novel operates on all these levels, and a couple of new ones . . . . [Hugh’s] voice is studded with funny malapropisms, Joyce-inflected scat, and a low-grade hysteria that Carey humorously conveys . . . The most skillful effect in Theft is Carey’s complex weaving of [the brothers’] harsh emotional legacy into the grown men’s thoughts, behavior, and spasmodic jokes . . . On the surface Carey’s [prose] pulls us forward in an atmosphere of antic noir. But the book turns out to be nearly as dense with themes, subplots, and embedded details as a more capacious and ambitious work like Oscar and Lucinda . . . Impressive.” New York Review of Books", "asin": "0307263711", "rank": "2715243", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/419UFqFYTdL.jpg", "country": "Tokyo", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}