{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 35, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Thomas Mallon writes extraordinary historical fiction.  His recent books Finale (on the Reagan years) and Watergate are both exceptional.  Fellow Travelers is equally strong but different in its conception.  It is not so much a fictionalized (but authentic) bit of history like Finale and Watergate; it is a private story set within a historical period.  It is a gay love story whose central actions occur during the McCarthy ‘era’.Tim Laughlin is a young Fordham grad who comes to Washington.  There he meets Hawkins Fuller, a slightly older man with whom he falls in love.  Fuller has some feelings for Tim but he is essentially a user, promiscuous and self-centered, while Tim is giving, generous and also profoundly religious.  We are told very early in the novel (nearly forty years later) that Fuller is now in Estonia when he learns of Tim’s death at the age of 59.  This is a striking narrative strategy, since it reveals that their affair ended decades earlier and that there will be, in effect, no happy ending.  The person who contacts Fuller is an old friend named Mary Johnson, who worked with him at the State Department during the time that Fuller knew Tim Laughlin.Mary has her own story and the bulk of the novel consists of an extended flashback to the 1950’s, centering on Mary’s, Tim’s and Hawk’s lives but within the context of the red scare, the lavender scare and the sometimes larger than life, sometimes smaller than life world of Tailgunner Joe, Mary McGrory, Perle Mesta, Richard Nixon, Drew Pearson, et al.  The author was a toddler at the time, but those of us who remember those times from direct experience can testify to the accuracy of his portrayals and the depth of the research on which they are based.Along with being a touching, sad and very powerful love story, this is a story about Washington and about the young people who are drawn to it.  The portrait is not usually a favorable one.  I spent 17 years there; one of the first things I was told is that ‘there is only one good job in town and everyone else spins around it like satellites’.  I would add that it is indeed a bubble town, a tiny world of endless gossip, logrolling, backbiting and self-interested maneuvering with would-be puppet masters everywhere, lubricating the city with cash and influence.  It is the perfect setting for human drama, though that drama is always likely to be sad and far less heroic (up-close) than it is represented to be.  While the city is a ‘center of power’ the vast majority of its inhabitants see themselves as powerless and go to great lengths (in generally fruitless attempts) to alter that condition.One of the author’s great strengths is that he is scrupulously fair when it comes to politics and ideology.  He never indulges in screeds and he never grinds axes.  He sees human beings with all of their warts, flaws and shortcomings but with love, compassion and a search for the elements of the heart which we share and aspire to cultivate.  This adds immeasurably to the power of the narratives and makes his stories profoundly human rather than simplemindedly political.Bottom line: a superb, touching novel.  Highly recommended."}, {"review_sentiment": 5.0, "review_text": "Having once been a gay book store owner for 31 years, I am surprised I had not encountered this fine book, or the author.  Besides capturing the gay experience of those times,  Mallon took me back to the days of the Army-McCarthy hearings, much of which I heard while working as a soda jerk during my high school days.  Much thanks to the Facebook friend who brought this excellent book to my attention."}, {"review_sentiment": 5.0, "review_text": "The McCarthy era as it applies to gay men in Washington DC who have to hide everything about themselves to survive. It seems highly accurate and extremely well researched. This is not a romance. The love story involved is not much involved with love at all, but only with ambition."}, {"review_sentiment": 1.0, "review_text": "Unless you are reader who works in the corridors of Capitol Hill, this book has absolutely no interest. The author has taken a theme then drowned it in political history, which will loose you completely. Characters, both real and fictitious pepper the pages, great slices of archives inserted of hearings, conversations and commentary to lend the tale relevance. I skipped pages and pages of this book which fails on so many fronts that I can only describe it as a complete waste of time.  Forget it."}, {"review_sentiment": 5.0, "review_text": "Only American history majors are likely to be aware that America’s first Red Scare was sparked in 1886 by the Haymarket affair in Chicago — a demonstration by workers calling for an eight-hour day which led to widespread persecution of men, usually foreign-born, who were perceived as anarchists. Thirty-three years later a wave of anarchist bombings in the wake of World War I induced Attorney General A. Mitchell Palmer to recruit a 23-year-old named J. Edgar Hoover to locate and deport hundreds of anarchists, Communists, and other assorted leftists. Dial the clock forward nearly another thirty years to the anti-Communist frenzy following World War II that rose to a crescendo in the 1950s with the histrionic hearings presided over by Wisconsin Republican Senator Joseph McCarthy. Thomas Mallon’s novel, Fellow Travelers, skillfully recreates the mood prevailing in Washington, DC, during McCarthy’s witch-hunt, placing fictional characters in solidly researched historic circumstances.America’s third Red ScareTo appreciate Mallon’s tour de force to the fullest, you might need to be in my age cohort (yes, north of 70). Reading Fellow Travelers was a lot like old home week for me: the book is filled with references to the federal officials, celebrities, and signature events of the 1950s. Since Thomas Mallon was born only in 1951 and would have been just nine years old when the decade ended, it’s safe to assume that he had to do a great deal of reading and research to recreate the flavor of those times.It’s well known that McCarthy and his collaborators — as well as those who knuckled under to their strong-arm tactics — targeted not just Communists but anyone left of center, including outspoken liberals, progressive, and unaffiliated socialists. Anyone who resisted the Red Scare was placed in McCarthy’s cross-hairs and frequently lost their jobs as a result. Among them were not only officials in the State Department and the Army and Hollywood personalities, all of whom have received a great deal of attention, but also teachers and administrators on campuses throughout the country and employees in private companies as well. It’s less well known that gay men, too, were driven out of their jobs as “security risks,” presumably because they were vulnerable to blackmail. (Whether lesbians were also targeted is unclear in the context of this gay love story, and I have no personal knowledge to answer the question). The McCarthy years were one of the darkest periods in American history.A gay love story set against the background of the Red ScareFallon deftly weaves together two themes in Fellow Travelers: the rise and fall of Joseph McCarthy and the love between two men, one of them a senior government official. There’s irony — perhaps what might be called a double entendre — in the title as a result, as the two central characters were “fellow” travelers on the unconventional path they’d chosen.About the authorThomas Mallon is the author of seven nonfiction books and eight novels as well as numerous magazine articles, critical essays, and reviews. I’ve previously reviewed his two most recent novels, Watergate and Finale (about the final years of Ronald Reagan’s administration). Both were outstanding works of political fiction."}, {"review_sentiment": 5.0, "review_text": "Historic, tear-filled, mesmerizing, accurate beyond description, worthy of hours of uninterrupted reading. So beautifully captures a riveting time in American history, all amidst a young man's awakening journey thru love and loss"}, {"review_sentiment": 5.0, "review_text": "A study of the times and its persons that  probes their depths and draws the reader incrementally deeper and deeper. Beware of the depths of empathy this masterful work will take you."}, {"review_sentiment": 2.0, "review_text": "For me, this book failed on so many levels.First, it's a story about dysfunctional people.  I've known for a while that I don't like reading books about dysfunctional families, but I didn't realize that  my dislike is really directed towards dysfunctional people.  With one exception - who is a thoroughly dislikable excuse for a human being - the characters are passive and keep making the same mistakes over and over again, to the point that I wished I could have smacked some of them upside the head.  It's very difficult, for me at least, to feel anything close to empathy for characters that are so just plain emotionally stupid.Second, the book has not aged well.  It takes place during the McCarthy era and is basically about the (gay) main character's almost lifelong obsession with his seducer.  I am certainly aware of how difficult things were for gay people during that period - and many other periods, for that matter - but starting to read it the week after the Supreme Court's gay marriage decision makes it seem so dated.Third, while I very much liked Mallon's book \"Watergate,\" which was an absorbing novel about the people involved in Watergate rather than the incident itself, I realized even when reading it that someone born in the 1970s or later wouldn't know as much about the people involved in Watergate and therefore wouldn't derive as much pleasure (or perhaps schadenfreude) from the book as someone of my age, who lived through Watergate and the subsequent events leading to Nixon's resignation.  Well, \"Fellow Travelers\" suffers from precisely that malady.  Mallon may know everything there is to know about the events and people involved in the Army-McCarthy hearings, but I don't, so many of the characterizations are lost on me.Last, the book couldn't really make up its mind whether it was a political novel or a novel of lost love.  The tug between the two made both aspects weaker, IMHO."}, {"review_sentiment": 5.0, "review_text": "I give this five stars because Mallon's storytelling and prose are at their  tip-top, which means, perfection. It is engaging and heartbreaking, and that is my only problem with the book. At the end of the book (and this is not a spoiler, as the end is revealed in the first pages of the novel, which is a flash-forward) the heartbreak was too much for me. However gloomy, pessimistic, and realistic this plot turn might be for the period, the conclusion of Fellow Travelers leaves Evil triumphant and Good pathetically made to suffer, wither, and die. There is no catharsis. Mallon is brilliant at plot, and I am mystified as to why he chose to stick the knife in in this depressing and unsatisfying way."}, {"review_sentiment": 5.0, "review_text": "I stumbled onto the works of Thomas Mallon by accident.  I was in a book store and saw his most recent release, \"Watergate, A novel\" and thought I thumb through it.  Firs of all, I loved it and recommend it also.  In fact, I loved it so much, I bought several of his works, including \"Fellow Travelers\".  His writing style brings history to life in a way few other historical novelists do.  This novel hooked me from start to finish, and several times I had to sit it down to gather my thoughts and feelings.  I realize other readers may not be as connected to the characters as I am, as a gay man working in government, but I'm sure anyone with any interest in government, politics, history, would enjoy.  I was so deeply connected to the characters that it took me a few days to recover after finishing this book, at which time I quickly passed my copy on to a friend to read!"}]}, "authors": ["Thomas Mallon"], "isbn": "0307388905", "longitude": -77.0366456, "periods": ["1900s", "Recent Releases"], "title": "Fellow Travelers", "word_cloud": "write extraordinary historical fiction recent year exceptional equally strong different conception much fictionalize authentic bit history private story set historical period gay love story central action occur era young grad come meet slightly older man fall love feeling essentially user promiscuous give generous also profoundly religious tell early nearly forty year later learn death age striking narrative strategy reveals affair end decade earlier effect happy end person contact old friend name work time know story bulk consist extend flashback center live context red scare lavender scare sometimes larger life sometimes smaller life world al author toddler time time direct experience testify accuracy portrayal depth research touch sad powerful story story young people draw portrait usually favorable spend year first thing tell good job town everyone else spin satellite indeed bubble town tiny world endless gossip logroll backbite maneuver puppet master everywhere lubricate city cash influence perfect set human drama drama always likely sad far le heroic represent city center power vast majority inhabitant powerless great length generally fruitless attempt alter author great strength scrupulously fair come politics ideology never indulge screed never grind ax see human being wart flaw shortcoming compassion search element heart share aspire cultivate add immeasurably power narrative make story profoundly human rather simpleminded line superb touch recommend have gay store owner year surprise encounter fine author capture gay experience time take day hearing much hear work soda jerk high school day much thanks friend bring excellent attention era applies gay men hide everything survive seem highly accurate extremely well romance love story involve much involve ambition work corridor absolutely interest author take theme drowned political history loose completely real fictitious pepper page great slice archive insert hearing conversation commentary lend tale relevance skip page page fail many front describe complete waste time only american history major likely aware first spark affair demonstration worker call day lead widespread persecution men usually perceive anarchist year later wave anarchist bombing wake induce recruit name deport hundred anarchists assort leftist clock forward nearly thirty year frenzy following rise crescendo histrionic hearing preside skillfully recreate mood prevail place fictional character solidly research historic third appreciate tour force fullest age north lot old home week fill reference federal official celebrity signature event born year old decade end safe assume great deal read research recreate flavor well know collaborator well knuckle tactic targeted anyone leave center include outspoken liberal progressive unaffiliated socialist anyone resist place frequently lose job result official personality receive great deal attention also teachers administrator campus country employee private company well le well know gay men drive job security risk presumably vulnerable blackmail lesbians also target unclear context gay story personal knowledge answer question year darkest period american gay love story set background deftly weave together theme rise fall love men senior government official irony perhaps double entente title result central character unconventional path author thomas author nonfiction novel well numerous magazine article critical essay review previously review recent novel final year administration outstanding work political fiction mesmerize accurate description worthy hour uninterrupted read so beautifully capture rivet time american history midst young man awaken journey thru love loss study time person probe depth incrementally deeper deeper depth empathy masterful work fail many story dysfunctional people know read dysfunctional family realize dislike really directed towards dysfunctional people exception thoroughly dis likable excuse human character passive make mistake point wish upside head difficult least anything close empathy character plain emotionally age well take place era basically gay main character almost lifelong obsession seducer certainly aware difficult thing gay people period many period matter start week gay marriage decision make seem much like absorb people involve rather incident realize even read someone bear later much people involve therefore much pleasure perhaps someone age live subsequent event lead resignation suffers precisely malady everything know event people involve hearing many characterization lose really mind political lose tug make aspect weaker give star storytelling prose mean perfection engage heartbreaking problem end spoiler end reveal first page heartbreak much however gloomy pessimistic realistic plot turn period conclusion leave triumphant pathetically make suffer wither die catharsis brilliant plot mystify chose stick knife depress unsatisfying way stumble work accident store saw recent release thought thumb love recommend also fact love much buy several work include write style bring history life way historical novelist hooked start several time sit gather thought feeling realize reader character gay man work government sure anyone interest government politics history deeply connect character take day finishing time quickly pass copy friend", "genres": ["Fiction & Literature", "LGBT", "Historical Fiction", "Politics"], "summary": "It's 1950s Washington, D.C.: a world of bare-knuckled ideology and secret dossiers, dominated by personalities like Richard Nixon, Lyndon Johnson, and Joe McCarthy. Enter Timothy Laughlin, a recent college graduate and devout Catholic eager to join the crusade against Communism. An encounter with a handsome State Department official, Hawkins Fuller, leads to Tim's first job and, after Fuller's advances, his first love affair. \r\n\r\nAs McCarthy mounts a desperate bid for power and internal investigations focus on “sexual subversives” in the government, Tim and Fuller find it ever more dangerous to navigate their double lives. \r\n\r\nMoving between the diplomatic world of Foggy Bottom and NATO's front line in Europe, Fellow Travelers is a searing historical novel infused with political drama, unexpected humor, and genuine heartbreak.", "asin": "0307388905", "rank": "454994", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51JU1XJ33DL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}