{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": -12.9822499, "ratings": {"num_ratings": 47, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "...Once you get past the first chapter. I enjoyed the overarching story line and sub-themes throughout the story. I was not familiar with Jorge Amado prior to reading this book, but I now look forward to reading more of his work."}, {"review_sentiment": 2.0, "review_text": "Looks like I'm the lowest review on here so far.  Well, I've been to Ilheus, Brazil (where the story takes place) twice and thought I'd enjoy the book even more than the average person, as I could envision the location.  I just didn't get this story.  I didn't care for the characters, the events in the town; nothing about the story grabbed my interest.  I asked 2 Brazilian friends about why the book is considered one of the best Brazilian novels. They both said they started the book and couldn't finish it.  They said it's important from a historical perspective on Brazil.  I'm surprised myself I found nothing to like in this story.  I'm open minded and find something of value in virtually everything, but it looks like there's a first time for everything.  I gave it 2 stars instead of 1 because it is clear the author worked hard in writing it.  As others suggested, he keeps many stories going. Unfortunately, I didn't care for any of them.  I think a 1 star is for when the author is lazy and the book is badly written.  In this case, it's well written, Amado clearly worked his butt off on the story, but (maybe me and my 2 friends are weird) I found staring out my window more interesting than this simple-minded story of small town life in Brazil."}, {"review_sentiment": 5.0, "review_text": "One of the best writers of Brazil, every character of this book is a magic description of a human being,"}, {"review_sentiment": 5.0, "review_text": "This book is unreal!!!"}, {"review_sentiment": 3.0, "review_text": "I have mixed feelings about the book.  The author's use of language in describing the great city of Illeus, the characters, their lifestyles, and definitely how Armado writes about human emotions such as love, and  jealousy, could not be beat!  The political plot of the book was good but the love story between Gabriella and Nacib were my favorite chapters to read in the book.  Even when Armado would just write about Gabriella it gave life again to the story and renewed interest in the book for me.  In my opinion though some of the chapters were incredibly difficult to get through.  On one hand I appreciated the character development as all of the characters involved were written with depth that made them feel real.  Armando even tells us about their pasts and how they came to live in Illeus.  On the other hand I kept mixing up the characters and their individual situation.  Also some of the chapters just didn't have enough movement for me and were redundant.  A great read but I probably would not read again."}, {"review_sentiment": 5.0, "review_text": "Great book! I enjoy this author very much!"}, {"review_sentiment": 5.0, "review_text": "I found this story very entertaining. Amado developes several story lines at once. The reviewer who called iGabriel Clove and Cinnamon a romp is entirely correct. It is fun. I was an active librarian for 28 years and a reader all my life. My question is why didn't I come across this marvelous novel before this.? A fine romance.Junia Johns"}, {"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 5.0, "review_text": "Masterful storytelling!"}, {"review_sentiment": 5.0, "review_text": "Very good"}]}, "authors": ["Jorge Amado"], "isbn": "0307276651", "longitude": -38.4812772, "periods": ["1900s"], "title": "Gabriela, Clove and Cinnamon", "word_cloud": "once first chapter enjoy overarch story line story familiar prior read look forward read work look lowest review far well story take place twice think enjoy even average person location get story care character event town nothing story grab interest ask brazilian friend consider best brazilian novel say start say important historical perspective surprise find nothing story open mind find something value virtually everything look first time everything give star instead clear author work hard writing others suggest keep many story go unfortunately care think star author lazy badly write case well write clearly work butt story maybe friends weird find star window interest story small town life best writer character magic description human unreal mix feeling author use language describe great city character lifestyles definitely write human emotion love jealousy political plot good love story favorite chapter even give life story renew interest opinion chapter incredibly difficult hand appreciate character development character involve write depth make feel real even tell past come live hand keep mix character individual situation also chapters enough movement great probably enjoy author much find story entertain develop several story line reviewer call gabriel romp entirely correct fun active librarian year life question come marvelous fine excellent masterful storytelling very good", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Ilhéus in 1925 is a booming town with a record cacao crop and aspirations for progress, but the traditional ways prevail. When Colonel Mendonça discovers his wife in bed with a lover, he shoots and kills them both. Political contests, too, can be settled by gunshot...\r\n\r\nNo one imagines that a bedraggled migrant worker who turns up in town–least of all Gabriela herself–will be the agent of change. Nacib Saad has just lost the cook at his popular café and in desperation hires Gabriela. To his surprise she turns out to be a great beauty as well as a wonderful cook and an enchanting boon to his business. But what would people say if Nacib were to marry her?\r\n\r\nLusty, satirical and full of intrigue, Gabriela, Clove and Cinnamon is a vastly entertaining panorama of small town Brazilian life.", "asin": "0307276651", "rank": "410610", "city": "Salvador", "image": "https://images-na.ssl-images-amazon.com/images/I/41pgVnL1e1L.jpg", "country": "Brazil", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}