{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 13, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "Good read."}, {"review_sentiment": 4.0, "review_text": "The story is beautifully written...a lilting voice telling a story.  The story is heart-breaking - raw and bittersweet, telling of a place and time where expectations and \"happiness\" a defined differently  At one point, the path of the story is so sad, seemed so prophetic that I wanted to quit...but I couldn't, really.  The end has it's twists...several.  Overall, it provokes the soul.  Give it a read."}, {"review_sentiment": 3.0, "review_text": "it was okay.  and I lent it to a friend.  She thought it was okay too.  I was hoping for more than boiler plate back woods girl being taken advantage of.  Oh well."}, {"review_sentiment": 5.0, "review_text": "This writer knows whereof she writes. This is a delightful read, and a fitting follow-up to her equally enjoyable earlier novel \"Black Rock\"."}, {"review_sentiment": 3.0, "review_text": "This novel is an interesting take on an unfortunate situation. Smyth gets the story right but misses an opportunity to truly capture Trinidadian voice or dialect. Because of the lack of local dialect, this story is ambiguous enough to have taken place anywhere. Also, this novel replays the master-slave relationship that portrays these women as completely powerless as if they all were. Smyth doesn't`t focus enough on the fact that Celia is a sexual abuse victim, which is why it is so easy for Dr. Rodriguez to manipulate her.Despite these issues, this is still a good read."}, {"review_sentiment": 5.0, "review_text": "very evocative. best book i'd read in a long time.  Amanda Smyth did a great job bringing the characters to life."}, {"review_sentiment": 3.0, "review_text": "I hate to say it because I was really looking forward to this book, but it inspired nothing in me. I kept reading because it was there not because I couldn't stop. Its a beautiful book in terms of atmosphere, maybe even too beautiful since the scenery seems to dominate instead of the characters. Emotions are bland and motivations are unclear and I felt no empathy for the main character because her experiences seemed to be a catalogue of West Indian literary experiences.  I would compare it to Jamaica Kincaid's work without any of the power or feeling.My other major complaint is that the book reads like a bit of a travel log. Again it seems the author is ticking off a list of all of the \"must-see\" places in Trinidad and Tobago. We go from Black Rock, to the black urban Port-of-Spain, to the wealthier white suburbs, the savannah, down the islands, the rural country... The constant change of scene gives the author a lot to work with, but takes away from any cohesion in the story. In each location its like we're reading about different characters because they don't blend. And by the end of the book I had the feeling that the author really did have a check list of things she felt had to be included to make this novel \"definitive\" West Indian literature.This book has too much and too little all at once. I can't fault the style of writing, its very readable. But that doesn't make it a good story. This book should have been great, but instead I found it to be a dreary catalogue of places and events that at the end of the day I really didn't care about."}, {"review_sentiment": 4.0, "review_text": "As a citizen of Trinidad and Tobago, I had a great time reading this novel. The author got a lot of the details right in her book, the food, the descriptions, the atmosphere of the islands at that time.This book was a page turner for me and I was caught up in the story from beginning to end."}, {"review_sentiment": 4.0, "review_text": "I typically read books 5 pages at a time, but I literally read this one in 2 days! I hope the author writes more books."}, {"review_sentiment": 3.0, "review_text": "I have to say that I was surprised that I liked this book.  This is a very atmospheric novel; I feel as though I was part of the story--I could see taste and smell everything that was going on.  The plot was actually quite thin, but I kept reading because I was captivated by the tropical setting of Trinidad/Tobogo.  The plot centers around a young, very smart, very beautiful girl named Celia.  She has never known her parents--was raised by her aunt Tassi whom she dearly loves and her uncle Roman who she greatly fears.  A brutal act of violence forces Celia from the only home she has ever known.  She befriends a man named William who takes het to heart and helps her find a job caring for a doctor's children.  At this point I kept reading because I cared about her relationship with the doctor and his wife, Helen.  I wanted more for Celia, but it really seemed as though she found peace at home with the doctor's family.The fact that the author, Amanda Smyth knows her setting well and loves her characters really comes across well to the reader.  For that reason I would recommend this book.  I feel I should also mention that this is the first book I read on my Kindle.  It's very easy to read from even in the bright sunlight.  I love the Kindle!"}]}, "authors": ["Amanda Smyth"], "isbn": "0307460649", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Lime Tree Can't Bear Orange: A Novel", "word_cloud": "good story beautifully write lilting voice tell story story raw bittersweet tell place time expectation happiness define differently point path story sad seem prophetic want quit really end twist several provokes soul okay lend friend think okay hop boiler plate back wood girl take advantage well writer know whereof write delightful fitting equally enjoyable earlier interesting unfortunate situation get story right miss opportunity truly capture trinidadian voice dialect lack local dialect story ambiguous enough take place anywhere also replay relationship portrays woman completely powerless focus enough fact sexual abuse victim easy manipulate issue still good evocative best long time great job bring character life hate say really look forward inspire nothing keep read beautiful term atmosphere maybe even beautiful scenery seem dominate instead character emotion bland motivation unclear felt empathy main character experience seem catalogue indian literary experience work power major complaint read bit travel log seem author tick list place go black urban wealthier white suburb savannah island rural country constant change scene give author lot work take away cohesion story location read different character blend end feel author really list thing felt included make definitive indian much little style write readable good story great instead find dreary catalogue place event end day really citizen great time read author get lot detail right food description atmosphere islands page turner catch story begin end typically page time literally day hope author writes say surprise like atmospheric feel part story taste everything go plot actually quite thin keep read captivate tropical set plot center young smart beautiful girl name never know parent raise aunt dearly love uncle greatly fear brutal act violence force home ever know befriend man name take get heart help job care doctor child point keep read care relationship doctor wife want really seem found peace home doctor fact author know set well love character really come well reason feel also mention first kindle easy even bright sunlight love", "genres": ["Fiction & Literature"], "summary": "Men will want you like they want a glass of rum…One man will love you. But you won’t love him. You will destroy his life. The one you love will break your heart in two.\r\n\r\nSo says the soothsayer, when predicting young Celia’s future. Raised in the tropics of Tobago by an aunt she loves and an uncle she fears, Celia has never felt that she belonged. When her uncle–a man the neighbors call Allah because he thinks himself mightier than God–does something unforgivable, Celia escapes to the bustling capital city.\r\n\r\nThere she quickly embraces her burgeoning independence, but her search for a place to call home is soon complicated by an affectionate friendship with William, a thoughtful gardener, and a strong sexual tension with her employer. All too quickly, Celia finds herself fulfilling the soothsayer’s predictions and living a life of tangled desperation–trapped between the man who offers her passion and the one who offers his heart.\r\n\r\n“Smyth writes entrancingly on tropical heat and light, indolence, vengeance and desire.” The Guardian", "asin": "B002DBIODO", "rank": "1109806", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/51qtiUVea4L.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}