{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 93, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I found it hard to believe that the main character were purely fiction and today's  headlines seem to echo in todays storries."}, {"review_sentiment": 4.0, "review_text": "I enjoy Lynch's style and this book did not disappoint. I will recommend it to friends, and read more by him."}, {"review_sentiment": 4.0, "review_text": "Loved the history of Seattle.  Since I am a transplant to Seattle it was very interesting to know some new facts about the Space Needle."}, {"review_sentiment": 3.0, "review_text": "Having lived in Pioneer Square for many years I found the story line nice as I knew many of the locations mentioned and the streets involved. I enjoyed the historical story line about the 1962 world's fair and what it took to get it launched.  I was not aware of the city corruption levels that existed at the time so that was very illuminating. I wish the lead characters were a bit younger and felt some of  the emphasis on old age facilities to be more dated rather than many of the current level of options available to seniors today.  Actually the back story was more interesting than the present day story."}, {"review_sentiment": 5.0, "review_text": "As a Seattle Native, it was great to read Truth Like the Sun."}, {"review_sentiment": 1.0, "review_text": "I have lived in Seattle since 1964 and was totally disappointed with this book which was frankly boring.  If you are interested in fiction about Seattle try J J Jance's books which capture the essence of the city with an entertaining plot.."}, {"review_sentiment": 4.0, "review_text": "enjoyable quick read"}, {"review_sentiment": 4.0, "review_text": "Lots of the Seattle that i know made this enjoyable. Interested in more about the city and other titles by this author."}, {"review_sentiment": 3.0, "review_text": "one of our book club books.  i could only wade through about 1/3 of it before starting to look for something more interesting to read."}, {"review_sentiment": 4.0, "review_text": "With characters that are truly flushed out and using the juxposition of 1962 against 2001, \"Truth\" easily blankets the reader. Simple acts are exquisitely written with great attention to the smallest detail. I found myself stopping and rereading sentences or paragraphs because of the way they were constructed. If you enjoy well written fiction with believable, three dimensional characters, you will not be disappointed."}]}, "authors": ["Jim Lynch"], "isbn": "0307949346", "longitude": -122.3300624, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Truth Like the Sun", "word_cloud": "find hard believe main character purely fiction today headline seem echo today story enjoy style disappoint recommend friend love history transplant seattle interest know new fact have live many year find story line nice know many location mention street involve enjoy historical story line world fair take get launch aware city corruption level exist time illuminate wish lead character bit younger felt emphasis old age facility date rather many current level option available senior today back story interesting present day story great live totally disappointed frankly bore interested fiction try capture essence city entertaining enjoyable quick know make enjoyable interested city title author club start something interesting character truly flush use juxtaposition easily blanket simple act exquisitely write great attention smallest detail find stop reread sentence paragraph way construct enjoy well write fiction believable dimensional character disappoint", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "A classic and hugely entertaining political novel, the cat-and-mouse story of urban intrigue in Seattle both in 1962, when Seattle hosted the World's Fair, and in 2001, after its transformation in the Microsoft gold rush.\r\n\r\nLarger than life, Roger Morgan was the mastermind behind the fair that made the city famous and is still a backstage power forty years later, when at the age of seventy he runs for mayor in hopes of restoring all of Seattle's former glory. Helen Gulanos, a reporter every bit as eager to make her mark, sees her assignment to investigate the events of 1962 become front-page news with Morgan's candidacy, and resolves to find out who he really is and where his power comes from: in 1962, a brash and excitable young promoter, greeting everyone from Elvis Presley to Lyndon Johnson, smooth-talking himself out of difficult situations, dipping in and out of secret card games; now, a beloved public figure with, it turns out, still-plentiful secrets. \r\n\r\nWonderfully interwoven into this tale of the city of dreams are backroom deals, idealism and pragmatism, the best and worst ambitions, and all the aspirations that shape our communities and our lives.\r\n\r\n“A flat-out great read with the spirit of a propulsive, character-driven 1970s movie…. Mr. Lynch pairs unlikely antagonists: an old-school political fixer blessed with immense charm, and an overeager newspaperwoman whose research, done in 2001, has the power to destroy him. They never behave predictably, and their showdown lingers long after Mr. Lynch’s story is over.” The New York Times", "asin": "0307949346", "rank": "559219", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/51COWmn2p7L.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}