{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 35, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "The novel prize-winner maintains his standards. A real feel of modern Istanbul."}, {"review_sentiment": 2.0, "review_text": "A confusing book. Quite depressing. Hard to follow characters. Each paragraph spoken by a different character. Little resolution at end."}, {"review_sentiment": 5.0, "review_text": "Awesome"}, {"review_sentiment": 3.0, "review_text": "Very detailed and hard to follow but very interesting history about Turkey. Lots of characters to try to keep up with in the story."}, {"review_sentiment": 5.0, "review_text": "A wonderful story. A lot to learn."}, {"review_sentiment": 3.0, "review_text": "We follow a Turkish family during the last 50-60 years. A slow story giving us glimpse to help us better understand the Turkish mind and way of thinking.Too many thoughts and too little action makes it a bit boring..."}, {"review_sentiment": 4.0, "review_text": "Good copy.  Very interesting novel. I enjoyed it."}, {"review_sentiment": 5.0, "review_text": "Tremendously compassionate and beautifully written.  Like Elena Ferrante in her Neopolitan novels, Pamuk takes us into a very particular place (Istanbul) as it experiences modernization, through the experience of characters who are \"ordinary\" and yet tremendously compelling as individuals.  He structures the text by alternating third person narration with sections that directly convey the voice/thoughts of the characters."}, {"review_sentiment": 5.0, "review_text": "I have to say, it took me some time to get through the first 150 pages. When I was in Turkey recently, I had no other distractions and plowed through the rest of the book in four days. I see some didn't like the structure - I can see that, but it's quite unique and really makes it feel like a true story. Many times during the book I paused to ask my Turkish husband about certain aspects and he corroborated what was written, making it even more enjoyable. Since it's long and the book was heavy, I left it at the airport...hopefully someone picked it up and will enjoy it as much as I."}, {"review_sentiment": 5.0, "review_text": "I read anything Orhan Pamuk writes. I like his style, I like him, I love the insight and history he gives of Istanbul."}]}, "authors": ["Orhan Pamuk"], "isbn": "0307744841", "longitude": 28.9651646, "periods": ["2000s", "Recent Releases"], "title": "A Strangeness in My Mind", "word_cloud": "maintains standard real feel modern confusing depress follow character paragraph speak different character resolution end very detailed hard follow interest history character try story wonderful story lot learn follow turkish family last year slow story give glimpse help better understand turkish way many thought little action make bit boring good copy interesting enjoy tremendously compassionate beautifully write novel take particular place experience modernization experience character ordinary yet tremendously compelling individual structure text alternate third person narration section directly convey character say take time get first page turkey recently distractions plow day see structure see quite unique really make feel true story time pause ask turkish husband certain aspect corroborate write make even enjoyable long heavy leave airport hopefully someone pick enjoy much anything write style like love insight history give", "genres": ["Fiction & Literature"], "summary": "Arriving in Istanbul as a boy, Mevlut Karataş is enthralled by both the old city that is disappearing and the new one that is fast being built. He becomes a street vendor, like his father, hoping to strike it rich, but luck never seems to be on Mevlut’s side. He spends three years writing love letters to a girl he has seen just once, only to elope by mistake with her sister. \r\n\r\nAlthough he grows to cherish his wife and the family they have together, Mevlut stumbles toward middle age as everyone around him seems to be reaping the benefits of a rapidly modernizing Turkey. \r\n\r\nTold through the eyes of a diverse cast of characters, in A Strangeness in My Mind Nobel-prize-winning author Orhan Pamuk paints a brilliant tableau of life among the newcomers who have changed the face of Istanbul over the past fifty years.\r\n\r\n“An unconventional love story. . . . A hymn to life’s physical and mental chaos.” The New York Times\r\n", "asin": "0307744841", "rank": "92015", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51zc7vM4E0L.jpg", "country": "Turkey", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}