{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 29, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Great reading. A clear demonstration of the struggles of the extreme poor. Though it is set in Mexico it's probably similar in many other cultures, even here in the USA."}, {"review_sentiment": 5.0, "review_text": "What is poverty? This classic book which consists of verbatim transcripts of the Sanchez family tells the story in compelling, riveting human terms. What's it like to have a father who lashes out at his children one minute, supports them in the next? To have a single room shared by extended family, with people sleeping on the floor, on makeshift beds, sometimes standing up for each other, more often fighting for space and for place. In the literature of poverty (a large and expanding reading list) this book is a must-read--and must-share."}, {"review_sentiment": 5.0, "review_text": "Wow, This is a great book!  Definitely one of the first in-depth research and analysis about poverty and its affect of the people living in this life!  This can be compared to many Americans living in our urban area, today!"}, {"review_sentiment": 5.0, "review_text": "Very enjoyable reading"}, {"review_sentiment": 5.0, "review_text": "Happy, as expected."}, {"review_sentiment": 3.0, "review_text": "I've traveled and walked streets past homes of questionable comfort.  This book invites you inside.  You listen to each family member tell their side of the story of living in poverty.  It's powerful, repetitious, frustrating, sad, helpless, maddening....all rolled into one."}, {"review_sentiment": 5.0, "review_text": "Wonderful"}, {"review_sentiment": 5.0, "review_text": "This is one of the classics in sociology.  I first read it in the early sixties and was inspired.  I am so glad to have it back in my library."}, {"review_sentiment": 1.0, "review_text": "The book literally fell apart when I started reading it. Such an old book that the glue had dried up and the pages fell out."}, {"review_sentiment": 4.0, "review_text": "I ordered this book for my Mom.  She loved it!!!  She had read other books by Oscar Lewis and wanted some more."}]}, "authors": ["Oscar Lewis"], "isbn": "0307744531", "longitude": -99.1333416, "periods": ["1900s"], "title": "The Children of Sanchez: Autobiography of a Mexican Family", "word_cloud": "read clear demonstration struggle extreme poor set probably similar many culture even poverty classic consist verbatim transcript tell story compel rivet human term father lash minute support next single room share extended people sleep floor makeshift bed sometimes stand often fight space place literature poverty large expand reading list great first research analysis poverty affect people live life compare many live urban area today very enjoyable reading happy expect travel walked street past home questionable comfort invite listen member side story live poverty powerful repetitious frustrate sad helpless madden roll wonderful classic sociology first early sixty inspire glad back library literally fell apart start read such old glue dry page fell order love want", "genres": ["History", "Social & Cultural Studies", "Politics"], "summary": "A pioneering work from a visionary anthropologist, The Children of Sanchez is hailed around the world as a watershed achievement in the study of poverty—a uniquely intimate investigation, as poignant today as when it was first published.\r\n \r\nIt is the epic story of the Sánchez family, told entirely by its members—Jesus, the 50-year-old patriarch, and his four adult children—as their lives unfold in the Mexico City slum they call home. Weaving together their extraordinary personal narratives, Oscar Lewis creates a sympathetic but ultimately tragic portrait that is at once harrowing and humane, mystifying and moving.\r\n \r\nAn invaluable document, full of verve and pathos, The Children of Sanchez reads like the best of fiction, with the added impact that it is all, undeniably, true.", "asin": "0307744531", "rank": "180794", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51ILVc%2BnewL.jpg", "country": "Mexico", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}