{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 286, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "This book is a great and very entertaining historical survey of the Dutch people and Amsterdam !"}, {"review_sentiment": 5.0, "review_text": "👍"}, {"review_sentiment": 5.0, "review_text": "Well written"}, {"review_sentiment": 2.0, "review_text": "I haven’t finished it because it’s pretty dull and I’m having trouble getting back to it.  If I change my mind when I’ve finished it I’ll revise my review."}, {"review_sentiment": 5.0, "review_text": "Great book. Very well written. So interesting!"}, {"review_sentiment": 5.0, "review_text": "I was in vacation in Amsterdam and on airport I bought this ebook. It was fascinating, well written and csptivsting."}, {"review_sentiment": 4.0, "review_text": "Very good summary of the Amsterdam and Holland history. Really much more that the title suggests."}, {"review_sentiment": 4.0, "review_text": "I found this a fun book with some fascinating stories about the history of the Netherlands in general and Amsterdam in particular.  My Dutch friends who are readers say, “It’s not got it quite right” (one of them gave me Geert Mak’s book to read after this one), but there’s enough thought-provoking insights and fascinating stories here to make it very worthwhile.  The analysis sections seem a bit too simplistic, and perhaps biased by an American’s perspective.  But if you are looking for an enjoyable book to read and are able to take the analysis offered as one voice among some wiser ones, you’ll both learn about this tiny nation and its huge significance, and you’ll enjoy the telling along the way."}, {"review_sentiment": 1.0, "review_text": "huh?"}, {"review_sentiment": 4.0, "review_text": "Russell Shorto compiled very nice and readable history of Amsterdam, from the early 1300s to modern days. He explores how Amsterdam became one of the World's Most Liberal City, and how it spread this influence, especially in the United States. People of Amsterdam (and most of Holland) gained the land from the sea, not received it from higher authorities, and thus feudalism system never managed to root here. Water management required cooperation, which result in a very interesting combination of individualism and communitarism. While Protestant ethics opened the way to getting rich, community always discouraged excessive show off, and the city never ghettoized. Author praise Amsterdam tolerance, in its very specific and pragmatic form.I find most interesting chapters covering late 19th-early 20th century history, and one covering 1960s to modern days. It is interesting to see how Holland managed to find the third way, without going to full fledged revolution, and without allowing unchecked capitalism reign. The later, tells interesting story of counter-culture movement and complexity of politics in modern days Amsterdam."}]}, "authors": ["Russell Shorto"], "isbn": "0307743756", "longitude": 4.8936041, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s"], "title": "Amsterdam: A History of the World's Most Liberal City", "word_cloud": "great entertaining historical survey people well write finish pretty dull trouble get back change mind finish revise review great very well write so interesting vacation airport buy fascinate well write csptivsting very good summary really much title suggest find fun fascinate story general particular friends reader say get quite right give enough insight fascinate story make analysis section seem bit simplistic perhaps bias american perspective look enjoyable able take analysis offer voice wiser one learn tiny nation huge significance enjoy tell way huh compile nice readable early modern day explore become spread influence especially gain land sea receive higher authority thus feudalism system never manage root management require cooperation result interest combination individualism communitarism protestant ethic open way get rich community always discourage excessive show never ghettoize praise tolerance specific pragmatic find interesting chapter cover late century cover modern day interest see manage third way go full fledge revolution allow unchecked capitalism reign later tell interest story movement complexity politics modern day amsterdam", "genres": ["History"], "summary": "An endlessly entertaining portrait of the city of Amsterdam and the ideas that make it unique, by the author of the acclaimed Island at the Center of the World\r\n\r\nTourists know Amsterdam as a picturesque city of low-slung brick houses lining tidy canals; student travelers know it for its legal brothels and hash bars; art lovers know it for Rembrandt's glorious portraits.\r\n\r\nBut the deeper history of Amsterdam, what makes it one of the most fascinating places on earth, is bound up in its unique geography-the constant battle of its citizens to keep the sea at bay and the democratic philosophy that this enduring struggle fostered. Amsterdam is the font of liberalism, in both its senses. Tolerance for free thinking and free love make it a place where, in the words of one of its mayors, \"craziness is a value.\" But the city also fostered the deeper meaning of liberalism, one that profoundly influenced America: political and economic freedom. Amsterdam was home not only to religious dissidents and radical thinkers but to the world's first great global corporation.\r\n\r\nIn this effortlessly erudite account, Russell Shorto traces the idiosyncratic evolution of Amsterdam, showing how such disparate elements as herring anatomy, naked Anabaptists parading through the streets, and an intimate gathering in a sixteenth-century wine-tasting room had a profound effect on Dutch-and world-history. Weaving in his own experiences of his adopted home, Shorto provides an ever-surprising, intellectually engaging story of Amsterdam.\r\n\r\n“Rich and eventful. . . . [A] book that easily fuses large cultural trends with intimately personal stories.” The New York Times", "asin": "0307743756", "rank": "39666", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/51EynY8ZnvL.jpg", "country": "The Netherlands", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}