{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 58, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "The author writes with intensity and emotion conveying the love of his family and his country and the heartache of the dissolution of both."}, {"review_sentiment": 4.0, "review_text": "excellent read"}, {"review_sentiment": 5.0, "review_text": "Very revealing, personal narrative of a family from WWII through time....if you ever wondered what the people of Vietnam have gone through and we were doing over there, this is the book that will humanize it all for you. My son in college has a roommate from Vietnam (very friendly, smart, studious boy), and I wanted to understand Vietnam culture on a deeper level. This book did it for me, in a very detailed, understandable, and respectful way."}, {"review_sentiment": 4.0, "review_text": "Well-written."}, {"review_sentiment": 5.0, "review_text": "The Eaves of Heaven is all of these and more.It is a wonderful book.I have loved Vietnam, the Mekong, Hanoi -- the Vietnamese.And this fine book has helped me see it and themIn a way I had not.Read it.You will love it."}, {"review_sentiment": 5.0, "review_text": "Before embarking on a trip to Vietnam, my husband and I read a number of books on Vietnam.  We disgree with each other about the American involvement in the Vietnam war, but we both agreed that this book was the most enlightening on the Vietnamese experience from the period from the thirties to the end of the American War and a few years after.  Andrew Pham writes in the first person as his father in telling his compelling story.  In the process one sees the life and history as it unfolds during his father's life.  It was a work of literature and very absorbing to read.  Just wonderful - my husband's book group is now reading it."}, {"review_sentiment": 5.0, "review_text": "Another excellent, well written book by Andrew X. Pham which follows Mr. Pham's award winning \" Catfish and Mandala \". I recommend both of these."}, {"review_sentiment": 5.0, "review_text": "The history of Vietnam through the French and American wars is told through the eyes of the author's father. A good read that is well-written."}, {"review_sentiment": 5.0, "review_text": "Good book, very insightful"}, {"review_sentiment": 5.0, "review_text": "In \"The Eaves of Heaven\" Andrew Pham has given me as an American who lived through the Vietnam War, a window into the lives of the Vietnamese people who start out as privileged and educated with every expectation that they would grow up comfortably well off.  As their country of invaded bt the French. Japanese, Chinese, and Americans, they move from North to South and back to the North again trying to get the best for themselves possible, while their country is being ravaged and looted by one invader after another.  Our hero learns to live with reduced expectations and in a humble manner -- a far cry from the power and luxury of his parents.  He does survive but loses almost everything of value bt the time the Americans evacuate.  This is an excellent introduction to the history of the Vietnam War, a subject still avoided in many public schools.  It is well worth the time and modest cost to read it."}]}, "authors": ["Andrew X. Pham"], "isbn": "030738120X", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "The Eaves of Heaven: A Life in Three Wars", "word_cloud": "author write intensity emotion convey family country heartache dissolution excellent very reveal personal narrative family time ever wonder people go son college roommate friendly smart studious boy want understand culture deeper level detailed understandable respectful way wonderful love fine help them in way love embark trip husband number disagree american involvement war agree enlighten vietnamese experience period thirty end american year write first person father tell compel story process see history unfold father work literature absorb wonderful husband group read excellent well write follow award win catfish recommend history french tell eye author father good good insightful give live window live vietnamese people start privilege educate expectation comfortably well country invade tb french japanese chinese move back try get best possible country ravage looted invader hero learn live reduce expectation humble manner far cry power luxury parent survive lose almost everything value tb time evacuate excellent introduction history subject still avoid many public school well worth time modest cost", "genres": ["Memoir", "History"], "summary": "From Andrew X. Pham, the award-winning author of Catfish and Mandala, a son’s searing memoir of his Vietnamese father’s experiences over the course of three wars.\r\n\r\nThe Philadelphia Inquirer hailed Andrew Pham’s debut, Catfish and Mandala: A Two-Wheeled Voyage Through the Landscape and Memory of Vietnam, for evoking “the full sadness of the human condition . . . marveling at spiritual resilience amid irreconcilable facts.” The New York Times Book Review called it, simply, “remarkable.” Now, in The Eaves of Heaven, Pham gives voice to his father’s unique experience in an unforgettable story of war and remembrance. \r\n\r\nOnce wealthy landowners, Thong Van Pham’s family was shattered by the tumultuous events of the twentieth century: the festering French occupation of Indochina, the Japanese invasion during World War II, and the Vietnam War.\r\n\r\nTold in dazzling chapters that alternate between events in the past and those closer to the present, The Eaves of Heaven brilliantly re-creates the trials of everyday life in Vietnam as endured by one man, from the fall of Hanoi and the collapse of French colonialism to the frenzied evacuation of Saigon. \r\n\r\nPham offers a rare portal into a lost world as he chronicles Thong Van Pham’s heartbreaks, triumphs, and bizarre reversals of fortune, whether as a South Vietnamese soldier pinned down by enemy fire, a prisoner of the North Vietnamese under brutal interrogation, or a refugee desperately trying to escape Vietnam after the last American helicopter has abandoned Saigon. \r\n\r\nThis is the story of a man caught in the maelstrom of twentieth-century politics, a gripping memoir told with the urgency of a wartime dispatch by a writer of surpassing talent.", "asin": "030738120X", "rank": "296840", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51I4sceuslL.jpg", "country": "Hanoi", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}