{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -37.8142176, "ratings": {"num_ratings": 631, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "A very real look a one possible end of the world as we know it.  There are a couple movies as well."}, {"review_sentiment": 5.0, "review_text": "This book had me hooked from the first page.  I could hardly put it down.  It's one of the best ordinary-people-in-extraordinary-circumstances that I've ever read.  Outstanding writing and a great story."}, {"review_sentiment": 3.0, "review_text": "Interesting read,I felt the book would have been great if it was longer and the characters were able to develop more."}, {"review_sentiment": 4.0, "review_text": "Good read. Being young during the late 50's and 60's , having fear of Nuclear War, it was a good reminder how WISE men avoided the \"dogs of war\".  With that and the current situation in the world I think it should be required reading for this generation of leaders who act as if they \"have no fear\"!!!!!"}, {"review_sentiment": 5.0, "review_text": "Saw the movie all those years ago. Now I Know the story and all that was left out of the movie."}, {"review_sentiment": 3.0, "review_text": "This is a case where the movie (Stanley Kramer's) was much better than the book. The characters in the movie were better developed and brilliantly acted.  If you were looking for a more expanded version of the story, the book version was very disappointing,. The book is not bad, after all, Nevil  Shute did some great work. I like Stanley Kramer's movies and this one is a master piece. The book, by comparison is interesting, but not compelling. The movie celebrates a beautiful romantic love story in the middle of a worldwide catastrophe and some measure of human redemption. The book, on the other hand, is simply dark (Get the movie)....."}, {"review_sentiment": 5.0, "review_text": "Excellent portrayal of the emotions, viewed through the eyes of the characters, facing the horror and results of  a world devastated by nuclear war. A very scary book."}, {"review_sentiment": 5.0, "review_text": "A now dated but still poignant description of the civilized, though self-inflicted, demise of humanity.  Mad Max or anyone like that  is never mentioned."}, {"review_sentiment": 5.0, "review_text": "This is a fascinating novel that is explicitly of nuclear war."}, {"review_sentiment": 4.0, "review_text": "Relevant today, as it was when written in the 1950s.  The writing style did not speak to me, but the plot line kept me reading."}]}, "authors": ["Nevil Shute"], "isbn": "0307473996", "longitude": 144.9631608, "periods": ["1900s"], "title": "On the Beach", "word_cloud": "real look possible end world know couple movie well hook first page hardly best ever outstanding write great story interest felt great longer character able good young late fear good reminder men avoid dog war current situation world think required reading generation leader act fear movie year ago now know story leave movie case movie much better character movie better develop brilliantly act look expand version story version disappoint bad great work like movie master piece comparison interest compel movie celebrate beautiful romantic love story middle worldwide catastrophe measure human redemption hand simply dark movie excellent portrayal emotion view eye character face horror result world devastate nuclear war scary date still poignant description civilize demise humanity anyone never mention fascinate explicitly nuclear war relevant today write write style speak plot line keep reading", "genres": ["Fiction & Literature", "Science Fiction", "Cold War"], "summary": "Nevil Shute’s most powerful novel—a bestseller for decades after its 1957 publication—is an unforgettable vision of a post-apocalyptic world.\r\n\r\nAfter a nuclear World War III has destroyed most of the globe, the few remaining survivors in southern Australia await the radioactive cloud that is heading their way and bringing certain death to everyone in its path. Among them is an American submarine captain struggling to resist the knowledge that his wife and children in the United States must be dead. Then a faint Morse code signal is picked up, transmitting from somewhere near Seattle, and Captain Towers must lead his submarine crew on a bleak tour of the ruined world in a desperate search for signs of life. \r\n\r\nBoth terrifying and intensely moving, On the Beach is a remarkably convincing portrait of how ordinary people might face the most unimaginable nightmare.\r\n\r\n“The most haunting evocation we have of a world dying of radiation after an atomic war.” The New York Times ", "asin": "0307473996", "rank": "45873", "city": "Melbourne", "image": "https://images-na.ssl-images-amazon.com/images/I/51zglauEpDL.jpg", "country": "Australia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}