{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 37.6267868, "ratings": {"num_ratings": 986, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Beautifully told tale of love and imagination, laced together with the grace of Spanish rhythm and the heat of the Carribean."}, {"review_sentiment": 3.0, "review_text": "Still undecided - was it meant to be comedic?"}, {"review_sentiment": 5.0, "review_text": "Everything perfect"}, {"review_sentiment": 5.0, "review_text": "A decade ago I sat in a lodge overlooking a river in the Venezuelan jungle. A large tree full of chattering parrots provided shelter while I read Love in the Time of Cholera for the first time. This book was on my fourteen year old grandson’s summer reading list!! He and the rest of our group was out climbing a mountain to reach one of the magnificent waterfalls in the area. Although Garcia Marquez is a Noble Prize for Literature, and this book is a masterpiece, anyone who has read this book will question how this book could have been included in a reading list for a teenager.I reread this book as part of a Lifelong Learning course during which we read a large portion of the author’s work. Love in the Time of Cholera is the most enjoyable, readable, of his work. There is also a Good Film that follows the story very closely.Basically, the story is about a Latino man who falls in love. The girl is very haughty, bad-tempered and Beautiful. At first she encourages his attentions, but then inexplicably shuts him out and marries a doctor from a rich, prominent family.. he lives his life, waiting for her husband to die.Some readers may be shocked at the way the author includes detailed accounts of the man’s 57 years of sexual activity with a variety of women, including his young, 13, ward."}, {"review_sentiment": 5.0, "review_text": "The book itself came in great condition. Very happy with that. I love the movie and now that I'm reading the book I fall in love with it even more."}, {"review_sentiment": 2.0, "review_text": "I did not care for this book. The plot was barely passable and I hated the writer's almost complete refusal to use direct quotes in characters' interactions. An important way a reader gets to know the characters of a book is through the way they speak...their grammar, their use of slang, their tendency to speak either bluntly or vaguely. Without direct quotes, the writing felt more like reading someone's diary, with little more than summations of events and conversations.That said, I am wondering about Marquez's book \"100 Years of Solitude.\" Can anyone tell me, did he write it the same way he wrote this?"}, {"review_sentiment": 4.0, "review_text": "good"}, {"review_sentiment": 5.0, "review_text": "Good book!"}, {"review_sentiment": 1.0, "review_text": "Hours of my life I can't get back. This was the book referenced in the movie \"Serendipity\", which I really enjoyed, so I was curious. Unfortunately it's hard for me to give up on a book, so I kept going hoping it would become interesting at some point. I was mistaken. In my opinion it was slow-moving with a dry plot and lack-luster, unlikeable characters. Two thumbs down."}, {"review_sentiment": 2.0, "review_text": "Depressive!"}]}, "authors": ["Gabriel García Márquez"], "isbn": "0307389731", "longitude": -1.0006184, "periods": ["1900s"], "title": "Love in the Time of Cholera", "word_cloud": "beautifully told tale imagination lace together grace spanish rhythm heat still undecided meant comedic everything perfect decade sit lodge overlook river jungle large tree full chatter parrot provide shelter first fourteen year old grandson summer read list rest group climb mountain reach magnificent waterfalls area masterpiece anyone question read list reread part course large portion author work enjoyable readable work also follow story story man fall girl haughty first encourages attention inexplicably shut marries doctor rich prominent live life wait husband reader way author include detailed account man year sexual activity variety woman include young ward come great condition happy movie read fall even care plot barely passable hat writer almost complete refusal use direct quote character interaction important way get know character way speak grammar use slang tendency speak bluntly vaguely direct quote write felt read someone diary little summation event say wonder anyone tell way write good good life back reference movie really enjoy curious unfortunately hard give keep go hop interesting point mistake opinion dry plot unlikable character thumb depressive", "genres": ["Fiction & Literature"], "summary": "\"A love story of astonishing power.\" Newsweek \r\n\r\nIn their youth, Florentino Ariza and Fermina Daza fall passionately in love. When Fermina eventually chooses to marry a wealthy, well-born doctor, Florentino is devastated, but he is a romantic. As he rises in his business career he whiles away the years in 622 affairs--yet he reserves his heart for Fermina. Her husband dies at last, and Florentino purposefully attends the funeral. Fifty years, nine months, and four days after he first declared his love for Fermina, he will do so again.\r\n\r\nThe story occurs mainly in an unnamed port city somewhere near the Caribbean Sea and the Magdalena River. Given that Rafael Núñez is mentioned as the \"author of the national anthem\", the country is likely Colombia. While the city remains unnamed throughout the novel, descriptions and names of places suggest it is based on Cartagena with the addition of the Magdalena River, which meets the sea at the nearby city of Barranquilla.", "asin": "0307389731", "rank": "7519", "city": "Cartagena", "image": "https://images-na.ssl-images-amazon.com/images/I/51GxFpytqiL.jpg", "country": "Spain", "story_arc": ["Tragedy", "Things only get worse"]}