{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 33, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "It took me a while to finish this book, but I'm glad I did as the author is one of my favorites.  It's a psychological investigation of the hows and whys of a one night stand between a married woman and a divorced man and the sudden death of the woman.  The reaction to her death by the man leads to uncovering secrets in his pastThe author's description of both the novel's characters and the surrounding streets, alleyways, etc. made me feel as if I was there. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "This is my fifth Marias novel. All five are out of this world outstanding."}, {"review_sentiment": 5.0, "review_text": "The enormous literary stile and Deep observaciones of human nature. He should be the next Nobel prize. Having been friend of his father, Julián Matías, i feel proud of Javier,s enormous succes. Roberto Marino"}, {"review_sentiment": 5.0, "review_text": "Exquisite writing. Brilliant thriller!"}, {"review_sentiment": 4.0, "review_text": "Very interesting plot and very well written as usual with this great author."}, {"review_sentiment": 4.0, "review_text": "I've read this book because a non-Spanish speaking and a book expert friend of mine asked me if I had read anything about Javier Marias. Considering that I'm a native Spanish speaker I thought I should read one of his books. While I was in Mexico last month I went to a bookstore where a clerk recommended me \"Tomorrow in the Battle\" as the most popular book written by Javier Marias. I should admit that the introduction was very intriguing and that the writer did a good job in keeping me interested  about what happened to Maria and Victor after he left her dead at her bedroom. However very often the writer/protagonist gives too much detail and explains many things that are happening in his mind. I felt that he is not leaving too much for the reader to deduct or interpret, too much telling for my taste.  In some of these long sections I frankly had the impression the  writer was paid by word. It's obvious to me that Javier Marias tries to imitate Marcel Proust with his long paragraphs while lacking the beautiful style of the French writer. This was confirmed to me by a mention that Javier Marias makes of \"in Search of Lost Time\" almost at the end. However, I should admit that I found the twist at the end rewarding and made it worth the time I spent reading it. Because of the ending I changed my rating from 3 to 4.  A final comment, the title appealed to me from the beginning because reminded me of one of my favorite poems by Mexican poet Jaime Torres Bodet that starts with this line \"Tenme presente en medio de la lucha\"."}, {"review_sentiment": 2.0, "review_text": "altho the story basis was intriguing I found the author too digressing for my taste.  I would not but another book by him. I tended to skim the last half.  And probably missed the whole point but could not get past the digression."}, {"review_sentiment": 4.0, "review_text": "Wonderful read just as all other books of this author but sometimes I wish he would be just a tiny bit more focused))). than again, it would then not be Javier Marias."}, {"review_sentiment": 5.0, "review_text": "While I didn't expect to find this interesting, it is very compelling like most Marias novels. I prefer it to All Souls and even The Infatuation (which starts slow and repetitive but gets good about 50 pages in. Marias always has great insights about life, death, and human nature that make all his books rewarding. I like how characters reappear in different novels creating a Marias world. I think Marias does deserve a Nobel. Definitely read after you read A Heart So White (still his best and one of my top 20 books ever)"}, {"review_sentiment": 4.0, "review_text": "Great detailed account of a passingly weird experience, which the \"hero\" makes more complicated by refusing to let go of it and the people involved. Marias has a great eye and ear for detail."}]}, "authors": ["Javier Marias"], "isbn": "0307950751", "longitude": -3.7035825, "periods": ["2000s", "Recent Releases"], "title": "Tomorrow in the Battle Think on Me", "word_cloud": "take finish glad author favorites psychological investigation hows whys night stand marry woman divorce man sudden death woman reaction death man lead uncovering secret past the author description character surround street alleyways make feel recommend fifth world outstanding enormous literary stile observations human nature next prize have friend father proud enormous success write thriller very interesting plot well write usual great author speak expert friend mine ask anything native spanish speaker think last month go bookstore clerk recommend popular write admit introduction intriguing writer good job keep interested happen leave dead bedroom however often give much detail explain many thing happen mind felt leave much deduct interpret much tell taste long section frankly impression writer pay word obvious try imitate long paragraph lack beautiful style french writer confirm mention make almost end however admit find twist end reward make worth time spend read end change rating final comment title appeal begin remind favorite poem mexican poet start line pretense alto story basis intriguing find author digress taste tend skim last half probably miss whole point past digression wonderful author sometimes wish bit focused expect interesting compelling novel prefer even start slow repetitive get good page always great insight life death human nature make reward character reappear different novel create world deserve still best top ever detailed account passingly weird experience hero make complicate refuse let people involve great eye ear detail", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Tomorrow in the Battle Think on Me is a riveting novel of infidelity and a man trapped by a terrible secret.\r\n\r\nMarta has only just met Victor when she invites him to dinner at her Madrid apartment while her husband is away on business. When her two-year-old son finally falls asleep, Marta and Victor retreat to the bedroom. Undressing, she feels suddenly ill; and in his arms, inexplicably, she dies. What should Victor do? Remove the compromising tape from the answering machine? Leave food for the child for breakfast? These are just his first steps, but he soon takes matters further; unable to bear the shadows and the unknowing, Victor plunges into dark waters. And Javier Marías, Europe's master of secrets, of what lies reveal and truth may conceal, is on sure ground in this profound, quirky, and marvelous novel.", "asin": "0307950751", "rank": "680233", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51SrB4Y8hwL.jpg", "country": "Spain", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}