{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": -27.4689682, "ratings": {"num_ratings": 51, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "An interesting setting, and nice writing, but I found this book extremely hard to follow. It was often so confusing I just stopped reading it. It jumps between two main characters, which is easy enough to follow. But then they jump back and forth between various points in their lives, and various people in their lives, then and now, leaving the reader stumped."}, {"review_sentiment": 4.0, "review_text": "This is first and foremost an Aussie novel.  It would be hard to think of the characters existing anywhere else.  The slang, the settings, the conflicts are quintessentially Australian--and overwhelmingly male, which the female Wyld nails.  I'm not sure what the point of the book was, but the journeys each of the main characters set off on are fully engrossing.  A little too much hard drinking for my tastes, but again, for this class of Aussie probably right on the money."}, {"review_sentiment": 5.0, "review_text": "I have just discovered Evie Wyld' s writing and it has blown me away. Her language is so fresh but utterly to the point, and I feel I know her characters in all their flaws and sorrows. I cannot recommend this novel highly enough, as well as her subsequent book All the Birds, Singing. I can't wait to see what she produces next."}, {"review_sentiment": 5.0, "review_text": "“Eucalyptus blanketed the room. He had the feeling that the trees were peering in through the windows, that they had uprooted and crept over to take a peek. The leaves of the banana tree on the roof were a gentle tap tap tap let me in”After the Fire, a Still Small Voice is the first novel by prize-winning Australian author, Evie Wyld. A story that spans three generations, it is told from the perspective of Frank, who, in the present day, is fleeing behaviour he is ashamed of; and of Leon, decades earlier, forced to follow in his father’s footsteps.Frank arrives at Mulaburry, determined that life in his grandparents’ hut in the cane-fields will help him forget Lucy, the woman he mistreated. “The clearing was smaller than he remembered, like the cane had slunk closer to the pale wooden box hut. The banana tree stooped low over a corrugated roof”.Having watched the broken remains of his father, once a master baker, return from the Korean War, Leon finds himself plucked from his own baking career to land in the jungles of Vietnam.Wyld alternates the narratives so that the significant events of each man’s life are gradually revealed, and the reader learns how one man’s history impacts on that of the other. There are common elements to each narrative, echoes that draw the stories together: the wedding-cake figurines, the baker’s fare, the cane-fields hut.Wyld’s characters are real and flawed, characters for whom the reader can readily hope, be disappointed in and exult in minor triumphs. Their moods are deftly evoked: “With effort he stood up, ignored the squealed noises of the teacher, the weird electric sound of laughter, saw only that Amy Blackwell’s blue eyes watched him as he walked out of the classroom, away from the school, heavy enough that he might sink into the ground and suffocate, or else fall on the pavement and shatter into splinters”Wyld touches on some topical and age-old issues: domestic violence; child abduction; the devastating effect of war on the combatants’ psyche; the lack of support for Vietnam Veterans; racial discrimination. Wyld has a talent for descriptive prose and conveys her settings with consummate ease: the humidity of the Vietnamese jungle, the sounds of the Queensland cane-field, the langour of a Sydney Christmas, all are vividly heard, seen and felt. A stunning debut."}, {"review_sentiment": 3.0, "review_text": "3.5 I chose this novel after discovering Evie Wyld's All the Birds Singing--which I absolutely loved! After the Fire didn't grab me in the quite the same way though I enjoyed the flawed characters, their demons and their search for answers. Frank is reclusive and quiet and battling demons that send him to the abandoned shack he last visited as a teenager. He shares the narrative with Leon, whose story takes place forty years earlier, and as the two tales weave together we come to understand how and why they are related. This is very much a story of how war effects those who return from battle, and it's rarely pretty. The writing is subtle yet evocative, at times unflinching. I did, at times, find myself confused between the two characters. The voices weren't different enough and towards the end I was sometimes unsure which character had experienced what event. Perhaps that was the purpose..."}, {"review_sentiment": 5.0, "review_text": "I really loved this book. You can almost taste the ocean brine and it creates a powerful sense of the rough, down at heel but essentially good hearted sea side community in much the way I found Joy Dettman's early books did. The story proper explores the lives of father and son before, through and after the senseless wars that blight their lives (and those of the women who love them). The story moved backwards and forwards between father and son so you need to concentrate, but it is a thrill to find such a beautifully written and moving book.  (Also great to hear the Australian voice once in a while! One not to miss."}, {"review_sentiment": 4.0, "review_text": "A well written book. It kept my attention from start to finish. I enjoyed Evie Wyld's most recent book, All the Birds Singing, just a little bit more."}, {"review_sentiment": 4.0, "review_text": "Very character driven story, spanning three generations.  Sometimes I found it a little confusing.  I didn't really like the ending, it sort of just finished, I felt there were some gaps in the storyline.  Evie is a good writer, and it is easy to readh"}, {"review_sentiment": 4.0, "review_text": "Great read and insight into the other side of the Vietnam war"}, {"review_sentiment": 5.0, "review_text": "Loved this. Two stories running in parallel, the age-old issues of how the sins (in this case, trials) of the father impact on the son, and the skeletons buried in every family closet, set against the beautifully drawn background of rural Australia. The author's descriptions are the kind to stop you in your tracks and make you think \"I would so love to have written that\", always evocative, never cliched. Add to that a set of odd relationships, a cast of very quirky characters (especially the little girl) and an atmosphere that feels like a cool breeze on a really hot day and you come near what to expect with this novel. Can't wait to read more of her work"}]}, "authors": ["Evie Wyld"], "isbn": "0307473384", "longitude": 153.0234991, "periods": ["2000s", "Recent Releases"], "title": "After the Fire, a Still Small Voice", "word_cloud": "interesting setting nice writing find extremely hard follow often confuse stop read jump main character easy enough follow jump back forth various point live various people live leave stump first foremost hard character exist anywhere else slang setting conflict quintessentially australian overwhelmingly male female nail sure point journey main character set fully engross little much hard drinking taste class probably right money discover write away language fresh utterly point feel know character flaw sorrow recommend highly enough well subsequent produce blanket room feel tree peer window uprooted crept take peek leaf banana tree roof gentle tap tap tap let first australian author story span generation tell perspective present day flee behavior ashamed decade earlier force follow father arrives determine life grandparent hut help woman mistreat clear smaller remember cane slunk closer pale wooden box hut banana tree stoop low corrugate roof watch broken remain father master baker return find plucked bake career land jungle alternate narrative significant event man life gradually reveal learns man history impact common element narrative echo story together figurine baker fare character real flawed character readily hope disappointed exult minor triumph mood deftly evoke effort stand ignore squealed noise teacher weird electric sound laughter saw blue eye watch walked classroom away school heavy enough ground suffocate else pavement shatter splinter touch topical issue domestic violence child abduction devastate effect war combatant psyche lack support racial discrimination talent descriptive prose conveys setting consummate ease humidity jungle sound languor vividly hear see felt stunning debut choose discover absolutely love grab quite way enjoy flaw character demon search answer reclusive quiet battling demon send abandon shack last visited teenager share narrative story take place forty year earlier tale weave together come understand relate much story war effect return battle rarely pretty writing subtle yet evocative time unflinching time find confused character voice different enough end sometimes unsure character experienced event perhaps really love almost taste ocean brine create powerful sense rough heel essentially good heat sea side community much way find early story proper explore live father son senseless war blight life woman love story move backwards forward father son need concentrate thrill beautifully write move also great hear australian miss well write keep attention start finish enjoy recent little bit very character drive story span generation sometimes find little confusing really end sort finish felt gap story line good writer easy read insight side war love story run parallel issue sin case trials father impact son skeleton bury family closet set beautifully draw rural author description kind stop track make think write always evocative never cliched set odd relationship cast quirky character especially little girl atmosphere feel cool breeze really hot day expect wait work", "genres": ["Fiction & Literature"], "summary": "After the departure of the woman he loves, Frank struggles to rebuild his life among the sugarcane and sand dunes that surround his oceanside shack. Forty years earlier, Leon is drafted to serve in Vietnam and finds himself suddenly confronting the same experiences that haunt his war-veteran father. As these two stories weave around each other—each narrated in a voice as tender as it is fierce—we learn what binds Frank and Leon together, and what may end up keeping them apart.\r\n\r\nFrank last visited his family’s shack, on a Queensland beach, as a gas-huffing teen-ager, battered by his mother’s death and his father’s abusive neglect. He returns an alcoholic man, “the bloody feel of some bastard terrible thing swimming inside him,” having lashed out at his girlfriend until she left. The shack has served as a retreat before: for Frank’s grandfather, reeling from the Korean War, and for his father, who holed up there after serving in Vietnam.\r\n \r\nSet in the unforgiving landscape of eastern Australia, Evie Wyld’s accomplished debut tackles the inescapability of the past, the ineffable ties of family, and the wars fought by fathers and sons.", "asin": "0307473384", "rank": "1492140", "city": "Brisbane", "image": "https://images-na.ssl-images-amazon.com/images/I/61Ht84BwL2L.jpg", "country": "Australia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}