{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -12.0621065, "ratings": {"num_ratings": 19, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "If you like to read guerrilla conflicts inserted in social latin american context this is the book you have to read but don't expect a highly profound story."}, {"review_sentiment": 4.0, "review_text": "Red April is set in Peru in the 2000.it centers around a low level assistant prosecutor who after decades of living in Lima has returned to his hometown in the Andes which ten years earlier was a hot bed of Shining Path activity.The prosecutor is an odd person at home nowhere.He gets involved in a murder investigation that no one seems to want him to pursue and becomes convinced the Shining Path is coming back and no one wants to admit it.It turns out things are much stranger than that and our protagonist weirder than we thought.I believe this novel has been marketed as a murder mystery.Well, it has elements of that but to use a phrase i'm not crazy about , it is a work of \"literary fiction\".The characters are well developed and the author shows considerable psychological insight.The plot line is engrossing and you never doubt the authors fundamental seriousness.This is not what is sometimes called an entertainment.The author is presenting us a Peru mired in corruption , brutality and denial.We are only recently past an extraordinarily brutal war .Yet , people seem to want to deny it's happened.But they can't and are in a sense crazed by the past.In a way it's a scary book.Mario Vargas Llosa's Death in the Andes , a very different book could serve as a kind of prequel.I should  think someone would want to adapt this novel for a movie.It has so many cinematic elements.I suspect it would be a disaster ! I can't imagine even a good film maker resisting going for color and flattening the whole thing into pulp."}, {"review_sentiment": 5.0, "review_text": "Good book to read"}, {"review_sentiment": 4.0, "review_text": "This is a book to read if you are into politics and the world of banana republics of the 1980s.  Do not read if you don't like violence or are offended by sexual situations."}, {"review_sentiment": 4.0, "review_text": "Intriguing story, wonderful insights in history and politics of Peru, but no interesting protagonist."}, {"review_sentiment": 3.0, "review_text": "This is a prize-winning novel translated from the Spanish.  The subject is an appallingly violent period in the history of Latin America - the war between the Maoist guerrillas of Sendero Luminoso and the Peruvian state.  The setting is Easter 2000, Holy Week in Ayacucho.We begin with crime fiction. The novel obeys some of the rules and realises some of the expectations of that genre - well to begin with. The cases are a series of brutal murders.The investigator is Assistant Prosecutor Felix Chacaltana Saldivar, a curious man who initially took my sympathy and even  affection.  He is a deeply conscientious official, naïve and honest. He left Lima after being dumped by his wife for lack of ambition. He is now in a backwater, he believes, where the war is definitely over - so his superiors insist, until the corpses show up.As the body count rises he relentlessly follows procedures with a faith in official justice. This faith is to be sorely tested. As the love interest we have Edith, a young waitress in a restaurant with seriously rare cuisine. For good measure he has a curious relationship with his mother , his mamacita.Black comedy merges with sadism as the narrative flows into horror. A prolonged description of rape was shocking. By the end we are in a disturbing world that mixes the supernatural and the psychotic. We have descended into hell. As dark April, the cruellest month, turns towards May it feels like the apocalypse has arrived in the Andes.I was reminded of the The Secret in Their Eyes - about the dirty war in Argentina.  There are similarities between  Saldivar and Benjamin Chapparro, the justice official in Sacheri's novel. However, Saldivar lacks a basic humanity.  Perhaps we are to think that he was perverted by the terror war - but if there was hope in Argentina, why not Peru?There are chilling echoes of this fiction in the murderous actions of ISIS today in Iraq. The influence of Conrad's novel is also obvious. Maybe that was the point - there is no justice, no resolution, just blood without hope - sacrifice without redemption. It was too dark for me."}, {"review_sentiment": 5.0, "review_text": "Peru is a beautiful country with an abundance of striking differences in its people and landscape.  The one thing that has kept it in shackles is its the inability to look at itself objectively and deal with the realities of injustice and cruelty.  This book is like looking through a family album because it is so accurate in its depiction of the government and military life.  Yet it also has a tenderness that reveals how people cope with 20% inflation and economic stagnation that results in a complete break down of any hope.  I believe this author is amazing at displaying truth and intrigue and I expect even greater works from him.  Viva Peru!"}, {"review_sentiment": 4.0, "review_text": "\"Red April\" won a prestigious award in Spain. Although there are points at which this novel loses its thread, for the most part, it can keep you on the edge of your seat wondering exactly what will happen next and why. Nothing seems to add up, until the last few pages, as the main character tries out various theories.This novel, set in Ayacucho, where the Shining Path was born, has been harshly criticized by some in Peru. There are details of Peruvian military, police, judiciary and fire arms that are, apparently, in error and which indicate a degree of sloppiness \"unacceptable\" in a thriller. (You and I won't notice.) However, their real criticism is that the book trivializes the internal conflict that consumed 70,000 lives in Peru, turning it into merely the backdrop for a series of bizarre murders that consume the principal character, Chacaltana. The same could be said for crime novels that use WWII, Nazi terror or other horrific backdrops, but those who are so close in time and place to the violence of those years have a right to be sensitive.Other objections--such as the one that the novel portrays indigenous Peruvians as crude and violent bumpkins who speak Quechua gibberish--I think may be misplaced. As I read it, the novel intends(in part)to portray how the outsider elites--all people from Lima and other parts of the coast--view the indigenous people of the highlands. Although Chacaltana, as a low-ranking mestizo official, has to endure the ridicule of army, police and political players, he is not immune to plenty of prejudices of his own because, in essence, he is a Limeno, a man from the capital.Chacaltana is pretty hard to take in his incredible naivete, and some readers have thrown up their hands and thrown out the book. But he is the consummate bureaucrat; Americans have had much less contact with these types than Latin Americans have. He is a pretty strange guy. If you have seen the film \"Ojos que no ven\" (What the Eyes don't See) by Peruvian director Francisco Lombardi, I could visualize him as the nerdy clerk in the Ministry of Justice--but with a law degree.As far as the translation is concerned, the stilted language that one reviewer complained of is due to the intentionally stilted translations of Chacaltana's reports, written in bureaucratic legalese. (See very similar military communiques in Vargas Llosa's \"Pantaleon y las visitadoras,\" hysterically funny in Spanish and much less so in English.) I did find the translation of the mysterious illiterate ramblings (never explained until the end) over the top. These sections could have been done a bit more subtly and still retained the flavor of the original, I think."}, {"review_sentiment": 2.0, "review_text": "I didn't like this book, and there are a lot of reasons for that. It is, first of all, such a guy book. By that, I mean that some books appeal more to male readers (if they appeal to anyone at all), while others are identifiably chick books -- think Oprah's picks, and tell me if I am wrong. This book is completely a dude book, and I am not a dude. There are, however, more reasons for my disappointment than that. The next reason is that it's hard to write a good mystery, and Roncagliolo doesn't succeed in doing so. He instead resorts to the device used by so many authors of ill-conceived mysteries: vagueness. Because he can't be straighforward without giving away the plot, he obfuscates, and little is more dissatisfying to a reader than not being able to figure out what's going on. That's the initial cause for me losing interest in the book, and it occurred about a third of the way through. A little further on came the second bane of mystery writers: predictability. This occurs about halfway into the story, where you see the ending coming from a mile away. From there on, all of the increasingly preposterous twists and turns only seem the more pathetic and desperate. Amidst it all, there are two genuine surprises, but they are too late, and they won't make you like the book more. They will increase your disdain for the narrator, and your impatience to be done with this, already. I was heartily relieved by the time I finished the book, and left wondering whatever inspired me to pick it up in the first place. So, unless you are a total dude who likes bad mysteries, mixed with mytic religion, and topped with Peruvian terrorism, you can pass on Red April without the slightest worry you're missing out on something good."}, {"review_sentiment": 1.0, "review_text": "First Line: On Wednesday, the eighth day of March, 2000, as he passed through the area surrounding his domicile in the locality of Quinna, Justino Mayta Carazo (31) discovered a body.Felix Chacaltana Saldivar is an unambitious prosecutor living in Lima, Peru. Haunted by his mother, abandoned by his wife, Felix loves literature and devotes an entire room of his house (and a good percentage of his waking thoughts) to the spirit of his dead mother. For some reason known only to the gods he has been put in charge of a strange murder investigation, which twists and turns to its surprising conclusion.Well... I'm going to assume it's a surprising conclusion because I just could not finish this book. One part of my brain loved the look into the politics and country of Peru and didn't want to stop reading. The other part of my brain was so disappointed by the main character and the writing style that I did stop.I'll talk about the writing style first. I should know better than to get a book which contains the following words in its description: \"stunning\", \"self-assured\", \"clarity of style\", \"complexity\", \"riveting\", \"profound\", and \"deft artistry\".  99% of the time when I read the book, I'm simply stunned and let it go at that. There was a sly, arch tone to the writing that I found alternately confusing and annoying.If I wanted to be blunt, I'd say that Felix Chacaltana Saldivar was too dumb to live. Evidently he's spent way too much time in that room talking to his dead mother. The room and the talking to the dead may be a cultural tradition, but he carried it to excess.I reached the point of no return when Felix went to a village to investigate. He had an idea going in that the area was very unstable politically. When he got there, he was told that it, indeed, was a very dangerous place to be. So what does he proceed to do? He takes the moral high ground when questioning people, and he won't stop questioning why laws are not being enforced. Yes, I do have morals, and yes, I do believe in law enforcement-- but not when you're putting people's lives in danger. Felix, having the luck of the naive and stupid, can leave that village and return home. The villagers he questions must remain there and hope they live to see the sun rise in the morning.Enough of my complaints. I've seen by several other reviews that other people have read and enjoyed Red April. Unless you're the type of reader who is annoyed by many of the same things I outlined above, you may well be one of them. I sincerely hope that you are."}]}, "authors": ["Santiago Roncagliolo"], "isbn": "0307388387", "longitude": -77.0365256, "periods": ["2000s", "Recent Releases"], "title": "Red April", "word_cloud": "like guerrilla conflict insert social latin american context expect highly profound story set center around low level assistant prosecutor decade live return hometown year earlier hot bed shin prosecutor odd person home get involve murder investigation seem want pursue becomes convince shin come back want admit turn thing much stranger protagonist weirder believe market murder element use phrase crazy work literary fiction character well develop author show considerable psychological plot line engross never doubt author fundamental sometimes call author present mire corruption brutality recently past extraordinarily brutal war people seem want deny crazed way scary different kind think someone adapt many cinematic suspect even good film maker resist go color flatten whole thing pulp good politics world banana republic do violence offend sexual situation intrigue story wonderful insight history politics interest protagonist translate spanish subject appallingly violent period history war guerrilla state setting crime fiction obeys rule realities expectation genre well case series brutal investigator curious man initially take sympathy even affection deeply conscientious official nave honest leave dump wife lack ambition backwater believe war definitely superior insist corps show body count rise relentlessly follow procedure faith official justice faith sorely test love interest young waitress restaurant seriously rare cuisine good measure curious relationship mother comedy merges sadism narrative flow horror prolonged description rape shocking end disturb world mix supernatural psychotic descend hell dark cruelest month turn towards feel apocalypse arrive remind war similarities justice official however lack basic humanity perhaps perverted terror war hope chill echo fiction murderous action isis today influence also obvious maybe point justice resolution blood hope sacrifice redemption dark beautiful country abundance strike difference people landscape thing keep shackle inability look objectively deal reality injustice cruelty look family album accurate depiction government military life also tenderness reveals people cope inflation economic stagnation result complete hope believe author amaze display truth intrigue expect even greater work prestigious award point loses thread part edge seat wonder exactly next nothing seem last page main character try various set bear harshly criticize detail peruvian military police judiciary fire arm apparently error indicate degree sloppiness unacceptable thriller notice however real criticism trivialize internal conflict consume live turn merely backdrop series bizarre murder consume principal character say crime novel use terror horrific backdrops close time place violence year right objection portray indigenous crude violent bumpkin speak gibberish think intend part portray outsider elites people part coast view indigenous people highlands mestizo official endure ridicule army police political player immune plenty prejudice essence man pretty hard take incredible naivete reader hand throw consummate bureaucrat much le contact type pretty strange guy see film we en peruvian director nerdy clerk law far translation concern stilted language reviewer complain due intentionally stilted translation report write bureaucratic legalese see similar military communique leis visitadoras hysterically funny spanish much le english find translation mysterious illiterate ramblings never explain end top section do bit subtly still retain flavor original think like lot reason first guy mean appeal male reader appeal anyone others identifiable chick think pick tell wrong completely dude dude however reason disappointment next reason hard write good mystery instead resort device use many author mystery vagueness give away plot obfuscate little dissatisfy able figure go initial cause lose interest occur third way little come second bane mystery writer predictability occur halfway story see end come mile away increasingly preposterous twist turn seem pathetic desperate genuine surprise late increase disdain narrator impatience do already heartily relieve time finish leave wonder inspired pick first place total dude like bad mystery mixed mystic religion top peruvian terrorism pas slightest worry miss something good first eighth day pass area surround domicile locality discover unambitious prosecutor live mother abandon wife love literature devotes entire room house good percentage wake thought spirit dead mother reason know god put charge strange murder investigation twist turn surprising go assume surprising conclusion part brain love look politics country want stop read part brain disappointed main character write style talk write style first know better contains follow word description stun clarity style complexity rivet profound deft artistry time simply stun let sly arch tone writing find alternately confuse want blunt say dumb live evidently spent way much time room talk dead mother room talk dead cultural tradition carry reached point return go village investigate idea go area unstable politically get told indeed dangerous place proceed take moral high ground question people question law enforce morals yes believe law enforcement put people live danger luck naive stupid leave village return home villager question hope live see sun rise complaint see several review people enjoy type annoyed many thing outline well sincerely hope", "genres": ["Fiction & Literature", "Mystery & Suspense", "Politics"], "summary": "A chilling political thriller set at the end of Peru's grim war between Shining Path terrorists and a morally bankrupt government counterinsurgency.\r\n \r\nAssociate District Prosecutor Felix Chacaltana Saldivar is a by-the-book prosecutor wading through life. Two of his greatest pleasures are writing mundane reports and speaking to his long-dead mother. Everything changes, however, when he is asked to investigate a bizarre and brutal murder: the body was found burnt beyond recognition and a cross branded into its forehead. \r\n\r\nAdhering to standard operating procedures, Chacaltana begins a meticulous investigation, but when everyone he speaks to meets with an unfortunate and untimely end, he realizes that his quarry may be much closer to home. \r\n\r\nWith action rising in chorus to Peru’s Holy Week, Red April twists and turns racing toward a riveting conclusion. ", "asin": "0307388387", "rank": "1261453", "city": "Lima", "image": "https://images-na.ssl-images-amazon.com/images/I/51Na0wKf3PL.jpg", "country": "Peru", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}