{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 3475, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book  enjoyed reading it!"}, {"review_sentiment": 4.0, "review_text": "I liked the book. 5 stars are reserved for books I loved. The Devil in the White City by Erik Larson I loved. This book gave great insight into the early days of Nazi Germany. Larson is an excellent writer and makes nonfiction read like a historical novel. You know you have a good book when you can't wait to get back to it. The 3 of his I've read (Dead Wake) all had that quality. I look forward to more."}, {"review_sentiment": 3.0, "review_text": "Well written and interesting account of U.S. Ambassador to Germany and his family in the 1930's during Hitler's rise to power.  Some disturbing parallels to present day political environment (scapegoating of minorities) and acceptance and celebration of crass discourse."}, {"review_sentiment": 5.0, "review_text": "GREAT INSIGHT INSIDE HITLERS GERMANY"}, {"review_sentiment": 5.0, "review_text": "Educational, intriguing, entertaining and poignant. Personal life stories weave through factual historic accounts. An interesting study on how people/countries learn so little from history."}, {"review_sentiment": 5.0, "review_text": "Great read"}, {"review_sentiment": 5.0, "review_text": "Brings Nazi Germany alive in a frightening way.  Excellent read."}, {"review_sentiment": 5.0, "review_text": "I was surprised at how interesting this book is. Because we know what is coming historically, it has a special value."}, {"review_sentiment": 5.0, "review_text": "It was an amazing account of the time preceding the US involvement in WW2."}, {"review_sentiment": 5.0, "review_text": "I actually read this years ago when I first received it on my Kindle.  It is a great book, and gives first-hand experiences in Germany from an American point of view.  Really fascinating historical context and a great read."}]}, "authors": ["Erik Larson"], "isbn": "030740885X", "longitude": 13.3888599, "periods": ["1900s"], "title": "In the Garden of Beasts: Love, Terror, and an American Family in Hitler's Berlin", "word_cloud": "enjoy read like star reserve love love give great insight early day excellent writer make nonfiction historical know good back dead wake quality look forward well write interesting account rise power disturbing parallel present day political environment scapegoating minority acceptance celebration crass discourse great educational intriguing entertain poignant life story weave factual historic account interesting study learn little history great brings alive frighten way excellent surprise interest come historically special value amaze account time precede involvement actually year first receive great give experience point view fascinate historical context great", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Erik Larson, New York Times bestselling author of Devil in the White City, delivers a remarkable story set during Hitler’s rise to power.\r\n\r\nThe time is 1933, the place, Berlin, when William E. Dodd becomes America’s first ambassador to Hitler’s Nazi Germany in a year that proved to be a turning point in history.\r\n    \r\nA mild-mannered professor from Chicago, Dodd brings along his wife, son, and flamboyant daughter, Martha. At first Martha is entranced by the parties and pomp, and the handsome young men of the Third Reich with their infectious enthusiasm for restoring Germany to a position of world prominence. Enamored of the “New Germany,” she has one affair after another, including with the suprisingly honorable first chief of the Gestapo, Rudolf Diels. But as evidence of Jewish persecution mounts, confirmed by chilling first-person testimony, her father telegraphs his concerns to a largely indifferent State Department back home. Dodd watches with alarm as Jews are attacked, the press is censored, and drafts of frightening new laws begin to circulate. As that first year unfolds and the shadows deepen, the Dodds experience days full of excitement, intrigue, romance—and ultimately, horror, when a climactic spasm of violence and murder reveals Hitler’s true character and ruthless ambition.\r\n    \r\nSuffused with the tense atmosphere of the period, and with unforgettable portraits of the bizarre Göring and the expectedly charming--yet wholly sinister--Goebbels, In the Garden of Beasts lends a stunning, eyewitness perspective on events as they unfold in real time, revealing an era of surprising nuance and complexity. The result is a dazzling, addictively readable work that speaks volumes about why the world did not recognize the grave threat posed by Hitler until Berlin, and Europe, were awash in blood and terror.", "asin": "030740885X", "rank": "5672", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51-Wsw1nB4L.jpg", "country": "Germany", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}