{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 98, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "An interesting read about life in a Muslim country a hundred years ago"}, {"review_sentiment": 5.0, "review_text": "good book in good condition"}, {"review_sentiment": 5.0, "review_text": "A can't put down read"}, {"review_sentiment": 5.0, "review_text": "Fabulous book!"}, {"review_sentiment": 5.0, "review_text": "Item was as described and shipping was prompt."}, {"review_sentiment": 3.0, "review_text": "The following are three separate reviews of the trilogy parts:Palace Walk (The Cairo Trilogy #1) by Naguib MahfouzOriginally published in Arabic in 1956, this novel was written by Egyptian writer Naguib Mahfouz, winner of the 1988 Nobel Prize in Literature. It is the first book of the Cairo Trilogy that was translated into English in 1990.The setting of the novel is Cairo during and just after World War I, 1917 to 1919. Most of the story focuses on the life of one family living on a street named \"Palace Walk,\" and toward the end the plot spreads to include demonstrations and protests leading up to the nationalist revolution of 1919.The story provides a thorough description of a time and place as well as providing intimate character development of household members including three sons, two daughters, a maid servant, the wife, and a tyrannical husband. They are all observant Moslems, but the husband/head of household drinks alcohol and is an adulterer living a duplicitous life requiring strict conservative conduct at home and a gregarious personal life for himself outside the home.This all takes place in an environment where the women of the family are required to not venture outside the home. When an official inquiry is received regarding a possible marriage proposal for the younger of the two daughters, the husband is puzzled why and how such an interest could exist because theoretically his daughters have never been seen by any men outside the household. We as readers know that the daughter's outline has been glimpsed through the slats covering a second story window. It doesn't take much of a view of the female form in this environment to enflame carnal passion.The story follows the family through several crises which conclude in marriage of some of the children, birth of some grandchildren, and some marriage separations. Eventually family members become involve in the surrounding political agitation caused by the expectation that the British protectorate end and Egypt become an independent state. This part of the story is based on historical occurrences making this part of the book a historical novel.Palace of Desire (Cairo Trilogy, #2) by Naguib MahfouzThis is the second book of the Cairo Trilogy, that picks up approximately five years after the end of Palace Walk , the previous book, and covers the approximate time span from 1925 to 1927 of the life of a family living in old Cairo, Egypt. The previous book had ended with the tragic death of one of the sons who had shown great potential as a political leader. At the beginning of this book we learn that the father of the family (al-Sayyid Ahmad) had modified his profligate ways during the intervening five years and had abstained from adultery—but continued with partying into the night. At the beginning of this book he slips back into his old ways—after all one can't live a penitent life forever.The oldest son (Yasin) leaves the family home to move to the house of his deceased biological mother located on Palace of Desire Alley. This move is forced because he married a woman unacceptable to the family, his step mother in particular. This second marriage of his soon fails like the first and he ends up marrying for a third time to an entertainer, which is more scandalous to the family's honor than the previous second marriage.The love sick yearnings of the youngest son (Kamal) are thoroughly explored by the book. The account of his obsessive pinning for her love provides an account of the internal thoughts of a young man infatuated with a young lady. He is in his upper teens, his friends are headed in different directions, some to school, others to travel and work. In the end his unrequited love pushes him into sampling the life styles of his older brother and father.I'm convinced that the story being told in this trilogy is largely autobiographic, and that the author sees himself in the character of Kamal. There are many pieces of evidence for this conclusion, and the final giveaway is the fact that Kamal in this story aspires to be a writer of novels. He dreams of writing a big long novel. This trilogy fits those aspirations. Mahfouz, the author, won the 1988 Nobel Prize in Literature.The political happenings in Egypt during this time period are mentioned but are very much peripheral to the story. The consequences of a fast-modernizing society with differing expectations and possibilities are implicit throughout the story.The book ends with simultaneous pending death and pending birth. Near the end the aging father has some health problems leading the reader to expect perhaps he will die. Instead the ending goes in another direction.Sugar Street (The Cairo Trilogy #3) by Naguib MahfouzThird book of the Cairo Trilogy, this book begins in 1935, some eight years after the end of the previous volume, Palace of Desire. Spanning ten years, Sugar Street is set against the backdrop of the Second World War and domestic Egyptian political unrest. A new generation has grown up since the close of the previous book, the tyrannical patriarch of the family from the previous volumes is now in his dotage, and the matriarch mother is at peace with life making daily pilgrimages to the local mosque.Kamal, the precocious child of the first volume and the aspiring student of the second volume is now a middle aged teacher/writer doomed to ponder his unrequited romantic aspirations. Fortunes have reversed for some with a rich family from the previous story now reduced to common status, a former local fruit vendor now wealthy, and the son of the lowly shop clerk now a successful prosecuting attorney.In this final volume life has become more modern and westernized with the political/religious/philosophical debates discussed front and center through the dialogs and internal thinking of the book's characters. The book ends with two young third generation members of the family held in prison on suspicion of sedition, one being a Marxist and the other a member of the Moslem Brotherhood, thus generating a portent of future generations of Egyptian political unrest. Symbolically, a 4th generation child of one of the imprisoned young men is about to be born as the book ends providing a reminder that life goes on.This trilogy provides a glimpse into a time capsule of Arabic middle class urban Cairo during the first half of the twentieth century. It represents a region of the world that continues to play a significant part of international politics in today's news."}, {"review_sentiment": 4.0, "review_text": "Exactly as described. Book arrived on time and in good condition."}, {"review_sentiment": 4.0, "review_text": "I absolutely loved Palace Walk, the first book in the Cairo trilogy, and was looking to once more lose myself in the crowded streets of Cairo and in the lives of the characters. I was not disappointed. The humanity and complexity of the characters is what draws us to them.But I was a little disappointed with Kamal's adolescent introspections and found the book dragging in those places. Just a little too much of it!Otherwise, the writing is as warm, fluent and vigorous as his earlier book."}, {"review_sentiment": 3.0, "review_text": "I've just completed the second book in the trilogy.  It is well written, but not as good for me as the first one.  It continues with the family and the children are now adults with families of their own.  It is always interesting to have such an up close view into other cultures and their belief systems.  I still didn't like the father because any joy in him was reserved for outsiders, but he treated his family like he hated them.  His children were terrified of him and his wife lived to serve him hand and foot.  On to the third installation of this trilogy."}, {"review_sentiment": 5.0, "review_text": "The quality one would expect for a prize winner!! Enhanced my understanding of Egyptian culture and Islam from the late 1800's to the mid-1900's in Cairo."}]}, "authors": ["Naguib Mahfouz"], "isbn": "0307947114", "longitude": 31.243666, "periods": ["1900s"], "title": "Palace of Desire: The Cairo Trilogy, Volume 2", "word_cloud": "interesting life country year ago good good condition fabulous describe ship prompt following separate review trilogy part walk publish write egyptian writer winner first translate set most story focus life family live street name end plot spread include demonstration protest lead nationalist revolution story provide description time place well provide intimate character development household member include son daughter maid servant wife tyrannical husband observant household drink alcohol adulterer living duplicitous life require strict conservative conduct home gregarious personal life take place environment woman family require venture home official inquiry receive regard possible marriage proposal younger daughter husband puzzle interest theoretically daughter never see men household reader know daughter outline glimpse slat cover second story window take much view female form environment inflame carnal story follow family several crisis conclude marriage child birth grandchild marriage separation eventually family member become involve surround political agitation cause expectation british protectorate end become independent state part story base historical occurrence make part historical second pick approximately year end previous cover approximate time span life family live old previous end tragic death son show great potential political leader begin father family modify profligate way intervene year abstain continued party night begin slip back old penitent life oldest son leave family home move house decease biological mother locate move force married woman unacceptable family step mother particular second marriage soon fail first end marry third time entertainer scandalous family honor previous second love sick yearning youngest son thoroughly explore account obsessive pinning love provide account internal thought young man infatuate young lady upper teens friend head different direction school others travel work end unrequited love push sample life style older brother convince story tell trilogy largely autobiographic author see character many piece evidence conclusion final giveaway fact story aspires writer novel dream write big long trilogy fit aspiration author political happening time period mention much peripheral story consequence society differ expectation possibility implicit end simultaneous pending death pending birth end age father health problem lead expect perhaps die instead end go begin year end previous year set second domestic egyptian political unrest new generation grow close previous tyrannical patriarch family previous volume dotage matriarch mother peace life make daily pilgrimage local precocious child first aspire student second middle age doomed ponder unrequited romantic aspiration fortune reverse rich family previous story reduce common status former local fruit vendor wealthy son lowly shop clerk successful prosecute final life modern westernize debate discuss front center dialog internal thinking character end young third generation member family hold prison suspicion sedition member thus generate portent future generation egyptian political unrest generation child imprisoned young men bear end provide reminder life go trilogy provide glimpse time capsule middle class urban first half twentieth century represent region world continue play significant part international politics today news exactly describe arrived time good condition absolutely love first trilogy look lose crowd street live character disappoint humanity complexity character draw little disappointed adolescent introspection find drag place just little much write warm fluent vigorous earlier complete second trilogy well write good first continue family child family always interest close view culture belief system still father joy reserve outsider treat family hat child terrify wife live serve hand foot third installation trilogy quality winner understanding egyptian culture late", "genres": ["Fiction & Literature"], "summary": "Palace of Desire is the second novel in Nobel Prize-winner Naguib Mahfouz’s magnificent Cairo Trilogy, an epic family saga of colonial Egypt that is considered his masterwork.\r\n\r\nThe novels of the Cairo Trilogy trace three generations of the family of tyrannical patriarch al-Sayyid Ahmad Abd al-Jawad, who rules his household with a strict hand while living a secret life of self-indulgence. In Palace of Desire, his rebellious children struggle to move beyond his domination, as the world around them opens to the currents of modernity and political and domestic turmoil brought by the 1920s. ", "asin": "0307947114", "rank": "463300", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/513Z2-mlopL.jpg", "country": "Egypt", "story_arc": ["Tragedy", "Things only get worse"]}