{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 5474, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Dan Brown sure has a way with words. I should remember to keep my ipad close so it’s easily yo research every nuance of historical significance he wrires about.  I have a lengthy list of items to learn more about."}, {"review_sentiment": 5.0, "review_text": "Current favorite in the series but I haven't read Origin yet."}, {"review_sentiment": 5.0, "review_text": "Mr. Brown is a writer who can layer so much research and intrigue together to create a page-turner that will stay with you for a long time!"}, {"review_sentiment": 5.0, "review_text": "Another Dan Brown book that I couldn’t put down once I started reading!  I really enjoyed The Lost Symbol and got drawn into the storyline!"}, {"review_sentiment": 2.0, "review_text": "It started out in good Fan Brown fashion but the last 1/3 was a meandering mess of endless additional \"clues\" and annoying revelations that diluted the mystery of the first part. I got strung along to  an unsatisfying result that was just uninteresting."}, {"review_sentiment": 5.0, "review_text": "Fantastic"}, {"review_sentiment": 5.0, "review_text": "Gave me much to think about, beyond the mystery which was spellbinding as usual, the philosophy shared left me wanting to search more."}, {"review_sentiment": 5.0, "review_text": "Arrived on time and as described!"}, {"review_sentiment": 5.0, "review_text": "Intriguing...gripping...and educational. Loved every page/chapter.  Real difficulty in putting it down"}, {"review_sentiment": 4.0, "review_text": "Good, enjoyable. but not quit as good as Origins"}]}, "authors": ["Dan Brown"], "isbn": "0307950689", "longitude": -77.0366456, "periods": ["2000s", "Recent Releases"], "title": "The Lost Symbol", "word_cloud": "sure way word remember ipad close easily yo research nuance historical significance writes lengthy list item learn favorite series origin yet writer layer much research intrigue together create long time put start read really enjoy get draw story line start good fashion last meandering mess endless additional clue annoy revelation dilute mystery first part get strung unsatisfying result uninteresting fantastic much think mystery spellbind usual philosophy share leave want search arrived time describe intrigue grip educational difficulty put good enjoyable quit good origin", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Famed Harvard symbologist Robert Langdon answers an unexpected summons to appear at the U.S. Capitol Building. His planned lecture is interrupted when a disturbing object—artfully encoded with five symbols—is discovered in the building. Langdon recognizes in the find an ancient invitation into a lost world of esoteric, potentially dangerous wisdom. \r\n\r\nWhen his mentor Peter Solomon—a longstanding Mason and beloved philanthropist—is kidnapped, Langdon realizes that the only way to save Solomon is to accept the mystical invitation and plunge headlong into a clandestine world of Masonic secrets, hidden history, and one inconceivable truth . . . all under the watchful eye of Dan Brown's most terrifying villain to date. \r\n\r\nSet within the hidden chambers, tunnels, and temples of Washington, D.C., The Lost Symbol is an intelligent, lightning-paced story with surprises at every turn--Brown's most exciting novel yet.", "asin": "0307950689", "rank": "8272", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/513YAK7cSXL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}