{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 122, "rating": 3.8, "reviews": [{"review_sentiment": 1.0, "review_text": "Not anything like his first book. He is a better writer than this book demonstrates."}, {"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 3.0, "review_text": "During the first half of this book I wanted to give it a 5 star rating but unfortunately the second half impressed me only to the extent of a 3 (or less in parts) and so I ultimately gave History of a Pleasure Seeker a 3 overall.The book is in two parts and the first takes up about two thirds of the story. Set in Amsterdam at the turn of the 20th century, the first part of the book is exceptional. Mason takes the reader into literary mastery over and over again and I was in awe of his moments of genius not only in writing, but in storytelling. (Very few writers have ever mastered both.) I did not want to put the book down and was drawn into his world, and was simultaneously fascinated and repulsed by the characters. As a reader I felt both love and hate (or like and dislike) at different moments for all of Mason’s characters, although strangely he would take you closer to them, and into their heads, and then disregard an individual to focus on somebody else. I am not sure if this fickleness was intended. Also, Mason’s familiarity with certain scenes and characters makes me suspect a semi-autobiography.The second part of the book takes the protagonist away from Holland and to Cape Town. This second section was rushed and disappointing—it seemed like an incongruent addition without much worth appended as an afterthought to an almost flawless story. The book ends as To Be Contd. and I suspect that the author wanted to introduce us to the next phase of the protagonist’s life adventure and leave us hanging for more. It doesn’t work, and I don’t feel compelled to read the next book. Unfortunately, Mason’s peculiar and unexpected change from an intense psycho-emotional-sexual drama within a wealthy Dutch household to a rambling adventure filled with detail, but no depth, is confusing and dilutes the purity of the first part.In the first part he helps us to understand the claustrophobia of wealth and privilege and the fine line between sanity and insanity, belonging and alienation, love and hate, judgement and compassion, liking and loathing; and that anything can be healed with enough time, understanding, and love. But this section’s conclusion is unlikely and rushed.I wish that Mason had received better feedback during the book’s composition because he is undoubtedly a master in the making, but he is not there yet. He shows us glimpses of his genius repeatedly, and technically, the book is perfect. But a firmer hand was needed in editing over-detailed sections in the last third of the book, in following through on certain plots and characterisation (more consistency), and in creating a more elegant and believable transition from one phase of the protagonist’s life to the next. It is as if the author rushed through the last third of the book so that he could begin the next one. I often find this with books in series, and it is off-putting.Having said all of that, Richard Mason is an author whose talent and potential are awe-inspiring. With the right guidance, his work can be brilliant—one of a kind. For much of the book he stands head-and-shoulders above other writers of his genre. A potential literary giant, I fear he may have folded a bit to commercialism and a cookie-cutter storyline as the book trailed off. History of a Pleasure Seeker lacks the polish and discipline expected, as so many mainstream books published these days do. As a writer myself, I could never hope to achieve what he did in so much of the book (Mason’s talent is potent and tangible), and at times I could almost see the story unfolding in three-dimensional images in the gaps between the words on the page. I would have loved the opportunity to proofread this book before publication and assist in the perfection that it didn’t manage to achieve."}, {"review_sentiment": 4.0, "review_text": "The author examines the many characters with humanizing detail, and of course, taking a luxury cruise on a well-appointed ship is always a relaxing journey."}, {"review_sentiment": 3.0, "review_text": "OK read for the time in history"}, {"review_sentiment": 5.0, "review_text": "A beautifully written and gripping story with wonderful insight into complicated characters, Richard Mason is brilliant at evoking life within a luxurious household in belle époque Amsterdam. The author gets sensuality and eroticism just right - very difficult to do."}, {"review_sentiment": 5.0, "review_text": "A fantastic first person narrative that is both fun and insightful. It leaves you looking at the world through eyes of 'what kind of fun can we have today?\""}, {"review_sentiment": 1.0, "review_text": "I got the distinct impression that Mason had done a wealth of historic and geographical research and felt compelled to use as much of it as he could in his novel. I think this may explain why many reviewers have observed that the story seems to lose direction around the midpoint of the book.In Piet Barol, Mason has created a potentially fascinating protagonist, in an equally fascinating situation: that of  tutor to a troubled boy from a wealthy family. Having established this character in this situation, however, Mason then proceeds to start dipping into the minds of every single person in that household. This allows him to write about the origins of New York's Plaza Hotel, the problems (and the life histories!) of the servants of the household, and, in what felt like a sop to the feminists among his readers, the interest of one of the daughters of the household in pursuing a career in fashion design. (This is where I threw the book across the room.) Barol's pupil, his very reason for entering into this household, actually disappears from the book for long stretches, until Mason feels compelled to yank the kid back in to add a slight wrinkle to the plot. The origins of this boy's problems are never explored, merely presented as odd facts.All in all, the novel opens strong. But instead of going deeper into the character of this protagonist, the story goes merrily off the rails, never to return."}, {"review_sentiment": 5.0, "review_text": "I had never heard of Richard Mason before reading this book but am now a fan. This book was amazingly well written. Mason's attention to detail, his ability to capture the human spirit is astounding. I have recommended this book to many others and only wish I hadn't bought it as a Kindle so I could lend it. The only thing that bothered me just a smidgen was his cheat at the end, promising the adventure will continue. I have since reading this put his other books in my Kindle cart."}, {"review_sentiment": 4.0, "review_text": "History of a Pleasure Seeker is an interesting slice of life--the story of a few years in the life of Piet Barol, a young, ambitious (if not entirely ethical) man living in the early twentieth century Amsterdam.  He is not a particularly likeable character, yet I couldn't help rooting for him--the others he comes into contact with are a little less likeable than he is.  The writing her is excellent and Richard Mason makes reading about these characters a pleasant experience.  A word of warning--there are a couple mildly explicit sex scenes in this novel, so if that isn't your thing, perhaps keep searching for your next novel."}]}, "authors": ["Richard Mason"], "isbn": "0307949281", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "History of a Pleasure Seeker", "word_cloud": "not anything first better writer demonstrates great first half want give star rating unfortunately second half impressed extent le part ultimately give part first take third story century first part exceptional take literary mastery awe moment write storytelling writer ever master want put world simultaneously fascinate repulsed character felt hate dislike different moment character strangely closer head disregard individual focus somebody else sure fickleness intend also familiarity certain scene character make suspect second part take protagonist away second section rush seem in congruent addition much worth append afterthought almost flawless story end suspect author want introduce next phase protagonist life adventure leave hang work feel compelled next peculiar unexpected change intense drama wealthy household ramble adventure fill detail depth confuse dilutes purity first first part help claustrophobia wealth privilege fine line sanity insanity belong alienation love hate judgment compassion like loathe anything heal enough time understanding love section conclusion unlikely wish receive better feedback composition undoubtedly master make yet show glimpse genius repeatedly technically perfect firmer hand need editing section last third follow certain plot characterization consistency create elegant believable transition phase protagonist life author rush last third next often find series say author talent potential right guidance work kind much stand writer genre potential literary giant fear bit commercialism story line trail lack polish discipline expect many mainstream publish day writer never achieve much talent potent tangible time almost story unfolding image gap word page love opportunity proofread publication assist perfection manage achieve author examine many character humanize detail course take luxury cruise ship always relax journey ok time beautifully write grip story wonderful insight complicate character brilliant evoke life luxurious household belle author get sensuality eroticism right difficult fantastic first person narrative fun insightful leave look world eye kind fun today get distinct impression do wealth historic geographical research felt compel use much think many reviewer observe story seem lose direction midpoint create potentially fascinating protagonist equally fascinating situation tutor trouble boy wealthy family establish character situation however proceeds start dip mind single person household allow write origin problem life history servant household felt sop feminist reader interest daughter household pursue career fashion design throw room pupil reason enter household actually disappear long stretch feel compel yank kid back add slight wrinkle plot origin boy problem never explore merely present odd open strong instead go deeper character protagonist story go merrily rail never never hear read fan amazingly well write attention detail ability capture human spirit astound recommend many others wish buy thing bother smidgen cheat end promising adventure continue read put cart interest slice life story year life young ambitious entirely ethical man live early twentieth century particularly likable character yet root others come contact little le likable write excellent make read character pleasant experience word warn couple mildly explicit sex scene thing perhaps search next", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "'A sharply written story of love, money and erotic intrigue pulsing behind the staid canal fronts of nineteenth-century Amsterdam' Daisy Goodwin\r\n\r\n'The adventures of adolescence had taught Piet Barol that he was extremely attractive to most women and to many men. He was old enough to be pragmatic about this advantage...'\r\n\r\nIt is 1907. The belle époque is in full swing. Piet Barol has escaped the drabness of the provinces for the grandest mansion in Amsterdam. As tutor to the son of Europe's wealthiest hotelier, he learns the intimate secrets of this glittering family - and changes it forever. With nothing but his exquisite looks and wit to rely on, he is determined to make a fortune of his own. But in the heady exhilaration of this new world, amid delights and temptations he has only dreamed of, Piet discovers that some of the liaisons he has cultivated are dangerous indeed.\r\n\r\n\"A hugely accomplished novel - the story of Piet Barol, a young, provincial Dutchman and the social and sexual adventures he embarks upon in belle epoque Amsterdam.\" THE INDEPENDENT ", "asin": "0307949281", "rank": "66856", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51S2AIXpX1L.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}