{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 110, "rating": 3.6, "reviews": [{"review_sentiment": 1.0, "review_text": "It was like two different stories!!! Why did author just leave the original story and leave us wondering about Coop, Anne and Claire. Very disappointing!!!"}, {"review_sentiment": 2.0, "review_text": "Had to force myself to finish this for book group.  It is really two separate stories, or books.  You read one \"book\" about a person, then that one is left hanging and you're on to the next.  Some characters, you never found out what eventually became of  them.  So annoying, because Ondaatje can certainly write, and the reader starts off feeling quite engaged with these people.  A great disappointment."}, {"review_sentiment": 5.0, "review_text": "This book is extraordinary, so beautiful, tragic, and imaginative. It is set in the 1970s in Petaluma, but swings back and forth in time and place from San Francisco to Las Vegas to the south of France. It tells the story of a family, with the main protagonists being two teen-aged sisters Anna and Claire,  their father, and a handyman Cooper. Violence changes their lives and the reader is swept up in time when adult Anna comes to live and write about an unknown French writer, Lucien. The book is about family, about how time and fate move people, about love, loyalty, fear, brutality, and the constant mystery of life."}, {"review_sentiment": 4.0, "review_text": "Beautiful writing, the plot a little difficult.  Will reread to sort it out."}, {"review_sentiment": 5.0, "review_text": "The author's writing, and his story telling is captivating.  A joy to read his stories."}, {"review_sentiment": 4.0, "review_text": "Amazing use of language, the writer plays with metaphors and the words flow into each other seamlessly, beautifully, hypnotically. The lives of the characters flow too, forward and backwards, connected, sometimes making sense, at times simply awkward and illogical. we are left with opne questions and the memory of a book like a poem."}, {"review_sentiment": 4.0, "review_text": "More about the similies and metaphors of experience and thought in moving through life than any strong story or even plot. This is a highly articulate pantomime of life and a good example of the current literary ilk that holds itself up as the sense and sensibility of our age. Your results may vary."}, {"review_sentiment": 2.0, "review_text": "very difficult book to follow."}, {"review_sentiment": 2.0, "review_text": "Couldn't finish it"}, {"review_sentiment": 1.0, "review_text": "Not being familiar with this author's style, this novel was an absolute CHORE to finish. I found it very exasperating to follow the many story lines. My initial comments, when asked by others about the 'story', was that it was an egotistical exercise in some well-written paragraphs. The author was all over the place, not making 'theme sense',  and proceeded  into the joining of two lives in a most 'fragmented' manner."}]}, "authors": ["Michael Ondaatje"], "isbn": "0307279324", "longitude": -122.4192363, "periods": ["1900s"], "title": "Divisadero", "word_cloud": "different story author leave original story leave wonder disappointing force finish group really separate story person leave hang next character never find eventually become annoy certainly write start feel quite engage people great disappointment extraordinary beautiful tragic imaginative set swing back forth time place south tell story family main protagonist sister father handyman change live swept time adult come live write unknown french writer family time fate move people love loyalty fear brutality constant mystery life beautiful write plot little difficult sort author write story tell captivate joy story use language writer play metaphor word flow seamlessly beautifully hypnotically life character flow forward backwards connect sometimes make sense time simply awkward illogical leave pone question memory poem more simile metaphor experience think move life strong story even plot highly articulate pantomime life good example current literary ilk hold sense sensibility age result difficult not familiar author style absolute finish find exasperate follow many story line initial comment ask others egotistical exercise paragraph author place make sense proceed join life manner", "genres": ["Fiction & Literature"], "summary": "In the 1970s in northern California, near Gold Rush country, a father and his teenage daughters, Anna and Claire, work their farm with the help of Coop, an enigmatic young man who makes his home with them. Theirs is a makeshift family, until it is riven by an incident of violence — of both hand and heart — that sets fire to the rest of their lives.\r\n\r\nDivisadero takes us from the city of San Francisco to the raucous backrooms of Nevada’s casinos, and eventually to the landscape of south central France. It is here, outside a small rural village, that Anna becomes immersed in the life and the world of a writer from an earlier time — Lucien Segura. His compelling story, which has its beginnings at the turn of the century, circles around “the raw truth” of Anna’s own life, the one she’s left behind but can never truly leave. And as the narrative moves back and forth in time and place, we discover each of the characters managing to find some foothold in a present rough-hewn from the past. \r\n\r\nBreathtakingly evoked and with unforgettable characters, Divisadero is a multi-layered novel about passion, loss, and the unshakable past, about the often discordant demands of family, love, and memory. It is Michael Ondaatje’s most intimate and beautiful novel to date.", "asin": "0307279324", "rank": "261782", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51tfN-Uft%2BL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}