{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 6.2443382, "ratings": {"num_ratings": 12, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Uniquely narrated by varying characters who lead to the denouement and all becomes clear!!!"}, {"review_sentiment": 1.0, "review_text": "Horrible!"}, {"review_sentiment": 5.0, "review_text": "Though there isn't magical realism in this book per se, the multiple points of view, the blending of personal histories as well as the interplay of the past with the present  - and all this set against the turbulent and violent time in Colombia's recent history -  creates a complex and compelling environment in which to try to understand who Angelina is and what happened to her. Read it. A gripping and well written book. I'd like to read it in Spanish."}, {"review_sentiment": 5.0, "review_text": "What a great book. Great literary style but very easy to read (just pay attention to who is talking at any given moment). I loved this book and ordered two more Laura Restrepo novels."}, {"review_sentiment": 4.0, "review_text": "Beautifully written. Most of it is not violent, just one scene that i particularly recall being shocking but it is done with a bit of distance, recounted after the fact, so it is not disturbing as it might have been. I had a hard time starting it, due to the alternating voices, and realized that it's better to read more than a few pages at a time to follow the story! Once I did that i got sucked into the fascinating multiple narrative of this personal and to some extent national history."}, {"review_sentiment": 5.0, "review_text": "I think that Laura Restrepo is a fine writer and her book Delirium captures the damage that violence does to societies and to individuals. I really liked the construction of the novel which had different voices relating the story and the plot with many twists and turns was compelling."}, {"review_sentiment": 4.0, "review_text": "Delirium drops us into the high-end world of modern Bogota, Colombia. These particular folks are families who hang out in fitness centers and travel to the United States. One main character is an unemployed professor who has hooked up with the daughter of a prominent drug family. She is more than he can handle and even if she weren't crazy, he'd be out of his league. (I'm reminded of the modern Italian novel The Natural Disorder of Things: A Novel which has a similar set-up.)One day she disappears for a week and then suddenly reappears in a hotel deranged and distraught. A good part of the tension in the story is what happened to her? Thus, the title, Delirium. But the title could equally apply to just about every other main character in the book: the woman's mother who ignores all the infidelities around her and refuses to acknowledge that her son is gay; the professor who thinks this relationship is going anywhere, and the various drug-dealer characters. There is lots of local color of modern urban Colombia but also reminisces and flashbacks of the family's rural origin in German immigrants. Restepo also wrote The Angel of Galilea a story of a saint-like character in a modern drug-ridden Colombia slum."}, {"review_sentiment": 5.0, "review_text": "I have been travelling through Colombia for the last few weeks and deliberately went about reading as many Colombian writers as possible (without the appellido \"Garcia Marquez\") before I left. Restrepo was a real revelation and I was very impressed by this novel. It deals quite movingly with a husband's attempt to keep on top of the \"madness\" consuming his wife --- in fact, a severe Obsessive Compulsive Disorder. (I haven't come across anyone in contemporary literature writing about the subject of OCD which blights the lives of millions of people -- a brave and valuable insight in itself. Restrepo describes it as the \"fear that won't stay still ... a growing beast that must be fed and that swallows everything up.\"Aguilar's great labour of love is set against a number of related dysfunctional family histories which provide context for understanding Augustina (and Aguilar's) condition and conundrum. There is also the backdrop of Colombia sliding into social and political chaos -- the madness of its politics in the 80s and 90s -- which provides another fascinating dimension, especially for a reader fortunate enough not to have had to live through such traumatic times and social circumstances.This is a really brilliant book. I look forward to reading more of Restrepo's work. A great, sadly unheralded, voice of Latin American literature (in English at least)."}, {"review_sentiment": 5.0, "review_text": "I read this novel in Spanish and it was one of the best I have read in years. Restrepo is an amazing novelist and journalist, and her understanding of Columbian contemporary history shows through in all of her novels, but especially in this one. Delirium should be read for it's literary value, but also as a tool to better understand Latin America."}, {"review_sentiment": 1.0, "review_text": "I cannot agree with the \"Bookmarks\" reviewer who called the book \"superbly written.\" I don't care for writing that consists mostly of run-on sentences and uses no quotation marks for dialogue. Such writing loses my interest faster than a speeding bullet. However, if the story had been fascinatingly spell-binding, I could probably have tolerated the hideous style, but it wasn't even interesting."}]}, "authors": ["Laura Restrepo"], "isbn": "0307278042", "longitude": -75.573553, "periods": ["2000s", "Recent Releases"], "title": "Delirium", "word_cloud": "uniquely narrated vary character lead denouement becomes clear horrible magical realism se multiple point view blend personal history well past present set turbulent violent time recent history create complex compelling environment try understand happen grip well write like spanish great great literary style easy pay attention talk give moment love novel beautifully write most violent scene particularly recall shock do bit distance recount fact disturb hard time start due alternate voice realize better page time follow story once get sucked fascinating multiple narrative personal extent national history think fine writer capture violence society individual really like construction different voice relate story plot many twist turn compel drop world modern particular folk family hang fitness center travel main character unemployed professor hook daughter prominent drug family handle even crazy league remind modern things similar day disappear week suddenly reappear hotel derange distraught good part tension story happen title title equally main character woman mother ignore infidelity refuse acknowledge son gay professor think relationship go anywhere various character lot local color modern urban also reminisce flashback family rural origin german immigrant also write story character modern slum travel last week deliberately go read many colombian writer possible appellido leave real revelation impress deal quite movingly attempt top madness consume wife fact severe come anyone contemporary literature write subject blight live million people brave valuable insight describe fear still grow beast swallow everything great labor love set number related dysfunctional family history provide context understanding condition conundrum also backdrop slide social political chaos madness politics provide fascinating dimension especially fortunate enough live traumatic time social really brilliant look forward read work great sadly unheralded voice latin american literature least spanish best year amaze novelist journalist understand columbia contemporary history show novels especially literary value also tool better understand agree bookmark call superbly write care write consists mostly sentence us quotation mark dialogue such writing lose interest faster speed bullet however story fascinatingly probably tolerate hideous style even interest", "genres": ["Fiction & Literature", "Politics"], "summary": "In this remarkably nuanced novel, both a gripping detective story and a passionate, devastating tale of eros and insanity in Colombia, internationally acclaimed author Laura Restrepo delves into the minds of four characters. \r\n\r\nThere's Agustina, a beautiful woman from an upper-class family who is caught in the throes of madness; her husband Aguilar, a man passionately in love with his wife and determined to rescue her from insanity; Agustina's former lover Midas, a drug-trafficker and money-launderer; and Nicolás, Agustina's grandfather. \r\n\r\nThrough the blend of these distinct voices, Restrepo creates a searing portrait of a society battered by war and corruption, as well as an intimate look at the daily lives of people struggling to stay sane in an unstable reality.", "asin": "0307278042", "rank": "302596", "city": "Medellin", "image": "https://images-na.ssl-images-amazon.com/images/I/51CWQ1-TSzL.jpg", "country": "Colombia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}