{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 43.6044622, "ratings": {"num_ratings": 215, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "All of it. Am always sad when a good book ends. Complex and a great flavor of Provence. Bruno is a local prince."}, {"review_sentiment": 1.0, "review_text": "Bruno is so smart that he can take over for the French versions of the FBI and the CIA all by himself.  He's also irresistible to women -- He can't be all that attractive.  I almost forgot to mention that he's smarter than a whole chapter of Mensa.  I bought several of the books (this is the second one I've read)  because they  (the NYTimes) told me it was heavy on French ambience.  I found that I was able to tolerate the disappointments of the first book but as I slogged thru the Crowded Grave it became irritating.  The Little Library in my apartment building is getting 5 or 6 Bruno books.Hmmm. Maybe a few Maigret books (3 or 4) will be another to get me back on track."}, {"review_sentiment": 5.0, "review_text": "If you liked the other three Bruno books, you'll love this one. Martin Walker is truly a craftsman. I am trying not to binge read these but not very hard. This one has equal parts action, mystery, romance, locale, cuisine and interesting three dimensional characters. I have truly enjoyed the series thus far and plan to reread them all again when I get to the end."}, {"review_sentiment": 5.0, "review_text": "love the author's books"}, {"review_sentiment": 4.0, "review_text": "Walker’s Engaging Story Telling Adds A Third-Dimension to Mystery Writing . His Bruno series hooks the reader by adding imaginative detail for unsuspecting readers."}, {"review_sentiment": 5.0, "review_text": "a good mystery one of a series."}, {"review_sentiment": 5.0, "review_text": "This is the best Bruno mystery I've read thus far : full of tension, mystery, trans Euro intrigue, passion and loss."}, {"review_sentiment": 4.0, "review_text": "The French tourist and wine industries must love Martin Walker.  He paints a very attractive portrait of the Perigord region, and his characters are mildly amusing, But Walker is no Dorothy Sayers, Christie, Leon, Maron . . . well, you get the picture.  I invariably guess 'whodunit' early on, and after reading a couple of the books one learns to expect our hero to do everything better than the experts: spelunking, fire rescue, tactical maneuvers, you name it.  The author and our hero also seem to like their women strongly feminist, ready to jump in the sack with casual acquaintances, but disinterested in marriage or family.  The admiration palls.  But, despite that, some of the characters are well drawn, the cooking is appetizing, and the history and plot lines are clever and well researched."}, {"review_sentiment": 5.0, "review_text": "Solid characters as always, balanced action humor and down time. A noble vintage to add to my cellar. Bon appetite!"}, {"review_sentiment": 5.0, "review_text": "Each book in this series is a winner. I'll be sorry when I've read them all."}]}, "authors": ["Martin Walker"], "isbn": "0307744647", "longitude": 1.4442469, "periods": ["2000s", "Recent Releases"], "title": "The Crowded Grave", "word_cloud": "always sad good end complex great flavor local prince smart take french version also irresistible woman almost forget mention smarter whole chapter buy several second tell heavy french ambiance find able tolerate disappointment first slog thru become irritate apartment build get get back track like love craftsman try binge hard equal part action mystery romance locale cuisine interest dimensional character truly enjoy series thus far plan reread get love author add mystery write series hook add imaginative detail unsuspecting reader good mystery series best bruno mystery thus far full tension mystery trans intrigue passion loss french tourist wine industry paint attractive portrait region character mildly amuse well picture invariably guess early reading couple learn hero everything better expert spelunk fire rescue tactical maneuver name author hero also seem woman strongly feminist ready jump sack casual acquaintance disinterested marriage family admiration pall character well cook appetizing history plot line clever well solid character always balance action humor time noble vintage cellar appetite series winner sorry", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "It’s spring in the idyllic village of St. Denis, and for Chief of Police Bruno Courrèges that means lamb stews, bottles of his beloved Pomerol, morning walks with his hound, Gigi, and a new string of regional crimes and international capers. When a local archaeological team searching for Neanderthal remains turns up a corpse with a watch on its wrist and a bullet in its head, it’s up to Bruno to solve the case. \r\n\r\nBut the task will not be easy, not with a meddlesome new magistrate, a series of attacks by animal rights activists on local foie gras producers, and a summit between France and Spain approaching—not to mention two beautiful, brilliant women vying for Bruno’s affections.\r\n\r\n“The small towns where Martin Walker sets his enchanting country mysteries embody the sublime physical beauty . . . of France.” The New York Times  ", "asin": "0307744647", "rank": "29535", "city": "Toulouse", "image": "https://images-na.ssl-images-amazon.com/images/I/511COuNRf7L.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}