{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 86, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "I enjoyed the book, learned a lot from it."}, {"review_sentiment": 4.0, "review_text": "A fun read and definitely a different perspective on history!"}, {"review_sentiment": 5.0, "review_text": "Love the book! The history of Rum and cocktails made for a very interesting read. Wayne has great way of telling the stories with a rum sense of humor.  He's just a few bottles short of being pirate. The rum drinkers will understand it well. The only downside of reading this book is your going to want to try most of the drink recipes listed in the book.Cheers!"}, {"review_sentiment": 5.0, "review_text": "Definitely one of my favorite nonfiction books - fun read, entertaining writing style, great details. The drink recipes are a bonus XD"}, {"review_sentiment": 1.0, "review_text": "HOW THE HECK CAN YOU HAVE A BOOK ABOUT RUM that ROMANTICIZES THE RUM BARONS BUT SIDE STEPS AFRICAN SLAVERY? WHAT THE HECK IS THIS!"}, {"review_sentiment": 5.0, "review_text": "If you are interested in the history rum, this is your book.  I recommend it to everyone who loves rum and loves history."}, {"review_sentiment": 4.0, "review_text": "A fun and entertaining look into rum, it's history, and how this beverage is a major factor in the shaping of America and democracy.The author takes on a personal guided journey in finding the original process, all the while, bringing us to date with current beverge practices. A must-read for fans of the drink!"}, {"review_sentiment": 5.0, "review_text": "A very intresting read around the history of Rum, learning a lot!"}, {"review_sentiment": 5.0, "review_text": "I don't read books these days. When I do, I like to learn a little as I go - so I stumbled upon what appeared to be the perfect mix for a travel book. For the first time in a long time, I finished a book within a few days - so I think that merits a 5 star rating right there. Some rich history mixed in with some very mouth watering facts. Did I immediately go out and pick up a bottle of local distilled rum after I finished the book? Yup. Living in New England makes the story even more engaging. Great section on Hemingway in Cuba, and bars that I've been to myself - added some really great color to the book."}, {"review_sentiment": 5.0, "review_text": "An entertaining look at booze in the new world."}]}, "authors": ["Wayne Curtis"], "isbn": "0307338622", "longitude": 0.0, "periods": ["1600s", "1700s", "1800s", "1900s", "Recent Releases"], "title": "And a Bottle of Rum: A History of the New World in Ten Cocktails", "word_cloud": "enjoy learn lot fun definitely different perspective make interesting great way tell story rum sense humor bottle short pirate rum drinker understand well downside read go want try recipe list definitely favorite nonfiction fun entertain write style great detail drink recipes x have interested rum recommend everyone love rum love fun entertain look rum beverage major factor shape author take personal guide journey find original process bring date current beverage practice fan drink interest learning lot day like learn little go stumble upon appeared perfect mix travel first time long time finish day think merit star rating right rich mixed mouth water fact immediately go pick local distil rum finish make story even engage section bar add really great color entertaining look", "genres": ["History", "Food and Wine"], "summary": "One spirit, Ten cocktails, and Four Centuries of American History\r\n\r\nAnd a Bottle of Rum tells the raucously entertaining story of America as seen through the bottom of a drinking glass. With a chapter for each of ten cocktails—from the grog sailors drank on the high seas in the 1700s to the mojitos of modern club hoppers—Wayne Curtis reveals that the homely spirit once distilled from the industrial waste of the exploding sugar trade has managed to infiltrate every stratum of New World society.\r\n\r\nCurtis takes us from the taverns of the American colonies, where rum delivered both a cheap wallop and cash for the Revolution, to the plundering pirate ships off the coast of Central America, to the watering holes of pre-Castro Cuba, and to the kitsch-laden tiki bars of 1950s America. Here are sugar barons and their armies conquering the Caribbean, Paul Revere stopping for a nip during his famous ride, Prohibitionists marching against “demon rum,” Hemingway fattening his liver with Havana daiquiris, and today’s bartenders reviving old favorites like Planter’s Punch. In an age of microbrewed beer and single-malt whiskeys, rum—once the swill of the common man—has found its way into the tasting rooms of the most discriminating drinkers.\r\n\r\nAwash with local color and wry humor, And a Bottle of Rum is an affectionate toast to this most American of liquors, a chameleon spirit that has been constantly reinvented over the centuries by tavern keepers, bootleggers, lounge lizards, and marketing gurus. Complete with cocktail recipes for would-be epicurean time-travelers, this is history at its most intoxicating.", "asin": "0307338622", "rank": "57743", "city": "Puerto Rico", "image": "https://images-na.ssl-images-amazon.com/images/I/51GSK%2BKQzsL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}