{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 687, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "I really enjoyed the friendly tone of this book, and the peek it provided into a fascinating life. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "Her writing always contains mouth-watering pearls of wisdom! Enjoy, and chew eat morsel thorough. A wonderful experience you won’t regret."}, {"review_sentiment": 5.0, "review_text": "Amazing book. You can hear Julia's voice throughout the pages. Film is cute, but really does no justice to reading this piece. I was an expat for a while in France and she really touches on what it was like-- what it IS like-- to be an American living in France. I recommend this book to anybody, no matter who you are. If you love food, read it. If you love traveling, read it. If you love a true account of a strong woman, read it. If you want to laugh a bit, read it."}, {"review_sentiment": 5.0, "review_text": "Incredibly enjoyable book with a much closer look than I would ever have imagined. This intense peak into the life and time of the Child’s was incredibly endearing, and I didn’t want the book to end..."}, {"review_sentiment": 5.0, "review_text": "My favorite book"}, {"review_sentiment": 5.0, "review_text": "For any enthusiasts of the culinary arts, France, or of Julia herself, this is a must read! An engaging read, bursting with lovely sensory details that really provide a sense of place ( and taste), accented by French words and expressions."}, {"review_sentiment": 5.0, "review_text": "One can almost taste the food, feel her triumphs and disappointments, and appreciate the relationship she had with her husband and friends. A marvelous story."}, {"review_sentiment": 5.0, "review_text": "It was great to read about her adventures."}, {"review_sentiment": 5.0, "review_text": "Marvelous and inspiring"}, {"review_sentiment": 5.0, "review_text": "Very enjoyable reading and interesting to get the back story behind the cookbooks."}]}, "authors": ["Julia Child", "Alex Prud'homme"], "isbn": "0307277690", "longitude": 2.3514992, "periods": ["1900s"], "title": "My Life in France", "word_cloud": "really enjoy friendly tone peek provide fascinating recommend writing always contain pearl wisdom chew eat morsel wonderful experience regret amaze hear julia voice page cute really justice read piece expat really touch live recommend anybody matter love food love travel love true account strong woman want laugh bit incredibly enjoyable much closer look ever intense peak time incredibly endear want end favorite enthusiast culinary art engage bursting lovely sensory detail really provide sense place taste accent french word expression almost taste food triumph disappointment appreciate relationship husband friends marvelous story great adventure marvelous inspiring very enjoyable read interesting back story cookbook", "genres": ["Memoir", "Food and Wine"], "summary": "Julia Child singlehandedly created a new approach to American cuisine with her cookbook Mastering the Art of French Cooking and her television show The French Chef, but as she reveals in this bestselling memoir, she was not always a master chef.\r\n\r\nIndeed, when she first arrived in France in 1948 with her husband, Paul, who was to work for the USIS, she spoke no French and knew nothing about the country itself. But as she dove into French culture, buying food at local markets and taking classes at the Cordon Bleu, her life changed forever with her newfound passion for cooking and teaching. Julia’s unforgettable story – struggles with the head of the Cordon Bleu, rejections from publishers to whom she sent her now-famous cookbook, a wonderful, nearly fifty-year long marriage that took them across the globe – unfolds with the spirit so key to her success as a chef and a writer, brilliantly capturing one of the most endearing American personalities of the last fifty years.", "asin": "0307277690", "rank": "21366", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51x03jEqTYL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}