{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 133, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I loved the humour in this book.  Dry, understated, and laugh-out-loud funny.  It has that reserved country Australia larrikin tone... with all the warmth of humanity shining through.  Great plot.  Page-turner.  Beautifully descriptive, without being laborious or pretentious.  Highly recommend to readers and would-be authors.  I love the overall message... try 99 times... useless... then try one more.  It’s a ripper of a yarn."}, {"review_sentiment": 3.0, "review_text": "Some of the prose was quite engaging but overall it was not the best crime fiction I have read. The characters were uninteresting and underdeveloped and there were too many which did not advance the plot. The ending part in the old theatre was just plain weird!"}, {"review_sentiment": 3.0, "review_text": "The story hangs together reasonably well, but very negative towards Australian law enforcement."}, {"review_sentiment": 2.0, "review_text": "I chose this as my book club pick and am sorry to have recommended it to the group. I'm not averse to learning new mannerisms of speech and can usually catch the flow of a book that is written with vernacular, but the Aussie verbiage requires constant flipping to the glossary. I am thankful for the glossary, but even with it, I struggle with the writing style. Here I am waiting for something to grip my attention but am stumbling through 100 pages of \"He walked to the corner. On the way he passed two milk bars, three grocery stores, a chemist, a lady waiting for a cab, and a brothel.\"Every time he walks into a room he \"opens the window, walks to the fridge, takes out some juice, adjusts the curtain, thinks about sitting down.\" If those redundant and unnecessary phrases were edited out, the book would be 1/3 as long. Hard book to read."}, {"review_sentiment": 4.0, "review_text": "Well written, characters well done; interactions between the characters generally excellent; dogs fascinating - until their behavior and attached prose become too repetitive; and plot very good, not tremendously original, but having its several elements very well blended and very well presented - until it becomes obvious what the original crime was and who did it, and the only thing left to wade through the unfolding of that and learn which of the surviving victims did the the final crime.In terms of the rating: it was a five most of the way through, then slid to a three. And ended with an enormous flaw: it didn't end. The climactic action scene, set up to show the enormous flaw in our hero, ends in the prose before the action ends, so we have to make assumptions about what happened. Extremely bad technique: I've encountered it previously only in a wretched American thriller."}, {"review_sentiment": 5.0, "review_text": "Awesome"}, {"review_sentiment": 5.0, "review_text": "A compelling and interesting police procedural set in Port Munro and Cromarty--two small towns near Melbourne, Australia. The characters are three dimensional--though much of their pasts are alluded to rather than specifically detailed. This can be confusing sometimes. Also, the Australian dialect is occasionally incomprehensible despite the helpful glossary. Generally the meaning can be parsed from context, though. A very good book."}, {"review_sentiment": 5.0, "review_text": "First Temple novel I have read, enjoyed this one and ordered another. Enjoy the Aussie twist."}, {"review_sentiment": 5.0, "review_text": "Had to do a double take of all the \"Aussie-isms\" but enjoyed it all, better \"literature\" than most thrillers."}, {"review_sentiment": 4.0, "review_text": "A realistic portrayal of criminal behavior in an Australia that seems like a foreign land. It is Asia with indigenous people, surrounded by the Pacific Ocean, and oppressed by a western culture. Temple is a very intelligent writer. His theme can be a tough ride but he handles it brilliantly."}]}, "authors": ["Peter Temple"], "isbn": "0312427867", "longitude": 151.2164539, "periods": ["2000s", "Recent Releases"], "title": "The Broken Shore: A Novel", "word_cloud": "love humor understate funny reserve country larrikin tone warmth humanity shin plot descriptive laborious pretentious recommend reader author love overall message try time useless try ripper yarn prose quite engage overall best crime fiction character uninteresting underdevelop many advance plot end part old theater plain weird story hang together reasonably well negative towards australian law enforcement choose club pick sorry recommend group averse learn new mannerism speech usually catch flow write vernacular verbiage require constant flip glossary thankful glossary even struggle write style here wait something grip attention stumble page walk corner way pass milk bar grocery store chemist lady wait cab brothel time walk room open window walk fridge take juice adjusts curtain think sit redundant unnecessary phrase edit long well write character well do interaction character generally excellent dog fascinate behavior attach prose become repetitive plot good tremendously original several element well blend well present becomes obvious original crime thing leave wade unfolding learn survive victim final term rating way slide end enormous flaw end climactic action scene set show enormous flaw hero end prose action end make assumption happen extremely bad technique encounter previously wretched american thriller compelling interesting police procedural set small town character dimensional much past allude rather specifically confusing sometimes also australian dialect occasionally incomprehensible helpful glossary meaning parse context good first enjoy order twist double take enjoy better literature thriller realistic portrayal criminal behavior seem foreign land indigenous people surround oppress western culture intelligent writer theme tough ride handle brilliantly", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Winner of the CWA Duncan Lawrie Dagger Award (the most prestigious crime-writing prize in the world).\r\n\r\nShaken by a recent scrape with death, big-city detective Joe Cashin is posted to a quiet town in on the Australian coast. But soon the whole community is thrown into unrest by the murder of a local philanthropist, a man with some very disturbing secrets. \r\n\r\nThe Broken Shore is a brilliantly intricate crime procedural, and a moving novel about a place, a family, politics, and power.", "asin": "0312427867", "rank": "456488", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51xhMs5CmlL.jpg", "country": "Australia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}