{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 186, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "Somewhat light, but a pleasant read."}, {"review_sentiment": 5.0, "review_text": "Venice has been the subject for many authors:  Thomas Mann may be the best on the list.  However, Marina Fiorato deserves to join that list.  Her book delves into the history of Murano and Venice from the time when Venice was a great power on the world stage.  The sad part for those of us who have been fortunate enough to visit Venice before the tourist and the huge boats captured it, is seeing Venice today.  For that reason alone, books going back in time are awesome.  The series of books by Ms. Fiorato are a great follow up to the mystery series by Donna Leon.  Relaxing, informative, and fun to read!"}, {"review_sentiment": 5.0, "review_text": "Fascinating read. Stunning writing. Highly recommend!"}, {"review_sentiment": 5.0, "review_text": "Excellent book.  I learned a lot about Venice and Murano  in the process that makes me want to read more of the history. Held my interest throughout the whole book."}, {"review_sentiment": 3.0, "review_text": "Reminds me of the places I visited in Venice, with some history thrown in. Not a gripping page turner, but a good read."}, {"review_sentiment": 5.0, "review_text": "Excellent read.  A thought-provoking book.  I definitely recommend it.  Now I want to visit Venice and Murano to see the art of glass blowing for myself."}, {"review_sentiment": 4.0, "review_text": "i love this author, i bought a book at Florences railways station last summer and really want all her books but only this one arrived. I recommend the novel"}, {"review_sentiment": 3.0, "review_text": "This is like 2 books in 1, a standard romance which is not very original and a wonderful historical novel. Both are based in Venice and Venice is really the star with its churches, bridges and wandering streets."}, {"review_sentiment": 4.0, "review_text": "My favorite genre to read is either history or historic fiction. I love Venice and my husband and I are glassblowers. So needless to say I was thrilled to see this title. I very much enjoyed this story and the visions that were conjured of Venetian life, past and present. The historic facts are well done. But, I MUST take issue with the very idea of a glassblower working 1200 +/- degree hot glass with a bare hand! Can't be done...you would not only loose your fingerprints, but your entire hand! Also, the notion that any glassblower would work with hot glass barefoot!? No chance. There is so much broken glass and accidents are an unfortunate part of the art, that no one would be barefoot. I understand authors take artist liscense, but this book is beautiful and these two glaring issues would not change the story or make it more \"romantic\". It is a good read and may make you want to visit Venice even more. Great book for the flight to the most fabulous city in the world. (yes, I am bias)."}, {"review_sentiment": 4.0, "review_text": "I thoroughly enjoyed learning about the process of glassblowing and about Venice.I also enjoyed the simultaneous story threads of present and past and the multiple connections between characters of both time periods.I gave it four instead of five stars because, although the story was, for the most part, as shining as one of Corradino Manin's mirrors, it didn't completely blow me away:)"}]}, "authors": ["Marina Fiorato"], "isbn": "0312386982", "longitude": 12.3345898, "periods": ["1600s", "2000s", "Recent Releases"], "title": "The Glassblower of Murano", "word_cloud": "somewhat light pleasant subject many author list however deserve join list delf history time great power world stage sad part fortunate enough visit tourist huge boat capture see today reason alone go back time series great follow mystery series informative fun fascinate stun write recommend excellent learn lot process make want history interest whole reminds place visit history not grip page turner good excellent definitely recommend now want visit see art glass blowing author buy railways station last summer really arrive recommend like standard romance original wonderful historical base really star church bridge wander street favorite genre history historic fiction love husband glassblower so needle say thrill see title much enjoy story vision conjure venetian life present historic fact well do issue idea work degree hot glass bare hand do fingerprint entire hand also notion hot glass barefoot chance much broken glass accident unfortunate part art understand author take artist license beautiful glare issue story make romantic good want visit even flight fabulous city world yes bias thoroughly enjoy learn process glassblowing also enjoy simultaneous story thread present past multiple connection character time give instead star story part shin mirror completely", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Venice, 1681. Glassblowing is the lifeblood of the Republic, and Venetian mirrors are more precious than gold. Jealously guarded by the murderous Council of Ten, the glassblowers of Murano are virtually imprisoned on their island in the lagoon. But the greatest of the artists, Corradino Manin, sells his methods and his soul to the Sun King, Louis XIV of France, to protect his secret daughter. \r\n\r\nIn the present day his descendant, Leonora Manin, leaves an unhappy life in London to begin a new one as a glassblower in Venice. As she finds new life and love in her adoptive city, her fate becomes inextricably linked with that of her ancestor and the treacherous secrets of his life begin to come to light.", "asin": "0312386982", "rank": "332523", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51qznXgGnGL.jpg", "country": "Italy", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}