{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 93, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "This is a great reminder of the time and place of NYC at the end of the 70s. It misses the punk clubs but got the rest of the colliding factors right. A great read and ride."}, {"review_sentiment": 4.0, "review_text": "A readable, well-researched account of NYC in 1977, a year that NYC would probably rather forget. 1977: the year George Steinbrenner, Billy Martin, and Reggie Jackson kept sportswriters working overtime covering their many public disputes. The year a catastrophic power outage led to deadly riots and looting, destroying whole NYC neighborhoods. The year Studio 54 became a disco legend; SoHo, a quirky little artist community, was “discovered” (and arguably destroyed) by gentrification; and gays sunned themselves on abandoned peers, oblivious to the coming apocalypse of AIDS. The year Times Square gained notoriety not for its Broadway shows, but for its burgeoning, almost wholly unregulated porn industry. The year an obscure Australian media tycoon, Rupert Murdoch, bought the New York Post, marking the beginning of the Tabloid Era. The year rowdy Yankees fans regularly threw garbage on the field when they weren’t shouting obscenities at opposing teams or raining stale beer down on the heads of the patrons seated beneath them. The year a mysterious serial killer, dubbed Son of Sam, eluded a task force that at one point grew to include over 700 police officers. The year urban blight and housing projects created neighborhoods so bereft of hope, people torched their own unsellable houses for the insurance money. The year 3 living, breathing caricatures – Bella Abzug, Mario Cuomo and Abe Beame – battled for the right to run a city that was literally going up in smoke. The year NYC’s liberal legacy (rent-controlled apartments, generous municipal salaries and pensions, free higher education), already stretched and strained, finally broke. The year one of the greatest cities in the world skidded into fiscal chaos and officially declared bankruptcy.In other words, Mahler has plenty of material to cover! And so he does, in the form of 67 brief, breezy, detail-filled chapters, replete with authentic eyewitness accounts and seeped in ‘70s “vibe”. Indeed, the narrative is so engaging and readable, I ended up enjoying parts of this I expected merely to endure. (Accounts of political campaigns and labor strikes not being my usually my cup of tea.)Like many folks my age, I’ve spent much of my life trying to forget that I lived through this turbulent decade in America’s history. Yes, Mahler’s narrative serves as an unstinting, unapologetic reminder of everything that was awful about the 70s. But it also forced me to appreciate the remarkable adaptability and resiliency of American culture. Sure, we’ve faced challenges as a nation – poverty, racism, bigotry, violence, really bad music – but even in the depths of despair, our hope never completely fails, our empathy never entirely falters, our ingenuity endures, and we keeping finding ways to triumph over the forces of greed, intolerance, and general boorishness. A lesson I’m trying to take to heart as our country once against finds itself struggling to rise above our old, familiar demons."}, {"review_sentiment": 5.0, "review_text": "well written"}, {"review_sentiment": 5.0, "review_text": "As someone who grew up in Brooklyn during these years I found this to be a wonderful summary. Written by someone who was not living here, Mahler does a terrific job capturing the intricacies of the era. I'm buying the DVD next!  Well written, educational and entertaining all at once."}, {"review_sentiment": 5.0, "review_text": "Really enjoyable look at NYC in the mid-1970s centered around the Yankees. It brought back a lot of memories, the good, bad, and the ugly. The author's insights into the 1977 blackout and its impact in Bushwick is exceptional."}, {"review_sentiment": 1.0, "review_text": "Flat writing and strangely uninteresting.  Could not even finish it, despite my love of NYC and fascination with this time period."}, {"review_sentiment": 5.0, "review_text": "I have really enjoyed this book not so much for the NY Yankees and their return to prominence but for the history of New York at this crucial time in its existence.  Truly fascinating with a host of memorable events and characters.  A great read!"}, {"review_sentiment": 5.0, "review_text": "Great Story.  Especially if you lived through it."}, {"review_sentiment": 5.0, "review_text": "Really interesting and great writing. If you like to learn about the history of New York this is a great read."}, {"review_sentiment": 5.0, "review_text": "A skillfully and well researched accounting of both NYC politics and the NY Yankees. I lived through this period of NY history and Jonathan Mahler hits a home-run with his incredibly interesting commentary!"}]}, "authors": ["Jonathan Mahler"], "isbn": "0312424302", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Ladies and Gentlemen, the Bronx Is Burning: 1977, Baseball, Politics, and the Battle for the Soul of a City", "word_cloud": "great reminder time place end miss punk club get rest colliding factor right great ride readable account year probably rather year keep sportswriter work overtime cover many public dispute year catastrophic power outage lead deadly riot loot destroy whole neighborhood year become disco legend quirky little artist community discover arguably destroy gentrification gay sun abandoned peer oblivious come apocalypse year gain show burgeon almost wholly unregulated porn industry year obscure australian medium tycoon buy mark begin year rowdy yankee fan regularly throw garbage field shout obscenity oppose team rain stale beer head patron seat year mysterious serial killer dub elude task force point grow include police officer year urban blight housing project create neighborhood bereft hope people torch unsalable house insurance money year live breathing caricature battle right run literally go smoke year liberal legacy apartment generous municipal salary pension free higher education already stretch strain finally break year greatest city world skid fiscal chaos officially declare word plenty material cover form brief breezy chapter replete authentic eyewitness account seep vibe indeed narrative engage readable end enjoy part expect merely endure political campaign labor strike usually cup tea many folk age spend much life try forget live turbulent decade history narrative serf unstinting unapologetic reminder everything awful also force appreciate remarkable adaptability resiliency american culture face challenge nation poverty racism bigotry violence really bad music even depth hope never completely fail empathy never entirely falter ingenuity endures keep find way triumph force greed intolerance general boorishness lesson try heart country find struggle old familiar demon well write someone grow year find wonderful summary someone live terrific job capture intricacy era buy next write educational entertaining really enjoyable look center yankee bring lot memory good bad ugly author insight impact exceptional flat write strangely uninteresting even finish love fascination time period really enjoy much return prominence history crucial time existence fascinate host memorable event character great live really interesting great write learn history great skillfully well researched accounting politics yankees live period history hit incredibly interesting commentary", "genres": ["History", "Politics", "Sport"], "summary": "A passionate and dramatic account of a year in the life of a city, when baseball and crime reigned supreme, and when several remarkable figures emerged to steer New York clear of one of its most harrowing periods.\r\n\r\nBy early 1977, the metropolis was in the grip of hysteria caused by a murderer dubbed \"Son of Sam.\" And on a sweltering night in July, a citywide power outage touched off an orgy of looting and arson that led to the largest mass arrest in New York's history. As the turbulent year wore on, the city became absorbed in two epic battles: the fight between Yankee slugger Reggie Jackson and team manager Billy Martin, and the battle between Ed Koch and Mario Cuomo for the city's mayoralty. Buried beneath these parallel conflicts―one for the soul of baseball, the other for the soul of the city―was the subtext of race. The brash and confident Jackson took every black myth and threw it back in white America's face. Meanwhile, Koch and Cuomo ran bitterly negative campaigns that played upon urbanites' fears of soaring crime and falling municipal budgets.\r\n\r\nThese braided stories tell the history of a year that saw the opening of Studio 54, the evolution of punk rock, and the dawning of modern SoHo. As the pragmatist Koch defeated the visionary Cuomo and as Reggie Jackson finally rescued a team racked with dissension,1977 became a year of survival but also of hope.\r\n\r\nLadies and Gentlemen, the Bronx Is Burning is a New York Times Notable Book of the Year, and the basis of the 2007 ESPN miniseries, starring John Turturro as Billy Martin, Oliver Platt as George Steinbrenner, and Daniel Sunjata as Reggie Jackson.\r\n\r\n\"Ambitiously conceived, marvelously told . . . Mahler weaves several stories into one grand narrative of the city's death and rebirth. . . . It all comes back, in living color . . . a tour de force.” The New York Times", "asin": "0312424302", "rank": "60572", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/615q6zr2LtL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}