{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 22, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I came to Stuart Dybek through his poetry, STREETS IN THEIR OWN INK, poems that I find myself reading again and again.  Dybek is a Chicago poet.  That led me to I SAILED WITH MAGELLAN, a series of loosely collected short stories.Chicago is a city of neighborhoods and when Dybek was growing up those neighborhoods were ethnic.  His, Polish.  Through alter ego Perry Katzek, these eleven stories introduce us to damaged war veterans, the neighborhood bar, the neighborhood hoodlums.  Perry’s father, always on the lookout for a bargain, torments his two sons with an annual trek to find the cheapest Christmas tree.  He bargains over every purchase on Maxwell Street.  He stops in the street to retrieve lumber and scarps that he might find useful.Poets who turn their efforts to prose are usually great stylists.  Dybek is no exception; his prose is remarkable, spare yet full.“Breasts” is novella-length short story that gives off a “Goodfellas” vibe, while “Blue Boy” almost has a thread of magical realism.  A wonderful collection."}, {"review_sentiment": 5.0, "review_text": "Great story writer. Fantastic collection."}, {"review_sentiment": 4.0, "review_text": "This is a great book about Chicago, from a wonderful author who is giving us insights into his childhood and neighborhood, as someone who is Polish, but also living in a diverse neighborhood. Stuart has the gift of making the personal a universal message, gritty and real, sad in many places, but also hopeful. I loved this book."}, {"review_sentiment": 2.0, "review_text": "Parts are great, many parts are.very slow"}, {"review_sentiment": 5.0, "review_text": "The book was recommended by a friend whose opinion I respect.  The Author is an accomplished writer and I believe that this book is almost an American Classic."}, {"review_sentiment": 5.0, "review_text": "Absolutely wonderful!"}, {"review_sentiment": 5.0, "review_text": "Dybek is a brilliant writer and one of the most humorous writers I've ever read. His prose is often quite poetic and his descriptions of Chicago and its characters are funny, poignant and sometimes sad. As a longtime Chicago resident, I appreciate how well he captures an era that I just missed but that my father sometimes speaks about and which you can find captured in old photos of the city. His writing also sometimes has an ethereal, surreal or dreamlike mystical quality that is somewhat similar at times to some of the work by Michael Ondaatje or Paul Bowles.  I've read everything Dybek has written and look forward to his new work."}, {"review_sentiment": 3.0, "review_text": "Hasn't just taken my beathe away.  I don't read much but thought this would make me feel warm and fuzzy about growing up in Chicago."}, {"review_sentiment": 4.0, "review_text": "Enjoyable, but not as compelling as I had hoped."}, {"review_sentiment": 5.0, "review_text": "Great stories."}]}, "authors": ["Stuart Dybek"], "isbn": "0312424116", "longitude": -87.6244212, "periods": ["2000s"], "title": "I Sailed with Magellan", "word_cloud": "come poetry poems find read poet lead series loosely collected short city neighborhood grow neighborhood ethnic polish alter ego eleven story introduce damage war veteran neighborhood bar neighborhood hoodlum father always lookout bargain torment son annual trek find cheapest tree bargain purchase stop street retrieve scarp turn effort prose usually great stylist exception prose remarkable spare yet short story give vibe almost thread magical realism wonderful collection story writer collection great wonderful author give insight childhood neighborhood someone also live diverse neighborhood gift make personal universal message gritty real sad many place also hopeful love part great many part recommended friend opinion respect accomplish writer believe almost american absolutely wonderful brilliant writer humorous writer ever prose often quite poetic description character funny poignant sometimes sad longtime resident appreciate well capture era miss father sometimes speaks find capture old photo city writing also sometimes ethereal surreal dreamlike mystical quality somewhat similar time work everything write look forward new work take bathe away much thought warm fuzzy grow enjoyable compelling hop story", "genres": ["Fiction & Literature"], "summary": "Major new fiction from an acclaimed master\r\n\r\nFrom the prizewinning writer Stuart Dybek comes a superb new work: a novel-in-stories, eleven masterful tales told by a single voice with remarkable narrative power. In I Sailed With Magellan, Dybek finds characters of irrepressible vitality amidst the stark urban landscapes of Chicago's south side; there, the daily experiences of the neighborhood are transformed in the lush imaginative adventures of his hero, the restless Perry Katzek.\r\n\r\nThere is remarkable music in each of Dybek's intertwined episodes, the rhythm of street life captured in all its emotional depth and unexpected humor: a man takes his young nephew to a string of taverns where the boy sings for his uncle's bourbon; a small-time thug is distracted from making a hit by the mysterious reappearance of several ex-girlfriends; two unemployed youths hatch a scheme to finance their road trip to Mexico by selling orchids stolen from the rich side of town; a young couple's amorous beach adventure is interrupted when an unexpected visitor washes ashore. \r\n\r\nAs these poignant, often funny chapters unfold, Perry grapples toward the exotic possibilities the world offers him, glimpsing them even beneath the at times brutal surface of the inner-city.\r\n\r\nThroughout I Sailed With Magellan, fans of Dybek will find the captivating storytelling, the sharp, spare prose, the brilliant dramatization of resilient, inventive humanity that they have come to expect from him.", "asin": "0312424116", "rank": "347619", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51mq1wKGLVL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}