{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -12.0621065, "ratings": {"num_ratings": 110, "rating": 3.7, "reviews": [{"review_sentiment": 3.0, "review_text": "Not as good as \"The discreet hero\". This novel is too long for what it portrays, describes, conveys. It should have been edited before publishing. The plots of the various stories are often far-fetched. The best story in the book is, of course, the main character's, the author himself, with his pals and friends, their life, in their environment, at the time of his youth in Lima."}, {"review_sentiment": 2.0, "review_text": "I wanted to read a book based in Peru. I liked learning about modern Peruvian life. I liked the first person story telling of the main character. But the interweaving of other tales were not that interesting. The main love story was a bit blah, and the ending too. I wouldn't really recommend it."}, {"review_sentiment": 2.0, "review_text": "This author was recommended to me by a friend I had recently met. I am not sure what this friend likes about this writing. I found the many story lines punishing to get through. The flip between \"reality\" of daily living and the fantasy of the soap opera writer was confusing. If the author won major awards for this kind of prose it must be because it is unlike anything else written. My feelings for the characters would just become close when the character disappears. I felt sorry for the protagonist and for the author who must live such a messy life. The abrupt ending was typical of the book. A young man's selfish story of making do in life without contributing to anyone's welfare. Very selfish."}, {"review_sentiment": 4.0, "review_text": "Enjoyable and beautifully written. I particularly enjoyed the main story running through the book. By the end I was struggling with reading yet another of the radio serial stories interspersed throughout the book and started to skim read them - they were fabulously written, inventive and showed a slice of South American life in weird and wonderful ways but maybe there were one or two too many."}, {"review_sentiment": 5.0, "review_text": "One of his best; I laughed and laughed and wanted to say thank you to the author."}, {"review_sentiment": 4.0, "review_text": "It is an entertaining read with a lot of humor. Not a great book. We read it for our men's book group."}, {"review_sentiment": 5.0, "review_text": "Very interesting book"}, {"review_sentiment": 5.0, "review_text": "Thrilling!!!"}, {"review_sentiment": 3.0, "review_text": "Much of the humor gets lost in translation."}, {"review_sentiment": 4.0, "review_text": "My interest waned towards the end. It seemed like Vargas Llosa was enjoying himself as he went along without too much regard for holding on to the reader's attention. Brilliant flashes, but seemed less \"serious\" than many of his books, by which I don't mean it was humorous (which of course it was)."}]}, "authors": ["Mario Vargas Llosa"], "isbn": "0312427247", "longitude": -77.0365256, "periods": ["1900s"], "title": "Aunt Julia and the Scriptwriter: A Novel", "word_cloud": "not good discreet hero long portray describes conveys edit publish plot various story often best story course main character author pal friends life environment time youth want base like learn modern peruvian life like first person story tell main character interweave tale interest main love story bit blah end really author recommend friend recently meet sure friend like write find many story line punish flip reality daily live fantasy soap opera writer confuse author major award kind prose anything else write feeling character close character disappears felt sorry protagonist author messy life abrupt end typical young man selfish story make life contribute anyone welfare selfish enjoyable beautifully write particularly enjoy main story run end struggle read yet radio serial story intersperse start skim fabulously write inventive show slice american life weird wonderful way maybe many best laugh laugh want say thank author entertain lot humor not great men group very interesting thrill much humor get lose translation interest wan towards seem enjoy go along much regard hold attention flash seem le serious many mean humorous course", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Mario Vargas Llosa's brilliant, multilayered novel is set in the Lima, Peru, of the author's youth, where a young student named Marito is toiling away in the news department of a local radio station. His young life is disrupted by two arrivals.\r\n\r\nThe first is his aunt Julia, recently divorced and thirteen years older, with whom he begins a secret affair. The second is a manic radio scriptwriter named Pedro Camacho, whose racy, vituperative soap operas are holding the city's listeners in thrall. Pedro chooses young Marito to be his confidant as he slowly goes insane.\r\n\r\nInterweaving the story of Marito's life with the ever-more-fevered tales of Pedro Camacho, Vargas Llosa's novel is hilarious, mischievous, and masterful, a classic named one of the best books of the year by the New York Times Book Review.", "asin": "0312427247", "rank": "370779", "city": "Lima", "image": "https://images-na.ssl-images-amazon.com/images/I/51K-Ac5mEYL.jpg", "country": "Peru", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}