{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 11, "rating": 3.7, "reviews": [{"review_sentiment": 3.0, "review_text": "Usually I am VERY satisfied with EVERYTHING that I get via Amazon.  However, this book had tunnel-like holes throughout it as if termites or some other insect used my book as if it was an entree AND dessert.  I was very disappointed because I looked forward to reading THIS particular book especially."}, {"review_sentiment": 4.0, "review_text": "This is a very detailed account of this magnanimous personality called the \"Sparrow\" by his father. I ordered his music on Amazon and listened as I read and really got the sense of truly knowing the man as the author goes through every step of Le Chevalier's life in cleverly titled chapters. There is only one disappointment. We lose track of his mother, Nanon once they arrive in France. There is mentioning of her but Guede doesn't let us know at what point Saint Georges mother dies, if she made friends, still was the mistress to his father...nothing. Nonetheless, I especially appreciate the connections made between Saint-George and General Alexandre Dumas and Marie Antionette. It was an extremely emotional experience of which I am forever changed by."}, {"review_sentiment": 5.0, "review_text": "You breath the social/political/cultural/economic/artistic times of one of the leading lights of classical music who the world has yet to honor adequately."}, {"review_sentiment": 5.0, "review_text": "This book is a extremely well written biography of one of history's most talented, yet obscured persons. Saint-George was a man of immense talents, but could not overcome the stigma of belonging to two seperate worlds, one of acceptance, and one of color. The story is poignant in it's telling but tragic in it's ending. It is my strong desire to turn this story into a screenplay so that all the world can come to know the story of this tragic figure. A worthwhile read!"}, {"review_sentiment": 3.0, "review_text": "I became aware of St. Georges through harp history... his having been a teacher to Marie Anotoine - she being one who really helped advance and revolutionized the harp.  Familiar with his music and wanting to know a bit more about him, I purchased this book.Overall, I found the book very enjoiable.  Perhaps one of them most important features of the book is the sections dealing with his joingin of/and place within the Masons, and their history as almost a \"salon\" for learned men.  (Mozart was also a member.)There is a really long, protracted history of the slave trade that I found both gratuitous, unneccessary, and ... irritating.  It amounts to a treatise on why slavery is bad... and anyone interested in the telling of this fairly obscure historical life has all ready grasped that.  Ironically, the issue of slavery and the place of blacks in French society is more needed to fully understand St. George's life in that society... and there is no mention of it.  (There was white slavery in Britain - gentilely called indentured servitude - and the class system which amounted to slavery... so this was going on in France, too.)  He mentions black children being kept as \"pets\" but doesn't mention what happened to them when they got older... yet there were enough blacks for St. George to command a regiment.  So we have no persepective on his relations with any blacks other than Dumas.... one of the few who would have been his social and educational equal.So while there are some gaps and problems with the book (noted by the reviewer with the historical corrections) - quoting previous fictionalized histories is common - still it is interesting, and there clearly is an amount of reasearch and it is overall an interesting read, the story of a person we don't hear much of."}, {"review_sentiment": 5.0, "review_text": "I've seen this book priced for much more and in much worse shape than I've received.  It's a great historical source on the Black french slave trade. The book itself was practically brand new and arrived very quickly."}, {"review_sentiment": 5.0, "review_text": "This was an excellent bio of a remarkable polymath.Thank you Alain Guede for your fine curriculum vitaeon Monsieur Saint-George.For those of us who enjoys a insightful,entertainingand yes even inspiring non-fiction read.Here is a Man whose story truly deserves to be widely read.NOT TO BE MISSED!"}, {"review_sentiment": 3.0, "review_text": "I purchased this book after seeing a television documentary on Monsieur de Saint-George, and was fascinated by his life and achievements (and eager to hear more of his music).Unfortunately, though the his life is fascinating and takes many turns, the quality of the storytelling here is not up to the task.  As anyone who has read academic research will know, a remarkable topic can quickly be drowned out by droning prose.Having said that,  I felt at every point eager to hear the next twist or turn of this man's life.  Perhaps someone will do him better service.PS - Suggest if you decide to proceed with this book, that you purchase the music to listen to as you read.  Perhaps it will improve the whole experience, and will definitely give you better insight into his achievements."}, {"review_sentiment": 5.0, "review_text": "Monsieur De Saint-George: Virtuoso, Swordsman, Revolutionary is the amazing biography of Joseph Boulogne de Saint-George, the son of a slave mother and a gentleman father and the trail he blazed through eighteenth-century aristocratic circles to become one of the greatest of the French composers. Also known for his talented violin playing, his superb swordsmanship, and his passionate hope for a future that would promote equal rights for human beings regardless of color. An enthralling life story which was definitely researched and superbly written by biographer Alain Guede, Monsieur De Saint-George is a quite significant contribution to Black Studies and Music History collections."}, {"review_sentiment": 1.0, "review_text": "Mr. Guede's book is about a wonderful charactor, but the scholarship is poor.  He uses footnotes, but they are to other works of fiction. He spends much time talking about the family of St.-Georges' father, without checking the very clear and obtainable documents that prove he is another man entirely. This is important because St.-Georges made his way in Parisian society on his own, not as son of  a wealthy minister. Gede says he was called \"Chevalier\" by his father, when his apointment by Louis XV to the Gendarme du Roi made him a Chevalier automatically. It was an honor he earned. It takes nerve to write a biography of a musician without even an elemental knowledge of music.  For example the author writes: \"Gossec named him (St.-Georges) first violin and time keeper. \" The author then goes on to say the first violin (concertmaster) stands up in performances, and that as timekeeper he uses his baton to set the tempo in rehearsals, being preferred to a metronome. What is the conductor suposed to be doing?Finally, the author inserts gratuitous racial remarks such as: \"the thick layers of powder he used to hide the color of his skin\", or  Plato, his (fictional) violin teacher saying \"Follow the score or you will always play like a Negro\", or \"Voltaire would not defend a Negro unless he was attacked by a Jew\"St.-Georges deserves a better writer."}]}, "authors": ["Alain Guédé"], "isbn": "0312309279", "longitude": 2.3514992, "periods": ["1700s"], "title": "Monsieur de Saint-George: Virtuoso, Swordsman, Revolutionary: A Legendary Life Rediscovered", "word_cloud": "usually satisfy everything get however hole termite insect use entree dessert disappoint look forward read particular especially detailed account magnanimous personality call father order music listen really get sense truly know man author go step cleverly title chapter disappointment lose mother arrive mention point mother dy make friend still mistress father nothing nonetheless especially appreciate connection make extremely emotional experience forever change breath time lead light classical music world yet honor adequately extremely well write biography history talented yet obscure person man immense talent stigma belong separate world acceptance color story poignant tell tragic end strong desire turn story screenplay world come know story tragic figure worthwhile become aware harp history teacher really help revolutionize harp music want know bit purchase find enjoyable perhaps important feature section deal joining place history almost salon learn men also member really long protracted history slave trade find gratuitous unnecessary irritate amount treatise slavery bad anyone interested tell fairly obscure historical ready grasp issue slavery place black french society need fully society mention white slavery gentile call indentured servitude class system amount slavery go mention black child keep pet mention happen get older yet enough black command regiment so perspective relation black social educational gap problem note reviewer historical correction quote previous fictionalized history common still interest clearly amount research overall interesting story person hear much see price much much worse shape receive great historical source french slave trade practically brand new arrive quickly excellent bio remarkable fine curriculum vita eon enjoy insightful entertaining and yes even inspire story truly deserve widely purchase see television documentary fascinate achievement eager hear music fascinate take many turn quality storytelling task anyone academic research know remarkable topic quickly drown drone say felt point eager hear next twist turn man perhaps someone better decide proceed purchase music listen perhaps whole experience definitely give better insight achievement amaze biography son slave mother gentleman father trail blaze aristocratic circle become greatest french composer also know talented violin play superb swordsmanship passionate hope future equal right human being regardless color enthralling story definitely research superbly write biographer significant contribution collection wonderful character scholarship poor use footnote work fiction spend much time talk family father check clear obtainable document prove man entirely important make way parisian society son wealthy minister say call father appointment dew make automatically honor earn take write biography musician even elemental knowledge music example author write name first violin time author go say first violin concertmaster stand performance timekeeper us baton set tempo rehearsal prefer conductor suppose author insert gratuitous racial remark thick layer powder use hide color skin fictional violin teacher say score always play attack deserve better writer", "genres": ["Biography", "Music"], "summary": "The first full biography of one of the greatest figures of eighteenth-century Europe, known in his time as the \"Black Mozart\"\r\n\r\nVirtually forgotten until now, his life is the stuff of legend. Born in 1739 in Guadeloupe to a slave mother and a French noble father, he became the finest swordsman of his age, an insider at the doomed court of Louis XVI, and, most of all, a virtuosic musician. A violinist, he directed the Olympic Society of Concerts, which was considered the finest in Europe in an age of great musicians, including Haydn, from whom he commissioned a symphony, and Mozart, to whom he was often compared. He also became the first Freemason of color, embracing the French Revolution with the belief that it would end the racism against which—despite his illustrious achievements—he struggled his whole life. \r\n\r\nThis is the life of Joseph Bologne, known variously as Monsieur de Saint-George, the “Black Mozart,” and, because of his origins, \"the American.\" Alain Guédé offers a fascinating account of this extraordinary individual, whose musical compositions are at long last being revived and whose story will never again be forgotten.", "asin": "0312309279", "rank": "2077163", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51iXWciXy9L.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}