{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 43, "rating": 3.4, "reviews": [{"review_sentiment": 3.0, "review_text": "iked the first and last tales the best. The first with the cat knowing what was happening and the last as it was genuinely spooky. The man has great lectures on Writing Great Fiction from the Great Courses. He just doesn't always practice what he preaches."}, {"review_sentiment": 1.0, "review_text": "Rate as Zero [0]. The copy that arrived was defective. The replacement copy that arrived also was defective. All i wanted was a non-defective copy of this book to read but was told if a third copy was sent it was just as likely to be defective. So Amazon opted to refund my money (which i received). Can anyone suggest a supplier that can provide a non-defective copy?"}, {"review_sentiment": 4.0, "review_text": "Three separate stories that interweave near the end.  The first is average but things improve in two and three, with increasing amounts of supernatural coming in.  Started feeling like a Neal Gaimon story as things improved."}, {"review_sentiment": 4.0, "review_text": "Picked this up for a few cents so I thought why not. It's mainly a collection of 3 short stories that detail the friction between unfaithful spouses with teaching positions who work far from home.... and their significant others' cats who pick up on it through their 6th sense. Dark and witty."}, {"review_sentiment": 3.0, "review_text": "I was referred to Publish & Perish as an example of the more recent `campus novels'. Although the three stories that comprise this work have university lecturers or professors as their characters, and a university setting in Casting the Runes, they really do not tell the reader that much about academia. One gets some idea about the importance and difficulty of publishing in Queen of the Jungle and some sense of the all-too-frequent problem of the appropriation of the work of doctoral students by their dissertation advisors in Casting the Runes, but nothing much beyond that.There is elegance to the writing and a few interesting academic and cultural observations and insights. But, I found the horror or supernatural elements in all of these stories to be unappealing and quite a distraction.Not what I would call a good recent example of the `campus novel' genre compared to Straight Man by Richard Russo or Lorenzostein by Mary Smetley, or the first half of Hynes's The Lecturer's Tale."}, {"review_sentiment": 5.0, "review_text": "This is a pretty amazing book. The stories are the perfect length for reading while waiting for a connecting flight, or on lunch break. Each one is well-written and richly textured - life in academia has never seemed so real or so frightening. I purchased this collection for a class in horror lit, and I kept it because I really enjoyed it. If you're a fan of horror do yourself a favor and put this in your cart."}, {"review_sentiment": 5.0, "review_text": "Is that even a genre? I guess it is now! If David Lodge had added the paranormal, it might have come out something like this. \"Queen of the Night\" stayed with me for years."}, {"review_sentiment": 4.0, "review_text": "I love a good spoof on academia, so I picked this up and starting reading the first story (Queen of the Jungle) late one night and stayed up all night finishing it! It was genuinely suspenseful and intriguing. I must add that I found the final scenes disturbing as they depict animal cruelty. I started the next story and had trouble finishing it- I didn't really care what happened. The final story had completely lost my interest. The problem with unlikeable characters is that after a while you need a reason to care.  The first story had the cat to keep our interest and probably that was the most important part of the whole book!"}, {"review_sentiment": 2.0, "review_text": "The first two novellas are certainly accomplished on a technical level, and the satire on postmodernist academia is often remarkably apt and on target, but the novellas are undercut by the very assumptions they supposedly see through.  In all three novellas the characters are not allowed to come to life, rather they are puppets in the service of ultimately dehumanizing plot devices.  All this is forgivable in the name of witty entertainment, but in truth the end result is to celebrate the author's superior saavy not the genuine complexities of life.  Some have suggested that characters in the third novella are more sympathetic, but Virginia, too, is not really allowed to come to life and the ghost story genre renders everything unreal from the start.  Who can doubt that Vic the Impaler will find his quietas on the point of Jim Bowie's knife?  In sum, these novellas probably provide psychic relief for grad students, but they are written by a novelist who is still far more a smartass than a wise man."}, {"review_sentiment": 5.0, "review_text": "I read this book years ago, but was just thinking about it.  The stories, especially the first, \"Queen of the Jungle\" have stayed with me through the years.  Hynes' proves himself to be a master of the uncanny and of the novella form.  While each of the stories are linked through the theme of academia and occasional \"cameos\" by characters, each stands on its own.  Highly recommended!"}]}, "authors": ["James Hynes"], "isbn": "0312186967", "longitude": -97.7436995, "periods": ["2000s", "Recent Releases"], "title": "Publish and Perish: Three Tales of Tenure and Terror", "word_cloud": "ink first last best first cat know happen last genuinely spooky man great lecture write course always practice preaches rate copy arrive defective replacement copy arrive also defective want copy tell third copy send likely defective opt refund money receive anyone suggest supplier provide copy separate story interweave near end first average thing improve increase amount supernatural come start feel story thing improve pick cent think mainly collection short story detail friction unfaithful spouse teach position work far home significant others cat pick sense witty refer example recent novel story comprise work university lecturer professor character university set really much get idea importance difficulty publish sense problem appropriation work doctoral student dissertation adviser cast nothing much elegance write interesting academic cultural observation insight find horror supernatural element story unappealing quite good recent example genre compare first half haynes pretty amaze story perfect length reading wait connect flight lunch richly textured life academia never seem real frightening purchase collection class horror lit keep really enjoy fan horror favor put cart be even genre guess add paranormal something stay year love good spoof academia pick start read first story late night stay night finish genuinely suspenseful intriguing find final scene disturb depict animal cruelty start next story trouble finish really happen final story completely lose interest problem unlikable character need reason first story cat interest probably important part whole first novella certainly accomplish technical level satire postmodernist academia often remarkably apt target novella undercut assumption supposedly see novella character allow come life rather puppets service ultimately dehumanize plot device forgivable name witty entertainment truth end result celebrate author superior savvy genuine complexity life suggest character third novella sympathetic really allow come life ghost story genre render everything unreal start doubt find quiet point knife sum novella probably psychic relief grad student write novelist still far smart ass wise man year ago think story especially first queen stay year prove master uncanny novella form story link theme academia occasional cameo character stand recommend", "genres": ["Fiction & Literature", "Mystery & Suspense", "Satire"], "summary": "A New York Times Notable Book of the Year\r\n\r\nCombining the wit of David Lodge with Poe's delicious sense of the macabre, these are three witty, spooky novellas of satire set in academia―a world where Derrida rules, love is a \"complicated ideological position,\" and poetic justice is served with an ideological twist.\r\n\r\n\"Riveting . . . exhilarating . . . a work of sheer joy.\" The New York Times \r\n", "asin": "0312186967", "rank": "1319900", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51NNyaue3sL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}