{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 32, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "This is both a useful (if you have access to Los Angeles) and an entertaining read."}, {"review_sentiment": 3.0, "review_text": "This is an incredible book, with incredible reviews and culinary insights, no doubt. BUT it is so poorly edited and organized. Instead of a neighborhood reference or food groups by chapter, the book is organized in alphabetical order: it would be such an easy editorial fix. To find food by style/ethnicity, you must check the index in the back, which isn't so bad. But doubly frustrating, is that none of the spots are organized by area in the Los Angeles area, so...after getting excited for a new Burmese restaurant to check out, you are let down to realize that after getting your hopes up, the place is XX miles away in Riverside. No searching for a local spot, you've gotta dig. Maybe this was the intention to make us all go out an explore for ourselves."}, {"review_sentiment": 4.0, "review_text": "Oh my gawd! J.G. is the best! His prose makes my heart flutter. His creativity leaves me awe struck. And wrap it all up with the actual food reviews in a neat little box and I'm left entertained and inspired. I don't even care that this book is old and probably out of date. His writing is colorful, though provoking and timeless. 5 stars for this book.4 stars because the book came damaged and bent, of which I did not buy a used book. The book stays completely cracked open to the middle of the book like the spine is broken but it's not."}, {"review_sentiment": 5.0, "review_text": "Fab book on the little known zones and hoods of LA and the best places to eat"}, {"review_sentiment": 5.0, "review_text": "Better than Yelp for the places he reviews. Enjoyable writer. Loved it!"}, {"review_sentiment": 3.0, "review_text": "I enjoyed the book, but I would have preferred a broader selection of restaurants reviewed."}, {"review_sentiment": 5.0, "review_text": "outdated as a city guide, wonderful for fun food reading"}, {"review_sentiment": 5.0, "review_text": "just want I wanted"}, {"review_sentiment": 4.0, "review_text": "Great book about places to eat in LA with special mention of those places that are affordable."}, {"review_sentiment": 5.0, "review_text": "Jonathan Gold's work is to gastronomic writing what Alan Moore is to the graphic novel.That's pretty much all I have to say.  His work is inspired.  Any writer, be it fiction or screenwriting or poetry should read his stuff.  His sensory descriptions are phenomenal, and he clearly possesses the pathos of a true artist.Not surprising he won the Pulitzer."}]}, "authors": ["Jonathan Gold"], "isbn": "0312267231", "longitude": -118.244476, "periods": ["2000s"], "title": "Counter Intelligence: Where to Eat in the Real Los Angeles", "word_cloud": "useful access entertain incredible incredible review culinary insight doubt poorly edit organize instead neighborhood reference food group chapter organize alphabetical order editorial fix food index back bad doubly frustrate none spot organize area area get excite new restaurant check let get hope place xx mile away search local spot get ta dig intention make explore gawd best prose make heart creativity leave awe struck wrap actual food review neat little box leave entertain inspire even care old probably date write colorful provoke timeless star star come damage bent buy use stay completely crack open middle spine broken little known zone hood best place place review enjoyable writer love enjoy broader selection restaurant review outdated city guide wonderful fun food reading want want great place special mention place affordable work gastronomic write graphic pretty much say work inspire writer fiction screenwriting poetry stuff sensory description phenomenal clearly posse pathos true surprising pulitzer", "genres": ["Food and Wine"], "summary": "Jonathan Gold has eaten it all. Counter Intelligence collects over 200 of Gold's best restaurant discoveries--from inexpensive lunch counters you won't find on your own to the perfect undiscovered dish at a beaten-path establishment. He reveals the hidden kitchens where Los Angeles' ethnic communities feed their own, including the best of cuisine from Argentina, Armenia, Brazil, Burma, Canton, Colombia, Cuba, Guatemala, India, Indonesia, Iran, Italy, Japan, Korea, Mexico, the Middle East, Nicaragua, Pakistan, Peru, Thailand, Vietnam and more. Not to mention the perfectly prepared hamburger and Los Angeles' quintessential hot dog.\r\n\r\nCounter Intelligence is the richest and most complete guide to eating in Los Angeles. The listings include where to find it and how much you'll pay (in many cases, not very much) with appendices that cover food types and feeding by neighborhood.", "asin": "0312267231", "rank": "138604", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/41MuLZdy1mL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}