{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 39.8560679, "ratings": {"num_ratings": 199, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent book."}, {"review_sentiment": 3.0, "review_text": "A very good read"}, {"review_sentiment": 5.0, "review_text": "Easy to read. Enjoyed following Yonah thru his travels/adventures."}, {"review_sentiment": 4.0, "review_text": "Wonderful story of one man's will to survive against all odds. I found this book interesting on many levels.Historically and intelectually. A marvelous read!"}, {"review_sentiment": 5.0, "review_text": "An interesting, well-written tale of life for a Jewish boy in Spain, during the Spanish Inquisition.  Very nice twists in the plot reminiscent of Crime and Punishment.  Highly recommended."}, {"review_sentiment": 5.0, "review_text": "Despite the title and subject matter, this is an easy read.. opens the readers mind to life in Spain at the time of the Spanish Inquisition Traces the main characters life through suffering and triumph."}, {"review_sentiment": 5.0, "review_text": "Good product, good price, good transaction, quick delivery."}, {"review_sentiment": 4.0, "review_text": "A great story."}, {"review_sentiment": 5.0, "review_text": "Intriguing story of a time unknown to the world.  Very interesting history of the Jewish people in Spain.  , Loved the story and characters."}, {"review_sentiment": 5.0, "review_text": "A very well written book. It keeps your interest from chapter to chapter. Beautiful descriptions and well developed characters."}]}, "authors": ["Noah Gordon"], "isbn": "0312300530", "longitude": -4.0239568, "periods": ["500-1400s"], "title": "The Last Jew", "word_cloud": "excellent good follow thru wonderful story man survive odds find interest many intellectually marvelous interesting tale life boy spanish nice twist plot reminiscent recommend title subject matter easy open reader mind life time spanish main character life suffer triumph good product good price good transaction quick delivery great story intrigue story time unknown world very interesting history jewish people story character well write keep interest chapter chapter description well develop character", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In the year 1492, the Inquisition has all of Spain in its grip. After centuries of pogrom-like riots encouraged by the Church, the Jews - who have been an important part of Spanish life since the days of the Romans - are expelled from the country by royal edict. Many who wish to remain are intimidated by Church and Crown and become Catholics, but several hundred thousand choose to retain their religion and depart; given little time to flee, some perish even before they can escape from Spain.\r\n\r\nYonah Toledano, the 15-year-old son of a celebrated Spanish silversmith, has seen his father and brother die during these terrible days - victims whose murders go almost unnoticed in a time of mass upheaval. Trapped in Spain by circumstances, he is determined to honor the memory of his family by remaining a Jew.\r\n\r\nOn a donkey named Moise, Yonah begins a meandering journey, a young fugitive zigzagging across the vastness of Spain. Toiling at manual labor, he desperately tries to cling to his memories of a vanished culture. As a lonely shepherd on a mountaintop he hurls snatches of almost forgotten Hebrew at the stars, as an apprentice armorer he learns to fight like a Christian knight. Finally, as a man living in a time and land where danger from the Inquisition is everywhere, he deals with the questions that mark his past. How he discovers the answers, how he finds his way to a singular and strong Marrano woman, how he achieves a life with the outer persona of a respected Old Christian physician and the inner life of a secret Jew, is the fabric of this novel. The Last Jew is a glimpse of the past, an authentic tale of high adventure, and a tender and unforgettable love story. In it, Noah Gordon utilizes his greatest strengths, and the result is remarkable and moving.", "asin": "0312300530", "rank": "85590", "city": "Toledo", "image": "https://images-na.ssl-images-amazon.com/images/I/41RK8WCejNL.jpg", "country": "Spain", "story_arc": ["Tragedy", "Things only get worse"]}