{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 80, "rating": 4.3, "reviews": [{"review_sentiment": 2.0, "review_text": "Difficult to read,  consisted mostly of young David's thoughts.  Lots of \"pigeon\" English that was difficult to understand.  Kept waiting for something to happen (a plot)."}, {"review_sentiment": 5.0, "review_text": "This is the best book i’ve read in a long time. It’s about a Jewish immigrant family living in NYC in the early 20th century.  It centers on the boy, but we learn about the parents through the boy’s eyes, and ears as listens to their conversations.  The author has developed an excellent “shorthand” for the particular way these Jewish immigrants speak — a patois of English, German and Yiddish. As you read their conversations you feel like you understand as if you knew their native language.  It’s fascinating and you’ll love it.  BUY IY!"}, {"review_sentiment": 5.0, "review_text": "The story of a seven year old Jewish boy assimilating in New York has the power of James Joyce and the writings of Shakespeare.  Three languages are utilized and can be understood by the reader along with dialects of Jewish children and Irish and Italians living in the city.A powerful novel with a final essay analyzing the messages conveyed."}, {"review_sentiment": 5.0, "review_text": "I knew nothing about the East Side Jews when I read this book. This a an authentic and thoughtful book about immigration, Jews, and childhood. Loved it!"}, {"review_sentiment": 5.0, "review_text": "A sometimes difficult linguistic read, but the characters are worth it."}, {"review_sentiment": 5.0, "review_text": "It arrived in good shape."}, {"review_sentiment": 5.0, "review_text": "The huge and often dark-seeming world through the eyes and gut of a bright, sensitive single child."}, {"review_sentiment": 5.0, "review_text": "Roth is the Jewish-American James Joyce. Call It Sleep is the most readable yet complex modernist novel I have ever read. It definitely deserves a place in the canon of American Literature."}, {"review_sentiment": 5.0, "review_text": "One of the great Jewish novels of the 20th Century. This is not an easy read. With clear genetic links to the work of James Joyce and the German-Austrian Joseph Roth, and the he story is told from the perspective of a young boy, newly immigrated to the US in a complex family living in several cultural contexts. The Jewish novel may have perished with Portnoy's complaint, but novels like Call It Sleep evoke in sepia tones an era that holds immense nostalgia, respect and astonishment for new generations of readers whether they be Jewish or not. This book was immensely popular in the 1960s but I missed it then. Coming back late in life I found it a profound and moving experience."}, {"review_sentiment": 5.0, "review_text": "One of the great books of American lit, but don't let that dissuade you"}]}, "authors": ["Henry Roth"], "isbn": "0312424124", "longitude": 0.0, "periods": ["1900s"], "title": "Call It Sleep", "word_cloud": "consist mostly young thought pigeon difficult understand wait something plot best long time jewish immigrant family live early century center boy learn parent eye ears listens conversation author develop excellent shorthand particular way jewish immigrant speak patois english german yiddish conversation feel understand native language fascinate story year old jewish boy assimilate power writing languages utilized understood dialect jewish child irish live powerful final essay analyze message convey know nothing authentic thoughtful immigration childhood love sometimes difficult linguistic character worth arrive good shape huge often world eye gut bright sensitive single child readable yet complex modernist ever definitely deserve place canon american literature great jewish novel easy clear genetic link work story tell perspective young boy newly immigrate complex family live several cultural context complaint novel evoke sepia tone era hold immense nostalgia respect astonishment new generation reader jewish immensely popular miss come back late life find move experience great american lit let", "genres": ["Fiction & Literature"], "summary": "When Henry Roth published his debut novel Call It Sleep in 1934, it was greeted with considerable critical acclaim though, in those troubled times, lackluster sales. \r\n\r\nOnly with its paperback publication thirty years later did this novel receive the recognition it deserves―--and still enjoys. Having sold-to-date millions of copies worldwide, Call It Sleep is the magnificent story of David Schearl, the \"dangerously imaginative\" child coming of age in the slums of New York.", "asin": "0312424124", "rank": "99862", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51kolqwlOeL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}