{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 21, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "great shape"}, {"review_sentiment": 4.0, "review_text": "My husband recommended this to me a while ago and I finally had the chance to read it! I was worried at first, because his last two have been, while very good, incredibly depressing, but this was a whole lot happier and more hopeful than White Teeth by Zadie Smith and The Autobiography of Malcolm X, so I can keep on with his recommendations! It’s interesting because Fruit of the Lemon does deal with the same sort of issues as those other two books — namely, what it means to be not-white in a society that favors being white, but it also marries this idea with a young woman’s coming of age. Faith has just graduated college and is trying to figure out who she is and what her place is in the world, which is made even more complicated by the fact that it’s harder for her to get the jobs that she wants because of racism and it’s harder for her to embrace her culture when she doesn’t have any friends that come from the same background as her.I appreciated Levy’s ability to take serious concepts while also bringing humor and levity into it. Faith is living in a house with two guys and another girl, and the description of the house is hilarious, grotesque, and all too real of just-graduated-from-college young adults. The hygiene, decorating skills, and overall responsibility skills just aren’t quite there yet, but they’re trying to figure it out; Faith’s dad coming by the house because he was “in the area” is a hilarious moment because of this.The racism in Faith’s workplace was well done — she wanted to be a dresser instead of working in the costume department of a TV station, cataloging costumes. Someone told her they never have “colored” people working those jobs, and when the hiring committee started being unfair to her, she mentioned that and eventually got the job she wanted, but they don’t actually really let her do the job, saying that no shows needed anyone to help dress the actors at the moment. This was much more interesting than Faith not getting the job outright, because it was harder for her to find something to be upset about — she got the job she wanted, they just didn’t need her to do those responsibilities right now. And then, when they do let her work, it’s to dress up dolls for a kid’s show and not actual actors.However, this novel shines with Faith goes to Jamaica and learns about her family. More than anything, this book is about how people become who they are, how they relate to their families, and how family can tie everything together. I loved seeing Faith trace her family tree as each new story about a new relative is told to her, and even though the reader doesn’t get to see much of Faith’s transformation, I felt her becoming more comfortable with herself and who she is with each branch she adds to the tree. Fruit of the Lemon is a beautiful story about family, identity, and culture, and it’s able to tell an important story while still including humorous and touching moments. Along with my husband, I highly recommend reading this book."}, {"review_sentiment": 5.0, "review_text": "I thoroughly enjoyed this book and will be happy to read more from Andrea."}, {"review_sentiment": 4.0, "review_text": "Delicate and humorous writing.  Definitely worth the read. A study of discovery and a juxtaposition of cultures."}, {"review_sentiment": 5.0, "review_text": "A touching, entertaining, and unexpectedly enlightening book."}, {"review_sentiment": 4.0, "review_text": "It captured the language, speaking style and culture of Jamaica.  Not as good as Small Island which I gave a five star, so I could not give this one a five star.  I enjoyed it and could not put it down, but I did not laugh as much as I did with Small Island.  I would highly recommend it.  Great reading Andrea."}, {"review_sentiment": 5.0, "review_text": "Just what the doctor ordered for a long flight.  As an anglo Caribbean person I could empathise with many of the plots and characters.  Good read"}, {"review_sentiment": 4.0, "review_text": "Since locating to The Bahamas in 1970, I can relate to the first impressions of this part of the world, Bahamians and Jamaicans are very much alike in many aspects of their, culture, diet and attitude and it takes some adjusting coming from England.However, I do not feel two weeks was long enough for the main character to become fully immersed in everyday Jamaican Life. it took me at least two years!!!"}, {"review_sentiment": 5.0, "review_text": "What an interesting story. Faith's journey from England to Jamaica is not the majority of the novel, but it is definitely the most hopeful. Levy captures the experience of children of the Caribbean diaspora growing up away from home, and also the struggle to determine where exactly home is. This novel is a must-read for all Caribbean literature scholars."}, {"review_sentiment": 5.0, "review_text": "I read Fruit of the Lemon after reading Small Island by the same author.  Both are excellent books, providing unusual (Caribbean) perspectives on life and history.  The author's story line and dialogues are excellent.  The writing is descriptive, filled with unexpected plot developments, and a book that cannot be put down once begun.  She writes the kind of fiction that is based on reality and entirely credible.  I have already recommended this writer, Andrea Levy, and her books to friends.  Interesting, stimulating, worthwhile reading."}]}, "authors": ["Andrea Levy"], "isbn": "031242664X", "longitude": -0.12574, "periods": ["1900s", "Recent Releases"], "title": "Fruit of the Lemon", "word_cloud": "great shape husband recommend ago finally chance worry first last good incredibly depress whole lot happier hopeful keep recommendation interest deal sort issue namely mean society favor white also marry idea young woman come age graduate college try figure place world make even complicate fact harder get job want racism harder embrace culture friends come background appreciate ability take serious concept also bring humor levity living house guy girl description house hilarious grotesque real young adult hygiene decorate skill overall responsibility skill quite yet try figure dad come house area hilarious moment racism workplace well do want dresser instead work costume department tv station catalog costume tell never color people work job hire committee start unfair mention eventually get job want actually really job say show need anyone help dress actor moment much interesting get job outright harder find something upset get job want need responsibility right work dress doll kid show actual shine go learn family more anything people become relate family family tie everything together love see trace family tree new story new relative tell even see much transformation felt become comfortable branch add tree beautiful story family identity culture able tell important story still include humorous touch moment husband highly recommend read thoroughly enjoy happy humorous write definitely study discovery juxtaposition culture touch entertain unexpectedly enlighten capture language speaking style culture not good give star star enjoy laugh much small highly read just doctor order long flight anglo person many plot character good locate relate first impression part world much alike many aspect culture diet attitude take adjust come feel week long enough main character become fully immersed everyday take least year interest story journey majority definitely hopeful capture experience child diaspora grow away home also struggle determine exactly home literature scholar read author excellent provide unusual perspectives life history author story line dialogue excellent write descriptive fill unexpected plot development put begin write kind fiction base reality entirely credible already recommend writer friends stimulate worthwhile reading", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "From Andrea Levy, author of Small Island and winner of the Whitbread Book of the Year and the Best of the Best Orange Prize, comes a story of one woman and two islands.\r\n\r\nFaith Jackson knows little about her parents' lives before they moved to England. Happy to be starting her first job in the costume department at BBC television, and to be sharing a house with friends, Faith is full of hope and expectation. But when her parents announce that they are moving \"home\" to Jamaica, Faith's fragile sense of her identity is threatened. Angry and perplexed as to why her parents would move to a country they so rarely mention, Faith becomes increasingly aware of the covert and public racism of her daily life, at home and at work.\r\n\r\nAt her parents' suggestion, in the hope it will help her to understand where she comes from, Faith goes to Jamaica for the first time. There she meets her Aunt Coral, whose storytelling provides Faith with ancestors, whose lives reach from Cuba and Panama to Harlem and Scotland. Branch by branch, story by story, Faith scales the family tree, and discovers her own vibrant heritage, which is far richer and wilder than she could have imagined.\r\n\r\nFruit of the Lemon spans countries and centuries, exploring questions of race and identity with humor and a freshness, and confirms Andrea Levy as one of our most exciting contemporary novelists.", "asin": "031242664X", "rank": "236508", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51cfn1C6mJL.jpg", "country": "England", "story_arc": ["Tragedy", "Things only get worse"]}