{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 44.8178131, "ratings": {"num_ratings": 214, "rating": 4.1, "reviews": [{"review_sentiment": 1.0, "review_text": "The book is just waste of time."}, {"review_sentiment": 5.0, "review_text": "Read it twice-the second time just before I visited the Balkans"}, {"review_sentiment": 4.0, "review_text": "Having visited the Balkans this was a very interesting and sympathetic narration of the complex and even horrifying history of this region."}, {"review_sentiment": 5.0, "review_text": "A true reporter. He lived with the people he reported on."}, {"review_sentiment": 5.0, "review_text": "Wonderful.  Top marks.  I officially detest this author for writing so beautifully and well and  forcing me to seriously consider buying all of his other books regardless of topic.  Full of information and sentences that strike deeply."}, {"review_sentiment": 4.0, "review_text": "Great book, very poor quality paper."}, {"review_sentiment": 5.0, "review_text": "Amazingly informative, thoughtful, and balanced, even though the author has a pervasive capitalist lean."}, {"review_sentiment": 5.0, "review_text": "Superb non fiction book on the Balkans. It conveys history through short descriptions of people and places that have had profound influence on the development of that area of the world history"}, {"review_sentiment": 5.0, "review_text": "I was fortunate that Kaplan chose to write for Stratfor while I was going to college. I'm sure he found it restrictive but he greatly expanded my education through his weekly articles. Balkan Ghost has done the same and I am glad that it was recommended to me.  Hard to believe I thought \"This coming Anarchy\" was a crock freshman year."}, {"review_sentiment": 4.0, "review_text": "The style was entertaining and interesting.  The many references to Black Lamb and Grey Falcon by Rebecca West are calling me next.  Feel this book gave a good overview of the Balkan's and some of it's history.  Mission accomplished!  Definitely learning about the many nuances to this region of the world which seems to take a back seat during major events in history.  Balkan Ghosts wet my appetite for more!"}]}, "authors": ["Robert D. Kaplan"], "isbn": "0312424930", "longitude": 20.4568974, "periods": ["1900s"], "title": "Balkan Ghosts: A Journey Through History", "word_cloud": "waste time second time visit balkan have visit interesting sympathetic narration complex even horrify region true reporter live people report wonderful top mark officially detest author write beautifully well force seriously buy regardless information sentence strike deeply poor quality paper amazingly informative thoughtful balance even author pervasive capitalist lean fiction convey short description people place profound influence development area world fortunate choose write go college sure find restrictive greatly expanded education weekly article do glad recommended believe think come crock freshman year style entertain interest many reference call next give good overview accomplish learn many nuance region world seem take back seat major event wet appetite", "genres": ["History", "Travel Writing", "WWII", "WWI"], "summary": "From the assassination that triggered World War I to the ethnic warfare in Serbia, Bosnia, and Croatia, the Balkans have been the crucible of the twentieth century, the place where terrorism and genocide first became tools of policy. \r\n\r\nChosen as one of the Best Books of the Year by The New York Times, and greeted with critical acclaim as \"the most insightful and timely work on the Balkans to date\" (The Boston Globe), Kaplan's prescient, enthralling, and often chilling political travelogue is already a modern classic.\r\n\r\nThis new edition of the Balkan Ghosts includes six opinion pieces written by Robert Kaplan about the Balkans between 1996 and 2000 beginning just after the implementation of the Dayton Peace Accords and ending after the conclusion of the Kosovo war, with the removal of Slobodan Milosevic from power.", "asin": "0312424930", "rank": "75568", "city": "Belgrade", "image": "https://images-na.ssl-images-amazon.com/images/I/51ehvZzOf-L.jpg", "country": "Serbia", "story_arc": ["Tragedy", "Things only get worse"]}