{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 77, "rating": 3.5, "reviews": [{"review_sentiment": 4.0, "review_text": "Rough in the beginning. Bought years ago cause I can't get enough Franzen. Hadn't heard of it, and figured it was an early try that never made it. Once I started reading, I knew that it was. But then something happened, the way it does with a book, and sudddenly I found I was involved and enjoying it. Couldn't wait to read. I was bummed when it was over. A great read. Try it and stick with it. 👍"}, {"review_sentiment": 5.0, "review_text": "The earth is much more fragile than we think. Convulsion of the earth crust beneath New England USA and also quakes in human dramas in Strong Motion: A Novel was author Franzen's dire warning of human capitalistic greed and irresponsible exploitation of mother earth and hence accelerating its destruction? Yet another greenie's exasperated scream at the hopeless human race? Sure it was, but besides that we have the human interests of Franzen's brilliant dramatic tale (soap operaish but I love it) on the Hollands, an upper middle class well educated Bostonian family. A hippie professor father and a newly rich Brahmin breed mother (thanks to grandpa), both parents under appreciated by their two young adult children. Intriguing web of lives revolving the family members stretching three generations from grandfather to the spoilt brat son culminating in also quakes shaking up their lives. My second Franzen tale and it was a huge leap from being impressed with the first to great admiration with the second. Many new and exciting discoveries of Franzen treasures for me. Franzen revealed his animal loving side by including long and short observations of behaviours of wild animals as well as the domestic kind. What grabbed my heart chiefly was because Franzen wrote a big pro-life chapter where he treated us to phenomenal dialogue between the pastor leading the pro-life movements and a 30 year old Rene carrying a 5 week old foetus she didn't't want. An engaging repartee with the Pastor coming up on top (because he won me over convincingly) even though he failed to dissuade Rene. Mostly because the father had taken off and her heart was broken.The cruel irony of life was brilliantly depicted when Rene would have her life involuntarily endangered and nearly expired on the day when her foetus had its life terminated against its will. Depicting yet the drama of American lives, Franzen moved us to Boston after engaging us with life in St Louis with The Twenty-Seventh City: A Novel (Picador Modern Classics). I definitely enjoyed this second novel more because the plot and the characters were more engaging. A delectable Franzen writing style solidified for me. Love the deadpan humor of Franzen. He dropped gems along the way  using his unique linguistic style to describe a common situation or action. But one must pay attention to spot them. A conspiracy theory on who the gun person was fueled the latter half of the book. Jealous lover? Corporate evil trying to silence the whistle blower? Alternate endings to ponder upon after the novel is read."}, {"review_sentiment": 4.0, "review_text": "This is a franzen novel in the tradition of the correction and freedom, less so purity. It's a little more clunky than I can remember those 2 novels being but even that is a bit of a thrill as it feels like practice to perfect the style that makes those books so great. The characters are young, wonderfully so, and more than anything else I have read by him it is a romance, just one in the context of exquisitely illustrated family dysfunction. I especially loved chapter 7 and intend to reread at least that chapter and maybe the whole book"}, {"review_sentiment": 5.0, "review_text": "Really good read."}, {"review_sentiment": 4.0, "review_text": "Not quite as brilliant as Franzen's later books Purity, The Corrections, and Freedom, but compared to most other books, it's one of the best I've read.Highly original, complex themes, utterly engrossing, especially in the last third of the novel."}, {"review_sentiment": 3.0, "review_text": "Like all of Franzen's books, Strong Motion is maddening.  That Franzen's world is only open to flawed or very flawed characters is bad enough, that his characters are truly their own worst enemies makes the novel even darker and that in this novel even mother earth becomes a malevolent character.  But to punish the patient reader for his virtue of sticking with the narrative, Franzen makes him wade through endless descriptions of rooms, streets, neighborhoods, the characters, their clothing.  One never finds the imaginative use of detail, but instead there is the overkill of pages of description, often with some showing off of his Thesaurus.  Each time I swear I will never read him again, and then I read a review by a critic who, it turns out, didn't read the book, but skimmed it.  Which is what it deserves."}, {"review_sentiment": 4.0, "review_text": "Strong Motion presents a very complex theory in a cogent but dramatic context.  While none of the characters are particularly attractive, the narrative moves along picking up additional plot lines and more unattractive characters.  There were passages that made me stop and read to my significant other, drawing on Franzen's unique insight and his ability to paint difficult relationships and historical trivia. There just didn''t seem to be enough of those passages.  In the end I was a little disappointed that the book didn't hit the high bar I had come to expect from his previous work.  But only a little."}, {"review_sentiment": 4.0, "review_text": "An excellent if dated book, takes place around 1900. Lots to think about and very well written. Could have used some serious editing though to remove or cut down rambling philosophical sections. Never would have thought that anyone could do so much with the idea of earthquakes around Boston."}, {"review_sentiment": 4.0, "review_text": "I liked this book a lot. It took me a while to get into this book, days in fact to get past the 100 page mark, but there was just enough to keep me going and boy, am I glad that I did.Initially, the characters present as awkward and self-absorbed. I found it hard to engage with one-dimensional characters that I perceived as unlikeable. But the story, while complex, is well structured. There are all of these connections and coincidences. As you read on, more of the characters are revealed and layer-by-layer the onion is peeled. I slowly began to recognize the vulnerability and weakness in the characters and found myself rooting for them, especially Harvard seismologist, Renee Seitchek.The book takes the occasional odd turn. Several areas could probably have used some editing, but for me it was a worthwhile read."}, {"review_sentiment": 5.0, "review_text": "I didn't intend to stop and 'review' strong motion but I can't resist making the point that everything that I have read by JF soars so far above 'predictable', 'some twists' of 'full of surprises' as to render such categorization totally irrelevant, 'Strong Motion' no less than the rest. Franzen is widely appreciated but probably not deeply. He surely will be in the fullness of time when the ultimate critical mass of discriminating readers have weighed in and he is recognized as the American Dickens. I can only express my appreciation for his talents in terms of superlatives which cannot convey any sense of the uniqueness of his gifts for narration and characterization. His writing is powerful, sexy and deeply artistic.He simultaneously exposes writing as craft and elevates it to the highest level. I suppose you can tell I am something of a fan. Don't let that deter you."}]}, "authors": ["Jonathan Franzen"], "isbn": "031242051X", "longitude": -71.0595678, "periods": ["1900s"], "title": "Strong Motion: A Novel", "word_cloud": "begin year ago cause enough hear figure early try never make start read know something happen way suddenly find involve enjoy wait bum great stick earth much fragile think earth crust also quake human drama author dire warn human capitalistic greed irresponsible exploitation mother earth hence accelerate destruction yet greenish exasperate scream hopeless human race besides human interest brilliant dramatic tale soap operaish love hollands upper middle class well educate family hippie professor father newly rich breed mother thanks grandpa parent appreciate young adult child intrigue web life revolve family member stretch generation grandfather spoil brat son culminate also quake shake life second tale huge leap impress first great admiration second many new excite discovery treasure reveal animal loving side include long short observation behaviors wild animal well domestic kind grab heart chiefly write big chapter treat phenomenal dialogue pastor lead movement year old carry week old fetus want engaging repartee come top convincingly even fail dissuade father take heart cruel irony life brilliantly depict life involuntarily endanger nearly expire day fetus life terminate yet drama american life move engage life definitely enjoy second plot character engage delectable writing style solidify deadpan humor drop gem way use unique linguistic style describe common situation action attention spot conspiracy theory gun person fuel latter half lover evil try silence whistle blower ending ponder franzen tradition correction freedom le purity little clunky remember novel even bite thrill feel practice perfect style make great character young wonderfully anything else romance context exquisitely illustrate family dysfunction especially love chapter intend reread least chapter maybe whole really good not quite brilliant later compare best original complex theme utterly engross especially last third maddening world open flaw flawed character bad enough character truly worst enemy make even darker even mother earth becomes malevolent character punish patient virtue stick narrative make wade endless description room street neighborhood character clothe never find imaginative use detail instead overkill page description often show time swear never review critic turn skim deserve present complex theory cogent dramatic context none character particularly attractive narrative move pick additional plot line unattractive character passage make stop significant draw unique insight ability paint difficult relationship historical trivia seem enough passage end little disappointed hit high bar come expect previous work little excellent dated take place think well write use serious edit remove cut ramble philosophical section anyone much idea earthquake like lot take day fact get past page mark enough keep go boy glad character present awkward find hard engage character perceive unlikable story complex well structure connection coincidence character reveal onion peel slowly begin recognize vulnerability weakness character find root especially seismologist take occasional odd turn several area probably use edit worthwhile intend motion make point everything hf soar far twist surprise categorization totally irrelevant le rest widely appreciate probably deeply surely fullness time ultimate critical mass discriminate reader weigh recognize american express appreciation talent term superlative convey sense uniqueness gift narration characterization write powerful sexy deeply simultaneously expose write craft elevate highest level suppose tell something fan", "genres": ["Fiction & Literature"], "summary": "A suspenseful, complex novel dealing with the issues of our day--environmental pollution, religious fundamentalism, abortion, and the threat of apocalypse. It is also a tender and fresh love story--a story of betrayal and redemption--from the author of The Twenty-Seventh City.", "asin": "031242051X", "rank": "236604", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/41csOEJpL6L.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}