{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 81, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "First time reading book by this author.  Book has a little humor & you get to learn about the black slaves in Jamaica  How they were treated ...."}, {"review_sentiment": 2.0, "review_text": "Patois was difficult  to read and it was a bit of a slow story."}, {"review_sentiment": 4.0, "review_text": "The novel gavels us insights into how Jamaicans were then which influenced how we are now; the feistiness, loudness at times, boldness in the face of personal danger. The social nuances as they relate to skin shades and the opportunities for upward social mobility was stark and so true.  Her account of the abolition of slavery and the subsequent events was poignant.I found it difficult to follow the story because of how it was narrated especially in the first few chapters.  The story came together after that.  It was a long song of pain and anguish."}, {"review_sentiment": 3.0, "review_text": "This book was good, but basically a retelling of the slave story. The Jamaica setting was nice and some history was learned, but not too exciting as a whole."}, {"review_sentiment": 5.0, "review_text": "A great book! Well written and a new 'voice' in the slave narrative."}, {"review_sentiment": 4.0, "review_text": "Very insightful and easy to read.  There were times I didn't want to put it down."}, {"review_sentiment": 3.0, "review_text": "Levy is English, born of Jamaican parents who emigrated in 1948 to England. This novel is about the lives of white planters and black slaves in the time of the Baptist Rebellion and beyond. The narrator is July, a slave on Amity, a plantation in Jamaica. The slaves are many, the overseer cruel, the masters feeble and incompetent, the mistresses, an embarrassment.I found it a good read, but I became impatient with some of the white characters who were drawn in a less favourable light than the blacks. The story is primarily about the abolition of slavery and Jamaica's history since then so our sympathies are very much with the slave population but the tedium of engaging with the whites made me impatient to finish the book. I also found it very similar to \"James Miranda Barry\" by Patricia Dunker. I'm not sure if it is because of this that I didn't find it an altogether satisfying read, but on the strength of the writing I will chase down some of Levy's other novels and read them as she is very talented."}, {"review_sentiment": 5.0, "review_text": "The author manages to tell a story about a sensitive topic with humour and sensitivity. As a Jamaican, I could hear the rhythm of the dialect as i read which enhanced the story.  I hope not too much is lost in translation for the non-native speaker of Jamaican patois.  It is however, only a small part of the story.  Worth the read."}, {"review_sentiment": 5.0, "review_text": "I was entertained by the usual true to life depiction of bygone times Levy is known for. the historical references and realistic characters made the words jump of the page. levy's skill at storytelling is at its pinnacle in this novel. recommended for students of and others who love Caribbean history and literature."}, {"review_sentiment": 3.0, "review_text": "The Long Song by Andrea Levy - a Goodreads First Read free giveaway book won on April 18nd, received on April 28th.My first thought on the format of the book (family history with intertim on present-day mother/son interaction) is that it reminded me alot of Galilee by Clive Barker which is a pretty good comparison, since both authors seem to be masters of description and cut to the meat of a topic very quickly. And what a deep and profound and almost can't-bear-to-watch a topic it is.The storytelling narration focuses around a Jamaican lady's maid named July, born to a sugar cane mother and an overseer father and her life as she grows up, dealing with inadequacies and injustices inside the house and out and the meandering, simpering wishes of the family that owns her. The book takes a turn as she falls in love and has a child (avoiding a whole lot of spoilers by wording it that way), but the situations that happen throughout the book are somewhat startling while being delivered in a devil-may-care, what's-done-is-done patois."}]}, "authors": ["Andrea Levy"], "isbn": "0312571143", "longitude": 0.0, "periods": ["1800s", "Recent Releases"], "title": "The Long Song", "word_cloud": "first time read author little humor get learn black slave treat difficult bit slow story gavel insight influence feistiness loudness time boldness face personal danger social nuance relate skin shade opportunity upward social mobility stark true account abolition slavery subsequent event find difficult follow story narrate especially first chapter story come together pain anguish good basically retell story set nice history learn exciting whole great write new slave narrative very insightful easy time want put bear jamaican parent emigrate live white planter black slave time narrator slave plantation slave many overseer cruel master feeble incompetent mistress find good become impatient white character draw le favorable light black story primarily abolition slavery history sympathy much slave population tedium engage white make impatient finish also find similar sure find altogether satisfying strength write chase novel talented author manage tell story sensitive topic humor sensitivity rhythm dialect enhance story hope much lose translation speaker patois however small part story entertain usual true life depiction bygone time known historical reference realistic character make word jump page levy skill storytelling pinnacle recommend student others love history literature free giveaway receive first think format family history interim interaction remind a lot pretty good comparison author seem master description cut meat topic quickly deep profound almost storytelling narration focus lady maid name born sugar cane mother overseer father life grow deal inadequacy injustice inside house meander simper wish family own take turn fall love child avoid whole lot spoiler word way situation happen somewhat startle deliver patois", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Finalist for the 2010 Man Booker Prize\r\n\r\nThe New York Times Book Review Notable Book of the Year\r\n\r\nIn her follow-up to Small Island, winner of the Whitbread Book of the Year Award and the Orange Prize for Fiction, Andrea Levy once again reinvents the historical novel. Told in the irresistibly willful and intimate voice of Miss July, with some editorial assistance from her son, Thomas, The Long Song is at once defiant, funny, and shocking. \r\n\r\nThe child of a field slave on the Amity sugar plantation in Jamaica, July lives with her mother until Mrs. Caroline Mortimer, a recently transplanted English widow, decides to move her into the great house and rename her \"Marguerite.\" Together they live through the bloody Baptist War and the violent and chaotic end of slavery. \r\n\r\nAn extraordinarily powerful story, \"The Long Song leaves its reader with a newly burnished appreciation for life, love, and the pursuit of both\" The Boston Globe", "asin": "0312571143", "rank": "241465", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/61608OwrYmL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}