{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 22, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Thanks"}, {"review_sentiment": 4.0, "review_text": "Love song to a storied city's history.  Occasionally confusing (because I had no background context about the city, country or region), but nonetheless illuminating and moving."}, {"review_sentiment": 3.0, "review_text": "This book has no narrative; it's a hodge-podge of disparate historical fact/fiction, observations, and anecdotes, arranged in 15 broadly thematic (but essentially catch-all) chapters, such as \"Harems and Hamams\" and \"Viziers and Dragomans\"  Quite a number of the bits of information are very interesting, and the book runs to considerable length in a less-than-large typeface, so there's a lot to like here; however, the disparate melange that is each chapter rules out use of the book as a reference, notwithstanding that the index is decent.  I would give this book four stars, maybe five, if the chapters were more coherent and discrete themes more fully developed."}, {"review_sentiment": 4.0, "review_text": "We found this very helpful as we prepare for our trip to Turkey.  It helped us to understand the history not only of Istanbul but of the entire area.  The style of writing is difficult to follow but better once we got into the meat of the book."}, {"review_sentiment": 5.0, "review_text": "Very even and balanced account, a mix of social and political History. Excellent introduction for readers new to the subject, fresh review for those who have read the subject. Smooth text."}, {"review_sentiment": 3.0, "review_text": "Must be the most complete account of the everyday life in Constantinople but as such it has so much information that it's hard to read. The narrative is more concentrated on showing how much the author knows than on making it agreeable."}, {"review_sentiment": 5.0, "review_text": "I am actually reading the Spanish translation of this book, which I bought in Spain some years ago. This is a superb, well-written book that entices the reader to continue reading. The city comes alive in a wonderful way, from the lives and likes of the Sultans to those of grand viziers, great architects, and even artisans. The descriptions of the mosques and architectural landmarks are splendid. I am now ordering the book in English, in order to read it in the language in which it was written. I recommend this book, not only for travelers to Istanbul but also for the general, cultured reader."}, {"review_sentiment": 5.0, "review_text": "Philip Mensel has a done a great job. I traveled to Istanbul and had to get some historical perspective on Istanbul.  I had no knowledge on 1453-1924 time period. If you are looking for casual treat and through information on Istanbul, You will enjoy it."}, {"review_sentiment": 3.0, "review_text": "The book was in good condition.  It is an old library book so had all the expected library cover, date stamps, etc."}, {"review_sentiment": 2.0, "review_text": "I am just beginning to read the book.  I find it engaging, but already at page 19 there is a rather glaring factual error.  Mansel asserts that the \"bridge on the Drina\" in Visegrad, BiH was \"destroyed by Croatian bombs in 1994.\"  I can only assume that he is referring to the bridge on the Neretva in Mostar which was destroyed during the Bosnian War.  This is because no Croats were involved in the war around Visegrad and because whereas I have never heard of the bridge on the Drina being destroyed, the bridge on the Neretva was famously demolished and then rebuilt.The story itself is interesting, but I will read the rest of the book with a healthy amount of skepticism."}]}, "authors": ["Philip Mansel"], "isbn": "0312187084", "longitude": 28.9651646, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s", "500-1400s"], "title": "Constantinople: City of the World's Desire, 1453-1924", "word_cloud": "thanks song storied history confuse background context country region nonetheless illuminate move narrative disparate historical observation anecdote arrange broadly thematic essentially chapter number bit information interest run considerable length typeface lot however disparate melange chapter rule use reference notwithstanding index decent star maybe chapter coherent discrete theme fully develop find helpful prepare trip turkey help history entire area style write difficult follow better get meat very even balance account mix social political introduction reader new subject fresh review subject text complete account everyday life much information hard narrative concentrate show much author know make agreeable actually read spanish translation buy year ago superb entice continue read come alive wonderful way live like grand vizier great architect even artisans description mosques architectural landmark splendid order english order language write recommend traveler also general culture do great job travel historical perspective knowledge time period look casual treat information enjoy good condition old library expect library cover date stamp etc begin find engage already rather glare factual error assert bridge destroy croatian bomb assume refer bridge destroy involve war whereas never hear bridge destroy bridge famously demolish story interesting rest healthy amount skepticism", "genres": ["History"], "summary": "A fascinating, wonderfully readable cultural, social and political history of the city in its prime. Rich with anecdotes and information, it is always astonishing and sometimes horrifying.\r\n\r\nPhilip Mansel's highly acclaimed history absorbingly charts the interaction between the vibrantly cosmopolitan capital of Constantinople - the city of the world's desire - and its ruling family.\r\n\r\nIn 1453, Mehmed the Conqueror entered Constantinople on a white horse, beginning an Ottoman love affair with the city that lasted until 1924, when the last Caliph hurriedly left on the Orient Express. For almost five centuries Constantinople, with its enormous racial and cultural diversity, was the centre of the dramatic and often depraved story of an extraordinary dynasty.", "asin": "0312187084", "rank": "2296879", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/41CE0N81H3L.jpg", "country": "Turkey", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}