{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 97, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I learned a lot about the heartaches of poverty. I also discovered the problems for people trying to find a new homeland."}, {"review_sentiment": 5.0, "review_text": "The first half of this beautiful tale Vargas llosa builds the reader's hatred for the bad girl. As she abuses the protagonist she demonstrates the universal difference in matters of pathologic love, between the one you love and the one who loves you. Only rarely for the flawed can they be the same person and mutually complementary. More often the conflict and jealousy are drawn in shameful displays that Vargos Llosa draws masterfully in these characters' lifetime of love. The second half of the book draws out our sympathy for the complex creature Ricardo loves, though he stays true to himself through the decades. Certainly the screenwriters of Forest Gump borrowed from this masterpiece in creating Jenny. The ending is a poignant tear jerker."}, {"review_sentiment": 5.0, "review_text": "Amazing story telling of the  infamous archetype femme fatale and the poor man who can't live with her but can't live without her."}, {"review_sentiment": 5.0, "review_text": "brilliant, of course"}, {"review_sentiment": 4.0, "review_text": "very nice novel"}, {"review_sentiment": 5.0, "review_text": "Loved it. Kept getting better and better"}, {"review_sentiment": 5.0, "review_text": "I loved this books. The locations. Was a great read."}, {"review_sentiment": 5.0, "review_text": "What a dynamic writer and quirky characters and so many interesting historical/ cultural contexts regarding Peru."}, {"review_sentiment": 4.0, "review_text": "Not a great novel, but a very pleasurable read.  Gracefully written, and compelling in its portrait of an obsessive but otherwise gentle and cultured man, and of picaresque and destructive object of universal and perpetual desire.  Some readers have called \"The Bad Girl\" a rewriting of \"Madame Bovary,\" but that doesn't seem a plausible or interesting comparison."}, {"review_sentiment": 5.0, "review_text": "A very good book . I recommend it to everyone who enjoyes reading a well written book"}]}, "authors": ["Mario Vargas Llosa"], "isbn": "031242776X", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Bad Girl: A Novel", "word_cloud": "learn lot heartache poverty also discover problem people try find new homeland first half beautiful tale llosa build hatred girl abuse protagonist demonstrates universal difference matter pathological love love only rarely flaw person mutually complementary more often conflict jealousy draw shameful display draw masterfully character lifetime love second half draw sympathy complex creature love stay true decade certainly screenwriter borrow masterpiece create end poignant tear jerkier amazing story tell infamous archetype lemme fatal poor man brilliant course nice love get better better love location great dynamic writer quirky character many interesting cultural context regard not great pleasurable write compel portrait obsessive otherwise gentle cultured man picaresque destructive object universal perpetual desire reader call rewrite seem plausible interesting comparison good recommend everyone enjoyed read well write", "genres": ["Fiction & Literature"], "summary": "A New York Times Notable Book of 2007\r\n\r\n\"Splendid, suspenseful, and irresistible . . . A contemporary love story that explores the mores of the urban 1960s--and 70s and 80s.\" The New York Times Book Review\r\n\r\nRicardo Somocurcio is in love with a bad girl. He loves her as a teenager known as \"Lily\" in Lima in 1950, when she flits into his life one summer and disappears again without explanation. He loves her still when she reappears as a revolutionary in 1960s Paris, then later as Mrs. Richardson, the wife of a wealthy Englishman, and again as the mistress of a sinister Japanese businessman in Tokyo. However poorly she treats him, he is doomed to worship her. Charting Ricardo's expatriate life through his romances with this shape-shifting woman, Vargas Llosa has created a beguiling, epic romance about the life-altering power of obsession.", "asin": "031242776X", "rank": "113179", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51SOxPACqeL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}