{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 64, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Even before the Oscar-winning biopic MILK starring Sean Penn, the late Randy Shilts wrote this lively, angry history of a Castro enterpreneur who was killed by a \"family man\" who blamed his business failures on anyone but himself and then tried to indict junk food as the reason for a murderous rage.  Harvey Milk has become a modern gay American martyr, and this book would be well worth reading even if he weren't."}, {"review_sentiment": 5.0, "review_text": "good book"}, {"review_sentiment": 5.0, "review_text": "This was the first LGBTQ history book that I read when I was 16 in the mid 90's.  It blew my mind.  Well written and historically accurate.  If you watched MILK and want to know more in deeper detail this book is for you."}, {"review_sentiment": 2.0, "review_text": "This book reads like a breathy gossip column not a well-researched non-fiction book.  There are no footnotes or chapter sources to let you know where particular information comes from - just an author's note that it is based on \"interviews\".  I bought this book for my son to use as a sour for a  research paper and it was useless."}, {"review_sentiment": 5.0, "review_text": "This work is perhaps the most detailed ever written on the life and times of Harvey Milk. This book is so loaded with facts and details of every sort that some sections become bogged down with election results and the finer details of politics. This book, however, is a thoroughly researched text that manages to capture the the frustrations and hopes  of the early days of the movement. While we know Milk's story is one without a happy ending, this book escapes the same fate. Concluding with transcripts of some of Harvey Milk's inspiring campaign speeches the book ends on a high note with hope for the furniture. Randy Shilts' writes in such a masterful way that one comes away empowered by the life of Harvey Milk rather than sad that such a man was taken too soon."}, {"review_sentiment": 5.0, "review_text": "Though I've seen the documentary and spent my formative gay years living in San Francisco amongst the legend of Harvey Milk, reading the story of the Life and Times takes on a life of its own."}, {"review_sentiment": 5.0, "review_text": "Mandatory LGBTQ history!"}, {"review_sentiment": 5.0, "review_text": "Excellent quality, excellent read."}, {"review_sentiment": 5.0, "review_text": "This is the book that chronicles the life of the man many LGBT people think of as the MLK of the LGBT rights movement-Former San Francisco city Supervisor Harvey Milk. Randy Shilts is the man who wrote this book, and it's an engrossing and inspiring read, despite it's sad ending. If you are LGBT and have not read this book yet, then damn, GO AND READ IT. It's a great chronicle of the life of a great Gay man and hero of our movement."}, {"review_sentiment": 4.0, "review_text": "I thoroughly enjoyed reading this book. Randy Shilts is an amazing writer and he's very intelligent. The information in this book is engaging. It's just that there are no pictures in this ebook. If my memory serves me well, the copy I borrowed from a library has pictures. And according to Vince Emery, author of The Harvey Milk Interviews, Harvey did not have a relationship with an underaged boy. But in this book Shilts said so. I will give Harvey did benefit of the doubt. The Mayor of Castro Street is very intellectually stimulating. I noticed that he included bits and pieces of Harvey's connection to Jonestown. I wanted more details, but he at least mentioned it, which is more than most people do. He gives the exact amount of information and the specific details that I would have asked for. It's really excellent, except for a few mistakes (words), but they certainly did not ruin the book for me. Last but not least, as someone who lived in San Francisco for several years, I loved seeing the name of the streets and landmarks. They made me nostalgic. This is a book that I'd read repeatedly 'cause it's eye-opening. I recommend it to everyone. It's very good."}]}, "authors": ["Randy Shilts"], "isbn": "0312560850", "longitude": -122.4192363, "periods": ["1900s", "Recent Releases"], "title": "The Mayor of Castro Street: The Life and Times of Harvey Milk", "word_cloud": "even biopic star sean late write lively angry history entrepreneur kill family man blame business failure anyone try indict junk food reason murderous rage modern gay american martyr well read even good first history mid blow mind write historically accurate watch want know deeper detail read breathy gossip column footnote chapter source let particular information come author note base interview buy son sour research paper useless work perhaps detailed ever write loaded fact detail sort section become bogged election result finer detail politics however thoroughly research text manage capture frustration hop early day movement know story happy end escape fate conclude transcript inspire campaign speech end high note hope furniture write masterful way come away empowered rather sad man take soon see documentary spent formative gay year live among st legend read story take mandatory history excellent quality excellent chronicle man many people think right city man write engross inspire sad end yet damn great chronicle great man hero movement thoroughly enjoy read amazing writer intelligent information engage picture memory serf well copy borrow library picture accord author relationship underage boy say give benefit doubt intellectually stimulate notice include bit piece connection want detail least mentioned people give exact amount information specific detail ask really excellent mistake word certainly ruin last least someone live several year love see name street landmarks make repeatedly recommend everyone good", "genres": ["Biography", "History", "LGBT", "Politics"], "summary": "Known as \"The Mayor of Castro Street\" even before he was elected to the San Francisco Board of Supervisors, Harvey Milk's personal life, public career, and final assassination reflect the dramatic emergence of the gay community as a political power in America. It is a story full of personal tragedies and political intrigues, assassinations at City Hall, massive riots in the streets, the miscarriage of justice, and the consolidation of gay power and gay hope.\r\n\r\nHarvey Milk has been the subject of numerous books and movies, including the Academy Award–winning 1984 documentary, The Times of Harvey Milk. His life is also the basis of a 2008 major motion picture, Milk, starring Sean Penn.\r\n\r\n“A remarkable work [of] biography, social history, and political machination . . . Exceptional.” The Los Angeles Times", "asin": "0312560850", "rank": "186237", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/519Ur524aAL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}