{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 6, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "well written......"}, {"review_sentiment": 3.0, "review_text": "In Dionne Brand's ambitious novel, What We All Long For, the reader is introduced to four Toronto 20-something characters as they explore issues of race and identity and provide friendship to each other. All of the main characters are children of immigrant parents who migrated to Toronto for a \"better\" life. And while they have agreed to never talk about family, it is their family histories that have shaped who they are and contribute to their identity issues.Tuyen, a lesbian artist of Vietnamese parents, struggles to be a loyal daughter and sister but wants to be accepted for who she is. Oku struggles with showing his poetic side and walking on the darker side of the law, anything to be out from under the thumb of his Jamaican father. Jackie, a biracial woman, cannot move forward as she feels committed to saving her brother when he does not want to be saved. And Carla is weighed down by her parents not being able to follow through on the dreams that they brought with them from Halifax.Brand does an excellent job of developing the characters and evoking the essence of Toronto. The reader will see Toronto through the eyes of these young, urban people but the storyline felt stifled as action is slowed to wait on the characters being developed. At times, the reader is left hanging when the storyline of one character quickly changes to another character.The ending was an unexpected twist as the reader did not see it coming. But it is this unforeseen ending that causes the families to meet. But, alas, the moment comes and goes too quickly for the reader and the story is over.I recommend this book to fans of Dionne Brand and readers who like the themes of race, identity, and immigration.Reviewed by BeverlyAPOOO BookClubJuly 12, 2009"}, {"review_sentiment": 4.0, "review_text": "Dionne Brand takes the youth of Toronto and brings them to vivid life in this novel about several twenty-somethings living in the city and the way their lives do - and do not - meet.I felt the main characters to be well-developed and interesting, though some of the secondary characters could have had a bit more depth to them. The motifs of youthfulness, race, and what it is to live in a city were brought to bear skillfully, as was the over-arching theme of longing.All in all, I enjoyed this book."}, {"review_sentiment": 3.0, "review_text": "Something I long for in WHAT WE ALL LONG FOR is the passionate engagement with a love of solitude and the genius with language that you find in so many of Brand's other books, for instance this inspired description of when she's living alone in her little house far out in the country in THE MAP TO THE DOOR OF NO RETURN, where she lives among neighbours who love \"country music's lonesome and outlaw tenors\" and where she scrutinizes \"each window's drama of trees and sky\", and on summer nights lies \"in the very, very dark of the country, the smell of pine and cedar around me, the very quiet of the bush pressing in, and I listen till I fall asleep.\"Or when she meditates on the relevance and nature of identity, on her Caribbean childhood, on flame trees that are \"at their torrid best in the dry season.\"But in WHAT WE ALL LONG FOR I found the novel's landscape (cityscape) too noisy, too populated, too busy for the arid world she ordinarily gives such a depth of emotion to."}, {"review_sentiment": 3.0, "review_text": "I think that Dionne Brand has forgotten what it is like to be young. She makes the young characters in her book sound like wistful, whiny granmas and grandpas. She misses the immediacy.For a better read, pick up larissa lai's When Fox is a Thousand, which manages to capture the vital, grittines thsi book tries for."}, {"review_sentiment": 5.0, "review_text": "The complexity of the characters and how every story intertwines so beautifully kept me absolutely riveted to this book!  The ending took a somewhat unexpected, yet full-circle turn; making me leave the book feeling both closure, and wondering what would happen next.  I dreamt about these characters for days afterwards.The fact that it was based in Toronto was a bonus too.  Nice to recognize the places described."}]}, "authors": ["Dionne Brand"], "isbn": "0312377711", "longitude": -79.387207, "periods": ["1900s"], "title": "What We All Long For", "word_cloud": "well write ambitious introduce character explore issue race identity provide friendship main character child immigrant parent migrate better life agree never family family history shape contribute identity lesbian artist vietnamese parent struggle loyal daughter sister want accepted struggle show poetic side walk darker side law anything thumb father biracial woman forward feel commit save brother want save weigh parent able follow dream bring excellent job develop character evoke essence see eye young urban people story line felt stifled action slow wait character develop time left hang story line character quickly change end unexpected twist see come unforeseen end cause family meet alas moment come go quickly story recommend fan reader theme race identity take youth bring vivid life several live city way live felt main character interest secondary character motif youthfulness race live city bring bear skillfully theme enjoy something passionate engagement solitude genius language find many instance inspire description live alone little house far country live neighbor love country music lonesome outlaw tenor scrutinize window drama tree sky summer night lie dark country smell cedar quiet bush press listen till fall asleep meditate relevance nature identity childhood flame tree torrid best dry season find landscape cityscape noisy populate busy arid world ordinarily give depth emotion think forget young make young character sound wistful whiny grandma grandpa miss better pick clarissa lie manage capture vital grittiness this try complexity character story intertwines beautifully keep absolutely rivet end take somewhat unexpected yet turn make leave feeling closure wonder next dreamy character day fact base bonus recognize place describe", "genres": ["Fiction & Literature"], "summary": "What We All Long For follows the overlapping stories of a close circle of second-generation twenty-somethings living in downtown Toronto. There’s Tuyen, a lesbian avant-garde artist and the daughter of Vietnamese parents who’ve never recovered from losing one of their children in the crush to board a boat out of Vietnam in the 1970s. Tuyen defines herself in opposition to just about everything her family believes in and strives for. She’s in love with her best friend Carla, a biracial bicycle courier, who’s still reeling from the loss of her mother to suicide eighteen years earlier and who must now deal with her brother Jamal’s latest acts of delinquency. Oku is a jazz-loving poet who, unbeknownst to his Jamaican-born parents, has dropped out of university. He is in constant conflict with his narrow-minded and verbally abusive father and tormented by his unrequited love for Jackie, a gorgeous black woman who runs a hip clothing shop on Queen Street West and dates only white men. Like each of her friends, Jackie feels alienated from her parents, former hipsters from Nova Scotia who never made it out of subsidized housing after their lives became entangled with desire and disappointment. \r\n\r\nThe four characters try to make a life for themselves in the city, supporting one another through their family struggles.\r\n\r\nThere’s a fifth main character, Quy, the child who Tuyen’s parents lost in Vietnam. In his first-person narrative, Quy describes how he survived in various refugee camps, then in the Thai underworld. After years of being hardened, he has finally made his way to Toronto and will soon be reunited with his family – whether to love them or hurt them, it’s not clear. His story builds to a breathless crescendo in an ending that will both shock and satisfy readers.", "asin": "0312377711", "rank": "517346", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/41cY8pi9%2BEL.jpg", "country": "Canada", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}