{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 78, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "bitingly funny"}, {"review_sentiment": 5.0, "review_text": "A perfect novel--clever, smart, witty.  This has made my short list and has become one of my favorite novels of all time.  (The violence is only hinted at.)"}, {"review_sentiment": 3.0, "review_text": "First heard this as an audio book and found it so memorable that a couple of years later decided to read it in print. Enjoyed it both times though the obscure vocabulary sometimes got in the way. A sly entertaining development of plot narrated by a gourmande."}, {"review_sentiment": 1.0, "review_text": "Hey very boring novel for anyone that is not interested in cooking menus and recipes"}, {"review_sentiment": 5.0, "review_text": "This book is a rarity in the style of The Perfume. Intellectual, provocative, thrilling, and an ode to good food, it provides a multi-layered treat for the mind."}, {"review_sentiment": 4.0, "review_text": "Lots of British food vocabulary!"}, {"review_sentiment": 5.0, "review_text": "Super. A delight for the Lover of subtle black Humor, not to mention cuisine."}, {"review_sentiment": 2.0, "review_text": "I tried; I really did. When someone has the bravery to actually write a book and release it to public scrutiny I have always felt duty bound to read it if we cross paths. However, time is ever shortening and there are a lot of books to be read. I read 17 books over a 6 day vacation recently. I have resorted to a dictionary in times of literary famine. I am no sloth. I just couldn't do this one. I'm sorry. It never drew me in or got up and went anywhere I desired to follow. In fact, there was really no single thread to attempt to follow so much as there were many danglers needing tidied. I found myself checking my page number on 129 to see how much farther I had to go. When I again checked (page 131) I determined I'd rather finish War and Peace. The cover art is lovely though."}, {"review_sentiment": 3.0, "review_text": "The idea was better than the book.  But I do like Lanchester."}, {"review_sentiment": 5.0, "review_text": "I found this on a Daily Meal website of the top 10 food books of all time.  It is really wonderful and if you're into food, you'll enjoy it totally.  Is also a good history of the times and area."}]}, "authors": ["John Lanchester"], "isbn": "0312420366", "longitude": 0.0, "periods": ["1900s"], "title": "The Debt to Pleasure", "word_cloud": "bitingly funny perfect clever smart witty make short list favorite novel time violence hint first heard audio find memorable couple year later decide print obscure vocabulary sometimes get way sly entertain development plot narrate gourmand bore anyone interested cooking menu recipe rarity style provocative thrilling ode good food provide treat mind british food vocabulary delight subtle black mention cuisine try really someone bravery actually write release public scrutiny always felt duty bound cross path however time ever shorten lot day vacation recently resort dictionary time literary famine sloth sorry never draw get go anywhere desire fact really single thread attempt follow much many danglers need tidy find check page number see much farther go check page determine rather finish cover art lovely idea better like find website top food time really wonderful food enjoy totally also good history time area", "genres": ["Fiction & Literature", "Mystery & Suspense", "Humour", "Food and Wine"], "summary": "To like something is to want to ingest it and, in that sense, is to submit to the world; to like something is to succumb, in a small but contentful way, to death.\r\n\r\nTarquin Winot - hedonist, food obsessive, ironist and snob - travels a circuitous route from the Hotel Splendide in Portsmouth to his cottage in Provence. Along the way he tells the story of his childhood and beyond through a series of delectable menus, organized by season. But this is no ordinary cookbook, and as we are drawn into Tarquin's world, a far more sinister mission slowly reveals itself . . .\r\n\r\nWinner of the 1996 Whitbread First Novel Award, John Lanchester's The Debt to Pleasure is a wickedly funny ode to food; an erotic and sensual culinary journey. Its elegant, intelligent and unhinged narrator is nothing less than a work of art himself.", "asin": "0312420366", "rank": "640607", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/41%2BCw7mfNoL.jpg", "country": "FR", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}