{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 33, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "Not his best work.  Very little action, too many minute details"}, {"review_sentiment": 5.0, "review_text": "This is his second book I have read. Glad to have discovered him."}, {"review_sentiment": 4.0, "review_text": "After reading The Big Blowdown I sort of felt like it was a dress rehearsal for a 5-star Pelecanos period piece, Hard Revolution.  The author brings us life on the blue-collar streets of postwar and still-segregated D.C., liberally seasoned with sex, booze, and smokes.  Joe Recevo and Pete Karras came up from the streets together, survived combat in WWII, but they're headed nowhere good.  And as much as they'd like to avoid it, they're on a collision course.  As always in a Pelecanos novel, the minor characters have their nice moments on stage as well.  Mike Florek, who came to D.C. a boy and left as a man, especially stood out for me."}, {"review_sentiment": 5.0, "review_text": "I like the works of George Pelecanos and this novel did not disappoint. I enjoy the back story leading up to a present character."}, {"review_sentiment": 5.0, "review_text": "I don't like this book as much as some Pelecanos books but I still give it 5 stars because he is such a great writer."}, {"review_sentiment": 5.0, "review_text": "I am a fan of Pelecanos, but I had not idea I had latched onto A Great American Novel when I started reading \"The Big Blowdown.\" It is a rich, magnificent epic, clothed in the the trappings of the best kind of Film Noir, circa 1949. Anyone interested in trying out a Pelecanos book would do well to start with this one, where it all began for the characters in his later books. Taken on it's own, it stands alone as the kind of book you cannot put down, and are sorry to see it end. You won't be disappointed."}, {"review_sentiment": 4.0, "review_text": "Joe Recevo and Pete Karras were friends since they were kids, until their boss decided he didn't like Pete and had him badly beaten, giving him a crippling knee injury. Three years later, their lives will soon intersect when their old boss decides he wants Nick Stefanos, Karras' employer at a diner, to start paying him protection. Who will be left standing after the Big Blowdown?Here we are. Another great book by George Pelecanos, the first in his DC Quartet. In the Big Blowdown, Pelecanos paints a picture of life in DC, with two vets, Karras and Recevo, as the main characters, taking them from their teens to their thirties. As with Pelecanos' other books, the Washington DC setting is a character unto itself.The crime elements in this one aren't as pronounced as in the previous three Pelecanos book I've read, the Nick Stefanos trilogy, Nick being the grandson of the Nick in this book. The crime elements stick to the sidelines for most of the book, namely Florek looking for his missing sister and the hooker murders. Everything comes together at the end, just in time for the Big Blowdown.Much like Nick Stefanos in his trilogy, Pete Karras is a conflicted character, not really sure how to act with his family. Or his mistress, for that matter. I think it's partly because of his experiences in World War II and partly from his upbringing. It sure goes a long way toward explaining why Dimitri Karras acts the way he does in King Suckerman, the next book in the DC Quartet.Reading this right after reading the Stefanos trilogy, it's amazing to see what direction Pelecanos' writing was going, from a hardboiled style to a more literary one."}, {"review_sentiment": 5.0, "review_text": "It was given as gift for Christmas, and the recipient was very happy! , , , , , , ,"}, {"review_sentiment": 5.0, "review_text": "I am not a reader that is into what I term \"The Godfather Writer's Guild\", yet the very first page of The Big Blowdown was a grabber. I stayed up all night reading it and have read most of his works since that first one. Not a poser by any means, George Pelecanos is a writer of the degree of Dennis Lahane (Gone, Baby, Gone). Try him out, I think you'll find him as surprising a writer as I have."}, {"review_sentiment": 5.0, "review_text": "I have read everything by Pelecanos but for some reason had skipped around the \"DC Quartet\" (Big Blowdown, King Suckerman, etc).  But Blowdown was a really nice period piece set just before and after WWII, taking place in Peleconos' stomping ground of Washington DC.  Without giving away too much, it's about friendship and how ties can be stretched but not entirely broken, protecting your territory, backing up your friends no matter what, and facing your destiny. This book contains a lot of familiar names for readers of Pelliconos' other books (Nick Stephanos,etc) who grow up to become main characters in later fiction by the author.The strong point of the book is all the little details here and there, and without living on the east coast you just know that every eatery, bar, dance hall and street name is correct (if you do live in DC this would be a fun trip down memory lane).  Pelecanos really has a gift for setting time and place in his novels and this is no exception.In all, Pelecanos manages to weave together several interesting characters in a tough guy milieu and brings all the plotlines to a satisfying conclusion.  I am looking forward to reading the other three books in this series as the novels travel from the 40s and 50s into the 60s and 70s and beyond."}]}, "authors": ["George Pelecanos"], "isbn": "0312242913", "longitude": -77.0366456, "periods": ["1900s"], "title": "The Big Blowdown", "word_cloud": "not best work very little action many minute detail second glad discover read sort felt dress rehearsal period piece author bring life street postwar liberally season sex booze smoke come street together survive combat head nowhere good much avoid collision course always minor character nice moment stage well come boy left man especially stand like work disappoint enjoy back story leading present character like much still give star great writer fan pelican idea latch start read rich magnificent epic clothe trapping best kind circa interested try well begin character later stand alone kind put sorry see end friends kid decide badly beat give cripple knee injury year later live soon intersect old bos decide want employer diner start pay protection leave stand here great first paint picture life vet main character take teen thirty set character unto crime element pronounce previous trilogy grandson crime element stick sideline namely look miss sister hooker murder come together end time trilogy conflict character really sure act family mistress matter think partly experience partly upbringing sure go long way explain act way next right read trilogy amaze direction write go hard boiled style literary give gift recipient happy term yet first page grabber stay night reading work first not mean writer degree think surprising writer everything reason skip really nice period piece set take place stomping ground give away much friendship tie stretch entirely broken protect territory back friend matter face destiny contain lot familiar name reader become main character later fiction strong point little detail live east coast know eatery bar dance hall street name correct live trip memory lane really set time place novel manages weave together several interesting character tough guy milieu bring plot lines satisfy conclusion look forward read series novel travel", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Book 1/4 in the DC Quartet Series\r\n\r\nFor Joey Recevo and Pete Karras, two kids from one of Washington's rougher neighborhoods, the easiest work to find after the War is all criminal---providing a little muscle for a local boss. But Karris is soft on his fellow immigrants, and the boss can't let his mob get soft, so one of his boys gives Karras a painful lesson.\r\n\r\nThree years later, it's the same mob that figures big Nick Stefanos's grill needs protection---and this decision will once again bring Joey and Pete face-to-face. In this final confrontation, the two of them will find the meaning of friendship, the heart of honor, and the cost of both.\r\n\r\nPowerfully told, elegantly wrought, The Big Blowdown is a knockout.", "asin": "0312242913", "rank": "351718", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51vOehY0GoL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}