{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 85, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "Most of the characters in this story went about in a fugue like state and were about as emotional as zombies.  I can handle ONE character like that in a book but not all of them.  The writer's depiction of Pearlie didn't feel true or accurate.  She seemed almost dead and lifeless as did her boyfriend/husband.  None of them cared about anything very much and as a result, the reader didn't care about THEM either.  As is common today and maybe even 'required' (if a writer wants to be popular) is the pandering addition of a homosexual in the story.  The book dragged on and on and I didn't want to waste my time reading something as uninteresting as this so I didn't finish it."}, {"review_sentiment": 5.0, "review_text": "Stupendous"}, {"review_sentiment": 5.0, "review_text": "A beautifully written poignant story."}, {"review_sentiment": 5.0, "review_text": "A marriage happens; events occur, time marches on through first blush to the golden age. And still even as we know this partner through our experiences, do we really know how this person will react to the stimuli that presents itself?"}, {"review_sentiment": 5.0, "review_text": "Wonderful story. Deals with homosexuality in the times where everyone was in the closet. Develops the characters well. Answers the question, \"what is a marriage\"."}, {"review_sentiment": 5.0, "review_text": "Mr. Greer continues to prove he's one of America's bright new voices in literature."}, {"review_sentiment": 1.0, "review_text": "What a waste of time. This very improbable tale of two men,  one dumber than the other, and a woman who puts up with both of them. Into that mix toss in an ungrateful son and an unsatisfying ending and you end up with an unlistenable story.  Throwing in a few real places and events of the ‘40s and ‘50s to make it appear real doesn’t work. I like the reader, Epatha Merkerson of “Law & Order” fame but here she’s reading too fast, maybe wanting to get it over with as quick as possible."}, {"review_sentiment": 3.0, "review_text": "My general feeling about this book is \"blah\".  I thought it would be a fascinating story about the inside of a marriage, with a lot of character development.  Instead, only one character (Pearlie) is even the tiniest bit developed, whereas I got no sense at all of the complexity/humanness of other characters (her husband Holland, her son Sonny, and a friend\" Buzz).  I also got very little sense of the relationship between Pearlie and Holland, and the ways in which they built their marriage and their love for one another.  So little insight gained about life, little entertainment.  I wouldn't recommend it to others."}, {"review_sentiment": 5.0, "review_text": "This is a deeply moving novel of a couple’s life.  The unexpected story twists are profoundly significant, but to divulge them would spoil the reader’s experience.  Highly recommended.  A beautifully written novel."}, {"review_sentiment": 5.0, "review_text": "A five star book for the way it made me savor the language (Greer is a lyrical literary master - such beautiful similes/metaphors), the way it made me care about the characters, and the way it made me admire the main character, Pearlie, whose choices were different than my own would have been--nay, whose sole focus was on a bigger picture than her emotions at the time (few possess this strength--yet the ones that do reap unfathomable rewards). That she possessed such restraint in a difficult situation, and in such an unfriendly time for her dilemma, did not seem at all improbable to me, rather admirable.This book was my friend for the week or so I kept it close, pulling it out at every minute opportunity I had to linger over Greer's masterful work."}]}, "authors": ["Andrew Sean Greer"], "isbn": "0312428286", "longitude": -122.4192363, "periods": ["1900s", "Recent Releases"], "title": "The Story of a Marriage: A Novel", "word_cloud": "most character go fugue state emotional zombie handle character writer depiction feel true accurate seem almost dead lifeless none care anything much result common today maybe even writer want popular pander addition homosexual drag want waste time read something uninteresting finish stupendous beautifully write poignant marriage happen event occur time march first blush golden age still even know partner experience really know person react stimulus present wonderful homosexuality time everyone closet develop character well question marriage continue bright new voice literature waste time improbable tale men dumber woman put mix toss ungrateful son unsatisfying end end listenable throw real place event make appear real work like fame read fast maybe want quick possible general feeling blah think fascinate inside marriage lot character development instead character even tiniest bit developed get sense character husband son friend also get little sense relationship way build marriage love so little insight gain life little entertainment others deeply move couple life unexpected twist profoundly significant divulge experience recommend beautifully write star way make savor language lyrical literary master beautiful way make care character way make admire main character choice different sole focus bigger picture emotion time posse strength yet one reap unfathomable reward possess restraint difficult situation unfriendly time dilemma seem improbable rather friend week keep close pull minute opportunity linger masterful work", "genres": ["Fiction & Literature", "LGBT", "Historical Fiction"], "summary": "A Washington Post Book of the Year\r\n\r\n\"We think we know the ones we love.\" So Pearlie Cook begins her indirect, and devastating exploration of the mystery at the heart of every relationship--how we can ever truly know another person.\r\n\r\nIt is 1953 and Pearlie, a dutiful young housewife, finds herself living in the Sunset District in San Francisco, caring not only for her husband's fragile health, but also for her son, who is afflicted with polio. Then, one Saturday morning, a stranger appears on her doorstep, and everything changes. Lyrical, and surprising, The Story of a Marriage is, in the words of Khaled Housseini, \"a book about love, and it is a marvel to watch Greer probe the mysteries of love to such devastating effect.\"", "asin": "0312428286", "rank": "275888", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/41R3QVNlfDL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}