{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 191, "rating": 4.0, "reviews": [{"review_sentiment": 1.0, "review_text": "A great story that sadly Pynchon never tells.Out of respect I finished it, all 700 plus pages. Yes, I 'got it '. He basically wrote a travelogue of public houses, connected by his take of the Mason Dixon story. After about the fifth or sixth incredibly tedious description of the tavern du jour, I should have known. It never got better.The liner notes proudly compared it to Huckleberry Finn.Not even close.DPD"}, {"review_sentiment": 2.0, "review_text": "Wow . . . I thought I was somewhat \"literary\" in that I've read thousands of books of all eras, prose style, and voice, but now I feel just dumb.  I admire anyone who can honestly say they fully comprehended even half of this story and verse.  At least with Shakespeare, Chaucer, et. al. I could learn the prose, style, and references but this language was very obtuse and difficult to learn. Perhaps the readers were better versed in 18th-century British dialect and idiom than I.  Like trying to build a watch to find out what time it is."}, {"review_sentiment": 4.0, "review_text": "good book from a complex author"}, {"review_sentiment": 4.0, "review_text": "Arrived in good condition as advertised. This is a beautiful version of M&D.; Cover could have used a bit of cleaning prior to shipment, but overall very pleased with this purchase."}, {"review_sentiment": 1.0, "review_text": "Terrible, takes a lot of effort and it's not worth it"}, {"review_sentiment": 1.0, "review_text": "Vendor was good, but I could not read or tolerate this guy's style of writing.  He apparently is reproducing an old style of English language, which is full of unknown terms and syntax for a modern Yankee. He also has a distracting habit of capitalizing many common nouns. I couldn't get through the first chapter - off to Goodwill."}, {"review_sentiment": 5.0, "review_text": "For Thomas Pynchon fans, this is one of his best ever. If you are new to Pynchon, this 774 page book is not a quick read; in fact, part of the fun is Googling about all the people and events you have never heard of. It can help to use an online concordance to keep up with all the characters and plot twists. Absolutely one of his best. I was sad to finish it! ( But, of course, a second and third reading will be rewarded with more fun and understanding.)"}, {"review_sentiment": 4.0, "review_text": "On Kindle it's been a slog, taking me 3 times as long to get through as any other work read on Kindle.  I probably would have cut 100 pages but don't ask which ones, as I'd have to go back electronically through all those ale-house exchanges, some of which added little to any momentum line in the story). Pynchon plays time scrabble effectively, includes knowledgeable and respectful encounters with Mohawks and Iroquois, is playful with George Washington's slave, who makes kreplach, is Jewish (of a different sect than the Kosher) and sings H-va-na-gilah while Martha Washington brings in a tray of sweet-stuffed doughnuts, learned to the point of tedium in matters astronomical and surveyical (though why we need the antagonisms with the Royal Society and its astronomy master is another and distracting story; likewise on the extensive arguments in the air with Jesuits), and ultimately treats these two guys as distinct human beings with a significant fondness for each other. Language? Yeah, we get the puns and the neologisms, though I wouldn't rave about it. Would I read it again? No. Am I pleased that I did? Yes."}, {"review_sentiment": 4.0, "review_text": "Nested narrators, mythic riffs, 18th -century(ish) English withal; Zen out on the present tense and do what Pynchon always does: Go Long."}, {"review_sentiment": 5.0, "review_text": "I doubt I'll ever be more dumbfounded by an author's abilities. I doubt you will too."}]}, "authors": ["Thomas Pynchon"], "isbn": "0312423209", "longitude": 0.0, "periods": ["1700s"], "title": "Mason & Dixon: A Novel", "word_cloud": "great story sadly never respect finish page yes basically write travelogue public house connect take story fifth sixth incredibly tedious description tavern hour know never get liner note proudly compare even think somewhat literary thousand eras prose style voice feel dumb admire anyone honestly say fully comprehend even half story verse least al prose style reference language obtuse difficult learn perhaps reader better versed british dialect idiom try build watch find time good complex author good condition advertise beautiful version use bit cleaning prior shipment overall pleased purchase terrible take lot effort worth good guy style write apparently reproduce old style english language full unknown term syntax modern also distract habit capitalize many common noun first chapter fan best ever new page quick fact part fun google people event never hear help online concordance keep character plot twist absolutely best sad finish course second third reading reward fun understanding slog take time long get work probably page one go back electronically exchange add little momentum line story play time scrabble effectively include knowledgeable respectful encounter playful slave make kreplach jewish different sect sings bring tray doughnut learn point tedium matter astronomical surveyical need antagonism astronomy master distract story likewise extensive argument air jesuits ultimately treat guy distinct human being significant fondness pun neologism please yes nest narrator mythic riff is withal present tense always doubt ever dumbfound author ability doubt", "genres": ["Biography", "Fiction & Literature", "Historical Fiction"], "summary": "Charles Mason (1728-1786) and Jeremiah Dixon (1733-1779) were the British surveyors best remembered for running the boundary between Pennsylvania and Maryland that we know today as the Mason-Dixon Line. Here is their story as re-imagined by Thomas Pynchon, featuring Native Americans and frontier folk, ripped bodices, naval warfare, conspiracies erotic and political, and major caffeine abuse.\r\n\r\nWe follow the mismatched pair--one rollicking, the other depressive; one Gothic, the other pre-Romantic--from their first journey together to the Cape of Good Hope, to pre-Revolutionary America and back, through the strange yet redemptive turns of fortune in their later lives, on a grand tour of the Enlightenment's dark hemisphere, as they observe and participate in the many opportunities for insanity presented them by the Age of Reason.\r\n\r\n“A novel that is as moving as it is cerebral, as poignant as it is daring . . . A book that testifies to Pynchon's powers of invention and his sheer power as a storyteller.” The New York Times", "asin": "0312423209", "rank": "53961", "city": "Philadelphia", "image": "https://images-na.ssl-images-amazon.com/images/I/51lxI1BmI%2BL.jpg", "country": "Cape Town", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}