{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 28, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "The confusion of the end of WWII in Prague is captured in this novel. A killer takes advantage of the split between German and Czech control in the police in order to slip through the cracks of jurisdiction. Atmospheric details and two very sympathetic characters grip the reader in the chaos amidst the beauty of Prague in 1945."}, {"review_sentiment": 4.0, "review_text": "This story, beside being a god thriller, is very unique in that it addresses issues of difficult end of the war interaction between Czech and German police forces."}, {"review_sentiment": 4.0, "review_text": "Others have summarized the plot, so I won't. However, to me while the mystery was well crafted, it was the setting that made the book rise above the ordinary. First of all, Prague, and secondly, Prague after the Nazis were clearly losing the war with the Russians advancing from the East and the Americans and British from the West, How do the encircled Nazis, react, how to the subjugated Czechs react? A good sense of all that. This story is told from the perspective of a Gestapo Officer who is a criminal investigator and that of a Prague Detective. I was engrossed for half the book and then I looked at where I was and thought, \"I'm only half way through!\" and it became plodding to me. Partially, I think because two love stories emerge and way too much time is spent reading about the lover's telling their life stories to each other, particularly so in the German love affair. If the book was 15% shorter it would have been better and rated  5 stars from me.I also felt that the author had both the main characters do stupid and uncharacteristic things for the sake of the plot which detracted from the book's believability."}, {"review_sentiment": 4.0, "review_text": "This is a krimie set in Prague during the last days of the Nazi occupation in the spring of 1945. A terrible time in a terrible place, to be sure, but handled with dexterity by Pavel Kohout, a terrible time because of the death throes of the Nazi regime, and terrible place because of the coming Armageddon between that Nazi army of occupation in Czechoslovakia and the Red Army just over the hill. In addition, everyone assumes that when the Nazi grip further loosens there will be a Czech uprising.In the midst of this Dantesque inferno a Czech police officer and a German homicide detective are assigned to apprehend a serial killer of widows. The Czech is very junior and gets the job because he speaks German, while the German is attached to the feared Gestapo though he never thinks of himself as ‘one of those beasts,’ but he finds it helpful to let others think he is. The German underestimates the Czech and the Czech misjudges the German.There is a lot of Prague in it, and I got out our well-worn tourist map to follow some of the fro’ing-and-to’ing.It runs to nearly 400 pages and I confess skipping yet another scene of chaos and confusion that did not seem to be moving the story along. The human dimension was of far greater interest as the two reluctant colleagues, each aware that in a few days they may be at war with each other, work together, come to trust one another, and guardedly confide in their common fears and hopes. While there are paeans to Czech nationalism, the Germans are not reduced to cardboard ‘beasts’ though some certainly were, as were some of the Czechs, including the perpetrator.It all makes sense in the story, and the odd couple reminded me Robert Janes's mis-matched pair Jean-Louis St. Cyr and Hermann Kohler, who together police occupied Paris at about the same time but in less apocalyptic circumstances.My short lesson in Czech history while we were there in 2014 included this observation. When Woodrow Wilson created Czechoslovakia, the Czechs and Slovaks banded together to drive the Germans and Hungarians out of THEIR country. Then the Germans came back and drove out Jews, gypsies, and more, and in poured even more Germans. Then the Communists took over and drove out Germans again, along with 200,000 Czechs. Then the Red Regime decayed and the communists were driven out, though they had few places to go by then, some did go to Russia. Then the Slovaks and Czechs drove each other out of THEIR country, this, for the first time, was done peacefully. One can only wonder what the future will bring. Who next will be expelled, and how it will be done.I have a few complaints about the translation that often renders 'Reich' as 'Empire' and refers to German military vehicles as jeeps (General Purpose, or GP, vehicles made by General Motors in Detroit) and now a closely guarded brand-name. 'Reich' refers to the nation, its people, its realm, its regime. The French speak of the Republic in the same way. But the curse of Naziism has rendered the ordinary use of the term 'reich' impossible today. Reich does not imply or entail an empire, however that is defined, any more than the French Republic does. Ergo it is a mistaken hang the adjective 'imperial' on German functionaries in Prague, though that is done more than once. And no, the Germans did not have American jeeps nor did BMW or Mercedes make something comparable. If this is the writer's error, it should nonetheless be corrected. This is a fine book, and such errors distract the attention of a reader.My guess is that Picador, the English publisher, no longer employs sub-editors who might notice these things, preferring computer power to brain power."}, {"review_sentiment": 5.0, "review_text": "I said I love it, now stop asking me to waste time typing for your benefit, thank you very much."}, {"review_sentiment": 5.0, "review_text": "Don't read this book if you are skittish. However, if you want a true page turner about a real event in history (the end of WW2 in Prague) this is a must-read. It is certainly the best book I have read in a very long time."}, {"review_sentiment": 3.0, "review_text": "Novelist Pavel Kohout has written \"The Widow Killer: A Novel,\" a detective story set in Nazi-occupied Prague; \"I Am Snowing,\" about the effects on the informers and their victims of opening of the Communist-era secret police files; and \"The Hangwoman,\" about executioners. As we might expect from this list, there isn't even a smidgeon of humor in \"The Widow Killer.\" Which is too bad, since the Czechs have notably droll and sophisticated funny bones, homicide cops tend to grow humor defenses along with thick hides towards man's inhumanity to man (Philip Kerr's Bernie Gunther is a classic case), and sometimes observers of Nazi occupiers (for example, Hans Helmut Kirst's Lt. Colonel Grau and Inspector Prever in his classic \"The Night of the Generals\") draw wickedly funny caricatures of these jack-booted thugs. Kohout's \"The Widow Killer\" has none of this and is as grim as it gets. Perhaps Prague escaped much of the physical destruction of other occupied capitals; Kohout uses his novel to show how, under the Baroque architecture, Prague's soul was burned and brutalized.A deranged sociopath begins coolly carving Prague's widows, welding his poultry knife in the waning days of the Nazi \"Protectorate\" (translate, brutal German occupation). His insanity has a crystal-clear religious basis, exposed in the confessional, but hidden by a cowardly misguided priest. As the killer perfects his craft, the police realize they face an extremely devious and efficient serial butcher.A young Czech inspector, Morava, is partnered with a senior Gestapo police officer, Buback, and each has his secret personal agenda, while their superiors, anticipating the chaos as the Russians and Americans converge on German-held Prague, have even deeper secret agendas for the pair and their organizations. As the Widow Killer gets better and better at his slaughter, the Prague police and their Gestapo \"minder\" find the Fates dead set against them.Just as the Czech detective sets a trap for the Widow Killer, the Fates set the warring forces into collision, and from the most personal level to the fate and future of the Czech nation, Prague collapses into chaos. Almost everything literally comes down in flames. Only the young Czech detective is still standing; indeed, he rises to the top of the new Communist Czech police forces. But as Kohout tells us in the last line of \"The Widow Killer: A Novel\": \"He had no idea he was rushing headlong into his worst mistake.\"This book is no mystery entertainment. It is a parable."}, {"review_sentiment": 4.0, "review_text": "Set in Prague, during World War II, this novel blurs the genre line between historical fiction and literary mystery into a quite pleasurable read. The richly described setting revolves around a quite interesting murder case. Kohout manages to bring together characters from opposite sides of the War, and makes them both surprisingly sympathetic as they work together to solve this string of ghastly murders. The tension - from both the murders and the War - mounts with more tragic events and a few too many Homeward Bound-style near misses, making the book hard to put down.As well as entertaining, I found the book to be somewhat educational as well. While I knew many of the generalities of Prague's WWII history, this book really opened up a lot of the details. And for a translated novel, the fast pace and use of language all flowed naturally and kept me completely engrossed in the story. It really felt like a flawless translation - and a thoroughly enjoyable read!"}, {"review_sentiment": 4.0, "review_text": "I bought this book for $1.00 at a book sale. A great investment. All in all, a very good story although it rambles quite a bit in the last 200 pages or so; those could have been reduced considerably without losing anything. The ending was excellent and cries out for a sequel, but that seems unlikely after all these years. It would be interesting to know how Morava fared during the Cold War and after."}, {"review_sentiment": 3.0, "review_text": "The literary and psychological possibilities generated by a detective story set in the last three months of the  Protectorate of Bohemia and Moravia (the rump state created by the Third Reich after the two-stage dismemberment of Czechoslovakia in 1938 and 1939) are promising.  But this novel does not fulfill that promise.  The major problems of the work are the clichéd nature of some of its characters and the implausibility of much of their dialogue, in which a sort of thinking-out-loud auto-didacticism occurs (in too many conversations characters review their lives and their relationships, including those of self to nation and culture, in a way that does not reflect realistic dialogue, although the subject matter of the dialogues and interior monologues is rooted in the real).  The translation by Neil Bermel is solid and should not be held responsible for any shortcomings of style and expression found in the book - those are, as the saying goes, on Kohout's plate.  It is clear from reading other works of  Kohout (e.g., \"The Hangwoman\") that he does have superior talents as a narrator and stylist, but they are not on display in \"The Widow Killer\".  If , however, you are partial to thrillers and \"police procedurals\", then you should go ahead and read the book, but don't expect either the characterizations or the accompanying philosophizing to rise above the conventional.  The story line is that of an investigation of a depraved serial killer who mutilates women in ritual fashion and who is accelerating the pace of his crimes.  As the story progresses the investigation merges with the political and military events of the fall of the Protectorate.  From a psychoanalytic point of view we readers learn rather soon that \"his mama made him do it\" -  i.e., the murderer is driven by an abject condition of total emotional dependency on the \"approval\" of his dead (and formerly domineering) mother.  His conversations with himself are well rendered, capturing the closed and agitated mental world in which he dwells.  As the fall of the Protectorate nears he transfers his brutal energies to new targets and in his own mind he becomes an avenging angel against any and all Germans he encounters, and he begins to re-imagine himself as a national savior, a \"new man\" and a leader with a special mission.  Whatever its object, he remains proud of his butchery.  The equation of the killer with unregenerate Nazis, with Hitler himself, and with the most brutal enforcers of the Communist regime to come are evident.  This is the killer's allegorical role.  Three policemen are especially important to the unraveling of the crimes and the pursuit of the madman.  And, like the killer, each of them becomes a rather obvious allegorical or symbolic agent of recent political life and its messy morality.  Superintendent Beran, of whom we learn nothing personal, is a fair-minded civil servant and highly professional policeman who also emerges as a mid-level leader in the movement to restore democracy to his country - he represents the virtues of the Czechoslovakian First Republic.  His assistant, Jan Morava, is a young and somewhat naïve \"country-boy\" who comes to the capital city and adapts rapidly to a new way of life and who shows an instinctive investigator's abilities.  His love-affair with Jitka is a side-story introduced in order to show us his admirable qualities (rooted in the traditions of his rural childhood) and to provide the killer with another heartbreakingly innocent victim.  By the end of the book Morava is transformed into the typical good man of the postwar era who makes some very bad choices and lives to regret them.  The third policeman is a German Gestapo man, Buback; he is a \"half-Czech\" who conceals his roots.  His background and responsibilities are those of a conventional criminal-police investigator (and, as emphasized, not that of a \"political\" or \"secret police\" operative, despite his position in the Gestapo).  He stands for the potentially \"good German\" who comes to his senses during the death spasms of the Third Reich.  While Buback and his German lover (a promiscuous dancer and professional mistress who is self-deceiving but always alluring) confess their human failings to each other and attempt to redeem themselves by being of service to the Czechs, Morava goes through a parallel set of ruminations in which he tries to curb his antipathy toward Germans by recognizing their common humanity with his own people.  These deliberations strike me as too transparent and somewhat awkward, and they represent, I believe, Kohout's  retrospective contemplation  of his own feelings at the time of the story (1945).  They are psychologically plausible and instructive, but should have been rendered more indirectly and less clumsily.  As for the \"thriller\" elements of the story, it becomes obvious by the middle of the book that both Morava and Buback (and his girlfriend Grete, who is the tainted counterpart of Jitka) will not only solve the case but will also be on a personal collision course with the murderer, placed by the author on converging pathways that will lead inevitably to a gruesome conclusion.  The reader will be surprised by the identities of the killer's last sacrificial lamb and the character who renders the ultimate justice.  Interesting details of the historical situation are introduced in the final pages of the book  -- the role of General Vlasov's doomed renegade army in evicting the Germans from Prague; the city's rather casual and chaotic liberation; and the arrival of a fiery and decisive Communist leader named Svoboda who has definite plans for the constitution and political complexion of the future Czechoslovakian state  (this is not  Ludvik Svoboda, the military hero who later became President; but it is a name chosen for its symbolism, a name directly translatable as \"freedom\").  Svoboda's energy, persuasive talents, apparent rectitude, and previous suffering on behalf of his cause convince Morava to commit himself to the emerging Communist regime, believing it is the path to a just society.  As  the book's final sentence states, this decision is the biggest mistake of his life.  This judgment comes at the end of a  sentimental message from Morava to the deceased Jitka  (a message that mingles a love-note with simple-minded patriotic and political musings akin to slogans).  The deflating last sentence of the book appears to be a sort of oblique self-evaluation by the author, since Morava's sudden and eager commitment to the Communist cause reflects the early \"ideological\" career of Kohout himself.  We might read it as a displaced acknowledgment of guilt, that is, as the  author's confession of and penance for the follies of his own youth, follies always implicit in the assumption of harsh and \"pure\" beliefs (and their punishing effects on the lives of others), which he too came to regret."}]}, "authors": ["Pavel Kohout"], "isbn": "0312193637", "longitude": 14.4212535, "periods": ["1900s"], "title": "The Widow Killer", "word_cloud": "confusion end capture take advantage split german control police order slip crack jurisdiction detail sympathetic character grip chaos midst beauty story god thriller unique address issue difficult end war interaction czech german police force others summarize plot however mystery well craft set make rise ordinary secondly clearly lose war advance british encircle react subjugate good sense story tell perspective criminal investigator engross half look think half way become plod partially think love story emerge way much time spend read lover tell life story particularly german affair shorter better rat star also felt author main character stupid uncharacteristic thing sake plot detract believability krimie set last day occupation spring terrible time terrible place sure handle dexterity terrible time death throe regime terrible place come army occupation hill addition everyone assume grip loosen midst inferno police officer homicide detective assign apprehend serial widow junior get job speaks german german attach feared never think beasts find helpful let others think german underestimate misjudge lot get tourist map follow fro run nearly page confess skip yet scene chaos confusion seem move story human dimension far greater interest reluctant colleague aware day war together come trust guardedly confide common fear hop paean czech nationalism reduce cardboard beast certainly include make sense story odd couple remind pair together police occupied time le apocalyptic short lesson history include observation create band together drive country then come back drove gypsy pour even then take drove then decay communist driven place go then drive country first time do peacefully wonder future bring next expel complaint translation often render refers german military vehicle jeep vehicle make closely guard refers nation people realm regime french speak way curse render ordinary use term impossible today imply entail empire however define hang adjective german functionary do american jeep make something comparable writer error nonetheless correct fine error distract attention guess publisher longer employ thing prefer computer power brain power say love stop ask waste time type thank much do however want true page turner real event history end prague certainly best long time write detective story set be snow effect informer victim open secret police file executioner list even smidgen humor bad notably droll sophisticated funny bone homicide cop tend grow humor defense thick hide man inhumanity man classic case sometimes observer nazi occupier example classic draw wickedly funny caricature thugs none grim get perhaps escape much physical destruction occupy capital use show architecture soul burn deranged sociopath begin coolly carve widow weld poultry knife waning day translate brutal german occupation insanity religious basis expose confessional hidden cowardly misguide priest perfect craft police realize face extremely devious efficient serial young inspector partner senior police officer secret personal agenda superior anticipate chaos converge even deeper secret agenda pair organization get better better slaughter police minder find dead set detective set trap set war force collision personal level fate future nation collapse chaos everything literally come flame only young detective still stand indeed rise top new police force tell last line idea rush headlong worst mistake mystery entertainment parable blur genre line historical fiction literary mystery quite pleasurable richly described set revolves quite interesting murder case manage together character opposite side make surprisingly sympathetic work together string ghastly murder tension murder mount tragic event many miss make hard put well entertain find somewhat educational well know many generality history really open lot detail translate fast pace use language flow naturally keep completely engrossed story really felt flawless translation thoroughly enjoyable buy sale great investment good story ramble quite bite last page considerably lose anything end excellent cry sequel seem unlikely year fare literary psychological possibility generate detective story set last month rump state create dismemberment promising fulfill promise major problem work cliched nature character implausibility much dialogue sort occur many conversation character review life relationship include self nation culture way reflect realistic dialogue subject matter dialogue interior monologue root real translation solid hold responsible shortcoming style expression find say go plate clear read work superior talent narrator stylist display however partial thriller police procedural go ahead expect characterization accompany philosophize rise conventional story line investigation deprave serial mutilates woman ritual fashion accelerate pace crime story progress investigation merges political military event fall psychoanalytic point view reader learn rather soon make murderer driven abject condition total emotional dependency approval dead formerly domineer conversation well render capture close agitate mental world dwell fall near transfer brutal energy new target mind becomes avenge angel encounter begin national savior new man leader special mission object remain proud equation unregenerate brutal enforcer regime evident allegorical role policeman especially important unraveling crime pursuit madman become rather obvious allegorical symbolic agent recent political life messy morality learn nothing personal civil servant highly professional policeman also emerge leader movement restore democracy country represent virtue assistant young somewhat nave come capital city adapts rapidly new way life show instinctive investigator ability introduce order show admirable quality root tradition rural childhood heartbreakingly innocent victim end transform typical good man postwar era make bad choice live regret third policeman german man conceal background responsibilities conventional investigator emphasize political secret police operative position stand potentially good german come sens death spasm german lover promiscuous dancer professional mistress always allure confess human failing attempt redeem service go parallel set rumination try curb antipathy recognize common humanity people deliberation strike transparent somewhat awkward represent believe retrospective contemplation feeling time story psychologically plausible instructive render indirectly le clumsily thriller element story become obvious middle girlfriend taint counterpart solve case also personal collision course murderer place author converge pathway lead inevitably gruesome conclusion surprised identity last sacrificial lamb character render ultimate justice detail historical situation introduce final page role doom renegade army evict city rather casual chaotic liberation arrival fiery decisive communist leader name definite plan constitution political complexion future czechoslovakian state military hero later become name choose symbolism name directly translatable freedom energy persuasive talent apparent rectitude previous suffer behalf cause convince commit emerge regime believe path society final sentence state decision biggest mistake life judgment come end sentimental message decease message mingles patriotic political musing akin slogans deflating last sentence appear sort oblique author sudden eager commitment cause reflect early ideological career acknowledgment guilt author confession penance folly youth folly always implicit assumption harsh pure belief punish effect live others come", "genres": ["Fiction & Literature", "Mystery & Suspense", "WWII"], "summary": "Set in the German-occupied city of Prague during the twilight of World War II, The Widow Killer is an extraordinary achievement by a literary artist of the first rank. \r\n\r\nThe novel opens jarringly with the gruesome murder of the baroness of Pomerania, the widow of a German Wehrmacht general, by a perverted serial killer. The coroner's report determines that the victim did not resist and was not raped. Mysteriously, her heart was removed and vanished with the killer.\r\n\r\nSo begins this savage morality tale in which good and evil collide against a backdrop of political turmoil. The unlikely pair of Jan Morava, a rookie Czech detective, and Erwin Buback, a Gestapo agent who is questioning his loyalty to the Nazis, set out to track down the sadistic killer before he can strike again. But as Morava and Buback follow the killer's bloody trail through Prague, it becomes clear that he is not a political radical or a wartime dissident but a tormented psychopath. In the downward spiral of the Third Reich's final days, both officers must tirelessly search for a sinister murderer while grappling with their own emotional demons.\r\n\r\nAs the war proceeds to its gruesome end, the narrative sinuously shifts perspectives, taking us deep into the emotional maelstrom of each of the characters: young Morava, struggling to find love and approval in a war-torn city; the disillusioned Buback, haunted by the ghosts of his beloved wife and daughter; and the tormented killer, sent on a bloody rampage to please \"her whom be obeys.\"\r\n\r\nWeaving a delicate tale of human struggle under a thrilling murder, Pavel Kohout has created a memorable work of fiction that will rank as one the last important novels from one the war's direct eyewitnesses.", "asin": "0312193637", "rank": "2303496", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/519PV54ND3L.jpg", "country": "Czechia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}