{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": -37.8142176, "ratings": {"num_ratings": 82, "rating": 4.0, "reviews": [{"review_sentiment": 1.0, "review_text": "Loved Broken Shore... so thought I'd try this. Couldn't get through it. Hard for me to follow and stay interested. I might try again just because I liked his other book so much."}, {"review_sentiment": 4.0, "review_text": "loved the book , would recommend it to anyone wanting a complex very well written crime novel"}, {"review_sentiment": 4.0, "review_text": "I did not find this as good as his previous one."}, {"review_sentiment": 4.0, "review_text": "It ia a pleasure to read the development of these complex characters. Identity of the murderer telegraphed early but plenty of other surprises. Great fun to read."}, {"review_sentiment": 4.0, "review_text": "Took awhile to read"}, {"review_sentiment": 4.0, "review_text": "Complex sometimes very difficult to understand their slang but very very good police procedural"}, {"review_sentiment": 5.0, "review_text": "Found Temple reading another NY Times review. Enjoyed the book, ordered another. Interesting trying to figure out terminology differences"}, {"review_sentiment": 5.0, "review_text": "Love Peter Temple books"}, {"review_sentiment": 5.0, "review_text": "Powerful gritty and unpredictable a great sequel to Broken Shore Characters come to life across all dimensions and its terrific to read in Australian context"}, {"review_sentiment": 5.0, "review_text": "Not easy to read these books on Kindle, because there are so many regional expressions to look up.  They're worth buying the hard copy!"}]}, "authors": ["Peter Temple"], "isbn": "0312572905", "longitude": 144.9631608, "periods": ["2000s", "Recent Releases"], "title": "Truth: A Novel", "word_cloud": "love think stay interested like much love anyone want complex well write crime find good previous one ia pleasure development complex character murderer telegraph early plenty surprise fun awhile complex sometimes difficult understand slang good police procedural read review order try figure terminology difference gritty unpredictable great sequel come life dimension terrific australian context not easy many regional expression look worth buy hard copy", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Inspector Stephen Villani, head of homicide in Melbourne, Australia, has a full agenda: a murdered woman in a penthouse apartment, three men butchered in a sadistic rampage, a tattoofaced drug dealer corrupting his rebellious daughter, a crumbling marriage. As these seemingly unrelated events begin to unfold, Villani finds himself immersed in an unfamiliar world of political scandal and ethical ambiguity. He must navigate the inept bureaucracy that is the police department, all the while maintaining a solid front and trying to keep the press, his family, and his own past from breaking him completely. With each twist and every turn of this taut crime novel, Villani is forced to question whom he can trust.\r\n\r\nWhile The Broken Shore captured the harshness and beauty of regional Australia, Truth captures the grim reality of the city and the people who struggle to hold on to any certainty that they can find. Tense and unrelenting, this unforgettable novel confronts the complexity of human relationships and the difficulty of escaping the past.\r\n\r\n“Having read the new novels of Michael Connelly and Martin Cruz Smith, I have to say that Temple belongs in their company.” The Washington Post", "asin": "B003KVKQ9G", "rank": "366540", "city": "Melbourne", "image": "https://images-na.ssl-images-amazon.com/images/I/414GWWWZhdL.jpg", "country": "Australia", "story_arc": ["Tragedy", "Things only get worse"]}