{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.5202471, "ratings": {"num_ratings": 428, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Archie Sheridan & Gretchen Lowell are by far my most favourite serial killer, Detective duo and since reading all of the books in this series I have never found any that shine so bright. I was so excited when a book flashed up from Chelsea Cain for pre order that I felt like a kid at Christmas but I so was disappointed it wasn't the continuation of their story but a whole other series.I am pleading with Chelsea Cain to bring Archie and Gretchen back into our lives and hearts asap! Please :-)As serial killers go, Gretchen is just brilliant and I cant help but admire some of her torture methods and even though I raced through all these books a few years ago now I still can see in my minds eye the trials and tribulations these two pull as through and they are just as sharp now as they were when I first read them. I own them on in book form as well as kindle versions and they will never be deleted from the kindle as they are books I can read and re read without every loosing the magic.So Please Please Please Chelsea Cain - Bring back Archie and Gretchen.One Kick: A Kick Lannigan Novel was good but not a patch on your previous books. I have had long and in depth discussions with my friends regarding this and our local Book Club so Im by far not alone in this wish!"}, {"review_sentiment": 5.0, "review_text": "The Archie Sheridan/ Gretchen Lowell series is by far one of the best series I have read.  The first time I read the series, I couldn't put the book down, and the second time was just as attention capturing."}, {"review_sentiment": 5.0, "review_text": "I found this book at the library and thought I would give it a go. The story with Archie and Gretchen is interesting I would recommend these books since I moved onto book 2 as soon as I finished with this one."}, {"review_sentiment": 5.0, "review_text": "This is the first book of Chelsea Cain that I have read and I loved itDetective Archie Sheridan had spent years hunting down the serial killer known as the Beauty Queen Killer aka Gretchen Lowell.  Archie then went into a medical retirement once she was caught.A new serial killer is stalking Portland and may be similar to Gretchen so Archie comes out of retirement to help catch the killer l, on the condition that Susan Ward, a journalist, can write about things past and present.  This killer is similar to the Beauty Queen killer and has parents scared for their teenage daughter lives. With not a lot to go on and the clock ticking before the next victim shows up Archie tries to figure out who it is.Gretchen Lowell is one deranged killer.  She enjoys torturing victims, making them suffer emmense pain before finally killing them.  Gretchen last victim was Archie Sheridan...she tortured him bad and killed him and brought him back to life just because she could. As she stated she wanted to ruin him so no one else could have him but her--pretty messed up. Gretchen is also beautiful and smart-she knows how to manipulate people and can read them and their secrets.  Basically scary..more so than Hannibal Lector.Archie is a messed up cop.  He ended up being kidnapped by Gretchen and held captive for days while she did torturous things to his body. Throughout the book, you read flashbacks as to.what happened during the time they were together.  Normally I don't care for reading flashbacks but, in this story I was wanting more of them as I read them. Archie is under Gretchen spell or control for a lack of better word.  He goes to visit her every Sunday in prison. His 'relatiomship' with her has caused problems in his marriage in that he divorces his wife..though they still care about each other.Susan Ward is a late 20's journalist who has a lot of growing up to do in my opinion. The book starts out with her chasing a story trying to g wet someone to talk to her about some incident that happened about 10 years prior. Susan has pink hair and her clothes have a theme..one outfit she wore she called her tv cop outfit--all I could think is grow up Susan you are not in high school anymore. She is sleepimg with her married boss and doesn't seem to mind. She uses sex thinking she has the upper hand with men by doing this.  As the story develops why who she is starts to become more clear.The characters are great and well developed and the plot was awesome. This is not your typical serial killer book.  Be prepared to read some graphic torture scenes as they go into detail. So if you are squirmish about things like this then you may want to skip this book.  There are also some sex scenes and foul language.I really enjoyed this book and glad I came across this author.  I already have the next book in this series on hold at the library for me.  I can't wait to.read what happens next for our characters."}, {"review_sentiment": 1.0, "review_text": "See headline. Avoid at all costs; it's really bad and clumsy throughout. I read this after sampling Cain's ONE KICK, which is FAR better."}, {"review_sentiment": 5.0, "review_text": "Loved from Beginning to end. Chases Cain once again grabs your attention from first sentence and never lets go ."}, {"review_sentiment": 5.0, "review_text": "Chelsea's novels always take me on a fast ride to a surprising conclusion about the human heart."}, {"review_sentiment": 4.0, "review_text": "Archie Sheridan is a police detective, and he is a broken man.  He spent 10 years hunting a serial killer only to be caught by her and tortured almost to death.  He has recovered to some degree, but is addicted to Vicodin and his wife has left him.  He's tapped to head a new task force to catch a new killer, one who is preying on young girls.  3 bodies have been found so far, and the killer has just abducted girl number 4.Archie has a bizarre connection (that borders on obsession) with Gretchen, the serial killer who caught him.  After bringing him to the brink of death she called 911 and performed CPR on him until the police and paramedics arrived.  She was convicted and is in prison, where he visits her weekly—this is the deal she worked out: she will continue to give information on where she's hidden bodies of people that she's killed so long as Archie keeps visiting her.  The book alternates between present time and the current crime, and Archie's ordeal with Gretchen.  This relationship with his captor is creepy and weird, and is a unique hook that sets this book apart.  In addition, Gretchen is able to aid him in his current investigation...in order to find the new killer he has to continue to visit her and it seems he will never be free.This book was compelling with a unique premise and lots of twists—very exciting and hard to put down.  I just found out it's book one of a series, so I'm thrilled and I'm ordering all the other books!"}, {"review_sentiment": 3.0, "review_text": "Where to begin...What really bothers me about this is that this is supposed to be a book about a big bad serial killer. Right? And yet, Gretchen Lowell, the serial killer doesn't even appear in the first 200 pages. Seriously? Oh wait, there were 3 or 4 chapters that she was in but all of those took place in the past. I had to wait 200 pages to finally see her in the PRESENT time. And on top of that she was in prison for the entire book. Bad move. Did not like any of that. That's bad writing in IMO.Now, on to how boring a lot of this was. The first chapter was great and really hooked you. And then so typically, that great feeling you had in the first chapter completely went away and you basically don't get it back for the rest of the book. Such a cheap way to get you hooked. Opening chapter: Exciting. Rest of the book: Boring. This was such slow, dull, detective work about girls gone missing. Argh, really? Why is that original or even remotely exciting? And I had to endure that for a good portion of the book.Another thing was the structure. So, one thing that also hurt this book was how the direction of the story never changed. Which made it more boring and harder to get through. The direction of the story is supposed to change at certain points and it never did. It was just, girls missing, let's find out who did it. Now, I'll admit that it had its moments. Like when Gretchen finally appeared and Archie and Susan went to go see her. And then later on at the end when Archie went to see her one last time. Interesting moments. I liked those but where was the rest of this excitement in the rest of the book?Overall, I did like her writing style, I think she did a good job writing, describing, and developing characters. But the book overall was not great. If I decide to read the next one, it will only be that one and that will be it. If the second one is going to have the same slow, dull detective work because someone went missing and the Gretchen is still a no show, then forget it. If you're writing a book about a serial killer.... Your serial killer needs to be in it and not just sitting in prison the whole time most of which we don't see. Oh, and this book is advertised as saying Archie goes to visit her every week which sounds intriguing, and yet, we don't even see him do it until toward the end, we only heard he was doing it. Another sort of let down and misdirection of the story.This is really more of a 2.5 maybe. Definitely not to go to author for serial killers."}, {"review_sentiment": 5.0, "review_text": "The living dead.  That phrase describes Archie Sheridan perfectly. Tortured beyond most people’s  wildest imaginings, he is so changed that his ex-wife believes that the ‘old’ Archie is gone. And his torture hasn’t ended. He continues to have a “Heart Sick” relationship with his torturer, Gretchen Lowell.Every Sunday without fail, Archie visits Gretchen in prison, where the beautiful serial killer sometimes lets him know the identity and location of some of her myriad victims.  Hooked on pain killers and obsessed with his torturer, Archie is a damaged individual.  Exactly the sort to be drafted into working the “After School Strangler” case.Journalist Susan Ward is given the daunting task of doing a series of articles on Archie. The only one to have been taken by the Beauty Killer and lived to tell the tale.... only thing is, he won’t.  Sensing a career making opportunity, she follows him around, observing and becoming privy to the latest serial killer investigation. Sue has baggage of her own and she carries it hidden under her pink hair most days. Bravado and sarcasm are her stock in trade. When the “After School Strangler” targets students from her old high school, her past makes a rude re-entry into her present.Profoundly disturbing on both physical and emotional levels, “Heart Sick” is not for the squeamish. The book initially reminded me of the Hannibal Lecter books by Thomas Harris. The comparison was short lived however, as this powerful debut novel took the suspense up notch after notch. Using the flashback technique, Chelsea Cain skillfully meshes two disparate narratives and makes the whole seem to flow flawlessly.Archie Sheridan and his psychopath Gretchen Lowell will remain in my memory. They both have enough unresolved issues to fill a sequel or two. Watch for the next Chelsea Cain novel and the sequel to “Heart Sick”."}]}, "authors": ["Chelsea Cain"], "isbn": "0312947151", "longitude": -122.6741949, "periods": ["2000s", "Recent Releases"], "title": "Heartsick", "word_cloud": "far favorite serial killer duo read series never find shine bright excite flashed order felt kid disappoint continuation story whole plead bring back live heart asap serial killer go brilliant cant help torture method even race year still mind eye trial tribulation pull sharp first form well kindle version never delete kindle loosing back good patch previous long depth discussion friend regard local far alone wish series far best series first time series second time attention capture find library thought story interest move soon finish first love it detective spend year hunt serial killer know aka go medical retirement new serial killer stalk similar come retirement help killer l condition journalist write thing past present killer similar killer parent scar teenage daughter live lot go clock tick next victim show try figure derange killer enjoy torture victim make suffer immense pain finally kill last victim torture bad kill brought life state want ruin else mess also beautiful know manipulate people secret mess cop end kidnap hold captive day torturous thing body flashback happen time together normally care read flashback story want archie spell control lack better word go visit prison caused problem marriage divorce still late journalist lot grow opinion start chase story try g someone talk incident happen year prior pink hair clothes outfit wore call tv cop outfit high school sleep married bos seem use sex think upper hand men story develop start become character great well developed plot typical serial killer prepare graphic torture scene go detail so skirmish thing skip also sex scene foul really enjoy glad come author already next series hold library happens character headline cost really bad clumsy sample better love begin end grab attention first sentence never let novel always take fast ride surprising conclusion human heart police detective broken man spend year hunt serial killer caught torture almost death recover degree addict wife leave tap new task force catch new killer preying young girl body find far killer abducted girl number bizarre connection border obsession serial killer caught bring brink death call perform police paramedic arrive convict prison visit deal work continue give information hidden body people kill long keep visit alternate present time current crime ordeal relationship captor creepy weird unique hook set apart addition able aid current investigation order find new killer continue visit seem never compelling unique premise lot excite hard put find series thrill order really bother suppose big bad serial killer yet serial killer even appear first page seriously wait chapter take place past wait page finally present time top prison entire move bad write boring lot first chapter great really hooked typically great feel first chapter completely go away basically back rest such cheap way hooked chapter slow dull detective work girl go miss really original even remotely exciting endure good portion thing structure thing also hurt direction story never change make bore harder direction story suppose change certain point never girls miss now admit moment finally appear go see later go last time interesting moment like rest excitement rest overall like write style think good job write describe develop character overall great decide next second go slow dull detective work someone go miss still show write serial serial killer need sit prison whole time advertise say go visit week sound intriguing yet even heard sort let misdirection really maybe definitely go author serial killer living dead phrase describe perfectly torture people wildest imaginings change believe old go torture end continue relationship torturer fail visit prison beautiful serial killer sometimes let know identity location myriad victim hook pain killer obsess torturer damage individual sort draft working give daunt task series article take live tale thing sense career make opportunity follow observe become privy latest serial killer investigation baggage carry hidden hair day sarcasm stock trade target student old high school make rude disturb physical emotional level squeamish initially remind comparison short live however powerful debut take suspense notch notch flashback technique skillfully mesh disparate narrative make whole seem flow psychopath remain memory enough unresolved issue fill sequel next sequel", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 1/6 in the Archie Sheridan & Gretchen Lowell Series\r\n\r\nPortland detective Archie Sheridan spent years tracking Gretchen Lowell, a beautiful and brutal serial killer. In the end, she was the one who caught him…and tortured him…and then let him go. Why did Gretchen spare Archie's life and then turn herself in? This is the question that keeps him up all night―and the reason why he has visited Gretchen in prison every week since.\r\n\r\nMeanwhile, another series of murders is tearing up the Portland streets. Archie seems to be getting closer to solving this high-profile case…until he finds himself in a fatal collision course with the killer―one that inevitably leads him back to his former captor. Gretchen may be the only one who can help do justice. The only thing she can't do, this time, is save Archie's life.", "asin": "0312947151", "rank": "172181", "city": "Portland", "image": "https://images-na.ssl-images-amazon.com/images/I/512i5mmUp2L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}