{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 99, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "This book was recommended to me by an avid reader, who has recommended books before that were great. This book was disappointing. I found it hard to connect with the characters, and the plot wasn't all that interesting to me. I will say the scerey and gloomy atmosphere was well achieved and the writing it self was pretty good."}, {"review_sentiment": 4.0, "review_text": "the story is interesting,  the atmosphere is melancholic, the people are \"real\" , well developed personalities,  some dry humour gives additional flavour, alltogether a very good story and  good literrature."}, {"review_sentiment": 5.0, "review_text": "Just get this Audio! You won't be disappointed!"}, {"review_sentiment": 3.0, "review_text": "I cannot recall ever ordering the book;  nor can I find it anywhere"}, {"review_sentiment": 3.0, "review_text": "I'm really enjoying the Quirke novels. John Banville (Benjamin Black) is an incredible author. His mystery novels are quite different from the normal fast-paced, always-catch-the-bad-guy formula of other detective novels. They are atmospheric, dark and Quirke does not always win."}, {"review_sentiment": 3.0, "review_text": "It was fairly good...just not my cup of tea."}, {"review_sentiment": 5.0, "review_text": "Mr. Black has a great writing style and knack for spinning a complex tale. Makes you feel you know the characters intimately."}, {"review_sentiment": 2.0, "review_text": "The fly leaf of the book details that our lead character, Quirke, \"encounters complicated and ugly truths about family savagery, Catholic ruthlessness, and race hatred.  I agree except that the encounters are minimal and very superficial occurring for the most part in the last sixty pages of the book.  Too little, too late to give the book much impact.In the two earlier novels, I have enjoyed the Quirke character and the Dublin setting in the 1950's which prompted me to read this third edition in the series.  Although Black's prose is good, it is not as good as in the two previous novels.  Nothing is very engaging in this book.  Perhaps the author was not committed to writing this book because too much depth and scope were missing in every element in the book.I can only hope the missing elements and commitment to writing will reappear in the fourth edition of the series which is in my to read stack.  Let's hope!"}, {"review_sentiment": 5.0, "review_text": "I have been reading the detective/pathologist genre for decades and this is my now my favorite series. All-time favorite.  I love (not a term I throw about lightly) Black's prose. I can't remember the last time that I felt the need to read aloud passages from a novel to those around me.  Decades, certainly.  Several times in each of these books passages have been so LOL funny or just so beautifully stated that sharing was necessary and appreciated by those regaled.  Plots meander a bit but only as much as necessary for character development - they are a big part of the books' charm.  Even secondary players are so brilliantly drawn that they stand off the page, resplendent in all their flawed humanity. Early 50's Dublin is portrayed so vividly that I am transported as surely as if watching a Downton Abbey episode.  My two, admittedly petty, issues are these: I don't know how to pronounce Quirke's name,  a condition that made every reference to him jarring for my American brain until I decided upon 'Kirk' for simplicity.  The other issue is that I'm sorry that I didn't find out about Black/Banville sooner.  I can't imagine why I've not stumbled across this award-winning author before this late date."}, {"review_sentiment": 5.0, "review_text": "All of the series are great reads."}]}, "authors": ["Benjamin Black"], "isbn": "0312680732", "longitude": -6.2602732, "periods": ["1900s", "Recent Releases"], "title": "Elegy for April: A Novel (Quirke)", "word_cloud": "recommend avid recommend great disappointing find hard connect character plot interest say scenery gloomy atmosphere well achieve write pretty good story interest atmosphere melancholic people real well developed personality dry humor give additional flavor altogether good story good literature just recall ever order find anywhere really enjoy novel incredible author mystery novel quite different normal formula detective novel atmospheric dark always win fairly good cup tea great write style knack spin complex tale feel know character intimately fly leaf detail lead character encounter complicate ugly truth family savagery ruthlessness race hatred agree encounter minimal superficial occur part last sixty page little late give much earlier novel enjoy character setting prompt third edition series prose good good previous novel nothing engage perhaps author commit write much depth scope miss element hope miss element commitment write reappear fourth edition series stack hope read genre decade favorite series favorite love term throw lightly prose last time felt need aloud passage certainly time passage funny beautifully state share necessary appreciate regaled meander bit much necessary character development big part charm even secondary player brilliantly draw stand page resplendent flaw humanity portray vividly transport surely watch admittedly petty issue know pronounce name condition make reference jar american brain decide simplicity issue sorry find sooner stumble author late date series great read", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Quirke—the hard-drinking, insatiably curious Dublin pathologist—is back, and he's determined to find his daughter's best friend, a well-connected young doctor\r\n\r\nApril Latimer has vanished. A junior doctor at a local hospital, she is something of a scandal in the conservative and highly patriarchal society of 1950s Dublin. Though her family is one of the most respected in the city, she is known for being independent-minded; her taste in men, for instance, is decidedly unconventional.\r\n\r\nNow April has disappeared, and her friend Phoebe Griffin suspects the worst. Frantic, Phoebe seeks out Quirke, her brilliant but erratic father, and asks him for help. Sober again after intensive treatment for alcoholism, Quirke enlists his old sparring partner, Detective Inspector Hackett, in the search for the missing young woman. In their separate ways the two men follow April's trail through some of the darker byways of the city to uncover crucial information on her whereabouts. And as Quirke becomes deeply involved in April's murky story, he encounters complicated and ugly truths about family savagery, Catholic ruthlessness, and race hatred.\r\n\r\nBoth an absorbing crime novel and a brilliant portrait of the difficult and relentless love between a father and his daughter, this is Benjamin Black at his sparkling best.", "asin": "0312680732", "rank": "628974", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/41mdY2EIsSL.jpg", "country": "Ireland", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}