{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 31, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "I enjoyed Professor Hynes lectures from the great courses. And I enjoyed his novel. May try his others.The books late turn to horror caught me off guard admittedly."}, {"review_sentiment": 5.0, "review_text": "Brilliant read.  James Hynes takes the reader on an adventure that is equal parts suspense and laugh out loud funny.  He's a virtuoso with words and any aspiring writer would do well to read and learn from Hynes' technique."}, {"review_sentiment": 4.0, "review_text": "++++SPOILER ALERT++++If you do not want to have any part of the plot or fun of this story ruined do not read any further.This is only the second book that I've read by this author (previously read Lecturer's Tale). While I did enjoy it, it was a fun read with some pretty good dialogue and I enjoyed the characters for the most part, I was not totally wowed at the story. In fact it was of course totally implausible--which I can understand is why many really enjoyed it. No problem.But one thing not really mentioned in any of the previous reviews here or elsewhere in newspaper or magazine book reviews was that it seemed pretty obvious to me (of course I could be completely wrong) that the entire story was a figment of Paul's mind. Most likely he dreamed it one day during his breaks in the bathroom. He takes books in there to read (he'd just read Island of Dr Moreau--and the characters in this story, curiously, repeat dialogue from that book...coincidence?). I think the main character has a great imagination and is a writer, but he is totally stagnating in his going nowhere job. So...I think his imagination begins to go wild...eg. the cat, the post it notes, his noticing ceiling tiles moved...or were they? Then he falls asleep in the toilet and dreams the entire thing.I'm still thinking about this story (even reread \"Moreau\") so if anyone wants to point out the flaws in my thesis, I would not be insulted to hear them."}, {"review_sentiment": 5.0, "review_text": "Brilliant. Funny. Creepy."}, {"review_sentiment": 5.0, "review_text": "This is a really good series.I'm glad I discovered it. Great stories, characters and I really like the descriptions of Long Beach and surrounding areas."}, {"review_sentiment": 5.0, "review_text": "I wasn't sure that I would be staying with this book to the end, because reading about a continuously washy-washy loser can get old in a hurry. Haynes kept me reading, though, with his juxtaposition of an increasing level of grade B horror movie story with a droll use of dead-pan banalities.The author has a vivid descriptive style and a flair for dialog that make for a hilarious read. It is like spending time with someone who is intelligent, educated, and funny as Hell. I will be reading more by this author."}, {"review_sentiment": 5.0, "review_text": "This is a very well written, fun, sort of science fiction book that is now on my list of favorite books.  Hynes can write.  And make you laugh.  A must read if you work in a cubicle."}, {"review_sentiment": 3.0, "review_text": "I bought this book because of an earlier reviewer's dismay at its \"ritual cannibalistic content\".While the novel is not nearly as lurid as I'd hoped, it's still a pretty decent read. Cynical, absurd; darkly humorous, though not really laugh-out-loud funny. The characters are believable. (No, not necessarily likeable.) Perhaps it drags--but so would, I imagine, a miserably hot Texas summer during which your entire life collapses in a pile around your ankles.I finished it and traded it for another book, but somehow it's back on my mind. Maybe I should have kept it around."}, {"review_sentiment": 5.0, "review_text": "I don't even remember how I stumbled upon this book, but I'm glad I did. The writer has done an excellent job (I just purchased another of his books) and the story is very interesting. It's humor, it's suspenseful in places and a twist of horror as well. I just couldn't put it down for the last few chapters, despite having other things to do.There is depth to what is written, but it's an easy read at the same time. I was drawn in and interested in the characters more than any book in a while.Interesting ways of incorporating others' literature into the story."}, {"review_sentiment": 5.0, "review_text": "I debated giving Kings of Infinite Space four stars instead of five, but good will won out (thanks to a laugh-out-loud rant on Texans' love for the SUVs and pickups) and I rounded the grade up a bit.James Hynes' recipe for this book could have spelled disaster. Mixing a sharp-tongued satire of cubicle life with a macabre story of odd goings-on under the Texas Department of General Services building (and above its ceiling tiles) and a love story sounds like a literary mess in the making. But in Hynes' hands it works.This is the second book by Hynes that I've read. The first was Next which I found an absolutely astonishing meditation on post-9/11 life as seen through the eyes of a character who is seeking a new job to escape his going-nowhere job and relationship. In Kings of Infinite Space the main character has already hit rock bottom, losing his job in academia, his wife, and his mistress. The only thing he has gained is the ghost of a cat that he drowned for revealing his infidelities. In other words, self-absorbed and self-pitying Paul Trilby isn't exactly sympathetic. But Hynes has a way of making us cheer for him as he negotiates an office romance that just might redeem him and discovers the supernatural source of odd events at the office where he temps.Since I seem to be reading Hynes' works in reverse order, it may not be fair for me to compare this book with a book that came later; but in my view Next was a better novel because it's humor was subtle as opposed to Kings of Infinite Space where the humor was smack-you-upside-the-head funny. Likewise the main character in Next seems a more complex and fully realized character than Paul Trilby. Still, Kings of Infinite Space is the type of book that makes an indelible mark in the career of a rising literary star."}]}, "authors": ["James Hynes"], "isbn": "0312319665", "longitude": -97.7436995, "periods": ["2000s"], "title": "Kings of Infinite Space", "word_cloud": "enjoy lecture great course enjoy late turn horror catch guard admittedly take adventure equal part suspense loud funny virtuoso word aspire writer well technique want part plot fun story ruin second author previously enjoy fun pretty good dialogue enjoy character part totally wow story fact course totally implausible understand many really enjoyed one thing really mention previous review elsewhere newspaper magazine review seem pretty obvious course completely wrong entire story figment mind likely dream day break bathroom take character story curiously repeat dialogue coincidence think main character great imagination writer totally stagnate go nowhere job think imagination begin go wild eh cat post note notice ceiling tile move then fall asleep toilet dream entire still think story even reread anyone want point flaw thesis insult really good glad discover story character really description surround area sure stay read continuously loser old hurry keep read juxtaposition increase level grade horror movie story droll use author vivid descriptive style flair dialog make hilarious spending time someone intelligent educate funny read author well write fun sort science fiction list favorite write laugh cubicle buy earlier reviewer dismay ritual cannibalistic content nearly lurid hop still pretty decent absurd darkly humorous really character believable necessarily likable perhaps drag miserably hot summer entire life collapse pile finish trade somehow back keep even remember stumble glad writer do excellent job purchase story interest humor suspenseful place twist horror well last chapter thing depth write easy time draw interested character way incorporate others literature story debate give star instead good thanks rant love pickup round grade recipe disaster satire cubicle life story building ceiling tile love story sound literary mess making hand second first find absolutely astonish meditation life see eye character seek new job escape job relationship main character already hit rock bottom lose job academia wife mistress thing gain ghost cat drown reveal infidelity word exactly sympathetic way make negotiates office romance discovers supernatural source odd event office seem read work reverse order compare come later view better humor subtle oppose humor funny main character seem complex fully realize character still type make indelible mark career rise literary star", "genres": ["Fiction & Literature", "Satire"], "summary": "Paul Trilby is having a bad day. If he were to be honest with himself, Paul Trilby would have to admit that he's having a bad life. His wife left him. Three subsequent girlfriends left him. He's fallen from a top-notch university teaching job, to a textbook publisher, to, eventually, working as a temp writer for the General Services department of the Texas Department of General Services. And even here, in this world of carpeted partitions and cheap lighting fixtures, Paul cannot escape the curse his life has become. For it is not until he begins reach out to the office's foul-mouthed mail girl that he begins to notice things are truly wrong. There are sounds coming from the air conditioning vents, bulges in the ceiling, a disappearing body. There are the strange men lurking about town, wearing thick glasses and pocket protectors.\r\n\r\nThe Kings of Infinite Space is a hilarious and macabre spoof on our everyday lives, and gives true voice to the old adage, \"Work is Hell.\"", "asin": "0312319665", "rank": "2270752", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51ICX3QgDxL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}