{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 40.8359336, "ratings": {"num_ratings": 27, "rating": 3.5, "reviews": [{"review_sentiment": 4.0, "review_text": "A fascinating and beautifully written historical novel and a great read, especially after my recent visit to Naples. The characters and settings are fully fleshed out. Sontag explores the roles played by William Hamilton, English ambassador to the court at Naples and scientific hobbyist (the volcano lover of the title), Admiral Horatio Nelson, and Lady Emma Hamilton, Nelson's lover, in the court's merciless crackdown on early Italian republicans, whose cause went down with Napoleon's defeat in Italy."}, {"review_sentiment": 1.0, "review_text": "Kitchen psychology, applied by completely unqualified person; endless pretentious drivel; vomit-inducing lefty propaganda (especially in the scenes of \"Naples revolution\"), altogether waste of my time."}, {"review_sentiment": 2.0, "review_text": "Stylistically odd, with a confused timeline, jumping into the present with comments, not using the characters actual names although all are well known in history."}, {"review_sentiment": 4.0, "review_text": "Great prose, split infinities along the way, and more than a passing nod to the Vivian Leigh / Laurence Olivier film, \"That Hamilton Woman.\" her essays are the best to read. Her novels are really essays, that fog over her clearer statements in her non-fiction prose.Note the similarity in tone and style to Simone Weil. Sontag derives her passion from Weil in every way that is possible."}, {"review_sentiment": 3.0, "review_text": "Starts off well, then goes a bit off track at the end"}, {"review_sentiment": 5.0, "review_text": "Loved this book."}, {"review_sentiment": 5.0, "review_text": "I read this book years ago and now plan to re-read it for a book-discussion club event. Also, I plan to accompany my talk with a film collage from a number of old movies."}, {"review_sentiment": 3.0, "review_text": "I found it boring, and repeatative,  Should have ended much sooner,"}, {"review_sentiment": 2.0, "review_text": "Susan Sontag's novels are singularly bad. Her first, THE BENEFACTOR, is the worst of the lot, but all of her fiction is unreadable to one degree or another.Like Virginia Woof, another novelist manque, she also wrote essays and criticism, but unlike Woolf, she really didn't excel in these areas of literature either.Her major problem, it seems to me, was her excessive devotion to some very dubious modernist figures and the climate of opinion they created.Roland Barthes referred to her as \"toujours fidele\", but her admiration of his work only shows how easily she was dazzled by what amounts to a load of nonsense. Barthes famously declared \"the death of the author\" and to prove his thesis wrote a full-length study of a Balzac short story (S/Z) that sheds no light whatsoever on either Balzac or anything approaching meaningful intellectual discourse. His voluminous oeuvre is destined, I believe and hope, for history's trashcan as were the once-famous works of Comte, another French fakir of a faker.Similarly, Sontag worshipped at the thrones of Adorno and Walter Benjamin.  She said of the former that his two volumes of supposedly  literary criticism were like \"an education\", but not only does he write in an incomprehensible jargon, when you whittle down the monster growth he allowed to be published, you find another half-baked Marxist who thinks humans are deformed by economic and social reality, the most tiresome leftover of \"intellectual life\" of the 1930s.More can be said for Walter Benjamin, but to call him a major critic is beyond reasonable judgment.  At least he can be read with some pleasure and insight.The strong feeling you get is that though she confessed to being an \"old style\" intellectual, and though she once said that KARAMAZOV was her favorite novel, she really didn't read and reread the literature of the past, because if she did, why didn't she write about it?Sontag was recently the subject of an HBO documentary in which her family, friends, and others simultaneously extol her and denigrate her.  According to witnesses who should know, she thought herself a failure, that she hadn't contributed amything to the body of deathless literature, that extinction without achievement frightened her more than anything.But why oh why wasn't she satisfied with what she accomplished?  She wasn't a major critic or novelist, but she did add something to the wisdom of experience that's still admired and her books are still read.  She lacked contentment because of her overweening pride is my conclusion."}, {"review_sentiment": 5.0, "review_text": "Fantastic!  Richly layered."}]}, "authors": ["Susan Sontag"], "isbn": "0312420072", "longitude": 14.2487826, "periods": ["1700s"], "title": "The Volcano Lover: A Romance", "word_cloud": "fascinating beautifully write historical great especially recent visit naples character setting fully flesh explore role play ambassador court scientific hobbyist lover title lover court merciless crackdown early italian cause go defeat psychology apply completely unqualified person endless pretentious drivel lefty propaganda especially scene revolution altogether waste time stylistically odd confuse timeline jump present comment use character actual name well know history prose split infinity way pass nod vivian film essay best novel really essay fog clearer statement similarity tone style derive passion way possible start well go track end love year ago plan club event also plan accompany talk film collage number old movie find bore repeatative end much sooner novel singularly bad first worst lot fiction unreadable degree novelist manque also write essay criticism really excel area literature major problem seem excessive devotion dubious modernist figure climate opinion refer toujours fiddle admiration work show easily dazzle amount load nonsense famously declare death author prove thesis write study short story shed light whatsoever either anything approach meaningful intellectual discourse voluminous oeuvre destine believe hope history trashcan work french fakir worship throne say former volume supposedly literary criticism education write incomprehensible jargon whittle monster growth allow publish find marxist think human deform economic social reality tiresome leftover intellectual life say major critic reasonable judgment least pleasure strong feeling confessed old style intellectual say favorite really reread literature write recently subject documentary family friends others simultaneously extol denigrate accord witness know thought failure contribute anything body deathless literature extinction achievement frighten satisfied accomplish major critic novelist something wisdom experience still admire still lack contentment overweening pride conclusion fantastic layer", "genres": ["Fiction & Literature", "Romance", "Historical Fiction"], "summary": "Set in 18th century Naples, based on the lives of Sir William Hamilton, his celebrated wife Emma, and Lord Nelson, and peopled with many of the great figures of the day, this unconventional, bestselling historical romance from the National Book Award-winning author of In America touches on themes of sex and revolution, the fate of nature, art and the collector's obsessions, and, above all, love.\r\n\r\n\r\n", "asin": "0312420072", "rank": "208129", "city": "Naples", "image": "https://images-na.ssl-images-amazon.com/images/I/41D4VqjFCyL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}