{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 89, "rating": 4.5, "reviews": [{"review_sentiment": 1.0, "review_text": "I’d like to reiterate what a previous review stated. This product is a fraud and all 5 star ratings are fake! I️  could not believe my eyes when I️ opened this terrible product! It looked like it was purchased at the dollar tree then shamefully resold on Amazon for $11.99!!!! Insane. I️ bought this product and even gave it a shot just to be sure it was what I️ suspected. I️ have had a mosquito problem inside. Left it in for 24 hours and not a single mosquito was killed. Not to mention it is this huge awkward LED light you have to screw into a light socket SOMEWHERE! The only place that would fit it was a lamp and it made the lamp light ugly purple. Definitely returned."}, {"review_sentiment": 1.0, "review_text": "Such nice reviews, but after 2 weeks I’m still being bitten and not a single dead mosquito can be seen in the zapper section. I bought this because I previously bought another brand that works great and has killed hundreds of mosquitos that I remove from time to time with the included brush. Unfortunately, its blue light is gradually losing strength. The Smarlance (What’s in a name?) is bright blue alright, but doesn’t work at all."}, {"review_sentiment": 1.0, "review_text": "BUYER BEWARE - SORT BY VERIFIED PURCHASES - THERE ARE ZERO - NONE - NOT A SINGLE PURCHASE HAS BEEN MADE FOR THE 103 5 STAR REVIEWS!! UNBELIEVABLE DECEPTION!!!"}, {"review_sentiment": 5.0, "review_text": "What an amazing classic!"}, {"review_sentiment": 5.0, "review_text": "This product is truly amazing, it works exactly. It is a Chemical free solution to a pesky mosquitoes problem. I really couldn't bear another summer haunted by mosquitoes. This little irritating creature were everywhere last summer. Therefore I bough a zapper to see if it will work. The mosquitoes are almost queuing up for a quick death. I can final enjoy a mosquitoes free room in summer. will recommend to all my family and friends! Love the product!"}, {"review_sentiment": 5.0, "review_text": "Light is super bright and bug zapper definitely works. I put it outside in my wall sconce."}, {"review_sentiment": 5.0, "review_text": "I couldn't be happier than I am with this product. I no longer have to fight with the bugs just to get in the house at night."}, {"review_sentiment": 5.0, "review_text": "This edition contains the trilogy of novels that comprise The Harp in the South, Missus, The Harp in the South and Poor Man's Orange.It was interesting to read the trilogy because you arrive at a better understanding of Hugh and Margaret Darcy. Missus tells of Hugh and Margaret, their early courtship and the history of each family, both Irish and Roman Catholic. The writing is on the wall regarding Hugh Darcy early on and his long suffering, although staunch and lovingly supportive wife Margaret.The Harp in the South is about their time as a family living at Number Twelve and a Half, Plymouth St Surry Hills. Life is a struggle, the houses are vermin ridden, dirty and the residents are poverty stricken but there are still acts of kindness amongst the squalor, pubs and dregs of society.In Poor Man's Orange life has come full circle for Margaret and Hugh and it is their children and grandchildren who carry the story to the end.These are novels that pull at the heart strings, there is love and laughter, cruelty and thoughtfulness. A snap shot of the past. There are pockets of humour where I laughed out loud which relieved the bleakness of the novels overall.Sad to come to the end of the Darcy's, they had a story worth telling."}, {"review_sentiment": 5.0, "review_text": "Great for us in summer. Happy with this purchase!!"}, {"review_sentiment": 5.0, "review_text": "I love this LED Insect Killer a lot. You can tell it's a very good quality product when touching it. It has multiple ways to used it like camping, garden porch or at home use. it's also useful if we want to eat out on our balcony in the evenings; sitting in the corner, it quietly and effectively attracts all of the nasties. I highly recommend it."}]}, "authors": ["Ruth Park"], "isbn": "0312000537", "longitude": 151.2164539, "periods": ["1900s"], "title": "The Harp in the South", "word_cloud": "like reiterate previous review state product fraud star rating fake eye open terrible product look purchased dollar shamefully resold buy product even give shot sure suspect mosquito problem hour single mosquito kill not mention huge awkward light screw light socket place lamp make lamp light ugly purple return such nice review week still bite single dead mosquito see section buy previously buy brand work great kill hundred mosquito time time include brush unfortunately blue light gradually losing strength name bright blue alright work amaze classic product truly amazing work exactly free solution pesky mosquito problem really summer haunt mosquito little irritating creature everywhere last summer bough zapper see work mosquito almost queue quick death final enjoy mosquito free room summer recommend family friend product bright bug zapper definitely work put outside wall sconce product longer fight bug get house night edition contain trilogy novel comprise interest trilogy arrive better understanding tell early courtship history family write wall regard early long suffer staunch lovingly supportive wife time family live struggle house vermin ridden dirty resident poverty stricken still act kindness squalor pub dreg life come full circle child grandchildren carry story novel pull heart string love laughter cruelty thoughtfulness snap shot pocket humor laugh loud relieve bleakness novel come end story worth tell summer happy purchase love led lot tell good quality product touch multiple way use camp garden porch home use also useful want eat balcony evening sit corner quietly effectively attract nastiest highly recommend", "genres": ["Fiction & Literature", "Historical Fiction", "The Depression"], "summary": "An Australian classic, this is the story of the Darcy family who live in the Depression era tenements of Surry Hills, Sydney.\r\n\r\nHugh and Margaret Darcy are raising their family in Sydney amid the brothels, grog shops, and run-down boarding houses of Surry Hills, where money is scarce and life is not easy.\r\n\r\nFilled with beautifully drawn characters that will make you laugh as much as cry, this Australian classic will take you straight back to the colourful slums of Sydney with convincing depth, careful detail, and great heart.", "asin": "0312000537", "rank": "2744951", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/41-qMaeoPtL.jpg", "country": "Australia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}