{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 157, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I absolutely loved this book. Levy is so talented in her character description. I loved every page of this book!"}, {"review_sentiment": 1.0, "review_text": "Just not my type.  It did have insights into the time period - hate, prejudice, frustrations."}, {"review_sentiment": 3.0, "review_text": "Meh. It's very well done, literarily.  I just don't like it."}, {"review_sentiment": 4.0, "review_text": "Watch the BBC mini series too!"}, {"review_sentiment": 5.0, "review_text": "Well worth reading. An interesting view of the discrimination toward blacks during the WW2 era."}, {"review_sentiment": 2.0, "review_text": "It was not what I expected it was confusing"}, {"review_sentiment": 4.0, "review_text": "Easy read and I loved the way it was written. Serious subject but presented in a very comical  way.  History that I wasn't familiar with during WW11."}, {"review_sentiment": 5.0, "review_text": "Very much enjoyed this book.  It is historical fiction at it's finest about Jamaican history and their contribution to the war.  It is authentically written with Jamaican dialect, which I find charming."}, {"review_sentiment": 5.0, "review_text": "very interesting."}, {"review_sentiment": 5.0, "review_text": "This was a page-turner. I have never been so dismayed that a book was ending. I so wanted to know what would happen next! Compelling characters and setting."}]}, "authors": ["Andrea Levy"], "isbn": "0312429525", "longitude": -0.12574, "periods": ["1900s", "Recent Releases"], "title": "Small Island", "word_cloud": "absolutely love talented character description love page just insight time period hate prejudice frustration meh well do literately like mini series well worth read interesting view discrimination black era expect confuse love way write subject present comical way familiar very much historical fiction finest jamaican history contribution war authentically write dialect find charm interest never dismay end want next character set", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Small Island is an international bestseller. It won the Orange Prize for Fiction, The Orange Prize for Fiction: Best of the Best, The Whitbread Novel Award, The Whitbread Book of the Year Award, and the Commonwealth Writers' Prize. It has now been adapted for the screen as a coproduction of the BBC and Masterpiece/WGBH Boston.\r\n\r\nHortense Joseph arrives in London from Jamaica in 1948 with her life in her suitcase, her heart broken, her resolve intact. Her husband, Gilbert Joseph, returns from the war expecting to be received as a hero, but finds his status as a black man in Britain to be second class. His white landlady, Queenie, raised as a farmer's daughter, befriends Gilbert, and later Hortense, with innocence and courage, until the unexpected arrival of her husband, Bernard, who returns from combat with issues of his own to resolve.\r\n\r\nTold in these four voices, Small Island is a courageous novel of tender emotion and sparkling wit, of crossings taken and passages lost, of shattering compassion and of reckless optimism in the face of insurmountable barriers---in short, an encapsulation of that most American of experiences: the immigrant's life.", "asin": "0312429525", "rank": "321345", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51mcQ9jBgqL.jpg", "country": "England", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}