{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": -27.4689682, "ratings": {"num_ratings": 27, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "This is one of my favorite books, with one of my favorite, laugh out loud moments in it. The one part with the cat is so funny that I share it with everyone that I can force to sit still long enough to listen to me read it (they laugh too). It got my teenage son back into reading again."}, {"review_sentiment": 5.0, "review_text": "I loved this book.  It's a different type of novel than I usually read, but I couldn't put it down."}, {"review_sentiment": 3.0, "review_text": "Nick Earls writes a book that leaves you wanting to read more, for the next explanation or detail to understand the story.  But it takes the entire book for him to reveal the obvious! I guess I'd recommend this book for someone with more time and patience than I have."}, {"review_sentiment": 3.0, "review_text": "I thought it was just a little disjointed. I was disappointed that its 'message' didn't really gel for me in the end..."}, {"review_sentiment": 2.0, "review_text": "Just didn't grab me.  Writing was loose.  Characters flat. Story silly.  I am only writing now because nine more words were needed.  There isn't anything else to say about this book."}, {"review_sentiment": 5.0, "review_text": "Really enjoyed this book. Was very interesting and one of those I couldnt put down. Have kept on my Kindle as I have friends who want to read it."}, {"review_sentiment": 5.0, "review_text": "Really enjoyed this book. Good writing style, unusual events, great plot.Will be looking for more books by this author."}, {"review_sentiment": 3.0, "review_text": "I found this novel had a really awkward flow. The talk among friends got really boring. I kept wanting the pace to move onward, but it was getting bogged down with \"chat\"."}, {"review_sentiment": 5.0, "review_text": "It took me a little while to get into this book, but then I couldn't put it down.  There is a rhythm to it that seemed slow, but is really what the book is about.  It is every day, it is coming out of a bad time, it is dealing with emotions that are not black and white.  The conversations are beautifully written, giving you the chance to be part of the various relationships Jon has with the people in his life.  You learn about what he is dealing with slowly, because Jon holds back from his friends ( and the reader).  I felt like I was part of this man's life.  Great read and I'm going online now to see what else Nick Earls has written!"}, {"review_sentiment": 1.0, "review_text": "The wonderful thing about books is there's something for everyone.  This one, unfortunately, just wasn't for me.  I read about 27% of it, skimming through a lot of the last 10%, and could not find anything interesting about it.  Maybe if I had stuck with it...  I very seldom give up, but have so many books downloaded on my Kindle, figured I might as well move on this time to something that could hold my interest."}]}, "authors": ["Nick Earls"], "isbn": "0312303033", "longitude": 153.0234991, "periods": ["2000s"], "title": "Perfect Skin: A Novel", "word_cloud": "favorite favorite laugh loud moments part cat funny share everyone force sit still long enough listen get teenage son back reading love different type usually write leave want next explanation detail understand story take entire reveal obvious guess recommend someone time patience think little disjointed disappoint really gel end just grab write loose character flat silly write word need anything else say really enjoy interest couldn't put have keep friends want really enjoy good writing style unusual event great look author find really awkward flow talk friend get really bore keep want pace move get bogged chat take little get rhythm seem slow really day come bad time deal emotion black white conversation beautifully write give chance part various relationship people life learn deal slowly hold back friend felt part man life go online see else write wonderful thing something everyone unfortunately skim lot last anything interesting maybe stick seldom give many download figure well time something interest", "genres": ["Fiction & Literature"], "summary": "Jon Marshall, a thirtysomething plastic surgeon, has come a long way. He's a partner in his own medical practice, owns a house in the suburbs, and cruises town in a BMW. He also has a six-month-old daughter, Lily, affectionately known as the Bean.\r\n\r\nBut Jon's life hasn't taken the path he thought it would in his twenties. Newly single, he's facing the challenges of dating in a post-Duran-Duran world. His computer has been seized by surly software. He accidentally peed on his date's cat. And while the Bean reminds him of life's possibilities every day, his new running buddy, Ashley, reminds him that relationship rules were made to be broken.", "asin": "0312303033", "rank": "5962949", "city": "Brisbane", "image": "https://images-na.ssl-images-amazon.com/images/I/516VVN864JL.jpg", "country": "Australia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}