{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 12, "rating": 2.7, "reviews": [{"review_sentiment": 2.0, "review_text": "Couldn't find a reason to want to know about the characters.  Very limited storyline and character development."}, {"review_sentiment": 2.0, "review_text": "Very slow to get started. I kept thinking it would get better, but it never did. If this weren't a [...] selection, there's no way I would have finished it as my time could have been better spent looking for a better book about Texas. The characters were too flat, the plot just about non existent, and I did not wind up caring about anybody in the book.In short, this is the kind of book that critics like (it's art) and readers don't."}, {"review_sentiment": 5.0, "review_text": "In this funny, ambitious, and extremely accomplished first novel, Karen Olsson portrays past and present, hip and square, liberal and conservative, youth and maturity, and public (political) life vs. private with a deftness and wisdom that few writers can match, much less one on the front end of her career.  If you're looking for an introduction to Texas, and particularly Texas politics of the past 50 years, this is a wonderful place to start; Olsson knows her stuff but conveys it with a lightness of touch that makes it all come alive in her narrative and characters.  If you're a lifelong Texan, you'll find much here that illuminates (and skewers, and caresses) existence in the Lone Star state.  Olsson skillfully manages a multi-layered narrative--different points of view, different eras--to such effect that the reader comes away with the sense of having experienced a thick, and tremendously entertaining, slice of life.  That she's exploring the life and times of Austin, Texas--one of the best cities in America--makes it all the more enjoyable.  Highly recommended."}, {"review_sentiment": 1.0, "review_text": "I'm this novel's ideal demographic:  I've lived in Austin for three decades; I love and hate the place; I have a degree from UT; and I'm certainly a card-carrying liberal, one who has even subscribed to The Nation (to which the author has contributed).  But I loathed this book.  Not because it wasn't true to \"my\" city, but because its author thought she had to write Art instead of telling a story.  By page 90, I was wondering if the story would ever begin  -- or if I'd ever find anything to admire in the person who, I surmised after many choppy chapters, was the main character.  But there was nothing to admire or to even vaguely like in the struggling Austin Chronicle journalist who is the protagonist.  I did make it to the end of the book, because of the odd moment of funny truthfulness or because some vivid detail was keenly rendered.  For that, I give the novel one star."}, {"review_sentiment": 2.0, "review_text": "The second half of this novel was certainly better than the first. The author was at her best in scenes heavy in dialogue. The narrative tended to wander off laden with too much description that really added nothing to the story or the characters. I don't think the overall spirit and vibe of Austin came out although I could be mistaken since I have only visited the city and have never lived there. The writing got stronger as the story went on but over all I never saw much pint in the whole thing. I did find the characters interesting enough to keep reading. Not the greatest of novels, but certainly not the worst. The author had potential so I would be open to reading future works."}, {"review_sentiment": 1.0, "review_text": "Ugly cover, lousy title...and the book itself!  Bland, boring, unconvincing.  There's nothing wrong with having characters who are slackers, but it might help to have the slackers be interesting or even a little nuts.  Nothing is at stake in this book--for anybody.  And Olsson apparently has no sense of humor--her charactrers are all very grim and very earnest, and she's very condescending not only the poor boring dopes that inhabit her book but to her readers as well. Very sad.  And why use \"Waterloo\" for Austin--especially since the book jacket says \"Austin\"?  Stupid.The sound you hear is Billy Lee Brammer spinning in his grave...."}, {"review_sentiment": 2.0, "review_text": "Waterloo is very well written, but is peopled by the most boring losers I have read about in years! Both the younger characters - in their early thirties - and the older ones - in their fifties and beyond - are self-absorbed and self-righteous. Hard to say which is more boring: their drinking bouts or their sexual exploits."}, {"review_sentiment": 4.0, "review_text": "_Waterloo_ winds its way to the same conflicted and heartsick ending by many different paths.  From the progress-less movements of the tortured denizens of the town to the tragic but unavoidable fate of its old buildings, a tangle of love, hate and Newtonian inevitability engulf them all, separately and in a series of unexpected connections.If this book had no other redeeming feature, Olsson's exquisite command of language alone would make it worth reading.  Fortunately, the plots (yes, there is most assuredly more than one) and their intriguing associations, and the interesting, believable characters provide a very satisfying cake to undergird the linguistic icing."}, {"review_sentiment": 5.0, "review_text": "Olsson has written a witty, sophisticated novel that promises to entertain native Austinites as well as readers outside the boundaries of Texas' familiar capital. Beyond delving into the political nuances of state politics, Olsson possesses a sharp eye for affairs of the human heart. Her scenes and dialogue between her characters resonate with truth, and often with smirks and laughter... whether it's between Nick Lasseter, the half-hearted, left-leaning journalist, and his inebriated Uncle Bones, a washed-up lobbyist... or a brief exchange between assemblywoman Beverly Flintic and a grocery store cashier. Also, it's not any debut novelist who can seamlessly shift between characters' points of view as well as moments in time. Olsson makes something seem easy, which isn't easy at all. Enjoy!"}, {"review_sentiment": 1.0, "review_text": "I could not get interested in this book. Distill this book down and it's Nick Hornby (slackers looking for meaning) meets Danielle Steele (affairs and intrigue). Boring and it doesn't bring anything new to the table.And why not just be blatant about the city? I can't grasp the point of using the skeleton of the city, yet renaming EVERYTHING...even Town Lake. I mean, it's not like the river is going to sue you for using its name. Good grief. If the goal was to make the Austin setting into Everytown, USA, why go to such efforts to describe Austin? But the great thing about Austin is precisely that it is NOT just anywhere. Go with it, girl!Regardless of any \"government-industrial-media complex\" this book might explore, the root of any good book is an interesting plot and compelling characters--neither of which exist in this book. This topic would be better discussed as an essay."}]}, "authors": ["Karen Olsson"], "isbn": "0312425597", "longitude": -97.7436995, "periods": ["2000s", "Recent Releases"], "title": "Waterloo: A Novel", "word_cloud": "reason want know character very limited story line character development very slow get start keep think better never selection way time spent look better character flat plot non existent wind care anybody short kind critic art reader funny ambitious extremely accomplish first portray past present hip square liberal conservative youth maturity public political life private deftness wisdom writer match much le front end career look introduction particularly politics past year wonderful place start know stuff conveys lightness touch make come alive narrative character lifelong find much illuminates skewer caress existence state skillfully manage narrative different point view different era effect come away sense experience thick tremendously entertaining slice life explore life time best city make enjoyable recommend ideal demographic live decade love hate place degree certainly liberal even subscribe author contribute loathe not true city author think write instead tell story page wonder story ever ever find anything admire person surmise many choppy chapter main character nothing admire even vaguely struggle journalist protagonist make end odd moment funny truthfulness vivid detail keenly render give star second half certainly better first author best scene heavy dialogue narrative tended wander laden much description really add nothing story character think overall spirit vibe come visit city never live writing get stronger story go never saw much pint whole thing find character interest enough keep reading not greatest novel certainly worst author potential read future work ugly cover lousy title bore unconvincing nothing wrong character slacker slacker interest even little nut nothing stake anybody apparently sense humor character grim earnest condescend poor boring dope inhabit reader well very sad use especially jacket say sound hear spin grave well write people boring loser year younger character early thirty older one fifty say bore drinking bout sexual exploit wind way conflict heartsick end many different path movement torture denizen town tragic unavoidable fate old building tangle hate newtonian inevitability engulf separately series unexpected redeeming feature exquisite command language alone worth read fortunately plot yes assuredly intriguing association interest believable character provide satisfy cake under gird linguistic icing write witty sophisticated promise entertain native well reader boundary familiar capital delve political nuance state politics possess sharp eye affair human heart scene dialogue character resonate truth often smirk laughter journalist inebriate lobbyist brief exchange assemblywoman grocery store cashier also debut novelist seamlessly shift character point view well moment time make something seem easy easy interested slacker look mean meet affair intrigue bring anything new blatant city point use skeleton city yet rename even mean river go sue use name grief goal make set effort great thing precisely anywhere girl complex root good interesting plot compel character exist topic discuss essay", "genres": ["Fiction & Literature", "Humour", "Politics"], "summary": "Nick Lasseter is in a slump--as a reporter for the Waterloo Weekly, and in every other part of his life as well. When he grudgingly agrees to write a piece about a rising female Republican legislator, he stumbles onto a political fight in which the good guys and bad guys start to seem interchangeable. And not even the deceased can be relied upon to stick to their stories when Nick gets involved with a political insider. As they search the dim depths of a civic past that's anything but dead and buried, they find that some things never change--things like the moral ambiguity of practical politics and the sad, hilarious cluelessness of young men in love.\r\n\r\nBittersweet and biting, elegiac and sharply observed, Waterloo is a portrait of a generation in search of itself--and a love letter to the slackers, rockers, hustlers, hacks, and hangers-on who populate Austin, Texas--from a formidable new intelligence in American fiction.", "asin": "0312425597", "rank": "2445941", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51IsdHiSDvL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}