{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 83, "rating": 2.9, "reviews": [{"review_sentiment": 2.0, "review_text": "and I admit I did a lot of skimming.  It is brilliant in its own way, I suppose, but not my way. Dislike it for the obvious reasons.  At 74, I just don't have time to invest in books I don't find meaningful."}, {"review_sentiment": 1.0, "review_text": "Boring, boring, boring."}, {"review_sentiment": 5.0, "review_text": "My daughter researched a book to give me as a present, with the goal of finding something I most likely had not read. She succeeded! And I am glad she did. This book is long, readable and unreadable at the same time. I read a chapter a night which was all I could take, but came back to it night after night. It is a thorough observation of the life of a family which does not know the extent of its dysfunction because it is the only family in which they have lived. The wife, in many ways the major character, reminds me of my mother, who became venemous sbout my father but would not leave. I related to the ugly duckling daughter. The father spouts many of the ideals endorsed by those of us who consider ourselves progressive, but he flits through the ideals rather than doing anything much to achieve  them. The book also shows grinding poverty, gender divide, racism, joy, horror, zest for life, and sometimes love, especially of young children for parents who by today's standards are abusive. So it is an interesting and absorbing read, both dated and contemporary, unique in this regard. If you are a serious reader who is willing to take on a tough book (not a difficult read, just tough), you will find the experience worthwhile."}, {"review_sentiment": 5.0, "review_text": "One of the best novels I've ever read. Written with so much candor, beauty and humor. A book you should read!"}, {"review_sentiment": 3.0, "review_text": "Not an easy read, but this was a very graphic depiction of an extremely dysfunctional family.  Not much to like about any of the characters, especially the parents, who are both lethal in very different ways."}, {"review_sentiment": 4.0, "review_text": "I could not put this engrossing but loathsome book down, was hugely glad when I was done, but equally glad that I had read it.There are patches of writing as good as anyone has put on paper, detailing an appalling marriage between two appalling people you will not quickly forget.  I recommend you read the novel before tackling Randall Jarrell's lengthy, penetrating preface, which is attuned both to its virtues and limitations."}, {"review_sentiment": 3.0, "review_text": "It was an extremely difficult book to get through. In particular the sections where the father goes into some ridiculous baby talk that I found absurd, difficult to read and added nothing to the story. It was very disturbing and about half way through I found myself skipping pages just to finish. I don't feel I lost much by doing so.. I've never been happier to be done with a book. I just plain didn't like it. This is not a critique of the literature. It is simply my personal reaction to the book."}, {"review_sentiment": 5.0, "review_text": "An extremely well written novel, a psychological tour de force. Portrayals of childhood are exceptional. A very tense and tragic theme. A novelists novel, but not for everyone."}, {"review_sentiment": 3.0, "review_text": "This book is hard to read and in the beginning I almost quit a few times . You have to stick with it to start to understand the dynamic of this highly dysfunctional family . The father has a lot of made up words that he used to speak to his children which is sometimes annoying until you get the idea . Not sure I cared for the ending . The prologue requires an effort to get through as well .  This all doesn't sound very positive but for some reason I had to keep going until I finished ."}, {"review_sentiment": 3.0, "review_text": "Neither main character was like able to me."}]}, "authors": ["Christina Stead"], "isbn": "0312280440", "longitude": 151.2164539, "periods": ["1900s"], "title": "The Man Who Loved Children: A Novel", "word_cloud": "admit lot skim brilliant way suppose way obvious reason time find meaningful bore bore boring daughter research give present goal find something likely succeed glad long readable unreadable time chapter night come back night night observation life family know extent dysfunction family live wife many way major character remind mother become venomous about father related ugly duckling daughter father spout many ideal endorse progressive flit ideal rather anything much also show grind poverty gender divide racism joy horror zest life sometimes especially young child parent today standard abusive so interesting absorb dated contemporary unique regard serious willing tough difficult tough find experience worthwhile best novel ever write much candor beauty humor not easy graphic depiction extremely dysfunctional family not much character especially parent lethal different way engross loathsome hugely glad do equally glad patch write good anyone put paper detail appalling marriage appal people quickly recommend tackle lengthy penetrate preface attune virtue limitation extremely difficult get particular section father go ridiculous baby talk find absurd difficult add nothing story disturb half way find skip page finish feel lose much never happier do plain critique literature simply personal reaction extremely well write psychological tour force portrayal childhood exceptional tense tragic theme novelists everyone hard beginning almost quit time stick start understand dynamic highly dysfunctional family father lot make word use speak child sometimes annoy idea not sure care end prologue require effort well sound positive reason keep go finish main character able", "genres": ["Fiction & Literature"], "summary": "With an Introduction by Randall Jarrell. Sam and Henny Pollit have too many children, too little money, and too much loathing for each other. As Sam uses the children's adoration to feed his own voracious ego, Henny watches in bleak despair, knowing the bitter reality that lies just below his mad visions. A chilling novel of family life, the relations between parents and children, husbands and wives, The Man Who Loved Children, is acknowledged as a contemporary classic.\r\n\r\nThe novel is set in Sydney, but was later changed to Washington D.C. to suit an American audience.\r\n\r\n“This crazy, gorgeous family novel is one of the great literary achievements of the twentieth century. I carry it in my head the way I carry childhood memories; the scenes are of such precise horror and comedy that I feel I didn't read the book so much as live it.” Jonathan Franzen (author of The Corrections)", "asin": "0312280440", "rank": "371319", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51W0y9jJHAL.jpg", "country": "Australia", "story_arc": ["Tragedy", "Things only get worse"]}