{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 1527, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a book which you should read for the sake of reading. Don’t read it for its story though you’ll find a lot many stories admirably woven together. And if you’re tired of it’s lengthy prose, don’t skim it. And don’t read between the lines. Because that’s where the magic lies."}, {"review_sentiment": 1.0, "review_text": "I kept waiting to het to the point of the story. Maybe just their disfunction was the story? Maybe for some but not me."}, {"review_sentiment": 5.0, "review_text": "Franzen is a fantastic writer, and that's really all there is too it. If you're looking for literature, you've found it."}, {"review_sentiment": 1.0, "review_text": "Some may consider his writing beautifully done. To me, his sentences went on and on and on--paragraphs were entire pages long. When he started writing about feces, I was almost ready to put the book down. But I continued reading till I asked myself, \"Why am I reading such a depressing book?\"  Couldn't finish it, but that's just me!!"}, {"review_sentiment": 2.0, "review_text": "The biggest problem with this book (for me) was that every character was selfish and destructive - and unrepentantly so. A twisted cast of manipulators or, the merciless dominators who force the antics of the manipulators. Misery is displayed in nauseating detail then wrapped up neatly and presented at the end as caused by the evil of traditional mid-century American values. The misery can only be cured by getting what you want, whether you have to sell your soul or not is immaterial. (Gary)The story follows, for 566 pages, a bunch of sad secretive members of ta family who don't understand why they are unhappy or how to plan their lives to make themselves happy. There is an astonishing lack of self-awareness, and no notion of how to forgive themselves for their own failings, or forgive others for not being who they want them to be. It is a world of a teenager who longs to be in charge, but has no conception of cause and effect or discipline. The most juvenile of delusions is that when you can finally do whatever you want, you'll get to be happy.The book does not try to disprove that and is an exercise in futility. Unless you like long meandering tales where everyone is less than they should be and events are meaningless, because the characters learn nothing. Except perhaps Chip. But we don't really know because we are given no details about his resolution at the end of the story, or what he thinks about it.If this is how the author sees the world, I think he feels like these characters: at sea in a hostile world where nothing makes sense, awash in silent misery and selfishly protecting himself against all comers. And I can kind of feel sorry for him."}, {"review_sentiment": 5.0, "review_text": "One of the best books I've read! Highly recommended"}, {"review_sentiment": 1.0, "review_text": "i cant seem to get into the story at all."}, {"review_sentiment": 5.0, "review_text": "One of the best books ever written about an important time in American culture"}, {"review_sentiment": 4.0, "review_text": "A novel describing family relationship, love, life and deathI enjoyed reading it, however some passages seem too long sometimes"}, {"review_sentiment": 5.0, "review_text": "I didn't want to fall in love with this book.  Everyone is so horrible.  The failures just don't end. But the writing is so brilliant that it lures you in to each story and I found myself desperate to pick the book up every chance I could once I got about half way through. I cried like a baby at the end without fully understanding why. It will definitely take time to digest the nightmare of each character and figure out the point of their miseries."}]}, "authors": ["Jonathan Franzen"], "isbn": "0312421273", "longitude": -90.0701156, "periods": ["2000s"], "title": "The Corrections: A Novel", "word_cloud": "sake read story find lot many story admirably weave together tire lengthy prose skim line magic lie keep wait get point story dysfunction story maybe fantastic writer really look literature find write beautifully do sentence go paragraph entire page long start write feces almost ready put continue read till ask read depress biggest problem character selfish destructive unrepentant twisted cast manipulator merciless nominator force antic manipulator display nauseate detail wrap neatly present end cause evil traditional american value misery cure get want sell soul immaterial story follow page bunch sad secretive member ta family understand unhappy plan life make happy astonish lack notion forgive failing forgive others want world teenager longs charge conception cause effect discipline juvenile delusion finally want exercise futility long meandering tale everyone le event meaningless character learn nothing perhaps really give detail resolution end story think author see world think feel character sea hostile world nothing make sense awash silent misery selfishly protect comer kind feel sorry best recommend cant seem story best ever write important time american culture describe family relationship love life death i enjoy read however passage seem long sometimes want fall horrible failure end write brilliant lure story find desperate pick chance get half way cry baby end fully understand definitely take time digest nightmare character figure point misery", "genres": ["Fiction & Literature"], "summary": "After almost fifty years as a wife and mother, Enid Lambert is ready to have some fun. Unfortunately, her husband, Alfred, is losing his sanity to Parkinson&#039;s disease, and their children have long since flown the family nest to the catastrophes of their own lives. \r\n\r\nThe oldest, Gary, a once-stable portfolio manager and family man, is trying to convince his wife and himself, despite clear signs to the contrary, that he is not clinically depressed. The middle child, Chip, has lost his seemingly secure academic job and is failing spectacularly at his new line of work. And Denise, the youngest, has escaped a disastrous marriage only to pour her youth and beauty down the drain of an affair with a married man-or so her mother fears. \r\n\r\nDesperate for some pleasure to look forward to, Enid has set her heart on an elusive goal: bringing her family together for one last Christmas at home.", "asin": "0312421273", "rank": "22838", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51wr09D9LZL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}