{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 689, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "To read and feel as if someone has felt your private thoughts. And then to pause and disagree. A sad requiem."}, {"review_sentiment": 5.0, "review_text": "Lovely and sad. Very thoughtfully written. Highly recommend."}, {"review_sentiment": 5.0, "review_text": "This remains one of the books im always recommending.How can someone keep living a life that's not their own, just to make people happy? They keep thinking life is good because making people happy makes them happy but the point where they reach the understanding that their life is not their own, it is heartbreaking but it lights the hope of life. No one can know what happens in other shoes unless you walk with them, and the motives and actions of some people may seem awful but for others might be the light of life illuminating everything.Live the moment, your moment."}, {"review_sentiment": 5.0, "review_text": "I expected this to be good, which is always dangerous. It wasn't. It was wonderful. Nearly every page conatained an observation or description that was perfect. The writing style is just so lovely, it works as a tool to tap into your emotions. And not in a manipulative way. I felt as if I were on a small journey with Michael Cunningham, as if we were comparing notes on the sweet sadnesses, the regrets, the slight state of mourning we are perpetually in, even on the sunniest days. It's all the price of self-awareness, and Cunningham invites you to dive off the cliff and examine how you really feel about some of life's most imponderable and ever-present dilemmas. The observation concerning the special love we feel for the people with whom we shared our most hopeful moments took my breath away."}, {"review_sentiment": 5.0, "review_text": "Narration was exceptional.  Book was layered and rich reading.  Highly recommend."}, {"review_sentiment": 3.0, "review_text": "Tick, Mrs. Dalloway. Tock, Mrs. Woolf. Tick, Mrs. Brown. Tock, Mrs. Dalloway…again.Reviewing The Hours I find myself stuck somewhere in between tick and tock. Reading a novel, poem, play, screenplay, it’s often easy for me to lose touch with reality and completely absorb myself into the world of a story. I lose touch with myself. The sounds around me. The smells hovering under my nose. The world happening around me. Time elapses into nothingness.The Hours, however, made me fully aware of my position in reality, the noises of the outside world, the stuffiness of the air, and the slowness of time. In brief, The Hours leaves me feeling strangely hollow and irked.The book alternates between the stories of three women Tick: Mrs. Dalloway; Tock: Mrs. Woolf; and Tick: Mrs. Brown – all whom appear vaguely dissatisfied with their lives. It remains rather obscure and somewhat misleading, until the very end, as to how their narratives converge, apart from their longing and entertaining of the possibility of a life different and perhaps more meaningful than that which they find themselves trapped within.Tick: Mrs. Dalloway.Also known as Clarissa Vaughn, heroine of Virginia Woolf’s Mrs. Dalloway. An exquisitely loyal friend, caretaker and avidly nostalgic observer of the writer and AIDS sufferer, Richard Brown.Tock: Mrs. Woolf.Despairing, yet romantically hopeful, Mrs. Woolf spends her ticks and tocks dreaming up stories and possible plot turns for the writing of her new novel. Residing in Richmond with her protective husband, Leonard, Mrs. Woolf longs for the fog, business and sweet transparency of London.Tick: Mrs. Brown.Dear Mrs. Brown. Beseeched in suburban Los Angeles with a loving husband, Dan and curiously observant son, Richie, Laura Brown hopes without knowing what she hopes for. She lives without knowing what she lives for. She escapes without knowing what she is escaping from.Tick tock, tick tock go the hours.One day; one utterly transformative and inescapable 24 hours of each of the women’s lives is slowly narrated, beginning with life, and ending with the possibility of death as means of escape from a banal, yet disheartening existence. Mrs. Dalloway, Mrs. Woolf and Mrs. Brown all seem to lead banal, ordinary lives dealing with the daily hardships typical of the era in which they live, but are curiously described in a way that renders them different, yet also relatable. They have a home, health, and « happiness » yet find themselves unhappy and nostalgic for a feeling or situation that perhaps may not even exist.Time, the passing of time, the inevitability of time lies at the heart of the novel, as it is time, it’s passing, and its prevalence that causes each of the narratives to ultimately converge in the book’s final pages.Although the plots and events of the stories prove to be difficult to piece together and disallow for a completely pleasurable « readerly » experience one CANNOT deny the beauty and artistic way in which each character, event, place is illustrated. Cunningham’s language is brilliantly seductive and offers an evocative portrayal of life and how we, as readers, lovers, feelers – humans – experience time, the passing of time, and the inevitability of time.In terms of plot, I would not recommend The Hours (who cares if it won the Pulitzer Prize or that it’s Oprah’s favorite book or that Meryl Streep doesn’t shut up about it), but in terms of language, it’s impossible not to utterly fall in love with Michael Cunningham’s words:We live our lives, do whatever we do, and then we sleep – it’s as simple and ordinary as that. A few jump out of windows or drown themselves or take pills; more die by accident; and most of us, the vast majority, are slowly devoured by some disease or, if we’re very fortunate, by time itself. There’s just this for consolation: an hour here or there when our lives seem, against all odds and expectations, to burst open and give us everything we’ve ever imagined…– and I’ll leave you to ponder on that dear, dear babblers."}, {"review_sentiment": 5.0, "review_text": "Product came quickly and intact!"}, {"review_sentiment": 5.0, "review_text": "This book is beautiful, complex and enthralling. Cunningham masterfully weaves together the lives of three women, and artfully deals with psychological moments, both of the everyday and typical, artistically gifted, and the manically depressed."}, {"review_sentiment": 5.0, "review_text": "I've never read a book where the way I feel comes out onto the page and expresses what is inside of me.... thank you"}, {"review_sentiment": 5.0, "review_text": "Beautifully written (as is any work by Cunningham) and wonderfully innovative. Cunningham masterfully weaves this intertwining narrative together and expertly explores the themes and steam of consciousness of \"Mrs. Dalloway\". I was so absorbed by every page, right until the end, I didn't want to put it down.  I'm surprised by the negative reviews, which seem to just not really get it."}]}, "authors": ["Michael Cunningham"], "isbn": "0312243022", "longitude": 0.0, "periods": ["1900s"], "title": "The Hours", "word_cloud": "someone felt private thought pause sad requiem lovely sad thoughtfully write remain mi always someone living life make people happy keep think life good make people happy make happy point reach understand life heartbreaking light hope life one know happen shoe walk motif action people awful others life illuminate moment moment expect good always dangerous wonderful nearly page contain observation description perfect writing style lovely work tool tap emotion manipulative way felt small journey compare note sweet sadness's regret slight state mourning perpetually even sunniest day price invite dive cliff examine really life imponderable dilemmas observation concern special love feel people share hopeful moment take exceptional layer rich reading recommend find stuck somewhere tick rock poem play screenplay often easy touch reality completely absorb world story lose sound smell hover nose world happen elapse however make fully aware position reality noise outside world stuffiness air slowness time brief leave feel strangely hollow alternate story woman appear vaguely dissatisfied live remain rather obscure somewhat misleading end narrative converge apart long entertain possibility life different perhaps meaningful trapped know heroine exquisitely loyal friend caretaker avidly nostalgic observer writer sufferer yet romantically hopeful spend tick rock dream story possible plot turn write new reside protective husband long fog business sweet transparency suburban love husband curiously observant son hop know hope live know life escape know escape rock tick rock go day utterly trans formative inescapable woman live slowly narrate begin life end possibility death mean escape banal yet dishearten existence seem lead banal ordinary life deal daily hardship typical era live curiously describe way render different yet also repeatable home health happiness yet unhappy nostalgic feel situation perhaps even pass time inevitability time lie heart time pass prevalence cause narrative ultimately converge final plot event story prove difficult piece together disallow completely pleasurable reader experience beauty artistic way character event place illustrate language brilliantly seductive offer evocative portrayal life reader lover feeler human experience time passing time inevitability term plot care favorite shut term language impossible utterly fall love word live life sleep simple ordinary jump windows pill die accident vast majority slowly devour disease fortunate time consolation hour live seem odds expectation burst open give everything ever leave ponder dear dear babbler product come quickly intact beautiful complex enthral masterfully weave together life woman artfully deal psychological moment everyday typical artistically gift manically depressed never way feel come page express thank beautifully write work wonderfully innovative masterfully weave intertwine narrative together expertly explore theme steam consciousness absorb page right end want put surprise negative review seem really", "genres": ["Fiction & Literature"], "summary": "A daring, deeply affecting third novel by the author of A Home at the End of the World and Flesh and Blood.\r\n\r\nIn The Hours, Michael Cunningham, widely praised as one of the most gifted writers of his generation, draws inventively on the life and work of Virginia Woolf to tell the story of a group of contemporary characters struggling with the conflicting claims of love and inheritance, hope and despair. The narrative of Woolf's last days before her suicide early in World War II counterpoints the fictional stories of Samuel, a famous poet whose life has been shadowed by his talented and troubled mother, and his lifelong friend Clarissa, who strives to forge a balanced and rewarding life in spite of the demands of friends, lovers, and family.\r\n\r\nPassionate, profound, and deeply moving, this is Cunningham's most remarkable achievement to date.", "asin": "0312243022", "rank": "59353", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41tvUg4Qc5L.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}