{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 64.145981, "ratings": {"num_ratings": 356, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book, love the author. Great seller."}, {"review_sentiment": 5.0, "review_text": "Okay, I admit i Have not actulay read this book.  But it looks grrrrrrrrrreat."}, {"review_sentiment": 5.0, "review_text": "I like all these books but this one is fabulous.  Could not put it down.  Story is complex but not so much that you have to twist your mind into weird places.  I am reading this entire series and hope that there are more to come.  I am the kind of person who doesn't try to figure out the mystery; I just play along and this series of books is great for doing that.  Besides the story itself, I like the moody brooding detective who is generally not on the same social track as anyone else.  This is common in these types of stories but books would be boring if the main character was simply a nice guy.  You need some drama.  The other items that I like about all these books is the fact that they're in Iceland with its interesting culture, cold weather (I live in Phoenix so reading about cold places works in the hot summers) and the long daylight and night hours."}, {"review_sentiment": 2.0, "review_text": "In its sans serif style, Jar City began to plod its weary way through what I thought would be an intricate plot.  As it progressed from red herring to red herring, it promised to be less than that.  It had more loose ends than Mrs. Weiss's noodle soup."}, {"review_sentiment": 4.0, "review_text": "Good first bookI am looking forward to the next story"}, {"review_sentiment": 1.0, "review_text": "boring"}, {"review_sentiment": 4.0, "review_text": "Erlandur is a taciturn inspector who realizes there's more to a break-in and murder than meets the eye.  As he's unraveling a decades-old case, he is also rebuilding a relationship with his troubled daughter.  It's a good story."}, {"review_sentiment": 5.0, "review_text": "iving with bipolar disorder myself, she captures some of the nuances of depression and describes them very well. The nonchalant approach to ending one's own life, like doing the laundry or cutting the grass comes across accurately. (from experience) The emotional struggles, most who have suffered with major depression will find something deeply connecting with this book. Read and comprehend this book the way it was meant to be, you will find another world that does exist in some of us."}, {"review_sentiment": 4.0, "review_text": "A very interesting story that dealt with crime and police work in a different way than one would expect. Definitely reading the rest of the series."}, {"review_sentiment": 5.0, "review_text": "I can go on and on about this album. If I had to choose a favorite album of all time, this one just might take the cake. The emotional impact this album has on me is beyond words. I'm a 25 year old male and everytime I hear \"Nutshell\" I begin to tear up. Staley sings his heart out and you can feel the emotion pouring through him. Alice in Chains has become one of my favorite bands and I love everything they have put out. \"Dirt\" may be their most well known album, but I would say this one is their best. An essential for any AiC fan. Even if you aren't one or are new to them, I cannot urge you enough to pick up this album. You will not regret it!"}]}, "authors": ["Arnaldur Indridason"], "isbn": "0312426380", "longitude": -21.9422367, "periods": ["2000s", "Recent Releases"], "title": "Jar City: A Reykjavi­k Thriller", "word_cloud": "love author seller admit have actulay look grrrrrrrrrreat like fabulous put complex much twist weird place read entire series hope come kind person try figure mystery play along series great story moody brood detective generally social track anyone else common type story main character simply nice guy need item like fact interesting culture cold weather live read cold place work hot summer long daylight night hour sans serif style begin plod weary way think plot progressed red herring red herring promise le loose end wei noodle soup good first book i look forward next story boring taciturn inspector realize murder meet eye unraveling case also rebuild relationship trouble daughter good story ice bipolar disorder capture nuances depression describes well nonchalant approach end life laundry cut grass come accurately emotional struggle suffer major depression something deeply connect way meant world exist interesting story dealt crime police work different way read rest series go album choose favorite album time emotional impact album word year old male every time hear begin tear sings heart feel emotion pour favorite band love everything put well album best essential fan even new urge enough pick album regret", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Jar City introduces readers to a new crime writer from Iceland whose work has created an international sensation. Arnaldur Indridason has been compared to such luminaries in the field as Henning Mankell, Georges Simenon, Per Wahloo and Maj Sjowall; everyone agrees that here is a world-class writer. \r\n\r\nWhen a lonely old man is found murdered in his Reykjavík flat, the only clues are a cryptic note left by the killer and a photograph of a young girl’s grave. Inspector Erlendur, who heads the investigation team, discovers that many years ago the victim was accused, though not convicted, of an unsolved crime. Did the old man’s past come back to haunt him?\r\n\r\nAs the team of detectives reopen this very cold case, Inspector Erlendur uncovers secrets that are much larger than the murder of one old man--secrets that have been carefully guarded by many people for many years. As he follows a fascinating trail of unusual forensic evidence, Erlendur also confronts stubborn personal conflicts that reveal his own depth and complexity of character. Like all great crime fiction, Jar City is about much more than murder, and avid suspense fans are about to discover a first-rate writer who has already received rave reviews around the world. ", "asin": "B009CRVZ6A", "rank": "1444040", "city": "Reykjavik", "image": "https://images-na.ssl-images-amazon.com/images/I/51HIWA-5TEL.jpg", "country": "Iceland", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}