{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 9, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "It's a wonderful, well written and enlightening story about which I knew nothing."}, {"review_sentiment": 5.0, "review_text": "A wonderful and important book.  It should be widely read as a lesson in true goodness and bravery."}, {"review_sentiment": 5.0, "review_text": "The Quiet Anerucan is a proud American story how  single individual was responsible in saving the persecutedf intelectuals, artitists, writers fron the grasp of the expanding evils of Nazism.  Varian Fry, an intelectual, a egonist and 'full of himself\", not at all his fault but his upbringing, sacrificed everything for what?  For no other reason than to save the inteligencia of Europe from the clutches of evil.  His deeds are for humanities sake not for money.  Written like a novel, but it isn't a novel, it is the real story fully documented and reads well, extremely well.  Thank you Indianapolis library from throwing this book off your shelves."}, {"review_sentiment": 5.0, "review_text": "I am stunned as I read this book. It is a book about incredible courage from people who knew their life was on the line with no hint of reward but the deep-seated knowledge that they were saving humanity from evil. It also offers insights into the lives of people who hold out for rescue in a hopeless situation. I have learned so much and been inspired by this book. I have learned how brave a person can be when one is scared."}, {"review_sentiment": 4.0, "review_text": "Hermann Goering is reputed to have said, \"When I hear the word 'culture', I reach for my pistol.\"This, from one of the most prolific looters of art in recent history, takes some explanation which, as it happens, is not forthcoming.However, upon reading of Varian Fry's heroic attempts to keep Europe from \"blowing its brains out\" by detaining and, certainly, eventually killing intellectuals wholesale, one may have a bit of sympathy for Goering.It isn't the art, it's the artists.Fry was an odd character from his earliest days when he easily manipulated his parents into letting him avoid school and do whatever it was that his latest whim desired.He had an unusual though substantial education, and was a writer and journalist and left-wing intellectual in the Thirties.  He was also what used to be called \"neurotic\" in that he had a number of personality traits we could call counterproductive, if we could ever figure out what Fry might think of as productive.  He had a bit of hypochondria, was sometimes hardpressed to make a decision, made friends and lost them over small things, and married an older woman with whom he had a relationship whose aspects, as Marino details them, make the reader squirm, just a bit, over what Marino doesn't detail.Whatever he managed to accomplish in those days seems to have been a function of high intelligence and fierce energy, opposed by various personality quirks.And then he went to Marseille to rescue European intellectuals.His transformation at that point is amazing.  From intellectual dilettante, indulging his personal whims, he became, overnight, indistinguishable from a hardened and trained operative of the OSS or the British SOE (Special Operations Executive).  Marino does not tell us how that happened, since it is almost certainly inexplicable.Unfortunately for Fry and others, the same process did not occur in many of those he tried to help.If there is one thing I did not expect in reading this book, it was the difficulty, sometimes the near impossibility, of chivvying various intellectuals through reasonably simple (given the circumstances) procedures that would save their lives.Some, told to keep a low profile while things were worked out, paraded themselves in Marseille's restaurants and bars.  Others refused simple instructions, or jibbed at the last moment, doing either nothing or something quite stupid.  Fry spent a good deal of the time and resources he had--not much of either--in bailing out individuals or repairing or replacing procedures they'd put in jeopardy.It is almost too good to be true, in terms of literary contrast, to find that Fry also had a group of British soldiers captured prior to Dunkirk to get out of the France.  These men, fit and  cheerful, followed directions without question, solved what problems remained, and were successfully sent home.  There could have been no greater contrast between ordinary people and intellectuals.Any reader who becomes involved in the narrative must, although sixty years and more have gone, become frustrated at the inability of Fry's charges to get out of their own way. One, after having been trouble on the European end, arrived safely in New York and began babbling to all about every secret arrangement Fry had made to get him and others safely out of the Gestapo's clutches.Fry, for this period, was clear-minded and hard-headed and full of energy.  In periods of crisis, people can go into overdrive for extended periods of time.  Eventually, they collapse.  Fry, however, managed to work like a fiend for months in circumstances of the greatest stress.  He never lost his focus and, indeed, was able to operate outside any constraints that one might have thought his earlier life placed on him.  In one case, having been betrayed and done out of a substantial amount of funding, Fry met with some of Marseille's underworld bosses and took out a murder contract on the traitor.Eventually, having been sent home by the authorities, he returned to the intellectual's life he'd left, including neuroses, counterproductive activities, odd relationships, and eventual death in obscurity.  The obscurity is partly a matter of official activity.  It wasn't until many years later, when Fry was honored in Israel as one of the Righteous, that Warren Christopher apologized on behalf of the State Department for all the obstructionism Fry had had to face from the United States.  Fry saved a great many intellectuals from death, providing the West, mostly the United States, with an intellectual boost (some became successful screenwriters as well), by finding within himself a person absolutely invisible to anyone looking at him either before or after his exploits.  The greatest mystery of the story is that contradiction.  The second greatest mystery is why saving intellectuals from certain death is so much like herding cats.  What is it about them?"}, {"review_sentiment": 4.0, "review_text": "As the other reviewers indicate, this is an excellent book.  The setting of Fry's heroism, Marseille and the environs of the South of France, permit an oblique perspective on the Holocaust, which unfolded principally much farther to the north and the east.  Without the overwhelming machinery of the sealed boxcars, the gas chambers, the crematoria, some of the underlying causes of the Holocaust come into focus:  the bureacratic obstructionism of the U.S. State department, motivated partly by national self interest and partly by the genteel anti-Semitism of individual Foreign Officers, provides a glimpse into how value-free institutional behaviour can be--a deadly underlying cause in Hitler's rise.  The sympathetic behaviour of peasants living on the border and of petty police officers contrasts with the callous, and often actively evil, behaviour of their official leaders.But always, there is the central enigma of Varian Fry himself--a complex, difficult , troubled man, in many ways a talented failure, who because of his clear moral vision became the catalyst for saving the flower of European artists and writers from the clutches of the Gestapo and their collaborators.In another book, Todorov posits that in extreme moral situations, the basic moral unit for effective action is two, because he notes that the rescuers--Gentiles who risked their lives to save Jews during the Holocaust were rarely individuals; often they were husbands and wives.  Todorov's idea is the combination of personality traits and practical abilities that produces effective resistence to an overwhelming social climate of evil is beyond the range of a single individual, and that it requires a minimum of two people to act effectively in this kind of environment.Interestingly, Fry did organise a staff of incredibly courageous co-workers to help save his \"clients\", but the intriguing question is whether his very flaws were part of Fry's mysterious ability to distance himself from his society (ie American) and to plunge into effective action to resist Hitler's evil earlier than almost anyone else.This intriguing book is very rewarding and worthwhile.  I gave it 4 stars instead of 5 only because of an occasional passage in which the author, who seems to be almost super-abundantly talented, seems to stray into almost novelistic detail that would seem unlikely to be supported by his research.  This is mostly atmospheric, and doesn't cast a shadow on the facts themselves."}, {"review_sentiment": 5.0, "review_text": "I encourage anyone interested in WWII to read this book. Especially fascinating to me were the depiction of important characters in pre-war Europe. I gobbled the book, then started looking for more - I would advise against following this book with Varian Fry's own account of this period, because it seems like Marino covered it pretty well."}, {"review_sentiment": 5.0, "review_text": "Sometime, not-so-admirable people do incredibly admirable things, and find in themselves qualities that no one, themselves included, knew were there.  Such was the case of Varian Fry.In August 1940, Varian Fry boarded a  plane in New York and flew to Spain, and from there to Marseilles, on a  mission that would resonate far beyond his imagination.Fry was an  historian, involved with \"radical\" politics:  the Spanish Civil  War, the looming Holocaust.  He went from observing and writing about the  coming crises to actively participating in a way that no one who knew him,  or even he himself, would have anticipated.  Far from being identified as a  humanitarian, he was, in fact, an intellectual snob, a classicist by  training.But he put his life on the line in an effort to save the  leading cultural, intellectual, and artistic lights of Europe.  Truth to  tell, he had no idea what he was getting himself, or his New York sponsors,  into, so the evolution of this rather untouchable, remote aesthete into a  mover and shaker who consorted with the Marseilles underworld (and enjoyed  it!) and worked outside the law is fascinating to observe.Varian Fry was  personally responsible for saving the lives of, among others, Marc Chagall,  Lion Feuchtwanger, Victor Serge, Heinrich Mann, André Gide, Franz Werfel,  Andre Breton, Max Ernst, Hannah Arendt...  He also saved about 1500 other  lesser known people.  Altogether, in the year he spent in France before  being arrested and kicked out by the Vichy puppets of the Gestapo, he  turned himself inside out, discovering in himself a depth of caring and  feeling that neither he, nor most of the people who knew him, would have  suspected was present.The story itself is so riveting that the book  would have to be illiterate not to be absorbing.  I found it well-written,  with fascinating studies of the characters who worked with, and against  Fry.  It sort of fades out at the end, but then again, so did Fry, after  his return to New York.  He died in 1967, unrecognized for his work until  the year before his death.  In 1996, Israel further declared him  \"Righteous Among the Nations,\" the only American so honored."}, {"review_sentiment": 4.0, "review_text": "If you are interested in the dark events leading to the holocaust, especially French collaboration, this is an absorbing book.  For those not quite so familiar with Vichy France it will be an eye opener, for there can  be no doubt that many French officials bent over backwards to serve their  German masters during those shameful periodic roundups and deportations of  the Jews in France.  New to this reader, were the descriptions of the  horrible conditions of the \"refugee camps\" in Vichy-controlled  France. These were not the infamous concentration camps because detainees  could be released, but they were, nonetheless, death camps simply because  of shameful conditions and inhuman neglect.  In fact, some 3,000 Jews and  non- Jews died in those camps in southern France because of the atrocious  conditions.But French Vichy officials were not the only villains.  Americans may be surprised to learn just how anti-Semitic  U.S. officialdom  was during the early years.  One could argue that were it not for the  openly anti-Semitic treatment of Jews by our own State Department there  would be no book written about Varian Fry.  If all of the US officials in  France, in the Embassy and various consulates, had a mind set to save the  Jews it is quite likely thousands more could have been saved.  Varian Fry  filled a void.  He was fighting two battles, the enemy in France and the  enemy at home, in the form of the State Department.  It was a shameful  period, only fairly recently recognized by former Secretary of State Warren  Christopher.This book, about Varian Fry's rescue of the Jews under the  auspices of the American Emergency Rescue Committee, raises some questions.  Why was he not recognized sooner?  And why did many of those Jews rescued  seem to turn their backs on him, once saved?  Part of the answer is simply  that Fry is not a very heroic figure, not even particularly likable.  For  some he was distant, not easy to know, but he did what he had to do at the  time and that did not include being popular with everyone.  It is  unfortunate that personality flaws probably did play a role early on in the  assessment of his role in that period.  Even after reading this book, I  cannot shake an ambivalent view of Fry as a tragic figure caught very much  by accident in an heroic period.  Yet, what he did rightfully makes him a  hero. One must read this book to better understand that tragic period  and place.  Marseilles was the end of a funnel at the beginning of the war.  Jews from all over Europe were spilling into that port city, desperate to  get out, their backs against the Mediterranean wall, but not a non-Jewish  friend in sight to help.  Enter a few good people like Fry.  It  would  suffice to be a hero at that time in that place simply by feeling  compassion.  Elie Wiesel expressed it when he said, \"In those times  one climbed to the summit of humanity simply by remaining  human.\"There were other heros and heroines to be sure, the  cooperative police inspector, the compassionate Prefet official.  I had  just finished reading Mary Jayne Gold's Memoir of Marseilles, 1940-1941 in  which she recounts her version of that same rescue effort.  My feeling is  that she deserves a little better treatment than Marino gave her.  The fact  that Fry may have dismissed her should not diminish her contribution.  Although deceased now after a long life, she genuinely felt that those were  really the only useful years of her life.  (See Amazon.com for review of  her book, \"Crossroads Marseilles, Nineteen Hundred and Forty\" by  Mary Jayne Gold)In short, an absorbing well researched book.  Although many of the players on that Marseilles stage have now passed from  the scene, including Varian Fry, Marino had the good fortune of being able  to interview many of those still living.  The book is not at all pedantic,  but I do wish to thank the author for expanding my vocabulary with  \"spavined\" and \"solipsism\"."}]}, "authors": ["Andy Marino"], "isbn": "0312267673", "longitude": 0.0, "periods": ["1900s"], "title": "A Quiet American: The Secret War of Varian Fry", "word_cloud": "wonderful well write enlighten story know nothing wonderful important widely lesson true goodness bravery proud story single individual responsible save persecuted intellectual artists writer from grasp expand evil intellectual egoist fault upbringing sacrifice everything reason save inteligencia clutch evil deed humanity sake money real story fully document read well extremely well library throwing shelf stun incredible courage people know life line hint reward knowledge save humanity evil also offer insight live people hold rescue hopeless situation learn much inspire learn brave person scar repute say hear word reach pistol prolific looter art recent history take explanation happen read heroic attempt keep blowing brain detain certainly eventually kill intellectual wholesale sympathy art odd character earliest day easily manipulate parent let avoid school latest whim unusual substantial education writer journalist intellectual also use call neurotic number personality trait counterproductive ever productive bite hypochondria sometimes hard pressed make decision make friend lose small thing marry older woman relationship aspect detail make squirm bit manage accomplish day seem function high intelligence fierce energy oppose various personality go rescue transformation point amaze intellectual dilettante indulge personal whim become overnight indistinguishable harden trained operative tell happen almost certainly others process occur many try thing expect read difficulty sometimes impossibility chivy various intellectual reasonably simple give circumstance procedure tell low profile thing work parade restaurant bar others refuse simple instruction jib last moment nothing something quite stupid spend good deal time resource much bail individual repair replacing procedure put almost good true term literary contrast find also group british soldier capture prior men fit cheerful follow direction question solve problem remain successfully send home greater ordinary people become involved narrative sixty year go become frustrated inability charge get way trouble european end arrive safely begin babble arrangement make get others safely period full energy period crisis people go overdrive extend period time eventually collapse however manage work fiend month circumstance greatest stress never lose focus indeed able operate constraint think earlier life place case betray do substantial amount funding meet underworld boss take murder contract send home authority return intellectual life leave include neurosis counterproductive activity odd relationship eventual death obscurity obscurity partly matter official activity many year later honor apologize behalf obstructionism face save great many intellectual death provide mostly intellectual boost become successful screenwriter well find person absolutely invisible anyone look exploit greatest mystery story contradiction second greatest mystery save intellectual certain death much herd cat reviewer indicate excellent setting heroism environs permit oblique perspective unfold principally much farther north east overwhelm machinery seal boxcar gas chamber crematoria underlying cause come focus bureaucratic obstructionism department motivate partly national self interest partly genteel individual provide glimpse institutional behavior deadly underlying cause rise sympathetic behavior peasant live border petty police officer contrast callous often actively evil behavior official always central enigma complex difficult trouble man many way talented failure clear moral vision become catalyst save flower european artist writer clutch posit extreme moral situation basic moral unit effective action note rescuer risk life save rarely individual often husband wife idea combination personality traits practical ability produce effective resistance overwhelm social climate evil range single individual require minimum people act effectively kind organist staff incredibly courageous help client intrigue question flaw part mysterious ability distance society ie american plunge effective action resist evil earlier almost anyone intriguing reward worthwhile give star instead occasional passage author seem almost talented seem stray almost novelist detail unlikely support research mostly atmospheric cast shadow fact encourage anyone interested fascinate depiction important character gobble start look follow account period seem cover pretty well sometime people incredibly admirable thing find quality include knew such case board plane fly mission far historian involved radical politics spanish loom go observe write come crisis actively participate way know even identified humanitarian fact intellectual snob classicist put life line effort save lead cultural intellectual artistic light tell idea get sponsor evolution rather untouchable aesthete mover shaker consort enjoy work outside law fascinate personally responsible save life others also save lesser know people year spend arrest kick puppet turn discover depth care feel people know suspect story rivet absorb find fascinate study character work sort fade end return die unrecognized work year death declare honor interested dark event lead holocaust especially french collaboration absorb quite familiar eye opener doubt many french official bent backwards serve german master shameful periodic roundup deportation description horrible condition refugee camp infamous concentration camp detainee nonetheless death camp simply shameful condition inhuman neglect fact die camp southern atrocious french official villain learn officialdom early year openly treatment write official various consulate mind set save quite likely thousand fill void fight battle enemy enemy home form shameful period fairly recently recognize former rescue auspex raise question recognize sooner many rescue seem turn back save simply heroic figure even particularly likable distant easy know time include popular everyone unfortunate personality flaw probably role early assessment role period even read shake ambivalent view tragic figure catch much accident heroic period rightfully make hero understand tragic period place end funnel begin spill port city desperate get back wall friend sight help good people hero time place simply feel compassion express say time climb summit humanity simply remain human hero heroine sure cooperative police inspector compassionate official finish read recount version rescue effort feeling deserve little better treatment give fact diminish contribution decease long life genuinely felt really useful year life review short absorb well research many player stage pass scene include good fortune able interview many still live pedantic wish thank author expand vocabulary spavined solipsism", "genres": ["Biography", "History", "WWII"], "summary": "The story of Varian Fry, called the \"real Rick\" of Casablanca, is perhaps one of the most unknown, yet extraordinary sagas of World War II. \r\n\r\nThis penetrating biography follows Varian Fry through his adult life--from his beginnings in the 1930s as a Harvard graduate and political journalist to his arrival in Marseille in 1940 where he managed to spirit away thousands of Europe's cultural elite by falsifying passports, creating new identities, and always resorting to subterfuge. \r\n\r\nThe list of those saved includes: Hannah Arendt, Andre Breton, Franz Werful and his wife Alma Mahler, Heinrich Mann, Marc Chagall, Jacques Lipchitz, Andre Masson, and Max Ernst among others.", "asin": "0312267673", "rank": "2102964", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51WG2RHMTTL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}