{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 33.9550905, "ratings": {"num_ratings": 7, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "I bought this book at Atlantis Books in Oia, Santorini -- years ago -- on the recommendation of the bookseller. But it must've stuck with me, because I was just thinking about this author's prose -- somehow frank and lyrical at the same time -- and remembering vivid bits of these stories, completely out of the blue today. Anyway, grateful to the indie store that turned me on to this author, and I realize I want to revisit this collection."}, {"review_sentiment": 5.0, "review_text": "Panos Karnezis' writing is original, poetic and fantastic. It is hard to believe that he is writing in his adopted language. The stories are vivid and the protagonists are alive. You may test the dust off the village square in your mouth or hear the voices of the people loud in your ear. The topics are not far from the reality of the near Greek past, but they could be transplanted anywhere in the world. The book is a page-turner. Do not jump to the last pages!"}, {"review_sentiment": 5.0, "review_text": "Stories from what must be a typical Greek village revealing the happy and sad very real experiences, much like the days of my youth when I visited my grandparents on an island off the coast of New Brunswick."}, {"review_sentiment": 3.0, "review_text": "Last year I read Karnezis' novel The Maze, and although I found it rather uneven and a little baroque, I thought this earlier and more modern collection of short stories might be more to my taste. (Being 1/4 Greek, I feel obligated to try and dip into a little fiction from there every now and then.) However after finishing most, but not quite all, of the stories in this collection, I found myself similarly unmoved by the semi-gothic storytelling, which shows heavy influences of Borges and Calvino, among others.Set sometime after WWII and the Greek Civil War (presumably in the 1950s), the stories all take place in a small village (too poor to even have a name) in an anonymous region, and are framed by episodes of biblical woe. The book begins with a story of the the town being stricken by an earthquake. One of the consequences is that the local priest is shown to be a fraud, and so the story is suggesting a literal attempt to shake the town awake to the coming modernity. Near in the middle, drought wreaks destruction upon the land. Then in the final story, when the stubborn villagers have demonstrated their loyalty to traditional ways, the village is washed away under a new hydroelectric project. A little gimmicky and unsubtle perhaps, but not a bad way to frame such a collection. I'm sure those with a religious background could spot many more allusions throughout the book.The stories are mostly little character studies or morality tales, sometimes ending with a jolt, sometimes with a whimper -- but very often suffused with a sense of magic possibility that gives them the timbre of more than mere reportage. Among those we meet are the priest, the doctor, the whore, the barber, the pimp, the spinster, the farmer, the barkeeper, the station agent, the landowner, the virgin, the bus driver and so on. Revenge is a running theme, and a number of the stories end with a punchline in which someone gets their (sometimes lethal) just deserts. Karnezis writes with a sly, dark wit, and the humor is one of the better elements of the collection. Another running theme is the danger of outsiders, for in almost every case, when the villagers interact with outsiders, bad things result. From two incidents of petty theft, to swindles, the indifference of regional bureaucrats, to the menace of a pair of gun-toting hunters. Elements of Greek mythology appear as passing characters as well, including a centaur and a mermaid. I'm not a big fan of magical realism, and so the stories where that became more prominent were of lesser interest. None of the stories made a particularly huge impression, and it's one of those books I doubt I'll recall having read in a year or so. However, it may definitely posses greater to charms for other readers."}, {"review_sentiment": 5.0, "review_text": "I once heard a story about a southern writer -- may have been Flannery O'Connor or Eudora Welty -- who, in response to a foolish complaint that her stories contained far too many freaks and monsters, declared that this was because in the South they can still tell a freak when they see one. This book by Panos Karnezis not only recognizes freaks and monsters but also tries to explore what makes them what they are, thus bringing out the beeauty of their basic humanity as well as their brokenness. This exploration is enormously, sometimes shockingly successful as the author unleashes his expansive, explosive imagination on a Greek town so poor it doesn't even have a name. He involves all the reader's senses, even smell and touch, to describe how his characters make what seem to them reasonable moral decisions and lay out what they consider logical plans for the future they will never have. Their reason and logic is of course the ethos of poverty and ignorance, which is what largely characterizes their existence. The reading public has reason to celebrate Karnezis's arrival on the literary scene. As I understand it, he is still under forty. Good grief."}, {"review_sentiment": 5.0, "review_text": "These strikingly original short stories are set in a small village in Greece, \"so poor it doesn't have a name\". They are extraordinary: shocking, colourful, amusing, resonant and sometimes tragic. Although Panos Karnezis writes in his second language, his style is fresh and lyrical and he has enriched and subverted English making it into a delight to read. He has created unforgettable characters and has cast a sharp eye on contemporary Greece. He is a master of the genre, like James Joyce, Raymond Carver or Guy de Maupassant."}, {"review_sentiment": 5.0, "review_text": "No slacker, Karnezeis packs 19 stories into this small, 281-page book. The stories are set in a Greek village in the 1950's. Although it contains less than 40 houses, and thus is about to be deprived of official existence, it contains an amazing assortment of personalities, from spinster to prostitute, from priest to thief to pimp. Each has his own hopes and fears. All must cope with an earthquake, a drought and the obliteration of the village by a new dam and reservoir. As many authors, Karnezeis has trouble with endings, sometimes leaving the reader to guess at them and sometimes lacking credibility. Not a native speaker of English, the author muffs a few idioms, as when a character stands on her heels to reach an object overhead. Nevertheless, the work is fascinating and absorbing."}]}, "authors": ["Panos Karnezis"], "isbn": "0312421540", "longitude": -83.3881868, "periods": ["1900s"], "title": "Little Infamies: Stories", "word_cloud": "buy year ago recommendation bookseller think author prose somehow frank lyrical time remember vivid bit completely blue today grateful indie store turn author realize want revisit collection write original poetic fantastic hard believe write adopt language vivid protagonist alive dust village square mouth hear voice people loud topic far reality past anywhere world jump last page typical greek village reveal happy sad real experience much day youth visit grandparent coast last year karnezis find rather uneven baroque think earlier modern collection short feel obligated try dip fiction however finishing quite collection find similarly unmoved storytelling show heavy influence sometime presumably take place small village poor even name anonymous region frame episode biblical woe begin story town stricken earthquake consequences local priest show fraud story suggest literal attempt shake town awake come modernity middle drought wreaks destruction land then final story stubborn villager demonstrate loyalty traditional way village wash away new hydroelectric project gimmicky unsubtle perhaps bad way frame collection sure religious background many allusion mostly character study morality tale sometimes end jolt sometimes whimper often suffused sense magic possibility give mere reportage meet priest doctor barber pimp spinster farmer station agent landowner virgin bus driver run theme number end punchline someone get sometimes lethal desert write sly dark wit humor better element collection run theme danger outsider almost case villager interact outsider bad thing result incident petty theft swindle indifference regional bureaucrat menace pair hunter element greek mythology appear pass character well include centaur mermaid big fan magical realism become prominent lesser interest none make particularly huge impression doubt recall year however definitely greater charm reader hear story southern writer response foolish complaint contain far many freak monster declare still freak recognize freak monster also try explore make thus bring beauty basic humanity well exploration enormously sometimes shockingly successful author unleashes expansive explosive imagination town poor even name involve sens even smell touch describe character make seem reasonable moral decision lay logical plan future never reason logic course ethos poverty ignorance largely characterize existence read public reason celebrate arrival literary scene understand still forty good grief strikingly original short set small village poor name extraordinary shock colorful amuse resonant sometimes tragic write second language style fresh lyrical enrich subverted making delight create unforgettable character cast sharp eye contemporary master genre slacker pack small set greek village contains le house thus deprive official existence contains amaze assortment personality spinster prostitute priest thief pimp hop fear earthquake drought obliteration village new dam reservoir many author trouble ending sometimes leave guess sometimes lack credibility not native speaker author muff idioms character stand heel reach object overhead work fascinate absorb", "genres": ["Fiction & Literature", "Humour"], "summary": "Cunning, fantastical tales about a Greek village of the imagination, from a startling new talent\r\n\r\nPanos Karnezis' remarkable stories are all set in the same nameless Greek village. His characters are the people who live there--the priest, the whore, the doctor, the seamstress, the mayor--and the occasional animal: a centaur, a parrot that recites Homer, a horse called History. Their lives intersect, as lives do in a small place, and they know each other's secrets: the hidden crimes, the mysteries, the little infamies that men commit.\r\n\r\nKarnezis observes his villagers with a worldly eye, and creates a place where magic invariably loses out to harsh reality, a place full of passion, cruelty, and deep reserves of black humor. These stories recall the masters of the form--the wit and sophisticated playfulness of Saki and the primal fatalism of Prosper Merimee--but they are utterly original and prove that Karnezis is one of the freshest new voices in English fiction.\r\n\r\n\"These fierce, twisted, and darkly funny stories are set in an unnamed Greek village, in what might be called the eternal present. Karnezis, a Greek writing in English, has a sharp, unsentimental eye for contemporary Greek life, while deftly adding intimations of the pagan past, as when a centaur in a travelling circus demands a raise. The connecting thread here is the spectacular untrustworthiness of the village's inhabitants, who are as wily as Odysseus: Father Yerasimo, the deeply pragmatic priest, engineers a miracle in front of a visiting bishop to impress his congregation; the one-armed Dr. Panteleon finds a loophole in the Hippocratic oath.\" The New Yorker", "asin": "0312421540", "rank": "2714524", "city": "Athens", "image": "https://images-na.ssl-images-amazon.com/images/I/51Fxws-nnvL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}