{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 226, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Interesting travelogue."}, {"review_sentiment": 5.0, "review_text": "Highly recommended !!!"}, {"review_sentiment": 5.0, "review_text": "What  a well written journey!  Totally honest and forth telling.  The author met many trials and tribulations on his voyage back to his native land, but...he is definitely a survivor!  I loved learning more than I knew (at this date) about Vietnam. As a budding sociologist, it was very interesting.  I am so glad that I came upon this book!  You will learn a lot by reading it too, if you are from the West.I absolutely loved it....5 stars!"}, {"review_sentiment": 5.0, "review_text": "What an excellent book! I read this during my travels in Vietnam. It is written in a sincere and engaging manner. A memorable story written in an authentic and beautiful way."}, {"review_sentiment": 5.0, "review_text": "I would recommend this book to all Vietnamese Americans and anyone who is interested in learning about the internal conflict Vietnamese Americans go through from having to live in two different worlds: the rooted Vietnamese culture vs the Western world.  Andrew also talks about the struggle between Vietnamese people living in Viet Nam vs those living in the United States."}, {"review_sentiment": 5.0, "review_text": "what a great freaking story."}, {"review_sentiment": 5.0, "review_text": "One of the best travel memoirs I read. I was glad I read it while traveling just before traveling to Vietnam. Although a bit dated, this book was a wonderful read nonetheless. The writing itself is top quality. I loved the flashbacks packed into the current story. After reading this book, I felt I knew so much about Vietnam, its people and the author. Masterpiece."}, {"review_sentiment": 5.0, "review_text": "CATFISH AND MANDALA Is a magical memoir, a wonderful story of Andrew's journey from Vietnam to America and back again with a detour around Japan. Growing up as a boat person, then gang banger in East San Jose before his bicycling the length of Viet Nam, his memoir here is a search for identity, which he shares with us with so many of the outrageous encounters he encounters in his travels. Sprinkled with amazing meals and an appreciation of Vietnamese food that some will find discomfiting, they also serve as a prelude to his later cookbook. This book is a recounting of his family's travails and provides a keen, lyrical insight into one sensitive person's immigration and identity experience. A wonderful read--enjoy."}, {"review_sentiment": 5.0, "review_text": "I read this while touring around Vietnam and really enjoyed it.  Very well written, engaging, and moving - leaving you with some great words of wisdom along the way."}, {"review_sentiment": 5.0, "review_text": "Works as advertised. Thank you!"}]}, "authors": ["Andrew X. Pham"], "isbn": "0312267177", "longitude": 0.0, "periods": ["1900s"], "title": "Catfish and Mandala: A Two-Wheeled Voyage Through the Landscape and Memory of Vietnam", "word_cloud": "travelogue highly recommended well write journey honest forth tell author meet many trial tribulation back native land definitely survivor love learn know date bud sociologist interest glad come learn lot read absolutely love star excellent travel write sincere engage manner memorable story write authentic beautiful way vietnamese anyone interested learn internal conflict vietnamese go live different world root vietnamese culture v world also talk struggle vietnamese people live vs live great freak story best travel memoir glad travel travel bit dated wonderful nonetheless writing top quality love flashback pack current story read felt know much people author magical memoir wonderful story journey back detour grow boat person gang banger bicycle length memoir search identity share many outrageous encounter encounter travel sprinkle amazing meal appreciation vietnamese food find discomfiting also serve prelude later recount family travail provide keen lyrical insight sensitive person immigration identity experience wonderful enjoy tour around really enjoy well write engage move leave great word wisdom way work advertise", "genres": ["Memoir", "Travel Writing"], "summary": "A New York Times Notable Book of the Year 2000\r\n\r\nCatfish and Mandala is the story of an American odyssey―a solo bicycle voyage around the Pacific Rim to Vietnam―made by a young Vietnamese-American man in pursuit of both his adopted homeland and his forsaken fatherland.\r\n\r\nAndrew X. Pham was born in Vietnam and raised in California. His father had been a POW of the Vietcong; his family came to America as \"boat people.\" Following the suicide of his sister, Pham quit his job, sold all of his possessions, and embarked on a year-long bicycle journey that took him through the Mexican desert, around a thousand-mile loop from Narita to Kyoto in Japan; and, after five months and 2,357 miles, to Saigon, where he finds \"nothing familiar in the bombed-out darkness.\" \r\n\r\nIn Vietnam, he's taken for Japanese or Korean by his countrymen, except, of course, by his relatives, who doubt that as a Vietnamese he has the stamina to complete his journey (\"Only Westerners can do it\"); and in the United States he's considered anything but American. \r\n\r\nA vibrant, picaresque memoir written with narrative flair and an eye-opening sense of adventure, Catfish and Mandala is an unforgettable search for cultural identity.", "asin": "0312267177", "rank": "116234", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51PUDPtDD7L.jpg", "country": "Hanoi", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}