{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 185, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "A brilliant, sprawling novel with many characters who have intertwined stories to tell. Settle in, prepare to be transported from Mexico City to Spain, to San Diego, California, and then back to Mexico City."}, {"review_sentiment": 5.0, "review_text": "just as expected"}, {"review_sentiment": 3.0, "review_text": "Imagine Holden Caulfield aging and discovering that he is going to have to give up a lot of his rebellious posing and cynicism in order to live in the world. Except for the self-sacrifice of the mysterious female poet described at the end, though actually occurring earlier in the timeline of the novel, the bohemian characters do not seem to have grown much; making the reader think that that incident is unremarkably like all others in their drug-addled world. The would-be poets in this novel have little commitment to their art and constantly put down greater artists than themselves in trying to create a \"movement\" that seems to be a substitute for their feeble political activities. In this sense, the novel is really an excoriation of a certain class of Latin American \"activist\" and is reminiscent of their norteno compatriots who marched for civil rights in the Sixties, while presenting themselves as the next wave of American artists. Didn't they all end up working on Wall Street?"}, {"review_sentiment": 5.0, "review_text": "One of the best books I have ever read."}, {"review_sentiment": 5.0, "review_text": "I liked it, and I don't know why I liked it, which doesn't matter much anyway, period. It’s been four months, and I still think about it--the characters driving through the Sonoran desert, sword fighting on a Spanish beach, and drifting along the moonlit streets of Mexico City. The book is deeply weird, it is gloriously dark, and it is absolutely brilliant."}, {"review_sentiment": 5.0, "review_text": "A dense piece of writing, but so worth the effort."}, {"review_sentiment": 5.0, "review_text": "Beautifully written, fun, adventure that I have been savoring for the past few weeks. I am definitely going to gift it to a bunch of my friends."}, {"review_sentiment": 1.0, "review_text": "Didn't like it enough to get past 25%."}, {"review_sentiment": 4.0, "review_text": "strange and wonderful"}, {"review_sentiment": 5.0, "review_text": "I liked the whole book in general. His voice is so intense and reminiscent of all the 70's writers. I would say read and enjoy the ride."}]}, "authors": ["Roberto Bolano"], "isbn": "0312427484", "longitude": -99.1333416, "periods": ["2000s", "Recent Releases"], "title": "The Savage Detectives: A Novel", "word_cloud": "brilliant sprawl many character intertwine story tell prepare transport back expect age discover go give lot rebellious pose cynicism order live world mysterious female poet describe end actually occur earlier timeline bohemian character seem grown much make incident unremarkable others world poet little commitment art constantly put greater artist try create movement seem substitute feeble political activity sense really excoriation certain class latin american activist reminiscent norteno compatriot march civil right present next wave american artist work best ever like know like matter much anyway period month still think character drive desert sword fight spanish beach drift along moonlit street deeply weird gloriously dark absolutely brilliant dense piece write worth effort beautifully write fun adventure savor past week definitely go gift bunch friend enough get strange wonderful like whole general voice intense reminiscent writer ride", "genres": ["Fiction & Literature"], "summary": "In this dazzling novel, the book that established his international reputation, Roberto Bolaño tells the story of two modern-day Quixotes--the last survivors of an underground literary movement, perhaps of literature itself--on a tragicomic quest through a darkening, entropic universe: our own. \r\n\r\nThe Savage Detectives is an exuberant, raunchy, wildly inventive, and ambitious novel from one of the greatest Latin American authors of our age.", "asin": "0312427484", "rank": "50885", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZGr1DBSLL.jpg", "country": "Mexico", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}