{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 57, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Just fantastic!"}, {"review_sentiment": 5.0, "review_text": "Glenn Meade does it again in this WWII thriller. It takes place in North Africa. President Roosevelt is about to stay the night in Cairo while making his journey to Tehran to meet with Allied leaders Churchill and Stalin. It is soon learned the Germans plan a military raid on the hotel he will be staying at with none other than the famous commando Otto Skorzeny leading the raid. Skorzeny rescued Mussolini from the Gran Sasso, so if anyone can pull this off it's him!Three characters, one American, two German (one of them female) are intertwined in this tale. They visited Cairo years earlier during an archaeological dig. The war and their experiences have brought them together, but on opposite sides. The woman is the tip of the triangle. She's beautiful, intelligent, cunning, and in love with both, but must choose one, all while carrying out a dangerous operation that can cost all of them their lives.I enjoy the authors' books. WWII is a special favorite of mine to read (I'm writing a book about an event in North Africa), and you can easily see how Meade has done his research. The events actually took place, I believe. Even though we know how WWII ended, I found myself on the edge of seat, page after page, wondering if the president would survive this ordeal. I highly recommend this book. It has action, suspense, mystery, romance. You won't be disappointed.David Lucero, author"}, {"review_sentiment": 1.0, "review_text": "It had foul language which I did not appreciate."}, {"review_sentiment": 5.0, "review_text": "When I started this book I had no idea it woulld turn out to be such a terrific thriller. Fast paced and imaginative, travelling from Egypt to Germany in WWII and in the present, it was a well done, exciting page turner. I plan to read more by this author."}, {"review_sentiment": 5.0, "review_text": "I've read all of Glenn Meade's novels.  This one stands out as one of my favorites for several reasons.  For one, the writing is superb- great descriptions that will make you think you just watched the movie and a good flowing plot.  The historical references are intriguing as well and by the time you finish there is a substantial feeling of satisfaction from the time put into reading the novel.  While I enjoy all of his novels, this one I can say with certainty that it is definitely a good read."}, {"review_sentiment": 5.0, "review_text": "If you are into history, antiquity, espionage and World War II this is your book. Very richly written novel that puts you into the back pockets of the characters and scenes. If you ever wanted to explore Egypt or go deep into the heart of the minds of German and U.S. intelligence during World War II read \"The Sands of Sakkara\""}, {"review_sentiment": 4.0, "review_text": "Sands of Sakkara is set in 1943. The war is starting to go bad for the Nazis, so they decide to launch an audacious plot to murder U.S. President, Franklin D. Roosevelt, as he meets British Prime Minister, Winston Churchill, for a conference, in Cairo. They hope this assasination will turn the tide of war back in their favour.Enter the books main characters, Harry Weaver, Jack Halder, and Rachel Stern. Three people from different backgrounds, who became close friends, during an archelogical dig, in Egypt, back in 1939. However, the fortunes of war sees them on opposing sides, and their friendships tested to the limit.I found this book an enjoyable read, with a relentless pace, particularly towards the end. Character development is good, and I really felt for two of the protaganists, in particular, and the desperate situation that they had been forced into, by the Nazis.The only drawback to the book, I felt, was that there was an element of 'Keystone Cops' at times, when the authorities were trying to chase down the spies. Overall, though a good read."}, {"review_sentiment": 3.0, "review_text": "In the same line of  \"The Day of the Jackal\" Meade offers an entertaining WWII thriller. The story is a little farfetched, another conspiracy to assassinate one world leader and change the course of the war. Nobody has done that better than the original Frederick Forsight. But the recreation of Africa on the verge of War is still first rate.If you are not very demanding and forgive some plot holes this will make a very nice reading and you will enjoy the adventure, heroism and romance"}, {"review_sentiment": 2.0, "review_text": "the plot to make did not make any sense.send two people who hate hitler and his cause to kill Roosevel and Churchill.the germans in this book are portrayed as pure evil.like in the starwars series where the sith and darth vader are pure evil.it seems to may as yet another copy of The Day Of The Jackal where one man can change the course of history and bla bla bla.even though The Jackal is by far the best book I ever read.as i already mentioned, the germans are potrayed as pure evil and the allies as pure saints.the plot doesn't make much sense as i don't see the dificulty of assassinting two men.if your german, DON'T READ THE BOOK.if you hate germans, you'll love to see how \"coldblooded\" they are.instead, read The Day Of The Jackal if you like them conspiracies."}, {"review_sentiment": 4.0, "review_text": "This is a wonderful World War II story. It is unique in that it details the attempted assassination of Roosevelt and Churchill by the Germans, during their Cairo Conference in Egypt. There are three key characters in the book, Jack, Rachael and Harry, who were friends, and at times lovers, before the outbreak of the war. Each is extremely well developed, as are the convoluted and at times desperate relationships between the three of them. The story essentially deals with a contest between Jack, who has been dispatched to Cairo by the SS with the task of carrying out the assassinations, and Jack, who has been assigned (by US military intelligence) the task of preventing the assassinations from happening. This novel is a wonderful combination of suspense and adventure, set in wartime Berlin and Cairo, and I believe that Meade has done an excellent job of describing the atmosphere of those two locations during World War II. The novel is classical Glenn Meade and I wholeheartedly recommend it."}]}, "authors": ["Glenn Meade"], "isbn": "0312202016", "longitude": 31.243666, "periods": ["1900s"], "title": "Sands of Sakkara", "word_cloud": "just fantastic thriller take place stay night make journey meet leader soon learn plan military raid hotel stay none famous commando lead raid rescue anyone pull character german female intertwine visit year earlier archaeological dig war experience bring together opposite side woman tip triangle beautiful intelligent cunning love carry dangerous operation cost enjoy author special favorite mine write event easily do research event actually take place believe even know end find edge seat page page wonder president ordeal highly recommend action suspense mystery romance author foul language appreciate start idea would turn terrific thriller pace imaginative traveling present well do exciting page turner plan author novel stand favorites several reason write great description make watched movie good flowing plot historical reference intrigue well time finish substantial feel satisfaction time put read enjoy novel say certainty definitely good history antiquity espionage richly write put back pocket character scene ever want explore go deep heart mind german intelligence set war start bad launch audacious plot murder meet british conference hope assassination turn tide war back main character people different background become close friend archaeological dig back however fortune war see oppose side friendship test found enjoyable relentless pace particularly towards end development good really felt protagonist particular desperate situation force drawback felt element time authority try chase spy good line offer entertain story little far fetched conspiracy assassinate world leader change course war do better original recreation verge still first demand forgive plot hole make nice reading enjoy adventure heroism romance plot make people hate lither cause kill german portray pure star wars series hit darth vader pure seem yet copy man change course history alb alb far best ever already mention german portrayed pure evil ally pure plot make much sense see difficulty assassinate german hate german love see coldblooded conspiracy wonderful story unique detail attempt assassination key character friends time lover outbreak war extremely well develop convolute time desperate relationship story essentially deal contest dispatch task carry assassination assign military intelligence task prevent assassination happen wonderful combination suspense adventure set wartime believe do excellent job describe atmosphere location classical wholeheartedly recommend", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII"], "summary": "To save the Western Allies, he must kill the woman he loves...\r\nNovember 1943: Adolf Hitler sanctioned his most audacious mission ever--to kill US President Franklin D. Roosevelt and Prime Minister Winston Churchill as they visit Cairo for a secret conference to plan the Allied invasion of Europe, an invasion which threatens imminent defeat for Germany. This really happened and is the basis for Glenn Meade's spectacular new novel.\r\n\r\nOnly one man is capable of leading the defiant Nazi mission--Major Johann Halder, one of the Abwehr's most brilliant, daring agents, a man with a tortured soul and a talent for the impossible. Accompanied by an expert undercover team, and a young and beautiful Egyptologist, Rachael Stern, Halder must race against time across a hostile desert, to reach Cairo and successfully carry out the assignment, or forfeit his own life and that of his young son.\r\n\r\nWhen US military intelligence learns of the plan, they assign one of their best officers, Lieutenant-Colonel Harry Weaver, to hunt down and eliminate Halder and his team. But for Weaver, as for Johann Halder and Rachael Stern, there's more than just the balance of war and the lives of the Allied leaders at stake--a pact of love and friendship is about to be tested in a frantic, high-stakes chase to the death.\r\n\r\nGlenn Meade's long-awaited new novel Sands of Sakkara is a breathless, suspenseful thriller with one of the most remarkable chases in recent memory. It is a heart-wrenching tale of friendship, love and treachery set against the exotic and intriguing backdrop of wartime Egypt.\r\n\r\n\"Deftly orchestrated...one long, twisty, breathless chase...tough to put down.\" The New York Times", "asin": "0312202016", "rank": "1787189", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZCDHCM51L.jpg", "country": "Egypt", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}