{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 1118, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "\"The Hare with Amber Eyes\" turned out to be one of the most profound books I have ever read.I picked up this book reluctantly as our book club's choice, and was amazed to find the book dealt with many profound questions I've been thinking about for several years. Having expected a book about pottery and figurines, I found instead a multi-generational family saga that was so well-written that I felt I lived life right next to the participants. I walked the streets of Paris in the 1870s; I lived in Vienna from the 1880s into the Second World War. I returned to postwar Japan (where I actually lived as a small child) and saw it again from an adult's point-of-view. The history of who owned the collection of figurines over time is used as a writer's device to investigate and follow the lives of the people in this saga. But we also learn a bit about netsuke (the figurines) from an expert artist, the author.This book is essentially a modern European history, told from the point-of-view of a fabulously wealthy Jewish dynasty, over four generations, which originated in Odessa, and spread out in a network through Paris and Vienna. It is a viewpoint which adds a lot to my understanding of European history, and seen from a personal viewpoint, rather than from a political viewpoint. From the very first page it was a hard book to put down.There was so much in this book--far too much to write about in a review--so I will just list below a very few of the themes which were of personal meaning to me:--Interesting ways for grandparents to spend meaningful time with their grandchildren--Interesting details of Japanese culture I had never come across--How family dynasties worked, and how and why having more children used to be considered an \"asset\"--Where the roots of anti-Jewish sentiment came from in Europe--How racial prejudice in America is very similar to Jewish prejudice in Europe (the author does not say this; it is my interpretation)--We get to meet many famous historical figures personally, such as famous impressionist artists and writers in Paris, or even young Adolph Hitler in Vienna--How rich families of the past educated their children at home; what was expected from their education; how their education contributed to their success as individuals, as a family, and as a dynasty--How their education into the family business was handled--The life of secular Jews--How progroms happened when Jews did not integrate; how they happened EQUALLY where Jews DID INTEGRATE--1870s Parisian culture and gossip--Collecting art of all kinds, and how it became popular to also collect Japanese art--Effects in Japan of Commodore Perry's forcing the country to \"open\"--How \"working\" was seen as \"shameful\" in fashionable society among the upper classes in Paris of that time--Wonderful ideas about how anyone can improve their personal lifestyle to bring themselves more happiness (examples: hanging pictures on the walls of one's friends; regular meetings with friends to discuss intellectual ideas; activities one can do with friends to add happiness to one's life).--How the wealthy Jews of Paris and Vienna provided the capital to build much of the city; they were a source of capital for emperors and kings' grand projects.--The Jews worked very, very hard for their success; yet, when they became successful, instead of appreciating their productivity and contributions to society, the society turned against them, and they were blamed out of jealousy for their success and newfound and well-earned power. They were essentially viewed as \"arrogant upstarts,\" \"not staying in their place.\" It reminded me of those whites in America who view hardworking, educated, successful blacks the same way, as \"upstarts, not staying in their place.\" (The aughor does not say this, but as an American, this is my interpretation.)--As an American living overseas, I never understood Europe's animosity to the Jews. Now, I think I do. It's a combination of today's animosity and toward large corporations, and crooked people in finance, rolled together with racism wanting to keep that group on the bottom, \"knowing their place,\" no matter how educated or successful they are. Before, I couldn't understand my fellow Americans' animosity toward President Obama, and after reading this book, I think I see where it is coming from. (My interpretation, not the author's)--I had heard of the Dreyfus Affair, but here, learned all about it, and how unfair and wrong it was.--Anti-Semitism in Paris was different from anti-Semitism in Vienna, and the book explores the differences.--Why European City Walls became obsolete, and when (it was NOT airplanes; it was gunpowder and cannon).--Young Adolph Hitler: twice rejected from art school; how he came to loathe democracy; how he was a draft dodger and worked for a time as a street peddler; how he became a right-wing extremist, how he was actually Austrian, from Vienna.--Events and feelings leading up to the Jewish progroms (state-sanctioned riots against Jews) in Vienna in 1938--How the \"Jewish Question\" is really a question of societal bullying (my interpretation)--Why the Jews seem to be so successful in every country (their culture, their education, their very strong work ethic, their helping each other as extended family)--these are all the values we HIGHLY VALUE in America. I can see why America is a good place for Jews, as their capitalistic ethics fit perfectly with our American capitalistic society. European society (then and now) often seems to OPPOSE capitalistic ethics (and now corporate ethics, which are the modern-world equivalent) (my interpretation, not the author's)---Insight into SOCIETAL CONFLICTS that must be dealt with IN ALL SOCIETIES: (urban vs. rural; modern vs. traditional; status based on who you or your family are vs. status based upon your personal accomplishments; rewarding productiveness as a society vs. promoting egalitarianism).--How inequality was increasing during the two generations before the progroms, and how perhaps inequality leads to riots at some point (But what point becomes the tipping point? I'm not yet sure...)--Examples of how the Jews were bullied and harassed--How Germany came to unite with Austria; how most Austrians wanted it and were equally culpable. Germany was NOT the ONLY country with extremist right-wing white-supremacy movements.--Possible lessons for expatriates living outside of their home countries: If you are a minority (racial, religious,), even if you have taken citizenship in a new country, conditions could change where you might not be safe. It's always wise to keep some money or investments in two or three countries where you could go in time of trouble or sudden revolution; it's better to walk away IMMEDIATELY (get out THAT FIRST DAY) and leave all your possessions behind--those who don't, often do not manage to get out at all, and still lose all their possessions in the end.--Mental resilience is something which should be cultivated and encouraged in our children--we never know what life will throw at us in order to be able to get back up and go on, sometimes even in old age. Those who are not resilient often end up committing suicide.--Anti-intellectualism in Austria among the common populace (reminded me of anti-intellectualism in America today)--Surprising things about Hitler's Austria I learned from this book: That Hitler called free elections with secret ballots, and really believed in elections; how he implemented Germany's new National Labor Law and the Reich's Comprehensive Social Security System Law (guaranteed basic rights in the workplace, afforded protection from arbitrary dismissal, extended health care benefits to the working class). Cultural and artistic life was promoted and encouraged. Unemployment fell from about 33% in 1938, before the Anschluss, to only 1;2% in 1940. With all of these changes, one could understand why ordinary people might be ecstatic. ( These facts were never covered in any history classes I had, thus leaving us all wondering how people could have voted for the Nazi Party. Clearly this explains a lot of it.)--Why some cultures keep everything private (such as even their homes)--Detailed descriptions of the nights of progroms from the Jewish point-of-view (the night of Hitler's entrance into Austria, and the later Kristallnacht --The Night of Broken Glass.--How some of the Ephrussi died; how some lost all their property, how others escaped with only the clothes on their back after a long year of tribulations; how one committed suicide. What happened to the survivors and their children, and how children and grandchildren rebuilt their lives again in various countries.--Alfred Rosenberg and his Institute--Adolph Eichmann, and the story of how he began as a bureaucrat \"who just wanted to be good at his job\"--Origin of the Sudetenland, and why they wanted to join with Germany (they wanted all those same benefits Austria got, as listed above)--Fascinating story of how the netsuke were saved, and how this was the author's only real inheritance from his illustrious family; the story of being given these and a few family documents his father had received led the author on the whole exploration of his family history.--How Austria was never called to account after WWII (the way Germany was), but how they SHOULD have been--Life in Tokyo with the brother who escaped Germany (and ran away from the family) in about 1932 or 1933. He went to Paris, learned to become a designer, then moved to New York to design. He later became an American citizen to serve in the Army to serve in the Intelligence Division due to his knowledge of several languages. He was later sent to Japan, learned fluent Japanese, and ended up settling there for the rest of his life. The author visits his great-uncle in Tokyo (who is an old many in his 80s when the author is a young pottery artist in his 20s). There, the author learns all about netsuke, and eventually inherits the collection after his great-uncle passes away.In short, this was one of the most useful and interesting books I've ever read. I learned so much that I never knew about many, many aspects of life. I would give this book my highest recommendation."}, {"review_sentiment": 3.0, "review_text": "Interesting story but not really well written."}, {"review_sentiment": 5.0, "review_text": "fantastic book"}, {"review_sentiment": 3.0, "review_text": "Too long and detailed in a boring way. I struggled reading the first 70% of the book giving all details of rich and excessive lifestyle if the members of the family. The last 20% made it worthwhile. Still feel that the most important message could be delivered in half the volume."}, {"review_sentiment": 5.0, "review_text": "Best read with a dictionary next to you.  I learned so many new words.  Now in my top 10 books ever."}, {"review_sentiment": 2.0, "review_text": "Parts of it I found interesting, other parts very tedious and seeming to go on forever. I found myself waiting for the book to END ___ and it FINALLY did!,"}, {"review_sentiment": 1.0, "review_text": "Boring read"}, {"review_sentiment": 5.0, "review_text": "This is my favorite book I have ever read. I read it twice just to savor the delicious details."}, {"review_sentiment": 3.0, "review_text": "The story is very interesting. It takes almost half the book to introduce characters, describe the cities, and what the Netskies were.  The last half moves along at a faster pace.  The author was really dedicated to the journey of the Netskies."}, {"review_sentiment": 1.0, "review_text": "I am not sure what the thesis of this book was. Very thom story line and I found the writing overblown often and pretentious"}]}, "authors": ["Edmund de Waal"], "isbn": "0312569378", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Hare with Amber Eyes: A Hidden Inheritance", "word_cloud": "turn profound ever pick reluctantly club choice amaze find dealt many profound question think several year have expect pottery figurine find instead family saga felt live life right next participant walk street live return actually live small child saw history own collection figurine time use writer device investigate follow live people saga also learn bit netsuke figurine expert artist essentially modern european history tell fabulously wealthy dynasty generation originate spread network viewpoint add lot understanding european history see personal viewpoint rather political viewpoint first page hard put much far much review list theme personal meaning way grandparent spend meaningful time grandchild interest detail japanese culture never come family dynasty work child use consider asset root sentiment come racial prejudice similar prejudice author say interpretation get meet many famous historical figure personally famous impressionist artist writer even young rich family educated child home expect education education contribute success individual family dynasty education family business handle life secular pogrom happen integrate happen culture gossip art kind become popular also collect japanese art effect force country open work see shameful fashionable society upper class time idea anyone improve personal lifestyle bring happiness examples hang picture wall friends regular meeting friend discuss intellectual idea activity friends add happiness life wealthy provide capital build much city source capital emperor king grand work hard success yet become successful instead appreciate productivity contribution society society turn blamed jealousy success newfound power essentially view arrogant upstart stay place remind white view hardworking educate successful black way upstart stay place author say american interpretation american living overseas never understand animosity now think combination today animosity large corporation crook people finance roll together racism want group bottom know place matter educate successful fellow animosity reading think see come interpretation author hear learn unfair wrong different explore european become obsolete airplane gunpowder cannon twice reject art school come loathe democracy draft dodger work time street peddler become extremist actually austrian event feeling lead jewish pogrom riot jewish really question societal bullying interpretation seem successful country culture education strong work ethic help extend family value see good place capitalistic ethic fit perfectly american capitalistic society european society often seem capitalistic ethic corporate ethic equivalent interpretation author urban rural modern traditional status base family status base personal accomplishment reward productiveness society promote egalitarianism inequality increase generation pogroms perhaps inequality lead riot point point becomes tip point yet sure bully harass come unite want equally culpable country extremist possible lesson expatriate live outside home country minority racial religious even take citizenship new country condition always money investment country time trouble sudden revolution better away possession often manage get still possession resilience something cultivate encouraged child never know life throw order able back go sometimes even old age resilient often end commit common populace remind today thing learn call free election secret ballot really believe election implement new guarantee basic right workplace afford protection arbitrary dismissal extend health care benefit work class artistic life promote encouraged fell change ordinary people fact never cover history class thus leave wonder people explain lot culture keep everything private even home detail description night pogrom jewish night entrance later die lose property others escape clothes back long year tribulation commit suicide happen survivor child child grandchildren rebuilt life various story begin bureaucrat want good job want join want benefit get list story netsuke save author real illustrious family story give family document father receive lead author whole exploration family never call account way brother escape run away family go learn become designer move design later become american citizen serve serve due knowledge several language later send learn fluent end settle rest life author visit old many author young pottery artist author learn netsuke eventually inherit collection pass short useful interesting ever learn much never know many many aspect life highest recommendation interest story really well write fantastic too long detailed boring way struggle read first give detail rich excessive lifestyle member family last made worthwhile still important message half volume dictionary next learn many new word now top ever part find interest part tedious seem go forever find wait bore favorite ever twice savor delicious detail story interest take almost half introduce character describe city last half move faster pace author really dedicate journey net skies sure thesis tho story line find write overblown often pretentious", "genres": ["Memoir", "Biography", "Art & Architecture", "History", "WWII"], "summary": "An Economist Book of the Year\r\n\r\nEdmund de Waal is a world-famous ceramicist. Having spent thirty years making beautiful pots―which are then sold, collected, and handed on―he has a particular sense of the secret lives of objects. When he inherited a collection of 264 tiny Japanese wood and ivory carvings, called netsuke, he wanted to know who had touched and held them, and how the collection had managed to survive.\r\n\r\nAnd so begins this extraordinarily moving memoir and detective story as de Waal discovers both the story of the netsuke and of his family, the Ephrussis, over five generations. A nineteenth-century banking dynasty in Paris and Vienna, the Ephrussis were as rich and respected as the Rothchilds. Yet by the end of the World War II, when the netsuke were hidden from the Nazis in Vienna, this collection of very small carvings was all that remained of their vast empire.", "asin": "0312569378", "rank": "31685", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/61f7Cn%2BvkHL.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}