{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 1721, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a must read! Informative and entertaining. Characters are colorful and have depth. Great book!"}, {"review_sentiment": 5.0, "review_text": "This is outstanding historical fiction. The insight into Hawaii's history, specifically Kalaupapa and the victims of Hansen's disease, is very engaging. Highly recommend. Brennert has done a remarkable job of weaving together fact and fiction."}, {"review_sentiment": 5.0, "review_text": "This story pulls you into the world of Rachael and her struggles, victories and love she experiences and shares throughout her life. Based on facts, but I didn't understand until the credits that the characters are fictional.  Still an amazing book."}, {"review_sentiment": 5.0, "review_text": "Great book! I loved all historical content!"}, {"review_sentiment": 5.0, "review_text": "Enjoyed the true story!!"}, {"review_sentiment": 5.0, "review_text": "Loved this book twice now."}, {"review_sentiment": 5.0, "review_text": "Not great literature, but such an interesting time in history and it gives you an insight into the old days of Hawaii."}, {"review_sentiment": 5.0, "review_text": "Wonderful story"}, {"review_sentiment": 5.0, "review_text": "Alan Brennert has woven a fascinating historical novel, Moloka’i, a story about the dreaded disease, leprosy and its affect on the Hawaiian people in the late 19th century.On the Island of Oahu, Hawaii, Rachel Kalama, at 7 the youngest of four children, is diagnosed with leprosy. In the late 1800's leprosy became a common and terrifying disease among the Hawaiian people. Once authorities learn of Rachel’s condition, she is sent to a hospital for diagnosis and treatment, then eventually sent to the leper colony on Kalaupapa Peninsula on the island of Molokai, Hawaii. For many, leprosy becomes a family tragedy of shame and of being shunned, often involving having to move to an area where the family’s circumstances are unknown. On some occasions a family member might accompany the diseased member, but Rachel’s mother is needed to care for the other children on Oaho and her father obliged to support them. Rachel’s uncle is also a resident of Kalaupapa, but it is decided that Rachael should not live with him, but rather live in a girls’ dormitory, supervised by Catholic nuns.Rachel, feeling angry and abandoned, fights her confinement. So far, the leprosy only affects patches of skin on her leg and foot, so she is fully functional, but other girls are in various stages of disfigurement. At first she refuses to participate in the activities provided: school, organized play times and programs, but she eventually makes friends with the other girls. Years pass as Rachel carves out a life for herself. The book covers a span of more than fifty years.In the meantime, Hawaii becomes a United States possession—not necessarily with the consent or approval of the Hawaiian people—and becomes the Territory of Hawaii. Funds and expertise become more available for the people at Kalaupapa, including a new hospital. This is well after Father Damien’s time, but many of the older residents remember his fiery dedication to the people there. A cure is eventually found for leprosy, a sulfa drug that stops new growth of the bacillus. Most patients are ultimately free to leave Kalaupapa, if they choose, and in later years the Peninsula becomes a National Historic Park.Moloka’i is a moving, well-written description of Hawaii and the terrible disease now known as Hanson’s Disease. I particularly loved this book as I lived and worked in the Territory of Hawaii before it became a state. I delighted in hearing again the local terminology (kapu—stay out!, wahini—girl, mahalo—thank you), and loved hearing the names of places once so dear to me. In more recent years my husband and I rode muleback down and up the 26-switchback steep trail to visit Kalaupapa. Our guide was a resident who choose to remain on Kalaupapa and with him we visited many of the buildings of the original colony. To this day, the only way to approach Kaluapapa Peninsula is by sea, air, or by riding or walking the steep trail.I highly recommend this fascinating account of a disease that affected so many lives."}, {"review_sentiment": 5.0, "review_text": "This is a deeply moving story. A very complex subject. I found it hard to put the book down."}]}, "authors": ["Alan Brennert"], "isbn": "0312304358", "longitude": -157.8556764, "periods": ["1900s"], "title": "Moloka'i", "word_cloud": "entertain colorful depth outstanding historical fiction insight history specifically victim disease engage recommend do remarkable job weave together fact fiction story pull world struggle victory experience share life base fact understand credit character fictional still amaze love historical content true story love twice not great literature interesting time history give insight old day wonderful story woven fascinate historical story dread disease leprosy affect hawaiian people late youngest child diagnose leprosy late leprosy become common terrify disease hawaiian people authority learn condition send hospital diagnosis treatment eventually send leper colony island many leprosy becomes family tragedy shame shun often involve area family circumstance occasion family member diseased member mother need care child father oblige support uncle also resident decide live rather live girl dormitory supervise feel angry abandon fight confinement so far leprosy affect patch skin leg foot fully functional girl various stage disfigurement first refuse activity provide school organize play time program eventually make friend girl pas carve life cover span fifty meantime become necessarily consent approval hawaiian become expertise become available people include new hospital well time many older resident fiery dedication people cure eventually find leprosy sulfa drug stop new growth bacillus most patient ultimately free leave choose later year become move description terrible disease know particularly love live worked become state delight hear local terminology love hear name place dear recent year husband ride mule back steep trail visit guide resident choose remain visit many building original colony day way approach sea air rid walk steep highly recommend fascinate account disease affect many life deeply move story complex subject find hard put", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "This richly imagined novel, set in Hawai'i more than a century ago, is an extraordinary epic of a little-known time and place---and a deeply moving testament to the resiliency of the human spirit.\r\n\r\nRachel Kalama, a spirited seven-year-old Hawaiian girl, dreams of visiting far-off lands like her father, a merchant seaman. Then one day a rose-colored mark appears on her skin, and those dreams are stolen from her. Taken from her home and family, Rachel is sent to Kalaupapa, the quarantined leprosy settlement on the island of Moloka'i. Here her life is supposed to end---but instead she discovers it is only just beginning.\r\n\r\n\"A dazzling historical novel.” The Washington Post", "asin": "0312304358", "rank": "11690", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51kQ-AzKYhL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}