{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 166, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "I'm going to read it again. Beautiful but vexing. Greer a wonderful writer and Tivoli deserves another look. Don't get me wrong I did love it."}, {"review_sentiment": 5.0, "review_text": "Weird but awesome book."}, {"review_sentiment": 5.0, "review_text": "I can't remember the last time a story has touched me so profoundly.  Andrew Sean Greer is a gifted writer.  There are so many levels to this tale that I had to stop now and then and let my thoughts settle.  This book will be with me for a long time."}, {"review_sentiment": 3.0, "review_text": "It took me a long time to get into this. The concept of the very old looking child wasn't conveyed well. But later on it became very good. The ending was quite moving even if I'd have chosen to end it a bit differently."}, {"review_sentiment": 5.0, "review_text": "There are very few books I give 5 stars to.  They Must cause me to stop and take in the beauty of its words,  give me characters that I come to love, make me laugh and cry and sit afterwards in silent contemplation.  This book astounded me with its poetic journey.  Max will be in my heart a very long time."}, {"review_sentiment": 5.0, "review_text": "Outstanding novel."}, {"review_sentiment": 1.0, "review_text": "Really disliked this stupid, confusing book. Disliked it right from the outset. Utterly pointless. A waste of time"}, {"review_sentiment": 5.0, "review_text": "Another wonderful novel by Andrew Sean Greer!  This one just pure magic."}, {"review_sentiment": 5.0, "review_text": "Totally enthralling - I may have to re-read instead of audio book  to catch all the great description."}, {"review_sentiment": 5.0, "review_text": "I don't go into a lot of technical details when I review a book. It either stirs my soul or it doesn't. If you want more details, there are lots of reviews here that are worth a read. I read them and enjoyed them and learned more about this book that genuinely stirred my soul. I'll never forget it. \"We are each the love of someone's life.\" I've never thought about that before. Is it true?"}]}, "authors": ["Andrew Sean Greer"], "isbn": "0312423810", "longitude": -122.4192363, "periods": ["1800s", "1900s", "Recent Releases"], "title": "The Confessions of Max Tivoli: A Novel", "word_cloud": "go beautiful vex wonderful writer deserve look wrong love awesome last time story touch profoundly gift writer many level tale stop thought long time take long time concept old look child convey well later become good end quite move even choose end bit differently give star must stop take beauty word give character come love make laugh cry sit afterwards silent contemplation astound poetic journey heart long time outstanding really disliked stupid confuse right outset pointless waste time wonderful pure magic totally enthral instead catch great description go lot technical detail review stir soul want detail lot review enjoy learn genuinely stirred soul never forget love someone life never think true", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "\"We are each the love of someone's life.\" So begins The Confessions of Max Tivoli, a heartbreaking love story with a narrator like no other.\r\n\r\nBorn with the physical appearance of an elderly man, Max grows older mentally like any child, but his body appears to age backwards, growing younger every year. And yet, his physical curse proves to be a blessing, allowing him to try to win the heart of the same woman three times as at each successive encounter she fails to recognize him, taking him for a stranger, so giving Max another chance at love.\r\n\r\nSet against the historical backdrop of San Francisco at the turn of the twentieth century, The Confessions of Max Tivoli is a beautiful and daring feat of the imagination, questioning the very nature of love, time, and what it means to be human.", "asin": "0312423810", "rank": "160109", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/41eODw-8bIL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}