{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 26, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "Like many of the reviewers, I thought this book was a bit heavy. Not literally weighty; it had a lot of terribly traumatic events take place, but many of them did nothing to seriously progress the story. Even though I thought the flash forward sections were done well, there was real no connection to 11-year old boy. Yes, we are suppose to understand the boy will become the soldier, but the transition is missing. I will say that the perspective was fantastic; one of the few books that used the first person perspective effectively. I totally believed it.Overall, a bit too grand in the wording, but still a decent book."}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 5.0, "review_text": "This book was really incredible. You get a look into post-apartheid South Africa from the perspective of a white child. It is a chilling tale; there is not a happy ending. It is definitely a must read."}, {"review_sentiment": 2.0, "review_text": "I only gave this book two stars cause it's written by a friend of a friend. but... for one thing I'm not even sure what happened in the book. (spoiler) is Dad supposed to be a ... lover of the Chilean general/child molester??!? That seems to be what's vaguely and senselessly implied. And I mean, ok, he's a hypocrite, Dad is, then. I'm sorry I didn't get this book at all. And the style and the conceit of this little boy who just accepts everything Daddy says without question.... I found a really tough \"buy\"..."}, {"review_sentiment": 5.0, "review_text": "Mark Behr's novel follows the life of a privileged, white 11-year-old boy named Marnus Erasmus in 1970s South Africa.  Marnus and his best friend, Frikkie, are keenly aware of the sharp racial divides in their country, even if they don't yet understand the injustice underlying them.Despite the heavy load of its subject matter, Behr's prose moves along quickly, and he has immense talent for dialogue. We walk into Marnus' family and inner circle and observe a scaled-down version of the convoluted power dynamics happening outside the well-off family's gates.  Marnus' father is a Major General in South Africa's air force, which exposes Marnus and Frikkie on a regular basis to the nation's conflicts and some of its most powerful officers.  Racism, of course, reaches even into good-hearted Marnus, and the reader can't help but see that he knows no other way of thinking.  These profound issues underlie life as an otherwise normal schoolboy, making the novel a politically charged roman-à-clef.Marnus' narration stays pitch-perfect throughout; Behr's choice to tell the story through Marnus proves a crucial and very smart move.  A child at this age, a turning point in the capacity to understand the complexities and motives in the adult world, makes an appropriate vehicle for displaying the situation in South Africa at the time.  You'll learn a lot about that nation and its riches (gold and diamond mines) and the cruel politics now mercifully behind us."}, {"review_sentiment": 5.0, "review_text": "The beauty of this book is that it is so convincing. It helps you to understand how a sensitive, kind child can get caught in supporting a very wrong system.There is this little boy, who wants to be loved by his mother and adored by his father, and this is so important for him that he is willing to pay any price for it. And beacuse he loves so much, he is incapable of seeing through their mistakes and finding his own route in life.And during the book, first slowly and later with deafening speed , the pink curtains over this ideal life of the little Marnus are being torn away, and every time it happens ,Marnus still sticks to his former upbringing and stands loyal by the convictions of his father and mother. O yes, sometimes he sees the cracks in the appearances, as his sister Ilse or his aunt Tannie Karla try to show, but he cannot let the information in.  That will treathen his quest for love from his parents. He tries so much... so much to behave that it is heartbreaking.  His upbringing was too succesful. He cannot open his eyes,... Not when he sees how destitute Chrisjan , their former servant is, ...Not when he sees the pain of Little Neville, ...not when he sees how his infallible father mistreats his best friend. He cannot allow in his mind the realisation that the goodness of his parents is limited. And still love them despite their failings.Yet he has learned a little bit when grown up. During the book we meet Marnus again as a grown up man of 26, when he is fighting in the South African Army against rebels on Angolan soil. Everytime the inserts appear you see how the exepriences of being twarted and confused as a child have their repercussion in his adult reactions. And you can see how he is learning and growing, albeit it piecemeal and slowly. \"How come you are here as a soldier?\", he asks one of his soldiers. It feels that it is one of the first times he turns towards a person of an other colour and asks a direct question about their thoughts. The first time he is really interested. And than also the remorse breaks through, so big that dying seems a reasonable option out of this guilt. Not choosen, just like he was unable to steer his own course as a child, but submitting to fate."}, {"review_sentiment": 4.0, "review_text": "\"Memorable for the eye-opening authenticity with which Behr catches the Afrikaner mentality at home ... Behr's novel offers a disturbing confirmation that sincere and kindly people can still be the walking representation of evil\" (Sunday Times)Mark Behr's first time novel \"The Smell of Apples\" won the prestigious CNA Literary Debut Award and the Eugene Marais Prize. It was a wordlwide success, because it contains one of the most expelling themes in South Africa of the last 30 years.Behr tells the story through the eyes of the 11-year old Marnus Erasmus who lives with his sister and parents in Cape Town of 1973.Behr links many aspects throughout the story so that the reader gets to know about Marnus's story of initiation, the apartheid system, the sexual mischiefs of his parents and Marnus being a 26-year old soldier in the Angolan Civil War.But mainly the reader is led through the week of Marnus's life becoming more smart and grown up.He and his sister Ilse especially try to behave like adults when a Chilean general visits the family. This so called Mr.Smith has a symbolic function in the novel, because he is the one(the snake)who steels the apples out the families Garden of Eden.All in all the novel by Mark Behr is a good introduction for readers who want to inform theirselves and who are interested in the apartheid system and the life of blacks and whites in this period of time."}, {"review_sentiment": 4.0, "review_text": "In his novel \"The Smell of Apples\" Mark Behr deals with problems of Apartheid by telling the story of a white South-African boy called Marnus Erasmus.Throughout the book the strong relation to his father becomes obvious. Although Mr. Erasmus is really strict and authoritarian, Marnus regards him as a hero, especially because he is a general in the South African Army. Nevertheless the reader believes that Marnus's father is very considerate concerning his family, but this illusion gets destroyed when Marnus observes that his best friend Frikkie is raped.The end of the novel is really shocking, but exactly that makes the book so interesting and readable. Telling the story through the eyes of a 10-year old boy makes the story even more dramatic.I like the story and the characters, although the parts of the novel concerning Marnus's time in war are sometimes hard to understand"}, {"review_sentiment": 4.0, "review_text": "After Mark Behr's \"The Smell of Apples\" had earned best critics by famous newspapers like \"The Sunday Times\" or \"The Daily Telegraph\", I decided to get a personal impression of this book.Indeed the story seemed to be quite interesting from begin on: Behr describes a harmonious family. He writes with with a sense for details and creates a perfect illusion, in which the eleven year-old protagonist lives.This idyllic picture is first disturbed by the second time-level, which appears always suddenly without connection and ends the same way. Here Marnus is a 26 year-old soldier, who fights in Angola and finally dies.The contrast of these two levels makes the reader soonly mistrust the harmony of Marnus's life and his family.Little incidents engross this feeling time after time, although the really tragic end is very surprising anyway.Mark Behr succeeds in showingthe former or maybe still actual conflict between South African Blacks and Whitesby analyzing the Afrikaner-mentality in an apparently normal Afrikaner-family.The change of society (military) is told in a detailed and really understandable way. So you can experience the younger South African history by identifying with Marnus, who has to face bad things, but doesn't seem to learn from it anyway.For the interested reader a real duty!"}, {"review_sentiment": 4.0, "review_text": "Reading the very good critics Mark Behr had earned for his first novel \"The Smell of Apples\", I started reading the book with very high expectations. And I can say that they were fulfilled.The book contains two time levels: The first one deals with an 11-year old boy, Marnus Erasmus, growing up in South Africa in 1973. Behr gives a detailed look into the racist society and tells the story of a shocking rape at the same time.The second one takes place in Angola. Marnus fights 16 years later as a lieutnant of the Soth African army in the Angola- civilwar. He and his soldiers are cut off from the troops. Again Behr succeeds in describing the cruelty of war. He knows how to connect the two time levels without loosing the reader's attention.Finally I can say that it was worth reading."}]}, "authors": ["Mark Behr"], "isbn": "0312136048", "longitude": 18.417396, "periods": ["1900s"], "title": "The Smell of Apples", "word_cloud": "many reviewer think bit heavy not literally weighty lot terribly traumatic event take place many nothing seriously progress story even think flash forward section do well real connection old boy suppose understand boy become soldier transition miss say perspective fantastic one use first person perspective effectively totally believe bit grand wording still decent great really incredible get perspective white child chill tale happy end definitely give star cause write friend friend thing even sure happen spoiler suppose lover molester seem vaguely senselessly implied mean ok hypocrite sorry get style conceit little boy accepts everything say question find really tough buy follow life privilege white boy name best friend keenly aware sharp racial divide country even yet understand injustice underlie heavy load subject matter prose move along quickly immense talent dialogue walk family inner circle observe version convolute power dynamic happen outside family gate father air force expose regular basis nation conflict powerful officer course reach even know way think issue underlie life otherwise normal schoolboy make politically charge narration stay choice tell story prove crucial smart move child age turn point capacity understand complexity motif adult world make appropriate vehicle display situation time learn lot nation rich gold diamond mine cruel politics mercifully beauty convince help understand sensitive kind child caught support wrong little boy want love mother adored father important willing pay price because love much incapable see mistake find route first slowly later deafen speed pink curtain ideal life little away time happen still stick former upbringing stand loyal conviction father mother sometimes see crack appearance sister aunt show information threaten quest love parent try much much heartbreaking upbringing successful open eye not see destitute former servant not see pain see infallible father mistreats best friend mind realization goodness parent limit still learned little bit grown meet grown man fight south african rebel soil insert appear experience tarted confused child repercussion adult reaction learn grow albeit piecemeal slowly come soldier ask soldier feel first time turn towards person color asks direct question first time really interested also break big die seem reasonable option guilt not choose unable steer course child submit fate memorable authenticity catch mentality home offer disturb confirmation sincere kindly people still walk representation evil first time prestigious worldwide success contain expelling theme last tell story eye old live sister parent link many aspect story get know story initiation apartheid system sexual mischief parent old soldier mainly lead week life become smart grown sister especially try behave adult general visit family call symbolic function snake steel family good introduction reader want inform their selves interested apartheid system life black white period time deal problem tell story white boy call strong relation father become obvious really strict authoritarian regard hero especially general african believe father considerate concern family illusion get destroy observe best friend end really shock exactly make interesting readable tell story eye old boy make story even story character part concern time war sometimes hard understand earn best critic famous newspaper decide get personal impression story seem quite interesting begin describe harmonious family write sense detail create perfect illusion eleven protagonist idyllic picture first disturb second appear always suddenly connection end way here soldier fight finally contrast level make so only mistrust harmony life incident feel time time really tragic end surprising succeed showing the former maybe still actual conflict african analyze apparently normal change society military tell detail really understandable way experience younger south african history identify face bad thing seem learn interested real duty read good critic earn first start read high expectation say contains time level first deal old boy grow give detailed look racist society tell story shock rape second take place fight year later lieutenant south african army civil war soldier cut troop again succeed describe cruelty war know time level loose say worth reading", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A Booker Prize Nominee\r\n\r\nSet in the bitter twilight of apartheid in South Africa in the 1970s, The Smell of Apples is a haunting story narrated by eleven-year-old Marnus Erasmus, who records the social turmoil and racial oppression that are destroying his own land. \r\n\r\nUsing his family as a microcosm of the corroding society at large, Marnus tells a troubling tale of a childhood corrupted, of unexpected sexual defilements, and of an innocence gone astray.", "asin": "0312136048", "rank": "1628626", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/21X5AKX13JL.jpg", "country": "RSA", "story_arc": ["Tragedy", "Things only get worse"]}