{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 138, "rating": 3.8, "reviews": [{"review_sentiment": 1.0, "review_text": "This story starts with elegant word pictures of Venice with all the nuances we've grown to love about the place and deteriorates into a plodding ordeal that the reader has to endure.  150 pages of brilliant heart wrenching beauty followed by 250 pages of torturous dialogue and convoluted plot.  Such potential, such a waste in the end."}, {"review_sentiment": 5.0, "review_text": "Clever plot with surprising twists, beautifully written. A deeply psychological story as well as a page-turning mystery. I found it hard to put down. I recommend it to all serous readers."}, {"review_sentiment": 5.0, "review_text": "I simply could not put this book down. It went from bad to worse in every chapter. At the same time I learned a great deal about Venice and its role in World War Two."}, {"review_sentiment": 3.0, "review_text": "Interesting premise with Post war Venice as its background.  A little slow for me and somewhat difficult to relate to the characters.  I enjoyed the historical element but was hoping for even more factual information weave into the story line."}, {"review_sentiment": 2.0, "review_text": "While I have enjoyed Kanon's other books, this one is tedious to the point of being annoying.Although I have enjoyed several of Kanon's other books, this one is extremely tedious, to the point of being irritating.  Perhaps it is a failed effort at character development, but none of the characters is sympathetic, especially the \"heroine\" introduced near the beginning of the book, who starts well but then devolves into such hystrionics and obsessive behavior that she (and the book) loses all credibility.  The premise of the book is interesting, but the execution leaves much to be desired.  Kanon seems to specialize in historical fiction, especially the period in the immediate aftermath of WWII, and this book fits in that genre, but I advise you to skip it and read The Good German (much, much better than the movie, despite its talented cast, which changed the story in ways that detracted markedly from the original) and/or Leaving Berlin instead."}, {"review_sentiment": 4.0, "review_text": "Kanon’s fast-paced story of mystery, intrigue and murder, involves a young American soldier, newly resigned from service, on vacation in Venice, Italy, and a young, troubled, Italian woman.  The plot involves Italian politics ladened with resentment, anger, and betrayal.  The story is well written and descriptive, with believable dialogue.Details:In 1946, Adam Miller, released from the U.S. Military, leaves his work in the de-Nazification program in Germany, and decides to visit his mother, in Venice.  Adam learns his mother, Grace Miller, plans to marry a well known well respected, Venetian, Dr. Gianni Maglione.  Adam reluctantly attends a party, at the invitation of his mother, and meets Claudia Grassini, a young Jewish woman, to whom he is immediately attracted.  As Adam and Claudia’s relationship develops, Adam learns Claudia is complicated, and holds many secrets, more than he can imagine."}, {"review_sentiment": 5.0, "review_text": "A really good page turning free. I enjoyed the topic of postwar Italy, learning more about Venice, and how people recovered From the effects of World War II. Great plot, great love story."}, {"review_sentiment": 4.0, "review_text": "Joseph Kanon is a master of the immediate post-war Europe novel.  Alibi is set in Venice - which was largely spared the physical impact of the war - but everyone was affected in some way. Told through the perspective of a US veteran whose mother is a Venetian resident, Alibi's plot revolves around who did what in the war and everyone's attempt to rewrite the past."}, {"review_sentiment": 5.0, "review_text": "This well written story about violence,Love and regret carries the angst  Hemingway evoked in his post WW 1 novel. The message is it would be nice but it can never be because of what we were and what we did. Excellently drawn characters and a twisting but riveting plot."}, {"review_sentiment": 3.0, "review_text": "Plot was very difficult to follow was a bit haphazard. Double and triple crosses were reflected in intricate dialogue that did not seem to flow. Very disappointed as I have loved his other books."}]}, "authors": ["Joseph Kanon"], "isbn": "0312425902", "longitude": 12.3345898, "periods": ["1900s", "Recent Releases"], "title": "Alibi: A Novel", "word_cloud": "story start elegant word picture nuance grow love place deteriorate plod ordeal endure page brilliant heart wrench beauty follow page torturous dialogue convolute plot such potential waste end plot surprising twist beautifully write deeply psychological story well mystery find hard put recommend serous reader simply go bad worse chapter time learn great deal role interest premise war background little slow somewhat difficult relate character enjoy historical element hop even factual information weave story line enjoy tedious point enjoy several extremely tedious point irritate perhaps fail effort character development none character sympathetic especially heroine introduce begin start well devolve histrionics obsessive behavior lose credibility premise interesting execution leave much desire seem specialize historical fiction especially period immediate aftermath fit genre advise good german much much better movie talented cast change story way detract markedly original instead story mystery intrigue murder involve young soldier newly resign service vacation young trouble italian woman plot involve italian politics laden ed resentment anger betrayal story well write descriptive believable release military leaf work program decide mother learn mother plan marry well know well respected reluctantly attend party invitation mother meet young woman immediately attract relationship develop learn complicate hold many secret imagine really good page turn free enjoy topic postwar learning people recover effect plot great love story master immediate set largely spar physical impact war everyone affect way perspective veteran mother venetian resident plot revolves war everyone attempt rewrite past well write story violence regret carry evoke post message never excellently draw character twist riveting plot difficult follow bit haphazard triple cross reflect intricate dialogue seem flow very disappointed love", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII"], "summary": "Winner of the Hammett Prize\r\n\r\nIt is 1946, and Adam Miller has come to Venice to visit his widowed mother and try to forget the horrors he has witnessed as a U.S. Army war crimes investigator in Germany. But when he falls in love with Claudia, a Jewish woman scarred by her devastating experiences during World War II, he is forced to confront another Venice, a city still at war with itself, haunted by atrocities it would rather forget. \r\n\r\nEveryone, including his mother's suave new Venetian suitor, has been compromised by the occupation, and Adam finds himself at the center of a web of deception, intrigue, and unexpected moral dilemmas. When is murder acceptable? What are the limits of guilt? How much is someone willing to pay for a perfect alibi?\r\n\r\nAlibi is at once a murder mystery, a love story, and a superbly crafted novel about the nature of moral responsibility.", "asin": "0312425902", "rank": "191030", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/41CCY9dGbAL.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}