{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 706, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "One of my five favorite books of my lifetime."}, {"review_sentiment": 5.0, "review_text": "Bought this book because I felt like in the current climate of the country right now, I was feeling a flashback of nostalgia for the 80's. I remember seeing this movie with Melanie Griffith and her fur coats and the accident, which epitomized Wall Street glamour to me. Tom Wolfe's novel does not disappoint. The themes of racism are still very raw even now in our society forty years later. He paints a unique picture of the rich and living on Park Avenue is not always the end all be all. I love his description and background of the Bronx. The dichotomy between the criminal justice system \"have nots\" and the police officers, lawyers and judges that make the decisions. It's amazing that a book of this caliber still resonates in such a timely manner so many decades later and I am very excited to read more from him. The ending of the book is really everything, but I don't want to spoiler alert."}, {"review_sentiment": 5.0, "review_text": "The realistic wording is unusual. I only wish he'd write more. A great read. Don't pass it up. End thanks"}, {"review_sentiment": 1.0, "review_text": "Not talking about the book story itself but this was awful. The book, which I ordered as new, was all dirty and had folds everywhere. I don't think its the packaging problem because I ordered another book along with it but it was very brand new and very clean. If I order new, please give me new and not used."}, {"review_sentiment": 2.0, "review_text": "I'll start by admitting that this is not the typical book I read.  I read it because it was on a list of books that one should read.  That being said, I lived through the 80's and I don't remember them being this shallow, vapid, or dull.  Perhaps it's because I lack an infatuation with New York or with the very wealthy.In all, I believe that there are better ways to spend my time.  But please, make your own decision."}, {"review_sentiment": 5.0, "review_text": "Author Tom Wolfe, writes like he wears a thesaurus as his crown!  His book was born from basic curiosity; why would any man want to be strapped inside a tiny tin can of a rocket ship, to be blasted into the heavens by a massive rocket?  It was more dangerous than anything ever attempted in human history, so what sort of person would willingly put his butt on the line for this cause?  Tom Wolfe tells the story about how the space program was conceptualized, experimented and developed; concentrating on the Mercury Era and how these discoveries built upon our successful US moon landing.. Alot of the stories I've read before, and some I have read for the first time in this interesting and well-written book, which is non-fiction. It's the story of modern rocketry, beginning with the bravest of all men who did not get a college degree; Chuck Yeager. He was a totally natural aviator and when he broke the sound barrier, yet there was no ticker tape parades held to honor Yeager. Nothing. It was classified information for years and years, back when Edwards Air Force Base was called Muroc.  Those were some exciting days of aviation and discovery of how fast man could fly, and how far he could stretch the edges of the envelope of modern military aircraft.Mercury astronauts were pilots and most served in different branches of the military; all having college degrees as a requirement for consideration.The Mercury program and the flying aces who carried out the world's most dangerous missions was discussed in this book with great explanation. Alan Sheperd was the first astronaut to be blasted up into space; and with all the technical and complicated machinery used, all the scientists, engineers flight surgeons and nurses never considered that the poor man would need to relieve his urinary bladder  while he was perched for four hours in the space capsule. His mission was a great success, but he had to wet himself before launch, which was kept a national secret for decades! Second  launched was Gus Grissom, but he sunk his own battleship, and brought wide-spread consternation upon himself. His Mercury capsule sunk when he accidentally blew his hatch prematurely, and he nearly drowned while waiting egress.  Why NASA didn't fire Grissom remains a mystery to me. Grissom had a fierce case of bad luck and it followed him till his dying day, which came prematurely.  Then came the lucky, golden boy, John Glen. The world was brought to their knees by the heroic actions and the goodness of John Glen.  His perfect rocket orbit around Earth and perfect splash-down, right on target in the Atlantic Ocean caught the world's attention by storm.  John Glen was the most famous of the fantastic Seven. People could not get enough of John Glen, and he could do no wrong.  The other four astronauts stories was told in this exciting book, but truth be told, it is Mr. Wolfe's exceptional writing that made these men so famous and legendary.Scott Kelly exalts this book - The Right Stuff, in his recently published memoir titled, Endurance.  Scott Kelly credits Tom Wolfe for inspiring him to becoming a US astronaut, and he is very adamant that he, Scott Kelly, would never have amounted to anything - had he not read this book for the first time when he was just 18 years old.I have to give credit where credit is due. This book was copywrite published in 1979, but it still packs a wallop. Please read it and enjoy the descriptive prose of our hero, Tom Wolfe.  Thank you."}, {"review_sentiment": 5.0, "review_text": "Great book!  Would recommend to anyone with interest in the US space program and/or flight test aviators from this era.  Read the book, then watch the movie.  The book is incredibly well written.  Kudos to Tom Wolfe."}, {"review_sentiment": 5.0, "review_text": "Not normally a fan of non-fiction works, I chose to read this book after watching the movie for the umpteenth time. I found the book to be a very slow read for me. The chapters seemed to go on indefinitely, but I do not think there was any other way to organize the book. But I truly enjoyed reading it cover-to-cover. For anyone not privileged to lived the events first hand, this book offer extensive insight into the struggles and triumphs that would ultimately lead to mankind landing on the moon.The book opens with a description of Pete Conrad's wife, Jane, and how she handled life as a military wife of a test pilot. One aspect of the book that the movie skimped on was the exact toll on the women behind the men. But the book consistently discussed the stresses, pressures, and anxieties the wives endured throughout the Mercury program and before when their husbands were test pilots.The book moves on to the X-1 program and Chuck Yeager's historic flight wherein he broke the sound barrier before progressing into the Mercury program. I found interesting the contempt other test pilots had for the Original Seven. Flying the X-15, the test pilots could not understand why the Original Seven were so revered for sitting in a capsule that was automatic and did not require the occupant to fly. It was a concept I had not fully considered until now.Having not lived during this period, I was always taught that President Kennedy fully supported the NASA space program from its inception. Just about every space-related story quotes his famous speech about choosing to go to the moon. This book explained that initially, President Kennedy was staunchly opposed to the program and campaigned to end the program if he became POTUS. And President Kennedy began his administration laying the foundation to ultimately cancel the space program. NASA found itself behind the 8 ball and scrambled to launch Al Shepard as quickly as possible in hopes that it would at least prolong mama's existence long enough to complete the Mercury program. It worked! From that point, President Kennedy became a staunch supporter for NASA and lobbied hard to expand NASA's budget to enable it to put an American on the moon first.There are other tidbits that are not commonly known throughout the book, making it a worthwhile read."}, {"review_sentiment": 5.0, "review_text": "If you grew up in the 1960's, the astronauts were your heroes.  This book gives you a whole new perspective on the space race and the people who went up into space.  I thoroughly enjoyed it."}, {"review_sentiment": 5.0, "review_text": "This book made me excited about the early days of breaking the sound barrier and then later the Mercury manned space program.This is something special about this earlier period, a story of special men in a special time with few rules and big goals. It is a good dose of American competence. This was a period where having \"the right stuff\" showed off America's greatness."}]}, "authors": ["Tom Wolfe"], "isbn": "0312427573", "longitude": 0.0, "periods": ["1900s"], "title": "The Bonfire of the Vanities", "word_cloud": "favorite lifetime felt current climate country right feel flashback nostalgia remember see movie fur coat accident epitomize glamour disappoint theme racism still raw even society year later paint unique picture rich living always end love description background dichotomy criminal justice system notch police officer lawyer judge make decision amaze caliber still resonate timely manner many decade later excite end really everything want spoiler alert realistic wording unusual wish great thanks not talk story order new dirty fold everywhere think package problem order brand new clean order new please new use start admit typical list say live remember shallow vapid dull perhaps lack infatuation believe better way spend time decision write wear thesaurus born basic curiosity man strap tiny tin rocket ship blast heaven massive rocket dangerous anything ever attempt human history sort person willingly line cause tell story space program conceptualize experiment developed concentrate discoveries build successful moon story first time interest story modern rocketry begin bravest men get college degree totally natural aviator break sound barrier yet ticker tape parade hold honor nothing classified information year year back call exciting day aviation discovery fast man far edge envelope modern military astronaut pilot serve different branch military college degree requirement program fly ace carry world dangerous mission discuss great explanation first astronaut blasted space technical complicate machinery use scientist engineer flight surgeon nurse never consider poor man urinary bladder perch hour space capsule mission great success wet launch keep national secret decade launch sunk battleship bring consternation capsule sunk accidentally blow hatch prematurely nearly drowned wait egress fire remain mystery fierce case bad luck follow till die day come prematurely then come lucky golden boy world bring knee heroic action goodness perfect rocket orbit right target catch world attention storm famous fantastic enough astronaut story tell excite truth tell exceptional writing make men famous exalt recently publish memoir title credit inspire become astronaut adamant never anything first time year give credit credit due copywriter publish still pack wallop descriptive prose hero anyone interest space program flight test aviator era read watch movie incredibly well write not normally fan work choose watch movie umpteenth time find chapter seem indefinitely think way organize truly enjoy read anyone privilege lived event first hand offer extensive insight struggle triumph ultimately mankind land open description wife handle life military wife test pilot aspect movie skimp exact toll woman men consistently discuss stress pressure anxiety wife endure program husband test move program historic flight wherein break sound barrier progress program find interest contempt test pilot test pilot revere sit capsule automatic require occupant fly concept fully consider lived period always teach fully support space program inception story quote famous speech choose moon explain initially staunchly oppose program campaigned end program become begin administration lay foundation ultimately cancel space program find ball scramble launch quickly possible hope prolong mama existence long enough complete program work point become staunch supporter lobby hard expand budget enable put moon tidbit commonly know make worthwhile grow astronaut hero give whole new perspective space race people go space thoroughly enjoy make excited early day break sound barrier later man space something special earlier period story special men special time rule big goal good dose american competence period right stuff show greatness", "genres": ["Fiction & Literature"], "summary": "Tom Wolfe&#039;s modern American satire tells the story of Sherman McCoy, a Wall Street \"Master of the Universe\" who has it all - a Park Avenue apartment, a job that brings wealth, power and prestige, a beautiful wife, an even more beautiful mistress. \r\n\r\nSuddenly, one wrong turn makes it all go wrong, and Sherman spirals downward in a sudden fall from grace that sucks him into the ravenous heart of a New York City gone mad during the go-go, racially turbulent, socially hilarious 1980s", "asin": "0312427573", "rank": "29964", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51kjljnmEDL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}