{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 59.9132694, "ratings": {"num_ratings": 453, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "My first experience reading this author.  Was recommended by my son.  Will be reading more of his books."}, {"review_sentiment": 5.0, "review_text": "The book that began with an ending, ended up winning me over. If you look back on your life what will you see? Will you be happy with your relationships? Will you be proud of your actions? Will you be haunted by past events that forever changed your life. Actions have consequences. How do consequences affect a person for life?I read this book when it first came out with my book club and it blew me away in a very quiet subtle way. Par Peterson is an award winning Norwegian writer who introduces us to 67 year old Trond Sander who is living an isolated lifestyle. He lives in a rustic cabin and is determined to spend the rest of his life living in virtual isolation. His second wife has died and he has forgotten/neglected to tell his adult daughters his whereabouts. He has a meeting with one of his neighbors - someone from his past - and that meeting causes him to reflect back on his life. He specifically looks back at the summer of 1948 when he was living in a cabin with his father.One day Trond's friend Jon shows up and asks him to go on an adventure with him. An adventure which begins with going for a ride on \"borrowed\" horses and ends in tragedy. A loaded gun tragically changes the lives of not just the teens but their families as well. Initially, I thought this tragedy would be what transforms this man's life but it was only the catalyst. Young Trond learns that there is more to his father then he initially thought. This book is about relationships and how we view our relationships and the \"truths\" we learn about our relationships and those we are in a relationship with. Whew!One death destroys already damaged relationships. Relationships that have been previously damaged by activities during wartime. A time War ravaged the world. A time when a teen learns about his father's involvement during the Norwegian resistance during the war. A time when a man falls in love with a married woman. A time when a young man learns about the harsh realities of life, when you learn your parents have faults and aren't everything you think they are. A time when people disappear from our lives and an abandoned teen is faced with life altering decisions.This book goes back and forth between the present time (1999) and 1948. There is such eloquence and beauty in the storytelling of this novel. The Author shows us Trond's adolescent and adult interpretations of the events of his life. I have used the word \"subtle\" a lot in this review, but I can't think of a better word to sum of the beauty of this book - it is subtle. Minimalistic is a word often used while describing this book as well.Trond experiences strong emotions but has difficulty or is perhaps resistant to expressing those emotions. Petterson allows the reader to make interpretations to those emotions. He shows us a man, we see his loses, his pain, his suffering but yet do we truly know him? I find myself recommending this book over and over again. This book is not a BIG book but it is a powerful one. I love books that cause me to think and feel. I also love books where the environment/landscape is also just as much as character as the \"living\" ones in the book. This book was not only beautifully translated into English, it is beautifully melancholy - just as melancholy as Trond himself. This book is about love, acceptance, loss, secrets, regrets, decisions, tragedy, lust, yearning, and growth."}, {"review_sentiment": 5.0, "review_text": "Beautifully written, moving, poignant.  Didn't want the story to end."}, {"review_sentiment": 4.0, "review_text": "After finishing The Baker’s Secret, I immediately picked up Out Stealing Horses without realizing it too was a World War II novel, though the war is used as a distant back drop rather than front and center as it was in Baker’s Secret. For Trond Sander, an older man trying to unravel the puzzle of his life after losing his wife to a terrible accident, a slow growing clarity about his childhood does little to provide peace for his troubled soul. As Sander slowly recalls the highlights of his youth interspersed with his present day to day, his relationship with his father takes front and center. Though every memory seems to be infused with sadness and regret, Sander never delves into his feelings, seeming to touch upon them from a distance. Like multi-colored leaves falling from a tree in the fall, Petterson’s prose reveal Sander’s life in an intentionally uneven but steady tempo, slowly giving shape to the mysteries of Sander’s childhood and the inevitable heartbreak accompanying it. A master of understatement, Petterson takes us on the journey of a life building to a crescendo of utter silence. This is not light reading. Don’t grab this and read it in bits and pieces. Take a weekend to get the full benefit of Petterson’s masterful prose."}, {"review_sentiment": 5.0, "review_text": "This is now one of my all-time favorite books!"}, {"review_sentiment": 4.0, "review_text": "Great story, very enjoyable"}, {"review_sentiment": 4.0, "review_text": "Down to earth story will take you to a simpler time, a joyous story to be treasured."}, {"review_sentiment": 5.0, "review_text": "A boy loses his best friend after an accidental death for which his friend is blamed. I love this book, one of the few I've read twice and, now that I'm thinking about it, will read fora third time."}, {"review_sentiment": 4.0, "review_text": "A book I have thought about quite a bit after reading . I was a bit confused and unsettled when I finished .  The writing was beautiful . I picked it up to read again and all my confusion fell away  . Now  many sentences had  meaning far more than the first read through . The second read was even more exhilarating . A complex , beautiful written story about coming of age , young and old."}, {"review_sentiment": 4.0, "review_text": "Introspective, claustrophobic,even, and chillingly true to the complexities of growing up. The style is appropriately spare, and Petterson effectively conveys the cold, the light and the harshness of rural life in the far north. Also a tale of bitter isolation and the mysteries of lost family and friendship."}]}, "authors": ["Per Petterson"], "isbn": "0312427085", "longitude": 10.7391112, "periods": ["1900s", "Recent Releases"], "title": "Out Stealing Horses: A Novel", "word_cloud": "first experience reading author recommend son reading begin end end win look life see happy relationship action haunt past event forever change life consequences consequence affect person life first come club blew away quiet subtle way win norwegian writer introduces year old living isolate lifestyle live rustic cabin determine spend rest life live virtual isolation second wife die tell adult daughter whereabouts meet neighbor someone meeting cause reflect back life specifically look summer living cabin day friend show asks adventure adventure begin go borrow horse end tragedy load gun tragically change life teen family well initially think tragedy man life catalyst learn father initially think relationship view relationship truth learn relationship relationship death destroy already damage relationship previously damage activity time ravage world time teen learn father involvement norwegian resistance war time man fall love marry woman time young man learn harsh reality life learn parent fault everything think time people disappear life abandon teen face life alter go back forth present time eloquence beauty storytelling author show adolescent adult interpretation event life use word subtle lot review better word sum beauty subtle word often use describe experience strong emotion difficulty perhaps resistant express emotion allows make interpretation emotion show man see lose pain suffer yet truly know find recommend powerful love cause think feel also love also much character live one beautifully translated beautifully melancholy melancholy love acceptance loss secret regret decision tragedy lust yearn growth beautifully write move poignant story end finish immediately pick horse realize war use distant back drop rather front center older man try unravel puzzle life lose wife terrible accident slow grow clarity childhood little provide peace troubled soul slowly recall highlight youth interspersed present day day relationship father take front center memory seem infused sadness regret never delve feeling seem touch distance leaf fall tree fall prose reveal life intentionally uneven steady tempo slowly give shape mystery childhood inevitable heartbreak accompany master understatement take journey life build crescendo utter silence light read grab bit piece take weekend get full benefit masterful prose favorite story enjoyable earth story simpler time joyous story treasure boy lose best friend accidental death friend blame love twice think forum third time think quite bit read bite confused unsettled finish write beautiful pick confusion fell away now many sentence mean far first second even exhilarate complex beautiful write story come age young old introspective claustrophobic even chillingly true complexity grow style appropriately spare effectively convey cold light harshness rural life far north also tale bitter isolation mystery lose family friendship", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In 1948, when he is fifteen, Trond spends a summer in the country with his father. The events - the accidental death of a child, his best friend's feelings of guilt and eventual disappearance, his father's decision to leave the family for another woman - will change his life forever. An early morning adventure out stealing horses leaves Trond bruised and puzzled by his friend Jon's sudden breakdown. The tragedy which lies behind this scene becomes the catalyst for the two boys' families gradually to fall apart. As a 67-year-old man, and following the death of his wife, Trond has moved to an isolated part of Norway to live in solitude. But a chance encounter with a character from the fateful summer of 1948 brings the painful memories of that year flooding back, and will leave Trond even more convinced of his decision to end his days alone.\r\n\r\n\"Petterson’s spare and deliberate prose has astonishing force, and the narrative gains further power from the artful interplay of Trond’s childhood and adult perspectives. Loss is conveyed with all the intensity of a boy’s perception, but acquires new resonance in the brooding consciousness of the older man.\" The New Yorker", "asin": "0312427085", "rank": "68251", "city": "Oslo", "image": "https://images-na.ssl-images-amazon.com/images/I/51dMuTVSBtL.jpg", "country": "Norway", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}