{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": -12.0621065, "ratings": {"num_ratings": 72, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "Something about this translation seems a little off. I don't know whether or not that is just a reflection on Llosa's style, as this is the first novel to read, but it was really hard to get through."}, {"review_sentiment": 5.0, "review_text": "Absolutely stunning novel!"}, {"review_sentiment": 5.0, "review_text": "This is a powerful book.  It is both a love story and a history of Peru's troubles and cultures.  A great deal of material, well told, in a fairly small volume.  I read it before taking a holiday there, so I had a better understanding of what the nation has gone through.  If you don't like happy endings, skip the appendix and the novel still works very well.  But most readers will appreciate the lift of the extra chapter."}, {"review_sentiment": 4.0, "review_text": "Death in the AndesIt’s easy to see why Llosa is Peru’s most famous novelist, and why he earned the Nobel Prize, after finishing Death in the Andes.In the beginning, I didn’t like it much. It seemed very dark and overly masculine. A policeman and his assistant are stationed at a remote post in the Andes, charged with rooting out the Shining Path terrorists. The assistant entertains his boss by telling the story of his unrequited and tragic love. Meanwhile, mysterious and sinister forces in the village coalesce and make the corporal almost crazed with curiosity.Here are some of the themes, masterfully interwoven into a gripping novel:• Practices and tenets of the Shining Path, a Maoist group that wreaked havoc in Peru from the 1980s to the 2000s. I hadn’t known about their senseless brutality, or how they drove people from the highlands int cities, destroying infrastructure as they went.• How boring and oppressive life in a mining town could be.• Mixture of ancient spirituality with current life for highland villagers; belief in witchcraft, belief in “apus”, or spirits of the mountains, who must be appeased, etc.• Tensions between Quechua- and Spanish-speaking people, and distrust between highland and lowand groups• Widespreadness of corruption (even before druglords became more powerful)• Harshness of high-altitude climate• Power of romantic love, despite all odds• Role of storytelling in maintaining hope and creating bonds between peopleAs a female reader, I was constantly aware of the lack of women characters with whom I could identify. Also, as a North American, I very much felt like an outsider looking into an alien culture. These aren’t necessarily bad things, just something to note.It was fascinating to watch the author develop a relationshp between the policeman and the local bartender (aptly named Dionisio) and his wife. The latter are at first repulsive, embodying paganism, wild abandon, alcohol abuse, sexuality, and everything the more “civilized” policeman considers abhorrent. His obsession with solving three disappearances, however, leads him to become a more sensitive (and possibly even believing) listener. This plot line was one of the most important for an outsider like me wanting to peek inside Peruvian village life.Also, without giving anything away, be forewarned that the ending is a punch in the gut that you won’t soon forget."}, {"review_sentiment": 5.0, "review_text": "Three men disappear from a small mining village in the Peruvian Andes. The army sends two investigators, Corporal Lituma and his adjutant Tomás, to get to the bottom of the apparent murders. Suspects include Sendero Luminoso (“Shining Path”) guerilla-terrorists and a number of locals. For some of the locals, there’s another possibility, the various demons and deities attributed to each of the mountains in the Andes.“Death in the Andes” follows the time that the investigators spend in this remote village. There are two major story lines taking place at once. One narrative arc revolves around the investigation and day-to-day living in a tiny town under primitive living conditions. The second story line comes by night as the duputy, Tomás, recounts his love affair with a girl that was out of his league in almost every way—except, perhaps, with respect to virtuous living. The girl was in a relationship with an abusive gangster at the start, a condition that Tomás found untenable. His love-driven reaction creates all manner of drama, and that drama serves as the only entertainment to be had in this remote village.The book is literary fiction, but it’s not purely about the characters. As suggested, there’s a strong narrative element. While the book is in a realist genre, i.e. nothing in it feels like it couldn’t happen in our universe, the fact that the story takes place in an area of the Andes where the Shining Path is strong and mother nature is harsh means that there’s plenty of tension and suspense.This is book is translated from Peruvian, and it seemed to me that the translator did a fine job of capturing the feel of the rural Andes. A few Spanish terms are used for terms like terrorists and avalanches to create a feel of a unique character of these concepts relative to this place. However, there are only a couple of these terms and so context is sufficient for the reader to readily keep them straight even if one is not gifted in picking up foreign terminology.In general, the book is quite readable.  The most challenging part of reading it is when Tomás is telling his story because you have a three-way conversation going on over two time periods at once. (i.e. Tomás voices himself and his girl as he tells their story, but then Cpl. Lituma chimes in periodically with questions—or, more commonly, commentary.) However, the author uses dialogue tags throughout to avoid confusion. One just needs to be attentive in one’s reading of these sections.I enjoyed this story. I picked up this book both because Llosa won the Nobel Prize in Literature in 2010 and I like to read something by winners, but also because I’ve trekked in the Peruvian Andes and translated literature often offers one a unique form of insight into a place. This was no exception.I’d recommend this book for readers of fiction. If one is looking to broaden one’s horizons into literary fiction and /or translated fiction, this book is a good place to start. It offers humor and intrigue as well as deep characters and an infusion of geography and culture."}, {"review_sentiment": 3.0, "review_text": "Two Peruvian police officers , both outsiders, are stationed in a remote post in the Andes.  While they investigate the disappearance of 3 men a terroristic organization operates in the area.  In the cold lonely nights, the younger officer (Tomasito) tells the older officer (Lituma) his love story which is how he came to be in such a remote location. They frequent a bar where the story of its owners weaves in and out.Like Llosa’s Conversation in the Cathedral, the text is hard to follow.  The tenses move past to present and a conversation can be interrupted without warning to a backstory.  An episode can begin while another is in progress.  The only thing that is linear, and in some ways holds the book together, is Tomasito’s love story.As the book begins, you expect it is about the serruchos, the Maoist style terrorists who could descend on this small town at any time.  The best prose relates to them: The story of the missing Pedrito Tinoco, his bonding with the vicunas and how the serruchos visited them;  the French couple and their presumptions about the terrorists; and the portrait of environmental researcher  who believes that the terrorists share her brand of idealism.This good prose is sandwiched in with anecdotes and backstories such that at md-point the book seems to be about life in the Peruvian Andes. Some backstories have what seems to be gratuitous crudity, both scatological and sexual.  The best back story is Tomasito’s particularly when the dialog contrasts the old/wise and the young/impulsive.\"Feast of the Goat\" was masterful, and I remember (many years ago) \"Aunt Julia and the Script Writer\" as great.  The last two Llosa I've read (Conversation in the Cathedral and this one) have had prose that wandered too much to either enjoy or to make a point.  Were it not for the portions of exceptional prose I'd give it only one or two stars."}, {"review_sentiment": 5.0, "review_text": "Very interesting look into a culture very different from our own."}, {"review_sentiment": 5.0, "review_text": "Death in the Andes: A Novel is a masterpiece of language, Peruvian history and sociology - both in it's original Spanish and adapted English translation. Once again, Vargas Llosa proves himself a timeless storyteller."}, {"review_sentiment": 5.0, "review_text": "Thanks."}, {"review_sentiment": 5.0, "review_text": "Bought it as a gift, The recipient loved it."}]}, "authors": ["Mario Vargas Llosa"], "isbn": "0312427255", "longitude": -77.0365256, "periods": ["1900s"], "title": "Death in the Andes: A Novel", "word_cloud": "something translation seem little know reflection style first really hard get absolutely stun powerful story history trouble culture great deal material well tell fairly small volume take holiday better understand nation go happy ending skip appendix still work well reader appreciate lift extra chapter easy see famous novelist earn finish begin like much seem dark overly masculine policeman assistant station remote post charge root shin path terrorists assistant entertain tell story unrequited tragic love meanwhile mysterious sinister force village coalesce make corporal almost craze theme masterfully interwoven grip practice tenet shin group wreak havoc know senseless brutality drive people highland int city destroy infrastructure boring oppressive life mining town ancient spirituality current life highland villager belief witchcraft belief pu spirit mountain appease tension people distrust highland lowland corruption even drug lords become powerful romantic love storytelling maintain hope create bond people as female constantly aware lack woman character also north american much felt outsider look alien culture necessarily bad thing something fascinating watch author relationship policeman local bartender aptly name wife latter first repulsive embody paganism wild abandon alcohol abuse sexuality everything civilize policeman considers abhorrent obsession solve disappearance however lead become sensitive possibly even believe listener plot line important outsider want peek inside peruvian village give anything away forewarn end punch gut soon men disappear small mining village peruvian army send investigator adjutant bottom apparent murder include number local local possibility various demon deity attribute mountain follow time investigator spend remote village major story line take place narrative arc revolves investigation living tiny town primitive living condition second story line come night deputy recount affair girl league almost perhaps respect virtuous live girl relationship abusive gangster condition find untenable reaction create manner drama drama serve entertainment remote literary fiction purely character suggest strong narrative element realist genre nothing feel happen universe fact story take place area strong mother nature harsh mean plenty tension translate seem translator fine job capture rural spanish term use term terrorist avalanche create unique character concept relative place however couple term context sufficient readily straight even gift pick foreign general quite readable challenging part read tell story conversation go time period voice girl tell story chime periodically commonly commentary however author use dialogue tag avoid confusion need attentive reading enjoy story pick like something winner also trek peruvian translate literature often offer unique form insight place recommend readers fiction look broaden horizon literary fiction translate fiction good place offer humor intrigue well deep character infusion geography culture peruvian police officer outsider station remote post investigate disappearance men terrorist organization operate area cold lonely night younger officer tell older officer love story come remote location frequent bar story owner weave text hard follow tense move past present conversation interrupt warn backstory episode begin progress thing linear way hold together love begin expect serruchos style terrorist small town time best prose relate story miss bond vicuna serruchos visit french couple presumption terrorists portrait environmental researcher believe terrorist share brand good prose sandwich anecdotes backstories seem life backstories seem gratuitous crudity scatological sexual best back story particularly dialog contrast masterful remember many year ago great last prose wander much make point portion exceptional prose give star very interesting look culture different masterpiece language peruvian history sociology original adapt translation prove timeless storyteller thanks gift recipient love", "genres": ["Fiction & Literature", "Mystery & Suspense", "Politics"], "summary": "In a remote Andean village, three men have disappeared. Peruvian Army corporal Lituma and his deputy Tomás have been dispatched to investigate, and to guard the town from the Shining Path guerrillas they assume are responsible. But the townspeople do not trust the officers, and they have their own ideas about what forces claimed the bodies of the missing men. To pass the time, and to cope with their homesickness, Tomás entertains Lituma nightly with the sensuous, surreal tale of his precarious love affair with a wayward prostitute. His stories are intermingled with the ongoing mystery of the missing men.\r\n\r\nDeath in the Andes is an atmospheric suspense story and a political allegory, a panoramic view of contemporary Peru from one of the world's great novelists.", "asin": "0312427255", "rank": "403960", "city": "Lima", "image": "https://images-na.ssl-images-amazon.com/images/I/51X3W9KMgAL.jpg", "country": "Peru", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}