{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 110, "rating": 4.0, "reviews": [{"review_sentiment": 2.0, "review_text": "I was unable to finish this book. Just too boring for me."}, {"review_sentiment": 4.0, "review_text": "Interesting glimpse at the 1999 WTO riots in Seattle from the perspective of participants from all sides. Now I want to know more......"}, {"review_sentiment": 5.0, "review_text": "THE HEART IS A MUSCLE THE SIZE OF A FIST, Sunil Yapa’s debut novel, roars with energy and is a yawping celebration of language. The story takes place during a single day at the WTO protests in Seattle in 1999. The main character, Victor, is a bright, itinerant, bi-racial 19-year-old who left his Seattle home at age 16 after his mother died. He has traveled the world and seen the best and worst of what it contains. Now he finds himself back in Seattle—where his father happens to be chief of police—in the midst of the WTO protest. Through the eyes of several characters—protesters and police alike, and most notably Victor and his father—we are taken through the events of a day as the protest devolves into chaos and violence. What do we owe one another as individuals and nations, the story asks. How do we live a just life? The book reads like a glorious, if somewhat repetitive, rant, full of love and despair for the human condition. Yapa’s embrace of humanity reminds me of Walt Whitman, his deployment of language is reminiscent of the work of Colum McCann, Yapa’s teacher. I look forward to his next novel."}, {"review_sentiment": 3.0, "review_text": "Decent debut, hot-breathed writing, nuanced, challenging, filled with humanity. Gets a little lost in the lack of moving plot and over-writing."}, {"review_sentiment": 3.0, "review_text": "I needed this for a college English class that I am taking so this wasn't a book that I really wanted to read but I went in with an opened mind. I honestly don't like it and was really hard to understand because it kinda reads like a poem. But I understand the message it's trying to give and I appreciate it. I don't feel like I will read this again but good job to the author for trying so hard to make this book."}, {"review_sentiment": 4.0, "review_text": "I am enjoying this book and the way it is written. It reads smoothly and the storyline is interesting."}, {"review_sentiment": 5.0, "review_text": "really good reading"}, {"review_sentiment": 5.0, "review_text": "This book has been sitting on my shelf for over a year.  I love to buy books are read them when they speak to me.  I am SAD I waited so long to pick this up.  Wow.  Just wow.  This was powerful writing, an intense story and amazing understanding of being human. The story is told through eyes of a few characters--and dear lord, does Dr. Charles Wickramsinghe provide much relief from the heart pumping chaos of the protest.  The WTO protest is an interesting backdrop for these characters and how we understand our place in the world and how we most want those who love us to know us."}, {"review_sentiment": 3.0, "review_text": "It was interesting, but I wish the characters had been developed more. I felt like it ended before we could really got to know the characters."}, {"review_sentiment": 2.0, "review_text": "Flat characters not fully realized"}]}, "authors": ["Sunil Yapa"], "isbn": "0316386553", "longitude": -122.3300624, "periods": ["1900s", "Recent Releases"], "title": "Your Heart Is a Muscle the Size of a Fist", "word_cloud": "unable finish boring interest glimpse riot perspective participant side now want debut roar energy yaw celebration language story take place single day protest main character bright itinerant leave home age mother die travel world see best worst contains now find father happen chief midst protest eye several police alike notably take event day protest devolves chaos violence owe individual nation story ask live life read glorious somewhat repetitive rant full love despair human condition embrace humanity remind deployment language reminiscent work teacher look forward next decent debut write nuanced challenging fill humanity little lose lack move plot need college class take really want go open mind honestly really hard understand kinda read poem understand message try give appreciate feel good job author try hard make enjoy way write read smoothly story line interesting really good reading sit shelf year love speak sad wait long pick powerful write intense story amaze understanding human story tell eye character dear lord provide much relief pump chaos protest interest backdrop character understand place world want know interest wish character develop felt end really know character flat character fully realize", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Grief-stricken after his mother's death and three years of wandering the world, Victor is longing for a family and a sense of purpose. He believes he's found both when he returns home to Seattle only to be swept up in a massive protest. With young, biracial Victor o one side of the barricades and his estranged father--the white chief of police--on the opposite, the day descends into chaos, capturing in its confusion the activists, police, bystanders, and citizens from all around the world who'd arrived that day brimming with hope. By the day's end, they have all committed acts they never thought possible.\r\n\r\nAs heartbreaking as it is pulse-pounding, Yapa's virtuosic debut asks profound questions about the power of empathy in our hyper-connected modern world, and the limits of compassion, all while exploring how far we must go for family, for justice, and for love.\r\n\r\n\"A fantastic debut novel.... What is so enthralling about this novel is its syncopated riff of empathy as the perspective jumps around these participants--some peaceful, some violent, some determined, some incredulous... Yapa creates a fluid sense of the riot as it washes over the city. Your Heart is a Muscle the Size of a Fist ultimately does for WTO protests what Norman Mailer's Armies of the Night did for the 1967 March on the Pentagon, gathering that confrontation in competing visions of what happened and what it meant.\" Washington Post", "asin": "0316386553", "rank": "59943", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/510VGQwJlDL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}