{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 5, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Life in Africa in pre- and post-World War II.  This book opened my eyes to the lives of women, one black and one white, seemingly dissimilar yet so much the same.  There are some glaring spelling errors (\"tow the line\" - really?) and grammatical slips, but on the whole the book is well written.  It is an absorbing, sometimes shocking story, but an excellent read."}, {"review_sentiment": 5.0, "review_text": "Set in the 1940s it describes the life of women and the expectations they face from their surroundings. Narrated with an edge, still there is room to be different within the traditions among the natives and those who are just guests in the country."}, {"review_sentiment": 4.0, "review_text": "I recommended this book recently to my book club whose objective is to read books that give insights into different cultures.  The book is first of all an easy read.  At the beginning it seems like a simple story of life in colonial Africa in the 1930s but as the story develops it addresses attitudes to class, colour, culture, gender, colonisation, religion, superstition, etc. It does this in an engaging easy to read style from the beginning to the end.  It also allowed for some great discussion at the book club."}, {"review_sentiment": 5.0, "review_text": "I didn't expect this novel to get under my skin in quite the way it did!  It is a novel with a relatively simple premise, and somewhat conventional narrative form, and it is a perfectscaffold for a very rich, affecting, complicated, and very original tale of a child bride turned woman on the eve of Ghana's independence.  I can't get this heroine out of my mind!  Can't wait to read more from this author."}, {"review_sentiment": 5.0, "review_text": "I picked up this book at random, looking for books about Ghanaians about Ghana. I am so happy I chose Cloth Girl. It have not been able to put it down. It completely captures the life, colours, smells, traditions, feelings, everything of Ghanaian life from several totally different perspectives and weaves them together in an easy to read, enjoyable manner. The story line is interesting and the characters alive. I don't usually write reviews, but I was moved to do so for this book. I look forward to more books from this author."}]}, "authors": ["Marilyn Heward Mills"], "isbn": "0316731889", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Cloth Girl", "word_cloud": "open eye live woman black white seemingly dissimilar yet much glare spell error tow line really grammatical slip whole well write absorb sometimes shock story excellent describe life woman expectation face surroundings edge still room different tradition native guest country recommend recently club objective give insight different culture first easy begin seem simple story life colonial story develop address attitude class color culture gender colonization religion superstition engage easy style begin end also allow great discussion club expect skin quite way relatively simple premise conventional narrative form perfect scaffold rich affect complicate original tale child bride turn woman eve independence heroine mind wait author pick random look happy choose able put completely capture life color smell tradition feeling everything ghanaian life several totally different perspective weave together easy enjoyable manner story line interest character alive usually write review move look forward author", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "'Cloth Girl' is set in a British West African outpost in the 1930's/1940's, against the backdrop of the Second World War and Ghana's struggle for independence and self determination. The story's real drive however is in it depiction of the lives of two very different women.\r\n\r\nMatilda is a young fourteen year-old native schoolgirl, starting English lessons and excited about her future, when she is forced into a marriage as Second Wife to the illustrious lawyer Robert Bannerman, a native of the country who has been educated at university in England. Apart from having her prospects taken out of her hands, Matilda, still a child, has to endure the jealousy and humiliation of the lawyer's First Wife, the sophisticated and cruel Julie.\r\n\r\nWe also follow the fortunes of Audrey, the new wife of Alan Turton, an assistant to the Governor at the Colonial Office - in many respects also having her life brought to a standstill, finding it impossible to adjust to either the tedious lifestyle and behaviour expected of a Commissioner's wife or the unbearable climate of the country.\r\nFollowing the daily trials of each of these women, Marilyn Heward Mills makes 'Cloth Girl' a completely accessible and riveting read - as gripping as any thriller, with clear, lucid, expressive prose. In doing so, she manages to skilfully capture the essential nature of the differing circumstances of all the people there - the divisions and inequalities between the British colonists and the natives, their prejudices and fears, their contrasting beliefs and customs. \r\n\r\nThat she manages to do this with few direct allusions and an almost complete lack of dry historical background information, is a remarkable achievement. Her characters are completely alive and real, their little gestures of compliance and defiance in the face of the humiliations and failures they endure coming to personify the deep-rooted and irreconcilable differences in their respective cultures. \r\n\r\nHer all-encompassing viewpoint takes in a much wider perspective than the distant, aloofness and caricature that can often be found in Graham Greene's depictions of these lands. The fact that 'Cloth Girl' is the work of a first-time novelist is nothing less than astonishing.", "asin": "0316731889", "rank": "6787129", "city": "Ghana", "image": "https://images-na.ssl-images-amazon.com/images/I/61LJJ8Rt3lL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}