{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 53, "rating": 3.7, "reviews": [{"review_sentiment": 3.0, "review_text": "Rated 2.5 of 5I've really enjoyed so many of the books I've read in the past few years, but few authors stand out for absolute originality as much Lauren Beukes.In <em>Moxyland</em>, Beukes gives the reader a very believable future where technology is so integrated that it's impossible to imagine someone without their cellphone or their nanotech drug of choice. Corporations continue to grow and look for new, improved ways of hanging on to clients and have more pull and power than does the political system.  Here, individuals become corporations themselves, and social media is more 'real' (certainly more safe) than the outside world.Kendra is an art school drop-out and sellout.  She's become a walking billboard for a soft drink company - their logo shines through her skin and she's constantly craving the drink.  Toby is a video blogger who likes to think of himself as little more of a rebel than he probably is. Lerator is an AIDS-baby who works for a major corporation as one of their best programmers, but she gets a high from hacking.  And there is Tendeka, the rebel who pulls together the others and tries to cut short the strings of the corporations to the everyday people.The story is told from all four points of view, alternating by chapter.Of the Lauren Beukes books that I've read, this has so far been my least favorite.  There are many similarities with Zoo Story - mostly with the setting and the technology running amok ideas - perhaps this is becoming her signature, but because of the alternating points of view, the story becomes much more fractured.  I never quite bond with any of the characters because just when I felt I was about to understand them and see their side of things, I'd be switched to someone else's view.Because Beukes is so original, I spent a fair amount of time just grasping on to new concepts and trying to understand the world and the technology. Add this to the jumping points of view and I really struggled to get to know the people who mattered in the story.  Because for all her concepts, Beukes still writes about people and human behavior.  And without my connection to them, the story didn't have the impact that it should.I want to read this again.  Knowing now how the story is presented, and now more familiar with the setting, I think I'd be ready to pick up more on the characters' story.  But for a one-time reading, this just doesn't quite work.Looking for a good book? Lauren Beukes reaches out into some new territory once again, with <em>Moxyland</em>, but the fractured story-telling style keeps the reader from becoming fully vested.I received a digital copy of this book from the publisher, through Netgalley, in exchange for an honest review."}, {"review_sentiment": 3.0, "review_text": "I started this book, thinking how interesting it is because it's set in a dystopian world where being disconnected from your online device is almost like a death punishment. Very cool idea, and I enjoyed reading how the characters interacted in this new world. The only problem I have is that none of the characters in this book are really that likable. That might be on purpose but it makes it really difficult to keep reading when you can't connect with any of the main characters. Even the guy that wants to lead a revolution is kind of annoying to listen to in your head after just a few pages in his POV. I will try out Zoo City and see if it's any better err"}, {"review_sentiment": 5.0, "review_text": "I very much enjoyed this book - it's an original take on a near-future dystopia, and I love that it's not the standard American setting. Science fiction set in Africa is interesting and exciting, and the cultural background was (imo) well portrayed. Very Blade Runner in feel, dark but not doom-saying. Would recommend."}, {"review_sentiment": 2.0, "review_text": "Interesting, but didn't really float my boat. Ended rather abruptly."}, {"review_sentiment": 3.0, "review_text": "When I read Neuromancer, I thought that cyberpunk was just way too technical for me. I didn't major in computer science, I'm not a programmer, and you're going to completely lose me with all that sort of jargon. But then I read Snow Crash, and I felt like I \"got it.\" Moxyland is written more along that sort of vein: there's an element of grit and seediness amidst all the shiny future tech, and that is the sort of cyberpunk that I can get on board with.Beukes's world-building in Moxyland is impressive in how believable a future it seems to be. People today are already reliant on technology for nearly everything, and the way many people treat their phones, you'd think they were natural appendages. Moxyland takes all of that, but one step further.Now, while the stories and the world-building held real interest for me, I didn't find myself all that invested in some of the characters...All that being said, I still enjoyed reading Moxyland. Despite not being overly engaged by the characters themselves, their stories were interesting and I appreciated Beukes bringing aspects of actual Cape Town flavor (particularly slang) to her world's youth culture, instead of inventing something completely new for the sake of futuristic world-building. I thought that lent a more authentic sense to the possible reality of her world. If you're interested at all in things like corporate take-over dystopia or cyberpunk in general, I'd recommend giving this a try. It's not a book I really see myself RE-reading, but I'm certainly not sorry I picked it up. There are some interesting twists at the end...For full review, please visit me at Here Be Bookwyrms"}, {"review_sentiment": 1.0, "review_text": "I really struggled through this book, it was very difficult to find any context for the story as there was no indication of the history behind the situation that the characters found themselves in, you realize that it is a form of rebellion against a form of control, but no idea why."}, {"review_sentiment": 4.0, "review_text": "I spent the time in this book feeling disoriented while also spotting and leaning into ideas and concepts that seemed both possible, if not eventualities. This is a book that you plunge into an see where it takes you. I was pleasantly surprised by the layering of politics and pop culture, African specific memories and points of reference, and interesting characters. Well done!"}, {"review_sentiment": 4.0, "review_text": "I’d been wanting to read this for awhile because the cover art looked nifty, but the reviews on Amazon weren’t terribly stellar so I was hesitant. One of Beukes newer books, Broken Monsters, however, has been garnering a ton of really great press recently, so I figured what probably happened is that Beukes has writing chops out the wazoo, but there was a fundamental flaw in the plot of this particular story.I love dissecting stories and seeing what worked and what didn’t, so I hopped into Moxy Land after rustling it up for next to zero money’s on Amazon. Cheap is good. I like cheap.As I suspected the writing for Moxy Land was fantastic. Beukes took an incredibly difficult narrative style (alternating first person points of view every other chapter) and made it work pretty darn well. It’s rare to see alternating first person points of view because what tends to happen is that the characters all become a blur. They all start sounding alike and acting alike. Bad news where compelling narrative is involved.But Lauren somehow makes it work. Each of her 4 point of view characters is distinct enough to remain engaging. That alone is impressive and speaks to her impressive writing chops.Moxy Land doesn’t rest on the strength of the writing, however. The world building is superb. It’s gritty and multi-layered with a depth that shows Beukes really knows what she’s talking about.What I’m about to say next might upset some people ‘ cause I’m sure I won’t word it correctly and it’ll bring a shit-storm of hate in its wake. I’m prepared for that, but I’ll tread carefully.The best Science Fiction/Fantasy women authors recently have been garnering a lot of attention for their unique and progressive takes on gender roles and sexual orientations and the cultural effects of those two dynamics on future societies: think Kameron Hurley’s The Mirror Empire, or Anne Leckie’s Ancillary Justice.Don’t get me wrong, these are very important ideas with much fertile soil to be tilled. I think the genre as a whole is only strengthened by these types of works. But, my problem with these plot devices is that they become the entire plot. Sure, there is a story taking place underneath it all, but it’s being blurred over.When people talk about Mirror Empire they talk about the unique matriarchal societies. When people talk about Ancillary Justice, they talk about the fact that Leckie only uses the feminine pronoun. What gets lost in all the hullaballoo is the story itself.That’s not necessarily a bad thing, but I tend to be a story guy. (Which, let me point out for those wondering, both of those books have great stories, but nobody ever talks about them. Only the gender issues.)Now, back to Moxy Land and Lauren Beukes, who is one of new favorite sci-fi women authors precisely because she doesn’t let her story get bogged down by those facets of modern Sci-Fi which are quickly becoming tropes. There are compelling sexual orientations throughout the story, but they are flavoring which add a touch of realism, and not the point of the story itself.The problem with Moxy Land, however, is that the story moves really slowly. Things are happening, but with so many point of view characters, it’s hard getting a feeling of urgency or forward progress. So the story kind of limps along until finishing with an anti-climatic fizzle. Oh, well. I chalk that up to Beukes being a newer author at the time of Moxy Land’s writing. I suspect she’s improved drastically in this area in her newer books which I’m eagerly looking forward too.Pick up something by Lauren Beukes, I don’t think you’ll regret it.Original review available on OneLazyRobotBlog.com"}, {"review_sentiment": 4.0, "review_text": "Moxyland is a severely dystopian tale of a corporate apartheid state in Cape Town, South Africa, where the government punishes people through their cell phones and bio-weapons are used as crowd control. An intense read, and a worthy one, but may be too dark for some readers."}, {"review_sentiment": 4.0, "review_text": "Ms. Beukes debut novel is a compelling story of what could come to pass for our technology-besotted society. She weaves multiple storylines effectively, showing what could or will come, as the world continues to sacrifice privacy for convenience. Sometimes it is hard to navigate the techno-speak combined with South African slang, but the book is worth the extra effort by the time one is heading towards the inevitable ending."}]}, "authors": ["Lauren Beukes"], "isbn": "0316267910", "longitude": 18.417396, "periods": ["2000s", "Recent Releases"], "title": "Moxyland", "word_cloud": "rat really enjoyed many past year author stand absolute originality much em give believable future technology integrate impossible imagine someone cellphone nanotech drug choice continue new improve way hang client pull power political system here individual become corporation social medium certainly safe art school sellout become walk billboard soft drink company logo shine skin constantly crave video blogger like think little rebel probably work major corporation best programmer get high hacking rebel pull together others try cut short string corporation everyday story tell point view alternate far least favorite many similarity mostly set technology run amok idea perhaps become signature alternate point view story becomes much fracture never quite bond character felt understand see side thing switch someone else original spend fair amount time grasp new concept try understand world technology jump point view really struggle know people matter story concept still write people human behavior connection story impact want know story present familiar set think ready pick character story read quite good reach new territory em fracture style keep become fully receive digital copy publisher exchange honest review start think interest set dystonia world disconnect online device almost death punishment cool idea enjoy read character interact new world problem none character really likable make really difficult reading main character even guy want lead revolution kind annoy listen head page try zoo see better err much enjoy original take dystonia love standard setting fiction set interest excite cultural background imo well portrayed feel dark interest really float boat end rather abruptly necromancer think cyberpunk way technical major computer science programmer go completely sort jargon snow felt get write sort element grit seediness midst shiny future tech sort cyberpunk get board impressive believable future seem people today already reliant technology nearly everything way many people treat phone think natural appendage take step story hold real interest find invested character say still enjoy read overly engage character story interest appreciate bring aspect actual flavor particularly slang world youth culture instead invent something completely new sake futuristic think lent authentic sense possible reality world interested thing corporate dystonia cyberpunk general recommend give try really see certainly sorry pick interest twist end full review please visit here really struggle difficult find context story indication history situation character find realize form rebellion form control idea spend time feeling disorient also spot lean idea concept seem possible eventuality plunge see take pleasantly surprise layer politics pop culture specific memories point reference interesting character well do want awhile cover art look nifty review terribly stellar hesitant newer however garner ton really great press recently figure probably happen write chop wazoo fundamental flaw plot particular love dissect story see work hop rustle next zero money good like suspect write fantastic take incredibly difficult narrative style alternate first person point view chapter make work pretty darn well rare alternate first person point view tend happen character become start sound alike act alike news compel narrative somehow make work point view character distinct enough remain engage alone impressive speaks impressive write rest strength write however world building superb gritty depth show really know talk say next people cause sure word correctly bring hate wake prepare tread best science woman author recently garner lot attention unique progressive take gender role sexual orientation cultural effect dynamic future society think wrong important idea much soil till think genre whole strengthen type work problem plot device become entire plot story take place underneath blur people talk talk unique matriarchal society people talk talk fact use feminine pronoun get lose hullabaloo story necessarily bad thing tend story guy let point wonder great story nobody ever talk only gender issue now back new favorite woman author precisely let story bogged facet modern quickly become trope compel sexual orientation story flavor touch realism point story problem however story move really slowly happen many point view character hard get feel urgency forward progress story kind limp finish fizzle well chalk newer author time write suspect improve drastically area newer eagerly look forward something think regret review available severely dystonia tale corporate apartheid state government punishes people cell phone use crowd control intense worthy reader rebuke debut compel story pas society weave multiple story lines effectively show world continue sacrifice privacy convenience sometimes hard navigate combine african slang worth extra effort time heading towards inevitable end", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "Lauren Beukes's frighteningly persuasive, high-tech fable that follows four narrators living in a dystopian near-future.\r\n\r\nKendra, an art-school dropout, brands herself for a nanotech marketing program. Lerato, an ambitious AIDS baby, plots to defect from her corporate employers. Tendeka, a hot-headed activist, is becoming increasingly rabid. Toby, a roguish blogger, discovers that the video games he plays for cash are much more than they seem.\r\n\r\nOn a collision course that will rewire their lives, these characters crackle with bold and infectious ideas, connecting a ruthless corporate-apartheid government with video games, biotech attack dogs, slippery online identities, a township soccer school, shocking cell phones, addictive branding, and genetically modified art. Taking hedonistic trends in society to their ultimate conclusions, Lauren Beukes spins a tale of a utopia gone wrong, satirically undermining the idea of progress as society's white knight.\r\n\r\n\"Moxyland does lots of things, masterfully, that lots of sf never even guesses that it *could* be doing.\" William Gibson", "asin": "0316267910", "rank": "271235", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/51qoQ4s8RbL.jpg", "country": "RSA", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}