{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 65, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "An indepth, extremely readable and absorbing book about Vietnamese culture, and the circumstances that helped a small country with a shrewd cadre of fighters to overcome the might of the U.S. Once you read this you begin to see how horribly detrimental the lies our government told the public for years helped continue a senseless killing of thousands of young lives. The U.S. was wrong, dead wrong, in every single way in its tactics fighting this war. It was unwinnable."}, {"review_sentiment": 5.0, "review_text": "Excellent book. First book viweing the war from the Vietnamese cultural viewpoint and really helped me understand why nation building in Viet Nam was such a futile waste from day one. We just never got it. I read it back in 1973 while serving on a tin can home ported out of Yokosuka, Japan. Spent the better part of 4 years off and on patrolling the Tonkin Gulf and eventually ended up off Vung Tau in late April '75 picking up evacuees from Saigon. After viewing Ken Burn's Viet Nam I realized that I no longer had my copy of this great book and so ordered a new copy to fill out my Viet Nam War library."}, {"review_sentiment": 4.0, "review_text": "Its very interesting, however, it is a lot like required reading and of course your professor wrote the book. Although the main points are repeated several times throughout, the fact that remember that era from the 10th grade on, made it easier for me to follow. I must say I really enjoyed the book. Right or wrong, I served in country."}, {"review_sentiment": 2.0, "review_text": "I'm a Vietnam veteran and i read this book years ago.  I must agree with those who say this book is a product of its time and is now outdated.  Yes, the American culture stresses quick results and the Vietnamese culture stresses a longer view.- but that doesn't require a whole book.  And, it doesn't follow that the Americans were all idiots and the Vietnamese were all wise.  There was plenty of stupidity on both sides.  And a book which glosses over communist atrocities is not telling the whole story."}, {"review_sentiment": 5.0, "review_text": "This was a gift for my dad, an officer during the Vietnam War who served through the Tet Offensive. He rated this five stars."}, {"review_sentiment": 4.0, "review_text": "Ok"}, {"review_sentiment": 5.0, "review_text": "Just as described arrived sooner than expected"}, {"review_sentiment": 5.0, "review_text": "I read this book way back then. After \"The Best and the Brightest\", twice, and other works that tried to explain the conflict in Southeast Asia. The image conveyed in the title, that of opposing forces, ie: fire and water in a lake of water informs the premise of the book and the books' intent.This is a work of philosophy, not action.Even so, I'm glad I read the book."}, {"review_sentiment": 5.0, "review_text": "Absolutely excellent. Extremely comprehensive."}, {"review_sentiment": 5.0, "review_text": "Well worth the price."}]}, "authors": ["Frances FitzGerald"], "isbn": "0316159190", "longitude": 0.0, "periods": ["1900s"], "title": "Fire in the Lake: The Vietnamese and the Americans in Vietnam", "word_cloud": "in depth extremely readable absorb culture circumstance help small country shrewd cadre fighter overcome once see horribly detrimental lie government tell public year help senseless kill thousand young live wrong dead wrong single way tactic fight war unwinnable view war cultural viewpoint really help nation build futile waste day never get serve tin home port better part year patrol eventually end late picking evacuee view realize longer copy great ordered new copy fill library interesting however lot require reading course professor write main point repeat several time fact era grade make easier follow really enjoy wrong serve country year ago product time outdated yes american culture stress quick result culture stress longer whole follow idiots wise plenty stupidity side gloss communist atrocity tell whole story gift dad officer serve rat star ok just describe arrived sooner expect way back twice work tried explain conflict image convey title oppose force ie water lake water informs premise work philosophy glad absolutely excellent extremely comprehensive well worth price", "genres": ["History", "Travel Writing", "Journalism"], "summary": "Fire in the Lake is a book by American journalist Frances FitzGerald about Vietnam, its history and national character, and the United States warfare there. \r\n\r\nThe book was ranked by critics as one of the top books of the year, it was on the New York Times bestseller list for more than 10 weeks, and it won the Pulitzer Prize for General Non-Fiction.\r\n\r\nThis was the first major book by an American on Vietnam, its history, and the United States activities there. \r\n\r\nFitzGerald said it was a \"first draft of history.\" She explored thousands of years of the history and culture of Vietnam, showing how these affected the relations of its peoples with the relatively brief encounter with the United States. She says that the US understood little about the country and its leaders, reacting to the threat of communism rather than recognizing the nation's long struggle to gain and keep its independence from foreign invaders.", "asin": "0316159190", "rank": "80257", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51OZ6c53PpL.jpg", "country": "Hanoi", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}