{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 1252, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "A sometimes great book if you have a great deal of time to spare.  Engaging and usually not too difficult to follow."}, {"review_sentiment": 4.0, "review_text": "Infinite Jest is the source of a reader-cult like few other modern novels. Wallace is a hell of an expressive writer as well as being bold and audacious. Objectively IJ falls far short of the faithful's love of it, but it's worth reading for its own sake. Just be prepared for a great, unfinished work that's by turns fascinating, inciteful, and mind-numbing. Forget the fact that you're supposed to love the book and take it as it comes."}, {"review_sentiment": 1.0, "review_text": "Just too long for me to get involved in...It is acclaimed as a great work, but the footnotes were too annoying and the book entirely too long for me to invest my time into reading. I enjoyed his other book, \"The Broom of the System,\" but that proved to be a project, and while it was funny and brilliant, I was not ready to take an even more monsterously larger plunge into this one..."}, {"review_sentiment": 1.0, "review_text": "Wallace did write one book which had real characters, even if not much of a plot ... The Pale King,about IRS auditors in a Midwest office .. it was powerful enough that I made the mistake of buyinghis two other novels. Aside from a very funny paragraph about a dreamer attempting and failingto sexually pleasure Queen Victoria (in The Voice of the Lobster),  they were both plotless andpointless wastes of time.Seeing so many rave reviews, and always enjoying a fat book, I bought Infinite Jest to see ifit was closer to The Pale King in quality.  No way!  Possibly Wallace's worst book.  Humor?  Lame lame humor. Here is one example: Wallace postulates a commercial America where year dates have been sold tocompanies which can give their name to that year: hence, \"Year of the Dove Bar', \"Year of the Whopper\", andhis favorite \"Year of the Depend Adult Undergarment\".  Since most of the events of the novel occur in that year,and since the book is written in the form of usually 2 to 3 page segments, with the year name ALWAYS put at the start of each segment,this underwear joke gets repeated over and over and over ....  Wallace's other attempts at humor are equally at the junior high school level.  The characters are two-dimensional at best, usually one-dimensional or not even that, just a cliche phrase ..... the authoritarian old German coach .... .... black teenagers from the 'hood' (with some of the lamest would-be black dialogue I have ever read).  The plots - SPOILER ALERT - appear to be on three levels, as far as I read (I stopped at page 80):  realistic portrayals of drug-addicted young adults ... a DVD that if you watch, you will be unable to stop watching and so will eventually die from lack of food or movement .... a family of very thoughtful young adult athletes.The poverty of the plot or character development is disguised by ultra-fancy technical game-playing:  350 plus footnotes, which destroy whatever plot momentum there might be and most of which are unnecessary: the many slang-names for drugs could be all identified with parentheses in their relative sentence (i.e., Bob Hope = dope. See how easy that is), and the 'scientific' commentaries or definitions are superfluous.  The book is interlarded with brief paragraphs condensing some scientific theory or other that has nothing to do with the plot or characters.It looks like this book rode the 'new novel - absurdist' wave that started in the late 60s, from Pynchon and Barthelme and Barth. If you enjoy this type of book you may well love Infinite Jest.  I prefer books with REAL characters and REAL plots: T.C. Boyle, Deborah Eisenberg, Frank Jones, and so many others are head and shoulders above this type of stale-humored,  cardboard character collection,  plotless and pointless game-playing.  Gore Vidal wrote a brilliantly vitriolic essay - in his USA collection -  detailing what was so pointlesss and sophomoric about Barthelme and company, concluding with the thought that the chief value of such novels was that they gave English departments something to write about. Well, put this one on the list - it has all the same flaws and the same lack of virtues."}, {"review_sentiment": 5.0, "review_text": "Love it"}, {"review_sentiment": 2.0, "review_text": "I'm a big fan of David Foster Wallace's magazine articles/essays. (Nice collections in \"Consider the Lobster\" and \"A Supposedly Fun Thing I'll Never Do Again.\") \"Infinite Jest,\" on the other hand, is (in my humble opinion, a horrible hodgepodge, vastly overwritten, pretentious and (gasp) sometimes dull.  Confession: I did not finish reading the book; I'm too old and life is too short to plod through this mess. I thought, at the start, this was going to be a delight. The first chunk, on protagonist tennis phenom facing college deans and assorted administrators trying to figuree out if he's academically qualified, was marvelous stuff. But then came a lot of disjointed and overwritten stuff, and more and more of the same, with just snippets of clevverness and just a sniff of some plot going somewhere.  After a couple hundred pages of this, I called it quits, and I feel so much better. Some books you just can't put down, and some books you should just never pick up. \"Infinited Jest\" is one of the latter."}, {"review_sentiment": 5.0, "review_text": "DFW = rock star of post-postmodern literature. Tasty footnotes!"}, {"review_sentiment": 5.0, "review_text": "it good book"}, {"review_sentiment": 5.0, "review_text": "Incredible Novel.  This took me quite a bit of time to read (3 years off and on), is somewhat confusing with an open ended ending but well worth it given the current political climate.  The writer expounds on our endless need for diversion and the ways we try to escape our sense of monotony through substance abuse and entertainment.  I found the last part to be the most moving, if one can say that, due to the incredible focus on the inner lives of some of the main characters.  If you are up for a challenge this is the one."}, {"review_sentiment": 1.0, "review_text": "If Wallace opened up the new generation of fiction, I will be reading nonfiction exclusively from now on"}]}, "authors": ["David Foster Wallace"], "isbn": "0316306053", "longitude": -71.0595678, "periods": ["1900s"], "title": "Infinite Jest: A Novel -- 20th Anniversary Edition", "word_cloud": "sometimes great great deal time spare usually difficult follow source modern novel hell expressive writer well bold audacious objectively fall far short faithful love worth read sake prepare great unfinished work turn fascinate inciteful fact suppose take come just long get involve acclaim great work footnote annoy entirely long invest time read enjoy prove project funny brilliant ready even monstrously larger plunge write real character even much auditor office powerful enough make buying his novel aside funny paragraph dreamer attempt failing to sexually pleasure plot less and pointless waste many rave review always enjoy fat buy see fit closer quality way possibly worst lame humor here example postulate commercial year date sell to companies give name year hence favorite event year write form usually page segment year name put segment underwear joke get repeat attempt humor equally junior high school level character best usually even phrase authoritarian old german coach black teenager lamest black dialogue ever plot appear level far stop realistic portrayal young adult watch unable stop watch eventually die lack food movement family thoughtful young adult poverty plot character development disguise technical footnote destroy plot momentum many drug parenthesis relative sentence dope easy commentary definition superfluous interlarded brief paragraph condense scientific theory nothing plot look rode absurdist wave start late enjoy type well prefer real character plot many others head shoulder type cardboard character collection plot less pointless write brilliantly vitriolic essay collection detail pointless sophomoric company conclude thought chief value novel give english department something write list flaw lack virtue big fan magazine collection never do hand humble opinion horrible hodgepodge vastly overwritten pretentious gasp sometimes dull confession finish read old life short plod mess think start go delight first chunk protagonist tennis phenom face college dean assorted administrator try figure academically qualify marvelous stuff come lot disjoint overwritten stuff snippet cleverness sniff plot go somewhere couple hundred page call quits feel much better never pick infinite latter rock star literature footnote good incredible take quite bit time year somewhat confuse open end end well give current political climate writer expound endless need diversion way try escape sense monotony substance entertainment find last part move say due incredible focus inner live main character challenge open new generation fiction read nonfiction exclusively", "genres": ["Fiction & Literature"], "summary": "This deluxe paperback edition--featuring flaps, new cover art, and a new foreword by Tom Bissell--celebrates the 20th anniversary of the original publication of Infinite Jest.\r\n\r\nA gargantuan, mind-altering comedy about the Pursuit of Happiness in America set in an addicts' halfway house and a tennis academy, and featuring the most endearingly screwed-up family to come along in recent fiction, Infinite Jest explores essential questions about what entertainment is and why it has come to so dominate our lives; about how our desire for entertainment affects our need to connect with other people; and about what the pleasures we choose say about who we are. \r\n\r\nEqual parts philosophical quest and screwball comedy, Infinite Jest bends every rule of fiction without sacrificing for a moment its own entertainment value. It is an exuberant, uniquely American exploration of the passions that make us human - and one of those rare books that renew the idea of what a novel can do.", "asin": "0316306053", "rank": "29373", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/41z4Ndz6qQL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}