{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 143, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "Good read"}, {"review_sentiment": 5.0, "review_text": "Wonderful info on the world’s greatest religions and cultural way of life."}, {"review_sentiment": 3.0, "review_text": "Still in the process of reading it. Am having trouble following the story line."}, {"review_sentiment": 5.0, "review_text": "A scholarly elucidation of a \"lost\" golden age, life in a vivid thriving culture that was medieval Spain."}, {"review_sentiment": 5.0, "review_text": "a. In 755 AD a 20 year old Muslim man, named Abd al-Rahman, traveled from Damascus (Syria) to Cordoba (Spain). He was a member of the ruling Umayyad family, most of whom had been killed by the rival Abbasid family. In Cordoba the rulers were Goths (Christians) who had overrun the Roman empire centuries earlier. Within a few years, Abd al-Rahman became the ruler of Cordoba and then the rest of southern Spain. He did this not as much by military conquest but instead by leadership in technology.b. During the next 300 years, these Muslims (called Moors) became the intellectual center of the world. The rest of Europe was a going through the Dark Ages, which included many wars and the plague. The Moors were very tolerant of other religions. They even created a word, “dhimmi” when refers to the policy of protecting minorities. When the Moors first arrived in Spain the Jews lived a very frugal life. After the Moors, the Jews became the most prosperous in the world.c. The Moors emphasized the study of ancient literature. They translated many Greek and Roman texts into Arabic. The library in Cordoba contained more than 400,000 books. Libraries in other parts of Europe usually contained no more than 400 books. The Moors had learned how to produce inexpensive paper (from the Chinese) and they had a large paper factory in Valencia. They also made major advances in Algebra. This included the use of the decimal point (invented in India).d. Cordoba was conquered by barbarians from north Africa (Berbers) in the year 1009. Their culture was transplanted 100 miles to the east in Granada. In 1238 the last Muslim dynasty in Spain, called the Nasrids, started building the complex of castles called the Alhambra. This is located on a large hill in Granada suitable for self-defense. In 1085 a Christian monarch, named Alfonso VI of Castile, took over Toledo, a city which is about 200 miles north of Grenada. He chose to protect the Moorish culture. During the next 150 years, most of the Jews in Granada moved to Toledo. In 1492 Ferdinand and Isabella took over the Alhambra and built their own castle inside some of the other castles there. They expelled all the Jews from Spain and they burned all the books that the Moors had written in Arabic. This was the beginning of the Spanish Inquisition, which lasted almost 400 years.e. The author named Cervantes was born in Toledo and grew up there. In 1615 he published his book titled “Don Quixote”, which became the second most widely read book in the world (after the Bible). The story included complaints about intolerance. By the year 1400 the intellectual center of the world moved to Italy, notably, Florence. This is called the Renaissance.f. In 1829, an American author named Washington Irving visited the Alhambra. His book, titled “Tales of the Alhambra” prompted the Spanish government to start restoring this area, which consists of four palaces. The beauty of this area and the amazing skill of our tour guide made this by far my favorite excursion of the entire cruise!"}, {"review_sentiment": 4.0, "review_text": "I read the kindle edition while in Spain and it made my trip so  interesting! What a great story and told well. Maria can write readable long sentences but also excessively long and incoherent ones. Many, many typos and minor mistakes. These flaws could be easily fixed by a good copy editor."}, {"review_sentiment": 5.0, "review_text": "Read in 2012, rereading now for a group. The subtitle is, \"How Muslims, Jews and Christians Created a Culture of Tolerance in Medieval Spain.\" The Dark Ages weren't always dark, and we today aren't as advanced as we sometimes pride ourselves on being."}, {"review_sentiment": 5.0, "review_text": "This history book opened a new world for me. I did not learn about this chapter in history from school. Mernocal writes in a balanced way about the complexities of life in the middle ages where Muslims, Jews, and Christians lived and thrived side by side. for centuries.  Then, she writes of the unraveling of this way of life through time by the fundamentalists in each religion.To me, it spoke of the need today to look closely at our America  values of freedom of religion and tolerance for that freedom that is inherent in our constitution."}, {"review_sentiment": 5.0, "review_text": "The author does a great job of clearing up misconceptions of Muslim Spain and goes on to explain what it was that Jews, Muslims and Christians actually accomplished working together in peace.  They carried out the greatest translation project in the history of the world. Ancient Greek and Roman works of arts and sciences almost disappeared after the fall of the Roman Empire but those that survived were preserved by being translated into Arabic and then later into Latin igniting a revival of learning that resulted in our modern world.  What would these thinkers - Aristotle, Plato, Euclid, etc - say if they knew they would end up saving the planet 1,500 years after their era.  What would they think of the crazies today who want to destroy the planet."}, {"review_sentiment": 5.0, "review_text": "A fascinating history book that is well written and reads like a novel. Having this background information, I can't wait to visit this area of Spain."}]}, "authors": ["Maria Rosa Menocal"], "isbn": "0316168718", "longitude": 0.0, "periods": ["500-1400s"], "title": "The Ornament of the World: How Muslims, Jews and Christians Created a Culture of Tolerance in Medieval Spain", "word_cloud": "good wonderful info world greatest religion cultural way life still process read trouble follow story line scholarly elucidation lose golden age life thriving year old man name travel member rule family kill rival family ruler overrun empire century earlier year become ruler rest southern much military conquest instead leadership next year call moor become intellectual center world rest go include many war plague tolerant religion even word dhimmi refers policy protect minority moor first arrive live frugal life become prosperous emphasize study ancient literature translate many texts library contain part usually contain moor learn produce inexpensive paper large paper factory also make major advance algebra include use decimal point invent conquer barbarian north year transplant mile east last dynasty call start build complex castle call locate large hill suitable monarch name take city mile north choose protect moorish next year move take build castle castle expel burn write begin spanish last almost author name grow publish titled become second widely world story include complaint intolerance year intellectual center world move notably call author name visit titled prompt spanish government start restore area consist palace beauty area amaze tour guide make far favorite excursion entire cruise kindle edition make trip interest great story tell well write readable long sentence also excessively long incoherent one many typo minor mistake flaw easily fix good copy editor reread group subtitle always dark today advance sometimes history open new world learn chapter history school writes balance way complexity life middle age live thrived side side century then write unravel way life time fundamentalist speak today closely value freedom religion freedom inherent constitution author great job clear misconception go actually accomplish work together peace carry greatest translation project history world work art science almost disappear fall survive preserve translate later ignite revival learning result modern world say knew save planet year era crazy today want destroy planet fascinating history well write read have background information visit area", "genres": ["History"], "summary": "María Rosa Menocal's wafting, ineffably sad The Ornament of the World tells of a time and place - from 786 to 1492, in Andalucía, Spain - that is largely and unjustly overshadowed in most historical chronicles. \r\n\r\nIt was a time when three cultures (Judaic, Islamic, and Christian) forged a relatively stable, though occasionally contentious, coexistence. Such was this period that there remains in Toledo a church with an homage to Arabic writing on its walls and a sumptuous 14th-century synagogue built to look like Granada's Alhambra. Long gone, however, is the Córdoba library - a thousand times larger than any other in Christian Europe. \r\n\r\nMenocal's history is one of palatine cities, of philosophers, of poets whose work inspired Chaucer and Boccaccio, of weeping fountains, breezy courtyards, and a long-running tolerance \"profoundly rooted in the cultivation of the complexities, charms and challenges of contradictions,\" which ended with the repression of Judaism and Islam the same year Columbus sailed to the New World. ", "asin": "0316168718", "rank": "35793", "city": "Andalucia", "image": "https://images-na.ssl-images-amazon.com/images/I/51tp30EADeL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}