{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -26.205, "ratings": {"num_ratings": 144, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "I can't remember the last time I tore through a novel so fast. Gut-wrenching and compact and so obscenely urban and down to earth you can almost feel the words oozing through your pores and into your bloodstream. Beukes isn't afraid of painting a vivid and visceral picture of a alternative neo South Africa and pushing every conceivable sensory detail through our ear-holes like a sharpened pencil.If it wasn't for the deus ex-machine/ semi non-ending it would have been one of my all time favourites and a very high five stars. As it stands it gets a 4.5 and a standing ovation as one of the better books I've read in a while"}, {"review_sentiment": 4.0, "review_text": "Zoo City is a fantasy sci-fi thriller set in the near future in Johannesburg which uses Shona cosmology and animal familiars to examine a racism that is so ingrained that many don’t even realize that it’s there. Lauren Beukes’ descriptions of both the vibe of the city and its physical reality capture the twin undercurrents of promise and foreboding that are Johannesburg today. The book suffers from a common flaw often found in the fantasy/sci-fi genre: while the setting up of Beukes “world” and the storytelling and dialogue are spot on, the ending is unsatisfying and not on par with the rest of the book. The ride is much better than the final destination. That said, I read this while visiting Johannesburg and “the ride” is so well done that I would recommend it to anyone visiting the city."}, {"review_sentiment": 4.0, "review_text": "Enjoyed this very different fantasy. The place is South Africa and everyone who has sinned is attached to an animal which represents, in some way, their past sins. Take a chance on this one."}, {"review_sentiment": 3.0, "review_text": "Zoo City was so weird, but definitely in a good way! Zinzi is a recovering addict and an ex-journalist who now writes scam e-mails when she's not using her magic to find lost items. While she's returning her latest finds, one of her clients winds up dead, she's a suspect, and someone wants to hire for a missing person (one of her no-nos!). Well, Zinzi needs the money after her payment is confiscated as \"evidence\" and soon she's sucked into the glamorous and dangerous music industry as she searches for a missing popstar.What I liked best about Zoo City was the format. It is mainly told from Zinzi's first person account, but there's also some addition documents thrown in. We get an example of one of her e-mail scams which we also get to see her follow up with the in-person portion. There's movie blurbs and reviews which explain more about the Aposymbiots (people who have animals linked to them). There's some magazine articles about the singers and producer that Zinzi is working with. It all came together very well and didn't disrupt the flow of the story at all. I just wish there had been something that fully explained where these animal companions came from and how they get tied to their human.Where Zoo City started to lose me was in the last 100 or so pages. Zinzi had already found Song, so what else is there? Sure the circumstances were quite suspicious, but I'm not sure that I cared anymore. Once Song is back home, there's suddenly more action and danger, and Zinzi just can't catch a break. It was a lot crammed in all of a sudden, and it did get to be a bit confusing in places. The ending is also quite bittersweet. I definitely can't call that a happy ending based on everything that happened. But I suppose things worked out at least for Zinzi?In the end, I liked Zoo City. It held my attention until nearly the end. The setting and world building are quite unique and interesting. I can honestly say that I hadn't read anything quite like this before."}, {"review_sentiment": 4.0, "review_text": "Zoo City is a scab of a community, a crowded slum where some people a bonded with an animal 'familiar' - to use a (pardon the pun) more familiar term - referred to as 'zoos.'  Zinzi lives in Zoo City, along with her Sloth.  Zinzi has a 'gift' of finding lost things.  Though she doesn't like looking for lost people things are a bit tough for her right now and she needs the work.  She's hired by music producer Odi Huron to find a teen pop star - one of the members of a group known as iJusi.At one time in her life, Zinzi was a reporter, until a drug habit landed her in prison.  Now she's weighed down by guilt and her sloth, trying to find her path.  But as she searches for iJusi she encounters something pretty deviant...someone is snatching Zoos and cutting them up to sell their parts to make a little money to buy drugs.  And someone who knows about Zinzi's past is making her out to be criminal.Through the dirty, gritty streets in Zoo City, Zinzi has to evade both the criminals who inhabit the area and the law who would rather leave Zoo City to rot.I've written before, not too long ago, about my appreciation for Beukes' writing.  <em>Zoo City</em> is part horror/dark fantasy and part urban fantasy, and entirely original.  It's been a long time since I've read something that was this unique.  It is also incredibly gritty and dank.  Beukes writes so sharply that I felt I could smell the neighborhoods and the sewage drains and I could feel the fur of Zinzi's sloth.Beukes' writing is so incredibly captivating and the ideas she works with are so original, and her South African locations so unusual (to me at least) that it's easy to overlook the simplicity of the plot.  There's an awful lot that Beukes doesn't tell us - which I actually kind of like ... up to a point.  If answers don't come at all and I'm left with more questions than answers at book's end, then something might be missing.Still, I am at a point where, if I see Lauren Beukes' name on a book, I will want to read it because I know I will be taken somewhere completely new, and I like that a lot.Looking for a good book?  Lauren Beukes' <em>Zoo City</em> is a highly original dark urban fantasy that will leave you breathless and you might not even notice that the plot is a little on the thin side.I received a digital copy of this book from the publisher, through Netgalley, in exchange for an honest review."}, {"review_sentiment": 5.0, "review_text": "Wonderful, inventive and beautifully flawed characters. First sci-fi I've read from South Africa. I learned a lot of new words.  Fresh perspective.  I highly recommend this book and this author."}, {"review_sentiment": 5.0, "review_text": "4.5 stars.  Wow.  That was entirely different!  An exciting, insightful, strange, gritty, and unexpected ride.  Calling this book an urban fantasy and crime noir only scratches the surface.  The story takes place in Joburg, South Africa, in the early 2000s, with one major twist.  A worldwide phenomenon has occurred -- people who do things that make them feel extreme guilt (usually murders, rapes, and the like) are afflicted with Acquired Aposymbiotic Familiarism.  Sufferers with AAF, or colloquially the \"animalled\" or \"Zoos\", find that an animal has appeared (bear, sloth, mongoose, Maltese, scorpion, butterfly . . .  you get the idea) out of thin air as something of a familiar, and with their appearance the animalled develops some form of special ability.  The animalled cannot be separated by too much distance from their animals or else risk paranoia and increasing discomfort, and if their animal dies, the Undertow comes for them -- some sort of dark malevolent force.  The story's protagonist is Zinzi December, whose familiar is a sloth and who has the special ability of being able to find lost things.  Beukes has written an absolutely fantastic book, weaving sharp dialog and social commentary with action.  Since most of the animalled have committed some sort of terrible crime, there is discrimination against the Zoos (different countries have different norms), including housing discrimination.  The idea of two classes is especially interesting as it is set in South Africa.  Beukes reveals enough to make the world fully realized and interesting, but also leaves plenty of gray areas (as in the source of AAP is unknown, many theories abound, and people are divided over whether the special gifts are magic or have some rational basis).  A unique book and highly recommended."}, {"review_sentiment": 5.0, "review_text": "I love this book.  This is a great mix of genres and Beukes is a fantastic storyteller.  Definitely give it a try if you're looking for something different."}, {"review_sentiment": 4.0, "review_text": "I read Lauren Beukes' books from the end to the beginning her list.  This was a bit crazier than her newer novels.  Took me a few pages to get into the lingo, but when I got there, it was a good ride."}, {"review_sentiment": 2.0, "review_text": "I really don't like not finishing books, especially when the author / publisher gives me a free copy, but this has led me to spend way too much time reading books I'm not interested in. And the author / publisher want honest thoughts on these books, so starting with this one, I'm going to try to stop finishing books I don't want to read: So I didn't finish it.In tons of series, you can start with the second, third, or even tenth book and not feel like you missed much, but that isn't true with this one. As far as I can tell, this one isn't even part of a series, but it seems like it is. Right from the beginning, I felt like I was missing some pretty important information. This could be partly because of the dialogue - there are a lot of words that needed to be defined, that weren't defined. I don't even know if they're real words, but they were used way too much to leave readers with no idea what they mean. If the author doesn't want to define them in-text, a glossary would be fine, but it needs something.The next reason I wasn't too interested was because of the setting. The setting is Zoo City, but with how many different racial / ethnic groups the story mentions, it felt like it was jumping around WAAAAAAY too much, even though all of what I read is set in Zoo City or the surrounding area.Zoo City and its culture also need a lot more background. This would help with my feeling like I was missing information, and it could also be a great time to introduce key terms. Zinzi could also use some more background, but that could be provided throughout the book - clarification: she does have a good background, but I think it could be introduced a little earlier, or at least have more details.Think that the book would be too long with the things I'm suggesting the author add? No problem. Some of the random crap in between chapters could be taken out to make room.Seriously, there was movie reviews at one point, and they weren't even complete reviews. Just the beginning, and then the [more] that you would click on to see the rest, except you can't do that because this is a freaking book. Oh, yeah, and this movie wasn't even mentioned in the story at all. So what's the point of the reviews being there?Maybe all of this stuff ends up being important at the end of the book - in case you're wondering, there was also a newspaper article, an interview, testimonies from prisoners, and an abstract from some paper - but I'll never know.I honestly hope you like this book better than I did, if you decide to read it.Note: I received this book for free through Goodreads Giveaways."}]}, "authors": ["Lauren Beukes"], "isbn": "0316267929", "longitude": 28.049722, "periods": ["2000s", "Recent Releases"], "title": "Zoo City", "word_cloud": "last time tear fast compact obscenely urban earth almost word ooze pore bloodstream afraid paint vivid visceral picture alternative no push conceivable sensory detail sharpen due semi time favorites high star stand get stand ovation better fantasy thriller set future use cosmology animal familiar examine racism ingrain many even realize description vibe physical reality capture twin undercurrent promise forebode today suffers common flaw often find genre set world storytelling dialogue spot end unsatisfying par rest ride much better final destination say visit ride well do anyone visit different fantasy place everyone sin attach animal represent way past sin take chance weird definitely good way recover addict writes scam use magic find lose item return latest find client wind dead suspect someone want miss person need money payment confiscate evidence soon suck glamorous dangerous music industry search miss like best format mainly tell first person account also addition document get example scam also follow portion movie blurb review explain people animal link magazine article singer producer work come together well flow story wish something fully explain animal companion come tied start lose last page already find else circumstance quite suspicious sure care anymore back home suddenly action danger lot cram sudden get bit confusing place end also quite bittersweet definitely happy end base everything happen suppose thing work least end like hold attention nearly end setting world build quite unique interest honestly say anything quite community crowd slum people bond animal use pardon pun familiar term refer live find lose thing look lose people thing bite tough right need work hire music producer find teen pop star member group know time life reporter drug habit land prison now weigh guilt sloth try find path search ijusi encounter something pretty deviant someone snatch cut sell part make little money drug someone know make dirty gritty street evade criminal inhabit area law rather write long ago appreciation write em part fantasy part urban fantasy entirely original long time something unique also incredibly gritty dank write sharply felt neighborhood sewage drain fur writing incredibly captivate idea work original african location unusual least easy overlook simplicity plot awful lot tell actually kind point answer come leave question answer end something see lauren name want know take somewhere completely new like good em highly original dark urban fantasy leave breathless even plot little thin receive digital copy publisher exchange honest review wonderful inventive beautifully flaw character learn lot new word perspective highly recommend author star wow entirely different exciting insightful strange gritty unexpected ride call urban fantasy crime nor scratch surface story take place early major twist worldwide phenomenon occur people thing make feel extreme guilt usually murder rape afflict colloquially animal led find animal appear bear sloth mongoose maltese scorpion butterfly get idea thin air something familiar appearance animal led develops special ability animal led separate much distance animal else risk paranoia increase discomfort animal dy come sort dark malevolent force story protagonist familiar special ability able find lose thing write absolutely fantastic weave sharp dialog social commentary action animal led committed sort terrible crime discrimination different country different norm include housing discrimination idea class especially interest set reveals enough make world fully realize interesting also leave plenty gray area source unknown many theory abound people divide special gift magic rational basis unique highly recommend love great mix genre fantastic storyteller give try look something different end begin list bit crazier newer novel page get lingo get good ride really finish especially author publisher give free copy lead spend way much time read interested author publisher want honest thought start go stop finishing want so finish ton series start second third even tenth feel miss much true far tell even part series seem begin felt miss pretty important information partly lot word need define define even know real word use way much leave reader idea mean author want define glossary need reason interest set set many different racial ethnic group story mention felt jump around much even set surround culture also need lot feeling miss information also great time key term also background clarification good background think little earlier least long thing suggest author add problem random crap chapter take movie review point even complete review begin rest freak yeah movie even mention story so point review maybe stuff end important end case wonder also newspaper article interview testimony prisoner abstract paper never honestly hope better decide receive free", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "A new edition of Lauren Beukes's Arthur C Clarke Award-winning novel set in a world where murderers and other criminals acquire magical animals that are mystically bonded to them.\r\n\r\nZinzi has a Sloth on her back, a dirty 419 scam habit, and a talent for finding lost things. When a little old lady turns up dead and the cops confiscate her last paycheck, Zinzi's forced to take on her least favorite kind of job--missing persons.\r\n\r\nBeing hired by reclusive music producer Odi Huron to find a teenybop pop star should be her ticket out of Zoo City, the festering slum where the criminal underclass and their animal companions live in the shadow of hell's undertow. Instead, it catapults Zinzi deeper into the maw of a city twisted by crime and magic, where she'll be forced to confront the dark secrets of former lives--including her own.\r\n\r\n\"Zoo City is a fabulous outing from an extremely promising writer... [it] has so much fabulous wordplay, imaginative settings and scenarios, and such a dark and cynical heart that I was totally riveted by it.\" Cory Doctorow", "asin": "0316267929", "rank": "605740", "city": "Johannesburg", "image": "https://images-na.ssl-images-amazon.com/images/I/51sNvz2sm%2BL.jpg", "country": "RSA", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}