{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 31.2253441, "ratings": {"num_ratings": 23, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "Jack Kerouac and Allen Ginsberg reincarnated as a Chinese woman.  The similarities are astounding.  If you are interested in modern Chinese \"underground\" life, this is worth reading.  I'm not sure how much of the book is fiction and how much is real life.  I think it's both."}, {"review_sentiment": 5.0, "review_text": "I love this book! Had to purchase a copy for a friend. Excellent condition! wonderful purchase experiance!"}, {"review_sentiment": 5.0, "review_text": "Wow what a ready. The book itself is in good condition and one that I have been wishing to get"}, {"review_sentiment": 4.0, "review_text": "im buying this book for the second time.read it 3 times, lost it at a train station.her story is extremely raw and emotional.i can relate to it in a way ... definatley a good book to add to yur collection ..!"}, {"review_sentiment": 5.0, "review_text": "I needed this book for a women's studies course and it was in great condition and was a great read overall. I had finished the book before it was even assigned!"}, {"review_sentiment": 2.0, "review_text": "I couldn't agree more with the review writtten by Steve Koss.\"Candy\" is a collection of sparsely scattered pieces of insight none of which are about the culture or any of the places where the story takes place. There is almost nothing there to justify its hype. Shanghai Baby (which is almost the same story as Candy) is better.Try the works of Guo XiaoLu (\"Village of stone\" being a fantastic example of great contemporary Chinese literature), XinRan (\"The good women of China\" a fantastic piece of reportive material) or Dai Si jie ( Balzac and the little Chinese Seamstress), or any of the writers suggested by Steve."}, {"review_sentiment": 2.0, "review_text": "I suppose the author deserves some praise for writing on a taboo subject in limited Chinese society. But this book does not deserve the praise that it's getting. I'm reading this for a Modern Chinese class for college and it's awful.The characters are selfish, neurotic and not even autobiographical. The book revolves around Hong, after her classmates suicide, she runs off to Southern China a.k.a. special economic zone. She gets rape, meets a musician that cheats on her nonstop and drinks and does drugs. Throughout the book, the character never progresses, they are eternally in their adolescent moody attitude, selfish habits and lazy persona. They never try to improve their lives by doing something better but continues to sleep around with random people, doing drugs and attempting to commit suicide. And the ultimate upset is that the character never progressed, they remain the same person after 10 years of heroin, weed and life.As a Chinese girl growing up in the US, i am very disappointed and embarrassed by this book. The author depicts a needy, co-dependent girl that doesn't want to grow up. I struggle to get through the book (skipping meaningless rape/sex/oral scenes throughout).Hong tries to kill herself to get her boyfriend back--degrading women everywhere. Depicting Chinese females as weak and manipulative is reinforcing and upholding sexist views that have existed for centuries. I feel if an American author wrote this novel, it would be collecting dust somewhere in the bookstore but since the author is Chinese, people are paying more attention to it. Reading this book is a waste of my time. If i wanted a autobiographical novel about drugs and rock and roll, i would read up on Kurt Cobain (at least those stories are real).The author should take her own advice, write something real. Or something better."}, {"review_sentiment": 5.0, "review_text": "That bizarre time between realizing your childhood slipped out the back door and adulthood just sucker punched you. Mian takes the reader through this transitional period and sometimes left me wondering if she would live to tell the ending. Im still wondering how one takes such realities as love, death, music, suicide, depression, rehab, mental institutions, addiction, AIDS, prostitution, and forgiveness and makes you feel as if you have experienced them all first hand at that very moment. Painfully honest, euphoric, and absolutely breathtaking. This isnt just a \"look at modern Chinese culture\", Mian allows a front row seat to her soul."}, {"review_sentiment": 2.0, "review_text": "I started the book with optismism since I am interested in this genre of Chinese 'freedom writers' if you will.  Her nemesis's SHANGHAI BABY was rather enjoyable, so why not give this book a try? It's suppose to be semi-autobiographical.The first chapter was original about her high school days, and all was pretty captivating till about half the book.  Then her whiny tone of self pity, indulgent suicidal thoughts, and her destructive relationship patterns get old and repetitive.  All the sympathy and understanding that I tried to keep an open mind for her character deteriorated to something like loathing .  Nay, more for her style of writing and making the readers despise her.  It just became annoying to read as she repeated and whined about her cycle of drugs, suicidal thoughts, her boyfriend leaving her, and repeat X 10. I finished it out of the pure principle of finishing a book, but geez, what a waste of time that was.The only worthy bits for me were her stories of the men and women that she  came across.  Somehow she wrote them so simply and straightforth that it left a deeper impression than her own character.  Maybe that's what she should have done...put the character Hong's lifestory into a short excerp among short essays of people who really had an interesting experience to tell."}, {"review_sentiment": 5.0, "review_text": "i think one reason people may be put off by this book is because it withholds nothing about a somewhat disturbing society. i fully believe it to be worth reading though, for it shows an earnest journey and stuggle with adulthood. the characters are honest and the revelations are telling"}]}, "authors": ["Mian Mian"], "isbn": "0316563560", "longitude": 121.4888922, "periods": ["2000s"], "title": "Candy", "word_cloud": "reincarnate woman similarity astound interested modern underground life read sure much fiction much real life think love purchase copy friend excellent condition wonderful purchase experience ready good condition wish mi buying second time lose train story extremely raw relate way definable good add collection need woman study course great condition great overall finish even assign written collection sparsely scatter piece insight none culture place story take place almost nothing justify hype almost story work stone fantastic example great contemporary chinese literature good woman fantastic piece sportive material hie little chinese writer suggest suppose author deserves praise write taboo subject limit chinese society deserve praise get read class college character selfish neurotic even autobiographical revolves classmate suicide run special economic zone get rape meet musician cheat nonstop drink drug character never progress eternally adolescent moody attitude selfish habit lazy never try life something better continue sleep random people drug attempt commit suicide ultimate upset character never progress remain person year heroin chinese girl grow disappoint embarrass author depict needy girl want grow struggle skipping meaningless scene try kill boyfriend back degrade woman everywhere depict chinese female weak manipulative reinforce upholding sexist view exist century feel american author write collect somewhere bookstore author chinese people pay attention waste time want autobiographical drug rock roll least story real author take advice write something real something better bizarre time realize childhood slip back door adulthood sucker punch mia take transitional period sometimes leave wonder tell end still wonder take reality love death music suicide depression rehab mental institution addiction prostitution forgiveness make feel experience first hand moment honest euphoric absolutely breathtaking inst look modern chinese culture mia allow front row seat soul start optimism interested genre chinese writer nemesis rather enjoyable give try suppose first chapter original high school day pretty captivate till half then whiny tone self pity indulgent suicidal thought destructive relationship pattern get old repetitive sympathy understanding try open mind character deteriorate something loathe style write make reader become annoy repeat whined cycle drug suicidal thought boyfriend leave repeat x finish pure principle finish gee waste time worthy bit story men woman come write simply straight forth leave deeper impression character do put character life story short excerpt short essay people really interesting experience tell reason people withholds nothing somewhat disturbing society fully worth read show earnest journey struggle adulthood character honest revelation tell", "genres": ["Fiction & Literature"], "summary": "An international literary phenomenon-now available for the first time in English translation-Candy is a hip, harrowing tale of risk and desire, the story of a young Chinese woman forging a life for herself in a world seemingly devoid of guidelines. Hong, who narrates the novel, and whose life in many ways parallels the author's own, drops out of high school and runs away at age 17 to the frontier city of Shenzen. \r\n\r\nAs Hong navigates the temptations of the city, she quickly falls in love with a young musician and together they dive into a cruel netherworld of alcohol, drugs, and excess, a life that fails to satisfy Hong's craving for an authentic self, and for a love that will define her. \r\n\r\nThis startling and subversive novel is a blast of sex, drugs, and rock 'n' roll that opens up to us a modern China we've never seen before. - Banned in China-with Mian Mian labeled the 'poster child for spiritual pollution'-CANDY still managed to sell 60,000 copies, as well as countless additional copies in pirated editions. - CANDY has been published in eight countries to date and has become a bestseller in France.", "asin": "0316563560", "rank": "1098877", "city": "Shanghai", "image": "https://images-na.ssl-images-amazon.com/images/I/51FUnLBQ4RL.jpg", "country": "China", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}