{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 213, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I have all of this authors books just needed this one to complete my collection."}, {"review_sentiment": 5.0, "review_text": "NIce deal"}, {"review_sentiment": 5.0, "review_text": "I love Zafon's ability to take the reader from \"today\" or \"reality\", if you want to call it that, to the dream-like situation that gripped this reader. Zafon has the ability to lead the unsuspecting reader into an adventure of the mind the end of which is difficult to predict.  In my opinion, Zafon is an outstanding writer of unusual plots with unpredictable endings.  I thoroughly enjoy this author's work."}, {"review_sentiment": 3.0, "review_text": "I liked this book, perhaps not as much as I liked, \"The Shadow Of The Wind,\" but worth the read."}, {"review_sentiment": 5.0, "review_text": "Was anxious for a new Zafon book, and Marina didn't disappoint!"}, {"review_sentiment": 5.0, "review_text": "This is a beautiful love story with adventure, excitement,  beautiful memories, and death. Two lonely souls find each other and become the closest of friends. They encounter intrigue, and frightful experiences running through the underground tunnels & labyrinth beneath city streets. They encounter the less fortunate who live there, a lot of them left over from the war. A great read which was hard to put down!"}, {"review_sentiment": 3.0, "review_text": "a master story  teller early work that show aclear eviance  of his talent that will truly shine in his master piece shadows of the wind."}, {"review_sentiment": 1.0, "review_text": "Still trying to get through this book. Initially caught my interest, but couldn't keep it. Lots of characters but confusing story line. Don't waste your money."}, {"review_sentiment": 5.0, "review_text": "Love this writer. Book is easy to read, plot is gripping and adventurous."}, {"review_sentiment": 3.0, "review_text": "Good"}]}, "authors": ["Carlos Ruiz Zafón"], "isbn": "0316044717", "longitude": 2.1774322, "periods": ["1900s"], "title": "Marina", "word_cloud": "author need complete collection nice deal love zafon ability today reality want call situation grip ability lead unsuspecting adventure mind end difficult predict opinion outstanding writer unusual plot unpredictable ending thoroughly enjoy author work like perhaps much like worth anxious new disappoint beautiful love story adventure excitement beautiful memory death lonely soul find become closest friend encounter intrigue frightful experience run underground tunnel labyrinth city street encounter le fortunate live lot leave war great hard put master story teller early work show clear evince talent truly shine master piece shadow wind still try initially caught interest character confuse story line waste money writer easy plot grip adventurous good", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "\"We all have a secret buried under lock and key in the attic of our soul. This is mine.\"\r\n\r\nWhen Fifteen-year-old Oscar Drai suddenly vanishes from his boarding school in Barcelona, no one knows his whereabouts for seven days and seven nights.\r\n\r\nHis story begins when he meets the strange Marina while he's exploring an old quarter of the city. She leads Oscar to a cemetery, where they watch a macabre ritual that occurs on the last Sunday of each month. At exactly ten o'clock in the morning, a woman shrouded in a black velvet cloak descends from her carriage to place a single rose on an unmarked grave.\r\n\r\nWhen Oscar and Marina decide to follow her, they begin a journey that transports them to a forgotten postwar Barcelona--a world of aristocrats and actresses, inventors and tycoons--an reveals a dark secret that lies waiting in the mysterious labyrinth beneath the city streets.\r\n\r\nCarlos Ruiz Zafon's haunting Marina has long been a cult classic in Spain and is now an international bestseller.", "asin": "0316044717", "rank": "88760", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51Vlxk8GbqL.jpg", "country": "Spain", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}