{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 34, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "This is one of the best novels I ever read.  It is beautifully written and also very well plotted.  It's a shame this book is not available in Kindle or other e-book format."}, {"review_sentiment": 5.0, "review_text": "If there's such a thing as a sympathetic satire, this is it.  THE LATE GEORGE APLEY was John P. Marquand's best-selling novel and stayed on the best-seller lists in the late 1930s.  Kind of a tribute to a rather inconsequential Boston Brahmin, the book is definitely worth reading even today."}, {"review_sentiment": 4.0, "review_text": "My copy is from the International Collectors Library, circa 1973, based on the 1937 manuscript and hard bound, 303 pages.Bottom Line First: The late George Apley  subtitled \"A Novel in the Form of a Memoir,\" is a novel narrated by a longtime friend and local author Willing.  It came as a surprise to me that this is considered a satire. There is at least one obviously funny chapter and throughout an under tone of drollery. If by satire you mean laugh out loud funny, this novel rarely made me smile. It is very subversive, ironic and given to ridicule. George Apley is the head of a very rich, traditional WASP to the Nth degree Boston family. He is at every turn too aware of and limited by the assumed duties of a Boston community leader to ever let himself or any family member be anything but what social leaders are supposed to be. This is a poor little rich kid who grows up to be a poor rich adult, chronicling the changes around him as well as his inability to take a role in these changes. So add to poor little rich kid, a hid bound , snob, stick in the mud. As unsympathetic as George Apley may seem, Marquand’s writing kept me wanting to stay in the story and see the world through the eyes of the Boston upper crust. Recommended: at its worst, The Late George Apley is a chance to enjoy good writing. Not a bad thing.The author if still known for any writing it would be the Mr. Moto books about a crime solving Japanese detective and adventurer. George Apley helped Marquand to earn a Pulitzer prize and is considered the better of his several novels, usually comic about life among the rich Bostonians. John Marquand did not grow up rich, but he knew New England and via a scholarship he got to mix with ‘his betters’ at Harvard.This is a story within a story. Willings is a fictional character, intimate of the now deceased George Apley and a fellow member of the Boston private club set. He is asked by Apley's son to tell the real story of his father. This story is told by re-printing a number of letters with added commentary by Willings. Depending on how you look at it the narration is telling a first person story related through a second person. Both the narrator and George are in agreement about the method and point of view of proper, responsible Bostonian gentlemen.Marquand creates a believable and sympathetic cast of characters. There are always excuses for ours and condemnation of theirs and of course this is all quite correct. One can easily believe that this is a history of a vanishing romantic way of life even if it was one that was never open to outsiders or very free for those inside. Where I have my hesitations is that I am not sure how much I care to sympathize with people who, while living very well, impose problems on themselves. These are people with virtually unlimited opportunities to indulge themselves and a rabid fear of being perceived as being self-indulgent. And yes, they do indulge themselves."}, {"review_sentiment": 5.0, "review_text": "a fabulous glimpse at a time and place that is now gone"}, {"review_sentiment": 5.0, "review_text": "A fine book about old Boston and its customs."}, {"review_sentiment": 4.0, "review_text": "This was a good read about the differences that happen from one generation to the next, regardless of the generation you live in.  I was able to identify with several characters in this book."}, {"review_sentiment": 5.0, "review_text": "A gently satirical portrait of now extinct Bostonian \"WASPs\", including Apley and the fictitious narrator. Beyond that, you  may relate to Apley's feeling trapped by the societal expectations of his privileged upbringing. A deserving winner of the 1938 Pulitzer Prize."}, {"review_sentiment": 5.0, "review_text": "This is an interesting novel about life at the top in Boston and how it changed from the later 1800s into the 1900s. John Marquand structures the book as a sort of biography constructed from the collected letters of the title character. The entire book is constructed as a sort of eulogy to a time and a way of life in Boston with asides to the generation before. It sympathetically portrays the way of life of the socially insulated Boston aristocracy at their cultural apex. It shows both the good and bad of the culture. It also shows the difficulty of sustaining something that has become too successful. George Apley's generation inherited a society where everything had been already built and taken to its natural limits. They were left with nothing new to accomplish and could only fall into a sort of stagnation. A loss of purpose driven by a lack of new ambitions.Marquand's writing is generally good but somewhat constrained by the biography device he uses. All the characters and all the action are seen at a distance. We can see their lives, but we can't really ever know them. The device ironically (or perhaps intentionally) captures the natural distance of most people from any aristocracy.Though today somewhat obscure, the book won a Pulitzer Prize in 1937. There exists an illustrated edition (1977) in full leather and gilt which was published by Franklin as part of their  Pulitzer winner collection."}, {"review_sentiment": 5.0, "review_text": "Bought it for my mom. She likes book like this."}, {"review_sentiment": 4.0, "review_text": "The novel, largely an epistolary one, gives a deep and thoughtful overview of the life of George Apley, a scion of Boston during the last half of the 19th century and the first part of the 20th.  What made this book memorable for me was the fact that I have known people like George Apley -- people who are wealthy and yet full of conviction about doing the right thing.  I found a lot of messages in this book that we today might do well to heed, such as Apley's insistence that rich people who flaunt their wealth by building ostentatious homes or getting-and-spending are missing the point (of life) entirely.  He is so full of conviction that the wealthy have deep and almost eternal obligations -- he derived this notion from his father, John, who in turn derived it from his father, Moses Apley.I was at first put off by the inherent snobbery of the Apleys and their friends/consorts.  \"You must join the Province Club,\"  or, \"You must join the Berkley Club,\" or \"Son, you must not be seen with people who are not of our class,\" and what-have-you.  All of this seemed at first like artifice to me.  And in a way, it is -- but taken along with Apley's character, which is lovingly developed in this book, these strictures fit perfectly with the Apley family (and many other intellectual New Englanders) and the morals of what may have been America's only expression of nobility, the people of the late 19th and early 20th centuries.  Apley, despite how much he cuts himself off from the more sanguine aspects of society, is a noble man, with the purest intentions and a far-seeing mind.As he says near the end of the book, \"There must be a class which sets a tone, not for its own pleasure, but because of the responsibility it owes to others.\"  I ended the book with a bittersweet feeling -- I actually had come to feel tenderly toward this gentleman (indeed he was a gentleman) in the closing chapters, and no longer saw him as a stuffed shirt confined to an outdated morality.  Marquand developed him beautifully, and brought to me, as the book ended, a very endearing old fellow who had a sense of his own shortcomings yet had done all he could to leave the world a better place."}]}, "authors": ["John P. Marquand"], "isbn": "0316735671", "longitude": -71.0595678, "periods": ["1900s"], "title": "The Late George Apley", "word_cloud": "best novel ever beautifully write also well plot shame available format thing sympathetic satire stay list tribute rather inconsequential definitely read even today copy circa base manuscript hard bound subtitle narrate longtime friend local author will come surprise consider satire least obviously funny chapter tone drollery satire mean loud funny rarely make smile subversive ironic give ridicule head rich traditional degree family turn aware limit assumed duty community leader ever let family member anything social leader suppose poor little rich kid grow poor rich adult chronicle change around well inability take role change poor little rich kid hid snob stick mud unsympathetic write keep want stay story see world eye crust recommend worst chance enjoy good write not bad author still know write crime solve japanese detective adventurer help prize consider better several novel usually comic life rich rich know scholarship get mix better story story fictional character intimate decease fellow member private club set ask son tell real story father story tell number letter add commentary narration tell first person story relate second person narrator agreement method point view responsible bostonian creates believable sympathetic cast character always excuse condemnation course quite correct easily history vanish romantic way life even never open outsider free hesitations sure much care sympathize people live well problem people virtually unlimited opportunity indulge rabid fear perceive yes indulge fabulous glimpse time place go fine old custom good difference happen generation regardless generation live able identify several character gently satirical portrait extinct include fictitious narrator feeling trap societal expectation privilege upbringing deserving winner interesting life top change later structure sort biography construct collected letter title character entire construct sort eulogy time way life asides generation sympathetically portray way life socially insulated aristocracy cultural apex show good bad culture also show difficulty sustain something become successful generation inherit society everything already build take natural limit leave nothing new accomplish sort stagnation loss purpose drive lack new write generally good somewhat constrain biography device use character action see distance see life really ever know device ironically perhaps intentionally capture natural distance people today somewhat obscure exist illustrated edition full leather gilt publish part winner collection mom like largely epistolary give deep thoughtful overview life scion last half century first part make memorable fact know people people wealthy yet full conviction right thing find lot message today well insistence rich people flaunt wealth building ostentatious home miss point life entirely full conviction wealthy deep almost eternal obligation derive notion father turn derive father moses first put inherent snobbery see people class seem first artifice way take character lovingly developed stricture fit perfectly family many intellectual moral expression nobility people early century much cut sanguine aspect society noble man purest intention say end class tone pleasure responsibility owe others end bittersweet feeling actually come feel tenderly gentleman indeed gentleman closing chapter longer saw stuffed shirt confine outdated morality develop beautifully bring end endear old fellow sense shortcoming yet do world better place", "genres": ["Fiction & Literature", "Satire"], "summary": "A modern classic restored to print -- the Pulitzer Prize-winning novel that charts the diminishing fortunes of a distinguished Boston family in the early years of the 20th century. Sweeping us into the inner sanctum of Boston society, into the Beacon Hill town houses and exclusive private clubs where only the city's wealthiest and most powerful congregate, the novel gives us -- through the story of one family and its patriarch, the recently deceased George Apley -- the portrait of an entire society in transition. \r\n\r\nGently satirical and rich with drama, the novel moves from the Gilded Age to the Great Depression as it projects George Apley's world -- and subtly reveals a life in which success and accomplishment mask disappointment and regret, a life of extreme and enviable privilege that is nonetheless an imperfect life.", "asin": "0316735671", "rank": "203622", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/51huG5FuMQL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}