{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 79, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "This book left me with conflicting opinions.  My primary criticism of the story is that the main character spends quite a lot of time milling around thinking about girls, both from past and present.  And while only a handful of low-stakes encounters occur for about the first three quarters of the book, Hynes' writing style is interesting enough to make it entertaining, mostly.  Regardless, this aimlessness starts to drag around the halfway mark at which point I wanted to speed up the story just so I could get it over with (so I could move on to an economics book of all motives).  I would have given the book one or two stars had not the ending been so heavy and surprising.  I actually got a little teary-eyed at the very end, which is unusual for me.  Still a good ending can only do so much to redeem a middling character wandering through a largely uneventful book.I haven't read anything else of Hynes--don't know that I will now--but from other reviews I've read I get the impression that Hynes is usually a reliable writer whose unique narrative style has better served him in his other books.  Extrapolating on that information my recommendation would be to start with some of his other books.  Save \"Next\" for later, if at all."}, {"review_sentiment": 2.0, "review_text": "I approached this book with optimism having so enjoyed Professor Great Lectures on Writing Great Fiction. However, I was disappointed. If the good professor was trying to write a best-seller he failed miserably. He used ten dollar words that weren't relevant to the normal reader who says I went to the toilet to micturate. Why not I went to take a piss.There was much too much exposition and not enough dialogue and action. All of the exposition made the story drag. Kevin the main character is unlikable as he wanders in his mind with backstory about all the women he has F___, but not loved in his life.I can't see it as a work of literary fiction either as it is more the rant of a middle-aged man who is still in his adolescence. That he dies, in the end, is fitting. Any author would like to kill off this character"}, {"review_sentiment": 5.0, "review_text": "Very well organized and clear. Never a doubt about his purpose or advice."}, {"review_sentiment": 3.0, "review_text": "Because this story is set in Austin, TX, where I lived for a decade, I was excited to read this book. But it is more about what happens in the hero's mind rather than what happens in reality. So it is hard to figure out what is reality and what alternate scenarios are going on in the author's mind. It's only natural I guess because it is written totally in the first person--quite a feat, considering. And Hynes can write--even though at times it seems forced. Austin has changed a lot since I lived there, if the scenes in this novel are any indication. There are still some things I recognize"}, {"review_sentiment": 4.0, "review_text": "Hynes is a master of description. Very enjoyable story."}, {"review_sentiment": 5.0, "review_text": "I thought I was reading a modern day, updated version of Joyce's Ulysses, until the last section. Entertaining, funny and angst ridden, it turned on a dime to tragedy. A brilliantly written headlong plunge of stream of conscious narrative propelling this reader to its fatal conclusion."}, {"review_sentiment": 5.0, "review_text": "The super best thing I can say about \"Next\" is that it still charges my mind 10 months after reading it.  There were parts in the middle that made me impatient but a back cover blurb said that the last 50 pages grab the reader by the lapel and so I stayed with it and right on time there I was, grabbed and thrust.I bought my copy new at Barnes & Noble. It was on the \"suggested by staff\" shelf.  I came to it knowing little about it and took it in, a great way to experience Next.  We men don't do book clubs so I just go around to my reading friends and hand it to them."}, {"review_sentiment": 5.0, "review_text": "I started laughing at the end of the first paragraph of this novel and never stopped, even during the final pages in which all is illuminated, because it's funny. The meanderings of Kevin Quinn's mind, keeping pace with his body as he alternates between heedless and obsessive semi-stalking and heat-oppressed delirium, are a delight. He riffs sex off of music off of death off of academia and brings it all back around again, over and over, never missing a note.I'm not going to summarize the plot, because a number of other reviewers have already done that well. The end, after a brilliant buildup, is one that you never saw coming until you think back and realize that it was always coming, in a thousand of Kevin's half-thoughts and sweaty semi-phobias and all-too-human fears and prejudices.After I finished the book, I looked up the reviews in the NYT.  Janet Maslin raved about it, but Claire Messud was critical.  Ironically, the last review I wrote was about Messud's latest book, which was amateurish and dreadful. I thought, \"No wonder you write so badly--you can't read.\"Some reviews have criticized Kevin's arrested development, arguing that there is nothing redeeming about him, but every moment in Kevin's day is about a redemption toward which he drags himself reluctantly but nostalgically, through heat and light which rise off of the page. There were moments when I wanted to take this slightly vain, slightly immature, slightly selfish man by the hand and say, \"Let's just sit down for a second, over there, IN THE SHADE.\"  I can't remember the last time that I knew exactly and so clearly how a character felt at every moment, and felt it with him.A great book."}, {"review_sentiment": 4.0, "review_text": "I picked this book up at a Goodwill store for 99 cents without knowing a thing about it. I was immediately sucked in by Mr. Hynes' writing style. His descriptive prose puts you squarely in the protagonist's shoes.It is not a fast-paced novel: nothing *happens* for the vast majority of it, but we spend our time in the main character's head, kind of like how we're in our own heads most of the time in real life. The pacing didn't bother me; I could see and feel what Kevin was experiencing as he made his way from Ann Arbor to his fateful interview in a high-rise building in Austin.The book didn't leave me melancholy, only wistful. And satisfied.Best 99 cents I've spent this year."}, {"review_sentiment": 4.0, "review_text": "James Hynes has done something here that can be seen in some Hollywood films and other novels in post 9/11 times. It's the self-obsessed protagonist who is so myopic in their concerns they fail to see the world around them which can lead to their demise. Hynes does it with humor and a detail that is a joy to read. This book will stay with you. And little details will come out and remind you that great literature still exists."}]}, "authors": ["James Hynes"], "isbn": "0316051934", "longitude": -97.7436995, "periods": ["2000s", "Recent Releases"], "title": "Next: A Novel", "word_cloud": "leave conflicting opinion primary criticism story main character spend quite lot time mill think girl past present handful encounter occur first quarter write style interesting enough make entertain mostly aimlessness start drag halfway mark point want speed story economics motif give star end heavy surprising actually get little end unusual still good end much redeem middle character wander largely uneventful anything else know review get impression usually reliable writer unique narrative style better serve information recommendation later approach optimism enjoyed however disappoint good professor try fail miserably use ten dollar word relevant normal say go toilet maturate go much much exposition enough dialogue action exposition make story drag main character unlikable wanders mind backstory woman love work literary fiction rant man still adolescence dy end fit author character very well organize clear doubt purpose advice story set live decade excite happen hero mind rather happen reality so hard figure reality alternate scenario go author mind natural guess write totally first person quite feat consider even time seem forced change lot live scene indication still thing recognize haynes master description enjoyable story think read modern day update version last section funny angst ridden turn dime tragedy brilliantly write headlong plunge stream conscious narrative propelling fatal conclusion super best thing say next still charge mind month read part middle make impatient back cover blurb say last page grab lapel stay right time grab buy copy new suggest staff shelf come know little take great way experience men club go read friend hand start laugh end first paragraph never stop even final page illuminate funny meanderings mind keep pace body alternate heedless obsessive delirium delight riff sex music death academia bring back never miss go summarize plot number reviewer already do well end brilliant buildup never saw come back realize always come sweaty fear finish look review rave critical last review write latest amateurish dreadful think wonder write badly review criticize arrest development argue nothing redeem moment day redemption drag reluctantly nostalgically light rise page moment want slightly vain slightly immature slightly selfish man hand say second last time know exactly clearly character felt moment felt great pick store cent know thing immediately suck write style descriptive prose put squarely protagonist nothing vast majority spend time main character head kind head time real life pace bother experience make way fateful interview building leave melancholy wistful cent spend year do something see film novel post time protagonist myopic concern fail world lead demise humor detail joy stay little detail come remind great literature still exist", "genres": ["Fiction & Literature", "Satire"], "summary": "One Man, one day, and a novel bursting with drama, comedy, and humanity.\r\n\r\nKevin Quinn is a standard-variety American male: middle-aged, liberal-leaning, self-centered, emotionally damaged, generally determined to avoid both pain and responsibility. As his relationship with his girlfriend approaches a turning point, and his career seems increasingly pointless, he decides to secretly fly to a job interview in Austin, Texas. Aboard the plane, Kevin is simultaneously attracted to the young woman in the seat next to him and panicked by a new wave of terrorism in Europe and the UK. He lands safely with neuroses intact and full of hope that the job, the expansive city, and the girl from the plane might yet be his chance for reinvention. His next eight hours make up this novel, a tour-de-force of mordant humor, brilliant observation, and page-turning storytelling.", "asin": "0316051934", "rank": "342720", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/41G2zWqQWJL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}