{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 152, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "As a charming indirect picture of the literary classes this was quite a novel presentation.  As a portrait of the author, much less so, as we learnt so little about her actual feelings outside of the narrowest of fields. But a fun read nonetheless and worth it for the sly portrait of AB."}, {"review_sentiment": 5.0, "review_text": "I love the humor of the family and the neighbors.who are all remarkable literary and bright.  They are familiar artists in real life.  This is a great read!"}, {"review_sentiment": 4.0, "review_text": "Enjoyable read; I was laughing out loud regularly. Also made me consider if I'm taking \"parenting\" a bit too seriously. Not that I'd use such explicit language with my kids, but maybe not be quite so anxious about always being that model parent."}, {"review_sentiment": 5.0, "review_text": "So funny and interesting."}, {"review_sentiment": 3.0, "review_text": "not what I really expected. but it's okay"}, {"review_sentiment": 2.0, "review_text": "Writer is not the type of person you would want to be around much.  Book is long and repeats same ideas over and over.  Guessing much fabrication or the \"friends\" would have grown tired of her antics and chucked her out."}, {"review_sentiment": 2.0, "review_text": "Doesn't quite live up to the promise of \"Man at the Helm\""}, {"review_sentiment": 4.0, "review_text": "Sorry, Nina, I liked the TV show better. Somehow the screen adaptation makes the whole story work."}, {"review_sentiment": 1.0, "review_text": "I kept waiting for this book to get interesting but it never did. Lots of \"letters\" filled with boring and tedious comments about characters we simply never know enough about to care about, or even know who they are.Paradise Lodge is better."}, {"review_sentiment": 5.0, "review_text": "The book is great! So far, I've been listening rather than reading, and this is hilarious! The narrator reads a bit too quickly, though.I keep comparing the original letters to the TV show - there are some differences.Thoroughly recommended!"}]}, "authors": ["Nina Stibbe"], "isbn": "0316243388", "longitude": -0.12574, "periods": ["2000s", "Recent Releases"], "title": "Love, Nina: A Nanny Writes Home", "word_cloud": "charm indirect picture literary class quite presentation portrait author much le learn little actual feeling narrowest field fun nonetheless worth sly portrait love humor family remarkable literary bright familiar artist real life great enjoyable laugh loud regularly also make consider take parent bit seriously not use explicit language kid maybe quite anxious always model parent so funny interesting really expect okay type person much long repeat idea guess much fabrication friend tired antic chuck quite live promise like tv show better screen adaptation make whole story work keep wait get interesting never letter fill bore tedious comment character simply never know enough even know better great far listen rather read hilarious narrator read bit quickly compare original letter tv show recommend", "genres": ["Memoir", "Humour"], "summary": " * * WINNER OF THE 2014 NATIONAL BOOK AWARDS POPULAR NON-FICTION BOOK OF THE YEAR * * *\r\n\r\n\"I adored this book, and I could quote from it forever. It's real, odd, life-affirming, sharp, loving, and contains more than one reference to Arsenal FC.\" Nick Hornby\r\n\r\nNina Stibbe's Love, Nina: Despatches from Family Life is the laugh-out-loud story of the trials and tribulations of a very particular family.\r\n\r\nIn the 1980s Nina Stibbe wrote letters home to her sister in Leicester describing her trials and triumphs as a nanny to a London family. There's a cat nobody likes, a visiting dog called Ted Hughes (Ted for short) and suppertime visits from a local playwright. Not to mention the two boys, their favourite football teams, and rude words, a very broad-minded mother and assorted nice chairs.\r\n\r\nFrom the mystery of the unpaid milk bill and the avoidance of nuclear war to mealtime discussions on pie filler, the greats of English literature, swearing in German and sexually transmitted diseases, Love, Nina is a wonderful celebration of bad food, good company and the relative merits of Thomas Hardy and Enid Blyton.", "asin": "0316243388", "rank": "234360", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51AmL0hy0iL.jpg", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}