{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 94, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "George Pelicanos is a D.C. treasure.  He accurately depicts, as always, the City and its culture.  George please pat my cousin's head for me next time you're on Georgia Ave., my cousin Norman, the Mayor of Silver Spring."}, {"review_sentiment": 3.0, "review_text": "Feels familiar!"}, {"review_sentiment": 4.0, "review_text": "I love Derek and Terry, and  devoured this book just as quickly as the 1st  in this series."}, {"review_sentiment": 4.0, "review_text": "It was a good introduction to Strange and Quinn. It moved at a good pace and had some great characters, some developed better than others."}, {"review_sentiment": 4.0, "review_text": "This is the first volume in what became known as the “D.C. Quartet,” widely considered  this author’s best work to date. The two protagonists, who share certain experiences but have far more, and deeper, differences, are Derek Strange, a black ex-cop and private investigator in his fifties with a quarter-century of practical experience on the street, and Terry Quinn, a white guy in his late twenties recently departed from the Metro police under a cloud who is marking time in his life by working in a quiet used bookstore.Quinn shot an off-duty (black) cop whom he thought was a civilian threatening another (white) civilian with a gun. He was cleared by the department but he hasn’t yet come to terms with what happened himself. The dead cop’s mother hires Derek to look into the case, to find out what “really” happened that resulted in her son being killed. Derek’s convinced there was no cover-up or anything, but he’ll see if he can discover any mitigating circumstances. And that takes him to Terry.The two men hit it off, though they are also aware of their differences. There are other cases on Derek’s plate, of course, mostly routine stuff, and Terry finds himself becoming caught up in them, even as things begin to come together in the shooting and what was really behind it. Derek finds he’s a good guy to have at your side in a brawl.Meanwhile, Terry has become very interested in a young black-Puerto Rican waitress and the two of them (she, somewhat hesitantly) begin a romance. Derek, with his very different perspective, questions his new friend’s deeper motives: Is he trying to prove something to himself, or to others, by dating a woman of color? And Terry finds himself listening, and thinking, and considering. “I’m not like that,” he protests. “We’re all like that,” Derek insists.At the same time, Derek has a longstanding relationship with his office manager, a very efficient, very patient woman, who has been in love with her boss for years. He’s just afraid to take the obvious next step.Pelecanos does a generally good job of developing his characters, the walk-ons as much as the two leads. Derek has a thing for western novels and movies, and for classic soul music, while Terry is far better read than one might expect of a cop and has a distinctly intellectual side. On the other hand, the redneck drug dealers, Ray Boone and his daddy, though decidedly scary, sometimes border on the cartoonish. You almost expect them to wear tee-shirts with “BAD GUY” printed across the back.That’s a relatively small complaint, though, and I’ll be lining up the next episode."}, {"review_sentiment": 4.0, "review_text": "very good, not great . standard Pelecanos."}, {"review_sentiment": 5.0, "review_text": "Jack Reacher novels are brain candy to me. Lee Child writes in a plain, hurry up and read style. Love 'em."}, {"review_sentiment": 4.0, "review_text": "Love this genre and plan to read all of his books over time"}, {"review_sentiment": 5.0, "review_text": "Excellent book."}, {"review_sentiment": 3.0, "review_text": "It wasn't what I expected"}]}, "authors": ["George P. Pelecanos"], "isbn": "0316099295", "longitude": -77.0366456, "periods": ["2000s"], "title": "Right As Rain: A Derek Strange Novel", "word_cloud": "treasure accurately depict always culture please pat cousin head next time cousin spring feel familiar love devour quickly series good introduction move good pace great character develop better others first volume become known widely consider author best work date protagonist share certain experience far deeper difference black private investigator fifty practical experience street white guy late twenty recently depart police cloud mark time life work quiet use shot black cop think civilian threaten white civilian gun clear department yet come term happen dead cop mother hire look case really happen result son kill convince anything mitigate circumstance take men hit also aware difference case plate course mostly routine stuff find become catch even thing begin together shoot really find good guy side become interested young rican waitress somewhat hesitantly romance different perspective question new friend deeper motif be try something others date woman color find listen think consider like protest like time longstanding relationship office manager efficient patient woman love bos year afraid obvious next generally good job develop character much lead thing western novel movie classic soul music far better cop distinctly intellectual side hand redneck drug dealer daddy decidedly scary sometimes border cartoonist almost expect wear print relatively small complaint line next episode good great standard novel brain candy write plain hurry style genre plan time excellent expect", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 1/5 in the Derek Strange and Terry Quinn Series\r\n\r\nDerek Strange is a black ex-cop in Washington D.C. who now makes a living running his own private detective agency. He is hired to investigate the killing of an off-duty black policeman by a white police officer -- a killing that was supposedly accidental, but that has opened difficult questions about racism on the force.\r\n\r\nIn the course of that investigation the white officer, Terry Quinn, becomes Strange's friend and then his partner. Together they try to uncover what really happened that night, when Quinn came upon a confusing and treacherous crime scene.\r\n\r\nAlong the way they confront the kingpins of a flourishing drug trade and some of the most implacable, dead-eyed killers ever to grace the pages of a novel.", "asin": "0316099295", "rank": "1210701", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51iVZ%2BUjaSL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}