{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 64.145981, "ratings": {"num_ratings": 1565, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "A well written novel that gave a realistic perspective of a woman awaiting execution. The author does a good job of describing the living conditions of 1800s Iceland."}, {"review_sentiment": 5.0, "review_text": "Read this for my book club, and was drawn in from the start.  The author has clearly done her research, and is skilled at plot as well as character development.  The landscape and culture are skillfully depicted...as a reader I felt immersed on several levels. While balanced in its approach to the main characters, it never veers into caricature or sentimentality."}, {"review_sentiment": 3.0, "review_text": "I was very excited to read this book. The beginning kept me engaged but somewhere around the middle I found myself losing interest. The story started to slow down and become monotonous. I finished the book and I'm glad that I kept at it but felt like a lot of pages were wasted rambling on without adding any value to the story. Lots of reviews rave about this book but it's just not a book for me."}, {"review_sentiment": 5.0, "review_text": "Wow. What an incredibly haunting and tragic read. It was just so chilling."}, {"review_sentiment": 5.0, "review_text": "Read this as preparation for a trip to Iceland and would highly recommend even if such a trip is not planned. Learned a lot about how very challenging life was in Iceland not all that long ago. The main character was very engaging and her true story fascinating."}, {"review_sentiment": 5.0, "review_text": "Gripping story based on comprehensive research. Best book I read all year!"}, {"review_sentiment": 5.0, "review_text": "I'm a little surprised at some reviews that cite lack of character development.  It's not something that I ever thought about during the increasing suspense regarding the many relationships between individuals and their stark surroundings.  The novel discusses relationships between friends, lovers, family members, officials, and so much more.  Hopefully the reader won't miss the richness of the plot as Agnes reveals some of the worst and best moments of her young life -- to the eventual murder in which she was involved.  Some of it is revealed in her own narrative.  Some of it is revealed through her relationship with a priest.  And, finally, some of it is revealed to one of her guardians who gains affection for her.  My husband commented that character development may or may not be important to a novel -- but, identifying with characters certainly is important -- and, I definitely identified with many of the individuals even though the story takes place in the early 1800s.  The only problem I had with the novel was with Icelandic names!"}, {"review_sentiment": 5.0, "review_text": "An interesting tale woven around a true story about a woman sentenced for execution for murder set in Iceland in the 1800s. The historical aspect of everyday life for the people living at that time expertly conveyed the hardships of daily living as well as the social mores of the time. Beautifully written, the story travels at a steady pace throughout the book, and I came to understand the characters more as Agnes recounted her view of the events that had transpired. For me, this story had an air of heaviness about it, the circumstances surrounding the main character was quite sad, and the ending was very emotional. This is a very well researched novel and I would recommend it to anyone who enjoys historical fiction."}, {"review_sentiment": 4.0, "review_text": "Engaging true-ish historical story of a woman sentenced to die in Iceland in the 1800’s.  A hard and very cold existence."}, {"review_sentiment": 5.0, "review_text": "Both Burial Rites and The Good People are wonderful reads!  Hannah Kent not only writes beautifully but her background research is thorough and fascinating. Her books really put the reader back into the 1800's and the lives of the poor, peasant classes and their beliefs. Her plots are the \"can't-put-down\" sort, too!"}]}, "authors": ["Hannah Kent"], "isbn": "0316243922", "longitude": -21.9422367, "periods": ["1800s", "Recent Releases"], "title": "Burial Rites", "word_cloud": "well write give realistic perspective woman await execution author good job describe living condition iceland club draw start author clearly do research skilled plot well character development landscape culture skillfully depict felt immersed several level balance approach main character never veers caricature sentimentality excite beginning keep engage somewhere middle find lose interest story start slow become monotonous finish glad keep felt lot page waste ramble add value story review incredibly haunt chill read preparation trip highly even trip plan lot challenge life long ago main character engage true story fascinating grip story base comprehensive research year little surprised review cite lack character development something ever think increase suspense regard many relationship individual stark surroundings discus relationships friends lover family member official much richness plot reveals worst best moment young life eventual murder involve reveal narrative reveal relationship priest finally reveal gain husband comment character development important identify character certainly important definitely identify many individual even story take place early problem icelandic name interesting tale weave true story woman sentence execution murder set historical aspect everyday life people live time expertly convey hardship daily live well social more time write story travel steady pace come understand character agnes recount view event transpire story air heaviness circumstance surround main character quite sad end emotional well research anyone enjoy historical fiction engage historical story woman sentence die hard cold existence good people wonderful read write beautifully background research fascinate really life poor peasant class beliefs plot sort", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "A brilliant literary debut, inspired by a true story: the final days of a young woman accused of murder in Iceland in 1829.\r\n\r\nSet against Iceland's stark landscape, Hannah Kent brings to vivid life the story of Agnes, who, charged with the brutal murder of her former master, is sent to an isolated farm to await execution.\r\n\r\nHorrified at the prospect of housing a convicted murderer, the family at first avoids Agnes. Only Tóti, a priest Agnes has mysteriously chosen to be her spiritual guardian, seeks to understand her. But as Agnes's death looms, the farmer's wife and their daughters learn there is another side to the sensational story they've heard.\r\n\r\nRiveting and rich with lyricism, BURIAL RITES evokes a dramatic existence in a distant time and place, and asks the question: How can one woman hope to endure when her life depends upon the stories told by others?\r\n\r\nHannah Kent was born in Adelaide in 1985. As a teenager she travelled to Iceland on a Rotary Exchange, where she first heard the story of Agnes Magnúsdóttir.\r\n\r\nHannah is the co-founder and deputy editor of Australian literary journal Kill Your Darlings. In 2011 she won the inaugural Writing Australia Unpublished Manuscript Award. Burial Rites is her first novel.", "asin": "0316243922", "rank": "36066", "city": "Reykjavik", "image": "https://images-na.ssl-images-amazon.com/images/I/51oG-rEmiNL.jpg", "country": "Iceland", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}