{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 5339, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a great book...just buy it...you will like it."}, {"review_sentiment": 3.0, "review_text": "I found this book to be almost intolerably satirical; the author clearly despises every character and doesn't bother to give them any warmth or dimension! They are used as voice vehicles; this effect is heightened by the mixed media writing (not a written story, rather a series of emails, faxes, reports, etc.). Author uses every cliche, smart-a** retort, and sly innuendo in her arsenal. It's never resolved why Bernadette goes from genius with a bright future, to an internet-shopping shrew and abysmal community member. (Enough with the vest talk, already!) You mean to tell me she never got a flash of brilliance in 20 years!? Until looking out on icebergs in Antarctica. The biggest disappointment was that failure to grow Bernadette as a person in a sincere way. Bee -daughter- was so spoiled as to be spank-worthy. I don't get the love/hate thing with Microsoft & its people- nevertheless, most of us have zero interest in it."}, {"review_sentiment": 5.0, "review_text": "Great book, it keeps your interest."}, {"review_sentiment": 5.0, "review_text": "Just finished this book....I feel fulfilled. It's a painful and delightful and beautiful story. This book will not be a waste of your time."}, {"review_sentiment": 5.0, "review_text": "The story line is fresh and the characters are real.  Plus it has a teenage, female heroine!  But don’t let that scare you away - this is not juvenile fiction.  Enjoy!"}, {"review_sentiment": 4.0, "review_text": "Quirky, lovely, honest, funny.  Loved the people, the fluidity of their characters due to live changing events, and enjoyed the love between these people. What's not to like about a book that mentions one of my favourite historic figures, despite (or maybe because)he never got to the South Pole..Shackleton."}, {"review_sentiment": 4.0, "review_text": "Not too deep. Some laugh out loud moments. Plenty of zaniness carried out by quirky characters. It won me over in the end."}, {"review_sentiment": 5.0, "review_text": "This is a great book written in the most unique of styles. It weaves together a great story with spurts of page turning action. Great read!"}, {"review_sentiment": 5.0, "review_text": "Very funny and a great perspective on Seattle personalities."}, {"review_sentiment": 4.0, "review_text": "Recommend this book to anyone who wants to chuckle often at the weirdness of our current culture and the vagaries of the tech world. Loved the characters, especially Bee."}]}, "authors": ["Maria Semple"], "isbn": "0316204269", "longitude": -122.3300624, "periods": ["2000s", "Recent Releases"], "title": "Where'd You Go, Bernadette: A Novel", "word_cloud": "great buy find almost intolerably satirical author clearly despise character bother give warmth dimension use voice vehicle effect heighten mixed medium write write story rather series email fax report author us cliche retort sly innuendo arsenal never resolve go genius bright future shrew abysmal community member vest talk already mean never get flash brilliance year look iceberg biggest disappointment failure person sincere way spoil get thing nevertheless interest great keep interest just finish feel fulfil painful delightful beautiful story waste time story line fresh character real teenage female heroine away juvenile fiction lovely honest funny love people fluidity character due live change event enjoy love people mention favorite historic figure maybe never get not laugh loud moment zaniness carry quirky character great write unique style weave together great story spurt page turn action very funny great perspective personality anyone want chuckle often weirdness current culture vagary tech world character especially", "genres": ["Fiction & Literature", "Humour", "Women's Fiction"], "summary": "Bernadette Fox is notorious. To her Microsoft-guru husband, she's a fearlessly opinionated partner; to fellow private-school mothers in Seattle, she's a disgrace; to design mavens, she's a revolutionary architect, and to 15-year-old Bee, she is a best friend and, simply, Mom.\r\n\r\nThen Bernadette disappears. It began when Bee aced her report card and claimed her promised reward: a family trip to Antarctica. But Bernadette's intensifying allergy to Seattle--and people in general--has made her so agoraphobic that a virtual assistant in India now runs her most basic errands. A trip to the end of the earth is problematic.\r\n\r\nTo find her mother, Bee compiles email messages, official documents, secret correspondence--creating a compulsively readable and touching novel about misplaced genius and a mother and daughter's role in an absurd world.\r\n\r\n\"Comedy heaven.... This divinely funny, many-faceted novel...leaves convention behind. Instead, it plays to Ms. Semple's strengths as someone who can practice ventriloquism in many voices, skip over the mundane and utterly refute the notion that mixed-media fiction is bloggy, slack or lazy.... The tightly constructed WHERE'D YOU GO, BERNADETTE is written in many formats-e-mails, letters, F.B.I. documents, correspondence with a psychiatrist and even an emergency-room bill for a run-in between Bernadette and Audrey. Yet these pieces are strung together so wittily that Ms. Semple's storytelling is always front and center, in sharp focus. You could stop and pay attention to how apt each new format is, how rarely she repeats herself and how imaginatively she unveils every bit of information. But you would have to stop laughing first.\" The New York Times", "asin": "0316204269", "rank": "3724", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/51sn0hyI7pL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}