{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 9, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "Courage is required to end an unhappy marriage and to pay the cost independence exacts.At first, Eve, a stiff personality, leaves a servile situation - but later learns that compromise must be made to welcome new happiness in her life. Eve, who has, sadly, no women friends at all, softens into a wisdom necessary for those who do not seek friendship.Eleanor Cowan, Author of : A History of a Pedophile's Wife: Memoir of a Canadian Teacher and Writer"}, {"review_sentiment": 4.0, "review_text": "Eve Carroll, a lady close to 70, walks out of an abusive, joyless marriage. Carrying very few items and very little money, she rents a basement room in a shabby home-and begins to live. She finds love too, with a younger man: but the story is definitely NOT about a gorgeous \"cougar\" and her cub. Neither of the lovers have much in the way of looks or money-they are simply two lonely but nice people in the same boat. A sweet, funny story about two average folks-and this is what made the book enjoyable for me. It is not a novel to read if you are looking for a deep plot or a torrid love story. But the characters are delightful, and the events in their relationship will make you smile."}, {"review_sentiment": 3.0, "review_text": "I am sorry to disagree with the other reviews of this book.  I foundlittle substance in this story,let alone,enjoyment.****SPOILERS***********This was about a 60 something woman,in an abusive marriage(he raped her,no love,etc,) which,she finds intolerable so...one day,she walksaway.  She finds a small apartment where she sort of,\"hides out\" not onlyobserving the other tenants (passing judgement on them too) but,she roundsout her meager living, finding things to sell to a pawn shop.  Freedom indeed.I read this through.  The description sounded interesting but,i think this story was lacking.The runaway female (Eva) does escape her loveless marriage but,she does not\" live\" life,she just hides out and stagnates-only observing the world around her-the only world withinher reach.  Eva does go back in her memory a lot and reflects on her past,explaining bits andpieces to the reader but,there was nothing profound or lyrical about it-just some odd memories.Fans of this author might like this but,i did not get  anything from it.  I would say,read it with an openmind but,do not expect too much."}, {"review_sentiment": 5.0, "review_text": "Highly recommend"}, {"review_sentiment": 5.0, "review_text": "A book written many years ago which still resonates today."}, {"review_sentiment": 5.0, "review_text": "I am in Montreal and the story is set in Montreal, written by a friend of my mother's. It was a gift for my mother and she appreciated it."}, {"review_sentiment": 5.0, "review_text": "I first discovered this 1973 novel around 1976 when I was a junior in high school.  I was very impressed with the story of a 60-something woman (which was ANCIENT to me at the time!) who has spent 40 years in an unhappy marriage, with the husband now disabled, petulant, and demanding, and who one day sets down the tea tray, packs her hairbrush, and walks out without a word.  At the time I found Eva an inspiring character, and the story was in a pseudo-journal style, which I enjoy.In high school, I too was looking for ways out, not wanting to be doomed to family expectations, and Eva's story also seemed a cautionary tale about what could happen to someone who did not take charge of her own life sooner.  Eva ends up impoverished, making ends meet by picking up items to sell at the pawn shop, yet feeling an enduring sense of freedom and gratitude.  But I think her story made me less worried about becoming a \"bag lady,\" one of the big fears of my generation, since Eva did quite well on her own with her small pension cheque, thank you, and the life of a poor old lady was, overall, better than her previous life of marital servitude.When I reverently gave the novel to my aunt to read, she was less impressed.  How could Eva just walk out on her marriage like that, when her husband needed her?  Unfortunately, my Christian aunt's marriage broke up several years later, which goes to remind one that marital commitment is not always returned in kind anyway.The premise of the novel stuck with me all these years, but for a long time I had the title wrong, so I couldn't find it again, and of course it was long out of print by the time I did.  But once I had title and author, it wasn't long before I found a copy at a used bookstore (the Green Apple Annex in San Francisco, if you must know).How does it play 30 years later?  First, I found Eva a less inspiring character personally than before.  The fact that she has recriminations about her actions does not excuse her selfishness in not communicating with her worried family.  In fact, she is a judgmental and often disagreeable old lady herself, and the people who are able to get close to her do so in spite of herself.  Yet she is intelligent and resourceful, qualities that had been suppressed in her life as wife and mother.  However, all that \"I'm so bad!\" introspection without changing her behavior comes off as tedious now.  The side characters come off as more interesting and complex, which Eva in her suburban snootiness is slow to appreciate, though eventually she does come around.But there was a completely new and unexpected pleasure in Beresford-Howe's nature writing.  She describes the changing of the harshly beautiful Montreal seasons in dazzling, radiant, and poetic detail. That was the kind of stuff I skimmed over in high school, but it is one of the pleasures of style that I could not appreciate when I was reading only for plot.So, in appreciation for a novel that is layered enough to change with the age of the reader, and in gratitude that it wasn't a stinker after all these years of fond remembrance, five stars to ya, baby!"}, {"review_sentiment": 4.0, "review_text": ". breaking freeReviewer:Date: Feb3/044:56:25 PMI first read this novel many years ago and was struck by what I felt was the honesty of the story. Eva physically walks out of her life one day but probably had been rehearsing this exit in her mind, over and over again.Only a woman who is curious enough to read this story could see the possibilty of leaving a long marriage, and could appreciate what was troubling and trapping Eva. Turning sixty-five was certainly a turning point for her and it just felt right for her to leave that particular day. SHe certainly discovers in her new life that money, status , and material goods won't bring happiness or fulfillment. In her new situation she can freely express her acceptance of human frailty . I was proud that she didn't go crawling home. The movie version was recently released in a in DVD with Claire Bloom as Eva. I highly recommend it."}, {"review_sentiment": 5.0, "review_text": "Constance Beresford-Howe wrote a delightful little book in 1973 called \"The Book of Eve\".  Eve had a comfortable life in the well-to-do English neighborhood in Montreal, as a wife, and a mother of one grown son.  On the day she received her first pension check, she walked out of that  life to start a journey of personal growth and exploration.  She made  discoveries about herself, her husband, and her son along the way that  shocked her, but she became self-sufficient and a stronger person.This  is the kind of story that pulls you back into it again and again, so that,  with each rereading, you see new aspects of Eve, her past life, and the  life ahead of her."}]}, "authors": ["Constance Beresford-Howe"], "isbn": "0316091405", "longitude": -73.6103642, "periods": ["1900s"], "title": "The Book of Eve", "word_cloud": "courage required end unhappy marriage pay cost independence first stiff personality leave servile situation later learn compromise welcome new happiness life sadly woman friend softens wisdom necessary seek lady close walk abusive joyless marriage carry item little money rent basement room shabby begin live find love younger man story definitely gorgeous cougar cub lover much way look simply lonely nice people boat sweet funny story average make enjoyable look deep plot torrid love story character delightful event relationship make smile sorry disagree review found little substance story alone enjoyment something woman abusive marriage rap find intolerable day find small apartment sort hide only observing tenant pass judgment rounds out meager live find thing sell pawn shop description sound interesting think story runaway female escape loveless marriage live life hide observe world world within her reach go back memory lot reflect explain bit and pieces nothing profound lyrical odd author anything expect much recommend write many year ago still resonate today story set write friend mother gift mother appreciated first discover junior high school impress story woman time spent year unhappy marriage husband disable petulant demand day set tea tray pack hairbrush walk word time find inspire character story style high school look way want doom family expectation story also seem cautionary tale someone charge life sooner end impoverished make end meet pick item sell pawn shop yet feel endure sense freedom gratitude think story make le worried become bag lady big fear generation quite well small pension cheque thank life poor old lady overall better previous life marital reverently give aunt le impressed walk marriage husband need unfortunately christian aunt marriage break several year later go marital commitment always return kind premise stick year long time title wrong course long print time title author long find copy use bookstore green year later find le inspiring character personally fact recrimination action excuse selfishness communicate worried family fact judgmental often disagreeable old lady people able get close spite intelligent resourceful quality suppress life wife mother however bad introspection change behavior come tedious side character come interest complex suburban snootiness slow appreciate eventually come completely new unexpected pleasure nature write describe change harshly beautiful season dazzle radiant poetic detail kind stuff skim high school pleasures style read appreciation layer enough change age gratitude stinker year fond remembrance star break free reviewer first many year struck felt honesty story physically walk life day probably rehearse exit mind woman curious enough story possibility leave long marriage trouble trap certainly turn point felt right leave particular day certainly discover new life money status material good happiness fulfillment new situation freely express acceptance human frailty proud crawl home movie version recently release highly recommend write delightful little call comfortable life neighborhood wife mother grown son day receive first pension check walk life start journey personal growth exploration make discovery husband son way shock become stronger kind story pull reread new aspect life life ahead", "genres": ["Fiction & Literature"], "summary": "First published in 1973, The Book of Eve has become a classic. When Eva Carroll walks out on her husband of 40 years, it is an unplanned, completely spontaneous gesture. Yet Eva feels neither guilt nor remorse. Instead, she feels rejuvenated and blissfully free. As she builds a new life for herself in a boarding house on the “wrong” side of Montreal, she finds happiness and independence – and, when she least expects it, love.", "asin": "0316091405", "rank": "831360", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/4101opvhBOL.jpg", "country": "Canada", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}