{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 363, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "This has been my favourite read of 2017.  I was surprised at how much I enjoyed the book considering that when I think of naval mutiny I think of the 1990’s movie Crimson Tide, with high drama and intense acting.  The Caine Mutiny is at the opposite end of the intensity scale in almost every respect.This is a long, slow coming of age story in a time of war.  We are so used to being entertained by fast paced, action packed movies and books that I sometimes wonder if we have lost an appreciation for things that are a truer reflection of the movement of time.  The pace of the story gave the reader a true appreciation of the character development witnessed over the course of the book and of the nature of war.  After the fact, it is easy to think of war was a series of battles that were won or lost, but this glosses over the weeks and months of hurry up and wait that fill much of a military man’s life.  Wouk captures the interminable endless feeling of war perfectly and likewise startles us with the infrequent, violent nature of battles and storms against this otherwise benign backdrop.This is all great stuff of course, but what made it a favourite read?  Wouk writes charmingly, with familiarity and wit.  He always seems to have the perfect word, the perfect little detail to convey a scene to the reader.  The story is, of course, the real draw.  And more than anything it is the simplicity of the story. It’s the story of Willie Keith growing up in a time of war.  The story has a traditional arc that pulls the reader along and all of the supporting characters are fascinating in their own right and support this arc.  The angst and trouble that Willie experiences are ordinary and relatable.  There is a complete absence of social issues, events and characters to make the story “relevant.”  The backdrop of war gives the story context and allows Wouk to use it as prism to break out character, leadership and friendship.This was a great story with enduring character lessons for us."}, {"review_sentiment": 5.0, "review_text": "This is a fantastic book and quite different from the movie, although I love the movie."}, {"review_sentiment": 5.0, "review_text": "Great novel---one of the best I've ever read."}, {"review_sentiment": 5.0, "review_text": "A classic"}, {"review_sentiment": 1.0, "review_text": "And pedestrian."}, {"review_sentiment": 5.0, "review_text": "Liked it a lot. The book is very well written and a good read.  Takes me back to my Navy days."}, {"review_sentiment": 5.0, "review_text": "This is a engrossing, well-written tale from a master of the craft.  I don't know why it took me this long to get around to reading it.  Very different from the Winds of War series, but excellent in its own right, with fascinating character studies.  This one has stood the test of time."}, {"review_sentiment": 4.0, "review_text": "I liked this book immensely, though I have to say I'm a fan of Wouk. Looking forward to reading more of his work."}, {"review_sentiment": 5.0, "review_text": "One of the best story writers of our time tells another great story (I have read 6 of his so far, and all have  been great)"}, {"review_sentiment": 5.0, "review_text": "It's hard to put down a Wouk book once you start. The Caine Mutiny is no exception"}]}, "authors": ["Herman Wouk"], "isbn": "0316955108", "longitude": 0.0, "periods": ["1900s"], "title": "The Caine Mutiny", "word_cloud": "favorite surprise much enjoy consider think naval think movie high drama intense act opposite end intensity scale almost long slow come age story time war use entertain fast paced action pack movie sometimes wonder lose appreciation thing truer reflection movement time pace story give true appreciation character development witness course nature war fact easy war series battle lose gloss week month hurry wait fill much military man life capture interminable endless feel war perfectly likewise startle infrequent violent nature battle storm otherwise benign great stuff course make favorite write charmingly familiarity wit always seem perfect word perfect little detail convey scene story course real draw anything simplicity story story grow time war story traditional arc pull support character fascinate right support arc angst trouble experience ordinary repeatable complete absence social issue event character make story backdrop war give story context allow use prism break character leadership great story endure character lesson fantastic quite different movie love movie best ever classic pedestrian like lot well write good back day engross tale master craft know take long get read very different series excellent right fascinate character study stand test time like immensely say fan souk forward reading work best story writer time tell great story far great hard put exception", "genres": ["Fiction & Literature"], "summary": "The Novel that Inspired the Now-Classic Film The Caine Mutiny and the Hit Broadway Play The Caine Mutiny Court-Martial Herman Wouk's boldly dramatic, brilliantly entertaining novel of life-and mutiny-on a Navy warship in the Pacific theater was immediately embraced, upon its original publication in 1951, as one of the first serious works of American fiction to grapple with the moral complexities and the human consequences of World War II. \r\n\r\nIn the intervening half century, The Caine Mutiny has become a perennial favorite of readers young and old, has sold millions of copies throughout the world, and has achieved the status of a modern classic.", "asin": "B007YXX5B2", "rank": "998378", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/219Ej1UcCoL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}