{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 51, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Was sent here by the watch doubledown book club, and was not let down at all. Maybe even have more to read."}, {"review_sentiment": 5.0, "review_text": "Love this author!"}, {"review_sentiment": 4.0, "review_text": "Burned through in a couple days. Fun visiting D.C. In the 80s and the music and street level characters of the book"}, {"review_sentiment": 3.0, "review_text": "Ok but not as good as other Pelecanos"}, {"review_sentiment": 5.0, "review_text": "Awesome read"}, {"review_sentiment": 5.0, "review_text": "Beautifully constructed.  Brilliant integration of the 1986 NCAA basketball tournament and the death of Len Bias.  Possibly the best crime novel I have read.  I recommend first reading \"King Suckerman\".  It isn't as good as \"The Sweet Forever\" but some of the characters repeat, and reading \"Suckerman\" is helpful for understanding \"Forever\"."}, {"review_sentiment": 4.0, "review_text": "I liked the tie ins from previous stories.  Look forward to book 4 in the D.C.  series.  If you like the previous books you will like this one too."}, {"review_sentiment": 4.0, "review_text": "Outstanding. Poingnant. Not a word is wasted. A story of drug business and how it effects everyone, particularly children."}, {"review_sentiment": 5.0, "review_text": "George is a favorite with many of our library patrons."}, {"review_sentiment": 4.0, "review_text": "Pelecanos's best book without a doubt. Believable, suspenseful and full of twists."}]}, "authors": ["George P. Pelecanos"], "isbn": "0316235148", "longitude": -77.0366456, "periods": ["1900s"], "title": "The Sweet Forever: A Novel", "word_cloud": "send watch double down club let even author burn couple day visit music street level character ok good pelican beautifully construct integration basketball tournament death best crime recommend first reading good character repeat read helpful understanding like tie in previous story forward series previous outstanding not word waste story drug business effect everyone particularly child favorite many library patron best doubt suspenseful full twist", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Book 3/4 in the DC Quartet Series\r\n\r\nA bold, brilliant tale of mystery, revenge, and survival in the 1980s, when cocaine and money ruled the city streets and even the good guys wanted a piece of the action. \r\n\r\nIt's March madness and the college boys are playing basketball on TV. But on the streets of D.C., the homeboys are dealing, dissing, dying. From behind plate glass, with an 80s backbeat pounding in his brain, Marcus Clay watches it all happen, and prays that he can make a go with his downtown record store. Then a car comes careening down U Street, and what Marcus sees next will plunge him into the middle of a war.\r\n\r\nA drug runner is decapitated in the crash. A bystander--a white boy desperate to buy a woman's love--snatches a bag of cash from the wreck, and a prince of crime wants it back. For Marcus's buddy, Dimitri Karras, the mayhem is a chance to make a score. For a pair of dirty cops it's a chance to get free. And for dozens of lives swept up into the maelstrom, it's just another springtime in America's capital, where the game is played for keeps.", "asin": "0316235148", "rank": "221305", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51f4yE67thL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}