{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 76, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "This book will be of great interest to those fixed on the ins and outs of the Middle Ages.  Not much of a mystery story but as a look at a specific time in French history, I found it interesting."}, {"review_sentiment": 4.0, "review_text": "I am not sure the subtitle is accurate, but then at times the focus seems to shift.  Well into the book I thought I was reading about how one man solved the murder of the king's brother, but then he almost disappears for the remainder as we examine the consequences of the assassination for the kingdom.  Even when it is about the solving there is very little crime and detection more this guy picked up on tiny details in witness statements and ran a nice ruse for a dozen pages.Putting this aside, I was interested in the book throughout and I learned something new.  The writing style is engaging in a nonfiction way, not a psuedofiction style. I would recommend to any history buff or francophile.  It was a lovely read even if not at all what I anticipated it would be."}, {"review_sentiment": 5.0, "review_text": "Blood Royal is an accurate historical account with a literary twist. It reads like a television drama. I loved it!!!"}, {"review_sentiment": 5.0, "review_text": "Excellent service. I would patronize again."}, {"review_sentiment": 5.0, "review_text": "heck of a good story,slow start but a page turner after it warms up"}, {"review_sentiment": 5.0, "review_text": "Another masterpiece from Eric Jager. He really makes history come alive."}, {"review_sentiment": 5.0, "review_text": "This is such a well written book I kept having to put it down in order to remind myself that I was not living during that horrible time in history. Excellent subject matter. Simply excellent,."}, {"review_sentiment": 5.0, "review_text": "Gripping read, great present for anyone with a love of medieval Paris!"}, {"review_sentiment": 5.0, "review_text": "clears up alot of history of what happened at that period"}, {"review_sentiment": 5.0, "review_text": "Good historical drama of Paris."}]}, "authors": ["Eric Jager"], "isbn": "0316224510", "longitude": 2.3514992, "periods": ["Recent Releases", "500-1400s"], "title": "Blood Royal: A True Tale of Crime and Detection in Medieval Paris", "word_cloud": "great interest fix in out not much mystery story look specific time french history find interest sure subtitle accurate time focus seem shift think read man solve murder king brother almost disappear remainder examine consequence assassination kingdom even solve little guy pick tiny detail witness statement run nice ruse dozen aside interest learn something new writing style engage nonfiction way psuedofiction style history buff lovely even anticipate accurate historical account literary twist read television drama love excellent service heck good story slow start page turner warms masterpiece really make history come alive well write keep put order remind live horrible time history subject matter excellent grip great present anyone love clear a lot history happen period good historical drama", "genres": ["History", "True Crime"], "summary": "A riveting true story of murder and detection in 15th-century Paris, by one of the most brilliant medievalists of his generation.\r\n\r\nOn a chilly November night in 1407, Louis of Orleans was murdered by a band of masked men. The crime stunned and paralyzed France since Louis had often ruled in place of his brother King Charles, who had gone mad. As panic seized Paris, an investigation began. In charge was the Provost of Paris, Guillaume de Tignonville, the city's chief law enforcement officer--and one of history's first detectives. As de Tignonville began to investigate, he realized that his hunt for the truth was much more dangerous than he ever could have imagined.\r\n\r\nA rich portrait of a distant world, BLOOD ROYAL is a gripping story of conspiracy, crime and an increasingly desperate hunt for the truth. And in Guillaume de Tignonville, we have an unforgettable detective for the ages, a classic gumshoe for a cobblestoned era.", "asin": "0316224510", "rank": "325103", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41gqNl4e89L.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}