{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 380, "rating": 3.2, "reviews": [{"review_sentiment": 1.0, "review_text": "I don’t typically read audiobooks, but while stuck in bed for several days at the beginning of the month with a mega migraine flare up, there wasn’t much I could do except just that. Because of the description of Frog Music, I thought it would lend itself to the perfect audio read–an interesting story, with music and songs. Those types of books generally sound better than read on the page, so I downloaded it from the library and settled in to my bed nest for a listen.I wasn’t wrong–this definitely was meant to be heard rather than read on the page. The reader had great vocal presence, did a great job with the many accents–French, old timey Western. She had a decent singing voice even in those accents for the little diddies that went along with the story.Unfortunately, I had a very hard time connecting with the characters. The only one I was remotely interested in, Jenny, dies a few chapters in (not a spoiler, it’s in the blurb). The rest seemed flat and secondary. Even Blanche just didn’t have any appeal to me.But I might have at least continued the book, just to find out what happened, even after I was well–if it weren’t for the blatant racism throughout. The book is set in San Francisco in the late 1800s, and there is a hard focus on Asian families who migrated to America during that period of time. They were referred to with slurs and terrible discrimination throughout the first half of the book–blamed for the sickness that was running through the city, and looked down upon for their supposed filthy ways of living and lack of Westernization. There was no point to it–it wasn’t related to the plot at all, more of a general setting or city description–and therefore it went unchallenged. The more pieces like that came up, the more sick I felt, and the less I wanted to continue. I’d love someone to tell me that later in the book it is challenged, that it gets better…but I was too turned off by it to finish the book."}, {"review_sentiment": 3.0, "review_text": "Strange book. You really want it to be good and it keeps trying but fails. So much potential but bad execution."}, {"review_sentiment": 1.0, "review_text": "Implausible, jumped around chronologically and difficult to follow, sex scenes crude, neither erotic nor \"violent.\"  My wife bought it and I read it.  Big mistake.  Waited for resolution and there was none.  Worst book I've read in years.  Most of my reviews are four or five stars."}, {"review_sentiment": 4.0, "review_text": "The characters in the book were very interesting and well-developed. She captured the feelings of her characters and of that time period in history.. Having one of the main characters capture frogs for a living was certainly a creative twist. Jenny  would have been a perfect fit in our Hippie Culture. Her killer was a surprise to me. My main criticism was that at times it was confusing  because of the way that the author jumped back and forth in the time periods."}, {"review_sentiment": 1.0, "review_text": "This book should not be classified as historical fiction, but as porn.  I stopped reading and returned it.  I felt mislead by the description."}, {"review_sentiment": 1.0, "review_text": "I could not get into this story. After several attempts, I gave us."}, {"review_sentiment": 5.0, "review_text": "I felt like I was in the San Francisco of the post gold rush, complete with all the sensory overload. I got to know my city in a completely new way. Beautifully written as always as well as insightful. Enjoy."}, {"review_sentiment": 3.0, "review_text": "I loved many things about this novel,  the setting,  the characters,  the music,  but was constantly jerked out of the story by the jogging back and forth between before and after."}, {"review_sentiment": 3.0, "review_text": "This was an interesting story, though I found it hard to suspend disbelief to really get into the story. I really hated the way it shifted in time, telling part for the ending near the beginning and back and forth, back and forth - really unnecessary, as though the author thought the story itself was not good enough to be captivating without revealing the dramatic outcomes early on. I also didn't care for the present narration. Is this a literary technique to make me think it happening right now? I know the story was set in the past. Is not enhanced by this device."}, {"review_sentiment": 4.0, "review_text": "I actually really enjoyed this one. It took me a long time to really get interested in the characters, but I fell in love with the world-building almost immediately. I felt like I was actually in San Francisco in the mid 1870s. Like I could feel the cloying heat and fear of the smallpox outbreak. And I attribute everything I loved about this book to the amazing narration by Khristine Hvam. She was so fantastic."}]}, "authors": ["Emma Donoghue"], "isbn": "0316324671", "longitude": -122.4192363, "periods": ["1800s", "Recent Releases"], "title": "Frog Music", "word_cloud": "typically audio books stuck bed several day begin month mega migraine flare much description think perfect audio interesting story song type generally sound better page download library settle bed nest definitely meant heard rather great vocal presence great job many old time decent sing voice even accent little daddy go hard time connect character remotely interested die chapter spoiler rest seem flat secondary even appeal continued find happen even blatant racism set late hard focus asian family migrate period time refer slur terrible discrimination first half sickness run city look suppose filthy way live lack point relate plot general set city therefore go unchallenged piece come sick felt le want continue love someone tell later challenge get turn finish really want good keep try fails so much potential bad execution implausible jump chronologically difficult follow sex scene crude erotic violent wife buy mistake wait resolution none year most star character interest capture feeling character time period have main character capture frog live certainly creative twist fit killer surprise main criticism time confuse way author jump back forth time period classified historical fiction porn stop read return felt mislead description story several attempt give felt post gold rush complete sensory overload get know city completely new way write always well insightful love many thing set character constantly jerk story jogging back forth interesting story find hard suspend disbelief really story really hat way shifted time tell part end begin back forth back forth really unnecessary author think story good enough captivate reveal dramatic outcome early also care present narration be literary technique make think happen right know story set past be enhance device actually really enjoyed take long time really interested character fell love almost immediately felt actually mid cloy heat fear smallpox outbreak attribute everything love amaze narration fantastic", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "From the author of the worldwide bestseller Room: \"Her greatest achievement yet...Emma Donoghue shows more than range with FROG MUSIC--she shows genius.\" -- Darin Strauss, author of Half a Life\r\n\r\nSummer of 1876: San Francisco is in the fierce grip of a record-breaking heat wave and a smallpox epidemic. Through the window of a railroad saloon, a young woman named Jenny Bonnet is shot dead.\r\n\r\nThe survivor, her friend Blanche Beunon, is a French burlesque dancer. Over the next three days, she will risk everything to bring Jenny's murderer to justice--if he doesn't track her down first. The story Blanche struggles to piece together is one of free-love bohemians, desperate paupers, and arrogant millionaires; of jealous men, icy women, and damaged children. It's the secret life of Jenny herself, a notorious character who breaks the law every morning by getting dressed: a charmer as slippery as the frogs she hunts.\r\n\r\nIn thrilling, cinematic style, FROG MUSIC digs up a long-forgotten, never-solved crime. Full of songs that migrated across the world, Emma Donoghue's lyrical tale of love and bloodshed among lowlifes captures the pulse of a boomtown like no other.", "asin": "0316324671", "rank": "131950", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/512r50%2Bi5eL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}