{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 34.5260131, "ratings": {"num_ratings": 263, "rating": 4.1, "reviews": [{"review_sentiment": 2.0, "review_text": "Although slightly insightful, this book is filled with author embellishments, suppositions, and provides no further substance into what life is like in Kabul other than what the author thinks, herself. Seierstad has done a good job destroying the bookseller’s life as well. That is not totally his own fault, though."}, {"review_sentiment": 5.0, "review_text": "Very interesting book about an Afghani family and about the culture of Afghanistan. It is an easy read and made me want to know more about life in Afghanistan. It also made me reflect on how lucky I am to live in the US.  Life in Afghanistan is very difficult and choices are so limited."}, {"review_sentiment": 5.0, "review_text": "I found this book to be quite enlightening about real life in Afghanistan.  It's about a man who owns a bookstore where he makes a good living for his family.  It covers some of the history of the country and the various rulers.  For example, life before the Taliban was more free than after the Taliban won power and enforced an extreme form of Sharia law.  It is amazing how little power people had over their own lives under that  Law. I grew up here in the good old USA, and find it difficult to grasp living under Islamic rule where there is no freedom, especially for women."}, {"review_sentiment": 3.0, "review_text": "“She couldn't survey the wreck of the world with an air of casual unconcern.”----Margaret MitchellÅsne Seierstad, an Award winning journalist-turned-Norwegian-author, has penned a delectable and slightly captivating account of her stay with an Afghan family, who owned a bookshop in a terror-stricken and on-the-verge-of-a-civil-war type Kabul in the year 2002, in the book called, The Bookseller of Kabul. This is the personal story of almost every human being, mainly women of the household, from the bookseller family, with two wives and tons of children and an equally great number of siblings, the bookseller is a subtly liberal man of his times, that only demanded women of each and every household to stay indoors and keep giving birth until their last dying breath.Synopsis:In spring 2002, following the fall of the Taliban, Asne Seierstad spent four months living with a bookseller and his family in Kabul.For more than twenty years Sultan Khan defied the authorities - be they communist or Taliban - to supply books to the people of Kabul. He was arrested, interrogated and imprisoned by the communists, and watched illiterate Taliban soldiers burn piles of his books in the street. He even resorted to hiding most of his stock - almost ten thousand books - in attics all over Kabul.But while Khan is passionate in his love of books and his hatred of censorship, he also has strict views on family life and the role of women. As an outsider, Asne Seierstad found herself in a unique position, able to move freely between the private, restricted sphere of the women - including Khan's two wives - and the freer, more public lives of the men.It is an experience that Seierstad finds both fascinating and frustrating. As she steps back from the page and allows the Khans to speak for themselves, we learn of proposals and marriages, hope and fear, crime and punishment. The result is a genuinely gripping and moving portrait of a family, and a clear-eyed assessment of a country struggling to free itself from history.The household of Sultan Khan in Kabul, ruled under the communist party, which is later succeeded by the Taliban's dictatorial rule, is not a happy place for the women, with two wives and a handful of children from the wives and lots of siblings and grandparents. This house is more like a time warp with one generation after another shares their journeys together, despite of unhappiness and constraints. Although Sultan Khan who is a reputed bookshop owner, selling modern Afghan books, some controversial Afghan books and a lot of history books about Afghanistan, is a free-thinker and a liberal man about politics and his patriotism, yet he is a very tyrannical man when it comes to the women of his household, be it his wives or his daughters or his sisters or his own mother, he dominates them all with old customs and difficult rules as set in the Holy Quran by the Prophet. Sultan Khan never believed in women's equal rights or their right to education or their right to choose their own husbands or their right to live freely, only in the right to obey the man of the house with their heads bowing-down-to-their-feet. Seierstad has lived with this particular Muslim family for four months to experience their grueling lifestyle both in a repressive household as well as in a country dominated by warlords and religious dictators.Always being on the verge of a civil war, Afghanistan has forever suffered a lot, lost a lot of its history in the dust and the bloodshed, and so are the country's women, who too have suffered silently through ages. The author has brought out and have captured vividly those pain of both the country as well as of the women always clad and bound behind a black veil and a burka, evocatively. The author's personal account definitely moved me and that too very deeply, but has failed to stir any emotions or my thoughts towards the women or the men from this book.The author's writing style is eloquent and evocative enough to make the readers feel and comprehend with her story line. The narrative is very mush realistic, and it will feel like the characters voicing their honest opinions discreetly in the ears of the author. Even though it has been translated into English, I felt that the charm of the author and her flair has not been lost in translation. The prose is articulate and really strong and that which leaves room for the readers' own judgement and thoughts.The backdrop of an unhinged Kabul is portrayed strikingly by the author in her story line, and have successfully captured both the rugged and golden terrains and landscape as well as the struggle of the country's citizens, especially the women. While reading, the book transported me straight in front of Sultan's bookshop as well as right in the middle of his large brick house, and felt the scenes unraveling right before my own eyes. The author not only did her research well enough to strike a cord into the hearts of her readers, but have also arrested them in a fascinating way to let the readers experience a troubled and terror-stricken country from their minds' eyes.The characters are the most disappointing fact of this book as they will not only fail to impress the readers of the book, but will only irk them up with their lack of development. As for me, I lost interest in their tragedy or in their lights, what kept me engaged is the country's disturbing politics and religious extremist ideals. The lives of the female characters could have been written with much more depth, so that they could leave an imprint in the minds of the readers. The accounts of the women are very scattered and disoriented, hence at times, I felt very bored to keep reading the book.In a nutshell, even though this is non fictional account of a journalist-turned-author's experience of living in a dangerous and repressive Muslim country, yet somehow, this book is not that great enough to read and explore about such a country. I do not recommend this to any reader."}, {"review_sentiment": 5.0, "review_text": "The book is stunning.A hopeless story of people who try but cannot overcome the unmanly rules of religion."}, {"review_sentiment": 5.0, "review_text": "What an education.  Easy to read and VERY informative."}, {"review_sentiment": 3.0, "review_text": "Interesting vignettes about life in & around Kabul under different political regimes in the second half of the 20th century"}, {"review_sentiment": 4.0, "review_text": "Asne Seierstad, a Norwegian journalist reporting in Afghanistan, lived with the commandos of the Northern Alliance for six weeks, traveling with them throughout Afghanistan, the mountains, the desert, the valley, and the steppes.After the fall of the Taliban, Seierstad travels to Kabul and meets the elegant Sultan Khan, while browsing through the many and diverse books in his shop.  Seierstad felt drawn to the interesting bookseller enjoying conversations with him and learned he had rebuilt his bookshops after the Communists burned his books, after the Mujahedeen looted his books and after the Taliban burned his books, yet again.After several meetings with Sultan Khan, he invited her to his home for a meal.  Seierstad at this point decided to write a book on the family and requested to live in his home.  Sultan Khan agreed.Seierstad stresses her story is about an untypical family in that most Afghans are illiterate and the average Afghan family lives in the countryside and struggles against hunger.Seierstad communicated with Khan family members in English and lived with the family for some months in 2002.  Seierstad wrote extensively about the Khan women, their lack of rights and freedom, and the general oppression of women in Afghanistan.  The book offers an extraordinary look behind the burqa or purdah, as the author sheds light on war torn Afghanistan."}, {"review_sentiment": 5.0, "review_text": "Well written. I'm very interested in reading more about the lives and customs of muslims and the people of Afghanistan. Compelling information. A must read."}, {"review_sentiment": 5.0, "review_text": "Asne Seierstad is such a gifted writer, understated, meticulous researcher fair, she is the journalist we all want to be. I bought this after reading her incredible book, One of Us, if you haven’t read it, do.This is a beautiful book."}]}, "authors": ["Asne Seierstad"], "isbn": "0316159417", "longitude": 69.1776476, "periods": ["2000s", "Recent Releases"], "title": "The Bookseller of Kabul", "word_cloud": "slightly insightful fill author embellishment supposition provide substance life author think do good job destroy life well totally fault very interesting family culture easy make want know life also make reflect lucky live difficult choice limit find quite enlighten real life man own bookstore make good live family cover history country various ruler example life free power enforce extreme form law amaze little power people live grow good old find difficult grasp live rule freedom especially woman survey world air casual win pen delectable slightly captivate account stay family own bookshop type year call personal story almost human mainly woman household family wife ton child equally great number sibling subtly liberal man time demanded woman household stay indoors keep give birth last dying spring follow fall spend month live family year defy authority communist supply people arrest interrogated imprisoned communist watch illiterate soldier burn pile street even resort hide stock almost ten thousand attic passionate love hatred censorship also strict view family life role woman outsider find unique position able move freely private restrict sphere woman include wife freer public live experience find fascinate frustrate step back page allows speak learn proposal marriage hope fear crime punishment result genuinely grip move portrait family assessment country struggle free household rule communist party later succeed dictatorial rule happy place woman wife handful child wive lot sibling grandparent house time warp generation share journey together unhappiness constraint repute bookshop owner sell modern controversial lot history liberal man politics patriotism yet tyrannical man come woman household wife daughter sister mother dominate old custom difficult rule set never believe woman equal right right education right husband right live freely right obey man house head live particular family month experience grueling lifestyle repressive household well country dominate warlord religious verge civil war forever suffer lot lose lot history dust bloodshed country woman suffer silently age author bring capture vividly pain country well woman always clothe bind black veil burka evocatively author personal account definitely move deeply failed stir emotion thought towards woman men author write style eloquent evocative enough make reader comprehend story line narrative mush realistic feel character voice honest opinion discreetly ears author even translated felt charm author flair lose translation prose articulate really strong leaf room reader judgment backdrop unhinge portray strikingly author story line successfully capture rugged golden terrain landscape well struggle country citizen especially woman read transport straight front bookshop well right large brick house felt scene unravel right eye author research well enough strike cord hearts reader also arrest fascinating way let reader troubled country mind character disappoint fact fail impress reader irk lack development lose interest tragedy light keep engaged country disturb politics religious extremist ideal life female character write much depth imprint mind readers account woman scatter disoriented hence time felt bored reading nutshell even non fictional account experience live dangerous repressive country yet somehow great enough country recommend hopeless story people try overcome unmanly rule religion education easy informative interest vignette life different political regime second half century norwegian journalist report live commando week travel mountain desert valley fall travel meet elegant browse many diverse shop felt draw interest enjoy conversation learn rebuilt bookshop burn loot burn yet several meeting invite home meal point decide write family request live home stress story untypical family illiterate average family live countryside struggle communicate family member live family month write extensively woman lack right freedom general oppression woman afghanistan offer extraordinary look bursa purdah author shed light war torn well write interested read life custom muslim people information gift writer understate meticulous researcher fair journalist want buy read incredible beautiful", "genres": ["Biography", "Travel Writing"], "summary": "Two weeks after September 11th, award-winning journalist Åsne Seierstad went to Afghanistan to report on the conflict there. In the following spring she returned to live with an Afghan family for several months. \r\n\r\nFor more than twenty years Sultan Khan defied the authorities - be they communist or Taliban - to supply books to the people of Kabul. He was arrested, interrogated and imprisoned by the communists and watched illiterate Taliban soldiers burn piles of his books in the street. He even resorted to hiding most of his stock in attics all over Kabul.\r\n\r\nBut while Khan is passionate in his love of books and hatred of censorship, he is also a committed Muslim with strict views on family life. As an outsider, Seierstad is able to move between the private world of the women - including Khan's two wives - and the more public lives of the men. And so we learn of proposals and marriages, suppression and abuse of power, crime and punishment. \r\n\r\nThe result is a gripping and moving portrait of a family, and a clear-eyed assessment of a country struggling to free itself from history.", "asin": "0316159417", "rank": "86531", "city": "Kabul", "image": "https://images-na.ssl-images-amazon.com/images/I/412zZmMIoYL.jpg", "country": "Afghanistan", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}