{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 25577, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "An old fashioned novel and a thriller at the same time, this book never bores. On the contrary its characters jump from the page and come alive. I haven`t enjoyed reading a book so much in a long time."}, {"review_sentiment": 5.0, "review_text": "Eloquently written! A spectacular journey into adulthood with an even more spectacular ending. I loved every second of this book."}, {"review_sentiment": 3.0, "review_text": "I loved the first 80% of the book. Then skimmed the last bit because it was just a character being self indulgent and explaining himself."}, {"review_sentiment": 1.0, "review_text": "WHY do people like this? I don't get it. Not only was I bored out of my mind with how slowly the story progressed (story? was there really a story or just a bunch of long-winded, tedious descriptions of mundane details?) but the main character, Theo, is supposed to be an adolescent boy and he just doesn't read like that at all. This is the difficulty of first-person writing. The author has to become the character, and Donna Tartt just did not become Theo.Since it's first person, it's all \"I\" and \"me,\" so it takes a while before somebody says his name. Right up until that point I believed that he was a very precocious 13-year-old girl because it reads like a girl. By that point, it was impossible for me to recast the role of Theo from a precocious girl to a troubled boy. Troubled 13-year-old boys don't have all those deep, emotional insights. If they did, they wouldn't be troubled.NOT that that would have helped. I only read the about first half of this book and the entirety of that is waiting for something to happen. Another reviewer said \"if you like a book that is all plot you might like this\" and I have no idea what that reviewer is talking about. I read 200 pages and the entirety of the plot was \"boy loses mom; boy moves in with friend.\" There were roughly 199 other pages describing the intricately detailed cast sconces in the sitting room and how the light they produced was eerily reminiscent of a 17th century gothic church on Sunday...or some such tangential nonsense.If you're a fan of boring literature or just want to tell people that you read Pulizter Prize winning books so they think you're smart, this is the book for you. If you're a fan of good stories with believable characters or books that are worth the time you put into them, then I'd avoid this."}, {"review_sentiment": 5.0, "review_text": "The character development in this book is amazing. One becomes part of the extraordinary life of the boy Theo. It is so suspenseful it was hard to put down, all the way to the very end. Highly recommend all of her books."}, {"review_sentiment": 1.0, "review_text": "I did not want to be one of those people who did not finish this book yet still trashed it. I did finish the book and I can tell you that there was not anything I can say I found enjoyable about the book. I have made it a goal to read at least one Pulitzer Prize winning book each year. I believe the reason this book won in 2014 was that Donna Tartt was obviously knowledgable about the drug culture and the art world. There was not a single character that I cared about by the end of the book."}, {"review_sentiment": 2.0, "review_text": "An unfinishable Pulitzer-winning laborious post 9/11 psychological drain about a kid covering his pain and guilt around his mom's death with everything he can grasp, including the titular painting."}, {"review_sentiment": 1.0, "review_text": "Drawls on and on and on and on...  feel like I waisted part of my life trying to get through his ramblings...  with absolutely no payoff."}, {"review_sentiment": 5.0, "review_text": "Good read."}, {"review_sentiment": 5.0, "review_text": "This book is extremely complicated. I would have to read it again To get the full value of it. I don't understand why Theo felt he had to give his message about life to the readers. I am not sure what his message was."}]}, "authors": ["Donna Tartt"], "isbn": "0316055441", "longitude": 0.0, "periods": ["1900s", "2000s", "Recent Releases"], "title": "The Goldfinch", "word_cloud": "old fashion thriller time never bore contrary character jump page come alive enjoy read much long time eloquently write spectacular journey adulthood even spectacular end love second love first then skim last bit character self indulgent explain people get not bore mind slowly story progressed story really story bunch tedious description mundane detail main character suppose adolescent boy difficulty write author become character become first person take somebody say name point believe precocious girl read girl point impossible recast role precocious girl trouble boy boys deep emotional insight first entirety wait something reviewer say plot idea reviewer talk page entirety plot boy lose mom boy move friend roughly page describe intricately detail cast sconce sit room light produce eerily reminiscent century gothic church tangential fan boring literature want tell people win think smart fan good story believable character worth time put avoid character development amaze become part extraordinary life boy suspenseful hard put way end recommend want people finish yet still trash finish tell anything say find enjoyable make goal least win year believe reason obviously knowledgeable drug culture art world single character care end unfinishable laborious post psychological drain kid cover pain guilt mom death everything grasp include titular painting feel wait part life try ramblings absolutely payoff good extremely complicate full value understand felt give message life reader sure message", "genres": ["Fiction & Literature"], "summary": "WINNER OF THE PULITZER PRIZE\r\n\r\n\"The Goldfinch is a rarity that comes along perhaps half a dozen times per decade, a smartly written literary novel that connects with the heart as well as the mind....Donna Tartt has delivered an extraordinary work of fiction.\" Stephen King, The New York Times\r\n\r\nTheo Decker, a 13-year-old New Yorker, miraculously survives an accident that kills his mother. Abandoned by his father, Theo is taken in by the family of a wealthy friend. Bewildered by his strange new home on Park Avenue, disturbed by schoolmates who don't know how to talk to him, and tormented above all by his longing for his mother, he clings to the one thing that reminds him of her: a small, mysteriously captivating painting that ultimately draws Theo into the underworld of art.\r\n\r\nAs an adult, Theo moves silkily between the drawing rooms of the rich and the dusty labyrinth of an antiques store where he works. He is alienated and in love--and at the center of a narrowing, ever more dangerous circle.\r\n\r\nThe Goldfinch is a mesmerizing, stay-up-all-night and tell-all-your-friends triumph, an old-fashioned story of loss and obsession, survival and self-invention, and the ruthless machinations of fate.", "asin": "0316055441", "rank": "2979", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41p4amaYISL.jpg", "country": "Amsterdam", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}