{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 64, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "While not his finest novel of this period, it contains some memorably witty scenes while capturing the dawn of modern tabloid culture."}, {"review_sentiment": 5.0, "review_text": "awesome book!  a must-read"}, {"review_sentiment": 5.0, "review_text": "One warms to Adam and Nina.  The Colonel is one of the most hilarious characters in literature.  If laughing can make one feel better, then the Colonel is the cure for what ails one."}, {"review_sentiment": 5.0, "review_text": "the not so subtle humor jumps out at one. a great read."}, {"review_sentiment": 5.0, "review_text": "He writes around the bitter, ugly mass of existence but does it in such a sing-song way that you're not quite sure how to digest it"}, {"review_sentiment": 2.0, "review_text": "Didn't know what to expect with this book, but having read it I'd say it's interesting only in what worked as satire/comedy then. The comedy relies heavily on the rather plotless ramblings of characters who must have seemed so humorously self-involved when it was written, but now aren't all that relatable."}, {"review_sentiment": 3.0, "review_text": "Supposedly this was Evelyn Waugh's break through novel.  It felt like the 1930s equivalent of Keeping Up with the Kardashians. If you like this sort thing read it for the equivalences between that time and ours.  Otherwise I would read the Sword of Honour Trilogy which I did enjoy."}, {"review_sentiment": 1.0, "review_text": "I was board by its predictably and unremitting and arch British humor."}, {"review_sentiment": 5.0, "review_text": "If you like Bret Easton Ellis type work, this is where it all began. Heck if you don't like his work, this is a better version on his style."}, {"review_sentiment": 4.0, "review_text": "This excellent satire about 1920's British \"Bright young things\" started a bit slowly for me but steadily picked up steam as it went along. By the time the tale had ended ( too soon I might add ) it had offered numerous laugh out loud passages. This was one of the funniest books that I've read in quite awhile...reminded me why I loved the other works by Waugh that I had read years ago."}]}, "authors": ["Evelyn Waugh"], "isbn": "0316216348", "longitude": -0.12574, "periods": ["1900s"], "title": "Vile Bodies", "word_cloud": "finest period contain memorably witty scene capture dawn modern tabloid culture awesome warm hilarious character literature laugh make feel better cure ail subtle humor jump great write bitter ugly mass existence way quite sure digest say interest work comedy rely heavily rather plot less ramblings character humorously write repeatable supposedly break felt equivalent keep sort thing equivalence time enjoy board predictably unremitting arch british humor like type work begin work better version style excellent satire british young thing start bit slowly steadily pick steam go time tale end soon offer numerous laugh loud passages funniest quite remind love work year ago", "genres": ["Fiction & Literature"], "summary": "In the years following the First World War a new generation emerged, wistful and vulnerable beneath the glitter. \r\n\r\nThe Bright Young Things of 1920s London, with their paradoxical mix of innocence and sophistication, exercised their inventive minds and vile bodies in every kind of capricious escapade. In these pages a vivid assortment of characters, among them the struggling writer Adam Fenwick-Symes and the glamorous, aristocratic Nina Blount, hunt fast and furiously for ever greater sensations and the hedonistic fulfillment of their desires. \r\n\r\nEvelyn Waugh's acidly funny satire reveals the darkness and vulnerability beneath the sparkling surface of the high life.", "asin": "0316216348", "rank": "194578", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51KmD0LaOgL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}