{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 3968, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Follow my instagram: @.holdencaufieldofvegas because thats how dank this book is.Follow @.bambilikespain for erotica"}, {"review_sentiment": 4.0, "review_text": "I read this book to see what it was all about and I'm glad I did. Amazing how Holden perceives things. I guess down deep he is sensitive and caring, he just needs to grow up and apply himself!"}, {"review_sentiment": 3.0, "review_text": "The botok Catcher in the Rye is about Holden Caulfield who gets kicked out of two schools and Pency Prep. He called and visited old classmates and teachers. Holden also scerctly fisited Pheboy when his parents were not home.  He goes to his home city, New York, and wanders around hotel's, bars, parks and the museum for three days before going back home Holden is a very pessimistic person who thinks everyone is phony except his little sister, Phebey, and the nuns. Personally this book was not my favorite, but by the end, it left a better impression on me then the beginning did. I recommend Catcher in the Rye to classmates and people that like an easy book to read but that has complex, in depth thoughts and concepts."}, {"review_sentiment": 5.0, "review_text": "Stradlater is hot"}, {"review_sentiment": 5.0, "review_text": "i read this book for the first time when i was a freshman in high school. i fell in love with holden caufeild, and could so easily identify with him. i felt like he was with me, like he was inside my head! i have read it many times since then, and each time i discover something new. it is a perfectly spun tale, coated with beautifully vivid anecdotes that will keep you smiling even through natural disasters. to know holden is to love him. what else can i say"}, {"review_sentiment": 3.0, "review_text": "Very small writing hard to read"}, {"review_sentiment": 5.0, "review_text": "I love the book and very fast shipping And exactly what my son needed for school !!"}, {"review_sentiment": 5.0, "review_text": "Love this boook. Didn’t want to reread my first edition, so I ordered this one. Three days of interesting interactions...."}, {"review_sentiment": 5.0, "review_text": "Came as expected"}, {"review_sentiment": 5.0, "review_text": "Amazing book"}]}, "authors": ["J. D. Salinger"], "isbn": "0316769487", "longitude": 0.0, "periods": ["1900s"], "title": "The Catcher in the Rye", "word_cloud": "instagram thatch dank erotica see glad perceive thing guess deep sensitive care need grow book get kick school call visited old classmates teacher also scarcely visit parent home go home city wanders hotel bar park museum day go back home pessimistic person think everyone phony little sister nun favorite end leave better impression begin recommend classmates people easy complex depth thought concept hot first time freshman high school fell love holden caufeild easily felt head many time time something new perfectly spun tale coat beautifully vivid anecdote keep smile even natural disaster know holden love else say very small write hard love fast shipping exactly son need school book want reread first edition order day interest interaction expect amaze", "genres": ["Fiction & Literature"], "summary": "The hero-narrator of THE CATCHER IN THE RYE is an ancient child of sixteen, a native New Yorker named Holden Caulfield. Through circumstances that tend to preclude adult, secondhand description, he leaves his prep school in Pennsylvania and goes underground in New York City for three days. The boy himself is at once too simple and too complex for us to make any final comment about him or his story. Perhaps the safest thing we can say about Holden is that he was born in the world not just strongly attracted to beauty but, almost, hopelessly impaled on it. \r\n\r\nThere are many voices in this novel: children's voices, adult voices, underground voices-but Holden's voice is the most eloquent of all. Transcending his own vernacular, yet remaining marvelously faithful to it, he issues a perfectly articulated cry of mixed pain and pleasure. However, like most lovers and clowns and poets of the higher orders, he keeps most of the pain to, and for, himself. The pleasure he gives away, or sets aside, with all his heart. It is there for the reader who can handle it to keep.", "asin": "0316769487", "rank": "2016", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZxSRLRUpL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}