{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 23, "rating": 3.5, "reviews": [{"review_sentiment": 1.0, "review_text": "Not well written.  It leaves far too many unanswered questions.  By the time the reader gets to the end, he or she realizes that the detective actually does not know what has gone on and who did what to whom.  The author uses a ridiculous device, which I am sure he thinks is very clever -- he is an audience of one as far as I am concerned -- to bring the plot to a close.  Shabby!  In my view, the only way the author would be able to dig himself out of the hole he has dug for the detective, would be if there has a follow-up book in which all of the many unanswered questions were answered.  I checked and, although he has written maybe 6 subsequent books, they are all separate stories and no explanation of the goings-on in this book is present.  The author doesn't even take the time to describe Rio to the reader.  What you come away with basically, is a bunch of street names.There are so many wonderful international mystery writers, spare your eyes and your time and try someone else."}, {"review_sentiment": 4.0, "review_text": "It was a slow start but then it had you wondering & guessing...I don't like open endings,  it it was a good book"}, {"review_sentiment": 5.0, "review_text": "The story moves quickly along. Everytime you think you've got a handle on where it's going , it deviates. I pegged the murderer from instinct not from actually believing he could've been the one to do it. Suspenseful. Highly enjoyable."}, {"review_sentiment": 4.0, "review_text": "I enjoyed it.  It was a intellectual police mystery with a brazilian flavor."}, {"review_sentiment": 4.0, "review_text": "Good story but a bit confusing."}, {"review_sentiment": 3.0, "review_text": "I liked the book only because it kept me involved and the story line was suchthat I kept reading, for I was absorbed in the plot.  But there was littledescription of the surroundings and no \"atmosphere\" of the place.  I didn'tfeel connected to the place at all.  It could have taken place anywhere, whereasI expected to feel something of being in Brazil.  In my opinion, the sexual,graphic depiction at the end had only one purpose, and that was to shock. It waswhat typically the American reader desires.  Sex and exploitation sell books inAmerica.  This book, of course was a translation, but I have read numerouscriminal detective novels in languages other than English, and there is description, literary style and a complicated, intriguing plot that does notrequire a unwarranted shocking sexually explicit ending when there was not oneinstance of anything sexual in the entire book, except some thoughts that the detective had. I was disappointed, but will most likely read another book by the same author."}, {"review_sentiment": 5.0, "review_text": "A Brazilian setting makes this mystery seem different than the typical English version. Once you read for awhile the unhappy detective emerges and you are in familiar emotional territory. Being in Brazil makes a huge difference unless you are knowledgable about the settings. As such it is different and very enjoyable."}, {"review_sentiment": 3.0, "review_text": "I am glad I got around to this book having already made the acquaintance of Inspector Espinosa.  \"The Silence of the Rain\" is Luis Garcia-Roza's first go at crime writing and as is fairly typical, not the best introduction to what subsequently grew into long running and very popular series.  I am therefore prepared to forgive some weaknesses in the story, the worst of which is its quite extra-ordinary ending.  For the rest, we get a wonderful mix of moods and settings as the rather dreamy (in both sense of the word) Espinosa lets his imagination run loose in trying to puzzle out why different people implicated in a young man's death are choosing to behave as they do.  Each is in some way an opportunist looking for an angle to exploit and as the tale twists and turns, we get a rich social commentary on the conflicts and contradictions that make up modern Brazil from the boardrooms of the global mining conglomerate to the back street shanties."}, {"review_sentiment": 5.0, "review_text": "The Silence of the Rain is my second book by Garcia-Roza. I just ordered a three-book boxed set. It is particularly enjoyable to learn more about Rio De Janeiro from the point of view of a native . . . in this case Inspector Espinoza. I like to predict the guilty party as soon as possivble during the story.  This time I hit it right at about the mid-way point; along with the other three possibilities that I carried along until the last 5 pages.  Short denouement.  Also good."}, {"review_sentiment": 5.0, "review_text": "Inspector Espinosa is an engaging detective. He considers himself incapable of \"sustained rational thought,\" yet he bears the same name as the great rationalist philosopher ( Spinoza in Portuguese becomes Espinosa). He's not corrupt, which makes him a misfit in the police force. His apartment is clogged with books, and he has no bookshelves, which puts him in constant conflict with his cleaning lady. He lives on Big Macs, milkshakes and frozen dinners, because he's divorced and alone. And he admires Melville's Bartleby the Scrivener -- a do-nothing character who makes an incongruous hero for a cop.The plot gets off to an odd start. In the first pages a we watch an executive disguise his suicide as murder.  But since Espinosa does not share the reader's knowledge, he spends most of the book trying to solve a murder that isn't a murder. But as he widens his investigation, key people disappear and real murders occur, which puts the inspector into a state of total confusion. He can only form fantasies about what 's going on, but his fantasies are all wrong.It's rare to see so much floundering by the detective-hero in a police procedural, but Espinosa is such an appealing character that I forgave him all his mistakes. I even forgave his inappropriate attraction to certain women characters in the story.The plot offers both inaction and action in generous doses. Tedious stake-outs and exciting shoot-outs. And some fascinating scenes of love-making. The denouement is ironic and unforgettable. I loved it.So I enjoyed this book immensely, even though the detective wasn't always brilliant. For one thing, the writing style is superlative -- rich in humor and literary finesse. And the setting in Rio is fun, for different reasons than you might expect. I've already ordered the next couple of books in the series."}]}, "authors": ["Luiz Alfredo Garcia-Roza"], "isbn": "0330490923", "longitude": 0.0, "periods": ["1900s"], "title": "The Silence of the Rain", "word_cloud": "not well write leave far many unanswered question time get end realize detective actually know go author use ridiculous device sure think clever audience far concern bring plot close view way author able dig hole dug detective many unanswered question answer check write maybe subsequent separate story explanation present author even take time describe basically bunch street many wonderful international mystery writer spare eye time someone else slow start wonder guess open ending good story move quickly think get handle go deviate peg murderer instinct actually believe enjoyable enjoy intellectual police mystery brazilian flavor good story bit confuse like kept involve story line keep read absorb plot little description surroundings atmosphere place connect place take place anywhere whereas i expect feel something opinion sexual graphic depiction end purpose shock typically american desire exploitation sell in america course translation numerous criminal detective novel languages english description literary style complicate intriguing plot not require unwarranted shock sexually explicit end one instance anything sexual entire thought detective disappoint likely author brazilian setting make mystery seem different typical version once awhile unhappy detective emerges familiar emotional territory make huge difference knowledgeable setting different enjoyable glad get around already make acquaintance first go crime write fairly typical best introduction subsequently grow long run popular series therefore prepared forgive weakness story worst quite end rest get wonderful mix mood setting rather dreamy sense word let imagination loose try different people implicate young man death choose behave way look angle exploit tale twist turn rich social commentary conflict contradiction make modern boardroom global mining conglomerate back street shanty second order boxed set particularly enjoyable learn point view native case like predict guilty party soon possible story time hit right point possibility carry last page denouement also good engage detective consider incapable sustained rational thought yet bear name great rationalist philosopher become corrupt make misfit police force apartment clog bookshelf put constant conflict cleaning lady live big milkshake frozen dinner divorce alone admire character make incongruous hero plot get odd start first page watch executive disguise suicide murder share knowledge spend try murder murder widen investigation key people disappear real murder occur put inspector state total confusion fantasy go fantasy rare much flounder police procedural appeal character forgive mistake even forgive inappropriate attraction certain woman character plot offer inaction action generous dos tedious excite fascinate scene denouement ironic unforgettable love enjoy immensely even detective always brilliant thing write style superlative rich humor literary finesse set fun different reason already order next couple series", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A Brazilian bestseller, this sophisticated story of murder, sex, and corruption introduces a riveting new crime series.\r\n\r\nIn a parking garage in the center of Rio de Janeiro, corporate executive Ricardo Carvalho is found dead in his car, a bullet in his head. It appears that he has been robbed and murdered. But the clues are few. The gun and his briefcase are nowhere to be found -- just the kind of case that is always assigned to Inspector Espinosa. Not your typical detective, the world-weary Espinosa has the mind of a philosopher, the heart of a romantic, and enough experience to realize that things are rarely as they first seem.\r\n\r\nAs Espinosa attempts to unravel the mystery of what really happened to Carvalho and his secretary, Rose, who disappeared shortly afterward, he discovers that the businessman had recently taken out a million-dollar life insurance policy. And there's another complication: Espinosa's attraction to Carvalho's beautiful widow, who is also one of the prime suspects. When two more bodies turn up, Espinosa is forced to shift the investigation into high gear before anyone else becomes a casualty.\r\n\r\nHurtling to a surprising and satisfying conclusion, The Silence of the Rain is an intelligent, unconventional detective novel with a distinctly Latin American flavor and a colorful, exciting locale. In Espinosa, America is about to meet an irresistible new sleuth.", "asin": "0330490923", "rank": "9451224", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/41j6xAA01jL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}