{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 26, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "It was ok but a bit of a dissapointment after the tv series. Quite different in places too."}, {"review_sentiment": 4.0, "review_text": "Still as good today as when I read it in the 80s. Raw and real, no holds barred."}, {"review_sentiment": 5.0, "review_text": "I went to school in the 50's and 60's and Puberty Blues brought back a lot of memories. I cannot say that I was a part of the culture described in the book but I knew many people we were part of that scene. What struck me was the lack of purpose and direction that many of the young characters displayed in their lives - often arising from the boredom that inevitably comes from \"nothing to do\".Although dated, Puberty Blues is still a good read for those who work with young people - and that includes parents of teenagers.  Society has yet to fully grasp the need to provide meaningful activities and responsible supervision for young people who are all potentially \"at risk\".  The drug scene, teenage pregnancy, suicide ... still lurk in the shadows waiting to ambush those who have not been been offered a healthy alternative. Ian Kerr, Australia"}, {"review_sentiment": 5.0, "review_text": "Just as good as the TV Show, I look forward to the next instalments and hopefully the next series on the box!"}, {"review_sentiment": 4.0, "review_text": "For anyone who grew up in the 70s and 80s, this book brings back memories good and bad about this era. Love the girls and the story of ow they coped in a mans world. Kinda wished they'd done another to see where they ended up..."}, {"review_sentiment": 5.0, "review_text": "A fascinating and often horrifying glimpse into the world of adolescence in 1970s middle-Australia. My own childhood was certainly nothing like this.... thank goodness!"}, {"review_sentiment": 5.0, "review_text": "I loved this book so much. Any girl that grew up in Australia, especially around the Sydney area, will get this book. I was a teenager about 20 years after when this book is set, but it still captures growing up perfectly. Great fun to read. Five stars from me."}, {"review_sentiment": 2.0, "review_text": "A rather crass enumeration of adolescent sexual encounters, with little to recommend it now that its shock value has eroded."}, {"review_sentiment": 5.0, "review_text": "Reading this at age 79, I found it hilarious. My students, reading it at age 15, empathised and the laughed nervously. Lette and Carey got the story just right and their last-page summary of what became of the real-life characters on whom the novel is based is a cautionary tale for current youngsters. This edition has forewords by Kylie Minogue and Germaine Greer - now there's a pair!"}, {"review_sentiment": 5.0, "review_text": "l first read this book in the 5th grade. Everybody in my class read it and l have continuously watched it throughout the years and it is still as good today as it was 20 odd years ago. Best coming of age/peer pressure movie l have seen to date (except maybe \"The Year My Voice Broke\"). Highly recommended reading!"}]}, "authors": ["Kathy Lette", "Gabrielle Carey"], "isbn": "0330489453", "longitude": 151.2164539, "periods": ["1900s"], "title": "Puberty Blues", "word_cloud": "ok bit disappointment tv series different place still good today real hold bar go school bring lot memory say part culture describe know many people part scene strike lack purpose direction many young character display life often arise boredom inevitably come nothing dated still good work young people include parent teenager yet fully grasp need provide meaningful activity responsible supervision young people potentially risk drug scene teenage pregnancy suicide still lurk shadow wait ambush offer healthy alternative just good tv look forward next installment hopefully next series box anyone grow bring back memory good bad era girl story ow cop man world wish do see end fascinating often horrify glimpse world adolescence childhood certainly nothing thank goodness love much girl grow especially area get teenager year set still capture grow perfectly fun star rather crass enumeration adolescent sexual encounter little recommend shock value erode read age find hilarious student read age empathize laugh nervously get story right summary become character base cautionary tale current youngster edition foreword pair l first grade class l continuously watch year still good today year ago come pressure movie l see date maybe year recommend reading", "genres": ["Fiction & Literature", "Young Adult"], "summary": "Kathy Lette's first novel, written with her surfie chick friend Gabrielle Carey, when they were eighteen. Written twenty years ago, PUBERTY BLUES is the bestselling account of growing up in the 1970s that took Australia by storm and spawned an eponymous cult movie. PUBERTY BLUES is about 'top chicks' and 'surfie spunks' and the kids who don't quite make the cut: it recreates with fascinating honesty a world where only the gang and the surf count. It's a hilarious and horrifying account of the way many teenagers live...and some of them die. Kathy Lette and Gabrielle Carey's insightful novel is as painfully true today as it ever was.", "asin": "0330489453", "rank": "1759231", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51AjuIxDH1L.jpg", "country": "Australia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}