{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 16, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "I read this in prep for my first trip to Barcelona. It gave me a great insight into the city and Catalonia. Now that I've visited this incredible, magical city, I plan to reread it."}, {"review_sentiment": 5.0, "review_text": "A book that drills down into the Barcelona and Catalan experience.  From the back cover \"It also explores the history of the Catalan nationalism, the tragedy of the Civil War, the Franco years, and the transition from dictatorship to democracy.\"  He also covers local festivals that visitors may want to include in their plan.  Well done. But, please note: no photos, illustrations or maps.  If you are interested in more than a walk along the Ramblas and a visit to Sagrada Familia - highly recommended.  Joel S."}, {"review_sentiment": 5.0, "review_text": "I read this while visiting Barcelona.  It added a lot to the experience of seeing the sights of the city."}, {"review_sentiment": 5.0, "review_text": "The writing is beautifully evocative of a place and a time.  If you're going to Barcelona, read this book. Toibin's writing flows, and his story is engaging."}, {"review_sentiment": 5.0, "review_text": "If you are going to visit Barcelona and want a sense of what the city is all about, this book is a must.  It is not a tour guide, although it touches on many of the landmarks.  Rather it is a guide to the history, art and artists, architecture and architects, and to the customs and personalities.  It will enrich your stay."}, {"review_sentiment": 4.0, "review_text": "This is a great book and very well written.  My wife and I read this prior to visiting Barcelona and knowing the facinating history made the stay that much more enjoyable"}, {"review_sentiment": 5.0, "review_text": "This is a wonderfully well written and insightful book about the amazing city of Barcelona. It's a little dated because writers write a a certain time and life keeps moving on. Nevertheless, his insights are thoughtful and well presented. The chapter on Gaudi and several other timeless personalities are very enjoyable."}, {"review_sentiment": 4.0, "review_text": "Do not be put off by the relative brevity of Colm Toibin's book on Barcelona as he covers a great deal of ground and captures the essence of city's rich cultural heritage and complicated political history.  The most interesting parts of his account are his own reflections of life in Barcelona over two extended periods in the last quarter of the 20th Century.  He watched as Barcelona came into its own after the death of Franco and the delicate political transition to democracy.  Toibin captures the trade offs shaping the new dispensation, many of which gib rather with the city's radical political traditions of past, but seem generally to have led to a grand renaissance in what was understandably a rather down trodden, resentful city.  \"Homage to Barcelona\" is a well wrought introduction to this great city and the part it played in the development of so many global cultural figures including Picasso, Casals, Dali and Miro.  My only regrets are the absence of any maps and the fact that the book was written as the preparations for the 1992 Olympics were beginning and it would have been good to have Toibin's thoughts on how these launched Barcelona into the top ranks of great global cities."}, {"review_sentiment": 5.0, "review_text": "On time delivery , nicely packaged ,great price. Thank you."}, {"review_sentiment": 5.0, "review_text": "What a beautiful traveler's guide to Barcelona.  it's obvious that Colm Toibin loves this city.  I lespecially enjoyed the chapter devoted to Gaudi.  When I finally visit the city, this book will be in my backpack."}]}, "authors": ["Colm Toibin"], "isbn": "0330373560", "longitude": 2.1774322, "periods": ["1800s", "1900s"], "title": "Homage to Barcelona", "word_cloud": "prep first trip give great insight city now visit incredible magical city plan drill experience back cover also explore history nationalism tragedy year transition dictatorship democracy also cover local festival visitor include plan do please note photo illustration map interested walk visit highly recommend visit add lot experience see sight city write beautifully evocative place time go write flow story engage go visit want sense city guide touch many landmark guide history art artists architecture architect custom personality enrich stay great well write wife prior visit know fascinate history make stay much enjoyable wonderfully well write insightful amazing city little date writer write certain time life keep move insight thoughtful well present chapter several timeless personality enjoyable put brevity cover great deal ground capture essence city rich cultural heritage complicate political history interesting part account reflection life extend period last quarter watch come death political transition democracy capture trade offs shape new dispensation many big rather city radical political tradition seem generally lead grand renaissance understandably rather trodden resentful city well wrought introduction great city part play development many global cultural figure include regret absence map fact write preparation begin thought launch top rank great global city time delivery nicely package great price beautiful traveler guide obvious love city especially enjoy chapter devote finally visit city backpack", "genres": ["Art & Architecture", "History", "Politics"], "summary": "This book celebrates one of Europe&#039;s greatest cities -- a cosmopolitan hub of vibrant architecture, art, culture and nightlife. It moves from the story of the city&#039;s founding and its huge expansion in the nineteenth century to the lives of Gaudi, Miro, Picasso, Casals and Dali. \r\n\r\nIt also explores the history of Catalan nationalism, the tragedy of the Civil War, the Franco years and the transition from dictatorship to democracy which Colm Toibin witnessed in the 1970s. \r\n\r\nWritten with deep knowledge and affection, Homage to Barcelona is a sensuous and beguiling portrait of a unique Mediterranean port and an adopted home. \r\n\r\n&#039;Toibin has the narrative poise of Brian Moore and the patient eye for domestic detail of John McGahern, but he is very much his own man&#039; Observer &#039;Having lived in Barcelona off and on since the 70s, Toibin knows all the fascinations of its sensuous Mediterranean history and lifestyle and \"the most precious jewels in the city&#039;s treasury of bars\" ...Toibin is the perfect guide&#039; Chicago Tribune", "asin": "0330373560", "rank": "62497", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51awdaGmEML.jpg", "country": "Spain", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}