{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 13, "rating": 3.5, "reviews": [{"review_sentiment": 4.0, "review_text": "This book was interesting in its use of history, art and modern day Holland. The information about art and history included information about how the Nazis took art and hid it from the Allies, as well as, the process used for individuals to regain possession of the art work in the present day. There was even more history in the artist's letters to a friend. This information was for me totally unexpected, but true to the story. The modern day mystery to the book kept the story interesting, and made me want to discover what was going on, and who was responsible. However, the ending to this part of the story seemed to come out of nowhere. I loved the language in this book. Ruth had such a way of speaking that was very enjoyable to me, especially in her conversations with Myles. She was very spunky with those in authority, and could get carried away in her responses to their questions. At times this attitude was totally called for, and managed to get the person's attention. At times Ruth seemed to make poor decisions, and could have potentially gotten herself into real trouble. This seemed to be a long book, but it held my interest from beginning to end, and was a real learning experience."}, {"review_sentiment": 4.0, "review_text": "Having recently been in Amsterdam, I read this with a city map beside me. Rather enjoyed the surprise directions the story took."}, {"review_sentiment": 4.0, "review_text": "good read"}, {"review_sentiment": 4.0, "review_text": "I was baffled by the wide range of differing reviews of this novel so I decided to read it myself.  In my opinion, the slang and jargon used are rather too American than I would believe Dutch people would used.  However, after I got past that, the novel soared and I was transported.  I greatly enjoyed the first half of the book.  I got a bit distracted with the second half, but overall I enjoyed the story."}, {"review_sentiment": 1.0, "review_text": "Pages and pages of minutiae and unrelated descriptions of what the character is thinking . Goes off on tangents about things totally unrelated to the story! Numerous misspelling of words, simple words, like whole ( spelled while)! Couldn't get past the first 5 chapters, I really tried. Long drawn out descriptions about Amsterdam and using street names and names of sections of the city, then goes into the history of the info mentioned which has nothing to do with the plot, which I thought was about a misappropriated painting by the Nazi's, could have fooled me. I've never been to Amsterdam! Boring and long. I want my money back!"}, {"review_sentiment": 5.0, "review_text": "I disagree with some of the reviews with respect to the authors writing skills. I think he writes with a nice easy style--easy to follow.Richard BrumerAuthor of The Chemist's Shop"}, {"review_sentiment": 5.0, "review_text": "I love how vivid the details of the story is, how it tells a rare but yet common tale of what happened after and before the Holocaust. It's really well written, in a simple but yet fantastic form. It reminds me of the new movie woman in gold. It's a really similar story but yet the author made this so different from that in her own great way.I would recommend to the author to make more books on this topic, make one about Lesensborn Camps and Action T4. Cause there is so much unknown about the holocaust, 17 million people died. 6 million Jews. So thus, not many known that."}, {"review_sentiment": 3.0, "review_text": "I liked the characters, I liked the descriptions (where they weren't too inaccurate) I would have liked this book on the whole... but... what a shame the author didn't bother to let someone from Amsterdam proofread it, apparently. Maybe I'm a stick in the mud in some of the research omissions, and I won't sum them all up. My family consists of many generations of Mokummers, and also I have affinity and maybe more than average insight into the accuracy of parts of the subject. I smile wrily at a protagonist relating that they ate well in Westerbork while in Amsterdam they were eating tulip bulbs...in 1942. I don't want to be pedantic. But some mistakes are just unforgivable. Mixing Dutch up with German is bad enough, when unintentional, but to have a Dutch person involved in war history and moving in with an old Jewish lady declaring herself happy to have acquired some more 'Lebensraum' is just unthinkable. Lebensraum is a highly volatile term for something completely different then what the author meant, namely something like headspace. The chambermaid at his hotel would have sufficed to check this with, any Dutch person who would have read it beforehand would have remarked on it. Especially in a book that holds some pretences of accurate detail, such as mentioning actual cases (Goudstikker et al) and lenghty historical descriptions, those things are a disrespect to the subject, even if the majority of readers, those elsewhere in the world won't notice. It also makes that I am no less likely to read a novel by the same author set in a place I don't know as well as Amsterdam..."}, {"review_sentiment": 2.0, "review_text": "I had really looked forward to reading this book. It appeared to be classic example of the genre. While the plot promised to draw me in totally, I found myself stuck and distracted by the author's style. I am starting to wonder if the prose is deliberately off-putting as a foil to the discrepancies in the painting. I hope so, because the inclusion of both American turns of phrase and an excess of English idioms makes the piece feel unreal. At times the text comes across as if many different people contributed, causing it to be disjointed.I have not finished yet and really hope the plot comes through to save it in the end."}, {"review_sentiment": 5.0, "review_text": "Excellent story for adults with a yen for thrillers, well written and with humour,great characterisation, and brilliant descriptions that bring to vivid life the people and places in Amsterdam. Perhaps a few too many Latin sentences which can leave the reader a little out in the cold, if Latin is not your first language. Mathews builds the suspense quietly, but surely and I found myself turning pages eagerly looking for the next link in the story. Hard to put down."}]}, "authors": ["Adrian Mathews"], "isbn": "0330441604", "longitude": 4.8936041, "periods": ["2000s", "Recent Releases"], "title": "The Apothecary's House", "word_cloud": "interesting use history art modern day information art history include information take hid well process use individual regain possession art work present day even history artist letter friend information totally unexpected true story modern day mystery keep story interest make want discover go responsible however end part story seem come nowhere love language way speak enjoyable especially conversation spunky authority carry response question time attitude totally call manage person attention time seem make poor decision potentially real trouble seem long held interest begin end real learning experience have recently city map enjoy direction story take good baffle wide range differ review decide opinion slang jargon use rather american people use however get past soar transport greatly enjoy first half get bit distracted second half overall enjoy story page page minutia unrelated description character think tangent thing totally unrelated story misspelling word simple word whole spell past first chapter really try drawn description use street name name section city go history info mention nothing plot think misappropriate paint never long want money disagree review respect author write skill think writes nice easy style easy love vivid detail story tell rare yet common tale happen really well write simple yet fantastic form remind new movie woman gold really similar story yet author make different great author make topic make much unknown holocaust people die thus many know like character like description inaccurate whole shame author bother let someone proofread apparently maybe stick mud research omission family consist many generation mummer also affinity maybe average insight accuracy part subject smile wily protagonist relate ate well eat tulip bulb want pedantic mistake unforgivable dutch bad enough unintentional person involved war history move old jewish lady declare happy acquire unthinkable highly volatile term something completely different author mean namely something head space chambermaid hotel person hold pretense accurate detail mention actual case et al lengthy historical description thing disrespect subject even majority reader elsewhere world also make le likely author set place know well really look forward read appear classic example genre plot promise draw totally find stuck distracted author style start wonder prose deliberately foil discrepancy paint hope inclusion turn excess english idiom make piece unreal time text come across many different people contribute cause finish yet really plot come save end excellent story adult yen thriller well write humor great characterization brilliant description bring vivid life people place perhaps many sentence leave little cold first language build suspense quietly surely find turn page eagerly look next link story put", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "When an old woman storms into the Rijks Museum demanding the return of her painting, archivist Ruth Braams cannot quell her curiosity. Together with Myles, her gay confidant, Ruth delves into the history of the piece of looted Nazi art and discovers an enigmatic picture with a disturbing wartime provenance. It also appears that the elderly Lydia is not the only claimant and, against strict bureau regulations, Ruth endeavours to help strengthen her case. Days later, Ruth begins to receive sinister anonymous threats, warning her to stay away from Lydia and the painting. \r\n\r\nWhen the door of her home, a houseboat on the Bloemgracht canal, is covered in graffiti and her gas supply tampered with, Ruth is convinced these are deterrents from the rival claimant. Our irrepressible and emotionally troubled heroine refuses to take them at face value and continues to strike up a friendship with the lonely old lady. But as the threats escalate, Ruth realises that there must be far more to the painting's popularity, and she enters into a series of increasingly lethal adventures as she investigates the painting's secret symbolism...", "asin": "0330441604", "rank": "2264910", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/51XZlGYlB2L.jpg", "country": "The Netherlands", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}