{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 3, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Well written, very emotive"}, {"review_sentiment": 4.0, "review_text": "A very detailed and down to earth book that looked at all aspects of this engagement.  Well written and interesting in style,"}, {"review_sentiment": 5.0, "review_text": "I am not sure why but I find Gallipoli fascinating - but I do - particularly the charge at The Nek, which is what this book examines.It starts just before the war is declared in Australia and talks about the enthusiasm and eagerness men had to enlist and serve their country and then follows the experience of several men - using words from their diaries and letters wherever possible - this gives it a more intimate feel.It describes a world and attitude very different from Australia today - an example of that is a man who was rejected by the Forces when he tried to enlist, because he had a deformed toe and came back a week later, asking if they'd take him now - he'd had the offending toe amputated.I learnt more about the charge and the war in general than I already knew; which I was grateful for.Reading the way the charge was planned and then executed was dismaying and, even though I knew the outcome, as I read I still had this ridiculous hope that it could be different.War is always a horrible thing but this kind of murder/suicide is just a tragic waste. I felt a deep sadness and also a deep sense of pride in the ANZACs as I read.I found it a moving and rewarding read."}]}, "authors": ["John Hamilton"], "isbn": "0330422022", "longitude": 31.243666, "periods": ["1900s", "Recent Releases"], "title": "Goodbye Cobber, God Bless You", "word_cloud": "well write emotive detailed earth look aspect engagement write interesting style sure find gallipoli fascinating particularly charge start war declare talk enthusiasm eagerness men enlist serve country follow several men use word diary letter wherever possible give intimate describes world attitude different today example man reject force tried enlist deform toe come back week later ask offend toe learn charge war general already know grateful way charge plan execute dismay even know outcome still ridiculous hope always thing kind tragic waste felt deep sadness also deep sense find move reward", "genres": ["History", "WWI"], "summary": "On August 7th 1915, men of the 3rd Light Horse Brigade staged one of the most tragic, brave and futile charges of the First World War. Seeking to break out of the Anzac position at Gallipoli they attempted to storm an extraordinarily strong Turkish position, defended by artillery, machineguns and thousands of men, using nothing but fixed bayonets and raw courage. The first wave of Light Horsemen were killed within seconds of leaving their trench, yet over the course of the next few minutes, three more lines went over the top, across the bodies of their dead and dying comrades, only to be instantly cut down themselves. All of them knew they were about to die. None held back. It was a massacre immortalised in Peter Weir's film, Gallipoli.\r\n\r\nJust before the order was given to send the third line, Trooper Harold Rush turned to his mate standing next to him and said 'Goodbye cobber. God bless you'. These words appear on his headstone, in the little cemetery near the scene of the charge.John Hamilton's book follows the men who fought and died in this action from the recruiting frenzy of August 1914, to their training camps, to Egypt, to the peninsula itself, to that fatal morning. It is a work of meticulous research and detail, which puts flesh on the bones of long dead men and boys. We see through their eyes the excitement, fear and horror of a generation encountering the carnage of modern war for the first time. Goodbye Cobber, God Bless You is compelling, personal and painfully moving.", "asin": "0330422022", "rank": "8392020", "city": "Cairo", "image": "", "country": "Egypt", "story_arc": ["Tragedy", "Things only get worse"]}