{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 22, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I actually read this book twice. About 15 years ago and recently after a trip to Java and Bali, I tracked down another copy and read it again.Other than a misleading title, (Nathaniel Courthorpe was a  minor factor in the story) this is an excellent history of the development of the spice trade between the East Indies and Europe. The Dutch and English fought between themselves on every level for this lucrative trade. Over a period of about 50 years this included wars, massacres, invasions of each other's developments, etc. There is a long list of participants and occasionally the author goes off on a tangent (about 40 pages is spent with Henry Hudson's expeditions of the arctic, for example) but all in all it is an excellent good. One thing I found particularly interesting was how Nutmeg originally only grew in the obscure Banta Islands, now part of Indonesia."}, {"review_sentiment": 4.0, "review_text": "STill reading ;)"}, {"review_sentiment": 5.0, "review_text": "History coming vividly alive as flawed unpredictable and surreal as real life! Painstakingly pasted together from various archiver and records Milton succeeds to render a flowing account of tha very complex fluxes and flows of the spice race. Riviting."}, {"review_sentiment": 4.0, "review_text": "good book"}, {"review_sentiment": 5.0, "review_text": "Yes, as an example of historical writing the book has problems.  One could argue that it is over-detailed; it was tedious in places.  But I wouldn't want too many details to be missing, because early 17th century values and practices are fascinating in their own right, and actions of the early explorers would have been incomprehensible without them.  And yes, Milton often circles back in his chronology, goes back and forth in time so that it's sometimes hard to follow. But that it a problem endemic to historical accounts in which several narratives are advancing simultaneously on several different fronts.  Better to put up with the reading difficulty than to have the account falsely simplified.  And though I did have to mark the map pages and keep referring back to them, there could have been no alternative other than a companion atlas (certainly at additional cost). But the virtues of this book far outweigh its faults and earn it five stars in my estimation.For one who rarely reads history, this account was fascinating on many levels.  Milton has organized innumerable first-person accounts, by tradesmen and ship captains and others not given to long descriptives, into this tapestry.Many conclusions Milton allows to emerge for themselves.  Life was dirt cheap in the plague-ridden seventeenth century.  Crews were nevertheless insanely brave to sail halfway around the world in boats no bigger than yachts.  And so many other human traits were in evidence here besides the lust for wealth: curiosity, competitiveness, adventurousness.The means of written expression of even the meanest of sailors are artfully elegant and understated by our standards, interesting in themselves.Milton's cause-effect historical ironies, coming only in the final chapter, made sticking with this account unusually rewarding.  I was reminded of an old BBC program \"Connections,\" which specialized in the unintended consequences of discoveries and inventions.  History is cool."}, {"review_sentiment": 5.0, "review_text": "Outstanding, for those interested in an adventure story, one of the courage of the individual as well as the power of business and government in the 18th and 19th centuries.  Interesting story about the history of the U.S. and of what is now Indonesia, including two islands at almost opposite ends of the globe: one that everyone on the planet knows of now, but which was quite unknown hundreds of years ago, and one that everyone knew about hundreds of years ago but that now no one knows of."}, {"review_sentiment": 4.0, "review_text": "A fascinating read."}, {"review_sentiment": 5.0, "review_text": "Great history"}, {"review_sentiment": 4.0, "review_text": "While I thoroughly enjoyed the book, I found the title totally misleading. The were many people who played a part in establishingthe spice trade of which \"Nathaniel\" was only one. Even the book only touched on him briefly."}, {"review_sentiment": 4.0, "review_text": "I absolutely recommend this great book!! i just kept on reading and reading!!! Such a small thing to make a huge difference to people in health and taste buds!!"}]}, "authors": ["Giles Milton"], "isbn": "0340696753", "longitude": 4.8936041, "periods": ["1600s"], "title": "Nathaniel's Nutmeg. How one man's courage changed the course of history", "word_cloud": "actually twice year ago recently trip track copy mislead title minor factor story excellent development spice trade fight level lucrative trade period year include war massacre invasion development etc long list participant occasionally author go tangent page spend expedition arctic example excellent good thing find particularly interesting originally grow obscure part read come vividly alive flaw unpredictable surreal real life paste together various archive record succeed render flow account they complex flux flow spice race rivet good example historical writing problem tedious place many detail miss early century value practice fascinate right action early explorer often circle chronology go back forth time sometimes hard follow problem endemic historical account several narrative advance simultaneously several different front put read difficulty account falsely simplify mark map page keep refer back companion certainly additional cost virtue far outweigh fault earn star rarely read account fascinate many level organize innumerable account tradesman ship captain others give long descriptive conclusion allow dirt cheap seventeenth century nevertheless insanely brave sail halfway world boat bigger yacht many human trait evidence lust wealth curiosity competitiveness mean write expression even meanest sailor artfully elegant understated standard interest historical irony come final chapter make stick account unusually reward remind old program specialize unintended consequence discovery invention cool outstanding interested adventure story individual well power business government century story include island almost opposite end globe everyone planet know quite unknown hundred year ago everyone know hundred year ago know fascinating thoroughly enjoy find title totally mislead many people play part establishing the spice trade touch briefly absolutely recommend great kept read reading such small thing make huge difference people health taste bud", "genres": ["History"], "summary": "The tiny island of Run is an insignificant speck in the middle of the Indonesian archipelago--remote, tranquil, and now largely ignored. \r\n\r\nAt the beginning of the seventeenth century, however, Run's harvest of nutmeg turned it into the most lucrative of the Spice Islands, precipitating a fierce and bloody battle between the all-powerful Dutch East India Company and a small band of ragtag British adventurers led by the intrepid Nathaniel Courthope. \r\n\r\nThe outcome of the fighting was one of the most spectacular deals in history: Britain ceded Run to Holland, but in return was given another small island, Manhattan.\r\n\r\nA brilliant adventure story of unthinkable hardship and savagery, the navigation of uncharted waters, and the exploitation of new worlds, Nathaniel's Nutmeg is a remarkable chapter in the history of the colonial powers.", "asin": "B00130EZ20", "rank": "9831611", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/511nP3aD8bL.jpg", "country": "The Netherlands", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}