{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 50.8465573, "ratings": {"num_ratings": 1349, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "I heard a lot about this book and it didn't disappoint.  Very detailed and informative and gives you the back story behind the great war."}, {"review_sentiment": 5.0, "review_text": "Fascinating history of the buildup to and first month of World War I.  While somewhat dense at times the revelatory nature of the narrative makes the difficult sections well worth the effort as Tuchman build a chronology of false assumptions, petty grievances, and missed opportunities that lead to 4 years of unimaginable suffering and the devastation of the old order in Europe."}, {"review_sentiment": 5.0, "review_text": "Somehow I made it through four years of HS \"honors\" English and history, then...ahem...quite a few years more of college, with a minor in history.  Yet I'd never heard of Barbara Tuchman, nor heard the remarkable (and terrible) story of this book's genesis, and eventual Pulitzer Prize.Hopefully you're not as ignorant as I was, and you simply haven't read The Guns of August because you're \"more of a WWII guy\".  I understand, I mean, the SS had skulls on their hats for gods sakes.  WWII makes for such a satisfying, archetypical story, and WWI does not have that.  In fact, quite the opposite:  its much more confused and morally ambiguous, but that's exactly what makes it more fascinating than 10 Hitlers and half-dozen Stalins; and Tuchman puts the reader into the minds of the leaders in the war's opening days with incredibly deftness, insight, and humanity.Besides, w/o understanding the thoughts and actions of the men who caused and ensured the first world war, you simply cannot grasp what was going on with the next generation in the second one.  I mean, you probably think Chamberlain was a weak-willed peacenik appeaser, willing to do anything to avoid having to fight the Germans again, don't you..."}, {"review_sentiment": 4.0, "review_text": "I was expecting more of a broad stroke analysis.  I am in no means upset nor disappointed.  The author does a terrific job and identifying tone, folly, and human consideration.  Terrific piece of work that I recommend."}, {"review_sentiment": 3.0, "review_text": "Very dry for me. However, I would not be surprised if other readers who love military history loved the book and writer."}, {"review_sentiment": 5.0, "review_text": "The book was exactly as advertised & arrived promptly. Thank you."}, {"review_sentiment": 4.0, "review_text": "Barbara Tuchman's breakout best seller depicts the events leading up to and the first month of World War I. There are a lot of ways to view this period of time-the birth of disillusion and the end of innocence, perhaps the major tragedy of the 20th century, the necessary pain and suffering needed to convince Europe that some form of political/economic union was preferable to generations lost in warfare, or perhaps just the birth of the modern world.  However you care to see it knowledge of this era leads to a more mature understanding of the roots of the world we live in. When I finish one of Tuchman's works I have a much improved sense of the events,personalities and locations that weave the background that leads to an overall understanding of just what happened. More importantly and difficult to put into words I get a feeling, the flavor of the age(Zeitgeist). Do not think of this book as homework, it bears little resemblance to those dry,excruitiatingly boring history texts I had to read in school.  Tuchman brings a passion to her work.  She augments that with hard work. Research on this book took a major chunk of her life and from a reader's viewpoint it was time well spent. She caps it off with polished prose that sets a standard for popular history. Dare I use the over worked cliche\"more exciting than a fiction thriller.\"Note: Tuchman's next work published four years later in 1966,the excellent The Proud Tower acts as a prequel to The Guns of August depicting the two decades leading up to WW I done with an end of era flavor."}, {"review_sentiment": 3.0, "review_text": "Difficult read since it is over mired in detail. Worth the read though."}, {"review_sentiment": 5.0, "review_text": "Scholars still argue about the significance of the weeks in between the Archduke assassination and the outbreak of general hostilities we now call World War One, but the fact remains this is one of Barbara Tuchman's outstanding works:  accessible to the public, and indispensable in understanding the role of strategy and firepower in the war's early days.  Great to read: I recommend it highly."}, {"review_sentiment": 5.0, "review_text": "The meager lecture I heard on this topic back in high school turned out to be wholly inadequate. The killing of the Archduke wasn't the cause of the First War. That was only the excuse to do something the Great Powers had been gleefully planning for decades. And then, when the war didn't end in a few weeks, as anyone who knew anything was sure it it must, this book introduces you to the men who then proceeded to kill millions out of sheer obtuseness. This book is highly engaging, and neither flippant nor shallow."}]}, "authors": ["Barbara W. Tuchman"], "isbn": "0345476093", "longitude": 4.351697, "periods": ["1900s"], "title": "The Guns of August", "word_cloud": "hear lot disappoint detailed informative give back story great war fascinate history buildup first month somewhat dense time regulatory nature narrative make difficult section well worth effort chronology false assumption petty grievance miss opportunity lead year unimaginable suffer devastation old order somehow make year honor history ahem quite year college minor history never hear hear remarkable terrible story genesis eventual ignorant simply guy understand mean skull hat god sale make satisfy archetypal story fact quite opposite much confuse morally ambiguous exactly make fascinate put mind leader war open day incredibly deftness insight understand thought action men cause ensure first world war simply go next generation second mean probably think appeaser willing anything avoid fight german expect broad stroke analysis mean upset disappoint author terrific job identify tone folly human consideration piece work recommend very dry however surprise reader love military history love writer exactly advertise arrive promptly breakout best seller depict event lead first month lot way view period birth disillusion end innocence perhaps major tragedy century necessary pain suffering need convince form union preferable generation lose warfare perhaps modern world however care see knowledge era lead mature understand root world live finish work much improve sense event personality location weave background lead overall understanding happen more importantly difficult put word get feel flavor age bear little resemblance dry excruciatingly boring history text school bring passion work augment hard work take major chunk life viewpoint time well spent cap polished prose set standard popular history use worked cliche excite fiction thriller next work publish year later excellent act depict decade lead do end era flavor mire detail scholar still argue significance week assassination general hostility call fact remain outstanding work accessible public indispensable understanding role strategy firepower war early day recommend highly meager lecture hear topic back high school turn wholly inadequate kill cause excuse something gleefully plan decade war end week anyone know anything sure men proceed kill million sheer highly engage flippant shallow", "genres": ["History", "Politics", "WWI"], "summary": "Selected by the Modern Library as one of the 100 best nonfiction books of all time\r\n\r\nThe Proud Tower, the Pulitzer Prize–winning The Guns of August, and The Zimmerman Telegram comprise Barbara W. Tuchman’s classic histories of the First World War era\r\n\r\nIn this landmark, Pulitzer Prize–winning account, renowned historian Barbara W. Tuchman re-creates the first month of World War I: thirty days in the summer of 1914 that determined the course of the conflict, the century, and ultimately our present world. Beginning with the funeral of Edward VII, Tuchman traces each step that led to the inevitable clash. And inevitable it was, with all sides plotting their war for a generation. Dizzyingly comprehensive and spectacularly portrayed with her famous talent for evoking the characters of the war’s key players, Tuchman’s magnum opus is a classic for the ages.\r\n \r\n“A fine demonstration that with sufficient art rather specialized history can be raised to the level of literature.”—The New York Times\r\n ", "asin": "0345476093", "rank": "6597", "city": "Brussels", "image": "https://images-na.ssl-images-amazon.com/images/I/51IAhwu5SUL.jpg", "country": "Belgium", "story_arc": ["Tragedy", "Things only get worse"]}