{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 3006, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Great title and a great book! It took me a while because of changing residences, but that way I was able to stretch out the enjoyment factor. The book not only brings to the forefront a dark time in US history, but the story is sweetened by the fully fleshed-out characters and the swirl of events in which they find themselves.  These are characters you're not likely to forget. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "The story is not something I expected but it was one that stayed with me and that I both wanted to keep reading and wanted to savor so it would last.  I  finished the book and immediately had to order the others from this author and i rushed to share this story with another reader friend so I could have someone to talk about it with. Loved this book."}, {"review_sentiment": 2.0, "review_text": "This story was a nice predictable tale that took way too long to tell. The history of the relocation camp life was the one highlight, and left me wanting to know more. Otherwise it’s forgettable."}, {"review_sentiment": 5.0, "review_text": "It was so much fun to read this given its setting in Seattle and the familiar places it describes.  I enjoyed “toggling” between the two eras as the author wove together a very engaging and delightful story."}, {"review_sentiment": 5.0, "review_text": "This is now one of my favorites. It brought about every emotion as I traveled through Hotel on the Corner of Bitter and Sweet.  Wonderfully written while flowing between two time zones & recognizing Seattle’s streets, parks & buildings, I didn’t want it to end."}, {"review_sentiment": 4.0, "review_text": "A great book about two children who were forced to grow up quickly due to war and its very real influence on those who looked like the enemy. A lovely mix of then & now. The story made me think about the tremendous pressures that impacted people of that era."}, {"review_sentiment": 4.0, "review_text": "I did not receive this book but I know it's a great book."}, {"review_sentiment": 5.0, "review_text": "This  is a touching story about first love and complicated family relationships.  I like the way Ford develops, Henry, the main character by a narrative split in time between the early 1940s  and the 1980s.  The story takes place in Seattle's China town and the neighboring Japanese community.  The reader experiences and feels the pain of the characters during the Japanese internment.  As a first love relationship grows, we see the characters experience racism, bullying, and conflict in family relationships.  What can we learn from this shameful time in our World War II history? Can we be a more accepting  open society and accepting of our diverse culture instead of ruled by fear and prejudice.  I recommend this book to anyone who loves sensitive well developed characters.  I especially like a novel that helps me understand an historical period or event."}, {"review_sentiment": 5.0, "review_text": "I loved this story. It was very well written. One of my favorite reads."}, {"review_sentiment": 5.0, "review_text": "I loved every page of this book. I couldn't go to sleep all night until I finished it! The main character, Henry,  is 56 years old as his story unravels, and his wife has just passed. Jamie Ford leads the reader carefully through each incident/story, always creating curiosity..  The book is based on real places and facts in history which I loved, having learned yet a new perspectives of WWII. I've never considered what it would be like for the Japanese who were living in America after the bombing of Pearl Harbor and I never understood the reason for the interment camps. Having friends from each culture, I have observed the confusion in America about the two totally different cultures. This read promises to entertain and enlighten. After reading, I was still curious about the jazz and searched the internet to learn about Oscar Holden. I'm sorry to be finished with this story and hope Jamie Ford doesn't disappoint in the next book!"}]}, "authors": ["Jamie Ford"], "isbn": "0345505344", "longitude": -122.3300624, "periods": ["1900s", "Recent Releases"], "title": "Hotel on the Corner of Bitter and Sweet", "word_cloud": "title great take change residence way able stretch enjoyment factor brings forefront dark time history story sweeten fully character swirl event character likely forget recommend story something expect stayed want reading wanted savor last finish immediately order others author rush share story friend someone story nice predictable tale take way long tell history relocation camp life highlight leave want know forgettable much fun give set familiar place describe enjoy toggle era author together engage delightful story favorites bring emotion travel write flow time zone recognize street park building want end great child force grow quickly due war real influence look enemy lovely mix story make think tremendous pressure impact people era receive know great touch story first love complicate family relationship like way develop main character narrative split time early story take place town neighbor japanese community experience feel pain character japanese internment first love relationship grow see character racism bully conflict family relationships shameful time history accept open society accept diverse culture instead rule fear prejudice recommend anyone love sensitive well developed character especially help understand historical period event love story well write favorite read love page sleep night finish main character year old story unravels wife pass lead carefully always create base real place facts history love learn yet new perspective wwii never consider japanese living bomb never understand reason interment camp have friend culture observe confusion totally different culture promise entertain enlighten read still curious jazz search internet learn sorry finished story hope disappoint next", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "In the opening pages of Jamie Ford’s stunning debut novel, Hotel on the Corner of Bitter and Sweet, Henry Lee comes upon a crowd gathered outside the Panama Hotel, once the gateway to Seattle’s Japantown. It has been boarded up for decades, but now the new owner has made an incredible discovery: the belongings of Japanese families, left when they were rounded up and sent to internment camps during World War II. As Henry looks on, the owner opens a Japanese parasol.\r\n\r\nThis simple act takes old Henry Lee back to the 1940s, at the height of the war, when young Henry’s world is a jumble of confusion and excitement, and to his father, who is obsessed with the war in China and having Henry grow up American. While “scholarshipping” at the exclusive Rainier Elementary, where the white kids ignore him, Henry meets Keiko Okabe, a young Japanese American student. Amid the chaos of blackouts, curfews, and FBI raids, Henry and Keiko forge a bond of friendship–and innocent love–that transcends the long-standing prejudices of their Old World ancestors. And after Keiko and her family are swept up in the evacuations to the internment camps, she and Henry are left only with the hope that the war will end, and that their promise to each other will be kept.\r\n\r\nForty years later, Henry Lee is certain that the parasol belonged to Keiko. In the hotel’s dark dusty basement he begins looking for signs of the Okabe family’s belongings and for a long-lost object whose value he cannot begin to measure. Now a widower, Henry is still trying to find his voice–words that might explain the actions of his nationalistic father; words that might bridge the gap between him and his modern, Chinese American son; words that might help him confront the choices he made many years ago. \r\n\r\nSet during one of the most conflicted and volatile times in American history, Hotel on the Corner of Bitter and Sweet is an extraordinary story of commitment and enduring hope. In Henry and Keiko, Jamie Ford has created an unforgettable duo whose story teaches us of the power of forgiveness and the human heart.", "asin": "0345505344", "rank": "8945", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/51KJSsNkKQL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}