{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 1303, "rating": 4.3, "reviews": [{"review_sentiment": 2.0, "review_text": "YAWN"}, {"review_sentiment": 5.0, "review_text": "i loved the interweaving of character and generational stories within the historical context of the book.  It would have enhanced my trips to Paris in the past and I already consider Paris my favorite city.  I highly recommend this book."}, {"review_sentiment": 5.0, "review_text": "Book in good condition."}, {"review_sentiment": 5.0, "review_text": "Perfect!  Reading it now ☺"}, {"review_sentiment": 5.0, "review_text": "Very good read."}, {"review_sentiment": 5.0, "review_text": "Have always loved Rutherford's books. Paris is a great read."}, {"review_sentiment": 5.0, "review_text": "Engrossing novel!!!  Loved the history - as well as the family stories....Rutherford never fails to deliver a fascinating, well researched novel.  Still have more of his books to get through....."}, {"review_sentiment": 4.0, "review_text": "Enjoyed the historical fiction but very long and at times text book like."}, {"review_sentiment": 3.0, "review_text": "Confusing movement between era's.  Covering several characters/ families through time.  Hard to keep it well enough in memory to appreciate the disjointed continuity.  \"London\" didn't have this problem."}, {"review_sentiment": 4.0, "review_text": "A little hard to keep the multigenerational timelines clear as the chapters change timelines drastically. Otherwsie  good stories although a little detailed in everyday subtleties."}]}, "authors": ["Edward Rutherfurd"], "isbn": "0345530764", "longitude": 2.3514992, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s"], "title": "Paris", "word_cloud": "yawn love interweaving character generational story historical context trip already favorite city highly recommend good condition very good always love great engross history well family story never fail deliver fascinate well research still historical fiction long time text confuse movement era cover several family time well enough memory appreciate disjoint continuity problem little hard multi generational timeline clear chapter change timeline drastically good story little detailed everyday subtlety", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "From the grand master of the historical novel comes a dazzling epic portrait of Paris that leaps through centuries as it weaves the tales of families whose fates are forever entwined with the City of Lights. \r\n   \r\nThis breathtaking multigenerational saga takes readers on a journey through thousands of years of glorious Parisian history--from its founding under the Romans to the timeless love story of Abelard and Heloise against the backdrop of the building of Notre Dame; to the martyrdom of Joan of Arc during the Hundred Years War; to the dangerous manipulations of Cardinal Richelieu and the bloody religious conflicts between Catholics and Protestants; to the gilded glories of Versailles; to the horrors of the French Revolution and the conquests of Napoleon; to the beauty and optimism of the belle epoque when Impressionism swept the world; to the hotbed of cultural activity of the 1920s and &#039;30s that included Picasso, Salvador Dali, Ernest Hemingway, and the writers of the Lost Generation; to the Nazi occupation and the incredible efforts of the French Resistance. \r\n   \r\nEven more richly detailed, thrilling, and romantic then anything Rutherfurd has written before, Paris: The Novel illuminates thousands of years in the City of Lights through intimate and vivid tales of characters both fictional and true, and with them, the sights, scents, and tastes of Paris come to sumptuous life.", "asin": "0345530764", "rank": "32342", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51yaJQfkYnL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}