{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 364, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "A page Turner that keeps you guessing to the very end.  A thrilling love story and an adventure in one."}, {"review_sentiment": 5.0, "review_text": "I love the vampires and love love love the witches! But The Mummy does not disappoint. A great book. I’m looking forward to the sequel!"}, {"review_sentiment": 5.0, "review_text": "Another great book by a master storyteller"}, {"review_sentiment": 5.0, "review_text": "great story"}, {"review_sentiment": 5.0, "review_text": "One of the best composed novels I have ever read. And it plays like a symphony. The drama of love and hate, and the timeless questions of our humanity as well as morality in our own existence are all there... just listen, as you read the words off of each page in anticipation of the next. This novel is a classic that is just WONDERFUL!"}, {"review_sentiment": 5.0, "review_text": "This was such a great story! I just can't get enough of any of Anne Rice's books. I've read them all and have pre-ordered the sequel to this book!"}, {"review_sentiment": 5.0, "review_text": "Great story line. If you liked interview with a vampire this a must read. Read it before the new book comes out."}, {"review_sentiment": 5.0, "review_text": "A fast read great pacing and rice delivered with a new storyline"}, {"review_sentiment": 4.0, "review_text": "No one does immortality like Anne Rice. Over the years, she's allowed us to see the long, brutal, tragic, beautiful, sordid history of humanity through the far-seeing eyes of all kinds of deathless creatures. Most famous for bringing the vampire into the 20th Century, she has also written from the perspective of werewolves, angels, demons, spirits, aliens, and even a genie. In this immortal menagerie, the fact that she also did her own version of a mummy story sometimes gets lost in the shuffle.Which is a shame, really, because The Mummy is actually very good. Anne does not quite reinvent the archetype here as she did with vampires and werewolves, but she definitely does what she does best: she takes the trope of an immortal “monster” and flips it around to create a deeply thinking, feeling being and in the process gives us history, romance, and excitement -- and in the process, somehow manages to take a dried withered husk of a human corpse and inject vitality and sexuality into it.The Mummy is less concerned than some of Anne's series novels with creating an entire mythos and focuses instead on story and romance, and while it may not be her greatest novel (I still think that honor belongs to The Witching Hour), I think in a lot of ways it may be the one that’s most accessible to new readers. It lacks the weight and the baggage and the commitment required for getting into the thousands of pages and huge cast of characters that make up The Vampire Chronicles or the Mayfair Witches.The book opens in a tense moment of action and, except for a slight lull in the middle, the narrative pushes forward at a brisker-than-usual pace for a Rice novel. Extravagant feasts, luxurious clothing, spacious rooms are all still there, and lovingly described, but it all accents the story rather than distracts from it. Historical events are recounted at various times throughout the book rather than one long exposition-dump flashback sequence and I enjoyed jumping between modern and Cleopatra-era Egypt. And, of course, this being an Anne Rice novel, the historical bits are meticulously researched and very enjoyable.The Mummy is divided into two distinct halves, and, without giving away too many details, a character from history is introduced in the second half of the novel that steals all the scenes for the remainder of the book in a way that I very much enjoyed, with one minor gripe: she totally takes the narrative wind out of the sails of Julie. Julie spends the first half of the novel being strong-willed, intelligent, independent, and one of Rice's better female characters, but fades into the background during the second half of the novel as the more volatile and, frankly, more interesting character takes over.In general, I feel that Rice’s female characters seem more realized when coming from a place of violence rather than tenderness. For all of Lestat’s bravado, the rest of Anne’s male immortals can be just as compelling in their softness (I’d take Louis to bed over Lestat any day, thank you). I find that Anne's best female characters have an element of brutality to them, and the one in this novel is no exception. One of my favorites among her many, many memorable immortals.I'm pleased at how well this novel held up from how my twelve year old mind remembered it when I read it twenty years ago. Rice fans have been waiting -- some more patiently than others -- for the sequel for a long time, and revisiting Ramses and spending the last few days with him made me very, very happy with my decision to pre-order The Passion of Cleopatra."}, {"review_sentiment": 5.0, "review_text": "Anne Rice delivers again  Looking forward to the next book"}]}, "authors": ["Anne Rice"], "isbn": "0345369947", "longitude": 31.243666, "periods": ["1800s"], "title": "The Mummy or Ramses the Damned", "word_cloud": "page keep guess thrill love story adventure love vampire love love witch disappoint great look forward sequel great master storyteller great story best compose novel ever play symphony drama love hate timeless question humanity well morality existence listen word page anticipation classic wonderful great story enough sequel story line like interview vampire new come fast great pace rice deliver new story line immortality year allow see long brutal tragic beautiful sordid history humanity eye kinds deathless creature most famous bringing vampire also write perspective werewolf angel demon spirit alien even genie immortal menagerie fact also version story sometimes get lose shame really actually good quite reinvent archetype vampire werewolves definitely best take trope immortal monster flip create deeply think feel process give history romance excitement process somehow manages take dry withered husk human corpse inject vitality sexuality le concerned series novel create entire myth focus instead story romance still think honor belong think lot way accessible new reader lack weight baggage commitment require get thousand page huge cast character make open tense moment action slight lull middle narrative push forward pace feast luxurious clothe spacious room still lovingly described accent story rather distract historical event recount various time rather long flashback sequence enjoy jump modern course historical bit meticulously research divide distinct half give away many detail character history introduce second half steal scene remainder way much enjoy minor gripe totally take narrative wind sail spend first half intelligent independent better female character fade second half volatile frankly interesting character take general feel female character seem realize coming place violence rather tenderness bravado rest male immortal compel softness take louis bed day thank find anne best female character element brutality exception favorites many many memorable pleased well hold year old mind remember year ago fan wait patiently others sequel long time revisit spend last day make happy decision delivers look forward next", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "Pop Culture"], "summary": "Ramses the Great has awakened in Edwardian London. Having drunk the elixir of life, he is now Ramses the Damned, doomed forever to wander the earth, desperate to quell hungers that can never be satisfied. \r\n\r\nAlthough he pursues voluptuous aristocrat Julie Stratford, the woman for whom he desperately longs is Cleopatra. And his intense longing for her, undiminished over the centuries, will force him to commit an act that will place everyone around him in the gravest danger....", "asin": "0345369947", "rank": "26789", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/61AvhyXpp9L.jpg", "country": "Egypt", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}