{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 402, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a fantastic book, the story is compelling and the characters are real."}, {"review_sentiment": 1.0, "review_text": "If there was a star less than one, I would assign that.... this book is boring, long, preachy, and predictable.  I am not halfway through it... and will not finish.  John Irving... have you lost your touch?"}, {"review_sentiment": 1.0, "review_text": "I was stranded in a small northern California beach town with no Internet no tv and only this book for company. After the first few chapters I thought  it has to get better,there must be some characters with some redeeming values that will show up sooner or later.  Alas that never happens, all are pathetic, all lives wander sadly,aimlessly hopelessly,irredeemable through long lives.Glad my life isn't populated with folks like this. If this is the soul of the author he should be put on suicide watch."}, {"review_sentiment": 5.0, "review_text": "John Irving is one of the best authors I have read."}, {"review_sentiment": 1.0, "review_text": "Went on forever then just ended.  I feel that I waster my time and money."}, {"review_sentiment": 5.0, "review_text": "He never disappoints!  Deep character studies. Gave insight into his writing in this novel . I always learn about a different profession!  This time it was logging, and of course, love."}, {"review_sentiment": 4.0, "review_text": "A master of plot, Irving surprisingly didn't seem to focus much on the storyline as he does the characters in this book. This novel is most certainly the product of years, maybe decades, of effort on behalf of Irving to create Daniel (Danny) and his world. It's hard to remember that this isn't autobiographical and that these people, particularly Danny and Ketchum, are (mostly) imagined. The story begins when Daniel is 12 and ends when he is in his 60s, but it doesn't plod along too slowly, and it kept my attention (I found the Rabbit Run series by Updike to be one book too many). If you are willing to read something with beautifully developed characters but a less exciting/captivating plot, it is certainly worth your time."}, {"review_sentiment": 5.0, "review_text": "I love John Irving, and this is now my 2nd favorite book by him after A Prayer for Owen Meany. Irving at his best!"}, {"review_sentiment": 5.0, "review_text": "As always riveting and entertaining . Loved it. Loved it . Loved it . He is just one of those authors that keep u coming back for more .  Every book is as good as the other. Pure genius."}, {"review_sentiment": 5.0, "review_text": "One of Irving's best."}]}, "authors": ["John Irving"], "isbn": "0345479734", "longitude": -79.387207, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Last Night in Twisted River: A Novel", "word_cloud": "fantastic story compel character real star bore long preachy predictable halfway finish lose touch strand small northern beach town tv company first chapter think better character redeem value show sooner later never happen pathetic life wander sadly aimlessly hopelessly irredeemable long life populate folk soul author put suicide watch best author went forever end feel waster time money never disappoint deep character study give insight writing always learn different profession time log course love master plot surprisingly seem focus much story line character certainly product year maybe decade effort behalf create world hard autobiographical people particularly mostly imagine story begin end plod along slowly kept attention find series many willing something beautifully develop character le plot certainly worth time love best always rivet entertain love author keep come back good pure genius best", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In 1954, in the cookhouse of a logging and sawmill settlement in northern New Hampshire, an anxious twelve-year-old boy mistakes the local constable’s girlfriend for a bear. Both the twelve-year-old and his father become fugitives, forced to run from Coos County—to Boston, to southern Vermont, to Toronto—pursued by the implacable constable. Their lone protector is a fiercely libertarian logger, once a river driver, who befriends them. \r\n\r\nIn a story spanning five decades, Last Night in Twisted River depicts the recent half-century in the United States as “a living replica of Coos County, where lethal hatreds were generally permitted to run their course.” What further distinguishes Last Night in Twisted River is the author’s unmistakable voice—the inimitable voice of an accomplished storyteller.", "asin": "0345479734", "rank": "167257", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51fez5XM%2BLL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}