{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 1439, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Wow!  What an incredible story weaver !  He keeps you guessing until you're getting close to the end of the book.  Superb storytelling at its very best !"}, {"review_sentiment": 5.0, "review_text": "On a scale of cotton candy to Brussels sprouts, An Officer and a Spy by Robert Harris is an aged Paolo Bea Sagrantino wine. The true flavors cannot be rushed and require a good 15 years of cellar time before it peeks. Time can be a friend.In 1895, Dreyfus is condemned to life on a deserted island for treason, and Picquart absolutely believes in Dreyfus's guilt. But then, Picquart discovers information that leads him to believe Dreyfus is innocent. More chillingly, the more Picquart tries to do the right thing, the more he realizes that others will stop at nothing to silence him.First of all, when I snagged this book from someone else's reading list, I had (somehow) come to the conclusion that this book was a romance between an officer and a spy. Well, I was wrong. Romance existed in the book, but it was of the most realistic and practical sort. The intertwining story of Dreyfus and Picquart seems to be a real life story of the underdog, fighting against back room political deals. It's both drawn out and action packed.When the book ended, I may have wailed aloud that I wasn't ready to be done. Why? Because I, too, had suffered and triumphed through the ordeal that Dreyfus and Picquart experienced.I recommend it to you if you're interested in pre-WW1 history."}, {"review_sentiment": 5.0, "review_text": "Excellent! Well written, engaging, suspenseful. A piece of history that should not be forgotten.  You'll want to talk to someone about the ending, so be prepared.  Highly recommend."}, {"review_sentiment": 5.0, "review_text": "Might is right.......no."}, {"review_sentiment": 5.0, "review_text": "Other reviewers go over the plot, and the book's page-turner power. But as an American who lived through the Watergate era, this book shows how that crisis of government culpability and cover-up was compared with the Dreyfus Affair. As this marvelous retelling of the French crisis and scandal shows, the closer parallel might also be the O.J. Simpson trial, for issues of \"race\" ran deep into both, to the detriment of discovering what really happened.  Like both American events, the Dreyfus Affair captured everyone's attention, prejudices and fears in France for years. I learned of this trying to read Proust's volume where 200 pages describe a dinner party where everyone argues Dreyfus, and I realized I'd need to know more history to make sense of it. I did, but this novel is far the most exciting well-done piece for all those curious about this horrific episode."}, {"review_sentiment": 5.0, "review_text": "Important story, written like a thriller, brilliantly researched."}, {"review_sentiment": 5.0, "review_text": "Unique writing style... captivating insights into the intense period of blatant anti-semitism in what one would believe was a sophisticated epoch of French history.  The Dryfus Affair lives in the far right intensity of political discourse found in Europe today."}, {"review_sentiment": 2.0, "review_text": "Not my genre of reading--too many names, found it confusing, to keep all  the  charactors straight."}, {"review_sentiment": 4.0, "review_text": "Interestiong story of Alfred Dreyfus and his conviction for spying."}, {"review_sentiment": 4.0, "review_text": "Enjoyable book about an incredible historical event."}]}, "authors": ["Robert Harris"], "isbn": "0345804856", "longitude": 2.3514992, "periods": ["1800s", "Recent Releases"], "title": "An Officer and a Spy", "word_cloud": "incredible story weaver keep guess get close end storytelling best scale cotton candy sprout age wine true flavor rush require good year cellar time peek condemn life desert island treason absolutely believe guilt discover information lead believe innocent chillingly try right thing realize others nothing silence snag someone else read list somehow come conclusion romance wrong romance exist realistic practical sort intertwine story seem real life story underdog fight back room political deal draw action end aloud ready do suffer triumphed ordeal recommend interested history write engage piece history forget want someone end prepared recommend right other reviewer go plot power live era show crisis government culpability compare marvelous retell french crisis scandal show closer parallel also trial issue race run deep detriment discover really happen american event capture everyone attention prejudice fear year learn try volume page describe dinner party everyone argue realize need know history make sense far excite piece curious horrific episode story write thriller brilliantly research unique write style captivate insight intense period blatant sophisticated epoch french history live far right intensity political discourse find today not genre read many name find confuse keep character straight story conviction spy enjoyable incredible historical event", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Winner of the American Library in Paris Book Award\r\n\r\nA whistle-blower.  A witch hunt. A cover-up. Secret tribunals, out-of-control intelligence agencies, and government corruption. Welcome to 1890s Paris.\r\n \r\nAlfred Dreyfus has been convicted of treason, sentenced to life imprisonment on a far-off island, and publicly stripped of his rank. Among the witnesses to his humiliation is Georges Picquart, an ambitious military officer who believes in Dreyfus's guilt as staunchly as any member of the public. But when he is promoted to head of the French counter-espionage agency, Picquart finds evidence that a spy still remains at large in the military—indicating that Dreyfus is innocent. \r\n\r\nAs evidence of the most malignant deceit mounts and spirals inexorably toward the uppermost levels of government, Picquart is compelled to question not only the case against Dreyfus but also his most deeply held beliefs about his country, and about himself.", "asin": "0345804856", "rank": "49833", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/517hMcLQobL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}