{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 16, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Oh, to be young, in Austin and living in Alamo House, fighting with the frat boys across the street and discovering life and love. This is a wonderful story of that time in life when we are all trying to figure things out, only to realize that life is too mysterious to comprehend. In the process we make friends and grow into the adults we will be. This book will make you laugh, shed a tear and yearn for those days of youth (if you're old) or (if you're young) compare your own crazy 20s with the residents of Alamo House. This book is wonderful! Buy it. Read it. (BTW, I am a verified purchaser only it happened back in the 1990s at an old-fashioned book store. I have all of Sarah Bird's books, and you will want to, too.) These early Texas books are just a hoot, and so much more."}, {"review_sentiment": 5.0, "review_text": "I love Sarah Bird, and this is my favorite of her books.  Having lived in Austin for 45 years, I remember this setting very well, and really enjoyed reliving it. Her books are always so funny, and I always recognize her characters as people I know."}, {"review_sentiment": 2.0, "review_text": "too much emphasis on the sexual exploits"}, {"review_sentiment": 5.0, "review_text": "This is a delightfully funny novel that satirizes college living situations, specifically  a  feminist coop and a frat house. This  book is more about living situations than college, as college is mostly a backdrop and almost all the action centers around these communal  living arrangements.My yellowed, wrinkled,falling apart mass market paperback is subtitled \"Women Without Men, Men Without Brains\" but never fear, the women come in for much skewering as  the men, if not more, as an all- female vegetarian coop is replete with possibilities, and the  frat boys living across the street can't be made to look much worse than they are in real life.This is Bird's first novel, and while a little uneven and with an ending that  is out of keeping with  the tone of the rest of the book, I forgive it any and all flaws because it is just so funny, with many finely drawn characters. I loved it when I read it in college, and several decades later (!)  I still love it.Bird's next novel is the equally enjoyable \"Boyfriend School\" read that too!I also recommend  her third novel \"The Mommy Club\", which is more serious and literary, but still with flashes of humor and satire. After this book, Bird's novels are  largely lacking in the wit and humor I found so engaging in her earliest works. I still read them but wish she hadn't moved so far  beyond the funny ones. (This is like only liking Woody Allen's earlier comedies and disdaining his later serious films.) I do read Bird's all of Bird's novels, but the later ones  just  don't feel like they came from  the same author."}, {"review_sentiment": 5.0, "review_text": "What can I say? I loved this book. After reading Bird's The Yokota Officer's Club, I was hooked on her writing style and voice. Her characters are well developed and so fabulously quirky and this novel most certainly delivers.Mary Jo has been living with her boyfriend thinking that she had found her \"settled down\" life. Unfortunately that included cleaning up his messes which he perpetually left in their house. Fed up, stressed out and preparing to enter grad school, Mary Jo seeks out other living arrangements. As a last ditch effort on her way home from work, she stops at the Alamo House. A Co-op for female graduate students at the University of Texas, Alamo House seemed a little too creepy for her. Then she got home. Shortly there after she was moving into the Alamo House.Filled with the spectrum of people only found on college campuses, Mary Jo comes to be a part of this easily missed community. She meets Collie who teaches her the Axiom and Fayrene, a girl with a photographic memory timid about life in the big city after leaving her very Baptist life in a small Texas town who come to be her inseperable cohorts in crime. From taking down the SUKs from within to their daily swimming ritual, these girls know how to play off of each other's traits and become stronger on their own.I also enjoyed the story line that revolved around her rock star coworker and their time at the LBJ library. Tommy reinvented his band four times just in this one book! His take on Birdiana is hilarious and well worth waiting to read about it.This had a good ending and there was room for more to be told. As with every good book I wish there was more to read but the ending was satisfying. I highly encourage you to read the Reader's Guide in the back. When I read Yokota it was actually an interview with Bird and her sisters. This time it is an essay by Bird reliving her time at the grad school co-op she lived in and it is totally entertaining. I cannot wait to read more books from this author."}, {"review_sentiment": 5.0, "review_text": "This is a story about being at a crossroads in life, wondering which way to turn or staying in the rut and not bothering  at all.  It begins with a young woman in a bad relationship who doesn't really want to leave, thereby cutting off the  possibility of getting married, but knows she should try something......and ends up at a sad excuse for housing called the Alamo House, which at first glance appears to be full of a bunch of weirdos and losers or as the frat house residents across the street call them - dykes (the ultimate macho jerk insult).  These guys harass them unmercifully.  As we met the inhabitants of this book and take a closer look, we smile in recognition.  By the end of the story we are rooting for Alamo House and plotting the destruction of the frat house right along side the girls.  The reader forgets how the characters were first described and see them in a much kinder light.  This plot is just the backdrop to the real story of the friendship formed between three girls, our narrator, an overweight girl away for the first time from her bible thumping family and a drama major who is a beautiful whirlwind that dresses up as doomed women (Marilyn Monroe, Sylvia Papth, etc.).  Their story is the most compelling and emotionally touching.  Oh yeah, the concept of feminism from all perspectives is also present in this story.  The author delivers all of these themes in one well written novel.  Kudos to Sarah Bird.  I highly recommend this book and look forward to reading other books by this author."}, {"review_sentiment": 5.0, "review_text": "Bored and browsing the Sam's book aisle, I reluctantly picked up the trade paperback copies of Sarah Bird's titles, \"Alamo House\" and \"The Mommy Club\", gave in and bought them, but I didn't open them.  Just shelved them for that \"mood hits me\" time.  I guess I didn't think Sarah Bird's writing was up the level I wanted at the time.Well, after a rather serious and great non-fiction read, I went to the shelves and pulled out \"Alamo House\" and pulled an all-nighter reading this tome.  It was like Animal House (the SUKs, appropriate name, eh?) meets the weirdo scholarly dames.  And it was/is fun and funny and poignant.I am so glad I met these women and entered into their lives and lived a bit of fictional/autobiographical Bird history of University of Texas Austin, circa the '80's.  I will now grab hold of \"The Mommy Club\" and find the other Bird reads to indulge myself in her clever storytelling.In addition, I will recommend this read to my fellow book clubbers and to my sister Red Hatters, especially those that loved \"Ya-ya Sisterhood\".I especially enjoyed reading Sarah Bird's \"Conversation with the Author\" at the book's end.Do yourself a favor and remember the Alamo in this version!  No need to go to the movies yet.But wouldn't this book make a fun movie, though?"}, {"review_sentiment": 4.0, "review_text": "I happened to read an article about Sarah Bird in the Austin American Statesman and it mentioned the re-release of three of her books. After reading brief descriptions of them, I ran out and bought them. Alamo House is a scream. It's an easy and quick read making you feel as if you, too, live right there in Alamo House with Mary Jo, Fayrene and Collie. I can't wait to pass my copy on to my friends who attended the University of Texas."}, {"review_sentiment": 5.0, "review_text": "March 14, 2000I can't believe this book is out of print. it is so well written, so funny, absolutely one of the best books i've ever read. --This text refers to an out of print or unavailable edition of this title"}, {"review_sentiment": 4.0, "review_text": "Fans of Sarah Bird have every reason to rejoice.  Her publisher, Ballantine Books, decided to republish three of her earlier works, and \"Alamo House\" will remind us that as early as 1986 (when \"Alamo\" was first published), Ms. Bird possessed talent as both a social observer and satirist.  Her abilities continued to grow, and her most recent novel, \"The Yokota Officers Club,\" firmly established her place in modern literature.  \"Alamo House\" allows us a chance to learn how Ms. Brid's talents have matured and grown.\"Alamo House\" ladels out sarcastic observations about decadent fraternity life, women's attempts to batttle against obnoxious male adversaries and students' quixotic jousts into adulthood.  Every character is delightfully skewed, and Bird gives each just enough humanity to captivate our imagination and invite our sympathies.  Recalling or recoiling against her own days as a graduate student at the University of Texas, Bird paints a grim, warped picture of undergraduate males, residing in an alcoholic-induced stupor at the appropriately-titled SUK fraternity.  When not hosting midnight parties  --  replete with music played at decibel levels more appropriate for a rock concert, drunken men engaging in projectile vomiting contests and lascivious undergrads trying to ply willing sorority sisters with enough alcohol to unfurl condoms  --  SUK seems to live only to torment the depressed denizens of Alamo House.As benighted as is the SUK house, the Alamo House holds its share of sadsacks as well.  Repressed house leaders, grad students whose passion for esoterica is eclipsed only by their perpetual presence in college and an exchange student whose mispronunciations and malapropisms leave no doubt as to her understated wisdom  --  the women who initially are resigned to daily/weekly/monthly degradation need an awakening.The cryptic and beautiful Collie, through her own words and actions, ignites rebellion, and the novel's protagonist, Mary Jo, senses both personal salvation and social consciousness through the charismatic, enigmatic Collie.  Joining these two women is Fayrene, whom Bird paints as so overweight that she literally has difficulty fitting into anything smaller than a tent.  As the three women galvanize Alamo House into acts of rebellion and genuine self-definition, the novel veers away from pure satire into an interesting discussion of the possibilities and limitations of 1980s feminism.Bird never permits politics to interfere with fun, however, and she clearly enjoys poking holes into sacred cows, whether they be political icons like Lady Bird Johnson, incompetent professors (often drunk, oblivious or skirt-chasing) and post-graduate curriculum.  \"Alamo House\" is so humorous that the reader can simply point to any paragraph in the novel to discover some tart observation or hyperbolic exaggeration.  At times, the novel tends to be excessively frothy, nearly wallowing in its own descriptive detail.  Yet, its pace and punch never lose momentum, and Mary Jo's wacky odyssey becomes our own."}]}, "authors": ["Sarah Bird"], "isbn": "0345460073", "longitude": -97.7436995, "periods": ["2000s"], "title": "Alamo House", "word_cloud": "young living fight frat boy street discover life wonderful story time life try figure thing realize life mysterious comprehend process make friend adult make laugh shed yearn day youth old young compare crazy resident wonderful verify purchaser happen back store sarah want early hoot much love favorite live year remember set well really enjoyed relive always funny always recognize character people know much emphasis sexual exploit delightfully funny satirizes college live situation specifically feminist coop frat living situation college college mostly backdrop almost action center communal living yellow wrinkled fall apart mass market paperback subtitle woman never fear woman much skewer men female vegetarian coop replete possibility frat boys live street much worse real first little uneven end keep tone rest forgive flaw funny many finely draw character love college several decade later still love next equally enjoyable also recommend third serious literary still flash humor satire novel largely lack wit humor find engage earliest work still wish move far funny one like earlier comedy disdain later serious film bird novel later one feel come author say love read hook write style voice character well develop fabulously quirky certainly live boyfriend think find settled life unfortunately include cleaning mess perpetually leave stress prepare enter grad school seek live arrangement last ditch effort way home work stop female graduate student seem little creepy then get home shortly move spectrum people find college campus come part easily miss community meet teach girl photographic memory timid life big city leave life small town come inseparable cohort crime take daily swim ritual girl know play traits become stronger also enjoy story line revolve rock star coworker time library reinvent band time take hilarious well wait good end room tell good wish end satisfy highly back yoko ta actually interview sister time relive time grad school live totally entertaining wait author story crossroads life wonder way turn stay rut bother begin young woman bad relationship really want leave thereby cut possibility get married know try something end sad housing call first glance appear full bunch weirdo loser frat resident street call dyke ultimate macho jerk insult guy harass unmercifully met inhabitant take closer look smile recognition end story root plot destruction frat right side girl forgets character first describe much kinder light plot backdrop real story friendship form girl narrator overweight girl away first time bible thump family drama major beautiful whirlwind dress doom woman story compel emotionally touch yeah concept feminism perspective also present story author delivers theme well write highly recommend look forward read author browse aisle reluctantly pick trade paperback copy title give buy open shelve mood hit time guess think write level want rather serious great go shelf pull pull read appropriate name eh meet weirdo scholarly dame fun funny glad meet woman enter life live bit history circa grab find read indulge clever addition recommend fellow clubbers sister red especially love especially enjoy read favor version need movie fun movie happen article mention read brief description run bought scream easy quick make feel live right pas copy friend attend print well write funny absolutely best ever text refer print unavailable edition title fan reason rejoice publisher decide republish earlier work early first publish possess talent social observer satirist ability continue grow recent firmly establish place modern literature allow chance learn talent mature grown ladle sarcastic observation decadent fraternity life woman attempt battle obnoxious male adversary student quixotic joust adulthood character delightfully skewed give enough humanity captivate imagination invite sympathy recall recoil day graduate student paint grim warped picture undergraduate male reside stupor fraternity host midnight party replete music play decibel level appropriate rock concert drunken men engage projectile vomit contest lascivious undergrad try ply willing sorority sister enough alcohol unfurl condom seem live torment depress denizen benight hold share sad sacks well repress leader grad student passion esoteric eclipse perpetual presence college exchange student mispronunciation malapropisms leave doubt understated wisdom woman initially resign degradation need cryptic beautiful word action ignites rebellion protagonist sense personal salvation social consciousness charismatic enigmatic woman paint overweight literally difficulty fit anything smaller tent woman act rebellion genuine veers away pure satire interesting discussion possibility limitation never permit politics interfere fun however clearly enjoy poke hole sacred cow political icon incompetent professor often drink oblivious curriculum humorous simply paragraph tart observation hyperbolic exaggeration time tend excessively frothy nearly wallow descriptive detail pace punch never momentum wacky odyssey becomes", "genres": ["Fiction & Literature", "Humour", "Women's Fiction"], "summary": "The sorority sisters of Alamo House at the University of Texas may be at comic odds with each other, but at least they have one thing in common: They all hate the fraternity rats across the street, the Sigma Upsilon Kappas—aka the SUKs. But amid the collegiate turmoil, Alamo House is also the scene of an extraordinary, endearing friendship among three women: Mary Jo, hilariously confused about life and love but determined to get both right; Fayrene, flushed with freedom after her escape from Baptist Waco; and Collie, party girl and self-proclaimed guide to the ways of the world. \r\n\r\nTogether they embark on a roller coaster of escapades that changes them all—and galvanizes Alamo House into an all-out counterattack against the SUKs. The result is infectious, side-splitting fun sure to convince everyone that Mary Jo, Collie, and Fayrene are the best southwestern mixture since tequila, lime, and salt.\r\n\r\n\r\n“More than just belly laughs. Bird’s stinging observations of human and sexual foibles provide frontline pictures so clear you can read the license plate numbers.” Austin Chronicle", "asin": "0345460073", "rank": "1901403", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/41MDJ559FDL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}