{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 2993, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "This book was a great read. It kept me captivated in the period as well as with the character portrayal. I enjoyed visiting Europe in the 1920’s and peeking into the lives of many influential people of that time and place."}, {"review_sentiment": 5.0, "review_text": "Very enjoyable book. Interesting take on a troubled individual and the people closest to him. Whether you have interesting in Hemingway himself or not, this book is crafts a good and entertaining story."}, {"review_sentiment": 5.0, "review_text": "Wife likes it."}, {"review_sentiment": 4.0, "review_text": "Three and a half really. It was good to read a perspective on Hemingway & his first significant marriage from the Hadley perspective. Better still a sympathetic and resistant to misandry one which many a female author might find hard to resist. Hadley, I  think, enjoyed her life - if this book is any to judge such from - more than Hemingway seems to have,  for all his celebrity and fortune. My problem, I  suppose,  was that I knew too much of the story. Hence the 3+ stars. Recommended."}, {"review_sentiment": 5.0, "review_text": "Beautifully researched and written, this latest antidote to the myth of hard-drinking, fist-fighting, high-living Papa Hemingway is a welcome addition to the speculative cannon. Drinking, fighting and excesses of all kinds there were aplenty and Paula McClain brings each scene to life with striking immediacy and sometimes bloody detail. But Hemingway’s emotional and physical upheavals as witnessed by his first wife, the recreated Hadley Richardson Hemingway, also include uncontrolled weeping, what we might call early-onset suicidal depression and passive, almost feminine sexual intercourse on Papa’s part. Of equal interest, though no secret among chroniclers of the so-called Lost Generation, McClain’s account of the creation of successive drafts of Hemingway’s breakout novel, The Sun Also Rises, came as a surprise to this reader. Hemingway’s first draft consists of a narrative of actual events that take place during the Festival of San Fermin in Pamplona, Spain, in which the real names of Hemingway’s companions appear. He was later wise enough to rename, for instance, Lady Duff Twysden as “Lady Brett,” himself the American journalist as “Jake Barnes” and so on. More important, however, despite Hemingway’s decision to exclude his wife from his own novel’s narrative, this roman a clef is a highly effective portrait of an incident-filled marriage from dreamy, drawn-out beginnings to its on-the-rocks, adulterous end. A must-read for fans of the period."}, {"review_sentiment": 4.0, "review_text": "Interesting story... Found out how selfish Hemingway was"}, {"review_sentiment": 5.0, "review_text": "An eccellent novel about a less known relationship in Hemingway's life. Well written and sensitive."}, {"review_sentiment": 5.0, "review_text": "I had read \"A Moveable Feast\" years ago, and was intrigued about the story line of this book.  It didn't disappoint!  I wish I had read the two closely together (Hemingway first)."}, {"review_sentiment": 5.0, "review_text": "This has to be one of the best books that I had read recently. The writing is exquisite. While considered “fiction” it makes it incredibly hard to say where the thin line between fact and fiction. It is a book that I would definitely recommend."}, {"review_sentiment": 5.0, "review_text": "What a great writer Paula McLain is. She made Paris in the 20's come alive and also places in Austria and Spain."}]}, "authors": ["Paula McLain"], "isbn": "0345521315", "longitude": 2.3514992, "periods": null, "title": "The Paris Wife", "word_cloud": "great keep captivated period well character portrayal enjoy visit peek life many influential people time place very enjoyable take trouble individual people closest interest craft good entertaining story like half really good perspective first significant marriage perspective still sympathetic resistant misandry many female author hard resist think enjoyed life judge seem celebrity fortune problem suppose know much story star recommend beautifully research write latest antidote myth welcome addition speculative cannon fighting excess kind aplenty bring scene life strike immediacy sometimes bloody detail emotional physical upheaval witness first recreate also include uncontrolled weeping suicidal depression passive almost feminine sexual intercourse part equal interest secret chronicler lose account creation successive draft also rise come first draft consist narrative actual event place real name companion appear later wise enough rename instance journalist more important however decision exclude narrative roman clef highly effective portrait marriage dreamy beginning adulterous end fan period interest story selfish excellent le know relationship life write sensitive a movable year ago intrigue story line disappoint wish closely together first best recently writing exquisite consider fiction make incredibly hard say thin line fact fiction definitely great writer make alive also place", "genres": ["Fiction & Literature", "Romance"], "summary": "A deeply evocative story of ambition and betrayal, The Paris Wife captures the love affair between two unforgettable people: Ernest Hemingway and his wife Hadley.\r\n \r\nChicago, 1920: Hadley Richardson is a quiet twenty-eight-year-old who has all but given up on love and happiness—until she meets Ernest Hemingway. Following a whirlwind courtship and wedding, the pair set sail for Paris, where they become the golden couple in a lively and volatile group—the fabled “Lost Generation”—that includes Gertrude Stein, Ezra Pound, and F. Scott Fitzgerald.\r\n \r\nThough deeply in love, the Hemingways are ill prepared for the hard-drinking, fast-living, and free-loving life of Jazz Age Paris. As Ernest struggles to find the voice that will earn him a place in history and pours himself into the novel that will become The Sun Also Rises, Hadley strives to hold on to her sense of self as her roles as wife, friend, and muse become more challenging. Eventually they find themselves facing the ultimate crisis of their marriage—a deception that will lead to the unraveling of everything they’ve fought so hard for.\r\n \r\nA heartbreaking portrayal of love and torn loyalty, The Paris Wife is all the more poignant because we know that, in the end, Hemingway wrote that he would rather have died than fallen in love with anyone but Hadley.\r\n \r\nNEW YORK TIMES BESTSELLER", "asin": "0345521315", "rank": "18049", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51m40jZ%2BiXL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}