{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 333, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "i loved this book."}, {"review_sentiment": 5.0, "review_text": "If you know James Baldwin, you know this work is simply amazing.  If you don't know Baldwin you need to.  As for the ebook product itself, no problems, very good."}, {"review_sentiment": 5.0, "review_text": "Kindle edition is well-formatted. An important book to read and know for your literary repertoire. I have read and re-read this book for over 30 years. Each time I read Baldwin's writings, the more I see the significant subtleties."}, {"review_sentiment": 5.0, "review_text": "This is the second book I've read by Baldwin, recommended by Yara Shahidi during an Instagram livestream. And it is easily one of the best stories I've ever read. And it was really relatable, that internal struggle of wanting to live your life but grappling with the fact that it's not what other people deem acceptable whether it's society or your own family.  Beautifully written."}, {"review_sentiment": 5.0, "review_text": "The writing is so good that I found myself occasionally pausing and wondering just how James Baldwin constructed such beautiful sentences. He has a unique style with a unique way of sentence structure that took a VERY brief moment to get into, but once I did I found the text flowing beautifully as if I was on a literary boat ride moving up and down with the swells. There was a lot of pathos in the story and the characters were fully fleshed out. It is remarkable that this book was written in the early fifties. The description on the back of the book is slightly misleading in that it is not really a love triangle (that phrase is not stated, but implied) as much as a story about two men, one of which has a not present fiancee who is only tangentially important to the story. I would absolutely recommend this book to anyone who appreciates beautifully written, well thought out plots with engaging characters."}, {"review_sentiment": 5.0, "review_text": "Beautifully written little story which holds little back. It is poignant and honest, and articulates sentiments all too familiar to those for whom this was written."}, {"review_sentiment": 5.0, "review_text": "Awesome."}, {"review_sentiment": 5.0, "review_text": "A classic but difficult to read novel about gender identity."}, {"review_sentiment": 3.0, "review_text": "One book is entirely fine while the other one has a huge fold at the back. Don’t know the reason but pretty disappointed"}, {"review_sentiment": 5.0, "review_text": "The best on Amazon. Flawless."}]}, "authors": ["James Baldwin"], "isbn": "0345806565", "longitude": 2.3514992, "periods": ["1900s"], "title": "Giovanni's Room", "word_cloud": "love know work simply amaze know need book product problem good edition important know literary repertoire year time baldwin writing see significant subtlety second recommend live stream easily best story ever really repeatable internal struggle want live life grapple fact people deem acceptable society family write write good find occasionally pause wonder construct beautiful sentence unique style unique way sentence structure take brief moment get find text flow beautifully literary boat ride move swell lot pathos story character fully flesh remarkable write early fifty description back slightly mislead really triangle phrase state implied much story men present fiancee tangentially important story absolutely anyone appreciate beautifully write well thought plot engage character beautifully write little story hold little back poignant honest articulate sentiment familiar write classic difficult gender identity entirely fine huge fold back know reason pretty disappoint best amazon flawless", "genres": ["Fiction & Literature", "LGBT"], "summary": "Set in the 1950s Paris of American expatriates, liaisons, and violence, a young man finds himself caught between desire and conventional morality. With a sharp, probing imagination, James Baldwin's now-classic narrative delves into the mystery of loving and creates a moving, highly controversial story of death and passion that reveals the unspoken complexities of the human heart.", "asin": "0345806565", "rank": "14129", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/510laeTge4L.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}