{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 243, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "3.5 starsConfusing story but fascinating insight into life in Cuba. Would make a good movie."}, {"review_sentiment": 4.0, "review_text": "\" Different\" ,  But Arkady is like a member of the family."}, {"review_sentiment": 5.0, "review_text": "My favorite( well, one of them)  author. This one does not disappoint."}, {"review_sentiment": 4.0, "review_text": "Fascinating view of Russo/Cuban breakup.  A bit slow-moving for a thriller."}, {"review_sentiment": 4.0, "review_text": "Thoroughly engrossing novel! Initially I thought it odd that a Russian detective novel would be set in Cuba, but it was totally logical. This is the best of the Arkady Renko novels that I've read (so far)!"}, {"review_sentiment": 4.0, "review_text": "Enjoy the series.  Havana Bay is a little dark, but still a good read."}, {"review_sentiment": 4.0, "review_text": "Very good"}, {"review_sentiment": 4.0, "review_text": "This is a very complicated and confusing book. Cuba is a very complicated country. The Cubans are very complicated people. This is a very good detective story."}, {"review_sentiment": 5.0, "review_text": "I’m still trying to decide whether he sits up above Le Carré and PD James. I’m not sure, but he’s certainly in the same league. Havana Bay has him putting his research skills and his imagination on the line again and succeeding brilliantly. Just as he imagined Russia and Russians flawlessly in the previous three books, he does the same in a Cubano-Russian setting this time. I’m again floored. I’ve been to Cuba, more than once, and I couldn’t possibly imagine how he got the kind of detail that he’s showing in the book. And not just physical detail, but details about the inner lives and pressures in a closed society. How does he do it? I was stunned by Gorky Park, his first Arkady Renko novel, and I’m just as amazed by Havana Bay. What a talent. It must be fun to research and imagine endlessly, slowly putting it together. But it’s a grind as well. I’m envious, either way.Anyway, Renko hits rock bottom this time, worse than being on the slime line in Polar Star, but he manages to claw his way back up, only to see it all…. Well, no need to spoil anything. Another great piece of work from the absolute master. I am in awe."}, {"review_sentiment": 5.0, "review_text": "MC Smith's Arkady Renko is an all time great fictional character. Super depiction of Castro's Havana. Excellent plot as always."}]}, "authors": ["Martin Cruz Smith"], "isbn": "0345502981", "longitude": -82.3658671, "periods": ["1900s", "Recent Releases"], "title": "Havana Bay: A Novel (William Monk)", "word_cloud": "stars confusing story fascinate insight life good movie different member family favorite well author disappoint fascinate view breakup bit thriller thoroughly engross think odd russian detective totally logical best arkady novel far series little dark still good very good complicate confuse complicate country complicate people good detective story still try sits sure certainly league put research skill imagination line succeed brilliantly imagine flawlessly previous set time floor possibly imagine get kind detail showing physical detail detail inner live pressure close society stun first amaze talent research imagine endlessly slowly put together grind well envious hit rock bottom time worse slime line manage claw way back see spoil anything great piece work absolute master awe time great fictional character depiction plot always", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "Politics"], "summary": "<span class=\"a-size-small a-color-secondary a-text-bold\">Book 4/</span><span class=\"a-size-small a-color-secondary\">8 in the </span><span class=\"a-size-small\">Arkady Renko Series</span>\r\n\r\nWhen the corpse of a Russian is hauled from the oily waters of Havana Bay, Arkady Renko comes to Cuba to identify the body. Looking for the killer, he discovers a city of faded loneliness, unexpected danger, and bewildering contradictions. His investigation introduces him to a beautiful Cuban policewoman; to the rituals of Santeria; to an American fugitive and a group of ruthless mercenaries. In this place where all things Russian are despised, where Hemingway fished and the KGB flourished, where the hint of music is always in the air, Arkady finds a trail of deceit that reaches halfway around the world–and a reason to relish his own life again.", "asin": "0345502981", "rank": "758883", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51zBnaps5-L.jpg", "country": "Cuba", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}