{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 24.5895489, "ratings": {"num_ratings": 1012, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Great novel, props to Michael Chrichton R.I.P."}, {"review_sentiment": 5.0, "review_text": "My son loves this book thank you."}, {"review_sentiment": 3.0, "review_text": "Same song, second verse.  Why get rich off of one novel when, you can just rework it with different characters, but basically the same plot?  Heck, it’s worked a few times now for Dan Brown.  Except, it’s not really all new characters.  But not Alan or Ellie, not the kids.  Instead, you get the annoyingly verbose and amazingly revived Ian Malcom!  “Oh, he wasn’t dead, just mostly dead.”  Just because “mostly dead” worked in The Princess Bride, does not mean that it will work here.Aside from that, this was a fair book.  Just don’t start reading this expecting something different."}, {"review_sentiment": 5.0, "review_text": "No issues!"}, {"review_sentiment": 5.0, "review_text": "Jurassic Park was a great book that was adapted into a great film. The Lost World is also great, I may enjoy the novel more than the first, but it’s film adaption wasn’t even close. They’re still borrowing elements from this book (see the *spoiler alert* camouflage dinosaur in Jurassic World when the idea was presented here first). I’ve read this book several times and it’s always enjoyable."}, {"review_sentiment": 5.0, "review_text": "I saw the movies this was much more fun to read . Michael Crichton is fun and informative. I really liked his character Sarah Harding."}, {"review_sentiment": 5.0, "review_text": "Came as expected"}, {"review_sentiment": 5.0, "review_text": "Michael Crichton is one of the greatest storytellers ever.  His ability, to weave a riveting, action-packed and insight-heavy work of art, deserves nothing less than stellar (5-stars is not good enough for him).He has a gift of craftsmanship at building and empowering a character, then designing a personality is that is complete.I commend him for the creation of Ian Malcolm. The knowledge imparted by this man in the book is worthy of its own Bible.For Michael Crichton to be able to conceptualise and then explain unrealised abstract concepts, further strengthens my belief of his intellect being superior than most! He clearly had an ability to absorb knowledge and invent his own.I quote Ian Malcom from the book as a proof:\"Looking at the fossil record is like thumbing through a family photo album. You know that the album isn’t complete. You know life happens between the pictures. But you don’t have any record of what happens in between, you only have the pictures. So you study them, and study them. And pretty soon, you begin to think of the album not as a series of moments, but as reality itself. And you begin to explain everything in terms of the album, and you forget the underlying reality.This is Pearls of Wisdom!You are immortalised by your books!"}, {"review_sentiment": 5.0, "review_text": "ok"}, {"review_sentiment": 4.0, "review_text": "It was a good book.I wanted to keep reading. Lots of scientific rambling that I think went on for too long and too much. It was a little unbelievable how Malcolm was always the one to understand everything. Made it a little too unreal for me but good nonetheless."}]}, "authors": ["Michael Crichton"], "isbn": "0345538994", "longitude": -107.3920441, "periods": ["1900s"], "title": "The Lost World: A Novel (Jurassic Park)", "word_cloud": "prop son love thank same song second verse get rich rework different character basically plot work time really new character kid instead get annoyingly verbose amazingly revive dead mostly mostly dead work mean work fair start read expect something different issue great adapt great film also great first film adaption even close still borrow element see camouflage dinosaur idea present first several time always enjoyable saw movie much fun fun informative really like character expect greatest storyteller ever ability weave rivet work art deserve nothing le stellar good enough gift craftsmanship build empower character design personality commend creation knowledge impart man worthy able conceptualize explain unrealized abstract concept strengthen belief intellect superior clearly ability knowledge invent quote proof look fossil record thumb family photo know album complete know life happen picture record happen picture study study pretty soon begin think album series moment reality explain everything term album underlying immortalize ok good want keep read scientific ramble think go long much little unbelievable always understand everything make little unreal good nonetheless", "genres": ["Fiction & Literature", "Mystery & Suspense", "Science & Nature"], "summary": "From the author of Timeline, Sphere, and Congo comes the sequel to the smash-hit Jurassic Park, a thriller that’s been millions of years in the making.\r\n \r\nIt is now six years since the secret disaster at Jurassic Park, six years since the extraordinary dream of science and imagination came to a crashing end—the dinosaurs destroyed, the park dismantled, and the island indefinitely closed to the public.\r\n \r\nThere are rumors that something has survived. . . \r\n \r\n“Fast and gripping.” The Washington Post ", "asin": "0345538994", "rank": "17761", "city": "Costa Rica", "image": "https://images-na.ssl-images-amazon.com/images/I/41uLDcfsvnL.jpg", "country": "Mexico", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}