{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 311, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Interesting reading, and Crichton at his usual best. Based on a true story, this should send chills down the spines of both men and women in business . Fascinating reading."}, {"review_sentiment": 5.0, "review_text": "Amazing read and plot development, especially given the circumstances of harassment in the new today - prescient, telling, and cautionary.  Harassment comes in many former and with many motives."}, {"review_sentiment": 5.0, "review_text": "This was different than most Michael Crichton books that I've read.  Not sci-fi. Really enjoyed a fast paced story."}, {"review_sentiment": 3.0, "review_text": "I would recomend this book if you are looking for a quick read that is hard to put down. It was an interesting story but there were some editing mistakes that made the story seem weak. For example some plot revelations were revealed twice as if it was the first time learning about them and the ending was a bit of a let-down."}, {"review_sentiment": 4.0, "review_text": "very good great price"}, {"review_sentiment": 5.0, "review_text": "Very engrossing story about female to male harassment in the corporate world. Well developed story and surprising conclusion. Recommended reading"}, {"review_sentiment": 5.0, "review_text": "ok"}, {"review_sentiment": 3.0, "review_text": "This book was made into a movie with Michael Douglas and Demi Moore.  But, the point it makes about abuse of power via unwanted advances is still valid."}, {"review_sentiment": 4.0, "review_text": "The Book LOST a Star from me because I do not like Graphic Sexual Content.  Crichton is a Dickens, of sorts though, in that there is always a Secret Message of Significance hidden by the day-to-day Gossip of his Stories.  So I skimmed past the Offensive and sought out that Secret Subplot - and FOUND IT!  Did you???? Reverey"}, {"review_sentiment": 4.0, "review_text": "I love every book I have read by Michael Crichton.  So sad he is not with us any more."}]}, "authors": ["Michael Crichton"], "isbn": "0345539001", "longitude": -122.3300624, "periods": ["1900s"], "title": "Disclosure: A Novel", "word_cloud": "interest read usual best base true story send chill spine men woman business fascinate reading amaze plot development especially give circumstance harassment new today prescient tell cautionary come many former many motif different not really enjoy fast paced story look quick hard put interest story edit mistake make story seem weak example plot revelation reveal twice first time learn end bit good great price very engross story female male harassment corporate world develop story surprising conclusion recommend reading ok make movie point make power unwanted advance still valid like graphic sort always hidden skim past sought find love sad", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "An up-and-coming executive at the computer firm DigiCom, Tom Sanders is a man whose corporate future is certain. But after a closed-door meeting with his new boss—a woman who is his former lover and has been promoted to the position he expected to have—Sanders finds himself caught in a nightmarish web of deceit in which he is branded the villain.\r\n \r\nAs Sanders scrambles to defend himself, he uncovers an electronic trail into the company’s secrets—and begins to grasp that a cynical and manipulative scheme has been devised to bring him down.", "asin": "0345539001", "rank": "155156", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/41ZERvuYa5L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}