{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1752, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "amazing keeps u wanting more!"}, {"review_sentiment": 4.0, "review_text": "I wanted to love this book because as a fellow Southeast Asian, I KNOW there aren't many of us (if at all - I think Kevin Kwan may be the first) that have become an international sensation in writing novels. I was ready and willing to be a fangirl of this series just because no Southeast Asian author I knew had broken through the international barriers to become a sensation. Maybe I expected too much and too high from Mr. Kwan because I finished the book with a tinge of disappointment over the journey I went through with Astrid, Rachel, and everybody else in the story.Maybe it's because I have already seen dramas similar to Crazy Rich Asians in Asian television and movie dramas. I know that one of the things that irked me was reading about the Filipino nanny because as a Filipino, I HATE when we're used as accessories to \"prove\" that somebody has status and wealth in the world. (I also know that later on in the book series, Astrid goes to the Philippines for self-reflection so maybe Mr. Kwan did not intentionally want to depict Filipinos in what I felt was derogatory) Whatever the case may be, I was underwhelmed with the story.Yes he writes about a very glamorous lifestyle with very wealthy people involved. Yes he set it in locations that Westerners would consider \"exotic\" in their eyes. None of this excited me.I still rated it four stars because I want to support my fellow Southeast Asian in selling more books and stories into the world. It isn't a TERRIBLE story, and if you haven't been exposed to affluent Asians then this might open up a new world for your consciousness. I was just underwhelmed with it.Sidenote: I know that the Crazy Rich Asians movie will have Filipino actors in it so I am now sure that Mr. Kwan doesn't look down on Filipinos as simply being nannies in the Asian economic ecosystem. I just get bothered when we're mentioned as such in stories (this isn't the first book I read where Filipinos are mentioned as nannies or maids) because I feel like we're more than just accessories to the rich people in this world. There are crazy rich Filipinos too.."}, {"review_sentiment": 5.0, "review_text": "Thoughtful and authentic characters with images of luxury that make your imagination run wild!  All with an inspiring message and a twist - I couldn’t stop reading!"}, {"review_sentiment": 5.0, "review_text": "Kevin Kwan's Crazy Rich Asians was one of the most fun and enjoyable fiction books I've read in the past several years.  We step into the lives of the Chinese \"Jet Set\"--no doubt greatly exaggerated for this book, yet based in truth.During the past 25 years, I have seen the world engulfed in a new tide of materialism.  No matter what level one is at, there seems to be a continual competition for status.  Among women, it always seems to focus on who is the most beautiful, who dresses the best, and who can snag the richest husband.  This book is a lot of fun as we see the younger, the middle-aged, and the elderly still competing.  Just when the reader begins to wonder if this is all this book is going to offer, the author begins bringing up real issues the characters face as a consequence of this lifestyle:  \"...people whose lives revolve around making money, spending money, flaunting money, comparing money, hiding money, controlling others with money, and reuining their lives over money.\"The larger issue is how much more materialistic the rest of the world is becoming during the past generation.  Many young people all over the world are aspiring to this lifestyle--the same lifestyle promoted by celebrities such as the Kardashians.  I spent the past 25 years as an expat.  When I arrived in my expat country in the early 1990s, there was little here in the way of material goods.  That all changed around the year 2000, and the society I'm in has been transformed by materialism.  I even recognized people I know who aspire to behave like the characters in this book.  From what people tell me, the same thing has happened in America.  Many young people are aspiring to a jet set lifestyle.  Forty years ago, well-heeled Americans took spring vacations in Miami and Mexico, and this is the lifestyle that was aspired to by those who couldn't yet afford it.  Today the ante has been raised.  Today, people jet off on international vacations and compete on a far higher level.  This certainly doesn't bode well for the planet with a now larger population of young people in countries all over the world aspiring to the celebrity lifestyles they see on television,  while those who can't afford these lifestyles growing ever more angry at what they perceive as \"the undeserving one percent.\"  So while Kwan has written a very fun book, a lifestyle fantasy for many, he's also written a book with some true reflective life value.The characters in this book are realistic and compelling.  The main characters are likable ad admirable.  The book, first in a series of three, ends at a satisfying place, yet leaves me eager to pick up the next book.  This book was hard to put down, and I read the whole thing in two days.  Kevin Kwan is already my new favorite author."}, {"review_sentiment": 3.0, "review_text": "Surprisingly insightful about the socioeconomic climate in Southeast Asia, especially since this presented itself like a trashy chick lit book."}, {"review_sentiment": 3.0, "review_text": "I really liked this book...until the end, which felt extremely abrupt and unsatisfying after all the interesting build up. I literally kept swiping my Kindle thinking, surely, there must be another chapter or two to wrap this story up? A cliffhanger? Something. Nope. It's like the author was intentionally trying to drag the story out to write the additional books, but he didn't set it up at the end in a way that made me want to keep going to read the next two books."}, {"review_sentiment": 5.0, "review_text": "Great read.  Will make, I'm sure , a great movie.  I assume the portrayal of the rich of Singapore is accurate because that makes it even better."}, {"review_sentiment": 3.0, "review_text": "Funny and entertaining a good read.  I loved the descriptions of the lavish lifestyles and believe the Chinese family dynamics even in today’s world. I chose 3 stars because of the up in the air endings on many of the love stories. I don’t need books to end all sappy but this one could have used an engagement ring."}, {"review_sentiment": 5.0, "review_text": "Hilarious and tough to put down! Great for a beach read, or  passing time on a flight. Would highly recommend."}, {"review_sentiment": 4.0, "review_text": "Good book for discussion"}]}, "authors": ["Kevin Kwan"], "isbn": "0345803787", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Crazy Rich Asians", "word_cloud": "amaze keep u want want love fellow know many think international sensation write novel ready willing fan girl series author know broken international barrier become sensation maybe expect much high finish tinge disappointment journey go everybody else already see drama similar asian television movie drama know thing irk read nanny hate use accessory somebody status wealth world also know later series go maybe intentionally want depict felt derogatory case underwhelmed writes glamorous lifestyle wealthy people involve set location exotic eye none excite still rat star want support fellow asian selling story world story expose affluent new world consciousness underwhelmed know movie actor sure look simply nannies asian economic ecosystem get bother mentioned story first filipinos mentioned nanny maids feel accessory people world filipino authentic character image luxury imagination inspiring message twist stop read fun enjoyable fiction several year step live chinese doubt greatly exaggerate yet base year see world engulf new tide materialism matter level seem continual competition status woman always seem focus beautiful dress best snag richest husband lot fun see younger elderly still compete begin wonder go offer author begin bring real issue character face consequence lifestyle people life revolve make money spending money flaunt money compare money hide money control others money rein live money larger issue much materialistic rest world become past generation young people world aspire lifestyle lifestyle promote celebrity spend past year expat arrive expat country early little way material good change year society transform materialism even recognize people know aspire behave like character people tell thing happen young people aspire jet set lifestyle year ago take spring vacation lifestyle aspire yet raise people jet international vacation compete far higher level certainly bode well planet larger population young people country world aspire celebrity lifestyle see television lifestyle grow ever angry perceive undeserving percent write fun lifestyle fantasy many also write true reflective life character realistic compel main character likable ad first series end satisfy place yet leave eager pick hard put whole thing day already new favorite author surprisingly insightful socioeconomic climate especially present trashy chick lit really like end felt extremely abrupt unsatisfying interesting build literally keep swipe think surely chapter wrap story cliffhanger something author intentionally try drag story write additional set end way make want go next sure great movie assume portrayal accurate make even better entertain good love description lavish lifestyle believe chinese family dynamic even today world choose star air ending many love story need sappy use ring hilarious tough put beach pass time flight highly good discussion", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "When New Yorker Rachel Chu agrees to spend the summer in Singapore with her boyfriend, Nicholas Young, she envisions a humble family home and quality time with the man she hopes to marry. But Nick has failed to give his girlfriend a few key details. One, that his childhood home looks like a palace; two, that he grew up riding in more private planes than cars; and three, that he just happens to be the country’s most eligible bachelor.\r\n\r\nOn Nick’s arm, Rachel may as well have a target on her back the second she steps off the plane, and soon, her relaxed vacation turns into an obstacle course of old money, new money, nosy relatives, and scheming social climbers.\r\n\r\n“A dizzily shopaholic comedy. . . . Wickedly delectable. . . . Offers refreshing nouveau voyeurism to readers who long ago burned out on American and English aspirational fantasies. . . . Hilarious.” The New York Times", "asin": "0345803787", "rank": "1796", "city": "Singapore", "image": "https://images-na.ssl-images-amazon.com/images/I/41ipbw5JzFL.jpg", "country": "Hong Kong", "story_arc": ["Tragedy", "Things only get worse"]}