{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 97, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Of all the novels I have ever read (I'm over 50 and have read a lot of books) this one has haunted me and stayed with me.  I read it about a year ago and it is still with me.  I was just thinking about it again so I decided to write a review saying so.  The prose and language are beautiful.  I work with a human trafficking organization and this author's descriptions have helped me understand some of what our girls have experienced at the hands of men.  The broken stay broken unless God Himself intervenes.  The men are just as broken.  Don't read it if you can't take it.  But the truth is...it's a brutal subject and the author writes about it with absolutely poetic language.  Incredible skill."}, {"review_sentiment": 3.0, "review_text": "Too much pain and torture for my tastes.  Would recommend her other book  Shark Dialogues2"}, {"review_sentiment": 5.0, "review_text": "Fantastic writer.  It's a style of writing I aspire to.  Love her stories, characters, poetry"}, {"review_sentiment": 3.0, "review_text": "sad story at times"}, {"review_sentiment": 1.0, "review_text": "Despite its skillful writing, I simply could not read this book!  It came highly recommended by someone whose taste in reading I share (usually).  I tried...  Ultimately, I found it BORING and tedious, probably because I have NO interest in early Jazz, and do not care to read about women being tortured and murdered in a Japanese POW camp. I do have great interest in Hawaiian history and culture. So, before giving up on it, I read all the one star reviews on Amazon. There are enough readers who shared my views that I knew there was no point in continuing."}, {"review_sentiment": 5.0, "review_text": "This novel wrenches the reader back many decades to the time before and after Hawaii became a state.  The characters truly drive the serpentine, multi-generational story, including everything from jazz to the spilling of blood during WWII, to another battle: voting to make Hawaii a state in the United States.  Davenport uses dialect skillfully, further pulling the reader into the times in which the story unfolds."}, {"review_sentiment": 4.0, "review_text": "Powerful and eye opening."}, {"review_sentiment": 5.0, "review_text": "A true voice of Hawaii, Kiana Davenport weaves the history of Hawaii with a poetic style of writting. Her love for the beautiful state comes across every page. I recommed Kiana Davenport to my friends visiting Hawaii and those who dream of going to Hawaii one of these days. After all, I first discovered her Shark book while visiting the lovely state Hawaii."}, {"review_sentiment": 5.0, "review_text": "A beautiful, tragic love story of the intertwining of lives across the world.  The horrors of war highlighted this time are the experiences of invasion and capture rather than fighting.  This is all set against a backdrop of the cultural changes wrought on Hawaiians as a minority in their own country."}, {"review_sentiment": 2.0, "review_text": "I was hoping for a much more compelling story and was very disappointed."}]}, "authors": ["Kiana Davenport"], "isbn": "0345434943", "longitude": -157.8556764, "periods": ["1900s", "Recent Releases"], "title": "Song of the Exile", "word_cloud": "novel ever lot haunt stayed year ago still think decide write review say prose language beautiful work human traffic organization author description help girl experienced hand men broken stay intervene men break do brutal subject author write absolutely poetic language skill too much pain torture taste fantastic writer style write aspire story character poetry sad story time skillful write simply come highly recommended someone taste reading share usually try ultimately find tedious probably no interest early care woman torture murdered japanese camp great interest hawaiian history culture give star review enough reader share view know point continue wrench back many decade time become state character truly drive serpentine story include everything jazz spill blood battle vote hawaii state use dialect skillfully pull time story unfolds eye opening true voice weave history poetic style write love beautiful state come page recommend friends visit dream go day first discover visit lovely state beautiful tragic love story intertwine life world horror war highlight time experience invasion capture rather fight set backdrop cultural change work minority country hop much compel story disappoint", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "In this epic, original novel in which Hawaii's fierce, sweeping past springs to life, Kiana Davenport, author of the acclaimed Shark Dialogues, draws upon the remarkable stories of her people to create a timeless, passionate tale of love and survival, tragedy and triumph, survival and transcendence. \r\n\r\nIn spellbinding, sensual prose, Song of the Exile follows the fortunes of the Meahuna family--and the odyssey of one resilient man searching for his soul mate after she is torn from his side by the forces of war. \r\n\r\nFrom the turbulent years of World War II through Hawaii's complex journey to statehood, this mesmerizing story presents a cast of richly imagined characters who rise up magnificent and forceful, redeemed by the spiritual power and the awesome beauty of their islands.", "asin": "0345434943", "rank": "765005", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51SY82FGNDL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}