{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 456, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Hard to put down once you start, especially if you are familiar with the island and the way of life."}, {"review_sentiment": 5.0, "review_text": "A beautiful love story! Sylvia and Fire appear made for each other. The author introduces you to many characters but they are all about this love relationship."}, {"review_sentiment": 4.0, "review_text": "The book was very wordy. Some of the content I thought could have been taken out. Other than that a good story line and good background on characters."}, {"review_sentiment": 5.0, "review_text": "I really love this book."}, {"review_sentiment": 5.0, "review_text": "By the last word of this book my heart was in my throat.  I read it straight through for 2 days and couldn’t put it down until I actually passed out sleep.  I took this exciting, inspirational and sometimes frustrating ride with Fire and Sylvia and was so attached to them at the end I became protective of them (from the other characters in the book – crazy, I know).  Theirs was a love so pure and sweet it will make you a little envious.  I’ve never read Colin Channer before and didn’t know what to expect.  After reading this I went back and found everything he had written that I could get my hands on and just began to devour them.  You will enjoy this once you get a handle on his writing style (which is very poetic and descriptive), I just flew through this book and couldn’t wait to find out what would happen next.  I think anyone with a real romantic soul will enjoy this read."}, {"review_sentiment": 5.0, "review_text": "Amazing imagery and a beautiful story about love and choosing your true path through life."}, {"review_sentiment": 4.0, "review_text": "Interesting read."}, {"review_sentiment": 5.0, "review_text": "Wicked! Great author. Fell in love with the characters and I could totally relate. Rare to find books that represent my culture and I was definitely pleased."}, {"review_sentiment": 5.0, "review_text": "Excellent read."}, {"review_sentiment": 4.0, "review_text": "Channer weaves this story so beautifully that you fall in love with the characters. You are immediately drawn in to everyone's struggles and circumstances. He makes us realize that love can't be perfect and is most of the time unexpected. The island flare is the icing on the cake for this novel. I'm not a spoiler so I won't address specifics. Please read, you'll be glad that you did."}]}, "authors": ["Colin Channer"], "isbn": "0345425529", "longitude": 0.0, "periods": ["1900s"], "title": "Waiting in Vain", "word_cloud": "put especially familiar island way life beautiful love story appear make author introduce many character love relationship wordy content think take other good story line good background character really last word heart throat straight day put actually pass sleep take excite inspirational sometimes frustrating ride attach end become protective character crazy know pure sweet little envious never know expect read go back find everything write hand begin enjoy handle write style poetic descriptive fly wait find next think anyone real romantic soul enjoy amazing imagery beautiful story choose true path life interest wicked author character totally represent culture definitely please excellent weave story beautifully love character immediately draw everyone struggle circumstance make time unexpected island flare ice cake spoiler specific glad", "genres": ["Fiction & Literature"], "summary": "Meet Fire--Jamaican-born, charming, poetic, and talented--a man who's vowed to never play \"love-is-blind\" games again. Then he meets Sylvia, a beautiful magazine editor who keeps her passions under lock and key. Together they must choose between the love in their lives and the love of their lives.\r\n\r\nFrom the galleries of Soho to the brownstones of Brooklyn, from the nightclubs of London to the streets of Kingston, Jamaica, Channer takes us on a wild, soul-searching ride as Fire and Sylvia try to connect, disconnect, and reconnect amid conflicting desires and wounds from the past. But through intricate love triangles, skewed priorities, and crushing personal tragedies, Fire, Sylvia, and their friends must learn that some things in life are worth fighting for. If not, you're simply waiting in vain.", "asin": "0345425529", "rank": "1732676", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/5192qPdFXqL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}