{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1328, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "If you've ever been to NYC and walked the streets you need to read this book.  It brings the city to life"}, {"review_sentiment": 5.0, "review_text": "It was a gift and the recipient was very pleased with it."}, {"review_sentiment": 5.0, "review_text": "I read this a while ago, let friends borrow it, and it got so worn that I purchased a second copy.  One of the best books I have read.  The finish was so appropriate.  Loved it and will read it again,"}, {"review_sentiment": 5.0, "review_text": "Great book takes me back to my roots.  This is a book that anyone who was born in the city must read"}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 5.0, "review_text": "Book in good condition"}, {"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 5.0, "review_text": "Loved the book, all the historical info, location info (looked everything up on Google Maps and Streetview)!  The characters were good and loved how they intersected down through the generations!"}, {"review_sentiment": 5.0, "review_text": "Very enjoyable.  Good things to learn about the city."}, {"review_sentiment": 4.0, "review_text": "Great read by a fabulous author"}]}, "authors": ["Edward Rutherfurd"], "isbn": "0345497422", "longitude": 0.0, "periods": ["1600s", "1700s", "1800s", "1900s"], "title": "New York", "word_cloud": "ever walk street need bring city life gift recipient please ago friend get worn purchase second copy best finish appropriate love take back root anyone born city great good condition excellent historical info location info look everything character good love intersected generation very enjoyable good thing learn city fabulous author", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A brilliant mix of battle, romance, family struggles, and personal triumphs, New York gloriously captures the search for freedom and prosperity at the heart of America&#039;s history.\r\n\r\nA blockbuster masterpiece that combines breath-taking scope with narrative immediacy, this grand historical epic traces the history of New York through the lenses of several families: The Van Dycks, a wealthy Dutch trading family; the Masters, scions of an English merchant clan torn apart during the Revolution; the Hudsons, slaves who fight for their freedom over several generations; the Murphys, who escape the Famine in Ireland and land in the chaotic slum of Five Points; the Rewards, robber barons of the Gilded Age; the Florinos, an immigrant Italian clan who work building the great skyscrapers in the 1920s; and the Rabinowitzs, who flee anti-semitism in Europe and build a new life in Brooklyn.\r\n\r\nOver time, the lives of these families become intertwined through the most momentous events in the fabric of America: The founding of the colonies; the Revolution; the growth of New York as a major port and trading centre; the Civil War; the Gilded Age; the explosion of immigration and the corruption of Tammany Hall; the rise of New York as a great world city in the early 20th-century; the trials of World War II, the tumult of the 1960s; the near-demise of the city in the 1970s; its roaring rebirth in the 1990s; culminating in the World Trade Center attacks at the beginning of the new century.\r\n\r\nNew York is the book that Rutherfurd&#039;s fans have been waiting for.", "asin": "0345497422", "rank": "18394", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51Q3DkPa-qL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}