{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 493, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Always wondered about these guys and their beginnings. Their story is remarkable with regard to ancestors, anti-social behavior and just enjoying being nasty no matter what. A strange brotherhood with no boundaries or filters. And yet, they were another sign of the changes taking place in the 60's. Another pissed off group of angry young men."}, {"review_sentiment": 5.0, "review_text": "Always been one of my favorite books. Excellent."}, {"review_sentiment": 4.0, "review_text": "Great writing from an era long gone. Good book to start with if you are interested in Hunter S. Thompson. Very entertaining."}, {"review_sentiment": 5.0, "review_text": "Such a good book."}, {"review_sentiment": 2.0, "review_text": "I LOVE Hunter S. but this book was more of a documentary than his Gonzo experience that I am used to. Not a bad book but not one I really enjoyed."}, {"review_sentiment": 4.0, "review_text": "Good read! Not for the faint of heart!"}, {"review_sentiment": 5.0, "review_text": "Becoming accepted into a very exclusive, dangerous tribe.  He did everything but strap on the Colors."}, {"review_sentiment": 3.0, "review_text": "This was alright, more like 2.5 stars. It was part personal experience (i.e. Gonzo journalism) and part elongated newspaper article. The stories and characters were interesting but at times it also felt like reading an informational booklet on the Hell's Angels. A couple of events were focused on longer than necessary. All in all, this was okay, and there were some fascinating stories."}, {"review_sentiment": 5.0, "review_text": "I'm not sure but was this book toned down when he was describing the angel  pulling teeth I remember it differently. My cousin had this book when it was first published and I read it when I was 12 or so. But when detailing the dentist angel if I remember right he had a necklace of human teeth and had a holster for his pliers around his waist. I was young but its what I never forgot can anyone remember anything like that in the first publishing ."}, {"review_sentiment": 5.0, "review_text": "Brilliant journalism, Thompson had huge courage to embed with this outlaw gang. Powerful use of language. Don't believe the dotards who gave this book anything less than five stars!"}]}, "authors": ["Hunter S. Thompson"], "isbn": "0345410084", "longitude": -122.4192363, "periods": ["1900s"], "title": "Hell's Angels: A Strange and Terrible Saga", "word_cloud": "always wonder guy beginning story remarkable regard ancestor behavior enjoy nasty matter brotherhood boundary filter yet sign change take place piss group angry young men favorite excellent write era long go good start interested entertain such good love documentary experience use not bad really enjoy good not faint heart accept exclusive dangerous tribe everything strap color alright star part personal experience journalism part elongate newspaper article story character interest time also felt read informational booklet angels couple event focus longer necessary fascinate story sure toned describe angel pull teeth remember differently cousin first publish detail dentist angel remember right necklace human teeth holster plier waist young never forget anyone anything first publishing brilliant journalism huge courage embed outlaw gang use language dotard give anything le star", "genres": ["Social & Cultural Studies", "Politics", "Pop Culture"], "summary": "Gonzo journalist and literary roustabout Hunter S. Thompson flies with the angels—Hell’s Angels, that is—in this short work of nonfiction.\r\n \r\n“California, Labor Day weekend . . . early, with ocean fog still in the streets, outlaw motorcyclists wearing chains, shades and greasy Levis roll out from damp garages, all-night diners and cast-off one-night pads in Frisco, Hollywood, Berdoo and East Oakland, heading for the Monterey peninsula, north of Big Sur. . . The Menace is loose again.”\r\n \r\nThus begins Hunter S. Thompson’s vivid account of his experiences with California’s most notorious motorcycle gang, the Hell’s Angels. In the mid-1960s, Thompson spent almost two years living with the controversial Angels, cycling up and down the coast, reveling in the anarchic spirit of their clan, and, as befits their name, raising hell. His book successfully captures a singular moment in American history, when the biker lifestyle was first defined, and when such countercultural movements were electrifying and horrifying America. Thompson, the creator of Gonzo journalism, writes with his usual bravado, energy, and brutal honesty, and with a nuanced and incisive eye; as The New Yorker pointed out, “For all its uninhibited and sardonic humor, Thompson’s book is a thoughtful piece of work.” As illuminating now as when originally published in 1967, Hell’s Angels is a gripping portrait, and the best account we have of the truth behind an American legend.\r\n\r\n\"Thompson has presented us with a close view of a world most of us would never encounter. His language is brilliant, his eye remarkable.\" The New York Times Book Review", "asin": "0345410084", "rank": "8157", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51UTBvSiJaL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}