{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 254, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "I found it a little confusing"}, {"review_sentiment": 4.0, "review_text": "As a fan of the series, I thoroughly enjoyed The Resistance Man.  Like the others, it encouraged me to settle into the life style of St. Denis and the delights of Provence.  The story line was intriguing and one feels strongly enough about Bruno to care about his romance(s) and to appreciate his love of food and wine as well as to occasionally wish I was at the table.  Fun books and I await the next installment."}, {"review_sentiment": 5.0, "review_text": "Entertaining and love France and the Perigord!"}, {"review_sentiment": 5.0, "review_text": "Can't go wrong reading about Bruno!"}, {"review_sentiment": 5.0, "review_text": "I am totally hooked on the Bruno books. The French history sometimes gets to be a bit more than I want, but I am willing to be instructed to get back to the life of Bruno, his village, his women-folk, his wonderful dog (s), his friends, and the mystery. I think I have read all but one or two as of now. I hope Martim Walker continues the saga."}, {"review_sentiment": 5.0, "review_text": "Another wholly satisfying story from Martin Walker. I hope he's busy writing another."}, {"review_sentiment": 5.0, "review_text": "all if Martin Walker's books are full of intrique, research and detail---------I'm a huge fan!"}, {"review_sentiment": 4.0, "review_text": "I absolutely love this series and I love Bruno and his friends.  This book is more of a manhunt than a mystery.  Bruno is worlking with several local police agencies trying to find the man that violently mutilated and killed a gay man behind a bar.  At the same time there has been a series of antiques  burglaries in St. Denis and a former veteran of the Resistance passes away from natural causes.  Among this old fellow's possessions are historical documents that hint at his involvement in an infamous train robbery during WWII that netted the Resistance a pile of money.  The further Bruno digs, the more he realizes that all these events are connected.  I enjoyed the book, but it fell a bit for me this time because there was really no mystery.  As usual, I loved all the historical information about the French Resistance and French nuclear program, and I loved all the food and wine references.  The beautiful Dordogne area is a foodie's mecca, The book does set up nicely at the end for the next one because Bruno finds out some devastating personal news that rocks his world just when the tension of the hunt is at it's highest.  Can't wait for the next one."}, {"review_sentiment": 1.0, "review_text": "I read the earlier volumes in this series a few years ago and liked the series.  Found this one last week in one of those Little Free Libraries in my neighborhood.  What a disappointment!  Walker went formulaic!  Why bother to create characters when you can rely political correctness code to do the job for you?  I groaned when I realized what was happening but read on anyway.,  Waste of time;  the code was given away and turned out to spoil the story.  When one of the characters about halfway through the book went to Catholic mass--code for \"oh so politically incorrect\"- I knew right away that he was the perp.  Flipped to the last pages and confirmed. I literally tore the book to pieces to spare anyone else from having to endure the sham."}, {"review_sentiment": 4.0, "review_text": "This is the first Martin Walker/Bruno book I have read, and I enjoyed it immensely. The plot was clever and challenging without being convoluted and having gratuitous twists and turns that annoy and distract. But the best surprise was the rich detail with which Walker writes of a small town and it's inhabitants in southwestern France. Walker provides an authentic ambiance by painting a detailed picture of the food, the topography, the architecture and the history of the area. His characters are believable, and often more emotionally and intellectually sophisticated than one might expect. His are genuine characters one can relate to and feel sympathetic toward. I certainly plan to read more of Martin Walker's books."}]}, "authors": ["Martin Walker"], "isbn": "0345804805", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "The Resistance Man", "word_cloud": "find little confusing fan series thoroughly enjoy others encourage settle life style delight story line intrigue feel strongly enough care romance appreciate love food wine well occasionally wish table await next installment entertain love go wrong reading totally hook french history sometimes get bit want willing instruct get back life village wonderful dog friends mystery think hope continue wholly satisfy story hope busy write full intrigue research detail huge fan absolutely series love friends manhunt mystery work several local police agency try find violently mutilate kill gay bar time series antique burglary former veteran pass away natural cause old fellow possession historical document hint involvement infamous train robbery net money dig realize event connect enjoy fell bit time really mystery usual love historical information french french nuclear program love food wine reference beautiful area foodie mecca set nicely end next find devastate personal news rock world tension hunt highest wait earlier volume series year ago like series last week free neighborhood disappointment go formulaic bother create character rely political correctness code job groan realize happen time code give turned spoil story character halfway go mass code politically incorrect know right away prep flip last page confirm literally tear piece spare anyone else endure sham first enjoy immensely plot clever challenge convolute gratuitous twist turn annoy distract best surprise rich detail write small town inhabitant southwestern provide authentic ambiance painting detailed picture food topography architecture history area character believable often emotionally intellectually sophisticated genuine character relate sympathetic certainly plan", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "It's summer in St. Denis for chief of police Bruno Courrèges, and that means a new season of cases. This time there are three weighing on his mind. First, there’s the evidence that a veteran of the French Resistance is connected to a notorious train robbery; then, the burglary of a former British spymaster's estate; and, finally, the murder of an antiques dealer whose lover is conveniently on the lam.  \r\n \r\nAs Bruno investigates, it becomes clear that they are connected--however, figuring out how will take every skill he possesses. Add in juggling the complex affections of two powerful women, maneuvering village politics, and managing his irrepressible puppy, Balzac, and Bruno has his hands full once again.  \r\n\r\n“Engaging. . . . This is not the first Bruno mystery, and it certainly should not be the last.” The Washington Times", "asin": "0345804805", "rank": "32709", "city": "", "image": "https://images-na.ssl-images-amazon.com/images/I/51dMr%2BsqbzL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}