{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 1562, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I read this one after reading The Snowman.  Some reviewers seem to feel that this first in the Harry Hole series is a bit less adept, sophisticated, well-plotted, even less well-written as later novels.  To this reader the writing is spot on.  His details of Australia and the Aboriginal culture were no less precise and well laid out, all of his characters are full of life, idiosynchracies and personality, and his plotting kept his usual twisting and turning and weaving to constantly require me to exercise my 'little grey cells' - to borrow from the greatest mystery writer AC & her HP.  Unlike editions of other of his HH novel whichs included very helpful maps, this one would have been greatly enhanced had it included a map of Australia ... but, then I ended up calling upon Google Earth to help out.  Again, a page-turner, and I fear I will be losing sleep along with money as I burn the lights well past midnight while I continue through this series of compelling reads."}, {"review_sentiment": 4.0, "review_text": "Interesting from the start and made me want to continue reading. The lead character is interesting and likable. There were twists and turns, even a little romance. Makes me want to move on to the second book."}, {"review_sentiment": 4.0, "review_text": "The mystery at the heart of this book is how Harry Hole can come back from such self-destructive behavior. I didn’t guess the murderer but I think it was more because we aren’t getting all the necessary information. Maybe that’s the way most mystery stories work. In this case, the characters keep the narrative interesting and carry you through the book."}, {"review_sentiment": 3.0, "review_text": "Uh, too much description, not enough tension."}, {"review_sentiment": 2.0, "review_text": "Nesbø's first and worst.  Poor writing (or maybe translating) and one-dimensional plotting and character development."}, {"review_sentiment": 1.0, "review_text": "I am about to stop reading this book. Author doesn't know Australian geography- no one flies from Sydney to Brisbane to get to Nimbin. Characters becoming dull. I have read and enjoyed other Harry Hole novels-"}, {"review_sentiment": 1.0, "review_text": "Very disappointed in this book. Not worth reading. Later books by Nesbo are far better!  If I had started with this one I would have never tried another one in the series."}, {"review_sentiment": 5.0, "review_text": "This book got me started and now I can't stop reading this man's work.  The characters ring true, the story seems to develop organically with no artifice:  no over the top CSI type of plot development. The police work was slow and plodding with logical developments.  I also love tying in facts about the culture of Aborigines, their place in Australia, the gay population in Sydney. The color of the narrative was mesmerizing.  I'm a big fan now."}, {"review_sentiment": 4.0, "review_text": "I wasn't dying to finish this book. The story was interesting enough, characters kept me involved, but nothing that really brings me back for more. I like to venture to other countries in my reading, so that might be enough to try again,"}, {"review_sentiment": 5.0, "review_text": "Great story...geography and history mixed with a great mystery! Hole is a damaged hero, who has Kline issues of his own."}]}, "authors": ["Jo Nesbo", "Jo Nesbo"], "isbn": "034580709X", "longitude": 151.2164539, "periods": ["2000s", "Recent Releases", "2000s", "Recent Releases"], "title": "The Bat: The First Inspector Harry Hole Novel", "word_cloud": "read reviewer seem series bit le sophisticated even le later novel write detail culture le precise well laid character full life idiosyncrasy personality plot keep usual twist turn weave constantly require exercise grey cell borrow greatest mystery writer edition white include helpful map greatly include map end call fear lose sleep money burn light well midnight continue series compelling read interest start make want continue read lead character interest likable twist turn even little romance want second mystery heart come back behavior guess murderer think get necessary information way mystery story work case character keep narrative interesting carry much description enough tension worst write maybe translate plot character development stop read know australian fly become dull enjoy very disappointed not worth read far better start never series get start read man work character ring true story seem organically artifice top type plot development police work slow plod logical development also love tie fact culture place gay population color narrative mesmerizing big fan die story interesting enough character keep involved nothing really bring venture country read enough story geography history mixed great mystery damage hero issue", "genres": ["Fiction & Literature", "Mystery & Suspense", "Fiction & Literature", "Mystery & Suspense"], "summary": "Before Harry took on the neo-Nazi gangs of Oslo, before he met Rakel, before The Snowman tried to take everything he held dear, he went to Australia.\r\n\r\nHarry Hole is sent to Sydney to investigate the murder of Inger Holter, a young Norwegian girl, who was working in a bar. Initially sidelined as an outsider, Harry becomes central to the Australian police investigation when they start to notice a number of unsolved rape and murder cases around the country. The victims were usually young blondes. Inger had a number of admirers, each with his own share of secrets, but there is no obvious suspect, and the pattern of the other crimes seems impossible to crack. Then a circus performer is brutally murdered followed by yet another young woman.\r\n\r\nHarry is in a race against time to stop highly intelligent killer, who is bent on total destruction.", "asin": "034580709X", "rank": "9183", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51p9bkmk%2BoL.jpg", "country": "Australia", "story_arc": ["Tragedy", "Things only get worse"]}