{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 13482, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Grisham is best"}, {"review_sentiment": 5.0, "review_text": "Holds you all the way thru and keeps you guessing. John Grisham is one of  the best writers around.  Just awsome."}, {"review_sentiment": 5.0, "review_text": "Unbelievable and totally believing in the possibility  of it.Wonderful reading.  Could our beloved government be so hood winked?WOW!"}, {"review_sentiment": 5.0, "review_text": "Second of the Grisham sports novels I've read. Like in \"Bleachers\" before it, there is misconduct by athlete or coach; estrangement between family and/or friends; and forgiveness and possible renewal. Can't help but be glad of the defining moment between the two rival athletes, which I will not spoil for any who haven't read it. Quite a break from the legal thrillers Grisham is known for. And not as long-winded either.  And the mixture of fictional players with real players and managers. What can I say? Way to do that homework, John!"}, {"review_sentiment": 5.0, "review_text": "Very enjoyable book"}, {"review_sentiment": 3.0, "review_text": "Story is Entertaining but no excitement. Some element of mystery which was dashed quickly. This is one I won’t read again."}, {"review_sentiment": 5.0, "review_text": "I really liked this book, could not put it down."}, {"review_sentiment": 4.0, "review_text": "As usual, a good Grisham page turner with enough swerves to keep you entertained but not so extreme as to freak you out."}, {"review_sentiment": 2.0, "review_text": "This book is about as self-righteous as a book can be, and in the end, the author tells us his self-righteousness helps everyone live happily ever after. Codswallop. Calico Joe, the character, is about as hokey as a character can be outside of a Shirley Temple movie. In fact, \"The Good Ship\" Lolly Pop\" might have been a good theme song for Joe when he came up to bat.  He was perfect. Big, strong, good looking, modest, generous etc etc etc, and probably a virgin.  There are Roman Catholic Saints that couldn't hold a candle to him.  Barry Bonds would die of embarrassment, if he ever walked on the same field as Joe. But Joe's Disney World like career comes to a sudden end when the villain of the Book, one second rate NY Mets pitcher named Warren Tracy deliberately beans Joe, cracks his skull and ends his brief but promising career.  I'd call this a spoiler but if Grisham was a boxer and he telegraphed his punches the way he telegraphs his plot, he wouldn't last 90 seconds in the ring.The rest of the book, complete with numerous maudlin flashbacks, is Paul Tracy trying to get his father to atone for the terrible thing he did.  From this we learn that beanballs are bad.  Male athletes are drunken sexual predators (except Willie Mays), and confession is good for the soul.  Ahh but whose soul? Whether Paul Tracy knows it or not, this book is all about him. He wants his father, who is dying, to suffer until the end to make up for all the things he did to young Paul, his sister and their mother. That way Paul can feel good about himself. How does he do this?  By blackmailing his dying father and threatening to write terrible things about him after he dies and sell it to baseball periodicals so his memory will be scarred forever. After the old man caves in to the blackmail the skunk does it anyway.  And this is the hero!Warren Tracy is about as unsympathetic a character that has ever graced a short book with big print. He is impossible to like. With the exception of a cameo appearance by Willie Mays, no male in the novel (save Paul the Avenger himself) is really worthwhile, except Calico Joe's family and they want nothing to do with Paul.Grisham writes short novels that are easily tossed off on lazy beach days. This is not the first novel where self-righteousness dominates the plot. His first novel, \"A Time to Kill,\" and probably his best, deals with the self righteous actions of a father dealing justice for his savaged daughter. That guy was a sympathetic character. And of course the anti-gun novel whose name escapes me praises dishonest behavior in a \"good\" cause. Grisham's poorly thought out opinions are always good causes. But for sheer smugness, this book cannot be topped."}, {"review_sentiment": 5.0, "review_text": "John is always a good read!"}]}, "authors": ["John Grisham"], "isbn": "0345530578", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "The Racketeer: A Novel", "word_cloud": "best way thru keep guess best writer around awesome unbelievable totally believe possibility reading beloved government hood wink second sport novel misconduct athlete coach estrangement family friend forgiveness possible renewal help define moment rival athlete spoil quite break legal thriller know mixture fictional player real player manager say way homework very enjoyable excitement element mystery dash quickly really like usual good page turner enough swerve keep entertained extreme freak end author tell help everyone live happily ever character hokey character movie fact theme song come bat perfect strong good look modest generous probably virgin candle embarrassment ever walk field career come sudden end villain second rate pitcher name deliberately bean crack skull end brief promising career call spoiler boxer telegraph punch way plot last second rest complete numerous maudlin flashback try father atone terrible thing learn bean balls bad athlete drunken sexual predator confession good soul soul know want father die suffer end make thing young sister mother way feel good blackmail die father threaten write terrible thing dy sell baseball periodical memory scar forever old man cave blackmail skunk anyway hero unsympathetic character ever grace short big print impossible exception cameo appearance male save really worthwhile family want nothing write short novel easily toss lazy beach day first dominate plot first probably best deal self righteous action father deal justice savage daughter guy sympathetic character course name escape praise dishonest behavior good cause poorly think opinion always good cause sheer smugness top always good", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "NEW YORK TIMES BESTSELLER\r\n \r\nIn the history of the United States, only four active federal judges have been murdered. Judge Raymond Fawcett has just become number five. His body is found in his remote lakeside cabin. There is no sign of forced entry or struggle. Just two dead bodies: Judge Fawcett and his young secretary. And one large, state-of-the-art, extremely secure safe, opened and emptied.\r\n \r\nOne man, a former attorney, knows who killed Judge Fawcett, and why. But that man, Malcolm Bannister, is currently residing in the Federal Prison Camp near Frostburg, Maryland. Though serving time, Malcolm has an ace up his sleeve. He has information the FBI would love to know. Malcolm would love to tell them. But everything has a price—and the man known as the Racketeer wasn’t born yesterday.\r\n \r\n“Exhilarating . . . surprising . . . ingenious.” Janet Maslin, The New York Times\r\n", "asin": "0345530578", "rank": "18415", "city": "Montego Bay", "image": "https://images-na.ssl-images-amazon.com/images/I/51W6luADZJL.jpg", "country": "Miami", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}