{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 714, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "I found myself drawn in by all the detail of the historic parts of this tale.  It was hard to follow the characters and who was who as time went by but I think I got it.  It was an interesting way to weave around history in the stories of each character.  I enjoyed this book and do recommend it.  It was a slow read for me though..but so much depth to it.  Enjoy."}, {"review_sentiment": 3.0, "review_text": "This product is listed in excellent condition , this had a library retakes siding so yup not great."}, {"review_sentiment": 5.0, "review_text": "I've started reading this historical fiction novel about the city of London over more than 2 thousand years.  It is great.  It reminds me of Michener's novels.  It's over 1,000 pages, my kind of book.  I look forward to reading Edward Rutherfurd's other historical novels."}, {"review_sentiment": 5.0, "review_text": "It was very informative. I learned a lot about English history."}, {"review_sentiment": 5.0, "review_text": "This is a good book to send to a loved one in jail/prison. A nice escape and used up a lot of time."}, {"review_sentiment": 3.0, "review_text": "Worth the time but not as good as Rutherfurd’s New York."}, {"review_sentiment": 5.0, "review_text": "It took me all summer to read but I sure enjoyed “London, the Novel”. I just returned from my first trip to London and used Rutherford’s book as a primer. The book made the trip more enjoyable and trip made the book more enjoyable."}, {"review_sentiment": 4.0, "review_text": "As usual, Edward Rutherford's history of a city is absolutely superb!!  I find his books, and also those of Anthony Grey who writes of Far East countries/cities, so readable and one is reminded of so much of history that one has long forgotten.  Can really recommend his other books such as Paris."}, {"review_sentiment": 5.0, "review_text": "This is my third Rutherfurd novel this summer, and it is just as amazing as The Forest and Sarum.  I once had a history prof who used to say that you can learn more about history from a well written novel than from reading a history book.  For example, never yet read a better explanation of the persecution of the Huguenots than Mr Rutherfurd's.  He is consistently amazing."}, {"review_sentiment": 5.0, "review_text": "Truly enjoyed the timeline from start to finish. Just as good as Rutherford's New York:The Novel, which was amazing!"}]}, "authors": ["Edward Rutherfurd"], "isbn": "0345455681", "longitude": -0.12574, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s", "500-1400s", "0-500s", "Pre Common Era"], "title": "London", "word_cloud": "find drawn detail historic part tale hard follow character time go think get interest way weave history story character enjoy much depth product list excellent condition library retake side yup great start read historical fiction city year great remind novel page kind look forward read historical novel informative learn lot history good send love nice escape use lot time worth time good take summer sure enjoyed return first trip use primer make trip enjoyable trip make enjoyable usual history city absolutely superb find also write readable remind much history long forget really third summer amaze history prof use say learn history well write read history example never yet better explanation persecution consistently amaze truly enjoyed timeline start just good amazing", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "“A TOUR DE FORCE . . . LONDON TRACKS THE HISTORY OF THE ENGLISH CAPITAL FROM THE DAYS OF THE CELTS UNTIL THE PRESENT TIME. . . . BREATHTAKING.”\r\n—The Orlando Sentinel\r\n\r\nNow in a handsome new trade paperback edition, here is Edward Rutherfurd’s classic novel of London, a glorious pageant spanning two thousand years. He brings this vibrant city’s long and noble history alive through the ever-shifting fortunes, fates, and intrigues of half-a-dozen families, from the age of Julius Caesar to the twentieth century. Generation after generation, these families embody the passion, struggle, wealth, and verve of the greatest city in the world.\r\n\r\n“REMARKABLE . . . The invasion by Julius Caesar’s legions in 54 B.C. . . . The rise of chivalry and the Crusades . . . The building of the Globe theatre . . . and the coming of the Industrial Revolution. . . . What a delightful way to get the feel of London and of English history. . . . We witness first-hand the lust of Henry VIII. We overhear Geoffrey Chaucer deciding to write The Canterbury Tales. . . . Each episode is a punchy tale made up of bite-size chunks ending in tiny cliffhangers.”\r\n—The New York Times\r\n", "asin": "0345455681", "rank": "152665", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51EzbaWmbUL.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}