{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 1342, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "great product"}, {"review_sentiment": 5.0, "review_text": "Having hooked up all the iridescent wires from my XC-23 Weird and Crazy in Fiction Test Machine to Do Androids Dream of Electric Sheep?, I’m here to report results showed the needle registering a maximum ten out of ten on each and every page. Quite a feat. Quite a novel. But then again, maybe we shouldn’t be so surprised - after all, this is Philip K. Dick. One of the most bizarre reading experiences anyone could possibly encounter. Rather than attempting to comment on plot or the sequence of events (too wild to synopsize), here are ten ingredients the one and only PKD mixes together in his outlandish science fictional stew:Rick Deckard - the novel’s main character, a bounty hunter on the city police force assigned to track down and destroy human-like androids that have emigrated illegally from Mars. The year 2021, the place San Francisco in the aftermath of nuclear war, deadly dust everywhere, many species wiped out. The government says androids must remain on Mars and continue doing all the dirty work for humans who have migrated to the red planet. Darn! The problem is androids, especially the most recently improved version with their new Nexus-6 brain unit, have been given way too much intelligence.Voigt-Kampff Empathy Test – Fortunately, bounty hunters can administer a test to determine who is human and who is android. The central dilemma with androids – without the very human capacity to feel compassion for others, an android is nothing more than a solitary predator, a cold killer capable of murdering humans left and right to eventually take over. A true stroke of PKD irony since there are a number of instances where androids appear to have deep feelings and empathy for each other and even humans. Meanwhile, the human bounty hunters are expected to eliminate or “retire” androids with no more feelings than if they were disassembling a vacuum cleaner. This philosophical conundrum emerges repeatedly throughout the novel.John Isidore –Since he scored low on his IQ test, labeled a special and chickenhead, Isidore can’t emigrate to Mars. He lives alone in an empty, decaying apartment building on the outskirts of the city and drives a truck for an animal rescue company. When at home Isadore watches hawkers and comedians on his TV when he's not grabbing the handles of his black empathy box that enables him to fuse his feeling with all of life, a major tenet of the new religion of Mercerism, founded by that superior being, Wilbur Mercer. Such belief and behavior leads to yet another area of PKD-style philosophic inquiry. However, by the end of the novel it becomes clear anyone, human or android, should think twice before putting their life in the hands of a chickenhead.Buster Friendly – Leading TV personality and all-around funny guy who makes announcements and pronouncements on what’s real and what’s fake on topics near and dear to the hearts of the remaining survivors. Topics can range from the latest reports on nuclear fallout to his biggest rival, Wibur Mercer.Mood Organ – In this futuristic world, there’s no need for drugs and for good reason: men and women like Rick Deckard and his wife have a “mood organ” where they can simply set the dial for a stimulant or a tranquilizer, a hit of venom to better win an argument or even set the dial for a state of ecstatic sexual bliss. Obviously there’s some upside here. 2021 isn’t that far away. Lets hope inventors are hard at work as you read these words.Rachael Rosen – Beautiful daughter of Eldon Rosen, founder of a major manufacturer of androids. But wait: Is Rachael a real human or could she turn out to be one of those very intelligent Nexus-6 androids? Time for Rick Deckard to take out his equipment and give Rachael the Voigt-Kampff Empathy Test. Either way, Rachael infuses serious energy into the story. One of my favorite lines is when Rick Deckard asks himself after a phone call with Rachael. “What kind of world is it when an android phones up a bounty hunter and offers him assistance?”Happy Dog Pet Shop – One of the largest pet shops in the Bay Area, they currently have an ostrich in their display window, the bird recently arrived from the Cleveland zoo. What a prize! Rick Deckard is hooked – he stops and stares at the ostrich as he walks to work and later places a call to check on their asking price. Whoa! The price is outrageous. Rick knows he would have to eliminate an entire string of androids just for the down payment. But, my goodness – to own one’s very own ostrich.Kipple - As John Isidore states as a matter-of-fact: “Kipple is useless objects, like junk mail or match folders after you use the last match or gum wrappers or yesterday’s homeopape. When nobody’s around, kipple reproduces itself. For instance, if you go to bed leaving any kipple around your apartment, when you wake up the next morning there’s twice as much of it. It always gets more and more.” Sounds as ridiculous as the medieval idea of spontaneous generation. Perhaps we should take into account that John Isidore is, after all, a chickenhead.Luba Luft – On the list of androids, Luba is currently a leading opera singer for the lead company in San Francisco. Come on, Rick Deckard, do you really want to eliminate someone (or something) that is making such a formidable contributing to the arts? PKD has Rick and a fellow bounty hunter discuss this very question as they follow orders from their higher-ups.Real and Electric Animals – Creatures of all stripes and varieties add much color to the story. In addition to the above mentioned ostrich, there’s a horse, a sheep, cat, goat, spider, donkey, crow and toad. Some are real, others electric. A PKD book worth reading to discover the truth down to the last four-legged wiggly."}, {"review_sentiment": 3.0, "review_text": "Detest how the female characters were written. But this book has become a scifi staple, so it is what it is. The film adaptations were improvements to the original source novel. Lots of gumshoe detectiving with a hapless main character you almost don’t root for - yet he is the hero. A hero without a moral compass, who tries to create one for himself, and fails."}, {"review_sentiment": 5.0, "review_text": "I really liked this story better than Blade Runner.  I was expecting it  to  be like the movie but it was not at all.  PKD did not go in for the violence that  Ridoey Scott used in the movie.  At first it was hard to get the movie images out of my mind an see the story as it is written but about half way through i got a new prespective .I have not seen Bladerunner 2049.  I need to now to see if they used the orginal story in it."}, {"review_sentiment": 5.0, "review_text": "I read this book in highschool. Reminded me of A Brave New World and would be a wonderful companion read to that book."}, {"review_sentiment": 4.0, "review_text": "The Movie Bladerunner is based on this book. Very imaginative, takes place in a post apocalyptic future setting. Enjoyed it."}, {"review_sentiment": 5.0, "review_text": "Excellent book"}, {"review_sentiment": 5.0, "review_text": "With so many meaningful thought processes going on in this book, it really gets you thinking harder than usual. Along with that the story itself is phenomenal, with unbridled detail and excellent pacing."}, {"review_sentiment": 4.0, "review_text": "I needed more blade runner after watching the movies and this hit the spot. The movies differ enough from this book that it still feels novel. A little more 1984 and Brave New World -in tone- than the movies."}, {"review_sentiment": 3.0, "review_text": "Kind of a \"fade out\" at the end, like the author didn't know how he wanted to close out the story, so he let it just \"drift away.. \""}]}, "authors": ["Philip K. Dick"], "isbn": "0345404475", "longitude": -122.4192363, "periods": ["2000s"], "title": "Do Androids Dream of Electric Sheep?", "word_cloud": "great product have hook iridescent wire report result show needle register maximum ten ten page quite feat maybe surprise bizarre reading experience anyone possibly attempt comment plot sequence event wild synopsis ten ingredient together outlandish science fictional stew main character bounty hunter city police force assign destroy emigrate illegally year place aftermath nuclear war deadly dust everywhere many specie wipe government say continue dirty work human migrate red planet problem especially recently improve version new brain unit give way much bounty hunter administer test determine human android central dilemma human capacity feel compassion others android nothing solitary predator cold killer capable murdering human leave right eventually take true stroke irony number instance appear deep feeling empathy even human meanwhile human bounty hunter expect eliminate retire feeling disassemble vacuum cleaner philosophical conundrum emerge repeatedly score low test label special chicken head emigrate live alone empty decay apartment building outskirt city drive truck animal rescue company home watch hawker comedian tv grab handle black empathy box enables fuse feel life major tenet new religion found superior such belief behavior lead yet area philosophic inquiry however end becomes clear anyone human android think twice put life hand friendly tv personality funny guy make announcement pronouncement real fake topic dear heart remain survivor range latest report nuclear fallout biggest rival futuristic world need drug good reason men woman wife mood organ simply set dial stimulant tranquilizer hit venom better win argument even set dial state ecstatic sexual bliss upside far away hope inventor hard work daughter founder major manufacturer wait be real human intelligent equipment way infuse serious energy story favorite line ask phone call kind world android phone bounty hunter offer assistance happy largest pet shop currently ostrich display window bird recently arrive hook stop stare ostrich walk work later place call ask price price outrageous know entire string payment goodness state useless object junk mail match folder use last match gum wrapper yesterday homeopath nobody nipple reproduces instance go bed leave nipple apartment wake next morning twice much always get ridiculous medieval idea spontaneous generation perhaps account list currently lead opera singer lead company really want someone something make formidable contribute art fellow bounty hunter discus question follow order strip variety add much color story addition mention ostrich horse sheep cat goat spider donkey crow toad real others worth read discover truth last wiggly female character write become scifi staple film adaptation improvement original source gumshoe detect hapless main character almost root yet hero hero moral compass try create fails really like story better expect movie go violence use movie first hard get movie image mind see story write half way get new perspective see need see used original story high school remind companion base very imaginative take place post apocalyptic future set excellent many meaningful thought process go really get think harder usual story phenomenal unbridled detail excellent pace need blade runner watch movie hit spot movie differ enough still little movie fade end author know want close story let drift", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "A masterpiece ahead of its time, a prescient rendering of a dark future, and the inspiration for the blockbuster film Blade Runner—now in a sharp new edition with an introduction by New York Times bestselling author Jason M. Hough\r\n\r\nBy 2021, the World War has killed millions, driving entire species into extinction and sending mankind off-planet. Those who remain covet any living creature, and for people who can’t afford one, companies built incredibly realistic simulacra: horses, birds, cats, sheep. They’ve even built humans. Immigrants to Mars receive androids so sophisticated they are indistinguishable from true men or women. \r\n\r\nFearful of the havoc these artificial humans can wreak, the government bans them from Earth. Driven into hiding, unauthorized androids live among human beings, undetected. Rick Deckard, an officially sanctioned bounty hunter, is commissioned to find rogue androids and “retire” them. But when cornered, androids fight back—with lethal force.\r\n\r\n“A kind of pulp-fiction Kafka, a prophet.” The New York Times", "asin": "0345404475", "rank": "1827", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/41U97Qj7iML.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}