{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 151, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Good story-would recommend"}, {"review_sentiment": 5.0, "review_text": "When blockbuster was still a thing we found the movie Candy on a bottom shelf. Being a fan of Heath Ledger I had to watch it and I fell in love with the film, I've watched it over and over and even grabbed a copy when blockbuster when out of business.I wanted to read the book to get some more backstory and was amazed at the quality of writing. I literally could not put it down. The story was intense and written so graphically I felt like I was watching it happen right in front of me.This book isn't for the easily offended, or the queasy. Its a true reality of the life that is possible with addiction. I believe everyone should read it. The more we understand others' stories, the kinder we are to others.Beautiful but heartbreaking story."}, {"review_sentiment": 5.0, "review_text": "Very confronting but enthralling story. Apparently in fact essentially autobiographical. The author's recent achievements provide a most unexpected uplifting \"ending\"."}, {"review_sentiment": 5.0, "review_text": "LOved it, a must read"}, {"review_sentiment": 2.0, "review_text": "too graphic for me.."}, {"review_sentiment": 5.0, "review_text": "I can't get enough of this book... the author is painstakingly honest and open about his trials and tribulations as not only a heroin addict,  but a heroin addict in love...  BEWARE> this book is brutal. The author is not shy about telling the horrors of the junkie lifestyle. It is a Rollercoaster ride of emotions and it explores the inner workings of love, lust, passion, pride, life and death. I've read this book about 3 times now and it still effects me the way it did the first time I read it... I recommend this book to anyone who is in the throes of their addiction,  anyone who has a loved one effected by addiction and anyone who is in recovery.. Candy doesn't disappoint! The very first time I read it, I finished it in a 24 hr period. Needless to say, it pulls you in and doesn't let go until the last word is read. Btw.. as most books are,  there are a lot more details in this than the movie.. (I still loved the movie too: )  )"}, {"review_sentiment": 4.0, "review_text": "This was bought for a friend but she loved it!"}, {"review_sentiment": 5.0, "review_text": "I love books about addiction and substance abuse. This is another book/movie, that inspired me to write my memoir series, \"Sweet Melissa\""}, {"review_sentiment": 5.0, "review_text": "This book follows the movie pretty well. I could read this novel over and over again. I love the hope that the main character has despite addiction and constant failures in his life. He always clings to the hope of happiness yet finds it only in drugs."}, {"review_sentiment": 4.0, "review_text": "Easy read!"}]}, "authors": ["Luke Davies"], "isbn": "0345423879", "longitude": 151.2164539, "periods": ["1900s"], "title": "Candy: A Novel of Love and Addiction", "word_cloud": "good recommend blockbuster still thing find movie bottom shelf fan watch fell film watch even grab copy blockbuster want get backstory amaze quality write literally story intense write graphically felt watch right front easily offend queasy true reality life possible believe everyone understand others story kinder heartbreaking story very confront enthral story fact essentially autobiographical author recent achievement provide unexpected uplifting end love graphic enough author painstakingly honest open trial tribulation heroin addict heroin addict brutal author shy tell horror junkie lifestyle emotion explore inner working lust passion life death time still effect way first time recommend anyone throe anyone love effect anyone disappoint first time finish hr period say pull last word lot detail still love movie buy friend love substance abuse inspired write memoir series follow movie pretty well hope main character constant failures life always cling hope happiness yet find drug easy", "genres": ["Fiction & Literature"], "summary": "\"Candy is beside me, drenched in sweat. She's breathing gently, long slow breaths. I imagine her soul going in and out: wanting to leave, wanting to come back, wanting to leave, wanting to come back. The day will soon harden into what we need to do. But for now we have each other. . . .\"\r\n\r\nHe met Candy amid a lush Sydney summer. Gorgeous, sexy, free-spirited Candy. They fell in love fast, lots of laughter and lust, the days melting warmly into each other. He never planned to give her a habit. But she wanted a taste. And wasn't love, after all, about sharing lives? Candy had a bit of money and in the beginning, everything was beautiful. Heady, heroin-hazed days, the world open and inviting. But when the money ran out, the craving remained, and the days ceased their luxurious stretch.\r\n\r\nBut there was still love. Only now, it was a threesome. Heroin had its own demands, its own timetable, and thoughts of nabbing the next fix hurled them into each day. Then, when desperation sets in, Candy will stop at nothing to secure a blast, as she and her lover become hostage to the nightmarish world of addiction. \r\n\r\nPainful, sexy, tender, and charged with dark humor, Candy provocatively charts the daily rituals of two lovers maintaining a long-term junk habit. Told in stunningly vivid prose and set against the backdrop of suburban and urban Australia, Candy is both an electrifying and frightening glimpse of contemporary life and love.", "asin": "0345423879", "rank": "475182", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51x4SapG83L.jpg", "country": "Australia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}