{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 12, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent.  Highly recommended."}, {"review_sentiment": 1.0, "review_text": "TW: rape, incest, violence, racism, abuseI don't usually leave reviews of books on Amazon, but I want to warn anyone reading this book that the content involves a white, incestuous father who sexually preys upon his daughter and regularly abuses and rapes the black woman he enslaves after colonizing the island. Between the main character and the police office who is heavily involved in the plot, this book is rife with racist remarks and language.To be clear, this book was written by a black woman and much of the racism, etc. is a plot device deployed for highly specific literary and social commentary purposes, but for me the writing and content was far too triggering to deal with, not to mention it takes a compassionate and skilled professor/teacher to handle this class discussions that this book will cause. Unfortunately, my professor was incapable of doing that, which resulted in a slew of inappropriate and deeply traumatizing commentary made by the class."}, {"review_sentiment": 4.0, "review_text": "I live in Trinidad as an expat and love the history of this book.  I wish I was more into shakespeare so I could comment on that part."}, {"review_sentiment": 5.0, "review_text": "A must read novel....Evil and racism at the highest....This writer is the best...Hey, she was my teacher..."}, {"review_sentiment": 3.0, "review_text": "The story opens in 1961 with a British inspector, at the behest of the commissioner, preparing to discretely investigate a crime. The setting is Trinidad, a country on the cusp of independence from England. This is not such a long time ago; yet, Nunez' modern-day interpretation of The Tempest invokes the mood of the entrenched class-defined society of Shakespeare's time. This quality of timeliness supports the theme of a despot's controlling his victims by dependence and isolation. Nunez writes superbly about Trinidad's colonial history and vividly describes it's geographical details. And, she cleverly parallels her characters to those in The Tempest. However, even with all that, this is not her best work. The strong start begins to flag with overdone descriptions of flora and fauna and insufficient character development. Except for Inspector Mumsford, there are no surprises, no complexities in the characters. The central character, Peter Gardner, a morally corrupt, most twisted scientist never provokes sympathy. The supporting cast of his daughter Virginia, the disenfranchised Carlos and Ariana, the servant-concubine serve as little more than vehicles for Gardner's greed and depravity. Unlike when I read When Rocks Dance, I wanted the Gardner to get his comeuppance, the lovers to live happily ever after and to close the book."}, {"review_sentiment": 3.0, "review_text": "Billed as a modern telling of The Tempest, Nunez hasn't even come close.This book will give you nightmares and/or ruin your plans to cruise the West Indies, or the appreciation of the Hibiscus blooming so lustily on your deck.  Dr. Peter Gardener (get it?), madman to the max.  Reading, I could picture Ms. Nunez saying, What more horrible abomination can we dream up for Dr. Gardener to perform?I didn't get anything of redeeming value from this book.  It's not about love, however nobly one tries to conjure it from this book.  Prospero's Daughter is a vision of hell on earth.  A three because hell was quite well described."}, {"review_sentiment": 4.0, "review_text": "My bookclub read this book and were fortunate enough to have the author's brother join us for our discussion.  This gave us the opportunity to aks many questions about the island, customs, traditions, language.  It was an excellent book with an accurate description of both the locale and the time during their strive for independence."}, {"review_sentiment": 3.0, "review_text": "This is a book with a message:  the history of racism in the West Indies is insupportable.  Many wrongs were committed, and sometimes the human spirit prevailed over the corrosion of racism.  An important theme, but the characters are such extremes of evil and innocence that the book ends up feeling more like a civics lesson and less like literature.  I felt like I was supposed to like it because of the important lesson, but I preferred the setting, the nostalgia, and the triumph of young love over old racism."}, {"review_sentiment": 5.0, "review_text": "First off, I have to say I am biased because, to-date, I have loved every single book written by Elizabeth Nunez. Needless to say, this book was no exception. Ms. Nunez's well-written, well-crafted take on Shakesphere's Caliban is incredible. Told from the perspective of the \"native\" this book explores the complexion dynamics of race, class and gender."}, {"review_sentiment": 3.0, "review_text": "I opened Elizabeth Nunez book, \"Prospero's Daughter,\" expecting an adaptation of Shakespeare's Tempest. The story happens in the West Indies on an island that houses a leper colony.  The British Empire is disintegrating, rotted by past practice of slavery and present day racism. Descriptions of the leper colony, tropical heat, and poisonous insects, foretell trouble.Nunez drew some plot elements from the Tempest. Although Shakespeare's play unwinds in the Mediterranean, readers may see hints of the West Indies, suggested by Strachey's 1610 report of the shipwreck of the Sea Venture near Bermuda. Shakespeare's island is a brave new world, full of enchantment. The lead role, Prospero, was duke of Milan. Betrayed by his brother, Prospero is banished to an island with his daughter, Miranda. They find the uncultured Caliban (whose name suggests \"cannibal\" or the \"Carib\" Indian tribe), son of a witch, and Ariel, a sprite that was imprisoned in a tree by the witch. Ariel becomes Prospero's ethereal servant when he frees her. Caliban teaches Prospero how to survive on the island. In repayment Prospero educates Caliban. When Caliban makes sexual advances toward Miranda, Prospero punishes him. The play's theme is redemption: Prospero reconciles with his brother and Miranda marries his brother's son.Nunez' counterpart to Prospero is Peter Gardner, a mad genius who arrives on the island with his sweet daughter Virginia, fleeing prosecution for conducting medical experiments on people. A good-hearted native, Carlos Codrington (Caliban) is heir to an island estate. Ariana, a servant, lives on the estate with Carlos and his family. At first offering to help, Peter moves into the house and then takes over. Peter educates Carlos. Revealed as a bully, Peter remodels the estate after his own european taste. His rapacious sexual cravings are aimed at the submissive Ariana. Carlos and Virginia fall innocently in love. Enraged by the interracial affair, Peter falsely accuses Carlos of rape, tortures him, and calls in the colonial police. Although the police suspect Carlos and act to protect Virginia's reputation, the truth comes out and the lovers are united. The villainy, frustrated lovers, and happy ending impart a touch of melodrama.Nunez combines the West Indies first-name \"Carlos\" with a British last-name, \"Codrington.\" The town Codrington was established in 1666 in the country of Antigua and Barbuda and is the location of a slave rebellion that took place in 1741. \"Prospero's Daughter\" is less an adaptation of Shakespeare, and more a vigorous criticism of racism in the West Indies. Nunez lived in the West Indies and I see her book as a tale of social justice. Carlos is the central character who embodies the growth of West Indies independence as British influence wanes."}]}, "authors": ["Elizabeth Nunez"], "isbn": "0345455363", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Prospero's Daughter: A Novel", "word_cloud": "excellent recommend rape incest violence racism abuse i usually leave review want warn anyone reading content involve white incestuous father sexually prey daughter regularly abuse rape black woman enslave colonize island main character police office heavily involve plot rife racist remark clear write black woman much racism plot device deploy highly specific literary social commentary purpose write content far trigger deal mention take compassionate skilled handle class discussion cause unfortunately professor incapable result slew inappropriate deeply traumatize commentary make class live love history wish shakespeare part highest writer best teacher story open british inspector behest commissioner prepare discretely investigate crime set country cusp independence long time ago yet interpretation invokes mood entrench society time quality timeliness support theme despot control victim dependence isolation write superbly colonial history vividly describe geographical detail cleverly parallel character however even best work strong start begin flag overdone description flora fauna insufficient character development surprise complexity character central character morally corrupt twisted scientist never provoke sympathy support cast daughter disenfranchise serve little vehicle greed depravity want comeuppance lover live happily ever close bill modern tell even come give nightmare ruin plan cruise appreciation bloom lustily madman max say horrible abomination dream perform get anything redeem value love however nobly try conjure vision hell earth hell quite well book club fortunate enough author brother join discussion give opportunity ask many question island custom tradition language excellent accurate description locale time strive independence message history racism insupportable many wrong commit sometimes human spirit prevail corrosion racism important theme character extremes evil innocence end feel civics lesson le literature felt suppose important lesson prefer set nostalgia triumph young love old racism first say bias love single write say exception take incredible perspective native explores complexion dynamic race class gender open expect adaptation story happen island house leper colony british disintegrating rot past practice slavery present day racism leper colony tropical heat poisonous insect foretell draw plot element tempest unwinds reader hint suggest report shipwreck island brave new world full enchantment lead role duke brother banish island daughter find uncultured name suggest cannibal son witch sprite imprison tree witch become ethereal servant free teach survive island repayment educate make sexual advance punish play theme redemption reconcile brother marries brother counterpart mad genius arrives island sweet daughter flee prosecution conduct medical experiment people native island estate servant live estate family first offering help move house take educate bully remodels estate european taste rapacious sexual craving aim submissive fall innocently love interracial affair falsely accuse rape torture call colonial police police suspect act protect reputation truth come lover unite villainy frustrate lover happy end impart touch combine town establish country location slave rebellion take place le adaptation vigorous criticism racism indies live see tale social justice central character embodies growth indies independence british influence wane", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A spellbinding new novel from acclaimed author Elizabeth Nunez, Prospero’s Daughter is a brilliantly conceived retelling of Shakespeare’s The Tempest set on a lush Caribbean island during the height of tensions between the native population and British colonists. Addressing questions of race, class, and power, it is first and foremost the story of a boy and a girl who come of age and violate the ultimate taboo.\r\n\r\nCut off from the main island of Trinidad by a glistening green sea, Chacachacare has few inhabitants besides its colony of lepers and a British doctor who fled England with his three-year-old daughter, Virginia. An amoral genius, Peter Gardner had used his talents to unsavory ends, experimenting, often with fatal results, on unsuspecting patients. Blackmailed by his own brother, Peter ends up on the small island as England’s empire is starting to crumble.\r\n\r\nOn Chacachacare, Peter experiments chiefly on the wild Caribbean flora–and on the dark-skinned orphan Carlos, whose home he steals. Though Peter considers the boy no better than a savage, he nonetheless schools the child alongside his daughter. But as Carlos and Virginia grow up under the same roof, they become deeply and covertly attached to one another.\r\n\r\nWhen Peter discovers the pair’s secret and accuses Carlos of a heinous crime, it is up to a brusque, insensitive English inspector to discover the truth. During his investigation, a disturbing picture begins to emerge as a monstrous secret is finally drawn into the light.", "asin": "0345455363", "rank": "1188057", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/51SX%2BVX1sJL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}