{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 58, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "Big fan of Dunne's work and this novel doesn't disappoint."}, {"review_sentiment": 5.0, "review_text": "My only complaint was the length.  Last third could have been tightened. Actually after the Ball it seemed too contrived. But I love reading DD."}, {"review_sentiment": 5.0, "review_text": "Like every Dunn novel, the prose is superb- the characters are well developed, and very human, and amusing.  What more is there to say?  It's a worthy read!"}, {"review_sentiment": 4.0, "review_text": "A lot of characters but very good..."}, {"review_sentiment": 5.0, "review_text": "Wonderful, as all his Books are ."}, {"review_sentiment": 5.0, "review_text": "As all of his books-great!"}, {"review_sentiment": 5.0, "review_text": "Love Dominick Dunn.......great book........enjoyable reading!"}, {"review_sentiment": 5.0, "review_text": "Love Dominick Dunnes stories of people I will never know.  After reading his books I realize I am okay without those kind of people / pressures in my life.  They live by a different code & their world seems very constricting to me."}, {"review_sentiment": 2.0, "review_text": "It's just OK I love the author just not this book"}, {"review_sentiment": 3.0, "review_text": "If you like to read about ridiculous and wealthy WASPs, go for it. Surprised to care about anyone, but found I did. Also found I really wanted to shake a few characters until their heads fell off."}]}, "authors": ["Dominick Dunne"], "isbn": "0345521048", "longitude": 0.0, "periods": ["1900s"], "title": "People Like Us", "word_cloud": "big fan work disappoint complaint length last third seem contrived love read prose character well developed human amuse say worthy lot character good wonderful reading stories never know read realize okay kind pressure life live different code world seem constrict ok love author ridiculous wealthy go surprised care anyone find also find really want shake character head fell", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Before they had Too Much Money, the inhabitants of Dominick Dunne’s glitzy, gossipy New York Times bestselling novels were People Like Us.\r\n\r\nThe way journalist Gus Bailey tells it, old money is always preferred, but occasionally new money sneaks in–even where it is most unwelcome. After moving from Cincinnati, Elias and Ruby Renthal strike it even richer in New York, turning their millions into billions. It would be impolite for high society to refuse them now. Not to mention disadvantageous. As long as the market is strong, there’s absolutely nothing to worry about–except for those nasty secrets from the past. Scandal, anyone?\r\n\r\n“Dead-on-target.” New York Times", "asin": "0345521048", "rank": "215869", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51Acsfi0zmL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}