{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 178, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Good story, well written.  History accurate."}, {"review_sentiment": 4.0, "review_text": "Wonderful insight, good characters and interesting history mixed together in a solid, quiet tale that is well told.  A very good read."}, {"review_sentiment": 5.0, "review_text": "An interesting book...a good read."}, {"review_sentiment": 3.0, "review_text": "My book club liked it but I thought it was only so-so."}, {"review_sentiment": 4.0, "review_text": "Really interesting writer, Mary Doria Russell, first came across her with the Sparrow which I loved, then a sequel and then years late a quasi fictionalised biography of Doc Holliday and now this very engaging perspective of Laurence of Arabia and all the colonial interactions that have gone to create the weird tapestry of countries making up the Middle East today.A great heroine and well written story, worth reading"}, {"review_sentiment": 4.0, "review_text": "Enjoyable & educational historical fiction on the 1921 Cairo Conference. One of those books that spurred me to go look up all sorts of other related tidbits..."}, {"review_sentiment": 4.0, "review_text": "Much less expensive than local stores."}, {"review_sentiment": 5.0, "review_text": "Great insight into a time that unfortunately shaped the tragedy we have in the  Middle East and a great view into the lives of many middle class American woman at that time-want to read more"}, {"review_sentiment": 5.0, "review_text": "Fascinating story of a real woman who changed history woven into a novel.  An Oxford educated archeologist who decided the boundaries of current day Iran and Jordan.  The only woman who was part of the Cairo Conference to divide the middle east after WW1.I couldn't put it down.  High time women received acknowledgement for their major contributions to (his)story!"}, {"review_sentiment": 5.0, "review_text": "I felt like I was walking in Agnes' shoes.  Love Ms. Russell's style.  Religious sceptics  are more interesting than blind believers and I have posed many of these same questions to myself on occasion."}]}, "authors": ["Mary Doria Russell"], "isbn": "0345485556", "longitude": 31.243666, "periods": ["1900s", "Recent Releases"], "title": "Dreamers of the Day", "word_cloud": "good story well write accurate wonderful insight good character interest history mixed together solid quiet tale well tell good interesting good club like think really interesting writer first come love sequel year late quasi fictionalize biography engage perspective colonial interaction go create weird tapestry country make great heroine well write story read enjoyable educational historical fiction spur look sort relate tidbit much le expensive local store insight time unfortunately shape tragedy great view live many middle class woman fascinate story real woman change history woven educate archaeologist decide boundary current woman part divide east time woman receive acknowledgment major contribution story felt walk shoe style skeptic interest believer pose many question occasion", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "“I suppose I ought to warn you at the outset that my present circumstances are puzzling, even to me. Nevertheless, I am sure of this much: My little story has become your history. You won’t really understand your times until you understand mine.”\r\n\r\nSo begins the account of Agnes Shanklin, the charmingly diffident narrator of Mary Doria Russell’s compelling new novel, Dreamers of the Day. And what is Miss Shanklin’s “little story?” Nothing less than the creation of the modern Middle East at the 1921 Cairo Peace Conference, where Winston Churchill, T. E. Lawrence, and Lady Gertrude Bell met to decide the fate of the Arab world–and of our own.\r\n\r\nA forty-year-old schoolteacher from Ohio still reeling from the tragedies of the Great War and the influenza epidemic, Agnes has come into a modest inheritance that allows her to take the trip of a lifetime to Egypt and the Holy Land. Arriving at the Semiramis Hotel just as the Peace Conference convenes, Agnes, with her plainspoken American opinions–and a small, noisy dachshund named Rosie–enters into the company of the historic luminaries who will, in the space of a few days at a hotel in Cairo, invent the nations of Iraq, Syria, Lebanon, Israel, and Jordan. \r\n\r\nNeither a pawn nor a participant at the conference, Agnes is ostensibly insignificant, and that makes her a welcome sounding board for Churchill, Lawrence, and Bell. It also makes her unexpectedly attractive to the charismatic German spy Karl Weilbacher. As Agnes observes the tumultuous inner workings of nation-building, she is drawn more and more deeply into geopolitical intrigue and toward a personal awakening. \r\n\r\nWith prose as graceful and effortless as a seductive float down the Nile, Mary Doria Russell illuminates the long, rich history of the Middle East with a story that brilliantly elucidates today’s headlines. As enlightening as it is entertaining, Dreamers of the Day is a memorable, passionate, gorgeously written novel.\r\n", "asin": "0345485556", "rank": "57572", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51LCV80foTL.jpg", "country": "Egypt", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}