{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 603, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "The sections involving Ruth, Wendy, and Art can almost be set aside (until the last). The value lies in the windows into Chinese culture, 20th century history, and language that constitute the bulk of the story. That's why one reads Tan."}, {"review_sentiment": 5.0, "review_text": "It gets better the farther along you go. Such a heartbreaking and poignant book. I cannot get enough of Amy Tan!"}, {"review_sentiment": 5.0, "review_text": "A great insight into early 20th century life in China and beautiful moving prose about how it's never too late to forget, forgive, and love as you were meant to."}, {"review_sentiment": 5.0, "review_text": "One of my all time favorite books. My mom passed it to me and I've since passed it on to numerous people. Everyone has loved it!"}, {"review_sentiment": 4.0, "review_text": "Nice and easy read.  I've read several of Amy Tan's books and I like her style of writing - it's not complicated, yet able to submerse you in the characters' lives, makes you think and analyze relationships in your own life.  This one was a really pleasant read about mother daughter relationship, family dynamics and just relationships."}, {"review_sentiment": 4.0, "review_text": "Beside being an enjoyable book, her vivid descriptions of. The past and current cultures of the Chinese is enlightening. Highly recommend it."}, {"review_sentiment": 5.0, "review_text": "I am never disappointed by Amy Tan's writing. Rich in history, brimming with character development as well as a truly gripping plot, she never fails to grab your hand and take you to a place within the Chinese culture you will not soon forget. She crafts her novels so well, I paint pictures in my mind of all the characters and geographical locations as I read. Tan provides a reading experience complete with illustrations of my own making; her words the medium, my imagination, the brush. I read \"The Joy Luck Club\" many years ago. I was so pleased to find so many of her other books available to download to my Kindle. Every page and every word surpassed this reader's expectations."}, {"review_sentiment": 5.0, "review_text": "Good mystery and insights."}, {"review_sentiment": 4.0, "review_text": "Interesting and well told story."}, {"review_sentiment": 5.0, "review_text": "Love her work."}]}, "authors": ["Amy Tan"], "isbn": "0345457374", "longitude": -122.4192363, "periods": ["1900s"], "title": "The Bonesetter's Daughter: A Novel", "word_cloud": "section involve almost set aside last value lie windows chinese culture century history language constitute bulk story read get better farther along such heartbreaking poignant get enough great insight early century life beautiful move prose never late forget forgive love meant time favorite mom pass pass numerous people love easy several like style writing complicate yet able submerse character live make think analyze relationship life really pleasant mother daughter relationship family dynamic relationship enjoyable vivid description past current culture chinese enlighten recommend never disappoint write history brim character development well truly grip plot never fail grab hand place chinese culture soon craft novel well paint picture mind character geographical location tan provide reading experience complete illustration make word medium imagination brush many year ago please find many available download page word surpass expectation good mystery insight interest well told story work", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In memories that rise like wisps of ghosts, LuLing Young searches for the name of her mother, the daughter of the Famous Bonesetter from the Mouth of the Mountain. Trying to hold on to the evaporating past, she begins to write all that she can remember of her life as a girl in China. Meanwhile, her daughter Ruth, a ghostwriter for authors of self-help books, is losing the ability to speak up for herself in front of the man she lives with and his two teenage daughters. None of her professional sound bites and pat homilies works for her personal life; she knows only how to translate what others want to say.\r\n\r\nRuth starts suspecting that something is terribly wrong with her mother. As a child, Ruth had been constantly subjected to her mother's disturbing notions about curses and ghosts, and to her repeated threats to kill herself, and was even forced by her mother to try to communicate with ghosts. But now LuLing seems less argumentative, even happy, far from her usual disagreeable and dissatisfied self.\r\n\r\nWhile tending to her ailing mother, Ruth discovers the pages LuLing wrote in Chinese, the story of her tumultuous and star-crossed life, and is transported to a backwoods village known as Immortal Heart. There she learns of secrets passed along by a mute nursemaid, Precious Auntie; of a cave where dragon bones are mined, some of which may prove to be the teeth of Peking Man; of the crumbling ravine known as the End of the World, where Precious Auntie's scattered bones lie, and of the curse that LuLing believes she released through betrayal.\r\n\r\nLike layers of sediment being removed, each page reveals secrets of a larger mystery: What became of Peking Man? What was the name of the Bonesetter's Daughter? And who was Precious Auntie, whose suicide changed the path of LuLing's life? Within LuLing's calligraphed pages awaits the truth about a mother's heart, what she cannot tell her daughter yet hopes she will never forget.\r\n\r\nSet in contemporary San Francisco and in a Chinese village where Peking Man is being unearthed, The Bonesetter's Daughter is an excavation of the human spirit: the past, its deepest wounds, its most profound hopes. The story conjures the pain of broken dreams, the power of myths, and the strength of love that enables us to recover in memory what we have lost in grief. Over the course of one fog-shrouded year, between one season of falling stars and the next, mother and daughter find what they share in their bones through heredity, history, and inexpressible qualities of love.", "asin": "0345457374", "rank": "63031", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/511IrlTKIsL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}