{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 75, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "Maybe I should have given this book another star, but it was so raw, so harsh. Well, that's what many slaves, maybe most, endured. How can mere men and women treat others in such a cruel manner; and in the name of God. And sadly, it has gotten only slightly better, some would say, no better."}, {"review_sentiment": 5.0, "review_text": "This book reveals the harsh reality of \"masters\" and slaves.  The fact that one person can own another , control their life, decide their fate is abhorrent  to me. Even today the fact that the color of one's skin decides the importance of one's life  over another  is stupidity we are one people  we are responsible for each other."}, {"review_sentiment": 2.0, "review_text": "I got bored with it.  Blah....."}, {"review_sentiment": 5.0, "review_text": "I enjoyed this book very much.  It gives the history of slavery in South Africa from various personal viewpoints, mainly the slaves.  It has violence, but it also has beauty and simple goodness, courage and understanding.  Descriptive narratives immersed me in this simple, poetic story of an era and area I knew very little about. I enjoyed it!"}, {"review_sentiment": 4.0, "review_text": "I am not surprised by the variety of reviews for this book. Philida is a worthwhile read, but not a pleasant one. It was sometimes hard to follow--told in first person from different perspectives and then in third person and with frequent use of Afrikaans words that are unfamiliar to American readers. The brutality of slavery and Philida’s lack of control of her difficult situation are powerfully portrayed, which is hard to read but important. In a way, the book is uplifting--Philida is an interesting character, who grows into a determined, confident woman in spite of her treatment. Other characters are well developed also. I felt the book ended abruptly and that the parts after she left the farm were less complex than the earlier sections, but overall I liked the book."}, {"review_sentiment": 3.0, "review_text": "This is a really hard book to get interested in and then stay interested.  It took twice as long as normal for me to read it.  The beginning chapters were definitely very adult in context and shouldn't be read by kids.  It also ended very abruptly and I didn't see a follow-up book.  I don't think I would read one if available anyway.  On to my next book."}, {"review_sentiment": 5.0, "review_text": "How did I miss this for so long? I was caught in it's web from the first page until the last. Now I wish for more of Philida's story. What an amazing character. Very well written novel about one of the earliest troubled times in the \"beyond description\" history of South Africa.  In 1837 the slaves were freed but had to stay indentured for 4 more years. They were allowed to wear shoes for the first time! The years before, told by Philida and those in her life is a story worth reading to help us learn or remind us to accept people of any color or culture as equal. Why do we never learn?"}, {"review_sentiment": 5.0, "review_text": "It was great and I really appreciate it."}, {"review_sentiment": 3.0, "review_text": "Interesting account of a slave's life in South Africa, just before the slaves were given their freedom in 1834.It was worth reading, just to get a sense of the place in that time, as I expect it was relatively true to life."}, {"review_sentiment": 3.0, "review_text": "I love & admire this author's nonfiction. But I just could not engage this book- the dialect rang false to me.  It's a good story, though, just not for me."}]}, "authors": ["Andre Brink"], "isbn": "0345805038", "longitude": 18.417396, "periods": ["1800s", "Recent Releases"], "title": "Philida", "word_cloud": "maybe give star raw harsh many slave maybe endure mere men woman treat others cruel manner name sadly get slightly better better reveal harsh reality master slave fact person control life fate abhorrent even today fact color skin decide importance life stupidity people responsible get bore enjoy much give history slavery various personal viewpoint mainly slave violence also beauty simple goodness courage understand narrative immerse simple poetic story era area know little enjoy surprise variety review worthwhile pleasant sometimes hard follow tell first person different perspective third person frequent use word unfamiliar american reader brutality slavery lack control difficult situation powerfully portray hard important way uplifting interesting character grows determine confident woman spite treatment other character well also felt end abruptly part leave farm le complex earlier section overall like really hard get interested stay interested take twice long normal beginning chapter definitely adult context kid also end abruptly see think available anyway next miss long catch web first page last now wish story amazing character very well write earliest trouble time description history slave free stay indentured year allow wear shoe first time year tell life story read help learn accept people color culture equal never learn great really interest account slave life slave give freedom worth read sense place time expect relatively true life love admire author nonfiction dialect rang false good story", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "\"This is what it is to be a slave: that everything is decided for you from out there. You just got to listen and do as they tell you. You don’t say no. You don’t ask questions. You just do what they tell you. But far at the back of your head you think: Soon there must come a day when I can say for myself: This and that I shall do, this and that I shall not.\"\r\n\r\nIn Philida, longlisted for the Man Booker Prize, André Brink—“one of South Africa's greatest novelists” (The Telegraph)—gives us his most powerful novel yet; the truly unforgettable story of a female slave, and her fierce determination to survive and to be free.\r\n\r\nIt is 1832 in South Africa, the year before slavery is abolished and the slaves are emancipated. Philida is the mother of four children by Francois Brink, the son of her master. When Francois’s father orders him to marry a woman from a prominent Cape Town family, Francois reneges on his promise to give Philida her freedom, threatening instead to sell her to new owners in the harsh country up north.\r\n\r\nHere is the remarkable story—based on individuals connected to the author’s family—of a fiercely independent woman who will settle for nothing and for no one. Unwilling to accept the future that lies ahead of her, Philida continues to test the limits and lodges a complaint against the Brink family. Then she sets off on a journey—from the southernmost reaches of the Cape, across a great wilderness, to the far north of the country—in order to reclaim her soul.\r\n\r\n\"A soaring, kaleidoscopic account of a slave woman's struggle to protect her humanity. The voice of Philida is wonderfully nuanced and complex—capable of rendering up both the brutality of her experience, and the poetry she manages to wrest from it. A masterful and deeply humane work of art.\" Jennifer Egan, author of <i>A Visit from the Goon Squad</i>", "asin": "B00FI6QDZW", "rank": 0, "city": "Cape Town", "image": "", "country": "RSA", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}