{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 165, "rating": 4.5, "reviews": [{"review_sentiment": 2.0, "review_text": "I️ thoroughly enjoyed the Temeraire series, right up until this book. Like the others, it was well-written with a brand new setting and a brand new plot. However, the plot while starting out good, wobbled in the middle, and collapsed entirely in the end. Maybe someone else could appreciate the wishful deviation from history and what will assuredly be a miraculous recovery from the ending in the next book, but not me. I’m done with the Temeraire series, which saddens me because it was, up until this book, a very pleasant, historically brilliant series to read."}, {"review_sentiment": 5.0, "review_text": "I have enjoyed the Temeraire books from the first words I read. Ms. Novik's imagination, and ability to translate it to written words takes the reader not just back in time, but into an altered history that I find myself so fully caught up into that I wish I was going out to ride a dragon instead of driving my car. Every friend I recommend read these books are also hooked. If you like history and/or fantasy you have to give them a try."}, {"review_sentiment": 5.0, "review_text": "Awesome 😁"}, {"review_sentiment": 5.0, "review_text": "I am enjoying the entire series so far. The mix of a little historical content and color with the dragons is fun."}, {"review_sentiment": 5.0, "review_text": "We love the whole series about Laurence and Temeraire."}, {"review_sentiment": 5.0, "review_text": "It seems like the author is getting tired. She still writes well but it's not quite as interesting, as before."}, {"review_sentiment": 5.0, "review_text": "Couldn't put it down"}, {"review_sentiment": 5.0, "review_text": "Laurence and Temeraire search for a cure to the illness ravaging England's dragons. Unlike the previous installment, this book has a solid throughline. The plot makes for extraordinarily satisfying hurt/comfort--revolving around Laurence and Temeraire, but, unusually, also around other dragons and their captains; it's a welcome broadening of emotional investment, and works beautifully. This book also marks the series's first major departure from history (dragons aside, of course), and it's a telling change that directly addresses the racial issues that permeate the narrative. I was initially skeptical of the tendency to elide historical slavery and the fictional social role of dragons, but the way this development works, combined with increasingly diverse representation, specifically of Africans, goes a long way to resolving that. This series is super tropey, in its tone and relationships, which is what makes it so compulsively readable. But the underlying historical setting, with all its injustice and complication, tempers and enriches that tone. I'm remain in love with the series, but this volume in particular was fantastic. (And, that ending!)"}, {"review_sentiment": 4.0, "review_text": "Naomi Novik has created an alternate history using the Napoleonic Wars and given us dragons.  I have enjoyed the development of the characters of the dragons and their captains and crews."}, {"review_sentiment": 4.0, "review_text": "Not the best book in the series but it's ok, a fun read and well-written.  I've now read the whole series and enjoyed each book."}]}, "authors": ["Naomi Novik"], "isbn": "0345496876", "longitude": 18.417396, "periods": ["Recent Releases"], "title": "Empire of Ivory", "word_cloud": "thoroughly enjoy series right others brand new set brand new plot however plot start good wobble middle collapse entirely end someone else wishful deviation history assuredly miraculous recovery end next do series sadden pleasant historically brilliant series enjoy first word imagination ability translate write word take back time altered history find fully catch wish go ride dragon instead drive car friend recommend also hook like history fantasy give try enjoy entire series far mix little historical content color dragon fun love whole series seem author get tire still write well quite interesting put search cure illness ravage dragon previous installment solid through line plot make extraordinarily satisfying revolve unusually also dragon captain welcome broaden emotional investment work beautifully also mark series first major departure history dragon aside course tell change directly address racial issue permeate narrative initially skeptical tendency elide historical slavery fictional social role dragon way development work combine increasingly diverse representation specifically go long way resolve series super tone relationship make compulsively readable underlying historical setting injustice complication temper enrich tone remain love series volume particular fantastic end create alternate history use give dragon enjoy development character dragon captain crew not best series fun whole series enjoy", "genres": ["Fiction & Literature", "Historical Fiction", "Fantasy"], "summary": "Book 4/9 in The Temeraire Series \r\n\r\nNaomi Novik’s stunning series of novels follow the adventures of Cpt Laurence and his dragon Temeraire as they travel from the shores of Britain to China and Africa.\r\n\r\nLaurence and Temeraire made a daring journey across vast and inhospitable continents to bring home a rare Turkish dragon from the treacherous Ottoman Empire.\r\n\r\nKazilik dragons are firebreathers, and Britain is in greater need of protection than ever, for while Laurence and Temeraire were away, an epidemic struck British shores and is killing off her greatest defence – her dragon air force is slowly dying.\r\n\r\nThe dreadful truth must be kept from Napoleon at all costs. Allied with the white Chinese dragon, Lien, he would not hesitate to take advantage of Britain's weakness and launch a devastating invasion.\r\n\r\nHope lies with the only remaining healthy dragon – Temeraire cannot stay at home, but must once again venture into the unknown to help his friends and seek out a cure in darkest Africa.\r\n\r\n'In the best tradition of fantasy, historical fiction and nautical novels.' The Guardian", "asin": "0345496876", "rank": "56615", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/51EK3YZ9HnL.jpg", "country": "RSA", "story_arc": ["Tragedy", "Things only get worse"]}