{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 22, "rating": 3.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Boy, no one seems to like one this very much, huh?  I don't think its going out on a limb to suggest that a good number of people find Banks somewhat polarizing at times, beyond the cheeky rascals that populate his novels and almost wilful desire to avoid anything resembling a conventional resolution you have his sometimes bizarre situations which coupled with a tendency toward a fairly unapologetically leftward political view either makes for embracing you as a brother or thinking that your novels are only thinly veiled political screeds, sometimes with spaceships.This generally isn't a problem for me with most of his novels and didn't particularly bother me here but the \"political screed\" crowd received plenty of fuel for that fire when Banks made his protagonist a smug, atheist shock jock (or whatever they call them in England) who seems prone to not knowing when the microphone isn't near him and constantly regales his friends and even strangers with long rants on his politics.  In between those, the plot happens.  Needless to say, this isn't for the Banks novice.I think a lot of people (and the cover copy leans toward that initial view) were sucked in by the idea that this was going to be a novel dealing with the British view of the World Trade Center attack and the book does seem to go out of its way to encourage that, between the creepy cover featuring two tall smokestacks with a plane drifting ominously past them and the opening scene where our narrator Ken Nott is at a wedding party that is going swingingly just as news of the attack reaches England and suddenly no one is really all that keen on dessert.But beyond that, the book doesn't really address the attack except obliquely or when used as a springboard for one of Ken's political lectures, which on some level makes sense . . . happening in another country across the ocean and with no one he knows getting killed, Ken's take seems to be \"everyone is getting worked up over this but worse stuff is happening every day around the world\", which is both true and slightly callous and sometimes suggests to me that Banks is doing a satire on the seriousness and occasionally pomposity of other novels that focus on the attacks (I thought Pynchon's \"Bleeding Edge\" dealt with it well but I may be alone on that) by showing life going on as normal by people too far away to be directly affected by it.And what is \"life going on as normal\" mean for a popular shock jock?  Mostly hanging out with your friends, toeing the line between satisfying and ticking off your employers and when the mood strikes you cheating on your girlfriend with a married woman (which is okay because she might be doing it too), among other things.  All of this transpires in a fairly aimless fashion, which may be my biggest complaint about the book is that it drifts along for long enough that you start to wonder \"where exactly are we going with this?\"  And given that the book reads fairly quickly, you may be a lot further along than you'd like before you realize that you've done nothing but hang out with a left wing narcissist in perhaps a vain search for the plot.A lot of this thus depends on either a) the charisma of the narrator or b) the likability of the supporting cast.  And that's . . . iffy?  Nott as a narrator as the usual witty voice of a Banks protagonist and there is some glee is seeing him constantly skewer people and still walk away thinking he's right all the time.  The peeks into the radio show will probably put people off the most as many seem to interpret it as Banks forcing his politics on the unsuspecting reader.  Its quite possible that he and Nott shared similar political views . . . I haven't read many interviews with Banks but judging from other books of his I've read it seems to fall in line with sentiments expressed elsewhere.  However, I do believe that Banks was too good a writer to simply make a character a mouthpiece for his personal views solely for the purpose of forcing it on us.  I suspect he was trying to depict the difference between how Nott perceives himself versus what everyone else thinks of him and there's a brief scene later in the book where another character calls him on his fearless contrarian warrior self-view by basically suggesting that maybe the rich guy who owns the radio station keeps him around because his antics distract everyone from the more objectionable stuff they're doing.  Getting caught up in the politics themselves misses the point, its about a guy so confident in his ability to know and see everything, to live his life purely by own unassailable principles that when his weaknesses start to call the proverbial chickens home to roost they might as well all be wearing tiny mirrors around their necks so he can see himself for what he really is.However, as a caveat, I will note that my personal politics and Nott's overlap in a couple of areas so I couldn't get too offended (plus his whole shtick is pissing people off so its supposed to be over the top) but even the stuff I was disagreed had entertainment value.  Plus I can't get too mad when fictional characters say things I don't like, mostly because they're not real.  There are plenty of people saying offensive things in real life that I can expend energy on getting mad at instead.So to me the real test is: is it boring?  It's not, mostly because in how fast it reads but with the cast populated with people who you will feel either neutral toward or actively dislike, you're not going to get too attached to anyone.  The main thrust of the plot seems to eventually cohere around Ken's affair with the married woman, who in typical Banks fashion goes out of her way to make this as unconventional as possible, meeting him randomly at hotels and announcing her intentions via a key sent in the mail.  Oh, and she's married to a crimeboss.  This seems to be the conflict that the novel hangs itself on, waiting for the other shoe to drop as Ken goes about his days making everyone mad at him and supremely confident that none of that will come back to bite him.When it does the results show off Banks' talents probably better than any other portion of the book.  Although what leads up to it is ludicrous and the solution even more insane he does an excellent job of turning what amounts to a breaking and entering job into a nail biter of an affair, ratcheting up the tension to the point where it actively starts to make you nervous.  Later on a confrontation is also almost unbearably tense where you're waiting to see Ken taken down a peg but not wanting him to be eviscerated and thrown into a woodchipper either.Still, the payoff to all that felt flat to me, a tacked on happy ending that makes you wonder what the whole point of the rest of the book was.  Presumably Banks couldn't bring himself to show an extremely confident and arrogant man eventually learning how to be a warm and cuddly person since that suggests levels of sentiment that aren't usually his forte (plus, as real life shows us, its not all that realistic since when the arrogant get taken down they tend to blame everyone else for their failings) . . . so I give him kudos for not going with the obvious crowd pleasing route or even the more cynical realistic route.  What we do get is some uncomfortable blend of the two that doesn't quite feel earned based on what we've read before, its not a really satisfying conclusion but neither does it make me go \"Oh Iain Banks you lovably contrary Scotsman\".Maybe its been a while since I've read a Banks novel (I'm pretty sure this is my first since he died a few years ago) or maybe he was making some point about society that we've either moved past (the book was published in 2002, which in today's world feels like fifty years ago . . . these days the shock jock would just restrict his opinions to tweeting) or I'm too dense to get or maybe he was never able to zero in on exactly what he was trying to say (or thought it was more obvious than it turned out to be).  As I mentioned earlier, its definitely not for the Banks novice and while it does have its small pleasures there are somewhat small this time indeed.  Even if you don't like spaceship laden Iain Banks, he has plenty of straight fiction that works better than this.  Read it if you've read everything else (especially as we're not about to get anything new from him) but certainly you can safely tuck it pretty far down the reading order."}, {"review_sentiment": 2.0, "review_text": "A very sexist book in a way that you won't expect from the rest of its very liberal content, or from the fact it was actually written in the 21st century. Women are described as sexual objects in the most outdated way, it's just disgusting and gives you a very uneasy feeling as a lefty reader this book is supposedly meant for."}, {"review_sentiment": 4.0, "review_text": "I have read all of Iain Banks books and I normally read them in the year they were published. As Iain Banks fiction is very much of its time and full of contemporary references, its nice to have read them 'in their time' and to understand how Iain is living very much in the same world as we are. And to listen to how he intelligently reflects on and mirrors the years of our life even as we live them.Dead Air is one such book. Published in 2002, the book is mute with the shock of 9/11. A shock so raw, Iain Banks does not reference it in any way except to show the event on a television screen at the start of the narrative.Dead Air is a good reflection of Britain in 2002. London was a boom city brim full of money and drugs. Shock jocks were new and loft-living was all the rage.I did not really like this book mainly because I did not like the hero Ken Nott, his rants and drug and booze lifestyle. However it was a compelling read and I saw it through to the end. As always with Iain Banks, I thought it had much to recommend it."}, {"review_sentiment": 4.0, "review_text": "I have read all of Iain Banks books and I normally read them in the year they were published. As Iain Banks fiction is very much of its time and full of contemporary references, its nice to have read them 'in their time' and to understand how Iain is living very much in the same world as we are. And to listen to how he intelligently reflects on and mirrors the years of our life even as we live them.Dead Air is one such book. Published in 2002, the book is mute with the shock of 9/11. A shock so raw, Iain Banks does not reference it in any way except to show the event on a television screen at the start of the narrative.Dead Air is a good reflection of Britain in 2002. London was a boom city brim full of money and drugs. Shock jocks were new and loft-living was all the rage.I did not really like this book mainly because I did not like the hero Ken Nott, his rants and drug and booze lifestyle. However it was a compelling read and I saw it through to the end. As always with Iain Banks, I thought it had much to recommend it."}, {"review_sentiment": 3.0, "review_text": "‘Dead air’ is radio talk for unwanted silence when on air. The book’s Scots hero Ken Nott (35) never shuts up. He is a radio DJ,  rarely lasting a year in earlier radio jobs for his controversial take on the world. Now he is a true shock jock upsetting listeners from a London commercial radio station just before and after 9/11, 2001. In the quite cinematic first chapters, Ken emerges as an early detractor of  the UK going to war in Iraq and Afghanistan.Ken’s dialogues with his best Scottish friend Craig, his black club DJ buddy Ed and his producer Phil (on air and in the pub) are quite ok. So are excerpts from his phone-in late morning radio show reproduced in many chapters. It shows him as what the French call a ‘râleur’, a contrarian moaner about persons, political parties, countries, religions, etc.,  but also about the perils of riding a bike in London. He likes to be labeled a militant Liberal and has his own wall of fame with framed  first complaints, death threats and other negative job-related trophies. Another aspect of his radio career is his being Scottish, which is highlighted off and on air,  to some delight to this reader.What propels the novel forward is his professed love for his three friends and for the real, female kind. Ken was married once and has been quite opportunistic and successful since.  Until he meets beautiful Celia, married to a ruthless crime boss, whose many businesses have almost become mainstream…  No more from this reader about their affair, which dominates much of the book.Weaknesses: (1) Iain Banks, not an economical writer by nature or choice, wrote chapters that are way too long for me; (2)  Found  Ken not someone to bond with as the story progressed, and  (3)  Banks’ increasing concern with Ken’s thoughts and fears led me to skip, or read in a FFW-way the more action-packed second half.Many fantastic bits cannot undo later tedium. Good winter book."}, {"review_sentiment": 3.0, "review_text": "Dead Air is well paced and gripping, but possibly with a less sympathetic hero, a mouthpiece of the author's political views?. I would put it between 3 to 4 stars as I am happy to have bought it and enjoyed reading it even if not 100 gripped."}, {"review_sentiment": 3.0, "review_text": "I don’t like to speak ill of the dead or of a writer whose early work I’ve admired. Nonetheless, I have to be honest.I hadn’t read anything by Iain Banks for some years, I enjoyed The Wasp Factory, The Crow Road and Complicity. I wasn’t so keen on Whit so drifted away a bit.Then I recently picked up Dead Air.I don’t like to give up on books and I didn’t on this one. I came close. I think it was about page 160 before anything actually happened.There’s no real plot, which doesn’t have to be a problem; books can be character-driven. This is when I got puzzled, though. I know I shouldn’t spend all my time wondering about the author’s intentions, but I can’t help it – or at least not when I can’t lose myself in the book. I couldn’t decide and I still can’t whether Iain Banks was setting out, in Ken (the hero), to portray an opinionated, hypocritical, misogynistic, puerile pillock who seemed to think he was smart and cool, but was about as cool as boiling water, or whether he actually did think that Ken was quite a hip, trendy, happening kind of a guy.I’d like to hope the former, but I fear it’s the latter, given the ring of sincerity about so much of what comes out of Ken’s mouth and head (and there’s soooo much of it, regardless of how well it’s written, that I was yawning and skipping).I guess the book is supposed to be some satire of early 21st Century Britain, of which Ken is no doubt supposed to be a symptom, but Banks seems too drunk on his own verbosity for it to really work. Yes, there were some amusing moments, and some interesting points made, but he does go on, and on, and on. Nothing is too trivial for Ken’s attention, from minor league Scottish football teams to vibrating phones as sex aids (!). Enough now, or I’ll know I’ve been infected. Avoid."}, {"review_sentiment": 4.0, "review_text": "So you are forewarned.  I've read every one of his novels--SF and fiction. This particular novel is an only lightly disguise for his own liberal views, as his character is a shock-jock on radio. In spite of the rants (and I am something of a liberal), there is more to the plotting than just liberal diatribes. The character is dealing with death threats, a London mobster, and the various women in his life. I did enjoy the book very much, and am already missing Mr. Banks as a writer."}, {"review_sentiment": 5.0, "review_text": "Judging by the reviews this is one of Banks' weaker offerings however I thoroughly enjoyed it. Admittedly as noted in other books the plot is a little thin particularly the first three quarters of the book. Even so I really liked this book & wouldn't hesitate to read more from this author."}, {"review_sentiment": 1.0, "review_text": "Just a crap book full of hot air if you ask me. A novelist who likes to hear the sound of his own voice disguised in a novel"}]}, "authors": ["Iain Banks"], "isbn": "0349116644", "longitude": -0.12574, "periods": ["2000s", "Recent Releases"], "title": "Dead Air", "word_cloud": "seem much huh think go limb suggest good number people find somewhat polarize time cheeky rascal populate novel almost willful desire avoid anything resemble conventional resolution sometimes bizarre situation couple tendency fairly unapologetic ally leftward political view make embrace think novel thinly veil political screed sometimes generally problem novel particularly bother political screed crowd receive plenty fuel fire make protagonist smug atheist shock jock call seem prone know microphone constantly regale friend even stranger long rant politics plot happens say think lot people cover copy lean initial view suck idea go deal british view attack seem way encourage creepy cover feature tall smokestack plane drift ominously open scene narrator wed party go swimmingly news attack reach suddenly really really address attack obliquely use springboard political lecture level make sense happen country ocean know get kill seem everyone get worked worse stuff happen day world true slightly callous sometimes suggest satire seriousness occasionally pomposity novel focus attack think dealt well show life go normal people far away directly affected life go normal mean popular shock jock hang friend toe line satisfy tick employer mood strike cheat girlfriend marry woman okay thing transpires fairly aimless fashion biggest complaint drift long enough start exactly go give read fairly quickly like realize do nothing hang leave wing narcissist perhaps vain search lot thus depend charisma narrator b likability support cast iffy narrator usual witty voice bank protagonist glee see constantly skewer people still away think right time peek radio show probably put people many seem interpret force politics unsuspecting quite possible share similar political view many interview judge seem fall line sentiment express elsewhere however believe bank good writer simply character personal view solely purpose force suspect try depict difference perceive everyone else think brief scene later character call fearless contrarian warrior basically suggest maybe rich guy own radio station keep antic distract everyone objectionable stuff get catch politics miss point guy confident ability know see everything live life purely unassailable principle weaknesses start proverbial chicken home roost well wear tiny mirror neck see really note personal politics overlap couple area offended whole shtick piss people suppose top even stuff disagree entertainment value mad fictional character say thing like mostly real plenty people say offensive thing real life expend energy get mad real test bore mostly fast read cast populated people feel either neutral actively go attach anyone main thrust plot seem eventually cohere affair marry woman typical fashion go way make unconventional possible meeting randomly hotel announce intention key sent mail marry crime boss seem conflict hang wait shoe drop go day make everyone mad supremely confident none come back bite result show bank talent probably better portion lead ludicrous solution even insane excellent job turn amount break enter job nail biter affair ratchet tension point actively start make nervous confrontation also almost unbearably tense wait see take peg want eviscerate thrown wood chipper payoff felt flat tack happy end make wonder whole point rest extremely confident arrogant man eventually learn warm cuddly person suggests level sentiment usually forte real life show realistic arrogant get take tend blame everyone else failing give kudos go obvious crowd please route even cynical realistic route uncomfortable blend quite feel earn base really satisfying conclusion make lovably contrary bank pretty sure first year ago maybe make point society move past publish today world feel year ago day shock jock opinion tweet dense maybe never able zero exactly try think obvious turn mention earlier definitely novice small pleasure somewhat small time indeed even spaceship laden plenty straight fiction work better everything else especially anything new certainly safely tuck pretty far read order sexist way rest liberal content fact actually write century describe sexual object outdated way disgust give uneasy feel lefty supposedly mean ian bank normally year publish fiction much time full contemporary reference nice time understand living much world intelligently reflect mirror year life even live mute shock shock raw reference way show event television screen good reflection boom city brim full money drug jock new really mainly like hero rant drug booze lifestyle however compel saw end always think much ian bank normally year publish fiction much time full contemporary reference nice time understand living much world intelligently reflect mirror year life even live mute shock shock raw reference way show event television screen good reflection boom city brim full money drug jock new really mainly like hero rant drug booze lifestyle however compel saw end always think much radio talk unwanted silence hero never shut rarely last year earlier radio job controversial take world now true shock jock upset listener commercial radio station quite cinematic first chapter emerge early detractor go war dialogues best scottish friend black club buddy producer pub quite ok so excerpt late morning radio show reproduce many chapter show french call râleur contrarian moaner person political party country religion also peril rid bike like label militant wall fame frame first complaint death threat negative trophy aspect radio career highlight delight propels forward profess friend real female kind marry quite opportunistic successful meet beautiful marry ruthless crime bos many business almost become affair dominate much economical writer nature choice write chapter way long someone bond story progress bank increase concern thoughts fear lead skip second fantastic bit undo later tedium good winter well pace grip possibly le sympathetic hero mouthpiece author political view star happy buy enjoyed read even grip like speak ill writer early work admire anything ian year enjoy keen drift recently pick give come close think page anything actually real plot problem get puzzle know spend time wonder author intention help least lose decide still set hero portray opinionated hypocritical misogynistic puerile pillock seem think smart cool cool boil water actually think quite hip trendy happen kind hope former fear latter give ring sincerity much come mouth head soot much regardless well write yawn skip guess suppose satire early doubt suppose symptom seem drunk verbosity really amuse moment interest point make go trivial attention minor league football team vibrate phone sex aid know infect so forewarned novel fiction particular lightly disguise liberal view character radio spite rant something liberal plot liberal diatribe character deal death threat mobster various woman life enjoy much already miss bank writer judge review weaker offering however thoroughly enjoy admittedly note plot little thin particularly first quarter even really like author just full hot novelist like hear sound voice disguise", "genres": ["Fiction & Literature"], "summary": "Iain Banks' daring new novel opens in a loft apartment in the East End, in a former factory due to be knocked down in a few days. Ken Nott is a devoutly contrarian vaguely left wing radio shock-jock living in London. After a wedding breakfast people start dropping fruits from a balcony on to a deserted carpark ten storeys below, then they start dropping other things; an old TV that doesn't work, a blown loudspeaker, beanbags, other unwanted furniture...Then they get carried away and start dropping things that are still working, while wrecking the rest of the apartment. But mobile phones start ringing and they're told to turn on a TV, because a plane has just crashed into the World Trade Centre...\r\n\r\nAt ease with the volatility of modernity, Iain Banks is also our most accomplished literary writer of narrative-driven adventure stories that never ignore the injustices and moral conundrums of the real world. His new novel, displays his trademark dark wit, buoyancy and momentum.", "asin": "0349116644", "rank": "2929471", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41JykgvVBmL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}