{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 57, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a great book."}, {"review_sentiment": 5.0, "review_text": "Very Interesting"}, {"review_sentiment": 5.0, "review_text": "One of the best books I have read in a very long time. Gore Vidal is amazing."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "Nice older Vidal book."}, {"review_sentiment": 5.0, "review_text": "Completely satisfied."}, {"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 5.0, "review_text": "I enjoyed the internal struggle of both male characters and the paths they choose"}, {"review_sentiment": 5.0, "review_text": "I've just re-read this novel from 1948, which I think is the very first 'home-grown' gay novel in the US. Vidal rewrote the book in 1965 with major changes and a revised ending, less melodramatic than the original (murder) although the hero's \"hell-hath-no-fury-like-a-wronged-faggot\" action seems equally out-of-character.THE CITY AND THE PILLAR, like many early novels from writers in the 40s and 50s (and still all too often today), shows clearly the influence of F. Scott Fitzgerald: lean, finely-honed prose with a kind of muscular elegance, which works supremely well for this chronicle of the coming-of-age and the coming-out of a gay high-school senior during WW2 and its aftermath. Jim Willard's briefly reciprocated love for a fellow student casts a shadow over the next decade of his life as he becomes a sailor, then a tennis-coach (and kept boy) in Hollywood and New York.Scenes in NY and LA offer early glimpses of the archness that were to characterise the author's public persona in later life and reach an apotheosis in MYRA BRECKINRIDGE and MYRON, the two-volume high-octane farce which for many readers is at once his best and his worst writing. Many scenes - and many of the characters - could as well belong to New York or Los Angeles of today as to the 1940s. Except for some clunky conversations exploring the 'Nature Of Homosexuality' which must have seemed insightful as well as daring in 1948, this is a lot less dated than other gay novels of the era.The sex scenes are almost as discreet as Mr Forster's - there's nothing as lurid or as dazzling as Gore would later concoct for Myra/Myron. But overall THE CITY AND THE PILLAR is not only an outstanding piece of gay fiction (better than many that were to come after Vidal opened the floodgates) but also one of the best novels of its era, different from but as exquisitely readable - still - as the early works of Capote and Carson McCullers.In later life Gore overdid the bitchiness and bitterness, perhaps disappointed by his failure to make it as a realm presence in US politics, the role he most craved. But his output as novelist, historian and essayist was prodigious. Other writers may have left a bigger footprint (Roth, Mailer, Updike, Irving), but Vidal deserves to admitted to the literary pantheon. He wouldn't thank me for this, but he is probably, as Somerset Maugham is supposed to have said of himself, \"in the very front rank of the second-raters\".[Reviewer is the author of THE BEXHILL MISSILE CRISIS]"}]}, "authors": ["Gore Vidal"], "isbn": "0349106576", "longitude": 0.0, "periods": ["1900s"], "title": "The City and the Pillar", "word_cloud": "great very interesting best long time amazing excellent older completely satisfied great great enjoy internal struggle male character path choose think first gay rewrote major change revise end le melodramatic original murder hero action seem equally many early novel writer still often today show clearly influence lean prose kind muscular elegance work supremely well chronicle gay senior aftermath briefly reciprocate love fellow student cast shadow next decade life become sailor keep boy offer early glimpse archness characterize author public persona later life reach apotheosis farce many reader best worst write scene many character well today clunky conversation explore insightful well dare lot le dated gay novel sex scene almost nothing lurid dazzling later outstanding piece gay fiction better many come open floodgate also best novel era different exquisitely readable still early work later life overdid bitchiness bitterness perhaps disappointed failure make realm presence politics role crave output novelist historian essayist prodigious other writer bigger footprint deserve admit literary pantheon probably suppose say front rank author", "genres": ["Fiction & Literature", "LGBT", "WWII"], "summary": "Jim Willard, former high-school athlete and clean-cut boy-next-door-, is haunted by the memory of a romantic adolescent encounter with his friend Bob Ford. \r\n\r\nAs Jim pursues his first love, in awe of the very same masculinity he possesses himself, his progress through the secret gay world of 1940's America unveils surreptitious Hollywood affairs, the hidden life of the military in the Second World War and the underworld bar culture of New York City. \r\n\r\nWith the publication of his daring third novel The City and the Pillar in 1948, Gore Vidal shocked the American public, which has just begun to hail him as their newest and brightest young writer. It remains not only an authentic and profoundly important social document but also a serious exploration of the nature of idealistic love.\r\n\r\n\"Certainly one of the best novels of its kind ... It isn't sentimental and it is frank without trying to be sensational and shocking. These are enormous virtues. -- Christopher Isherwood A noble work.\" Thomas Mann", "asin": "0349106576", "rank": "695644", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51m6Kk8bJ3L.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}