{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 2, "rating": 2.8, "reviews": [{"review_sentiment": 2.0, "review_text": "Book is not about historic, great fire of London."}, {"review_sentiment": 4.0, "review_text": "The making of a movie about Dickens' \"Little Dorrit\" is the story around which the events of this short book revolve. The cast of characters even seem to have come from Dickens. Ackroyd is a biographer of and authority on Dickens, so it's no surprise that he should write a novel in his style - albeit many of hundreds of pages lighter.All of the events figure, at least indirectly, in the filming of the movie. We have a director who is trying to get it made with government help; a disaffected professor turned writer with stars in his eyes; a lady who has some metaphysical involvement with the history of the area; her boyfriend who becomes involved with the writer and some others who affect those folks and the movie itself.Witty at times and sad at others, this is smoothly written and easy to follow. If you enjoy Ackroyd's newer writings, you'll like this early example of his fiction."}]}, "authors": ["Peter Ackroyd"], "isbn": "0349100608", "longitude": -0.12574, "periods": ["1600s"], "title": "The Great Fire of London", "word_cloud": "historic make movie story event short revolve cast character even seem come authority surprise write style many hundred page event figure least indirectly film movie director try get make government help disaffect professor turn writer star eye lady metaphysical involvement history area boyfriend become involve writer others affect folk movie time sad others smoothly write easy follow enjoy newer writing early example fiction", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The Great Fire of London is a novel by the English author Peter Ackroyd.\r\n\r\nPublished in 1982, it is Ackroyd's first novel. It established themes which Ackroyd returns to again and again in his fiction: London, English literature and the intertwining (and blurring) of literary, historical and contemporary events. ", "asin": "0349100608", "rank": "6701102", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41cxEDoYiJL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}