{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 30, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Herman avoided the worst of the holocaust thanks to a servant girl, Yadwiga, hiding him in a hayloft. Believing his wife and children murdered, he now lives in New York, married to his saviour. But he cant settle. He has a mistress, lies about his job and evades both his past and present. But an advert in a Yiddish paper asking his whereabouts leads him to discover his wife Tamara survived the holocaust and his life of procrastination tailspins even further.....Through Herman, Bashevis Singer chronicles his observations and knowledge of the holocaust survivors who came to America ;the trauma of surviving such horrors (this also is a first class depiction of post traumatic stress) , the need to make some kind of sense of things so that life can have some sort of meaning and order - a near impossibility when God stood by and let this happen to his people. For me, my \"Holy Trinity\" of Jewish writers are Saul Bellow, Bernard Malamud and Isaac Bashevis Singer. Bellow tells of the secular Jew in the modern world ; Malamud always wittily of the ones struggling between the blurring lines and demands of the old faith and secularism whilst Bashevis Singer's territory is the superstitious peasant Jews and the merchant classes of old Europe , suffering pogroms and clinging to their faith.  Here, Bashevis Singer \"Intrudes\" into the realms of Bellow and Malamud and paints an erudite and vivid picture of the post holocaust world for Jewish people; where do they fit. It is a moving portrayal.  He has a lot to tell us-especially \"Outsiders\" to the Jewish culture such as myself."}, {"review_sentiment": 5.0, "review_text": "This is an amazing novel. It was assigned for my Literature of the Exile class and the characters are so complex that you can't stop reading. Each character is dealing with their own feelings of guilt, shame, and new American lives after surviving (in significantly different ways) the Holocaust. Herman, the novels protagonist, navigates his life, his relationships with 3 different women (2 wives and a mistress), his Jewish faith, and the trauma that followed him after living in hiding from Nazis for 3 years. I would recommend this novel to anyone interested in the lives of refugees, holocaust survivors, immigrants, existential crisis, and trauma."}, {"review_sentiment": 5.0, "review_text": "Great, brand new"}, {"review_sentiment": 5.0, "review_text": "Some of the funniest poignant human writing I ever read."}, {"review_sentiment": 4.0, "review_text": "This is the most perfect novel I've read in a long time.The characters are complex and interesting.They are the \"story\".That said the novels greatest strength lies in the dialogue, which is , at times, superb.An example of this can be found early in the book.Herman Broder escaped death at the hands of the Nazi's by hiding in a servants hay loft for years.After the war , he marries the servant. Justifiably ,he thinks the wife he had before the war is dead.Then she turns up in New York.She was shot by the Germans, lived and wound up spending most of the war in a Soviet concentration camp.Tamara  and Herman meet and discuss matters.Tamara says (re wife number 2) wasn't there any other way to repay her?And then says - I better not ask.Herman - who isn't the nicest man responds by saying-There isn't anything to ask ,that's the way it is.Which is precisely to the point.We- the readers- naturally sympathize with Tamara but we also know that she isn't really upset he took another wife.Tamara , a one time Communist and Left Zionist is primarily offended that Herman has married an illiterate gentile peasant.In other words this woman who has been through so much and is basically a good person can still be a chauvinistic snob.Singer insists on these kind of tricky complexities and the novel is full of them.Herman is not appealing but he is rather fascinating.Everyone here is a grab of contradictions.They are religious  atheists  ascetics and sensualists.It is all very confusing and it beautifully rendered.I can't think of another book quite like it !"}, {"review_sentiment": 5.0, "review_text": "Another brilliant book by I.B.Singer."}, {"review_sentiment": 5.0, "review_text": "Saving the read for my backpacking trip."}, {"review_sentiment": 1.0, "review_text": "The protagonist sabotaged himself through out the story."}, {"review_sentiment": 5.0, "review_text": "I had never read Singer before. What a wonderful crazy zany human story.  I could smell the streets, So easily vicariously experience the vitality of the people, places, moods, needs and greeds of the characters. This book put my imagination in overdrive. I loved it."}, {"review_sentiment": 5.0, "review_text": "Truly wonderful book and film.........."}]}, "authors": ["Isaac Bashevis Singer"], "isbn": "0374515220", "longitude": 0.0, "periods": ["1900s"], "title": "Enemies, A Love Story", "word_cloud": "avoid worst holocaust thanks servant girl hiding hayloft wife child murder live marry savior cant settle mistress lie job evades past present advert yiddish paper ask whereabouts lead discover wife survive holocaust life procrastination tailspin even chronicle observation knowledge holocaust survivor come trauma survive horror also first class depiction post traumatic stress need make kind sense thing life sort mean order impossibility stand happen people writer tell secular modern world always wittily one struggle blur line demand old faith secularism whilst territory superstitious peasant merchant class old suffering pogrom cling faith here realms paint erudite vivid picture post holocaust world jewish people fit move lot tell jewish culture amaze assigned class character complex read character deal feeling guilt shame new american life survive significantly different way novel protagonist navigates life relationship different woman wive mistress jewish faith trauma follow live hide year anyone interested live refugee holocaust survivor immigrant existential crisis trauma brand new funniest poignant human writing ever perfect long character complex say novel greatest strength lie dialogue time example find early escape death hand nazi hide servant hay loft war marries servant justifiably think wife war turn shot live wound spending war soviet concentration meet discus say wife number way repay say better nicest man respond anything ask way precisely naturally also know really upset take time communist primarily offend marry illiterate gentile word woman much basically good person still chauvinistic insists kind tricky complexity full appeal rather grab religious atheist ascetic confuse beautifully quite brilliant save backpacking trip protagonist sabotage never wonderful crazy zany human street easily vicariously experience vitality people place mood need grid character put imagination overdrive love truly wonderful film", "genres": ["Fiction & Literature"], "summary": "Almost before he knows it, Herman Broder, refugee and survivor of World War II, has three wives: Yadwiga, the Polish peasant who hid him from the Nazis; Masha, his beautiful and neurotic true love; and Tamara, his first wife, miraculously returned from the dead. Astonished by each new complication, and yet resigned to a life of evasion, Herman navigates a crowded, Yiddish New York with a sense of perpetually impending doom.", "asin": "0374515220", "rank": "538742", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41h20X5NKtL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}