{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 15, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Watermark is powerful prose poetry, sometimes flashing a vivid image before the reader’s inner eye, sometimes wrapping its pearls tightly inside almost haiku-like sentences. “One is what one looks at,” Brodsky says, and I am glad I looked at this."}, {"review_sentiment": 1.0, "review_text": "Disappointed.  Especially considering Brodsky's literary standing."}, {"review_sentiment": 5.0, "review_text": "A great meditation on many things centered  in Venice"}, {"review_sentiment": 5.0, "review_text": "Ideal book to read in Venice. I did and I folowed the author around thus discovering his favorite canals, bridges and piers."}, {"review_sentiment": 5.0, "review_text": "Lovely little book, sweetly evocative of Venice and life as a Soviet emigre in the 1970s. Wonderful description of Venice in the winter."}, {"review_sentiment": 5.0, "review_text": "This is one of the best books I've ever read. No, really. I've bought at least five copies that I've given to my closest friends, and the universal reaction was a) this is amazing and b) why have I never heard about this before?Such a pleasure to read, and read, and read over and over again."}, {"review_sentiment": 1.0, "review_text": "Somehow it's OK to smirk when Tiziano Scarpa gets carried away by his enthusiasm for his native city, to have a sober view of Jan Morris' \"purple prose\" or even call Peter Ackroyd's book on Venice a rather unnecessary addition to the shelf. But I've seen even the polite and timid critics of Brodsky's \"Watermark\" getting the retorts like \"Brodsky is a Nobel Prize-certified genius and who you are (to dare to dislike his work)?\" The only publicly approved reaction to the book should contain phrases like \" a work of lucidity and talent\", \"beautifully evocative prose from a literary genius\", \"a tribute to La Serenissima from one of her worthiest visitors\".Well...the book is a drivel. The author comes across as a distinctly unpleasant person but the geniuses are not required to have a pleasant character - as long as they compensate for their lack of social graces with an output of extraordinary level. Sadly, that's not the case here - the \"inspired and poetic' parts are embarrassingly banal and clichéd, when Brodsky starts some kind of freestyling with metaphors it sounds like a lame and pretentious blubbering, one can read his \"gems of insight\" one by one and just shrug at their obvious lack of saving grace.Writing in English was Brodsky's folly disapproved of even by his friends and remarked upon acidly by these who were less fond of him. About his friends Susan Sontag says - They were surprised and embarrassed by his constantly claiming that he had mastered English as a poet. - Less sympathetic critics (like Craig Raine and Christopher Reid) were more vocal in their contempt for his second language forays.You can get an idea of Brodsky's command and feeling of English reading quips like \"they don't so much help you as kelp you.\" And he was proud of such idiotic wordplay, Brodsky saw it as a proof of his linguistic virtuosity. I know a lot of his bon mots in Russian that are even worse. Obviously Brodsky saw coming up with these as his trademark skill and wanted to transfer it into his second language as well.As a good human being he is even less convincing. The essay starts with his waiting for a woman to come and meet him at the railway station, at night, he leads a reader to suppose that's his love interest, kind of embodiment of Venice's femininity ready to greet and accept him. But no - Brodsky then slips into showing what a sore loser he is: the lady preferred another man years ago, and the poet feels we should know that the person was a very well-off Armenian. Well, of course - all women are after money, it's paramount, and these Armenians are so devious and cunning. Why else she declined to adore Josef with his virtuoso rhyming of help with kelp and blubbering about the Time being a Mirror of Air - or something like this?He then meets her equally pretty sister, and she is also not falling into his arms. Brodsky remarks - Well, let Armenians have them...-Later he gets a woman to share his apartment - and tells us how he makes her despite all her protests to lie in bed close to the freezing cold wall giving her lover a warmer spot. I'm really at loss trying to figure out what reaction is desired from a reader of these lines? Gloating? Applause? Feeling Brodsky becoming even dearer to us?If the best way to conquer a woman is to not care about her Brodsky uses this trick on Venice with astonishing success. Even after coming here for 17 years he didn't bother to get acquainted with the most basic facts of her history and culture. He calls several churches \"a cathedral\" (there can only be one per city), he thinks St.Marks body was brought here at the 12th century (around 828 A.D. actually), his discussion of the city's glories and problems is always shallow and disinterested.The only subject Brodsky is interested in is himself, memoirs of the people who knew him confirm this uniformly. But is he equally interesting to the public? Brodsky wasn't sure of this and preferred to pose having something at the background - history, Russia, St.Petersburg. And Venice.Venice is sung by a lot of authors who feel that choosing La Serenissima as a subject will suffice, will get their work some attention no matter how it's executed. Venice attracts so many kitschy tributes, the sheer volume of these is overwhelming and it increases year after year. If Venice sinks after all it won't be literally, she won't be covered with the waters of Adriatic - heavy layers of literary and cinematic schlock will prevent a really interested viewer from seeing the city with clarity and calm appreciation."}, {"review_sentiment": 5.0, "review_text": "Once upon a time, Joseph Brodsky went to Venice and in more than one way never returned. He went back, again and again, always in winter, when it can be cold and rainy, when the water levels rise in what Venetians call aqua alta, and the canals lap around the architecture, licking the thresholds.\"Should the world be designated a genre, its main stylistic device would no doubt be water.\" I've said elsewhere that less than 24 hours in Venice on a rainy day began my own love affair with this city. Oh, the sun was out when I arrived, but the following day I splashed through puddles and smiled at romantic couples huddled in their honeymoon gondolas under umbrellas.In Watermark , Brodsky has written a love letter, a prose poem, to the city we both love, he with more attention that I will ever be able to give.\"Part water, we serve beauty ... That's what the role of this city in the universe is. Because the city is static while we are moving. The tear is proof of that. Because we go and beauty stays.\""}, {"review_sentiment": 5.0, "review_text": "Much deeper than the typical travel memoir, Brodsky's recollections about his winter trips to Venice exposes much more than the charms of Venice.  It provides insights into travel itself, and dare I say, human nature.  The book is quite short, and reads more as a series of short stories tied together by the theme of Venice in winter."}, {"review_sentiment": 3.0, "review_text": "This is a cute little book on the impressions of Venice in Winter by Brodsky.  Given that the beauty of Venice in Winter is extraordinary, I expected more insights from an accomplished poet like Brodsky. Briefly, you learn more about Brodsky than about Venice (Winter or Summer).. Maybe I have been annoyed by some sloppiness in the writing: for Brodsky, all churches in Venice are cathedrals (there can be only one cathedral per town), and his comment that time cannot have beauty is strange (I can see Proust turning over in his tomb, rightfully so, his whole Recherches is about the beauty of time). And his attack on Ezra Pound is unnecessary. Ezra Pound is a tragic figure, and his Fascist propaganda in WWII was treason, with no excuses. But it simply does not belong in Venice in Winter, he really went out of his way to attack Ezra Pound. Excusatio non petita, accusatio manifesta?"}]}, "authors": ["Joseph Brodsky"], "isbn": "0374523827", "longitude": 12.3345898, "periods": ["1900s"], "title": "Watermark", "word_cloud": "powerful prose poetry sometimes flash vivid image inner eye sometimes wrap pearl tightly almost sentence look say glad look disappoint especially consider literary standing great meditation many thing center flow author thus discover favorite canal bridge pier lovely little sweetly evocative life emigre wonderful description winter best ever really buy least copy give closest friend universal reaction amaze b never hear such pleasure somehow ok smirk get carry away enthusiasm native city view purple even rather unnecessary addition shelf see even polite timid critic get retort genius dare dislike work publicly approve reaction contain phrase work lucidity talent beautifully evocative prose literary genius tribute worthiest visitor drivel author come distinctly unpleasant person genius require pleasant character long compensate lack social grace output extraordinary level sadly case inspire poetic part embarrassingly banal cliched start kind free styling metaphor sound lame pretentious blubber gem insight shrug obvious lack save folly disapprove even friend remark acidly le fond friend say surprise embarrass constantly claim master poet sympathetic critic vocal contempt second language idea command feel english read quip much help idiotic wordplay saw proof linguistic virtuosity know lot nob mot russian even worse saw come trademark skill want transfer second language good human even le convince essay start wait woman meet railway station night lead suppose love interest kind embodiment femininity ready greet accept slip show sore loser lady prefer man year ago poet feel know person armenian course woman money paramount devious cunning else decline adore virtuoso rhyme help blubbering something meet equally pretty sister also fall arm remark get woman share apartment tell make protest lie bed close freeze cold wall give lover warmer spot really loss try figure reaction desire line gloat become even best way conquer woman care use trick astonishing success even come year bother get acquaint basic fact history culture call several church cathedral city think body brought century actually discussion city glory problem always shallow subject interested memoir people know confirm uniformly equally interesting public sure prefer pose something history sung lot author feel choose subject suffice get work attention matter execute attract many tribute sheer volume overwhelm increase year year sink literally cover water heavy layer literary cinematic schlock prevent really interested viewer see city clarity calm appreciation once upon time go way never return go back always winter cold rainy water level rise call aqua alta canal lap architecture lick threshold world designate genre main stylistic device water say elsewhere le hour rainy day begin love affair city sun arrive follow day splash puddle smile romantic couple huddle honeymoon gondola write love letter prose poem city attention ever able give water serve beauty role city universe city static move tear proof beauty stay much deeper typical travel memoir recollection winter trip expose much charm provide insight travel dare say human nature quite short read series short story tie together theme winter cute little impression beauty extraordinary expect insight accomplish poet learn annoy sloppiness write church cathedral cathedral town comment time beauty strange see proust turn tomb rightfully whole beauty time attack unnecessary tragic figure propaganda treason excuse simply belong really go way attack accusation manifest", "genres": ["Memoir", "Essay", "Art & Architecture", "Poetry"], "summary": "In this brief, intense, gem-like book, equal parts extended autobiographical essay and prose poem, Brodsky turns his eye to the seductive and enigmatic city of Venice. \r\n\r\nA mosaic of 48 short chapters―each recalling a specific episode from one of his many visits there (Brodsky spent his winters in Venice for nearly 20 years)―Watermark associatively and brilliantly evokes one city's architectural and atmospheric character. In doing so, the book also reveals a subject―and an author―readers have never before seen.", "asin": "0374523827", "rank": "491841", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/31ZwFULvzML.jpg", "country": "Italy", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}