{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {}, "authors": ["Jamaica Kincaid"], "isbn": "0374525102", "longitude": 0.0, "periods": ["1900s"], "title": "Annie John: A Novel", "word_cloud": "", "genres": ["Fiction & Literature"], "summary": "Annie John is a haunting and provocative story of a young girl growing up on the island of Antigua. A classic coming-of-age story in the tradition of The Catcher in the Rye and A Portrait of the Artist as a Young Man, Kincaid's novel focuses on a universal, tragic, and often comic theme: the loss of childhood. Annie's voice―urgent, demanding to be heard―is one that will not soon be forgotten by readers.\r\n\r\nAn adored only child, Annie has until recently lived an idyllic life. She is inseparable from her beautiful mother, a powerful presence, who is the very center of the little girl's existence. Loved and cherished, Annie grows and thrives within her mother's benign shadow. Looking back on her childhood, she reflects, \"It was in such a paradise that I lived.\" When she turns twelve, however, Annie's life changes, in ways that are often mysterious to her. She begins to question the cultural assumptions of her island world; at school she instinctively rebels against authority; and most frighteningly, her mother, seeing Annie as a \"young lady,\" ceases to be the source of unconditional adoration and takes on the new and unfamiliar guise of adversary. \r\n\r\nAt the end of her school years, Annie decides to leave Antigua and her family, but not without a measure of sorrow, especially for the mother she once knew and never ceases to mourn. \"For I could not be sure,\" she reflects, \"whether for the rest of my life I would be able to tell when it was really my mother and when it was really her shadow standing between me and the rest of the world.\"\r\n\r\n“So touching and familiar it could be happening to any of us . . . and that's exactly the book's strength, its wisdom, its truth.” The New York Times \r\n\r\n", "asin": "0374525102", "rank": "71112", "city": "Antigua and Barbuda", "image": "https://images-na.ssl-images-amazon.com/images/I/41jH3z2YTkL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}