{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 135, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "A classic I am reading again with absolute delight!"}, {"review_sentiment": 5.0, "review_text": "Should not be ignored. Very fine."}, {"review_sentiment": 5.0, "review_text": "A very well written book just a pleasure to read"}, {"review_sentiment": 4.0, "review_text": "For Rome buffs.  Hadrian was one of the \"good\" emperors.  Gives a good picture of Rome at the time and of one thinking man who ruled it."}, {"review_sentiment": 5.0, "review_text": "What distinguishes the work for me is its eloquence; I provide an example at the end which is representative, rather than being more exceptional than many other passages, many of which are more personal to the man.  As it happened, after putting the book down, I began at p. 70, when Hadrian’s future teeters between possible early death and possible elevation to emperor.  After reading to the end, I then began again at the beginning.  Since much of the early pages are devoted to Hadrian reflecting on his life, and on old age, I rather like this approach to the book. This book could be read as a tutorial on leadership.  Hadrian was ambitious, ruthless and devious when necessary, hungry for experiences of all kinds, loyal when possible, self-deprecating but also prideful.  He enjoyed life, both its pleasures, and his acts of self-discipline and courage.  He appealed to Yourcenar, as she states, in part because he brought peace and prosperity (and security) to Rome; one must credit those people lusting after power who then have admirable goals for what to do with it once obtained. “Each time that I have looked from afar, at the bend of some sunny road, toward a Greek acropolis with its perfect city fixed to a hill liked a flower to a stem, I could not but feel that the incomparable plant was limited by its very perfection, achieved on one point of space and in one segment of time. Its sole chance of expansion, as for that of a plant, was in its seed; with the pollen of its ideas Greece has fertilized the world.  But Rome, less light and less shapely, sprawling to the plain at her river’s edge, was moving toward vaster growth: the city has become the State.”"}, {"review_sentiment": 5.0, "review_text": "An interesting portrait of Hadrian and Roman culture, but not a way to learn the details of historical events."}, {"review_sentiment": 5.0, "review_text": "In the form of an unlikely deathbed letter to 'Mark,' Yourcenar attributes to Hadrian much of the philosophy generally credited to his successor, Marcus Aurelius. It's exceedingly well thought out, researched  and organized. In spite of the unlikely venue Yourcenar succeeds better than any author in memory to put the reader into the mindset of her protagonist. She adds imagination to an otherwise non-fiction account.The historical reminiscence starts with the Senate encircling the hard pressed Domitian, reminding us of the trials of Donald Trump. It's a good insight into the starting point of the retreat from maximum extent under Trajan. We see Hadrian's wall in Britain and the retreat from Parthia. There is extensive coverage of the homosexual association with the young slave Antinous, deified after death and accorded the name of an Egyptian city. Hadrian contemplates the succession, past and present. He observes both politics and culture migrating away from a center in Rome, a preview of the thrust of empire culminating in Constantine. His fascination with Athens as a center of culture will evolve to the Greek nature of the empire, a preview of the Byzantine Empire. In contemplation of religion, Hadrian deplores persecution of Christians and sees the Jewish revolt putting the first cracks in the, soon to end, Pax Romana.Yourcenar provides a great jumping off point for Gibbons' 'Decline and Fall.'"}, {"review_sentiment": 2.0, "review_text": "Marguerite Yourcenar (1903 - 1987) who was writing her works in French has produced widely acclaimed book entitled ''The memoirs of Hadrian''. I have to admit that this is a very well researched novel from the historical fiction genre. Author did her homework and she started writing this book being very well prepared. As a reader I have to praise Mrs. Yourcenar for all of her efforts that she made to write this historical novel with very high professionalism.Moreover I cannot agree with the negative depiction of the Hadrian's predecessor Emperor Trajan, who is presented in the novel as a ruler obsessed only with new conquests that have devastating impact on the Roman state. Trajan was officially declared by the Senate and his contemporaries as ''Optimus Princeps'' what means ''The Best Ruler'' and one knows that such titles do not come for free. The reign of Trajan was very unique in comparison to the reigns of other emperors in the first centuries AD. He was very much successful soldier-emperor who significantly extended the borders of the Roman state. Unfortunately Hadrian resigned from the eastern acquisitions of his predecessor immediately after he was appointed as the following emperor.This well-researched book on one of my favourite Roman Emperors deserves a praise due to its professionalism, but not due to its style. Because of the way how it is written I must admit that ''The memoirs of Hadrian'' by Marguerite Yourcenar is not the best book on antiquity I have ever read."}, {"review_sentiment": 5.0, "review_text": "It a forgotten classic. I had forgotten how good it was..."}, {"review_sentiment": 5.0, "review_text": "This is NOT a \"novel\" so there is no \"plot\". It's a well written biography."}]}, "authors": ["Marguerite Yourcenar"], "isbn": "0374529264", "longitude": 12.4829321, "periods": ["0-500s"], "title": "Memoirs of Hadrian", "word_cloud": "classic read absolute delight fine well write pleasure buff good emperor give good picture time thinking man rule distinguish work eloquence provide example end representative rather exceptional many passage many personal man happened put begin future teeter possible early death possible elevation emperor read end begin begin much early page devote reflect life old age rather approach leadership ambitious ruthless devious necessary hungry experience kind loyal possible also prideful enjoy life pleasure act courage appeal state part bring peace prosperity security one credit people lust power admirable goal obtain time look afar bend sunny road acropolis perfect city fix hill like flower stem incomparable plant limit perfection achieve point space segment time sole chance expansion plant seed pollen idea fertilize world le light le shapely sprawl plain river edge move vaster growth city become interesting portrait culture way learn detail historical event form unlikely deathbed letter attribute much philosophy generally credit successor exceedingly well think research organize spite unlikely venue succeed better author memory put mindset protagonist add imagination otherwise historical reminiscence start encircle hard press domitian remind trial good insight start point retreat maximum extent see wall retreat extensive coverage homosexual association young slave antonius deify death accord name egyptian city contemplate succession present observe politics culture migrate away center preview thrust empire culminate fascination center culture evolve greek nature empire preview contemplation religion deplore persecution see jewish revolt put first crack soon end provide great jump point write work produce widely acclaim entitle admit well research historical fiction genre homework start write well prepared praise yourcenar effort make write historical high agree negative depiction predecessor present ruler obsess new conquest devastate impact state officially declare contemporary mean know title come free reign unique comparison reign emperor first century much successful significantly extend border state resign eastern acquisition predecessor immediately appoint follow favorite deserve praise due professionalism due style way write best antiquity ever forget classic forget good well write biography", "genres": ["Fiction & Literature", "Historical Fiction", "Ancient Rome"], "summary": "Both an exploration of character and a reflection on the meaning of history, Memoirs of Hadrian has received international acclaim since its first publication in France in 1951. \r\n\r\nIn it, Marguerite Yourcenar reimagines the Emperor Hadrian's arduous boyhood, his triumphs and reversals, and finally, as emperor, his gradual reordering of a war-torn world, writing with the imaginative insight of a great writer of the twentieth century while crafting a prose style as elegant and precise as those of the Latin stylists of Hadrian's own era.", "asin": "0374529264", "rank": "40990", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51afrIRGIjL.jpg", "country": "Italy", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}