{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 41, "rating": 3.8, "reviews": [{"review_sentiment": 2.0, "review_text": "Did not captivate me. Hard read. For a writer from Montreal writing about Montreal, there are a lot of details that are off. Not very believable as a québécois story. You don't believe she actually has very much insight about the people or culture. It's mostly stereotypes."}, {"review_sentiment": 4.0, "review_text": "A while back -- well years ago, fine -- I wrote a post on another blog about how schools were continuing to have people read the same boring books year after year, and how there wasn't really any need to just keep reading those books. I stand by that opinion, still: I've read a fair number of 'classic' books and found some of them boring and hard to understand (Ulysses, Moby-Dick), and others just uninspired and annoying.The Catcher In The Rye was in that latter category; I read it years ago and to this day can't understand why it's such a big deal. I didn't think it was particularly well-written, and the themes of teenage angst and alienation, as well as the tension between wanting to grow up and not understanding the world of grown-ups, are common themes that appear in many novels. I don't know why Holden Caulfield is still so celebrated, let alone why a mediocre book lands so far up on most people's lists.The Girl Who Was Saturday Night outdoes Catcher in every respect, capturing a glimpse of a world through the eyes of a girl who, because she is nothing like anyone, serves as a stand-in for everyone.The Girl Who Was Saturday Night is narrated by and stars Nouschka Tremblay, a twin child of Etienne Tremblay, who we're told was a famous folk singer-ish celebrity in the 60s and 70s in Quebec, where the story takes place. Nouschka and her brother Nicolas are Etienne's only children, born to a 14-year old girl Etienne got pregnant on a tour (an act which landed Etienne in jail for a while but which seems not to have dimmed his popularity.)  The twins were given to Etienne's father to raise by the mother, and they have grown up on what is essentially the Montreal version of Skid Row.Nouschka describes a life of panhandling, minor thievery, scams, and barely-scraping by from jobs. At the outset of the story Nouschka goes to enroll in night school so she can finish her high school education, and gets talked into joining a beauty pageant that lands her in a parade; she is picked not just because she's beautiful but because she and Nicolas are frequent tabloid fodder for their lifestyles, as is Etienne, who drifts in and out of the picture as a documentary is filmed about him.From that beginning the story unfolds in a sprawling kaleidoscope of Quebec's secession movement, marriages, crimes, pregnancies, and discoveries.  Nouschka dates a rich Englishman named Adam but breaks up with him when she finds out that Adam's nanny, when he was young, was Nouschka's mother, who she's never met. She only met Adam because Nicolas found out about the connection and befriended him, without telling Nouschka why. When Nouschka breaks up with Adam, she quickly marries Raphael, the boy across the street who himself was going to be a famous figure skater until something happened that made him quit; now he's a possibly-schizophrenic small time criminal who goes from dog-breeding schemes to haphazard drug-dealing for motorcycle gangs.The real charm of the book isn't just the amazing characters, who are heartbreaking and fascinating at the same time (Nouschka's grandfather, LouLou, is particularly sad in one scene where he has forgotten the twins are now 20 and talks to them as though they're babies), but the way Nouschka sees everything and relates it; the book is full of similes: everything, practically, that Nouschka looks at is compared to something else, usually something unusual. Her running commentary makes the slum where they live, and the lives they lead, seem both terribly sad and somehow magical at the same time -- but magical in a way that you know isn't going to end well.Unlike Catcher, Saturday Night pulled me along through the story, as Nouschka and Nicolas try to cope with their lives and their growing up, resenting the way their lives pull them away from each other, resenting the advantages other people have had (at one point, Nouschka gets Adam to tell her one of the stories her mother told Adam when she was a nanny; the story was about two children named, of course, Nouschka and Nicolas), and coping with a life where they have been famous since they were babies, leaving people thinking they know the twins while having no idea what they're relly like.The strangeness of their lives somehow makes the emotions seem universal. The twins' lives have absolutely zero in common with my own, either now or growing up, but I could feel a connection with how I felt, as a middle-class kid in the suburbs heading out on his own, as a young adult and then an older adult trying to forge a way in the world.  The idea that there is some sort of mysterious force that decrees some people will have it easy while others will struggle, the feeling that nobody really knows us, they just think they do because of our public personae, the small victories that matter only to us, and the larger victories that we want the entire world to celebrate: those all resonated with me and made me feel like someone had found a really perfect way of describing how I think and feel lots of the time, while also being an extremely compelling story.What makes it really kind of interesting to me is the fact that I found this book completely by accident. It was published nearly 2 years ago, and I'd never heard of the author or the book at all. I just stumbled across it this way: When we were at the Verona library a few weeks ago, Mr F wanted to go get a drink of water. We were wandering through the fiction section trying to find a bubbler, and he stopped to look out a window at the rain.  I let him sit there for a bit and idly looked at the books on the shelf opposite me. I saw the spine of the book, and liked the title The Girl Who Was Saturday Night, so I picked it up and read the cover description, then checked it out and read it.This was the second of the two books I took out that day; the other was The Mark And The Void, and in each case I don't know that I'd ever have otherwise come across the books. That's part of the reason why I like libraries, and why I think it's good that there are still some bookstores around.  There's an unexpected joy in happening onto a book that is outside of your usual genre, but which when you read it opens up whole new vistas of stories.  (Similarly, I found Billy Lynn, Hansel & Gretel, Of Dice And Men, and some others on this list just by wandering around libraries with the boys. I recommend it, if you like to read: libraries are a cost-free guilt-free way of discovering books by taking a chance on something just because it had a neat cover or cool title.)And I'm glad I found this one. While the world is cramming Holden Caulfield down kids' throats, here is a book that sees Holden's angst and confusion and raises it with ice skaters, lions, political movements, bank robberies, New Year's Eve parties, and jars full of wishes (really! and it makes sense!), jumbling it all together into a jagged, beautiful portrait of a life that nobody would want, but which everybody kind of has anyway.I loved this book. It's one I might put on my list to read again in a few years; it's the kind of book that you want to let soak in, that you read through half trying to find out what happens and half just to feel the story flowing over you.It's a keeper.  And the ending, as endings rarely are, is perfect."}, {"review_sentiment": 5.0, "review_text": "I enjoyed this book immensely as I think it accurately portrayed the financially poor French Canadian society in Quebec and how distant this was from a middle class society of both the French and the English. The struggle of some just to keep life going, or to have values and discipline to rise above their station in life , perpetuated from generation to generation was both disheartening and interesting to read about. The presentation of some fantasy in the novel, the humor and closeness of the twins was remarkable. I especially liked that the ending was both tragic with the death and hopeful with the reunification of mother and possible new husband.The strength of the heroine was rewarded"}, {"review_sentiment": 3.0, "review_text": "Heather O’Neill charmed readers in the hundreds of thousands with her sleeper hit, Lullabies for Little Criminals, which documented with a rare and elusive magic the life of a young dreamer on the streets of Montreal. Now, in The Girl Who Was Saturday Night, she returns to the grubby, enchanted city with a light and profound tale of the vice of fame and the ties of family.Nineteen years old, free of prospects, and inescapably famous, the twins Nicholas and Nouschka Tremblay are trying to outrun the notoriety of their father, a French-Canadian Serge Gainsbourg with a genius for the absurd and for winding up in prison. “Back in the day, he could come home from a show with a paper bag filled with women’s underwear. Outside of Québec nobody had even heard of him, naturally. Québec needed stars badly.”Since the twins were little, Étienne has made them part of his unashamed seduction of the province, parading them on talk shows and then dumping them with their decrepit grandfather while he disappeared into some festive squalor. Now Étienne is washed up and the twins are making their own almost-grown-up messes, with every misstep landing on the front pages of the tabloid Allo Police. Nouschka not only needs to leave her childhood behind; she also has to leave her brother, whose increasingly erratic decisions might take her down with him.--My thoughts. Well, I wanted to like the book. At first, I was excited... But I quickly lost that excitement. Similes abound everywhere. Overdone in my opinion. These two, the sister is better off without the brother... I enjoyed the storyline but they just seemed toxic with each other...Obviously it was a hit or miss kind of book.."}, {"review_sentiment": 4.0, "review_text": "A pair of twins with messed-up lives are at the center of this book.  Nicholas and Nouschka grew up without enough parental supervision, resources, structure, or love.  At 19 they are barely scraping by in their home city of Montreal.  The city is not especially kind to either one, nor has life been kind.  Their father has been drunk, in and out of jail, and absent for most of their lives.  Their overwhelmed grandfather can't handle them.  The two make horrible decisions.  No one has ever taught them how to do otherwise.  Nouschka is desperately trying to improve her life, but it's not easy in a world that doesn't celebrate sober, responsible adulthood.  Nicholas is doing more of the same.This is a story about young adults coming of age under very trying circumstances.  Their world in Montreal is very starkly rendered.  The city is not kind to them.  If you want to read about the systematic, overwhelming obstacles some kids face in making it to adulthood, this is an excellent text."}, {"review_sentiment": 5.0, "review_text": "Nouschka and twin brother Nicolas never had caring parents, were children made famous because of their fame-seeking and exploitative father, and were too close to each other.  A recipe for disaster.\"Nicolas and I were always trying to make every single person we met fall in love with us.  What a job.  It was a bad habit that we had picked up as child stars.  But maybe it's the same for everybody.\"This novel is a sad, sweet story of people getting through life the best the can, and making lots of bad decisions along the way.  Normally, too many similes and metaphors in a book start feeling contrived and annoy me.  However, it was different for this one.  Nouschka thought in similes.  Hundreds of them, or so it seemed.  They were creative and imaginative and touching, and very appropriate and descriptive.There is some sex in this book, and some of it quite inappropriate, and it felt sad and desperate.  There was some profanity, some of it pretty strong, but not lots of it, not so much for shock value but for the sad way the characters viewed their own lives.I fell in love with Nouschka, and her way of looking at the world, her optimism and pessimism living in harmony with one another.Towards the end of the book, there is\"Every writer has to invent their own magical language, in order to describe the indescribable.  They might be writing in French, English, or Spanish, but really they are writing in the language of butterflies,  crows, and hanged men.\" This book was written in the language of butterflies, crows, and hanged men.  And I loved it.I was given an advance reader's copy of this book for review.  The quotes may have changed in the published edition."}, {"review_sentiment": 5.0, "review_text": "There are two compelling reasons to read this book. First is the story - a rather disturbing, wild tale of the twin children of a fallen Quebecois singing star. The children have been abandoned by both parents and although they live with their grandfather, they are rather feral, disturbingly emotionally dependent and self-destructive. The story takes place in the St. Laurent neighborhood and the latest separation referendum is the backdrop and a catalyst. It was hard to watch these characters continually make horrible decisions, it was hard to turn away. O'Neill weaves the perspective of the \"YES\" side of the referendum voters into her story, interesting to me as an anglophone ex-Montrealer who was living in Toronto at the time! The connection and the charisma of the twins is both their salvation and their downfall, and the reader watches as they try to save each other and themselves.The second reason to read this book is the writing. There are sentences in this book that are so stunningly beautiful and insightful and truthful that they are almost a distraction. Other reviewers have quoted quite a few, and so I won't repeat them, but this book should be used as a textbook for every creative writing course ever taught going forward. There are phrases that are so powerful they could be their own chapters; they crystalize situations, emotions, lives...they are brilliant."}, {"review_sentiment": 5.0, "review_text": "Heather O'Neill's first novel Lullabies for Little Criminals is one of my all time favorites, so I was overjoyed when this finally came out. The writing style and general vibe is thankfully similar. Her writing is gut wrenching and beautiful. She definitely has a way with metaphors and describing ordinary things to make them magical. She is great at creating interesting characters. Fans of Lullabies will like this book."}, {"review_sentiment": 5.0, "review_text": "The Girl Who Was Saturday Night lays love bare. O'Neill doesn't romanticize love; she paints a realistic picture of what love truly is. The Girl Who Was Saturday Night follows twins Nouschka and Nicolas Tremblay who were raised by their senile grandfather because their mother was too young and their famous folk singing career obsessed father couldn't be bothered. The story is set in Montreal, Quebec and is an excellent illustration of the French Canadian culture. The twins are floating between child and adulthood. Their past stardom haunts them but their current plight of stagnant living pushes them to move on. Nouschka recognizes the need to move forward, but is held back by love for her brother and fear of being separated from him. The story is overlaid with the politics of the Quebec separatist referendum and a few feral cats.This is Heather O'Neill's second critically acclaimed novel. It has the honour of being long listed for the 2015 Baileys Women's Prize For Fiction and nominated for the 2014 Scotiabank Giller Prize. O'Neill's Lullabies for Little Criminals (also set in Montreal) was nominated for the 2008 Orange Prize, the 2007 Governor General's Literary Awards, and won the 2007 Hugh MacLennan Prize For Fiction. Heather contributes regularly to CBC Books, CBC Radio, The New York Times Magazine, and The Gazette. She is a fellow Canadian who was born and currently lives in Montreal.I personally enjoyed the realism in this book. Although a love story, The Girl Who Was Saturday Night was not romantic in the slightest. The novel explored many different types of love. Love between twins, parents & children, friends, husband & wife, love of culture/language/city, and the love of oneself. O'Neill captured the blaring differences between loves. She made the reader fall in love with Nouschka and Nicolas, but never over fantasized their love stories. There are no fantasy endings in this book: the characters just keep on keeping on. Which is sort of refreshing. It's wonderful to get lost in a love story, fantasize, be carried on the wind; but not many writers have the courage or the skill to capture the beautiful truth of love like O'Neill.\"Sometimes you don't realize love is love. You think it must be nobler. You think it must involve someone better-looking. Especially since all the time when you're watching television, you are just watching good-looking people hooking up.\"Although I'm Canadian, I've never visited eastern Canada or Quebec. I enjoyed discovering the rough culture in Montreal through O'Neill's eyes. O'Neill voiced the Quebecois view of separation from Canada. Although, I will never truly understand why the people of Quebec would want to separate, I found O'Neill's view on these politics interesting. Her love of the French Canadian culture shone through in this book, making the reader want to experience it for themselves.This book is not a fairy tale: it is rough, tough, and at times incredibly crass. From the beginning, O'Neill sets the tone of the novel with raw descriptions of the sex workers in Montreal; though, she manages to attach glamour to the ragged life of abandoned childhood stardom on an underprivilaged \"rue\" in downtown Montreal. Peppered throughout the novel are bursts of dark comedy you can't help but laugh at. Making this a most interesting and engaging novel.What is a literary novel without tidbits of wisdom? O'Neill smatters her life musings throughout the book. Prose like:\"A mask is a face wiped clean of love.\"\"If you wanted the simple things in life, then you could be happy.\"\"No one wants to be reminded of what they could of had.\"enlighten the reader and cause one to pause and give some though to their own lives. Much can be learned from this one simple tale.The Girl Who Was Saturday Night was fun to read. O'Neill demonstrated the feral nature of the French Canadian culture and explored the unoriginal truth about love. Her loveable characters took centre stage; throughly engaging the reader. The Girl Who Was Saturday Night is one of the most thought provoking and entertaining books I've read this year."}, {"review_sentiment": 4.0, "review_text": "\"The Girl Who Was Saturday Night: A Novel\"by HEATHER O'NEILL, NOT Heather Graham, is a book I enjoyed so much. The author wrote this book with prose in a flow that took me on a smooth trip from beginning to the end. The characters are intriguing with pitch perfect dialogue that made the story so wonderful and engaging. Descriptions were executed so vividly and really added to the story rather than serve as filler between bits of dialogue.It's a story that was a hard one to put down and really hated to see end."}]}, "authors": ["Heather O'Neill"], "isbn": "0374536104", "longitude": -73.6103642, "periods": ["2000s", "Recent Releases"], "title": "The Girl Who Was Saturday Night: A Novel", "word_cloud": "writer write lot detail not believable québécois story believe actually much insight people culture mostly stereotype back well year fine write post blog school continue people bore year year really read stand opinion still fair number find boring hard understand ulysses others uninspired latter category year ago day big deal think particularly theme teenage angst alienation well tension want grow understanding world common theme appear many novel know still celebrate alone land far people outdo respect capture glimpse world eye nothing anyone serf narrate star twin child tell famous folk celebrity story take place brother child bear old get pregnant tour act land jail seem dim popularity twin give father mother grown essentially version describe life panhandle minor thievery scam job outset story go enroll night school finish high school education get talk join beauty pageant land parade pick beautiful frequent tabloid fodder lifestyles drift picture documentary film begin story unfolds sprawl kaleidoscope secession movement marriage crime pregnancy discovery date rich name break find nanny young mother never meet meet find connection befriend tell break quickly marry boy street go famous figure skater something happen make small time criminal go scheme haphazard motorcycle real charm amaze character heartbreaking fascinating time grandfather particularly sad scene forgotten twin talk baby way see everything relate full simile everything practically look compare something else usually something unusual run commentary make slum live life lead seem terribly sad somehow magical time magical way know go end pull along story cope live grow resent way life pull away resent advantage people point get tell stories mother tell nanny story child name course cop life famous baby leave people think know twin idea telly strangeness live somehow make emotion seem twin live absolutely zero common grow connection felt kid suburb head young adult older adult try forge way world idea sort mysterious force decree people easy others struggle feel nobody really know think public personae small victory matter larger victory want entire world celebrate resonate make feel someone find really perfect way describe think lot time also extremely compelling make really kind interesting fact find completely accident publish nearly year never hear author stumble way library week ago want drink water wander fiction section try bubble stop window rain let sit bit idly look opposite saw spine like pick cover description check second take day case know ever otherwise come part reason library think good still bookstores unexpected joy happen outside usual genre open whole new vista story similarly find others list wander library boys recommend library way discover take chance something neat cover cool title glad find world cram kid throat see angst confusion raise ice skater lion political movement bank robbery party jar full wish really make sense jumble together jag beautiful portrait life nobody everybody kind love list year kind want let half try find happens half story flow keeper end ending rarely perfect enjoy immensely think accurately portray financially poor french canadian society distant middle class society french struggle life go value discipline rise station life perpetuate generation generation dishearten interest presentation fantasy humor closeness twin remarkable especially like end tragic death hopeful reunification mother possible new strength heroine reward charm reader hundred thousand sleeper hit document rare elusive magic life young dreamer street now return grubby enchanted city light tale vice fame tie year old free prospect inescapably famous twin try outrun notoriety father genius absurd wind prison day home show paper bag fill woman underwear nobody even hear naturally need star twin little make part unashamed seduction province parade talk show dump grandfather disappeared festive squalor now wash twin make mess misstep land front page tabloid need leave childhood behind also leave brother increasingly erratic decision thought want first excite quickly lose excitement abound everywhere opinion sister better brother enjoy story line seem toxic hit miss kind pair twin life center grow enough parental supervision resource structure love barely scrap home city city especially kind life kind father drunk jail absent live overwhelm make horrible decision one ever teach otherwise desperately try life easy world celebrate sober responsible adulthood story young adult come age try circumstance world starkly render city kind want systematic overwhelming obstacle kid face make adulthood excellent text twin never care parent child make famous exploitative father close recipe disaster always try single person meet fall job bad habit pick child star maybe everybody sad sweet story people get life best make lot bad decision way normally many simile metaphor start feel contrive annoy however different think simile hundred seem creative imaginative touch appropriate sex quite inappropriate felt sad desperate profanity pretty strong lot much value sad way character view fell way look world optimism pessimism live harmony end writer invent magical language order describe indescribable write french really write language butterfly crow hang men write language butterfly crow hang men love give advance copy review quote publish edition compelling reason story rather disturb wild tale twin child fall sing star child abandon parent live grandfather rather feral disturbingly emotionally dependent story take place neighborhood latest separation referendum backdrop catalyst hard watch character continually make horrible decision hard turn weave perspective side referendum voter story interest anglophone live time connection charisma twin salvation downfall watch try second reason write sentence stunningly beautiful insightful truthful almost distraction other reviewer quote quite use textbook creative writing course ever teach go forward phrase powerful chapter situation emotion life brilliant first time favorites overjoy finally come writing style general vibe thankfully similar writing gut wrench beautiful definitely way metaphor describe ordinary thing make magical great create interesting character lullaby lay bare paint realistic picture truly follow twin raise senile grandfather mother young famous folk sing career obsess father story set excellent illustration culture twin float child adulthood past stardom haunt current plight stagnant living push move recognize need forward hold brother fear separate story politics separatist referendum feral second critically acclaim honor long list nominate also set nominated contribute regularly fellow canadian bear currently live personally enjoyed realism love story romantic slightest explored many different type love twin parent child friend husband wife captured blaring difference love make fall love never fantasize love story fantasy ending character keep keep sort refresh wonderful get lose story fantasize carry many writer courage skill capture beautiful truth love think someone time watch television watch people hook canadian never visit eastern enjoy discover rough culture eye voice view separation never truly understand people separate find view politics interest love french canadian culture shone make want experience fairy tale rough tough time incredibly crass begin set tone raw description sex worker manages attach glamour rag life abandon childhood stardom underprivileged rue downtown burst dark comedy make interesting engage literary tidbit wisdom matter life musing mask face wipe clean love want simple thing life one want remind pause life much learn simple fun demonstrate feral nature french canadian culture explore unoriginal truth lovable character take center stage thoroughly engage thought provoke entertain year enjoy much author write prose flow take smooth trip begin character intrigue pitch perfect dialogue make story wonderful engaging description execute vividly really added story rather serve bit story hard put really hat see end", "genres": ["Fiction & Literature"], "summary": "An enchanting story of twins, fame, and heartache by the much-praised author of Lullabies for Little Criminals.\r\n\r\nHeather O'Neill charmed readers in the hundreds of thousands with her sleeper hit, Lullabies for Little Criminals, which documented with a rare and elusive magic the life of a young dreamer on the streets of Montreal. Now, in The Girl Who Was Saturday Night, she returns to the grubby, enchanted city with a light and profound tale of the vice of fame and the ties of family.\r\n\r\nNineteen years old, free of prospects, and inescapably famous, the twins Nicholas and Nouschka Tremblay are trying to outrun the notoriety of their father, a French-Canadian Serge Gainsbourg with a genius for the absurd and for winding up in prison. \"Back in the day, he could come home from a show with a paper bag filled with women's underwear. Outside of Québec nobody had even heard of him, naturally. Québec needed stars badly.\"\r\n\r\nSince the twins were little, Étienne has made them part of his unashamed seduction of the province, parading them on talk shows and then dumping them with their decrepit grandfather while he disappeared into some festive squalor. Now Étienne is washed up and the twins are making their own almost-grown-up messes, with every misstep landing on the front pages of the tabloid Allo Police. Nouschka not only needs to leave her childhood behind; she also has to leave her brother, whose increasingly erratic decisions might take her down with him.\r\n\r\n“The Girl Who Was Saturday Night is Heather O’Neill’s second novel, and it is the book where she emerges as a fully-formed artist.” The Globe and Mail", "asin": "0374536104", "rank": "1041450", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/517HQCjCR3L.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}