{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 198, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Iraq, Syria, Lebanon, the Middle East in history. Fabulous!"}, {"review_sentiment": 5.0, "review_text": "I am grateful that I did not live in the misogynist atmosphere of Victorian England - although I cannot understand how men could say that women were mentally inferior, while paying homage to Queen and Empress Victoria. On the other hand, I am sorry I was born too late and in a different corner of the world and thus I couldn't meet Gertrude Bell. What  a woman - and thanks to Ms. Howell for this excellent biography. Worth reading!"}, {"review_sentiment": 4.0, "review_text": "Extremely thorough, well written and researched. Really the only reason I did not give it 5 stars was because of the notable lack of photographs. It cried out for them.She was an amazing, adventurous woman. It reminded me of Jane Digby (a great read) before her. Although Gertrude was, perhaps, a more substantial woman. The historical rise of Iraq, Syria, Jordan, Palestine/Israel and Saudi Arabia and the tribal rivalries highlight today's events. It's fascinating."}, {"review_sentiment": 3.0, "review_text": "Fascinating history and Gertrude Bell was a woman before her time.  Can't wait for the film to come out.  Will be talking about the bookat our next book club."}, {"review_sentiment": 3.0, "review_text": "Good review but still lack a little bit of lustre"}, {"review_sentiment": 5.0, "review_text": "Interesting history book and character, Gertrude Bell. She played a key role in the making of Irak and the Middle East policies back in the early XX century. Enjoayable reading."}, {"review_sentiment": 5.0, "review_text": "Amazing woman, Gertrude Bell."}, {"review_sentiment": 4.0, "review_text": "Interesting documentary-like story of an historic figure I had little knowledge of"}, {"review_sentiment": 5.0, "review_text": "Extraordinary person!"}, {"review_sentiment": 5.0, "review_text": "She was an amazing person and I thought the author did author did a great job in telling the story of her life and her significance in history."}]}, "authors": ["Georgina Howell"], "isbn": "0374531358", "longitude": 31.243666, "periods": ["1900s"], "title": "Gertrude Bell: Queen of the Desert, Shaper of Nations", "word_cloud": "history grateful live misogynist atmosphere victorian understand men woman mentally inferior pay homage hand sorry bear late different corner world thus woman thanks excellent biography read extremely thorough well write research reason give star notable lack photograph cry amaze adventurous woman remind great perhaps substantial woman historical rise tribal rivalry highlight today event fascinate fascinate history woman time wait film come talk book at next club good review still lack little bit luster interest history character play key role make policy back early xx century reading amaze woman interest story historic figure little knowledge extraordinary person amaze person think author author great job tell story life significance history", "genres": ["Biography", "History", "WWI"], "summary": "A marvelous tale of an adventurous life of great historical import\r\n\r\nShe has been called the female Lawrence of Arabia, which, while not inaccurate, fails to give Gertrude Bell her due. She was at one time the most powerful woman in the British Empire: a nation builder, the driving force behind the creation of modern-day Iraq. Born in 1868 into a world of privilege, Bell turned her back on Victorian society, choosing to read history at Oxford and going on to become an archaeologist, spy, Arabist, linguist, author (of Persian Pictures, The Desert and the Sown, and many other collections), poet, photographer, and legendary mountaineer (she took off her skirt and climbed the Alps in her underclothes).\r\n\r\nShe traveled the globe several times, but her passion was the desert, where she traveled with only her guns and her servants. Her vast knowledge of the region made her indispensable to the Cairo Intelligence Office of the British government during World War I. She advised the Viceroy of India; then, as an army major, she traveled to the front lines in Mesopotamia. There, she supported the creation of an autonomous Arab nation for Iraq, promoting and manipulating the election of King Faisal to the throne and helping to draw the borders of the fledgling state.\r\n\r\nGertrude Bell, vividly told and impeccably researched by Georgina Howell, is a richly compelling portrait of a woman who transcended the restrictions of her class and times, and in so doing, created a remarkable and enduring legacy.\r\n\r\n\" … there’s never a dull moment in the peerless life of this trailblazing character.\" - Kirkus Reviews", "asin": "0374531358", "rank": "105732", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51WPO7meToL.jpg", "country": "Egypt", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}