{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 28, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 5.0, "review_text": "A really great book--Hartman traces her research journey through various slave trade sites in Ghana alongside her emotional reaction to them and the constant deferral of what she emotionally wants/needs out of that trip. There's so much going on in here about space and geography, and the collapsing of time that is super interesting, and Hartman is a really excellent writer. The way she weaves some sentences leaves a lot of \"oh eff\" moments, and I really feel like I have to revisit this when I'm not under a time crunch to finish it for class and think a lot more about questions about ghosts and haunting for myself (I'm always thinking about ghosts and haunting.)Anyway, I really strongly encourage folks to read this, it's a great book that provides a lot of information alongside an emotional journey that's interesting and insightful to follow"}, {"review_sentiment": 3.0, "review_text": "Well written but it is to me in content a book written by someone who had lost her perspective to a white-washed ideological understanding of her cultural background. My stars aren't for whether the book is beautiful in words but I'm disappointed with the story."}, {"review_sentiment": 5.0, "review_text": "I don't know where to start. I accept that I am African. Its my DNA. Its my genetics. Its why I have a high risk of sickle cell, high blood pressure, ect. Its why I have kinky hair. Its why I am made for the sun. I've felt so lost and confused. Presently, I despise the hyphenated American attached to my African. Why? Because I feel mistreated. I see my people getting robbed of life and no convictions. We have the same issues here or anywhere in the world. You can argue with another person over what side of the city they live on. Or debate with a Native American over whos history was the worst. Its no different then our brothers and sisters on the Continent. Its hard for us to comprehend that they will not get it. Nor will we get their pain. Maybe an understanding or tolerance but its life. You were blessed to return to the Continent. Although you visited other neighboring countries, I felt like Africa was being seen as a country and not an actual Continent where millions of variois ethnic groups, cultures, and way of life of people. Its not fair to generalize. Its so sad that so called \"Black America\" is still having identity issues. You made the DNA testing sound as if it was useless. I know for a fact people have discovered their biological parents, siblings, and yes even their families on the Continent. Whos to say you even descended from Ghanians or the next? If you do fine, but now all of us do. Some of us coule be Nigerian, Senegalese, Congo.. and more. To me, Ghana has gotten much better. Its a win win situation for all. I'd say... its like hey let me promote unity and tourism and I'll help you dual citizenship (Right to Abode) as well as affordable land and more to start your own businesses. Lets not act like countries were built on everyone being gentle and simpled minded. Maybe its the hustler in me. As long as you don't harm me, we are good. In fact, the African Caribeans were recently granted Ghanian Citizeship. So it must not be that bad. I'm seeing younger and younger going to Ghana. There is also more countries to experience. You may not like Ghana.. but you may love Congo or something. Thank you so much for writing this book. I learned a lot and I am grateful. You know if we can call someone Asian or realize that Whites proudly boast about being European (celebrating Irish heritage), and even having the world speaking European languages (English and Spanish) due to their colonization and supremacy to divide and conquer... we must not be Anti-African. Its sad.. and its due to self-hate in our communities. You are so quick to call yourself a social constructed label to separate yourselves from being African. I'm talking to who ever reads this. There is nothing wrong with having your cultures.. but be real with yourselves. Stop denying being African. Thats your genetics. You can't change that based off a \"race\" aka color and a nationality aka geography. Blessings to all. If you want to look for your Continental families. Definitely try Ancestry, 23andMe, FTDNA, and upload to GED match. There is a google chrome scanner for Ancestry to even create an excel for you to find them. They would love to get to know you. Look at the reunion videos online. Join the DNA african descendants FB group and watch your heart opens up even more for your beautiful African selves."}, {"review_sentiment": 5.0, "review_text": "Seriously a beautiful book, kept me turning pages. It's great if you want to dive more into African American heritage, and the Black Freedom struggle."}, {"review_sentiment": 5.0, "review_text": "Beautifully written and thought provoking."}, {"review_sentiment": 5.0, "review_text": "I am only half way through the book but since the very first pages I have found it difficult to put Loose Your Mother down. Captivating, brilliant, and necessary."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "A disturbing, compelling look at one person's attempt to recover and reconnect to their past. It patterned attempts by others who had set out on similar journeys, but the conditioning over generations were too powerful and deep seated. This is a wonderful book.Its descriptions of enslavement are chilling and impactful written by someone with a insightful touch. I loved it."}, {"review_sentiment": 5.0, "review_text": "Thank you for your wonderful book. I enjoyed it immensely. Your look at the slave trade from the point of view of the commoner IS much needed and provides lots more data on a subject that is often described and presented in ONLY the top down, objective, sterile, them vs. us manner. The information from the bottom, in my mind, is richer. It allows everyday people the luxury of participating in the discussion. They can't say,  \"I don't know,\" \"I was not involved.\" Few are correct. When evil is around, all are impacted, then and now. The Transatlantic Slave Trade was that type of evil. Your representation of it is much needed.I am only now in 2015 reading your book. I am sure your thinking has deepened from your experiences of traveling the slave route AND meeting the descendants. As a black American, I too experience the lingering, un-articulated feelings of \"alien,\" \"stranger\" in the midst of everybody. Like you, I watch many people, of all races and colors in the US and else where, try to separate them self from the slave trade. It was not me, it was my ancestors, \"they say.\" Your work allows ALL to grapple with the visual and non-visual clues in our midst that the hurt, pain and longing of \"losing your mother\" is very real and present in contemporary life. We are nowhere near post-racial."}]}, "authors": ["Saidiya Hartman"], "isbn": "0374531153", "longitude": 0.0, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Lose Your Mother: A Journey Along the Atlantic Slave Route", "word_cloud": "excellent really great trace research various trade site emotional reaction constant deferral emotionally trip much go space geography collapse time super interesting really excellent writer way weave sentence leave lot eff moment really feel revisit time crunch finish class think lot question ghost haunt always think ghost haunt really strongly folk great provide lot information emotional interest insightful follow well write content write someone lose perspective ideological understanding cultural background star beautiful word disappoint story know start accept african genetics high risk sickle cell high blood pressure etc kinky hair make sun felt lose confuse presently despise hyphenated attach african feel mistreated see people get robbed life conviction issue anywhere world argue person side city live debate native american show history worst different brother sister hard comprehend pain maybe understanding tolerance life bless visited neighboring country felt see country actual million various ethnic group culture way life people fair sad call still identity issue make test sound useless know fact people discover biological parent sibling yes even family say even descend next fine coulee nigerian gotten much better win win situation say hey let unity tourism help dual citizenship well affordable land start business act country build everyone gentle dimple mind maybe hustler long harm good fact african recently grant ghanaian bad see younger younger go also country something much writing learn lot grateful know someone asian realize white proudly boast european celebrate irish heritage even world speak european language english spanish due colonization supremacy divide conquer due community quick social construct label separate talk ever read nothing wrong real denying african genetics base race aka color nationality aka geography blessing want look family try upload match google chrome scanner even create excel find know reunion video online african descendant group watch heart open even beautiful african self seriously beautiful keep turn page great want dive african american heritage struggle write think provoke way first page find difficult put brilliant necessary excellent disturb compelling look person attempt recover reconnect pattern attempt others set similar journey condition generation powerful deep seat wonderful description enslavement chill impactful write someone insightful touch love wonderful enjoy immensely look trade point view commoner be much need provide lot data subject often describe present top objective sterile manner information bottom mind richer allow everyday people luxury participate discussion know involve few correct evil around impact type representation much reading sure think deepen experience travel meeting descendant black american experience linger feeling alien stranger midst everybody watch many people race color else separate self trade ancestors work allow grapple visual clue midst hurt pain long lose mother real present contemporary life nowhere", "genres": ["Memoir"], "summary": "In Lose Your Mother, Saidiya Hartman traces the history of the Atlantic slave trade by recounting a journey she took along a slave route in Ghana. Following the trail of captives from the hinterland to the Atlantic coast, she reckons with the blank slate of her own genealogy and vividly dramatizes the effects of slavery on three centuries of African and African American history.\r\n\r\nThe slave, Hartman observes, is a stranger―torn from family, home, and country. To lose your mother is to be severed from your kin, to forget your past, and to inhabit the world as an outsider. There are no known survivors of Hartman's lineage, no relatives in Ghana whom she came hoping to find. She is a stranger in search of strangers, and this fact leads her into intimate engagements with the people she encounters along the way and with figures from the past whose lives were shattered and transformed by the slave trade. Written in prose that is fresh, insightful, and deeply affecting, Lose Your Mother is a \"landmark text\" (Robin D. G. Kelley, author of Freedom Dreams).\r\n\r\n“This is a memoir about loss, alienation, and estrangement, but also, ultimately, about the power of art to remember. Lose Your Mother is a magnificent achievement.” Henry Louis Gates Jr.", "asin": "0374531153", "rank": "55873", "city": "Ghana", "image": "https://images-na.ssl-images-amazon.com/images/I/51nbtciIoTL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}