{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 108, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "Spare, elegant, and terrifying, Play It as It Lays is the unforgettable story of a woman and a society come undone.  Raised in the ghost town of Silver Wells, Nevada, Maria Wyeth is an ex-model and the star of two films directed by her estranged husband, Carter Lang. But in the spiritual desert of 1960s Los Angeles, Maria has lost the plot of her own life. Her daughter, Kate, was born with an “aberrant chemical in her brain.” Her long-troubled marriage has slipped beyond repair, and her disastrous love affairs and strained friendships provide little comfort. Her only escape is to get in her car and drive the freeway—in the fast lane with the radio turned up high—until it runs out “somewhere no place at all where the flawless burning concrete just stopped.” But every ride to nowhere, every sleepless night numbed by pills and booze and sex, makes it harder for Maria to find the meaning in another day.My Thoughts: Joining the journey of Maria Wyeth in Play It as It Lays: A Novel felt like a descent. A slow unraveling of a woman who has found no meaning in her life, and who will end up with nothing left.Mariah has finally come full circle and is under the care of psychiatrists, in a place where she can turn her life over to others.In a non-linear narrative, we watch Mariah’s life in flashbacks. Anything she sees in the world around her can send her back to moments in another time or place. Some happy moments, and as she grasps for feelings of connection, she can hang on a little longer. Images of her daughter Kate feel the most poignant, and sometimes she seems to be grasping for time with her again, but she also realizes that these hopes are impossible.Watching a young woman destroy herself slowly, and seeing those around her enable her, felt like an insidious train wreck. Self-destruction takes time, but when it finally happens, you almost feel relieved. A beautifully written story that literally depressed me. 4.5 stars."}, {"review_sentiment": 3.0, "review_text": "In Joan Didion's classic, Play It as It Lays, Maria Wyeth resides in a psychiatric hospital. As the story unfolds we get a glimpse of what her life was like before she got there. Set in Hollywood, Las Vegas, and the Mojave Desert, there isn't any glitz. It's bleak, harrowing, and fascinating."}, {"review_sentiment": 1.0, "review_text": "This review is not based on the contents of the books, as I adore Joan Didion as an author. Rather, the fact that the item displayed in the listing of this item is not what I received. I have been searching for the printing of this book with the \"right\" cover, the one pictured with the snake and sun. I was glad to have finally found it but was skeptical as to whether or not it would actually be this cover. Let me tell you that it was NOT. The book I received was the printing with the cover which I was trying to avoid and do not desire. The pictured cover is much more pleasing in my opinion and that's what I wanted when I bought the book. Please change the listing photo to ACCURATELY depict what customers will receive in the mail. This may sound strange, but the cover of books is important to me and I am disappointed to find that what I saw was not what I got."}, {"review_sentiment": 5.0, "review_text": "An author that makes the Best Lists does a book for the Best Lists. Has all the Didion style you could ask for."}, {"review_sentiment": 1.0, "review_text": "Underwhelmed.  Tedious."}, {"review_sentiment": 2.0, "review_text": "very dated"}, {"review_sentiment": 5.0, "review_text": "I was right the first time. I read ths book at east ten or more years ago. I found it extraordinary, capable of provoking emotions like despair and resignation. On a second reading now, so many years later. I find it even more convincing than the first time. Didion was (is?) s most extraodinary writer, succeding in arouse strong emoion on the reader. I recommend it wholeheartedly."}, {"review_sentiment": 2.0, "review_text": "Very fractured and difficult to read, plus the whole story is really a downer"}, {"review_sentiment": 4.0, "review_text": "Stark writing, artful sentences, grim take on a life in free-fall."}, {"review_sentiment": 4.0, "review_text": "Lord knows you shouldn't read this if you want a happy, linear story. It's definitely interesting in an intellectual sense-- the way it picks humanity apart from the micro to the macro-- but it's not exactly a rollicking good time."}]}, "authors": ["Joan Didion"], "isbn": "0374529949", "longitude": -118.244476, "periods": ["1900s"], "title": "Play It As It Lays: A Novel", "word_cloud": "elegant terrifying lay unforgettable story woman society come undone raise ghost town star film direct estranged husband spiritual desert lose plot life daughter bear aberrant chemical marriage slip repair disastrous love affair strain friendship little comfort escape get car drive fast lane radio turn run somewhere place flawless burning concrete ride nowhere sleepless night numb pill booze sex make harder find mean journey lay felt descent slow unraveling woman find mean life end nothing finally come full circle care psychiatrists place turn life narrative watch life flashback see world send back moment time place happy moment grasp feeling connection hang little longer image daughter feel poignant sometimes seem grasping time also realize hope young woman destroy slowly see enable felt insidious train wreck take time finally happen almost relieve beautifully write story literally depress star classic lay reside psychiatric hospital story unfolds get glimpse life get glitz harrow fascinate review base content adore author fact item display list item receive search print right cover picture snake sun glad finally find skeptical actually receive print cover try avoid desire picture cover much please opinion want buy list photo depict customer receive mail strange cover important disappoint find saw get author make best list list style underwhelmed tedious date right first time ts east year ago find extraordinary capable provoke emotion despair resignation second read many year later find even convince first time extraordinary writer succeed arouse strong emotion recommend wholeheartedly very fractured difficult whole story really write artful sentence grim life know want happy linear story definitely interest intellectual sense way pick humanity apart micro macro exactly rollick good time", "genres": ["Fiction & Literature"], "summary": "A ruthless dissection of American life in the late 1960s, Play It as It Lays captures the mood of an entire generation, the ennui of contemporary society reflected in spare prose that blisters and haunts the reader.\r\n\r\nSet in a place beyond good and evil-literally in Hollywood, Las Vegas, and the barren wastes of the Mojave Desert, but figuratively in the landscape of an arid soul-it remains more than three decades after its original publication a profoundly disturbing novel, riveting in its exploration of a woman and a society in crisis and stunning in the still-startling intensity of its prose.\r\n\r\n“There hasn't been another American writer of Joan Didion's quality since Nathanel West . . . A terrifying book.” John Leonard, The New York Times", "asin": "0374529949", "rank": "10276", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/41cOaCCUlWL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}