{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 130, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent! Very informative about the culture."}, {"review_sentiment": 5.0, "review_text": "R.I.P. to the United Kingdom and British people. Jamaica Kincaid done buried yall."}, {"review_sentiment": 5.0, "review_text": "Kincaid delivers the literary equivalent of Bruce Lee's six-inch punch--radical, unconventional, and devastating.  A short read, written in a personal style, that forces the casual beach tourist to examine what happens outside resort areas.  Everyone talks about the \"resource curse,\" but few understand the \"tourism curse.\"  I highly recommend Kincaid's novella."}, {"review_sentiment": 5.0, "review_text": "A lovely read that inspired me to plan a trip to Antigua"}, {"review_sentiment": 4.0, "review_text": "It really makes you see the influence of the UK and it's agenda on a beautiful place on earth.  Touched my heart,"}, {"review_sentiment": 1.0, "review_text": "It'd hard for me to believe fellow educators have assigned this book.  It is filled with contempt for people who have been unable to leave Antigua as Ms. Kincaid has been fortunate to do.  Descriptions of tourists are putty colored lumps and such make me think racism is not one-directional.  No where is there any sense of trying to affect positive change.  Her writing does have style, but this basically reminds me of work hailed in the early seventies as \"daring\" and \"insightful\" when it is all shinola."}, {"review_sentiment": 2.0, "review_text": "Not the best of Jamaica Kinkaid books. It is very short, I read the entire book in half an hour. All it is basically her own thoughts about the island of Antigua. She has some other novels that I loved, but this is not one of them. It's just basically her talking about how foreigners think of Antigua as paradise, but for people who grew up there, it is not so great. There are no jobs, no places to get health care, and the schools were lacking everything. Basically stuff everyone already knows."}, {"review_sentiment": 5.0, "review_text": "The book was great"}, {"review_sentiment": 5.0, "review_text": "Kincaid offers an honest and more complete view of Antigua than most people are willing to admit. In  beautiful logical language, she describes the impossible beauty that was the destruction of Antigua. Open an honest, you walk beside her as she tells you her story. A delight to Read, a small boon filled with enormous ideas and stories."}, {"review_sentiment": 1.0, "review_text": "When I read A Small Place, it felt like I was reading one big long complaint in the form of a run-on sentence. I can count on one hand the number of books that I hate, but this makes my list."}]}, "authors": ["Jamaica Kincaid"], "isbn": "0374527075", "longitude": 0.0, "periods": ["1900s"], "title": "A Small Place", "word_cloud": "excellent very informative culture british people do bury tall delivers literary equivalent punch radical unconventional devastate short write personal style force casual beach tourist examine happen outside resort area everyone talk resource curse understand tourism curse highly recommend novella lovely inspired plan trip really make see influence agenda beautiful earth heart hard believe fellow educator assign fill contempt people unable leave fortunate tourist putty color lump make racism sense try affect positive change writing style basically remind work hail early seventy dare insightful shinola not best short entire half hour basically thought island novels love basically talk foreigner think paradise people grow great job place get health care school lack everything stuff everyone already know great offer honest complete view people willing admit beautiful logical language describe impossible beauty destruction honest walk beside tell story delight boon fill enormous idea story felt read big long complaint form sentence count hand number hate make list", "genres": ["Memoir", "Essay", "Travel Writing"], "summary": "A brilliant look at colonialism and its effects in Antigua--by the author of Annie John\r\n\r\n\"If you go to Antigua as a tourist, this is what you will see. If you come by aeroplane, you will land at the V. C. Bird International Airport. Vere Cornwall (V. C.) Bird is the Prime Minister of Antigua. You may be the sort of tourist who would wonder why a Prime Minister would want an airport named after him--why not a school, why not a hospital, why not some great public monument. You are a tourist and you have not yet seen . . .\"\r\n\r\nSo begins Jamaica Kincaid's expansive essay, which shows us what we have not yet seen of the ten-by-twelve-mile island in the British West Indies where she grew up.\r\n\r\nLyrical, sardonic, and forthright by turns, in a Swiftian mode, A Small Place cannot help but amplify our vision of one small place and all that it signifies.\r\n\r\n“Ms. Kincaid writes with passion and conviction . . . [with] a poet's understanding of how politics and history, private and public events, overlap and blur.” The New York Times", "asin": "0374527075", "rank": "30412", "city": "Antigua and Barbuda", "image": "https://images-na.ssl-images-amazon.com/images/I/41DgtNUUwLL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}