{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Quite possibly one of the most beautiful books you are ever likely to read.  It aparently took the author years to write and while the subject may not catch your attention (a small village in Sardinia) I would compare this book to the Leopard by Lampedusa, Captain Corelli's Mandali, Bulgakov or the day in the life of Ricardo Reis.The simple life of the people changed over the years by the horrors of the first world war, the rise of communism is all captured so well.  The soldier who filled with patriotism goes off to fight on the front when he turns up and tells his comanding officer he is here to \"Die for his country\" is told to \"Go and die somewhere else!\" The poor unfortunate who travells to the big city only to lose everything and most of all the leading family in this book who we find are only in this world because \"There is enough room for them\"By this book, take it on holiday with you, read on the beach and enjoy.  You wont regret it."}]}, "authors": ["Salvatore Satta"], "isbn": "0374526605", "longitude": 0.0, "periods": ["1900s"], "title": "The Day of Judgment", "word_cloud": "quite possibly beautiful ever likely apparently take author year write subject attention small village life simple life people change year horror first world war rise communism capture well soldier fill patriotism go fight front turn tell command officer country tell die somewhere else poor unfortunate travel big city lose everything lead family find world enough room take holiday beach enjoy wont", "genres": ["Fiction & Literature"], "summary": "Set in Satta's birthplace, Nuoro, Sardinia, at the turn of the century, The Day of Judgment portrays the family of Don Sebastiano Sanna, a notary and leading citizen of Nuoro. \r\n\r\nSlowly, from cobbled path to pastureland to overarching mountain, the ancient town of Nuoro in Sardinia emerges as the chief player in this singular, profoundly intelligent, superbly translated novel. If one man can be said to stand taller than the rest, it is Don Sebastiano, the notary, who, though he has labored hard for 50 years amassing vineyards, wheat fields and oil presses, is not rich, because \"only the cemetery is rich.\" \r\n\r\nAnd indeed as each of his seven sons leaves the town for the university, seeking money, fame, status, Sebastiano mocks their search for \"bread made of something better than wheat.\" For he knows that even if they don't remain in Nuoro, the town will remain in them, as it has in all the peasants, shepherds and landowners who figure in the narrative, whose sorrows, grudges and centuries-old habits distinguish them so precisely that the reader can hear their voices. \r\n\r\nA tenuous yet shattering plot, generated by the hatred of schoolteacher Don Ricciotti for Don Sebastiano takes shape toward the end. Ricciotti galvanizes the countryside, forms a new political party, stands for election, charges Sebastiano with murder. This wise and glowing novel has been widely read in Europe since its publication in 1979. ", "asin": "0374526605", "rank": "536930", "city": "Sardinia", "image": "https://images-na.ssl-images-amazon.com/images/I/71DEP874MTL.gif", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}