{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 5, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "A great read for anyone who followed the last World Cup in Brazil.  Should also be of interest to all fans of soccer or Karl Ove Knusgaard."}, {"review_sentiment": 5.0, "review_text": "An engrossing read through and through."}, {"review_sentiment": 4.0, "review_text": "I wasn't sure I'd be all that interested in this book; I had thought it would be about football (soccer to Knausgaard and all Europeans). But as I began to read it I discovered that in the correspondence between these two close friends much more was discussed than the game. Conversations ranged from the topics of literature, philosophy, history, psychology, memoir-writing, and more, and all proved to be fascinating and quite well-written. A really good read."}, {"review_sentiment": 5.0, "review_text": "Letters based on the game of soccer between to friends.Letters that really about their lives ."}, {"review_sentiment": 2.0, "review_text": "As a correspondence these two men have made a safe space for themselves to ramble on about football. Sometimes that rambling is engaging like a good pub discussion but mostly it's banal & rather frequently unapologetically chauvinist & racist.Knausgaard is the Jonathan Franzen of Europe. His sexism is so casual. I suppose I shouldn't expect less from a writer whose success is predicated on mansplaining 'not all men' over 3600 pages. Ekelund balances this with a fervent distaste or fetishization of any race/religion outside his own. His is the sad bigotry of the Enlightenment white man.All of this made the tiny gems about football too few to warrant the effort. A profoundly disappointing book"}]}, "authors": ["Karl Ove Knausgaard", "Fredrik Ekelund"], "isbn": "0374279837", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Home and Away: Writing the Beautiful Game", "word_cloud": "great anyone follow last also interest fan soccer engrossing sure interested think football begin discover correspondence close friend much discuss range topic literature philosophy history psychology prove fascinating quite really good letter base soccer really live correspondence men make safe space ramble football sometimes ramble engage good pub discussion mostly banal rather frequently unapologetic ally chauvinist sexism casual suppose expect le writer success predicate mansplaining men page balance fervent distaste fetishization sad bigotry white make tiny gem football warrant effort profoundly disappointing", "genres": ["Essay", "Sport"], "summary": "Two world-class writers reveal themselves to be the ultimate soccer fans in these collected letters\r\n\r\nKarl Ove Knausgaard is sitting at home in Skåne with his wife, four small children, and dog. He is watching soccer on TV and falls asleep in front of the set. He likes 0-0 draws, cigarettes, coffee, and Argentina.\r\n\r\nFredrik Ekelund is away, in Brazil, where he plays soccer on the beach and watches matches with others. Ekelund loves games that end up 4-3 and teams that play beautiful soccer. He likes caipirinhas and Brazil.\r\n\r\nHome and Away is an unusual soccer book, in which the two authors use soccer and the World Cup in Brazil as the arena for reflections on life and death, art and politics, class and literature. What does it mean to be at home in a globalized world?\r\n\r\nThis exchange of letters opens up new vistas and gives us stories from the lives of two creative writers. We get under their skin and gain insight into their relationships with modern times and soccer’s place in their lives, the significance the game has for people in general, and the question Was this the best soccer championship ever?\r\n\r\n“Fascinating and complex insights into the way ‘modern football’ is manufactured and disseminated, the way it reaches into our lives and what we make of it when it’s there. . . . From the rosy glow of remembered childhood televisions—Knausgaard makes a lovely note about the sound, just the sound, of a World Cup game on television on a summer evening—through to the semi-political assemblies of lower league away days, football means something to almost everybody. For all its tribal allegiances, in a world where culture and politics have splintered into ever more segregated niches, there is undoubtedly something non-denominational about football. . . . What this book does is important because it thinks about football as a part of life, not as some specialist endeavour.” The Irish Times\r\n", "asin": "0374279837", "rank": "94493", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/511jJHoOWNL.jpg", "country": "Malmo", "story_arc": ["Tragedy", "Things only get worse"]}