{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {}, "authors": ["Leonardo Padura"], "isbn": "0374535078", "longitude": 2.3514992, "periods": ["1900s", "Recent Releases"], "title": "The Man Who Loved Dogs: A Novel", "word_cloud": "", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "A gripping novel about the assassination of Leon Trotsky in Mexico City in 1940\r\n\r\nIn The Man Who Loved Dogs, Leonardo Padura brings a noir sensibility to one of the most fascinating and complex political narratives of the past hundred years: the assassination of Leon Trotsky by Ramón Mercader.\r\n\r\nThe story revolves around Iván Cárdenas Maturell, who in his youth was the great hope of modern Cuban literature―until he dared to write a story that was deemed counterrevolutionary. When we meet him years later in Havana, Iván is a loser: a humbled and defeated man with a quiet, unremarkable life who earns his modest living as a proofreader at a veterinary magazine. One afternoon, he meets a mysterious foreigner in the company of two Russian wolfhounds. This is \"the man who loved dogs,\" and as the pair grow closer, Iván begins to understand that his new friend is hiding a terrible secret. \r\n\r\nMoving seamlessly between Iván's life in Cuba, Ramón's early years in Spain and France, and Trotsky's long years of exile, The Man Who Loved Dogs is Padura's most ambitious and brilliantly executed novel yet. This is a story about political ideals tested and characters broken, a multilayered epic that effortlessly weaves together three different plot threads― Trotsky in exile, Ramón in pursuit, Iván in frustrated stasis―to bring emotional truth to historical fact. \r\n\r\nA novel whose reach is matched only by its astonishing successes on the page, The Man Who Loved Dogs lays bare the human cost of abstract ideals and the insidious, corrosive effects of life under a repressive political regime.", "asin": "0374535078", "rank": "73920", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51fMSHbAx7L.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}