{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 21, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "Novelized version of an actual place and time in history, which is readable and sadly thought-provoking as today more and more people tend to be afraid of \"chemicals\" (which make up everything in the world, including their own bodies) and want to do \"natural\" things which they think are \"safe\".Plenty of \"natural\" things kill people all the time...arsenic, botulism, etc. as well as spending thousands on sugar pills.Our education system, or maybe the trend toward letting uneducated and disorganized parents try to educate their children at home, increasingly produces more and more cases of things like scurvy and gout in adults. I don't think this would be out of line for a high-school reading list or a health class.The sweet naivety of the main character, and those who actually listened to his ideas and aped them (and some died doing so), founded as it is in weird and twisted religious ideas (if it grows closer to the sun, the it is closer to GOD and HEAVEN, ergo, healthier for us), makes the character somewhat sympathetic. This is an antihero in many ways...not likable, yet excellent writing brings him alive. The translation is a little awkward in some places, but never incomprehensible. English is just a hard language, and I believe this was British English for the most part.Some of the supporting characters feel as if they could have their own books.This is the kind of thing that makes history so interesting....when you want to go look up more and more, or wish it could be a film."}, {"review_sentiment": 3.0, "review_text": "Imperium was well written and the plot held together. The author did a good job of tracing the descent from ideology to madness and the recreation of that place and those times is gratifyingly exotic.I have a few quibbles though. Being loosely based on real life events, in this era of the internet, poses the problem that inevitably the reader can find out what really happened, and which of the characters actually existed or not. Since real life wasn't adhered to faithfully, and it was overwhelmingly a work of fiction, I think the names should have been changed. Also hummingbirds don't exist outside of the Americas - perhaps the translator's fault! But my biggest gripe of all was the Australians' treatment of the bird of paradise. I cannot believe Australians as a group (you will always get the odd psychopath) would behave that way. I hope that event never happened."}, {"review_sentiment": 5.0, "review_text": "Very interesting take on a remnant of a historical occurrence."}, {"review_sentiment": 5.0, "review_text": "'Imperium' exemplifies the beautiful harmony between the weird and the wonderful, the gorgeous and the grotesque. You'll be ripped from the present, thrown back to the past and catapulted to the future, all by the time you've completed all 200 wild pages of reading. Oh, and you might develop a slight aversion to coconuts."}, {"review_sentiment": 2.0, "review_text": "Very difficult to read with so many distracting side stories that were not relevant to the plot"}, {"review_sentiment": 4.0, "review_text": "An interesting device."}, {"review_sentiment": 5.0, "review_text": "A fascinating story about utopianism and food obsession in the early 1900s.  Imperium should be on display at every Whole Foods checkout and made required reading for anyone flirting with fad diets or membership at an urban food co-op.  Modern-day cocophiles will read this with great interest lest they go tumbling down the treacherous path to elite cocovorism, theophagy, and autophagy (three words that hadn't entered my vocabulary until reading this book).  My only critique is that the book was too short.  There are about a half dozen minor characters whose lives I wish I could have followed for another hundred pages or so."}, {"review_sentiment": 1.0, "review_text": "I found the book to be tedious and pointless.  It felt like an exercise in writing performed by an author determined to create something not done previously.  I appreciate characters drawn so that I can empathize.  No characters were so drawn.  I appreciate a story that leads to a conclusion logically  following.  I did not find that."}, {"review_sentiment": 4.0, "review_text": "I thoroughly enjoyed Imperium. While it is obviously indebted to Modernist greats like Conrad, Proust and, to my ears Mann, mostly, it also has similar qualities to recent Post-Modern nods to classic Modernism like Milorad Pavic or the insanely popular Perfume by Suskind, which I also really liked despite its fadish fame. Like Perfume, Imperium was oddly both dense and compact, with the lush syntax of classic work but without the massive page count. And in the Post-Modern vein, the book played with non-linear chronology, cinematic devices, grotesque/sexual imagery and, of course, the trick ending, which was immediately reminiscent of Gravity's Rainbow. All-in-all, a very satisfying read."}, {"review_sentiment": 4.0, "review_text": "A good solid read for those that like to read, not a first time novel to read or a casual reader in my opinion, requires some reflection and deep thought  on the readers part, overall a great addition to my library."}]}, "authors": ["Christian Kracht"], "isbn": "0374175241", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Imperium: A Fiction of the South Seas", "word_cloud": "novelize version actual place time history readable sadly today people tend afraid chemical make everything world include body want natural thing think safe natural thing kill people time arsenic botulism etc well spend thousand sugar education system maybe trend let uneducated disorganized parent try educate child home increasingly produce case thing scurvy gout adult think line read list health sweet naivety main character actually listen idea ape die founded weird twist religious idea grow closer sun closer ergo healthier make character somewhat sympathetic antihero many way likable yet excellent write brings alive translation little awkward place never incomprehensible hard language believe british support character kind thing make history interesting want go look wish film well write plot hold together author good job trace descent ideology madness recreation place time gratifyingly quibble loosely base real life event era internet pose problem inevitably really happened character actually exist real life adhere faithfully overwhelmingly work think name change also hummingbird exist perhaps translator fault biggest gripe treatment bird paradise believe group always odd psychopath way hope event never happen very interesting take remnant historical occurrence exemplifies beautiful harmony weird wonderful gorgeous grotesque rip present throw back past catapult future time complete wild page read slight aversion coconut very difficult many distract side story relevant plot interesting device fascinating story utopianism food obsession early display checkout make required reading anyone flirt fad diet membership urban food cocophiles great interest lest go tumble treacherous path elite cocovorism theophagy autophagy word enter vocabulary reading critique short half dozen minor character life wish page find tedious pointless felt exercise writing perform author determine create something do previously appreciate character draw empathize character draw appreciate story lead conclusion logically follow find thoroughly enjoy obviously indebted great ear mostly also similar quality recent nod classic insanely popular also really liked faddish fame oddly dense compact lush syntax classic work massive page count vein play chronology cinematic device imagery course trick end immediately reminiscent satisfying good solid first time casual opinion require reflection deep thought reader part overall great addition library", "genres": ["Fiction & Literature", "Satire"], "summary": "An outrageous, fantastical, uncategorizable novel of obsession, adventure, and coconuts \r\n\r\nIn 1902, a radical vegetarian and nudist from Nuremberg named August Engelhardt set sail for what was then called the Bismarck Archipelago, in German New Guinea. His destination: the island Kabakon. His goal: to establish a colony based on worship of the sun and coconuts. His malnourished body was found on the beach on Kabakon in 1919; he was forty-three years old.\r\n\r\nChristian Kracht's Imperium uses the outlandish details of Engelhardt's life to craft a fable about the allure of extremism and its fundamental foolishness. Engelhardt is at once a pitiable, misunderstood outsider and a rigid ideologue, and his misguided notions of purity and his spiral into madness presage the horrors of the mid-twentieth century.\r\n\r\nPlaying with the tropes of classic adventure tales such as Treasure Island and Robinson Crusoe, Kracht's novel, an international bestseller, is funny, bizarre, shocking, and poignant. His allusions are misleading, his historical time line is twisted, his narrator is unreliable--and the result is a novel that is a cabinet of mirrors, a maze pitted with trapdoors. \r\n\r\nBoth a provocative satire and a serious meditation on the fragility and audacity of human activity, Imperium is impossible to categorize and utterly unlike anything you've read before.\r\n\r\n“Imperium is astonishing and captivating, a tongue-in-cheek Conradian literary adventure for our time.” ―Karl Ove Knausgaard, author of My Struggle", "asin": "0374175241", "rank": "1040140", "city": "Bismark Archipelago", "image": "https://images-na.ssl-images-amazon.com/images/I/51Xbhl8VvWL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}