{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 65, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I really enjoyed Didion's insights and perspective from a time and place that I'm not all too familiar with. A lot of wit, and I especially enjoyed that it wasn't bogged down with drug commentary that so many essays are from the seventies."}, {"review_sentiment": 5.0, "review_text": "Poignant, melancholic, and biting firsthand journalism."}, {"review_sentiment": 5.0, "review_text": "An essential book. No one writes with Didion's precision or clarity. Her novels are gems as well. She's probably my favorite writer, based on a \"desert island\" criteria."}, {"review_sentiment": 4.0, "review_text": "Amazingly insightful and brilliant writing. At some point, however, the stories seem to sound like a who's who of the times"}, {"review_sentiment": 5.0, "review_text": "I just like Joan Didion's style.  I enjoy reading her work very much.  I also find her stories about her early life in California interesting."}, {"review_sentiment": 5.0, "review_text": "outstanding writing....simple poetry."}, {"review_sentiment": 5.0, "review_text": "Vintage Didion. The best. Savored every word."}, {"review_sentiment": 4.0, "review_text": "Does what it's designed to do"}, {"review_sentiment": 5.0, "review_text": "Love her writing. Great collection of essays."}, {"review_sentiment": 3.0, "review_text": "Slouching Towards Bethlehem was better, although I did enjoy the essay on Georgia O'Keefe. If you're a completionist reading all of Didion's work you won't be disappointed."}]}, "authors": ["Joan Didion"], "isbn": "0374532079", "longitude": -118.244476, "periods": ["1900s"], "title": "The White Album: Essays (FSG Classics)", "word_cloud": "really enjoy insight perspective time place familiar lot wit especially enjoy bogged drug commentary many seventy melancholic biting firsthand journalism essential one write precision clarity novel gems well probably favorite writer base desert island criterion amazingly insightful brilliant writing point however stories seem sound time like style enjoy read work much also find story early life interesting outstanding writing poetry vintage best savored word doe design write collection slouch better enjoy essay completionist read work", "genres": ["Essay", "Social & Cultural Studies", "Politics"], "summary": "First published in 1979, The White Album records indelibly the upheavals and aftermaths of the 1960s. Examining key events, figures, and trends of the era―including Charles Manson, the Black Panthers, and the shopping mall―through the lens of her own spiritual confusion, Joan Didion helped to define mass culture as we now understand it. Written with a commanding sureness of tone and linguistic precision, The White Album is a central text of American reportage and a classic of American autobiography.", "asin": "0374532079", "rank": "5120", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/41fm2uwWJUL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}