{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 10, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Twisted satire of the last days of East Germany.  Brilliant and grotesque."}, {"review_sentiment": 5.0, "review_text": "I haven't laughed out loud so much reading a book in YEARS.  I gave the German edition to my son and he told me the translation couldn't have been as funny.  But it is.  Never has a clueless character been so funny. It took a few pages to get into but the rest had me in stitches, literally.  It reminded me a bit of Hans Helmut Kirst's Gunner Asch books."}, {"review_sentiment": 3.0, "review_text": "I read this book in the original German. An angry (I think) satire of the old DDR, it was incredibly funny in places. The parents of the main character are appalling, and yet possible in systems outside the Eastern Bloc as well I suspect. But the book also had an awful lot about sex from the point of view of a frustrated teenage boy, fairly graphic stuff. It got tiresome for me, not entirely because of prudishness on my part, but because so much of it was unpleasant and therefore unpleasant to read. Gross-out humor you could say. It did kind of spoil it for me, hence 3 stars rather than 4. (There was a similar trend to obscenity in Russian literature after the fall of Communism, partly because it was so new to them maybe and partly as a way to try to express the obscenity of the system they had been living under?) Christa Wolf comes in for some nasty treatment at the end of the book as well, she is an icon of East German literature. So that was shocking to me, but very funny and I suspect right on target."}, {"review_sentiment": 4.0, "review_text": "\"The story of the Wall's end is the story of my penis\" proclaims the hero of this ribald satire on the third page, giving readers a very clear idea of what they are in for. On the one hand, a brilliant and often hilarious alternative history of life in East Germany in the years preceding the fall of the Berlin Wall in 1989. On the other hand, a Bildungsroman starring a very unlikely hero, Klaus Uhltzscht (wonderful name!), a mama's boy with an obsessive interest in his sexual apparatus. How the surprise transformation of that apparatus from pathetically inadequate to gigantic led to the reunification of Germany is the story line of the novel, which is a kind of cross between Günther Grass' THE TIN DRUM and Philip Roth's PORTNOY'S COMPLAINT, but still very much its own thing.Perhaps I should add Joseph Heller's CATCH-22 to that list. By far the funniest section of the book is the middle, when Klaus has joined the Stasi (the infamous secret police of the DDR) as an officer cadet. At least he thinks it is the Stasi. All he can get from his superiors are cryptic reminders that \"You know what kind of outfit you are in.\" But is his group the official Stasi, or a counter-Stasi, or a Stasi plant to distract attention from the real Stasi? All he knows is that their function is \"the negation of negation,\" whatever that means. One of his superiors, who had once taken a course in philosophy, has a habit of illustrating his points with totally irrelevant analogies. Another breaks all his sentences into numbered sub-headings: \"We always have pretzels here. It is (a) everyone's responsibility to (b) ensure that we never run out of pretzels.\" Most of Klaus' work consists of mounting months-long surveillance on apparently random locations, on the principle that \"the criminal always revisits the scene of the crime.\"As a teenager, Klaus goes to great lengths to obtain a copy of the East German sex manual, MANN UND FRAU INTIM. He does not have much success with its, shall we say, interactive sections, but he rivals Roth's Portnoy in the matter of self-gratification, and is soon exploring some of the practices in the book's final chapter on perversions, and even going beyond it. Indeed, Klaus, who once saw himself as a future Nobel Prizewinner, now sees himself as a sexual pioneer adding to the glory of the Socialist Ideal. I have to say that some of this writing becomes rather tiresome, but take away its more lurid aspects and there is a great deal of truth there. Anyone who has grown up as a rather nerdish boy in a restrictive atmosphere, simultaneously curious and ashamed, feeling the odd-man-out in any group of his peers, will see something of himself in poor Klaus.No, where I found I lost company with Klaus was in the political aspects of the book. It was a huge success on its publication in Germany in 1995, and you can see why. Brüssig's satire would surely have hit very specific targets with those who had lived through recent history, whereas for non-German readers it is funny enough but somewhat generic. In particular the end of the book, dealing with the Alexanderplatz demonstration and the breech of the Wall, depends a lot on references to the work of an East German writer called Christa Wolff, a name unknown to me. So just at the point where fact and fancy should have met, the book largely lost me. A pity -- but the rest of it was unique and great fun."}, {"review_sentiment": 5.0, "review_text": "Brussig's Heroes Like Us is hugely entertaining as a novel and it is also highly educational: it throws open a gigantic picture window on a culture that we \"cold-warriors\" largely had to imagine for ourselves.  East Berlin, East Germany, the Stasi.  So many secrets, so much mystery, so much inhumanity.  But as we might have guessed, the Stasi was so big and pervasive that it was ripe for lampooning, especially now that the wall has fallen and the Stasi is no longer a threat.  In terms of per-capita employment it was the largest secret police force the world has ever seen and it influenced everyone's life on both sides of the Wall. An East German Portnoy*, Klaus Uhltzscht is the son of a mid-level Stasi functionary and a public health engineer mother.  Klaus tells his story to a reporter from the New York Times (rather than to a psychiatrist) and we spend the entire novel trying to figure out how Klaus can lay claim to having caused the fall of the Berlin Wall. The journey is fascinating and fun; it is also irreverent and obscene. For so many of us there was only the spy-novel image of a captive and oppressed people, living in a black and white city where it is always night and there is no traffic.  It's an entirely new perspective on late-GDR East Berlin and its inhabitants, who in the end are just... heroes like us.  The translator gets a lot of credit and his job was so obviously difficult that I will try to find the original in German** and compare notes. I haven't read much German since college, but I think this will be worth the effort.* Portnoy's Complaint** Helden wie wir"}, {"review_sentiment": 4.0, "review_text": "I started studying Germany a few years ago, including the DDR and some of its history.This book is an entertaining fictional story set in East Germany in the 1980s for the most part. Considering the typical american doesn't have any idea what is was like \"behind the iron curtain,\" and because I am interested in the DDR, the setting for the story was extremely well-suited for me.Besides that, being a liberal young male helped also, as the protagontist Klaus explains his every thought on growing up, puberty and misunderstandings about those subjects that are gradually straightened out as he gets older.His obsessive thoughts and little over-explanitory details get a bit tiresome as the story progresses (the story is written in the 1st person), but I was laughing a lot while reading this one. Very entertaining and unique."}, {"review_sentiment": 4.0, "review_text": "a fine newish book from germany.... brussig has a similar bite to philip roth... facing real issues especially the german fear of being german...."}, {"review_sentiment": 5.0, "review_text": "I laughed from page 2 to the last.  Brussig is an imaginative and talented writer that truly knows the meaning of satire.  If you like dark humor and cynicism, then this book is for you.Be aware that if you can't handle  \"penis talk\" then you definitely should not read this.  The  German version is equally as good, and likewise the translation is quite  accurate."}, {"review_sentiment": 5.0, "review_text": "Originally I gave \"Heroes like us\" to my stepfather, because I  thought it was about the term of history he has lived in, and so he would  be interested in a witty story about East Germany. But when he read he was  so enthusiastic about it that he could not give it away. I immediately took  the book and did not wonder any more about his reaction. The slightly  ironic style of Thomas Brussig took possession of me. The action mainly  takes place in the area where I was born and so I could comprehend how  \"hero\" Klaus experiences his surroundings. But I think for any  other reader this book will also bring perfect entertainment and better  understanding of \"life in the DDR\"."}, {"review_sentiment": 4.0, "review_text": "For anyone interested in life on a day to day basis in the DDR, this is the book. An insight into the working of the infamous Stasi, in a very humorous tone."}]}, "authors": ["Thomas Brussig"], "isbn": "0374527601", "longitude": 13.3888599, "periods": ["1900s"], "title": "Heroes Like Us", "word_cloud": "twist satire last day grotesque laugh loud much reading give german edition son tell translation clueless character funny take page get rest stitch literally remind bit original angry think satire old incredibly funny place parent main character appal possible system outside eastern well suspect also awful lot sex point view frustrate teenage boy fairly graphic stuff get tiresome entirely prudishness part much unpleasant therefore unpleasant humor kind spoil hence star rather similar trend obscenity russian literature fall partly new maybe partly way try express obscenity system live come nasty treatment end well icon east german literature shock funny suspect right target story end story penis proclaim hero ribald satire third page give reader clear idea hand brilliant often hilarious alternative history life year precede fall hand star unlikely hero wonderful name mama boy obsessive interest sexual apparatus surprise transformation apparatus pathetically inadequate gigantic lead reunification story line kind cross still much add list far funniest section middle join infamous secret police officer cadet least think get superior cryptic reminder know kind outfit group official plant distract attention real know function negation negation mean superior take course philosophy habit illustrate point totally irrelevant analogy break sentence number always pretzels everyone responsibility b never run pretzel most work consist mount surveillance apparently random location principle criminal always revisit scene crime teenager go great length copy east german sex manual much success interactive section rival matter soon explore practice final chapter perversion even go indeed saw future see sexual pioneer add glory say write becomes rather tiresome lurid aspect great deal truth grown rather reddish boy restrictive atmosphere simultaneously curious ashamed feel group peer see something poor find lose company political aspect huge success publication see satire surely specific target live recent history reader funny enough somewhat generic particular end deal demonstration breech depend lot reference work east german writer call name unknown so point fact fancy meet largely lose pity rest unique great fun hugely entertain also highly educational throw open gigantic picture window culture largely imagine many secret much mystery much inhumanity guess big pervasive ripe lampoon especially wall fall longer threat term employment largest secret police force world ever see influence everyone life side east german son functionary public health engineer mother tell story reporter rather psychiatrist spend entire try figure lay claim cause fall journey fascinate fun also irreverent obscene many image captive oppressed people live black white city always night traffic entirely new perspective inhabitant end translator get lot credit job obviously difficult try find original compare note much german college think worth effort woe weer start study year ago include entertaining fictional story set part typical american idea iron curtain interested set story extremely liberal young male help also protagonist explain thought grow puberty misunderstanding subject gradually straighten get obsessive thought little detail get bit tiresome story progress story write person laugh lot read entertaining unique fine newish germany brussig similar bite philip roth face real issue especially german fear german laugh page last imaginative talented writer truly know meaning satire dark humor cynicism aware penis talk definitely german version equally good likewise translation quite accurate originally give stepfather thought term history live interested witty story enthusiastic immediately take wonder reaction slightly ironic style take possession action mainly take place area bear hero experience surroundings think also bring perfect entertainment better understanding life anyone interested life day day basis insight work infamous humorous tone", "genres": ["Fiction & Literature", "Historical Fiction", "Humour"], "summary": "Provocative and hilarious, Heroes Like Us was the first novel to comment on the downfall of East Germany by an author who had grown up with the Berlin Wall. \r\n\r\nKlaus Uhltzscht, born in 1968 in East Germany, grows up across the street from the Ministry of State Security, and he is inspired early on to do his share to win the Cold War. \r\n\r\nNaturally he joins the Secret Police, but his glorious career as an international agent never materializes. Instead, he spends countless hours keeping his fellow citizens under close surveillance -- never quite sure what he is looking for. \r\n\r\nFrustrated on all counts, Klaus&#039;s life is changed only when a strange accident in the fall of 1989 dramatically alters the size of his penis.", "asin": "0374527601", "rank": "524343", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/41%2B53dI0iPL.jpg", "country": "Germany", "story_arc": ["Tragedy", "Things only get worse"]}