{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 4672, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "amazing book! I had to read this for my college Holocaust class but I most definitely would have read it on my own because it is so great!"}, {"review_sentiment": 5.0, "review_text": "Great book"}, {"review_sentiment": 5.0, "review_text": "Great book!"}, {"review_sentiment": 5.0, "review_text": "A devastating book, and one all adults today should read.  Teens too.  SO well written, and heartbreakingly truthful."}, {"review_sentiment": 5.0, "review_text": "Perfect!"}, {"review_sentiment": 5.0, "review_text": "Beyond heartbreaking story of surviving genocide and one of the worlds most deplorable human rights atrocities. This book is definitely a 'must read'."}, {"review_sentiment": 5.0, "review_text": "Great product, fast shipping!"}, {"review_sentiment": 4.0, "review_text": "Gift"}, {"review_sentiment": 5.0, "review_text": "Haunting and horrifying."}, {"review_sentiment": 4.0, "review_text": "Daughter needed for school. Just what was needed and cheaper than the stores. Came in great condition."}]}, "authors": ["Elie Wiesel"], "isbn": "0374500010", "longitude": 0.0, "periods": ["1900s"], "title": "Night", "word_cloud": "amaze college class definitely great great great devastate adult today well write heartbreakingly truthful perfect heartbreaking story survive genocide worlds deplorable human right atrocity definitely product fast shipping gift haunt horrify need school need cheaper store great condition", "genres": ["Memoir", "WWII"], "summary": "Night is Elie Wiesel's masterpiece, a candid, horrific, and deeply poignant autobiographical account of his survival as a teenager in the Nazi death camps. This new translation by Marion Wiesel, Elie's wife and frequent translator, presents this seminal memoir in the language and spirit truest to the author's original intent. And in a substantive new preface, Elie reflects on the enduring importance of Night and his lifelong, passionate dedication to ensuring that the world never forgets man's capacity for inhumanity to man.\r\n\r\nNight offers much more than a litany of the daily terrors, everyday perversions, and rampant sadism at Auschwitz and Buchenwald; it also eloquently addresses many of the philosophical as well as personal questions implicit in any serious consideration of what the Holocaust was, what it meant, and what its legacy is and will be.\r\n\r\n“A slim volume of terrifying power.” The New York Times", "asin": "0374500010", "rank": "480", "city": "Auschwitz", "image": "https://images-na.ssl-images-amazon.com/images/I/41kkT0WKkXL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}