{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 47.3215806, "ratings": {"num_ratings": 230, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "My favorite James Salter novel, and I love all his writing! This book inspired me as a writer to write with courage and to be true to my life experience and vision."}, {"review_sentiment": 4.0, "review_text": "wonderful writing but a little slow moving. Not much plot"}, {"review_sentiment": 3.0, "review_text": "This bored me. I didn't finish it."}, {"review_sentiment": 3.0, "review_text": "Other authors hailed as “writers’ writers” have lived up to that claim and knocked me over, most notably John Williams with his exemplary 1965 novel Stoner.  But I can't join the bandwagon for James Salter's 1967 A Sport and a Pastime, which too often caused me to recall — not with pleasure — Francoise Sagan’s cheesy 1954 international bestseller Bonjour, Tristesse.Rather than seeing Salter as a writer’s writer, I see him as a writer who needed an editor, as when he writes “We slow down at the corners to try and read the plaques” where he should have written “to try to read the plaques.”Still, Salter can come up with a sentence as fine as this:  “The children playing by the fountains will become old men, but nothing of this will have changed.”Hard on the heels of that comes this pitch-perfect paragraph:“Near the edge of town there are sheep, a large flock, and two black dogs, lean and endlessly circling, that move it along.  They seem to be carving the flock.  They curve in behind and mould it.  I never hear them bark, but the bleats carry faintly across the still air.  Near the front, one old ram limps along.  The sun is warm now.  The sheep move in a current, like a stream — the edges cling, the center continually flows.  The pattern is always changing.  Segments seem to break away and vanish farther on.  Eddies appear.  The sheep hesitate and clog.  Some lambs have already been born, and they hurry along behind the mothers.  Then, quite mysteriously, the entire flock stops.  Slowly it begins to spread.  The animals graze outwards.  The dogs linger.  It’s at this moment I see the shepherd in a dark, tattered coat.  He walks along quietly, an old man who has watched over them since daylight when the mist hid them all.  Probably he has slept in his clothes.  The lambs look very young.  They have long legs.  They hurry to keep up with the fat, indifferent ewes.”My recollection is that the encomium for this book tends to come from male readers.  I would like to see more reaction and comment from female readers.  Might this book be viewed as sort of a Harlequin romance novel for horny frat boys?  (The cover photograph on this paperback edition furthers this impression.)"}, {"review_sentiment": 4.0, "review_text": "You must read James Salter's \"A Sport and a Pastime.\" While that title may reveal more than the author intends it is best read as an existential epigraph from the Koran. Detailing the fated discoveries and tragedies of a first love affair, complete with spare but graphic sexual descriptions, it is really about how the living of life traps the self-aware. It is, to an extent, liberating as I found myself remembering my own romantic cruelties and realizing that they were, if not common, not unique. His writing is close to poetry which leavens the tragedy one sees coming from early on. Set as a year long love affair in France between a 22y/o dissolute (weren't we all at that age?) American and a 19y/o wise in her innocence (weren't they all at that age?) Frenchwoman we see the characters, and ourselves, as actors in a play we cannot at that early age, understand. And that we continue, to judge from Salter's later writings, to understand the events of our lives only after the fact. A poignant, painful book.G"}, {"review_sentiment": 3.0, "review_text": "I think the translation from French to English makes this difficult to follow the story."}, {"review_sentiment": 1.0, "review_text": "Can't read it."}, {"review_sentiment": 5.0, "review_text": "Great book; caution is Salter's explicit writing describing sex acts. His vivid descriptive narrative about France & the couple's affair is first class."}, {"review_sentiment": 5.0, "review_text": "Truly brilliant."}, {"review_sentiment": 2.0, "review_text": "Salter writes beautiful sentences and controls the rhythm of his prose masterfully. But I'm sorry to report that I disliked A Sport and a Pastime. The romantic lead is a spoiled, shiftless, wealthy narcissist Yale dropout at loose in the French countryside, and the narrator (who describes/imagines his friend's affair with a young French girl) is a milktoast who fancies himself a photographer and also doesn't work. The car the romantic lead drives is more fully characterized than the object of his desire; women in this world are just there to sleep with (or marry). And Blacks in his world are there to be exoticized. Both are described in stereotypical terms--her behind like two halves of an apple, the white teeth of the African-American soldier in a French nightclub. Isn't 1965--when this book was written--too late in the game even for an old (now dead) white man to be unapologetically trotting out those images? (And I must say, Salter is far too good a stylist to rely on tired language.) The bulk of the story follows (through the narrator's imaginings) the young couple as they go from one town to another and one hotel to another and have sex... and I do mean to another and another and another. It's boring. It's predictable. Nothing happens. The sex scenes are tame. Oh, mon dieu, they have anal sex! Dis donc, alors! The descriptions of France in a certain era are quite lovely and evocative, but I found this novel to be a poor cross between Fitzgerald and Hemingway (and I confess that last time I read The Great Gatsby, I didn't like it, either.)"}]}, "authors": ["James Salter"], "isbn": "0374530505", "longitude": 5.0414701, "periods": ["1900s"], "title": "A Sport and a Pastime", "word_cloud": "favorite love write inspired writer write courage true life experience vision wonderful write little slow move not much plot bore finish other author hail writer writer live claim knock notably exemplary bandwagon often cause recall pleasure cheesy international bestseller see writer writer see writer need editor write slow corner try plaque write try still come sentence fine child playing fountains become old men nothing heel come paragraph edge town sheep large flock black dog lean endlessly circle move seem carve flock curve mold never hear bark bleat carry faintly still air front old ram limp sun warm sheep move current stream edge cling center continually flow pattern always change segment seem vanish farther appear sheep hesitate clog lamb already bear hurry mother then quite mysteriously entire flock stop slowly begin animal graze dog linger moment see shepherd dark tattered coat walk along quietly old man watch daylight mist hid sleep clothe lamb look young long leg hurry fat indifferent recollection encomium tend come male reader reaction comment female reader view sort romance horny frat boys cover photograph paperback edition furthers impression title author intend best existential epigraph fat discovery tragedy first love affair complete spare graphic sexual description really live life trap extent liberate find remember romantic cruelty realize common unique write close poetry leaven tragedy see come early year long love affair dissolute age american wise innocence age see character actor play early age understand judge later writing understand event live fact poignant painful think translation french make difficult follow story ca caution explicit write describe sex act vivid descriptive narrative couple affair first class truly brilliant write beautiful sentence control rhythm prose masterfully sorry report dislike romantic lead spoil shiftless wealthy narcissist dropout loose french countryside narrator friend affair young french girl milk toast fancy photographer also work car romantic lead drive fully characterize object desire woman world sleep marry world exoticized described stereotypical term half apple white teeth soldier french nightclub be write late game even old dead white man unapologetic ally trotting image far good stylist rely tired language bulk story follow narrator imaginings young couple go town hotel sex mean bore predictable nothing happen sex scene tame mon die anal sex don aloe description certain era quite lovely evocative find poor cross confess last time like", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Twenty-year-old Yale dropout Phillip Dean is traveling Europe aimlessly in a borrowed car with little money. When he stops for a few days in a church-quiet town near Dijon, he meets Anne-Marie Costallat, a young shop assistant. The two begin an affair both carnal and innocent, and she quickly becomes to him the real France, its beating heart and an object of pure longing.\r\n \r\nJames Salter, author of Light Years and the memoir Burning the Days, was an essential voice in the evolution of late twentieth-century prose, a stylist on par with Updike and Roth who won the PEN/Faulkner Award for his collection Dusk and Other Stories. One of the first great American novels to speak frankly of human desire free of guilt and shame, A Sport and a Pastime inspired Reynolds Price to call it “as nearly perfect as any American fiction I know.”\r\n\r\n\"The astonishing novel and “tour de force” about a love affair in postwar France from the iconic author of All That Is.\" The New York Times", "asin": "0374530505", "rank": "54400", "city": "Dijon", "image": "https://images-na.ssl-images-amazon.com/images/I/51bgaquxToL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}