{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 21.015851, "ratings": {"num_ratings": 8, "rating": 3.0, "reviews": [{"review_sentiment": 1.0, "review_text": "This book was so incest and weird. I have never disliked a book so much in my life. If it wasn't for my professor having it in the syllabus I would have never read it."}, {"review_sentiment": 1.0, "review_text": "The book is awful and boring. You spend the first 30 pages reading about generations of family that die and aren't important to the rest of the story.The main character, Jaime, is a conflicted rich Spanish kid who is totally self-absorbed and masturbates in front of a statue of Jesus on the cross in church, runs out to the desert to flagellate himself, sleeps with a prostitute, and then kills his own cat for no reason by smashing in its head with a rock and then suffocating it.Jaime's big dilemma is how to grow up to not become a callous hypocrite like those around him. By the end of the book his decision is to embrace being a callous hypocrite and to write-off those in the world who truly suffer as deserving it and being hopeless cases who he shouldn't care about.I'm really glad this book wasn't that lengthy because it was a waste of time. If it wasn't required reading for my class I wouldn't have ever gotten through it."}, {"review_sentiment": 5.0, "review_text": "it's got masturbation in church and masturbation in other public areas. along with killing of cats and dreams. What the hell are you still reading this review for, you should have either 1) left or 2) bought it for whatever class you need it for."}, {"review_sentiment": 5.0, "review_text": "Facinating to read  of the changes in the social and mental development of the main character being influenced by family, friends, religion and strangers as he matured.."}, {"review_sentiment": 2.0, "review_text": "This book was part of a non-western history series I was required to read for university. Though it gave unique and valuable insight into Mexican and Latino culture, it just wasn't something I would read again, or for my own entertainment."}, {"review_sentiment": 5.0, "review_text": "I first read this in college and identified with the idealism of the principal character.  Also visited Guanajuato, Mexico around that time which made the book even more relatable. This is my favorite Fuentes book."}, {"review_sentiment": 4.0, "review_text": "The Good Conscience is about a young man who grows up in Guanajuato, Mexico.  He is raised by his uncle and aunt, who are unable to have children of their own.  His uncle is a wealthy but very selfish man, who loves only himself and his high social standing.  The boy is encouraged to conform in every way to the family's expectations.  The uncle, aunt, and others insist that the boy be religious, but when he takes a strong interest in Christlike behavior, his uncle admonishes him.  When the main character becomes friends with a poor, dark-skinned boy, his uncle and aunt criticise him for hanging out with people of no standing.  As the young man's childhood is coming to an end, his Indian friend moves away to seek work.  Then the boy must decide for himself whether he is to be like the hypocritical adults, or live his life with integrity."}, {"review_sentiment": 4.0, "review_text": "This is an excellent novel written by Carlos Fuentes that describes a struggle between self-integrity and self-interest."}]}, "authors": ["Carlos Fuentes"], "isbn": "0374507368", "longitude": -101.2528698, "periods": ["1900s"], "title": "The Good Conscience", "word_cloud": "incest weird never dislike much life professor syllabus never awful boring spend first page read generation family die important rest main character conflict rich spanish kid totally masturbate front statue cross church run desert flagellate sleep prostitute kill cat reason smash head rock suffocate big dilemma grow become callous hypocrite end decision embrace callous hypocrite world truly suffer deserve hopeless case care really glad lengthy waste time require reading class ever get masturbation church masturbation public area kill cat dream hell still read review leave buy class need fascinate change social mental development main character influence family friend religion stranger part history series require university give unique valuable insight culture something entertainment first college identify idealism principal character also visit time make even favorite fuentes young man grow raise uncle aunt unable child uncle wealthy selfish man love high social stand boy encourage conform way family expectation uncle aunt others insist boy religious take strong interest behavior uncle admonishes main character become friend poor boy uncle aunt criticism hang people stand young man childhood come end indian friend move away seek work then like hypocritical adult live life integrity excellent write describe struggle", "genres": ["Fiction & Literature"], "summary": "The Good Conscience is Carlos Fuentes's second novel. The scene is Guanajuato, a provincial capital in Central Mexico, once one of the world's richest mining centers. The Ceballos family has been reinstated to power, and adolescent Jaime Ceballos, its only heir, is torn between the practical reality of his family's life and the idealism of his youth and his Catholic education. His father is a good man but weak; his uncle is powerful, yet his actions are inconsistent with his professed beliefs. \r\n\r\nJaime's struggle to emerge as a man with a \"good conscience\" forms the theme of the book: can a rebel correct the evils of an established system and at the same time retain the integrity of his principles?", "asin": "0374507368", "rank": "226695", "city": "Guanajuato City", "image": "https://images-na.ssl-images-amazon.com/images/I/51RAzwlUHdL.jpg", "country": "Mexico", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}