{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 84, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book. As promised. Thx"}, {"review_sentiment": 5.0, "review_text": "I learned so much from reading this book. My own city is growing, and while it's still a terrific place to live, it seems headed in the wrong direction. This book goes into great detail about the elements that make a city or town feel like a real community. Now I have some concrete ideas to take to the City Council. Thank you Charles Montgomery!I hope an updated edition is in the works (with an index, please!)"}, {"review_sentiment": 5.0, "review_text": "This book was a chaning experience for me. It altered how I looked at my city, my neighborhood, and stores. The message here was really powerful. I accendentally read this around the time I read Antifragile by Talib, the two over lap in the areas of the city and how to grow best. This book is also a great primer for urban design, bike commuting, and civic involvement. I think everyone should read it and I recommend it constantly."}, {"review_sentiment": 5.0, "review_text": "A very good community planning book."}, {"review_sentiment": 5.0, "review_text": "You have to read this so you can discover the city you didn't know you must have.  Cities, as currently designed, cannot survive and we must redesign them so they will work for the people."}, {"review_sentiment": 3.0, "review_text": "Charles Montgomery is a \"Movement\" guy.  He's on board and he wants to bring you on board, too.  So he writes with enthusiasm and spark, which makes this fun to read.The book has lots of great anecdotes about world living patterns, but not much good to say about American living patterns.  People's tastes and preferences change as their lives change.  I just moved away from an unzoned city: Albuquerque, NM.  I loved the strange juxtaposition of high-rent condos with tire shops, and single family houses with strip mall churches, and taco trucks with mansions, but not everybody wants to live that way.  In America, people have a choice about where to live.  They make choices based on their own priorities, not on some expert's top-down plan.Americans tend to revolt against \"expert\" planning.  You see it everywhere.This book isn't as snobbish as most Back-To-The-City-Because-I-Say-So books, but it does not make allowances for the choices people want.  It's easy to praise a little Italian village or a big giant city in a part of the world where people accept those living conditions because they have no choice.  But people choose what works for them.  I have moved eleven times since I graduated college in 1991, at times choosing apartments, at times choosing density, at times choosing suburbs.  And twice I have made what, in retrospect, seems like a bad choice in living spaces.  But I've learned from that how and where I want to live with my family.  That's what everybody does. And when my ageing parents or in-laws need to move next door, I may change again to accommodate new patterns.There isn't a nefarious plot in America to do away with streetcars and build neighborhoods.  Builders respond to incentives, and the dollars in the pockets of consumers are an incentive.  And people can choose the streetcar or subway living pattern, or some other that they prefer.  That's how it should be."}, {"review_sentiment": 5.0, "review_text": "A delightful book about creating environments where people can create communities and thrive together."}, {"review_sentiment": 5.0, "review_text": "Incredibly well written and researched, I was quite inspired by the potential of where I live.This book was first recommended by Mr. Money Mustache, and I am going to buy a few copies for my friends and family."}, {"review_sentiment": 5.0, "review_text": "Absolutely love this book! Fantastic in depth look at how we can build better cities for ourselves and future generations. I would highly recommend it to anyone interested in improving their own lives as well as help build sustainable, happy communities. Great read!"}, {"review_sentiment": 5.0, "review_text": "I loved this book. I read through it on the recommendation of a friend. It helped me re-frame how I think about cities and the way that we move around them. I've been considering for a long time that we dedicate FAR too much land to automobiles (to drive them and, more importantly, to park them). This book explains how we got into that situation and offers some ideas and examples on how we might reverse this trend. It also discusses, in great details (possibly repetitive detail) on the benefits of creating walkable/bikable cities that don't force people to drive everywhere."}]}, "authors": ["Charles Montgomery"], "isbn": "0374534888", "longitude": -123.11554, "periods": ["2000s", "Recent Releases"], "title": "Happy City: Transforming Our Lives Through Urban Design", "word_cloud": "promise th learn much read city grow still terrific place live seem head wrong direction go great detail element make city town feel real community now concrete idea take hope updated edition work index please can experience alter look city neighborhood store message really powerful accidentally time anti fragile lap area city grow best also great primer bike commute civic involvement think everyone recommend constantly good community planning discover city know city currently design survive work people guy board want bring board write enthusiasm spark make fun lot great anecdote world live pattern much good say american living pattern people taste preference change change move away zoned city love strange juxtaposition condo tire shop single family house strip mall church taco truck mansion everybody want live way people choice live make choice base priority expert tend revolt expert planning see snobbish allowance choice people want easy praise little italian village big giant city part world people accept live condition choice people choose work move eleven time graduate college time choose apartment time choose density time choose suburb twice make retrospect seem bad choice living space learn want live family everybody age parent need move next door new nefarious plot away streetcars build neighborhood respond incentive dollar pocket consumer incentive people choose streetcar subway living pattern prefer delightful create environment people create community thrive together incredibly well write research quite inspire potential first recommend go copy friends family absolutely depth look build better city future generation highly anyone interested improving well help sustainable community great love recommendation help think city way move consider long time dedicate much land automobile drive importantly park explain get situation offer idea example trend also discuss great detail possibly repetitive detail benefit create city force people drive everywhere", "genres": ["Urbanism"], "summary": "Happy city is the story of how the solutions to this century's problems lie in unlocking the secrets to great city living this is going to be the century of the city. But what actually makes a good city? why are some cities a joy to live in?\r\n\r\nAs Charles Montgomery reveals, it's not how much money your neighbours earn, or how pleasant the climate is that makes the most difference. Journeying to dozens of cities - from Atlanta to Bogotá to Vancouver - he talks to the new champions of the happy city to explore the urban innovations already transforming people's lives. \r\n\r\nHe meets the visionary Colombian mayor who turned some of the world's most dangerous roads into an urban cycling haven; the danish architect who brought the lessons of medieval tuscan towns to modern-day Copenhagen; and the New York City transport commissioner who turned the gridlock of times square into a place to lounge in the sun. \r\n\r\nDrawing on the lessons from their stories, from brain science, and from the fascinating realm of urban experimentation, happy city offers solutions we can all use to improve our lives and shows that simple changes can make all the difference. \r\n\r\n\"Do we live in neighborhoods that make us happy? That is not a silly question. Montgomery encourages us to ask it without embarrassment, and to think intelligently about the answer.\" The New York Times\r\n", "asin": "0374534888", "rank": "37178", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/51iITt-U2gL.jpg", "country": "Canada", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}