{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 59.9132694, "ratings": {"num_ratings": 480, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "My struggle is, this book. I really really wanted to like it and slogged dutifully thru it till about half way and finally gave up.Karl Ove could really use a good editor, there's nuggets of greatness in here. it just goes up it's own rabbitt hole too often.I'm going to give him a try again, perhaps the Autumn book after I clear my head of this book."}, {"review_sentiment": 5.0, "review_text": "Best book ever"}, {"review_sentiment": 5.0, "review_text": "I read everything by this author. The struggle books don't have to be read in sequence. Such a talented storyteller and now my favorite author"}, {"review_sentiment": 3.0, "review_text": "There are parts of this book that are brilliant and rewarding, but these bits are diluted by too many over long discussions of the most trivial aspects of day-by-day life.  Not sure if I'll continue on to book 2.  The fact that I'm undecided says something about the contagiousness of Knausgaard, in spite of the frustrations that accompany the author's over indulgences."}, {"review_sentiment": 5.0, "review_text": "I absolutely love it! Like others have stated - may not be for everyone. I love the honesty, the humanity and the simple truths spoken. I wanted to read the whole thing in one sitting. I also cannot wait to move to the next in the series! I like how his own flaws and views of others (flaws, urine, cruelty and all) are laid bare. The praise is warranted and deserved."}, {"review_sentiment": 5.0, "review_text": "This book struck me as being internal dialogue in a mix of thought and emotion.  It seems to be a mix of philosophy, psychology, culture, intellect, and a buried sense of compassion.  I loved the complexity and astonishing truthfulness in this self examination of his life and relationships.  Above all, I loved it because it made me think."}, {"review_sentiment": 1.0, "review_text": "Don't make Karl Ove Knaugaard's \"My Struggle\" your struggle too.Standing in a bookstore and having no prior knowledge of its contents, it's easy to open this book up and read the first couple pages and mistakenly think that the book serves some purpose or has some beautiful lessons waiting at the end. It doesn't. It isn't structured, It isn't completely true (from what I understand), and the author admittedly turned out sometimes 50 pages in 24 hour spurts of writing in this \"stream-of-conscious\" nightmare of word vomit. Sure, someone could sift through it to find something honest or true or profound but as far as literary value, I see none. I see an egotistical writer who accumulated a lot of information throughout his life without having the selflessness to put it all together into a cohesive image of humanity."}, {"review_sentiment": 2.0, "review_text": "I found it too wordy, too slow and not arriving anywhere. I'm not interested in continuing with the other books of the series."}, {"review_sentiment": 1.0, "review_text": "I just don't get what is supposed to be so great about this guy. I thought this book was boring, uninspired, unoriginal, and depressing. Maybe it's better in the original Norwegian (I read it in English)."}, {"review_sentiment": 5.0, "review_text": "Knausgaard achieves what all the great literature achieves: he reveals the wonder in the everyday and makes us appreciate the drama in the common and the ordinary.  His books are page turners that make you repeatedly stop and ask, why do I find this so absorbing?  The answer is: because he is making you see with fresh eyes what you have always known to be true."}]}, "authors": ["Karl Ove Knausgaard"], "isbn": "0374534144", "longitude": 10.7391112, "periods": ["2000s", "Recent Releases"], "title": "My Struggle: Book 1", "word_cloud": "struggle really really want slog dutifully thru till way finally give really good editor nugget greatness go rabbit hole go give try perhaps clear head best ever everything author struggle sequence such talented storyteller favorite author part brilliant reward bit dilute many long discussion trivial aspect life not sure continue fact undecided say something contagiousness spite frustration accompany author indulgence absolutely love others state everyone love honesty humanity simple truth speak want whole thing sitting also wait next series flaw view others flaw urine cruelty laid bare praise warrant deserve strike internal dialogue mix think emotion seem mix philosophy psychology culture intellect bury sense compassion love complexity astonish truthfulness self examination life relationship love make think struggle bookstore prior knowledge content easy open first couple page mistakenly think serf purpose beautiful lesson wait end structure completely true understand author admittedly turn sometimes page hour spurt write nightmare word vomit someone something honest true profound far literary value see none see egotistical writer accumulate lot information life selflessness put together cohesive image humanity find wordy slow arrive anywhere interest continue series get suppose great guy think bore uninspired unoriginal depressing maybe better original norwegian english achieve great literature achieve reveals wonder everyday make appreciate drama common ordinary page turner make repeatedly ask find absorb answer make see fresh eye always know true", "genres": ["Fiction & Literature"], "summary": "Almost ten years have passed since Karl Ove Knausgaard's father drank himself to death. Vulnerable and assailed by doubts, he is now embarking on a new novel. With an uncanny eye for detail, Knausgaard breaks down his own life story to its elementary particles, reliving memories, reopening wounds, and examining with candor the turbulence and the epiphanies that emerge from his own experience of fatherhood, the fallout in the wake of his father's death, and his visceral connection to music, art, and literature. \r\n\r\nKarl Ove's dilemmas strike nerves that give us raw glimpses of our particular moment in history as we witness what happens to the sensitive and churning mind of a young man trying- as if his very life depended on it- to find his place in the disjointed world around him. This Proustian masterpiece opens a window into one of the most original minds writing today.\r\n\r\nIntense and vital... The need for totality . . . brings superb, lingering, celestial passages . . .\r\nThe concluding sentences of the book [are] placid, plain, achieved. They have what Walter Benjamin called 'the epic side of truth, wisdom.' James Wood, The New Yorker", "asin": "0374534144", "rank": "15250", "city": "Oslo", "image": "https://images-na.ssl-images-amazon.com/images/I/51M-7O0YiWL.jpg", "country": "Norway", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}