{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 59.3251172, "ratings": {"num_ratings": 175, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "For anyone who ever raised kids, a must read. You can start w this volume"}, {"review_sentiment": 5.0, "review_text": "I am in love with guys writing... he is accurate when he says her writes about nothing... but nothing is so powerful!!!! I think I liked book 1 better, but this one is great!"}, {"review_sentiment": 4.0, "review_text": "I really like it, although at times im starting to get sick of him, but well, thats the point in a way.  Im about to start the third one now... it feels a bit like being in the middle of  race, seeing how far i can get.  It's worth it, because the high moments are truly unique and engrossing."}, {"review_sentiment": 5.0, "review_text": "After two almost 600 page books, need a break from Karl but I know I will order Book 3. You get drawn into his life. And find you want to know more about him and his unique insights."}, {"review_sentiment": 4.0, "review_text": "Knausgard is so difficult to define or review. There's no story arch or anything resembling plot. He's basically asking big questions through the monotony of daily life, which can be a bit boring, but then will save things with profound passages throughout his books. There are times when I would have rated this book as two stars - 15 page descriptions of going to the grocery store can get monotonous, while some of his conversations in the book are heavy into theories and structures of art and literature, with some heavy-handed intellectualism bordering (at least for someone of a non-arts background) on drivel. I actually put this book down for 9 months because I got tired of it. Then I picked it back up and read 150 pages in two days. Some of it is so incredibly good, or heart wrenching, that at times I thought it was the best thing I've ever read. Descriptions of landscapes and nature, or the completely, shockingly honest way he talks about his relationships with his family, make this a worthwhile read. It's challenging at times, but the high points are worth it."}, {"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 5.0, "review_text": "Great book!!"}, {"review_sentiment": 3.0, "review_text": "Have to be in the mood to read it. Well written but a bit sad"}, {"review_sentiment": 5.0, "review_text": "As I progress through the series, the stories and form compile into greater and deeper meaning for me. I look forward to finding how my perception of the themes and meeting of this series change as I continue to book 3 and on, seeing how book 2 shifted my impression of book 1. Few authors have been more disgustingly relatable to me than Knausgaard."}, {"review_sentiment": 3.0, "review_text": "A very detailed continuous flow of a story of someone of my generation with quite a recognizable life. Funny at times to see a mirror. I found it difficult to stay in de story and keep track of time as the detailed accounts about what happens describe situations and then describe situations in that situation and then go back in time describing what happened in the present tense."}]}, "authors": ["Karl Ove Knausgaard"], "isbn": "0374534152", "longitude": 18.0710935, "periods": ["2000s", "Recent Releases"], "title": "My Struggle: Book 2: A Man in Love", "word_cloud": "anyone ever raise kid w volume guy write accurate say write nothing nothing powerful think like better great really time mi start get sick well thatch point way start third feel bit middle race see far worth high moment truly unique engross almost page need break know order get draw life want know unique insight difficult define review story arch anything resemble plot basically ask big question monotony daily life bit boring save thing profound passages time rat star page description go grocery store get monotonous conversation heavy theory structure art literature intellectualism border least someone background drivel actually put month get tired then pick back page day incredibly good heart wrench time think best thing ever landscape nature completely shockingly honest way talk relationships family make worthwhile challenge time high point worth great great mood write bit sad progress series story form compile greater meaning look forward find perception theme meet series change continue see shift impression few author disgustingly repeatable detailed continuous flow story someone generation quite recognizable life time see mirror find difficult stay story track time detailed account happen describe situation describe situation situation go back time describing happen present tense", "genres": ["Fiction & Literature"], "summary": "Book Two of the six-volume literary masterwork My Struggle flows with the same raw energy and candor that ignited the series’ unprecedented bestselling run in Scandinavia, a virulent controversy, and an avalanche of literary awards. Knausgaard breaks down lived experience into its elementary particles, revealing the wounds and epiphanies of a truly examined life. \r\n\r\nWalking away from everything he knows in Bergen, Karl Ove finds himself in Stockholm, where he waits for the next stretch of the road to reveal itself. He strikes up a deep friendship with another exiled Norwegian, a boxing fanatic and intellectual named Geir. He reconnects with Linda, a vibrant poet who had captivated him at a writers’ workshop years earlier, and the shape of his world changes. \r\n\r\nBook Two exposes the inner landscape of a man falling in love and the fraught joys and impossible predicaments he faces as a new father. We look on as he watches his life unfold. Love, rage, and beauty flood these pages. \r\n\r\nKnausgaard writes with exhilarating honesty and insight about the collection of moments that make up a life – the life of someone with an irrepressible need to write, of someone for whom art and the natural world are physical needs, of someone for whom death is always standing in the corner, of someone who craves solitude and love from the depths of his being.", "asin": "0374534152", "rank": "51009", "city": "Stockholm", "image": "https://images-na.ssl-images-amazon.com/images/I/51bp6geYqfL.jpg", "country": "Sweden", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}