{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "An engaging read. Brought up all sorts of questions in regard to wealth that is easily earned; paranoia, envy, entitlement...an enthralling look at early megalomania\"....he would walk along.......always, forever wrapped in that veil through which everything appeared to be something else than what it was, something else and something better......Of the people who saw him and stopped on the street or leaned from windows, many momentarily suspended their sad or troubled thoughts, their preoccupations of the day, their worries, their resentments, this one a debt, that one an illness, disappointed love, a friend's treachery.  Every unhappiness was forgotten.  Better forgetfulness than consolation; but the forgetfulness was over in a flash...\""}, {"review_sentiment": 5.0, "review_text": "i just love Machado de Assis. I stumbled across him on a bookshelf while subletting an apartment. He needs to join everyone's canon. (I'd say read \"The Posthumous Memoirs of Bras Cubas\" a.k.a. \"The Epitaph of a Small Winner\" first.. ). Machado is awesome. I tried to name my first born \"Bras\" but his mother wasn't having it -- obviously I'm not a \"small winner\" myself (luckily I am a bigger one -- as my little \"Bras\" is a joy). Philosopher or Dog is superb. The man is genius."}]}, "authors": ["Machado de Assis"], "isbn": "0374523282", "longitude": 0.0, "periods": ["1800s"], "title": "Philosopher or Dog?", "word_cloud": "engage sort question regard wealth easily earn paranoia envy entitlement enthral look early megalomania forever wrap everything appear something else something else something better people saw stopped street lean window many momentarily suspend sad troubled thought preoccupation day worry resentments debt illness disappoint friend treachery unhappiness forgotten forgetfulness consolation forgetfulness flash stumble bookshelf sublet apartment need join everyone canon say awesome try name first bear obviously small winner luckily bigger little joy superb man genius", "genres": ["Fiction & Literature"], "summary": "Originally published in 1891, the story of a man who inherits a fortune and a dog, before leaving the countryside for Rio de Janeiro, the capital of imperial Brazil.\r\n\r\nThe rich and eccentric philosopher Quincas Borbas names his dog after himself because he knows his pet will outlive him. Quincas does die first, leaving his fortune to his friend Rube provided that he takes care for the dog. The dim-witted friend is hardly prepared for the life that awaits him.", "asin": "0374523282", "rank": "919597", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/41OeOssCN7L.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}