{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 175, "rating": 4.3, "reviews": [{"review_sentiment": 1.0, "review_text": "Diane Keaton clearly has not done her homework prior to doing this audio book.I sure hope that's the reason. I am a big fan of audio books, and have to say, her presentation is so  lame, it almost makes me think she was doing it for a Woody Allen comedy"}, {"review_sentiment": 5.0, "review_text": "Genius. This book, even now, is moving and surprising. I hung on every word. I learned things from it I should have learned 30 years ago. She figured it out."}, {"review_sentiment": 5.0, "review_text": "Love everything by Joan Didion, and this is no exception."}, {"review_sentiment": 5.0, "review_text": "Didion made me homesick for California and my youth, and I loved it."}, {"review_sentiment": 5.0, "review_text": "An absolute classic! Great writing, great stories - definite period piece overall, and wonderful window into California in early and mid-60s, but some stories are timeless, too. She continues to be an inspiration today so it's great to go back her early writing."}, {"review_sentiment": 5.0, "review_text": "Captured the 1960s and the issues of 30s womanhood to a tee.  A great non-fiction palate cleanser from popular fiction."}, {"review_sentiment": 4.0, "review_text": "Joan Didion has a fine command of English and a unique point of view. Rewarding reading."}, {"review_sentiment": 5.0, "review_text": "Didion’s book Slouching Towards Bethlehem is a marvel. I lavished in her wonderful descriptions even as I sat jealous that I couldn’t construct such beautiful and expressive sentences. They say “be specific” when you write, a suspiciously generic recommendation, but Didion shows us how. “Alcatraz island is covered with flowers now: orange and yellow nasturtiums, geraniums, sweet grass, blue  iris, black-eyed Susans, Candytuft spring up through the cracked concrete in the exercise yard. Ice plant carpets the rusting catwalks, ‘Warning! Keep off! Us Property,’ the sign still reads, big and yellow and visible for perhaps a quarter of a mile…”Her observations are unblinking even in the face of the horrible, as evidenced by her trip to San Francisco’s drug scene. “When I finally find Otto he says ‘I got something at my place that’ll blow your mind,’ and when we get there I see a child on the living-room floor. She keeps licking her lips in concentration and the only off thing about her is that she’s wearing white lipstick. ‘Five years old,’ Otto says. “On acid.’ “ The five-year-old’s name is Susan, and she tells me she is in High Kindergarten. She lives with her mother and some other people, just got over the measles, wants a bicycle for Christmas, and particularly likes Coca-cola, ice cream, Marty in the Jefferson Airplane, Bob in the Grateful Dead, and the beach. She remembers going to the beach once a long time ago, and wishes she had taken a bucket. For a year now her mother has given her both acid and peyote. Susan describes it as getting stoned.”Essays “On Self-Respect” and “On Morality” are two of my favorite pieces in the collection, not because they are better composed than the others (they are not), but because Didion takes subjects that are nebulous and fluid, and she makes them concrete and visceral. Written in 1965, one cannot help but connect “On Morality” to the Vietnam war, yet reading it today gives one pause for every moralistic crusade we’ve embarked upon, whether it be personal, or national. This is the very definition of timeless writing.I’m now putting other works by Didion in my slush pile. I can only hope they bring the joy that this work did."}, {"review_sentiment": 5.0, "review_text": "You won’t find out here.Joan Didion is a glorious writer the way Edward Hopper is a glorious painter. Fascinating, plumb narratives of spare light, empty space and sole moments. Be sure you won’t run out of antidepressants before you finish."}, {"review_sentiment": 5.0, "review_text": "Good read. I didn't appreciate it fully though. Some parts lost on me. Some essays I didn't quite understand the message."}]}, "authors": ["Joan Didion"], "isbn": "0374531382", "longitude": -122.4192363, "periods": ["1900s"], "title": "Slouching Towards Bethlehem: Essays", "word_cloud": "clearly do homework prior audio sure hope reason big fan audio say presentation lame almost make think comedy genius even move surprise hang word learn thing learn year figure everything exception dijon make homesick youth love absolute classic write great story definite period overall wonderful window early story continue inspiration today great back early writing issue womanhood tee great palate cleanser popular fiction fine command unique point view reward reading dijon marvel lavish wonderful description even sit jealous construct beautiful expressive sentence say specific write suspiciously generic recommendation dijon show island cover flower orange yellow nasturtium geraniums sweet grass blue iris spring crack concrete exercise yard plant carpet rust catwalk warn sign still read big yellow visible perhaps quarter observation unblinking even face horrible evidenced trip drug scene finally find say get something place blow mind get see child floor keep lick lip concentration thing wear white lipstick year old say name tell live mother people get measles want bicycle particularly like ice cream beach remember go long time wish take bucket year mother give acid peyote describe get favorite piece collection better compose others take subject nebulous fluid make concrete visceral help war yet read today give pause moralistic crusade embark personal national definition timeless put work slush pile hope bring joy work find glorious writer way glorious painter plumb narrative spare light empty space sole moment sure run antidepressant good appreciate fully part lose quite understand message", "genres": ["Essay"], "summary": "The first nonfiction work by one of the most distinctive prose stylists of our era, Slouching Towards Bethlehem remains, forty years after its first publication, the essential portrait of America― particularly California―in the sixties. \r\n\r\nIt focuses on such subjects as John Wayne and Howard Hughes, growing up a girl in California, ruminating on the nature of good and evil in a Death Valley motel room, and, especially, the essence of San Francisco's Haight-Ashbury, the heart of the counterculture.\r\n\r\n“In her portraits of people, Didion is not out to expose but to understand, and she shows us actors and millionaires, doomed brides and naive acid-trippers, left wing ideologues and snobs of the Hawaiian aristocracy in a way that makes them neither villainous nor glamorous, but alive and botched and often mournfully beautiful . . . A rich display of some of the best prose written today in this country.” The New York Times ", "asin": "0374531382", "rank": "1832", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/41ULaIpZwsL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}