{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 52.2319237, "ratings": {"num_ratings": 18, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Loved it. Very interesting and different and very wise. Isaac Bashevis Singer is a great writer."}, {"review_sentiment": 5.0, "review_text": "Singer é espetacular!"}, {"review_sentiment": 2.0, "review_text": "some what interesting at 1st.  Then mundane, boring"}, {"review_sentiment": 5.0, "review_text": "Anything written by Isaac Bashevis Singer is worth reading."}, {"review_sentiment": 5.0, "review_text": "A good book group choice. The characters and the setting in eastern Europe in the 19th century will be new subjects for most readers. They were for me. My group talked about the book with enthusiasm and not a little dismay at the choices the main character made. Could this have happened? Who knows? I recommend reading this book. It will be a new discovery of the Old World."}, {"review_sentiment": 5.0, "review_text": "Gives a good introduction to the recent past of Poland/Lublin"}, {"review_sentiment": 4.0, "review_text": "classic"}, {"review_sentiment": 5.0, "review_text": "More great Singer stories."}, {"review_sentiment": 1.0, "review_text": "The movie was much better."}, {"review_sentiment": 4.0, "review_text": "\"The Magician of Lublin\" is a simple morality tale. Yasha is a magician who performs magic shows throughout Poland.  He himself is a rationalist on the borderline of being an atheist. His wife, on the other hand, is a believing and practicing Jew who lives strictly according to Jewish law. Yasha is a serial adulterer who has a mistress in every city where his job as a magician takes him to.The story starts when Yasha goes to Warsaw on a tour. This journey is a metaphor to the spiritual journey that Yasha embarks on and, as the journey advances, and after a few shattering episodes, he finally decides to change his life up-side down and abandon his former self. As in his other books, the \"The Magician of Lublin\" also primarily deals with a person's self-revelation, rationality and religion, and the relationship between God and man. From the little I know of Yiddish (my Grandfather always said that Yiddish has the juiciest descriptions and curses), it is a fairly hard language to translate, and some of its idioms are impossible to translate.  Having said that, I think the translator did a fine job. \"The Magician of Lublin\" is an absorbing and readable novel, yet because of having just read \"The Slave\", comparisons between the two are inevitable. In my opinion, \"The Magician of Lublin\" fails to compete with \"The Slave\" (also written by Isaac Bashevis Singer) in almost every aspect. \"The Slave\" is more readable, absorbing, interesting and, at the end, just better. This doesn't mean \"The Magician of Lublin\" is horrible. On the contrary, it is an excellent book, but when comparing it to \"The Slave\", it will have to settle for second place."}]}, "authors": ["Isaac Bashevis Singer"], "isbn": "0374532540", "longitude": 21.0067265, "periods": ["1800s"], "title": "The Magician of Lublin", "word_cloud": "love very interesting different wise great writer spectacular interest then mundane boring anything write read good group choice character set eastern century new subject reader group talk enthusiasm little dismay choice main character make happen know recommend read new discovery give good introduction recent past classic more great story movie much better simple morality tale performs magic show rationalist borderline wife hand believe practice live strictly accord jewish law serial adulterer mistress city job take story start go tour journey metaphor spiritual journey embark journey advance shatter episode finally decide change life former self also primarily deal person rationality religion relationship man little know yiddish always say yiddish juiciest description curse fairly hard language translate idiom impossible translate say think translator fine job absorb readable yet comparison inevitable opinion fail also write almost aspect readable absorb interesting end better mean horrible contrary excellent compare settle second place", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The fiftieth anniversary of a lost classic―a deceptively sophisticated tale of sexual compulsion and one man's flight from love.\r\n\r\nYasha Mazur is a Houdini-like performer whose skill has made him famous throughout eastern Poland. Half Jewish, half Gentile, a freethinker who slips easily between worlds, Yasha has an observant Jewish wife, a Gentile assistant who travels with him, and a mistress in every town. \r\n\r\nFor Yasha is an escape artist not only onstage but in life, a man who lives under the spell of his own hypnotic effect on women. Now, though, his exploits are catching up with him, and he is tempted to make one final escape―from his wife and his homeland and the last tendrils of his father's religion.\r\n\r\nSet in Warsaw and the shtetls of the 1870s―but first published in 1960―Isaac Bashevis Singer's second novel hides a haunting psychological portrait inside a beguiling parable. At its heart, this is a book about the burden of sexual freedom. As such, it belongs on a small shelf with such mid-century classics as Rabbit, Run; The Adventures of Augie March; and The Moviegoer. \r\n\r\nAs Milton Hindus wrote in The New York Times Book Review, \"The pathos of the ending may move the reader to tears, but they are not sentimental tears . . . [Singer] is a writer of far greater than ordinary powers.\"", "asin": "0374532540", "rank": "697537", "city": "Warsaw", "image": "https://images-na.ssl-images-amazon.com/images/I/51Y1PEXKh7L.jpg", "country": "Poland", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}