{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 36, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "AN ALL TIME GREAT MASTERPIECE THE ODYSSEY OF THE NEW WORLD"}, {"review_sentiment": 5.0, "review_text": "Fascinating,  gripping, Homeric in scope"}, {"review_sentiment": 5.0, "review_text": "Amazing, sustained poetic marathon of colonial history"}, {"review_sentiment": 5.0, "review_text": "Speedy and securely packaged shipment. Very pleased. Thank you!"}, {"review_sentiment": 5.0, "review_text": "excellent transition"}, {"review_sentiment": 4.0, "review_text": "Interesting novel, sometimes hard to follow and keep track of who is narrating."}, {"review_sentiment": 5.0, "review_text": "Well it's an amazing book: fun to read and brilliant poetry.Also I got a hard copy when I ordered a paperback, which was a wonderful surprise."}, {"review_sentiment": 5.0, "review_text": "Good read but Walcott is very full of himself."}, {"review_sentiment": 5.0, "review_text": "Walcott is a great poet, here to stay down through the ages.  I cannot say anything in his favor that has not been said about him.  I love Walcott."}, {"review_sentiment": 5.0, "review_text": "It was nice to be able to purchase this a Kindle book, as my daughter needed it right away for a class."}]}, "authors": ["Derek Walcott"], "isbn": "0374523509", "longitude": 0.0, "periods": ["1700s", "1800s", "1900s"], "title": "Omeros", "word_cloud": "fascinate grip scope sustain poetic marathon colonial history securely package shipment very pleased thank excellent transition interest sometimes hard follow track narrating well amaze fun brilliant get hard copy order paperback wonderful surprise good full great poet stay say anything favor say love nice able purchase daughter need right away class", "genres": ["Science Fiction"], "summary": "Derek Walcott's Omeros is a poem in five books, of circular narrative design, titled with the Greek name for Homer, which simultaneously charts two currents of history: the visible history charted in events -- the tribal losses of the American Indian, the tragedy of African enslavement -- and the interior, unwritten epic fashioned from the suffering of the individual in exile.\r\n\r\nAlthough most of the poem is supposed to take place in the late 20th century, there are sections of the poem that take place in other time periods. For instance, there are chapters that take place in the West Indies in the late 18th century (following ancestors of the characters Achille and Plunkett). These passages describe the Battle of the Saintes which took place off the coast of St. Lucia in 1782 and ended with the British fleet, under the command of Admiral George Rodney (who appears in the poem), defeating the French. \r\n\r\nThe plot of Omeros can be divided into three main narrative threads that crisscross throughout the book. The first one follows the Homeric rivalry of Achille and Hector over their love for Helen. There is also a minor character named Philoctete, an injured fisherman, inspired by Homer's Philoctetes. The second thread is the interwoven story of Sergeant Major Plunkett and his wife Maud, who live on the island and must reconcile themselves to the history of British colonization of St. Lucia. The final thread is the autobiographical narrative of Walcott himself.\r\n\r\nWikipedia", "asin": "0374523509", "rank": "101736", "city": "Saint Lucia", "image": "https://images-na.ssl-images-amazon.com/images/I/51iLDzUakaL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}