{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 35, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "A Walk on the Wild Side is quite chaotic, but the writing is sublime right the way through. I had read that he had begun this book as a kind of sequel to an earlier novel, but then gave up on that idea and decided to create a more farcical kind of satire. I hadn't expected to be able to actually see this change of direction in progress. It does feel like Algren began writing one book, a more sympathetic dust bowl novel, akin to Steinbeck, and then decide to switch to an adventure story like a debauched and impoverished Candide. It doesn't seem like he went back and rewrote the early sections of the book to fit with its later style. He just left it as it is. (I don't know if this is the case; it just feels that way.) In a way though, that still kind of fits with the tone of the story. Everyone in this story is flawed through and through. There are few characters, not even Dove Linkhorn whose story it essentially is, who you can genuinely root for, and yet at the same time, you do empathize with these madcap characters. So the flaws and purposelessness of the main characters is reflective of the book as a whole, but the writing alone makes it a real joy to read. It is more of a caricature of Depression-era Americana than an actual story with a plot, but it is so reckless and desperate and warmhearted (despite its bleakness) that it is still hard to put down."}, {"review_sentiment": 1.0, "review_text": "Aargh I can't listen to this. The reader Keeps \"going into character\" which means Hollering in a Squawking fake southern Horrible Voice, same squawk for every character, which makes these disks Impossible to listen to.  Nelson Algren's wonderful writing RUINED by terrible reading. This audio book needs to be rerecorded considering that when someone listens to an audio book they want to relax.I'll have to keep these bk I opened the package so can't return, but will not play again unless I have to keep myself awake, or maybe to get rid of an annoying house guest. HORRIBLE HORRIBLE HORRIBLE"}, {"review_sentiment": 5.0, "review_text": "Algren paints the lower rungs on the ladder during the during the darkest days of the Great Depression as the dark clouds swirl around a coming of age story. The audiobook's actor helps the characters come alive against his flinty backdrop. A powerful story, well told."}, {"review_sentiment": 5.0, "review_text": "A tremendous work. Awesome to read. If you haven't read Algren, your American literature experience is lacking. The edition that I received from Amazon did not have the copyright page, and the introduction was missing. Even with those publisher's mistakes, it is still far above five stars."}, {"review_sentiment": 5.0, "review_text": "A master wordsmith like no other."}, {"review_sentiment": 2.0, "review_text": "Too Dark!Men causing havoc​, the seedy side of life, well described if you like that kind of thing. Matt Love recommended it. Blah, all he ever talks about is himself and other male writers."}, {"review_sentiment": 2.0, "review_text": "I believe this was supposed to be Algren's masterpiece, but don't quote me on that. If you are a Grapes of Wrath fan, this should be on your reading list. Algren was a champion of the poor, the desperate, and the downtrodden; he writes a powerful novel.But me, I'm with Carol Shields. I can grit through miles of despair, but I'm always looking for that alternative hopeful course. Algren, perhaps realistically, doesn't find that brighter path.It's not narrative crumble, but I found it a tough read."}, {"review_sentiment": 4.0, "review_text": "a sensitive and fascinating book about the underbelly of life in the '30's.underbelly not by choice, but by chance."}, {"review_sentiment": 5.0, "review_text": "dated but timeless."}, {"review_sentiment": 1.0, "review_text": "I tried. I was within 100 pages and I just could not finish it. I could not pick it up to finish it. This book is so poetic that I could not connect with the reality of the characters. The tragedy, the poverty, the essential quality of the people just did not come through. I was bored to death. This novel has been compared to the Grapes of Wrath. The Grapes of Wrath is one damn million times better than the Wild Side. I would really like a good novel about hookers, pimps, door to door salesmen, tramps etc. I tried real hard because of the reviews but this ain't it."}]}, "authors": ["Nelson Algren"], "isbn": "0374525323", "longitude": -90.0701156, "periods": ["1900s"], "title": "A Walk on the Wild Side: A Novel", "word_cloud": "quite chaotic writing sublime right way begin kind sequel earlier give idea decide create farcical kind satire expect able actually see change direction progress feel begin write sympathetic dust bowl akin decide switch adventure story debauch impoverished seem go back rewrote early section fit later style leave know case feel way way still kind fit tone story story flaw character even story essentially genuinely root yet time empathize madcap character so flaw purposelessness main character reflective whole write alone make real joy caricature actual story plot reckless desperate warmhearted bleakness still hard put go character mean holler squawk fake southern horrible squawk character make disk impossible listen wonderful writing terrible reading audio need rerecorded consider someone listen audio want keep bk open package play keep awake maybe rid annoy house guest paint lower rung ladder darkest day dark cloud swirl coming age story audio book actor help character come alive flinty backdrop powerful story well tell tremendous work american literature experience lack edition receive copyright page introduction miss even publisher mistake still far star master wordsmith cause seedy side life well describe kind thing recommend ever talk male writer believe suppose quote fan read list champion poor desperate downtrodden write powerful grit mile despair always look alternative hopeful course perhaps realistically find brighter narrative crumble find tough sensitive fascinating underbelly life choice chance date timeless try page poetic reality character tragedy poverty essential quality people come bore death compare damn time better really good hooker pimp door door salesman tramp try real hard review ai", "genres": ["Fiction & Literature"], "summary": "With its depictions of the downtrodden prostitutes, bootleggers, and hustlers of Perdido Street in the old French Quarter of 1930s New Orleans, A Walk in the Wild Side has found a place in the imaginations of all generations since it first appeared. As Algren admitted, the book \"wasn't written until long after it had been walked . . . I found my way to the streets on the other side of the Southern Pacific station, where the big jukes were singing something called 'Walking the Wild Side of Life.' I've stayed pretty much on that side of the curb ever since.\"\r\n\r\nPerhaps the author's own words describe this classic work best: \"The book asks why lost people sometimes develop into greater human beings than those who have never been lost in their whole lives. Why men who have suffered at the hands of other men are the natural believers in humanity, while those whose part has been simply to acquire, to take all and give nothing, are the most contemptuous of mankind.\"", "asin": "0374525323", "rank": "121727", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/41XLw%2BafRXL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}