{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 51.2085526, "ratings": {"num_ratings": 15, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Special and brilliant reconstruction!"}, {"review_sentiment": 4.0, "review_text": "My first Yourcenar novel. I really suck writing reviews. All the good things you like in a novel are here.Good character developmentVivid description of locations and events; its  as if you're right there reallystrong plotthings I didn't likepace is VERY SLOW in the beginning. Very boring."}, {"review_sentiment": 5.0, "review_text": "I read the book in French and in this translation of Grace Frick in close collaboration with the author. As others have written in their reviews, I continue to reread the book periodically, and each time it is painful to put it aside at the end.The English title is actually the title of one of the chapters of the book, while in French the title brings to mind Alchemy which is one of the subjects that come up in the novel, as well as an illustration of the process that the protagonist himself undergoes in his relentless self-examination as he interacts with various elements of his life. But who better than the author herself to choose the title of the translated version?Europe in the 16th century is divided by the iron curtain of religion, Zenon born in the Lowlands, the bastard son of a noble Florentine and a Flemish young woman, is an erudite man, an alchemist philosopher, physician and an inquisitive spirit. He has travelled the world, studied at the Sorbonne and served in the courts of Sweden and the Ottomans, practiced in Basel, while the Lowlands are under Spanish rule and the Inquisition is fervently seeking its victims. In his 6th decade of life, he returns to Bruges under a false name, turns an inherited house into a hospital for poor people where he serves, and embarks on the last phase of his life. In his role of physician, he is an observer, an experimental scientist and a helper without prejudice. He follows Greek thought elaborated by Arab savants and intuits the future advances of the sciences and their mechanical applications, he can also guess the limitations of their overall significance for the overall human enterprise.Throughout the book, the darkness of the times is contrasted by the brilliance of Zenon's mind and the flexibility of his ideas. The nature of man is his main topic of investigation. His own thoughts, feelings, tastes and complex and sometimes contradictory positions are sources for his nuanced conclusions.As a youngster, he had been given a rigorous religious education, his teachers whom he encounters later in life are still proud of his magnificent intellectual abilities, though he has long abandoned the limits they have set for themselves. Is he another hermetic philosopher or a frank atheist? He has the courage of freedom of ambiguity and by force is judged a heretic.Zenon's tragedy finally is the tragedy of a man of his times, strangely not different from ours: the tragedy of an individual life lived with the courage of lucidity in the midst of powerful currents of tyranny, intellectual and spiritual compromise, and cowardice."}, {"review_sentiment": 5.0, "review_text": "A brilliant meditation on Nature, God, morals, culture, behavior and humanity. Set in 16th Century through eyes of a fictionalized character searching for meaning and the answers to the ultimate question of knowledge and existence."}, {"review_sentiment": 5.0, "review_text": "The main character in this novel, Zeno, is a physician, alchemist and philosopher who lives in the 16th century in Europe. This century is marked by extreme religious fanaticism (extermination of the Anabaptists in Münster), natural disasters (the plague) and the advent of many new ideas (Paracelsus, Copernicus), also in sexual matters (more freedom).Zeno is the prototype of the anti-establishment protester who doubts, but who everywhere and openly expresses his views on the existing world order. Because of his outspokenness he is seen as a real danger by the existing politico-religious rulers.His discussions with the masters of the world are crystal clear. Personally, they criticize heavily the existing world order. They see perfectly the huge dichotomy between their worldview and the real world, between the precepts of their religion and the real actions taken by their reigning politico-religious colleagues. But, there is no question of challenging the powers that be; they are in fact the first to profit from them.After a wandering life in Europe, Zeno returns to Bruges, where he is attacked for his assistance to Protestants, his political tracts and a sex scandal in a cloister causing the death of a newborn.PessimismWhile the 'Memoirs of Hadrian' are an expression of the author's serious hope in a political leader (a just and sincere emperor) who is capable to save the world, 'The Abyss' is a fundamentally pessimistic book which paints a world of pure ferocity.This ferocity is a deeply ingrained human instinct, which expresses itself not only in religious dogmatism and fanaticism, but also in political tyranny and war.This book is a long meditation on the sense of life, seeing the true nature of mankind, rampant selfishness and the cowardice of the masters of the world.It is one of the greatest masterpieces of French and world literature.A must read."}, {"review_sentiment": 4.0, "review_text": "I regret - somewhat - that I shall be the first reviewer here to bequeath this meticulously-researched, erudite novel less than five stars.  But I have become increasingly sparing in doling such unreserved accolades out, and have determined that only life-changing masterworks deserve them, such as Yourcenar's Memoirs of Hadrian, to which I gave five stars without hesitation.  It certainly bests any of Amazon's \"Top novels of the year\" which I received in an e-mail today.  Of course, such novels are for the hoi polloi in any event, and I would be unlikely to give more than two stars to any of them.  Also, I couldn't help but notice that all the reviewers here save one are from continental Europe and seem to me to reek not a little of Yourcenar acolyteship, which is all good and well.  It's merely that I approach the book from a, shall we say, less devotional perspective.So, first of all, for the unwary member of aforementioned hoi polloi who might stumble across this review, the book is not for you.  It's for contemplative, philosophic readers who know how to construe Zeno's iterative phrasings in Mediaeval Latin, which I admit I enjoyed doing immensely.  It's for people who can relate intensely to the character Zeno, who feel their alienation from the masses quite sharply and deeply, who disdain the barbarism of the rabble, and who reflect upon the world and their life continuously...and, above all: It is for those who despair.For all the talk of the book's resembling a painting, a Bosch or Brueghel vision of the Lowlands, I found Yourcenar's descriptions rather bland and plodding.  Landscapes are simply not her strong suit.  They evoke no deep emotions in the characters or in the reader.  Also, the narrative is quite disjointed, something Yourcenar goes to great pains to explain in her lengthy Afterword, but which I found unconvincing.The greater part of the book takes part in Zeno's head.  As Zeno himself puts it:\"But the notion of ascension or descent was wrong, for stars burn below as on high; he was neither at the bottom of the gulf nor at its center.  The abyss was both beyond the celestial sphere and within the human skull.\"The final chapter - I must say - is magnificent.  Here Yourcenar rises to the brilliant poetic heights for which she strives - but never quite attains - in the preceding pages.  Never has felo-de-se been described with such grandeur, anguish and humanity.So pronounced is its effect that it made a part of me want to do exactly as Zeno.  It incited a very strong urge in me to end what is, after all, a pointless existence, sub specie aeternitas.But, for the time being, I decided to pen this review instead."}, {"review_sentiment": 5.0, "review_text": "I started reading Yourcenar at 21, and 30 years later, still turn to her for broadening my horizons. History, the art of medicine, and a glimpse into the mind of a \"Citizen of the World\", all written beautifully. Plague, pogrom, and Inquisition are portrayed tenderly, delicately. How I would have loved to have made a journey with Zeno, or M. Yourcenar herself."}, {"review_sentiment": 5.0, "review_text": "An absolutely beautiful study of the world of a sixteenth-century Flemish achemist and the tribulations he eventually suffers. It's pretty scholarly and there are no shenanigans involving the making of gold etc., the usual tropes. It takes its milieu very seriously and though it's very scholarly it in no way fails to involve the reader with the main character's quest for enlightenment. Things do come to a head, plotwise, in that Zeno is eventually persecuted on trumped-up charges of a heretical nature, admittedly, so there is a bit of the conspiracy element but it's not really the focus. Anyway, this is as good as John Banville's best historical novels such as 'Dr Copernicus' and 'Kepler'. The little essay at the back of the U.K. Black Swan edition is a fascinating document of the 60-year on-off piecing-together of what was originally a fragment and an excellent elucidation of how she researched it, what she took from where etc.  'The Abyss' was first published in 1968 and translated by Grace Frick with the author."}, {"review_sentiment": 5.0, "review_text": "Marguerite Yourcenar is one of the towering novelists of the twentieth century, the first woman to be inducted into the French Academy. The Abyss is an essential for any serious library."}, {"review_sentiment": 5.0, "review_text": "The Abyss is a remarkable study of two men in early sixteenth century Europe. One is looking for worldly pleasures, the other for something more serious. It's the latter man, Zeno, who becomes one of the most unusual heroes in modern novels. Yourcenar traces the man's intellectual growth against the background of a Europe whose collective mind was also growing, and shows how a powerful intellect can triumph over bias, superstition, and intolerance. The writing is wonderful, with long sentences that meander over pages the way Zeno wanders through the continent; the characters met along the way are memorable; the philosophical discourses are fascinating. It's not an easy read, but perhaps as worthwhile as any other book published in the last half century."}]}, "authors": ["Marguerite Yourcenar"], "isbn": "0374516669", "longitude": 3.226772, "periods": ["1500s"], "title": "The Abyss", "word_cloud": "special brilliant reconstruction first really suck write review good thing character development vivid description location event right really strong plot things like pace very slow begin very boring french translation close collaboration author others write review continue periodically time painful put aside title actually chapter french title bring mind subject come well illustration process protagonist undergoes relentless interacts various element life better author choose title translate version century divide iron curtain religion bear bastard son noble young woman erudite man alchemist philosopher physician inquisitive spirit travel world study serve court practice spanish rule fervently seek victim decade life return false name turn inherit house hospital poor people serve embarks last phase life role physician experimental scientist helper prejudice follow greek thought elaborate arab savant intuit future advance science mechanical application also guess limitation overall significance overall human darkness time contrast brilliance mind flexibility ideas nature man main topic investigation thought feeling taste complex sometimes contradictory position source nuanced youngster give rigorous religious education teacher encounter later life still proud magnificent intellectual ability long abandon limit set be hermetic philosopher frank atheist courage freedom ambiguity force judge tragedy finally tragedy man time strangely different tragedy individual life live courage lucidity midst powerful current tyranny intellectual spiritual compromise cowardice brilliant meditation morals culture behavior humanity eye fictionalize character search mean answer ultimate question knowledge existence main character physician alchemist philosopher live century century mark extreme religious fanaticism extermination anabaptist natural disaster plague advent many new idea also sexual matter freedom prototype protester doubt everywhere openly express view exist world order outspokenness see real danger exist discussion master world crystal clear heavily exist world order see perfectly huge dichotomy worldview real world precept religion real action take reign colleague question challenge power fact first profit wander life return attack assistance political tract sex scandal cloister cause death hadrian expression author serious hope political leader sincere emperor capable save world fundamentally pessimistic paint world pure ferocity deeply ingrained human instinct express religious dogmatism fanaticism also political tyranny long meditation sense life see true nature mankind rampant selfishness cowardice master greatest masterpiece french world regret somewhat first bequeath erudite le star become increasingly spar doling unreserved accolade determine masterworks give star hesitation certainly best year receive today course novel ho poll oi event unlikely star also reviewer save continental seem reek little acolyte ship good well merely approach le devotional first unwary member aforementioned ho poll oi review contemplative philosophic reader know construe iterative phrasing admit enjoy immensely people relate intensely character feel alienation mass quite sharply deeply disdain barbarism rabble reflect world life continuously resemble paint vision find description rather bland plod simply strong suit evoke deep emotion character also narrative quite disjointed something go great pain explain lengthy find greater part take part head put notion ascension descent wrong star burn high bottom gulf center celestial sphere human skull final chapter magnificent here rise brilliant poetic height strive never quite attain precede page never describe grandeur anguish pronounce effect make part want exactly incite strong urge end pointless existence sub specie time decide pen review instead start read year later still broaden horizon art medicine glimpse mind write beautifully portray tenderly delicately love make journey absolutely beautiful study world chemist tribulation eventually suffer pretty scholarly shenanigans involve make gold usual trope take milieu seriously scholarly way fail involve main character quest enlightenment come head plot wise eventually persecute charge heretical nature admittedly bite conspiracy element really anyway good best historical novel little essay back edition fascinate document originally fragment excellent elucidation research take etc first publish translated author tower novelist twentieth century first woman inducted french essential serious library remarkable study men early sixteenth century look worldly pleasures something serious latter man become unusual hero modern novel trace man intellectual growth collective mind also grow show powerful intellect triumph bias superstition intolerance write wonderful long sentence meander page way wanders continent character meet along way memorable philosophical discourse fascinate easy perhaps publish last half century", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "\"The Abyss is a 1968 novel by the Belgian-French writer Marguerite Yourcenar. Its narrative centers on the life and death of Zeno, a physician, philosopher, scientist and alchemist born in Bruges during the Renaissance era. The book was published in France in 1968 and was met with immediate popular interest as well as critical acclaim, obtaining the Prix Femina with unanimous votes the year of its publication.\" Wikipedia\r\n\r\n\"Marguerite Yourcenar instantly assumes command of our imagination in her novel The Abyss. Almost before we know it, the author establishes a scene (a road in northern France) and time (the second quarter of the sixteenth century), and engages us in the fate of two cousins. The younger, sixteen-year-old Henry Maximilian, has set out to become a soldier and poet; the elder, twenty-two-year-old Zeno, has left a seminary to make himself an alchemist-philosopher. The book reads as if an old map--decorated with walled cities, boats on rivers, castles, people, and animals--had come alive . . . As rich as a tapestry.\" The New Yorker", "asin": "0374516669", "rank": "451458", "city": "Bruges", "image": "https://images-na.ssl-images-amazon.com/images/I/41L2dO9v4NL.jpg", "country": "Belgium", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}