{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 13, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "In \"Mr. Potter\", Jamaica Kincaid examines the life of the subaltern through an allegory of her narrator's father. Mr. Potter, who can neither read nor write, represents different things to the different people in his life, either his employer, his daughter, or others on the island of Antigua. Mr. Potter's experiences reflect the legacy of colonialism while allowing him to exist as an individual. Kincaid's writing uses repetition and stream-of-consciousness to convey her ideas to her readers."}, {"review_sentiment": 5.0, "review_text": "This book is probably not for everyone. It can be appreciated mainly by those who have some experience with, or have at least read about and felt, the grief and tragedy of world history and its effects on individual lives. The book jacket says it is \"A Novel,\" but it is really more of a long prose poem. You don't read it so much as get carried along by it, as an ocean wave carries a body toward the shore."}, {"review_sentiment": 5.0, "review_text": "Jamaica Kincaid's beautiful narrative is something everyone should be aware of. She puts poetry in the voice of the oppressed and makes it a beautiful experience to read about serious, heavy and intriguing themes."}, {"review_sentiment": 1.0, "review_text": "I ordered this book over a month ago and I need it for class. I cannot even give an accurate rating of it because I have not received it. I am thinking to ask for my money back."}, {"review_sentiment": 5.0, "review_text": "This is the most difficult, most pleasurable books I've read. From the first sentence, the first very, very, long sentence, Kincaid holds you in her arms and rocks you, forcing you to listen to the words and rhythms of Antigua.More than prose, this is poetry. You must pay attention to every sentence, every word you will find yourself leafing back to that point where you can hear the echo and the words and feel the meaning--then you begin again.If there is anything disappointing about the book it is the ending. All through the book I felt the power of the writer. Kincaid controls you, the reader, and controls the story with precise words, choice of scene and underwritten reactions. But, in the last few pages, I feel she could have \"gone in for the kill\" and kept that intimacy and vulnerability.The story line can be read in other reviews, and if you haven't yet read Mr. Potter, I don't want to share the ending here. But, I will say that the innocent, vulnerable and intimate connection with \"Mr. Potter\" that the author has throughout the book is grayed in the last chapter.I remember reading a one sentence short story by Kincaid---oh, I wish I could remember the title. It was a series of caveats and instructions from her mother of what a good girl would do. In it, she's sassy, young, and her voice wags. (I've got to find that short story and re-read it.)To me, Jamaica Kincaid is a genius. She forces me to feel, smell, and taste Antigua. She rocks me in the lilt of the island. She forces me to read every word. It truly was the most pleasurable, difficult book I've read."}, {"review_sentiment": 5.0, "review_text": "Jamaica Kincaid's writing talents had propelled her to staff writer at \"The New Yorker\" for years and then to teaching creative writing at Harvard. I have loved all of her books that I've read. \"Mr. Potter\" seems like a departure from her usual style with its mosaic of words, stream-of-consciousness, repetitiveness. Normally, I don't appreciate that type of writing but this I found to be mesmerizing. Not always entertaining  but poetic and brilliant. I loved it. I have so much respect for this woman as a writer."}, {"review_sentiment": 1.0, "review_text": "Kincaid's distinctive style feels flat in this book. The repetitions and revisitings are laboured and the feeling lingers that one is reading a submission from a freshman creative writing program, rather than a work from a talented writer (as her excellent essays reveal her to be). Too often the chance of achieving real affect is lost in favour of maintain the forced technicality of the writing. The attempt to capture a character who exists predominantly in absence is certainly interesting, but this is an unsuccessful novel and often painfully badly written."}, {"review_sentiment": 1.0, "review_text": "This is a book readers are either going to love or hate. If you've read and enjoyed any of Kincaid's previous quasi-autobiographical fiction, such as \"My Brother\" or \"Autobiography of My Mother\", you will probably like this one too. If you like dreamy, hazy, stream-of-conciousness style introspective writing, you may well like this too. I, on the other hand, had never read anything by Kincaid and was simply interested in reading a novel set in Antigua that might provide some kind of window upon the island. Something like Jean Buffong's \"Snowflakes in the Sun\", which revolves around an elderly couple in Grenada and is chock full of stories and local color. Alas, contrary to the book jacket writer's claims, Antigua most definitely does not come alive under the gaze of Mr. Potter. Indeed, the entire book does not contain Mr. Potter's gaze at all, but rather that of one of his adult daughters, who is writing the \"story\". The narrator is Kincaid, who has constructed this book based on the few details she knew about her own absent father. These few details and those additional ones she invents total maybe ten pages worth of prose (Mr. Potter's father is a fisherman, mother commits suicide, he is raised in quasi-servitude in a kind of orphanage, he grows up to be an illiterate taxi driver, he fathers many daughters with different women and fails to acknowledge any of them, he eventually has his own car hire business, he dies), however Kincaid spins this out to almost 200 pages.She does so in the service of attempting to show the course of an unexamined life. The idea that Mr. Potter is unwittingly trapped in his limited existence by the circumstance of his own upbringing and illiteracy (\"And because Mr. Potter could neither read nor write, he could not understand himself\"). However, again, this could have been accomplished in a few pages, and one gets the feeling that the book is more a personal therapeutic project (the narrator hovers between anger at abandonment and understanding) than anything else. Some will find her hyper-stylized prose, which employs heavy doses of repetition, doubling back and forth, restatements, paraphrases, and so on, highly lyrical, poetic, and in the words of one reviewer \"spellbinding\". I, on the other hand, found it to be insufferably calculated, mannered, and ultimately, soporific. Of course, this boils down to a matter of personal preference, but I would highly recommend that one reads an extract before purchasing the book -- had I done that, I certainly would not have gotten it. On the other hand, if you like sentences that run on for an entire page, this is the book for you! A complete disappointment, the most unengaging book I've read this year."}, {"review_sentiment": 5.0, "review_text": "Kincaid's writing style is entirely unique and distinctive.  This book is not just trying to tell a story, it is assigning an identity to people who otherwise would not have one.  The point of this book is to explore and interpret the influence that the past has on the present, both globally and individually. Every literary device Kincaid incorporates into this book is used for a reason, from her repetition of certain phrases to her two page long sentences--it all adds and supports the depth and breadth of the subject she is writing about. With this book Kincaid not only challenges the way we view our lives, history and environment, but the way we view the lives,history and environments of people who are wholly unlike us.  \"Mr. Potter\" is a striking piece of literature."}, {"review_sentiment": 5.0, "review_text": "I enjoyed this novel. It's very realistic, and flows smoothly. Great summer read. Other summer reads recommended are: In-Law Drama and Sunset in St. Tropez. Happy reading!"}]}, "authors": ["Jamaica Kincaid"], "isbn": "0374528748", "longitude": 0.0, "periods": ["1900s"], "title": "Mr. Potter: A Novel", "word_cloud": "examine life subaltern allegory narrator father write represent different thing different people life employer daughter others island experience reflect legacy colonialism allow exist individual writing use repetition convey idea reader probably everyone appreciate mainly experience least felt grief tragedy world history effect individual live jacket say really long prose poem much carry ocean wave carry body shore beautiful narrative something everyone aware put poetry voice oppress make beautiful experience serious heavy intriguing theme order month need class even give accurate rating receive think money back difficult pleasurable from first sentence first long sentence hold arm rock force listen word rhythms prose poetry attention sentence word leaf back point hear echo word mean anything disappointing end felt power writer control control story precise word choice scene underwritten reaction last page feel go kept intimacy story line review yet want share end say innocent vulnerable intimate connection author gray last remember read sentence short story wish series caveats instruction mother good girl sassy young voice wag get find short story genius force feel smell taste rock lilt island force word truly pleasurable difficult write talent propelled staff writer year teach creative write love seem departure usual style mosaic word repetitiveness normally appreciate type writing find mesmerize not always entertain poetic brilliant love much respect woman writer distinctive style feel flat repetition revisiting labor feel lingers read submission freshman creative write program rather work talented writer excellent essay reveal often chance achieve real affect lose favor maintain force technicality write attempt capture character exist predominantly absence certainly interest unsuccessful often painfully badly write readers go love hate enjoy previous fiction probably dreamy hazy style introspective writing well hand never anything simply interested reading set kind window island something revolve elderly couple chock full story local color contrary jacket writer claim definitely come alive gaze indeed entire contain gaze rather adult daughter write story narrator construct base detail know absent father detail additional one invents total maybe ten page worth prose fisherman commits suicide raise kind orphanage grow illiterate taxi driver father many daughter different woman fails acknowledge eventually car hire business die however spin almost service attempt show course examined life idea unwittingly trap limited existence circumstance upbringing illiteracy neither however page get feel personal therapeutic project narrator hovers anger abandonment understand anything else find prose employ heavy dos repetition double back forth restatement paraphrase highly lyrical poetic word reviewer spellbinding hand find insufferably calculate mannered ultimately soporific course boil matter personal preference highly read extract purchasing do certainly hand sentence run entire page complete disappointment engaging year writing style entirely unique distinctive try story assign identity people otherwise point explore interpret influence past present globally individually literary device incorporate use reason repetition certain phrase page long sentence add support depth breadth subject write challenge way view live history environment way view live history environment people wholly strike piece literature enjoy realistic flow smoothly summer other summer read recommend reading", "genres": ["Fiction & Literature"], "summary": "The story of an ordinary man, his century, and his home: \"Kincaid's most poetic and affecting novel to date\" (Robert Antoni, The Washington Post Book World)\r\n\r\nJamaica Kincaid's first obssession, the island of Antigua, comes vibrantly to life under the gaze of Mr. Potter, an illiterate taxi chauffeur who makes his living along the roads that pass through the only towns he has ever seen and the graveyard where he will be buried. The sun shines squarely overhead, the ocean lies on every side, and suppressed passion fills the air.\r\nIgnoring the legacy of his father, a poor fisherman, and his mother, who committed suicide, Mr. Potter struggles to live at ease amid his surroundings: to purchase a car, to have girlfriends, and to shake off the encumbrance of his daughters―one of whom will return to Antigua after he dies and tell his story with equal measures of distance and sympathy.\r\n\r\nIn Mr. Potter, Kincaid breathes life into a figure unlike any other in contemporary fiction, an individual consciousness emerging gloriously out of an unexamined life.", "asin": "B000OI1ADY", "rank": "1408220", "city": "Antigua and Barbuda", "image": "https://images-na.ssl-images-amazon.com/images/I/51vKQoG4IML.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}