{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 26, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "I ran into Waxwings by pure blazing chance while wandering through the library. Raban is a lovely writer, and Waxwings is an empathetically keen commentary on the teetering height of the dot-com era and on the stumbling longings of the human heart.Waxwings takes place in Seattle, where the high-tech population pushes hard against the boundaries of the Northwest wilderness, oblivious to the feral forces displaced. (My sister in nearby Spokane tells of a suburban neighbor who strolled out to fetch the mail, only to discover a hungry-eyed cougar crouched on her front porch, patiently looking out for the next chubby toddler on a slow-movin’ trike to wobble down the sidewalk. This is exactly the frisson Raban catches.) Through stories of a perilously self-absorbed NPR commentator and a desperately resourceful illegal Chinese immigrant, Raban paints a moment in Seattle's history that is compelling from both a cultural and personal perspective. One of Raban's gifts is his ability to walk us along with his characters through understandably chance circumstances. When unforeseen consequences avalanche into the narrative trail, we are as startlingly appalled as his characters. Raban writes with humor, moments of ravishing insight, and a gentleness that holds me as much as his unexpected twists of plot and sympathetically drawn characters. I was sorry I had not found this book when it was written, while I was still coming to terms with the post 9-11 sea change. In the back of my mind, I kept waiting for the raison d’être for the \"Waxwings\" title to appear. When it did, the revelation left me stunned with admiration for this writer's talents.I'll be reading more of Raban."}, {"review_sentiment": 4.0, "review_text": "Found this book wildly interesting considering I've grown up in the Pacific Northwest. Loved the author's occasional snark and witty snips at NW life. Enjoyed the descriptive nature of the writing and found myself vividly picturing the scenes as they came about. Enjoyable read."}, {"review_sentiment": 4.0, "review_text": "Waxwings is set in Seattle in 1999-2000, at the height of the dot-com boom. Beth and Tom are a couple whose marriage is slowly disintegrating. Beth is a writer and editor working for an online real estate company; Tom is a literature professor at the University of Washington (UW). Their four-year-old son Finn figures prominently in the story of Beth and Tom's breakup, an ongoing theme being his misbehavior at preschool and his parents' disagreements about what he should eat or watch on television. Another key figure is Chick, an illegal Chinese immigrant who's trying to save enough money to pay off the debt to the men who brought him to the U.S. His path crosses Tom's when he offers to replace the roof on his Queen Anne Victorian home, using a crew of illegal Mexican immigrants.I was unfamiliar with Mr. Raban's work before reading Waxwings. He's a travel writer and novelist with 18 books to his credit. His writing is very good and the plot drew me along as he developed several subplots. One of the subplots involved a young girl who disappeared from a trail on the same day that Tom was hiking there. After his and Beth's separation he was falling apart, not taking care of himself and smoking. His hike helped him to develop an idea for a new novel, but also put him in the place where a crime was committed, and his disheveled appearance and the fact that he was smoking, made him the most memorable character to everyone hiking that day. He quickly becomes a \"person of interest,\" causing UW to put him on paid leave and his wife to begin to doubt him. As he struggles with this problem as well as his wife's departure and Chick's work on his house, he begins to realize that he can survive these problems and begins to make his way back into a semblance of normalcy.This book is funny and well-written. The main characters: Tom, Beth, Finn, and Chick are well-developed and believable. Seattle and the dot-com boom around the turn of the 21st century are also very well described. The bust that follows the boom is subtly hinted at, and Beth's new financial \"security\" due to her stock options is clearly at risk. Not stated explicitly, her new wealthy status was certainly a factor in her decision to leave Tom. The title of the book refers to a species of birds that light upon a bush or tree and eat everything possible before moving on, paralleling the dot-com boom and its impact on Seattle. The book leaves the reader with a feeling that Tom will survive all of his crises and Chick will flourish; Beth's future is really questionable. Recommended."}, {"review_sentiment": 5.0, "review_text": "Marvelous book set in Seattle that incorporates humor and irony in the tale of characters facing current issue and problems.A professor, his techie wife and precocious son,and the illegal Chinese immigrant who manages to figure out and conquer his new surroundings.  Very good read!  Our book club loved it."}, {"review_sentiment": 5.0, "review_text": "great read"}, {"review_sentiment": 5.0, "review_text": "I picked up this book because I am fascinated by waxwings. I had never seen one before last February, but like the protagonist, I had an encounter with an entire squadron of them as they assaulted some berried bush and made a meal of it, in, of all places, a Target parking lot. It was startling in a way I never thought an encounter with any animal short of a charging Bengal tiger could ever be.A few weeks ago, I was walking through the local library, having grabbed something else off the shelf -- something in science fiction, I think -- when I noticed this book and its title. After a brief glance at the jacket's plugs, I decided to check it out, and I'm glad I did. I can't tell you how disappointed I was initially in discovering that the protag was a self-involved writer who teaches at a blah blah university -- I almost ran away screaming, so often have I run into such plot designs and realities (I taught at several colleges in several English departments with similar slippery and vacant souls as Raban describes, so many of them writers, so many of them \"writing what they know\" which is the life of a novelist trapped in a teaching position and a bad marriage and a poem that should never have been) -- and yet I stayed with this book and was the better for it. It was refreshing and thoughtful and even meaningful in very particular ways. I found myself wondering throughout if the references and allusions weren't a bit thick for the average reader, but I was the better for them, too, having added fatherhood and several other elements (no, I've never travelled in shipping container) found in the text to my own life.This is a writer's book for writers, a reader's book for readers...and it actively avoids becoming too self-conscious or wearingly self-referential. And of course, Chick is the man.  Wah.Really, this is a brilliant piece of writing, right down to the long-awaited appearance of the waxwings themselves.Thank you, Mr. Raban."}, {"review_sentiment": 3.0, "review_text": "JR is a capable travelogue writer.  However this is a novel.  He wrote this as therapy, I feel. The plot is telegraphed and there are no surprises.  A good light read but a somewhat frustrating story."}, {"review_sentiment": 5.0, "review_text": "I was stuck on a 9 hour plane trip and this novel filled the time beautifully. I really enjoyed the descriptions and the characters (and forgot I was on the plane). It's evident Raban has great love for the Pacific Northwest."}, {"review_sentiment": 2.0, "review_text": "I have read virtually all of Raban's books - fiction and non-fiction - and, as his novel \"Foreign Land\" is one of my favorites, I have tended to give him the benefit of the doubt even though much of his work is unimpressive.However, I can't be remotely charitable about this novel which is a lazy, self-indulgent narrative that should never have been published.It is set in Seattle at the turn of the millennium and brings together two immigrants to the US - an illegal Chinese and a legal Englishman.The reader is supposed to believe that, within a few days of his arrival, the Chinese is running a business in which a group of Mexicans carry out repair work on the homes of affluent Americans.While the Chinese is, at least, doing some real work, the Englishman is a useless academic at a minor college contributing nothing to his new homeland.He is quaint as joke Englishman in the US always are. He describes a detective as a \"good egg\", quotes Swift, Shakespeare and all those other old bores and tells his son - called Finn, incidentally - bedtime stories about a nasty character called Mr. Wicked whereas his American wife does not want the boy to eat sweets or watch too much television.Other \"characters\" include an alcoholic English writer who is trying to get our hero's college to pay for him to make a reading tour of the US and a mysterious millionaire Indian business tycoon who is constantly flying and communicates by mobile phones which always break down so our hero never knows what he wants.These - and other characters - flutter in and out with no purpose other than to fill pages.Just to complicate things, the Englishman was actually born in Hungary and speaks to his mother in Hungarian-accented English even though he does not speak Hungarian.He ends up as a suspect in the disappearance of a child although he is just a victim of misunderstandings that are supposed to be funny but are not. He compares himself to characters in Kafka and P.G. Wodehouse, presumably for comic effect.It is hard to believe that someone who could write such a delightful, bittersweet book as \"Foreign Land\" could produce such a lightweight work.It reminds me of Ian McEwan's abyssmal \"Solar\" which has a similar main character and also struggled to be serious and amusing at the same time."}, {"review_sentiment": 5.0, "review_text": "Waxwings by Jonathan Raban succeeds at every level. It's one of the best novels I have ever read. Its apparent simplicity continually reveals and interprets the complex, nuanced relationships we have with identity, individuality, family and aspiration. It's how we manage our inescapable selfishness that seems to count.The principal characters are not Mr and Mrs Average. Tom is a university literature specialist who does regular radio talks. He's also overseeing an unlikely creative writing project for a man with money who is always in the air. Beth, Tom's wife, is a high flier in high tech. She works for a Seattle start-up dot com that's trying to bring navigable reality to an increasingly virtual world. She's the type that gets paid in options, optionally, despite working every minute of her life. Their little boy, Finn, named in recognition of Irish links, survives the careering whirlwind of the parental environment extremely well. It's easy to imagine the organised chaos of their old-style house, no doubt deliberately chosen for something Tom and Beth agreed to label character.Chick is Chinese. At the book's start, he has successfully stowed away in a trans-Pacific container aboard a ship being piloted into dock. Others in the black interior have died en route, the rest captured by immigration officials. But Chick is resourceful and motivated. He survives, a keen if illegal immigrant, prepared to make a life for himself. His pithy existence admits no free time. His devotion to self-advancement is tunnel-vision complete, even if it means occasionally eating out of trash cans.And then there's the apparently peripheral figures - the employer that happily watches his Sino-Mexican gang strip asbestos, the failed English hack who profitably reinvents himself as something hip, the college colleagues intent on asserting status, the dot com employees out for show. They are all superbly portrayed, perhaps with both sympathy and derision. Functional they may be, but they are never less than credible and suggest that each may be worthy of their own novel.Almost as you would expect, Tom and Beth's marriage disintegrates. It kind of flakes at the edges until the centre cannot hold. She buys a new condo, perhaps thus revealing her enduring but unexpressed and suppressed distaste of the old house. She soon has a new nest mate or two. Finn reacts as children do and his sharing out between the less than estranged partners complicates.Tom, of course, falls apart, except in public, as does publicly the house he continues to inhabit. He drinks, takes up smoking, but never seems to miss a meal, especially when Fin is around. He hires Chick, the Chinese immigrant, who is now doing roofing jobs with his own Mexican gang. As a relief from the grind, Tom takes a long, self-absorbed, creative walk, an act that might just have changed everything. We meet a policeman with his own scores to settle with life. The richness of Waxwings' canvas is staggering and thoroughly enriching.But the masterstroke comes at the end and, for the ornithologist, it was there from the start. It relates to the habits of Waxwings. In their own way, all of these characters are passing migrants in the place that sustains them. Beth is part Irish, hence Finn. Tom is English, his family Hungarian refugees. Chick is Chinese. And everyone, individually is bent on stripping as many of life's berries off the tree as they can reach. It's a great study of the self."}]}, "authors": ["Jonathan Raban"], "isbn": "0375709053", "longitude": -122.3300624, "periods": ["1900s", "2000s"], "title": "Waxwings", "word_cloud": "run pure blaze chance wander library lovely writer em pathetically keen commentary teetering height era stumble longing human take place population push hard boundary wilderness oblivious feral force displace sister nearby tell suburban neighbor stroll fetch mail discover cougar crouch front porch patiently look next chubby toddler wobble sidewalk exactly frisson catch story perilously commentator desperately resourceful illegal immigrant paint moment history compel cultural personal perspective gift ability walk character understandably chance circumstance unforeseen consequence avalanche narrative trail startlingly appal character write humor moment ravish insight gentleness hold much unexpected twist plot sympathetically draw character sorry find write still come term post sea change back mind keep wait raisin title appear revelation leave stunned admiration writer read wildly interest consider grow author occasional snark witty snip life descriptive nature write find vividly picture scene come enjoyable set height boom couple marriage slowly disintegrate writer editor work online real estate company literature professor son figure prominently story breakup ongoing theme misbehavior preschool parent disagreements eat watch television key figure illegal chinese immigrant try enough money debt men bring path cross offer roof home use crew illegal unfamiliar work reading travel writer novelist credit write good plot draw along developed several subplots subplots involve young girl disappear trail day hiking separation fall apart take care smoke hike help idea new also put place crime commit disheveled appearance fact smoke make memorable character everyone hike day quickly become person interest cause put pay leave wife begin doubt struggle problem well wife departure work house begin survive problem begin make way back semblance funny main character believable boom turn century also well bust follow boom subtly hint new financial security due stock option clearly risk not state explicitly new wealthy status certainly factor decision leave title refers specie bird light bush tree eat everything possible move paralleling boom impact leaf feel survive crisis flourish future really questionable recommend marvelous set incorporates humor irony tale character face current issue professor techie wife precocious son illegal immigrant manage figure new surroundings very good club love great pick fascinate never see last protagonist encounter entire squadron assault berried bush make meal place target park lot startle way never think encounter animal short charge tiger ever week ago walk local library grab something else shelf something science fiction think notice title brief glance jacket plug decide check glad disappointed initially discover pro tag writer teach blah university almost run scream often run plot design reality teach several college several department similar slippery vacant soul describe many writer many write know life novelist trap teach position bad marriage poem never yet stay better refresh thoughtful even meaningful particular way find wonder reference allusion bite thick average better add fatherhood several element never travel shipping container find text writer writer reader actively become searingly course man brilliant piece write right appearance capable travelogue writer however write therapy feel plot telegraph surprise good light somewhat frustrating story stick hour plane trip fill time beautifully really enjoy description character forget plane evident great love virtually fiction favorites tend give benefit doubt even much work remotely charitable lazy narrative never set turn millennium brings together immigrant u illegal chinese legal suppose day arrival chinese run business group carry repair work home affluent least real work useless academic minor college contribute nothing new quaint joke always describe detective good egg quote old bore tell son call incidentally bedtime story nasty character call wicked whereas american wife want boy eat sweet watch much character include alcoholic writer try hero college pay make read mysterious millionaire indian business tycoon constantly fly communicates mobile phone always break hero never know character flutter purpose fill complicate thing actually bear speaks mother english even speak end suspect disappearance child victim misunderstanding suppose funny compare character presumably comic hard believe someone delightful bittersweet lightweight reminds abyssal similar main character also struggle serious amusing time succeed level best novel ever apparent simplicity continually reveal interprets complex nuanced relationship identity individuality family aspiration manage inescapable selfishness seem principal character university literature specialist regular radio talk also oversee unlikely creative writing project man money always air wife high flier high tech work dot com try bring navigable reality increasingly virtual world type get pay option optionally work minute life little boy name recognition link survive career parental environment extremely well easy imagine organize chaos house doubt deliberately choose something agree label successfully stow container ship pilot dock black interior die route rest capture immigration official resourceful motivate survive keen illegal immigrant prepare make life pithy existence admits free time devotion even mean occasionally eating trash apparently peripheral figure employer happily watch gang strip asbestos fail hack profitably reinvents something hip college colleague intent assert status dot com employee show superbly portray perhaps sympathy derision never le credible suggest marriage disintegrate kind flake edge center buy new condo perhaps thus reveal endure unexpressed suppress distaste old house soon new nest mate reacts child share le estranged partner course fall apart public publicly house continue drink take smoking never seem miss meal especially hire immigrant roofing job gang relief grind take long creative walk act everything meet policeman score settle life richness canvas stagger thoroughly masterstroke come end ornithologist start relate habit way character pass migrant place sustains part hence family refugees everyone individually bent strip many life berry tree reach great study self", "genres": ["Fiction & Literature"], "summary": "Jonathan Raban’s powerful novel is set in Seattle in 1999, at the height of its infatuation with the virtual. It’s a place that attracts immigrants. One of these is Tom Janeway, a bookish Hungarian-born Englishman who makes his living commenting on American mores on NPR. Another, who calls himself Chick, is a frenetically industrious illegal alien from China who makes his living any way he can.\r\n\r\nThrough a series of extraordinary but chillingly plausible events, the paths of these newcomers converge. Tom is uprooted from his marriage and must learn to father his endearing eight-year old son part-time. Chick claws his way up from exploited to exploiter. Meanwhile Seattle is troubled by rioting anarchists, vanishing children, and the discovery of an al-Qaeda operative; it is a city on the brink. Savage and tender, visionary and addictively entertaining, Waxwings is a major achievement.\r\n\r\n\"Jonathan Raban calculates the radius of the Internet bubble with the cool eye of an investor who can spot real value [and] captures this exuberant era with striking efficiency. He prods us to consider that we're living in a period that makes us all somehow foreigners, desperate for residency.\" The Christian Science Monitor", "asin": "0375709053", "rank": "2175317", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/41LceDiDT5L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}