{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.6500335, "ratings": {"num_ratings": 32, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "While doubting Freudian psychology and its techniques, Svevo creates a psychological tour de force in which his main character, Zeno Cossini, reveals his thoughts and life over many years, from the 1870s up to the middle of WW I.  Set in Trieste, then a prosperous Austro-Hungarian port, the novel traces Zeno through his \"own\" writing, from childhood to late middle age.  We learn of his childhood behavior and his weaknesses (especially his inability to stop smoking despite constant declarations throughout his life that \"this would be the last cigarette\")  His world of relationships seems very limited.  He lies constantly, repents, makes foolish mistakes, makes many unfulfilled resolutions.  In short, he's like a lot of us.  He develops a crush on the eldest of four sisters, but she wants nothing to do with him and indeed, he can barely get up the courage to speak with her.  Instead, in some moments of indecision and confusion, he winds up asking one of the younger, less-desirable sisters to marry him, while Guido, a handsome young fellow with a wealthy father in Argentina, marries the eldest.  What are his thoughts on this?  We read them in plenty.  He eventually takes a mistress, but it isn't a very smooth relationship.  His business dealings too are far from smooth or competent and he gets too financially involved with his brother-in-law, the same Guido, who might be seen as an opposite personality of Zeno himself.  Overall, Zeno lacks self-confidence, he's given to making contradictory statements, puts his foot in his mouth regularly, and he is guided in action only by his latest sentiment, which tends to change drastically.  The story closes in a very dark mood, as Italy plunges into its disastrous WW I campaigns.  CONFESSIONS OF ZENO is a brilliant psychological portrait.  There is not very much action and the drama is wholly psychological.  Unless you are intrigued by that sort of novel, you might find this book tedious.  I thought it was amazingly well-constructed and wondered how much of the personality revealed in the pages was Svevo's and how much just the product of a skillful writer."}, {"review_sentiment": 2.0, "review_text": "I tried.  I really tried.  After 200 pages of the protagonist's love affair with his often interminably boring life decisions, without any real development and no plot whatsoever, I reluctantly tossed the book in the donate pile."}, {"review_sentiment": 5.0, "review_text": "I really liked this.  I bought it because I am moving to Trieste for a while and wanted to read Trieste's favorite son's most famous novel.  The novel has been called by some, the greatest comic novel of the 20th century.\"  It made me laugh out loud.  It is at once, a farce and a serious study of human character.  This particular translation was really wonderful.  The translator managed to retain the humor."}, {"review_sentiment": 5.0, "review_text": "A brilliant book, both hysterical and insightful."}, {"review_sentiment": 5.0, "review_text": "This book is one of the greatest works of post-Renaissance Italian literature.  The author was friends with James Joyce and they influenced each other's work, and this is Svevo's masterpiece.  The self-deluding character of Zeno is in some ways comical, in other ways rather sad; he tells himself how good he is, but his life proceeds in ways he does not foresee. Long but wonderful."}, {"review_sentiment": 4.0, "review_text": "After his father's death, Zeno Cosini \"returned to the religion of my childhood and remained there a long time.\" He reflects on the post-mortem conversations he had with him, \"because now he understood everything,\" lies and truths told him by his son. These are \"tender and secret like an illicit love, because with everyone I continued to laugh at all religious practices, while it is true--and I wish to confess it here--that into someone's hands I daily and fervently commended my father's spirit. True religion, indeed, is that which does not have to be avowed in order to provide the solace that at times--if only rarely--you cannot do without.\" (60)This is the type of insight that rewards a patient reader. In this 2001 version, we hear Italo Svevo's most famous character in a tone we can recoginize. Even if it's annoying as well as admirable.Elizabeth Hardwick's preface and William Weaver's translator's introduction enhance the Everyman's edition here. Weaver, always a skilled voice through which many great Italian writers have been channeled, admits that he refused to \"prettify\" the author's prose. \"What could sometimes at first seem flat, unaccented, even opaque was, I realized, an essential part of Zeno's character, like his subtle irony, his cockeyed ratiocination, his quiet humor.\" (xxiii) He writes like a bookkeeper because he is one. So, don't expect high drama.I had tried to finish this years ago in the long-standard version from 1930 translated by Beryl De Zoete. Although, as with his 1898 self-published tale of love and longing, A Man Grows Older, she captures the stolid, methodical tone of Svevo, I found my attention drifting off until I put aside Zeno's tale, halfway. Not a smoker, I failed to be captivated by the narrator's struggles, and I confide that I am no great admirer of psychoanalysis or satires about it. Weaver gets a more spry zing into the voice, and this helps quicken the pace, although it's very methodical and loves to circle about itself.Here are some key excerpts, to give a flavor of Weaver's delivery of Zeno's voice on paper. The novel goes from smoking to his marriage, his affair with sixteen-year-old Carla to his business forays, and winds up with his rejection of psychoanalysis. Throughout, motifs clue us in as to his state of mind.\"My conscience is so delicate that with my present behavior, I was already preparing to attenuate my future remorse.\" (182) He arranges his amours with Carla as the protagonist in the earlier novel cited above does, with painstaking introspection, second-guessing, and considerably more cruelty than one may expect. Those recalling Zeno as a lovable prototype for Leopold Bloom may reflect on this.\"The bestial words we allow to escape us prick the conscience more than the most unspeakable actions our passion inspires.\" (295) There is no overt sex here, but asides to brutality by Zeno conjure up the force of his relations, emotional and physical. Remorse occurs for both characters, but this is couched often in such a complicated one-step-forward, two-steps-back love-hate disaffection that entangles Zeno's wife, her sister, and his brother-in-law from early in the plot. This can get tiresome. Like \"As A Man Grows Older,\" the theme of the saturnine middle-aged man and his girl rambles on.Zeno is markedly jaded. \"I explained the concept of negative value: a woman had that kind of value when a man was calculating how much he'd be willing to pay to send her very far away from himself.\" (230) The plot curdles as WWI approaches Trieste. By the end, this city (which gains not as much description as I expected in his fiction that I have finished) is in flames. His own life seems to break down as apocalypse nears. \"Any effort to give us health is useless.\" (435) So he asserts as he leaves his doctor and faces the fiery front. \"Unlike other sicknesses, life is always fatal. It doesn't tolerate therapies. It would be like stopping the holes that we have in our bodies, believing them wounds. We would die of strangulation the moment we were treated.\" (436) No cures for Zeno."}, {"review_sentiment": 1.0, "review_text": "Bought this for a class and did not care for it."}, {"review_sentiment": 1.0, "review_text": "Another ego-centric ramblings.  Well written but rather insipid protagonist.  Truth be told, the story could not hold my attention.  I quit a third of the way through because I simply didn't care about the people of the lead character or what happened to them."}, {"review_sentiment": 2.0, "review_text": "As obtuse as every.  First tried to read it almost 50 yrs ago.  I didn't succeed then nor did it his time."}, {"review_sentiment": 4.0, "review_text": "I don't read Italian fluently, so I'm not qualified to judge, but I would say that good as Wiliam Weaver's translation is, the older version by Beryl de Zoete is preferable.  Her translation of SENILITA is definitely better than the more recent one by Brombert fille.  I base my judgments entirely on the way the prose flows, so my apologies to more qualified judges who can demonstrate why the newer versions are more accurate, idiomatic, etc.  I do know  that CONFESSIONS OF ZENO is not the best translation of the title, but to change AS A MAN GROWS OLDER to EMILIO'S CARNIVAL, while justified textually, is a blunder, IMHO."}]}, "authors": ["Italo Svevo"], "isbn": "0375727760", "longitude": 13.7706559, "periods": ["1900s"], "title": "Zeno's Conscience", "word_cloud": "doubt freudian psychology technique create psychological tour force main character reveal thought life many year middle set prosperous port trace write childhood late middle age learn childhood behavior weakness especially inability stop smoke constant declaration life last world relationships seem limited lie constantly repents make foolish mistake make many unfulfilled resolution short lot develop crush eldest sister want nothing indeed barely courage speak instead moment indecision confusion wind ask younger sister marry handsome young fellow wealthy father marries eldest plenty eventually take mistress smooth relationship business dealing far smooth competent get financially involved see opposite personality lack give make contradictory statement put foot mouth regularly guide action latest sentiment tend change drastically story close dark mood plunge disastrous campaign brilliant psychological portrait much action drama wholly psychological intrigue sort tedious think amazingly wonder much personality reveal page much product skillful writer try really try page protagonist affair often interminably bore life decision real development plot reluctantly toss donate pile really like buy move want favorite son famous call greatest comic century make loud farce serious study human character particular translation really wonderful translator manage retain humor brilliant hysterical insightful greatest work italian literature author friends influence work masterpiece character way comical way rather sad tell good life proceeds way foresee long wonderful father death return religion childhood remain long time reflect conversation understand everything lie truths tell son tender secret illicit everyone continue laugh religious practice true wish confess someone hand daily fervently commend father spirit religion indeed avow order provide solace time rarely type insight reward patient version hear famous character tone even annoy well preface translator introduction enhance edition always skilled voice many great italian writer channel admits refuse prettify author prose sometimes seem flat unaccented even opaque realize essential part character subtle irony cockeyed ratiocination quiet humor xxiii write expect high try finish year version translate tale love long man grow older capture stolid methodical tone find attention drift put aside tale halfway not fail captivated narrator struggle confide great admirer psychoanalysis satire get spry zing voice help quicken pace methodical love circle key excerpt give flavor delivery voice paper go smoking marriage affair business foray wind rejection psychoanalysis motifs state mind delicate present behavior already prepare attenuate future remorse arrange amour protagonist earlier cite painstaking introspection considerably cruelty recall lovable prototype bestial word allow escape prick unspeakable action passion inspires overt sex aside brutality conjure force relation emotional physical occur character couch often complicate disaffection entangles wife sister early plot get tiresome theme saturnine man girl ramble markedly jade explain concept negative value woman kind value man calculate much willing pay send far away plot curdles approach end city gain much description expect fiction finish flame life seem break apocalypse nears any effort give health useless assert leaf doctor face fiery front sicknesses life always fatal therapy stop hole body believe wound strangulation moment treat cure zeno class care ramblings write rather insipid protagonist tell story attention quit third way simply people lead character happen obtuse try almost yr time italian fluently qualify judge good translation older version preferable translation definitely better recent fill base judgment entirely way prose flow apology qualify judge demonstrate newer version accurate idiomatic etc know best translation title change justify textually blunder", "genres": ["Fiction & Literature", "Humour"], "summary": "Long hailed as a seminal work of modernism in the tradition of Joyce and Kafka, and now available in a supple new English translation, Italo Svevo’s charming and splendidly idiosyncratic novel conducts readers deep into one hilariously hyperactive and endlessly self-deluding mind. \r\n\r\nThe mind in question belongs to Zeno Cosini, a neurotic Italian businessman who is writing his confessions at the behest of his psychiatrist. Here are Zeno’s interminable attempts to quit smoking, his courtship of the beautiful yet unresponsive Ada, his unexpected–and unexpectedly happy–marriage to Ada’s homely sister Augusta, and his affair with a shrill-voiced aspiring singer. \r\n\r\nRelating these misadventures with wry wit and a perspicacity at once unblinking and compassionate, Zeno’s Conscience is a miracle of psychological realism.\r\n\r\n“An excellent new rendering [of a] marvellous and original book.” James Wood, London Review of Books\r\n", "asin": "0375727760", "rank": "333863", "city": "Trieste", "image": "https://images-na.ssl-images-amazon.com/images/I/51hfTshA1vL.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}