{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 321, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "What fun to read!  David Liss has accomplished a wonder.  He makes history come alive to his readers and at the same time he tells a tale of skulduggery and double dealing in the infancy of capitalism.  As a writer his pacing is excellent.  We keep turning the pages wondering who will do what to who next."}, {"review_sentiment": 5.0, "review_text": "This is one of my favorite books.  Fantastic and suspenseful story about the origins of the coffee trade."}, {"review_sentiment": 5.0, "review_text": "very interesting about the birth of the popularity of coffee and its status symbol"}, {"review_sentiment": 4.0, "review_text": "Great book. Good price."}, {"review_sentiment": 3.0, "review_text": "Liss Describes what the modern day Entrepreneur has to go through every other day..."}, {"review_sentiment": 5.0, "review_text": "excellent historical fiction.  fun read.  well developed characters.  I wish the author would write more of this kind of work."}, {"review_sentiment": 5.0, "review_text": "See The Devil's Company"}, {"review_sentiment": 5.0, "review_text": "The Coffee Trader is a fun read. It is fairly predictable but the interactions between the characters is better than some of Liss's other works. It is a reminder of how late capitalism was to take off."}, {"review_sentiment": 4.0, "review_text": "Well written novel of historical fiction. Learned about the beginning of the Coffee trade that I never knew. Generated a good discussion with my book group."}, {"review_sentiment": 3.0, "review_text": "I was dissappointed. I was expecting a much more interesting book about the time period. Instead, it plods on slowly. Not a terrible book, but nowhere near what I was hoping for. I don't think I will be reading any more books by this author if they are all like this."}]}, "authors": ["David Liss"], "isbn": "0375760903", "longitude": 4.8936041, "periods": ["1600s"], "title": "The Coffee Trader", "word_cloud": "fun accomplish wonder make history come alive reader time tell tale skulduggery double deal infancy capitalism writer pace excellent keep turn page wonder next favorite suspenseful story origin trade interest birth popularity status symbol good price modern day go day excellent historical fiction fun well developed character wish author kind work fun fairly predictable interaction character better work late capitalism well write historical fiction learn begin trade never know good discussion group disappoint expect much interesting time period instead plod slowly not terrible nowhere hop think read author", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Amsterdam, 1659: On the world’s first commodities exchange, fortunes are won and lost in an instant. Miguel Lienzo, a sharp-witted trader in the city’s close-knit community of Portuguese Jews, knows this only too well. Once among the city’s most envied merchants, Miguel has suddenly lost everything. Now, impoverished and humiliated, living in his younger brother’s canal-flooded basement, Miguel must find a way to restore his wealth and reputation.\r\n\r\nMiguel enters into a partnership with a seductive Dutchwoman who offers him one last chance at success—a daring plot to corner the market of an astonishing new commodity called “coffee.” To succeed, Miguel must risk everything he values and face a powerful enemy who will stop at nothing to see him ruined. Miguel will learn that among Amsterdam’s ruthless businessmen, betrayal lurks everywhere, and even friends hide secret agendas.", "asin": "0375760903", "rank": "119854", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/51zocsfh19L.jpg", "country": "The Netherlands", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}