{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 1289, "rating": 3.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I was really uncertain what to expect with this book. There seemed to be a lot of strong reactions, both positive and negative. After finishing the book I understand why so many people seem to despise the book, and why others (like myself) love it.Before even reaching the first page of the novel there is an acknowledgment page, well pages. The acknowledgment section is multiple pages of small print ravings. Eggers explains that you are more than welcome to skip this section. I recommend that you do not. It is long, but it is also humorous and will set the tone for the novel yet to come.A Heartbreaking Work of a Staggering Genius is about as pompously and as self-centered as the title suggests. Eggers is a twenty-something year old who not only has to find his own way in life, he is doing so while coming to terms with death and parenting his younger brother. It can be seen as a coming of age novel where the narrator has to figure out how to live with death. Or, maybe it is a novel about death where the living are brought along as side characters. Either way, the book truly is genius.It is also eccentric. If you are looking for a more traditional narrative structure or a more mature and likable main character, then you will probably passionately hate this novel. If you are looking for something that pushes the envelope, that looks at novel writing as an art form and isn't afraid to show the world in all its gory truth then you will probably love this book as much as I do."}, {"review_sentiment": 4.0, "review_text": "It should be a 5 but but it fell apart at the end. I loved/adored the first 3/4's."}, {"review_sentiment": 3.0, "review_text": "After the beginning it really wasn't all that interesting."}, {"review_sentiment": 4.0, "review_text": "I really enjoyed the wild stream of conscious, sometimes manic style and the characters breaking the character to talk to the narrator about his writing and conventions was excellent."}, {"review_sentiment": 1.0, "review_text": "I found this book to be a never ending tale about a mom and dad dying leaving three grown up children and one minor. None of them look after each other. It's horrendously sad and goes on and on without end."}, {"review_sentiment": 5.0, "review_text": "If you can stand it.  Takes a long time to get his style . Makes you think of an author who is so smart that he is crazy like you wish you were."}, {"review_sentiment": 1.0, "review_text": "This might be a great book, I don't know. After several pages of way-too-vivid detail on what his mother was going through, I gave up. I couldn't take it any more.This book might appeal to some readers; unfortunately, I am not among them."}, {"review_sentiment": 4.0, "review_text": "This is my first reading of a Dave Eggers book, and I found it to be quite overwhelming.  For a story about grief and loss and growing up (a little), this is nearly an epic in its sweep of feelings, from acute sadness to amusement to hysterical madness.  His technique of using the ever-present tense certainly keeps the narrative moving along, but I found I had to take frequent breaks just to catch my breath.  There are entire chapters devoted to side topics, often mixing incredible insight with the most trivial garbage - all thrown together, like a random writer's notebooks.  A reader must bring patience and attention to this book, or you'll miss too much.  I'm still trying to decide if I think this is an important literary contribution, or just a quirky one-off semi-biographical piece written to release pent-up emotion.  Read it yourself - then try to decide!"}, {"review_sentiment": 2.0, "review_text": "Was asked to read this book as an assignment. Very much over-rated. Great title and cool artwork on the cover, but I could not finish the book...self-indulgent, unbelievable, and boring."}, {"review_sentiment": 2.0, "review_text": "I appreciated Eggars writing style. It was complex and very different. The book itself though never created much empathy in me despite his tragic circumstances."}]}, "authors": ["Dave Eggers"], "isbn": "0375725784", "longitude": -122.4192363, "periods": ["2000s"], "title": "A Heartbreaking Work of Staggering Genius", "word_cloud": "really uncertain expect seemed lot strong reaction positive negative finish understand many people seem despise others even reach first page acknowledgment page well page acknowledgment section multiple page small print raving explain welcome skip section recommend long also humorous set tone yet pompously title suggest edger year old find way life come term death parenting younger brother see come age narrator figure live death maybe death living bring along side character way truly also eccentric look traditional narrative structure mature likable main character probably passionately look something push envelope look write art form afraid show world gory truth probably love much fell apart end first begin really interesting really enjoy wild stream conscious sometimes manic style character break character talk narrator write convention excellent find never end tale mom dad die leave grown child minor none look horrendously sad go end stand long time style think author smart crazy wish great know several page detail mother go give reader unfortunately first reading find quite overwhelm story grief loss grow little nearly epic sweep feeling acute sadness amusement hysterical madness technique use tense certainly keep narrative move along find take frequent break catch breath entire chapter devote side topic often mix incredible insight trivial garbage throw together like random writer notebooks patience attention miss much still try think important literary contribution quirky piece write release emotion try decide ask assignment very much title cool artwork cover unbelievable boring appreciate write style complex different though never create much empathy tragic circumstance", "genres": ["Memoir", "Fiction & Literature"], "summary": "The literary sensation of the year, a book that redefines both family and narrative for the twenty-first century. A Heartbreaking Work of Staggering Genius is the moving memoir of a college senior who, in the space of five weeks, loses both of his parents to cancer and inherits his eight-year-old brother. Here is an exhilarating debut that manages to be simultaneously hilarious and wildly inventive as well as a deeply heartfelt story of the love that holds a family together.\r\n\r\nA Heartbreaking Work of Staggering Genius is an instant classic that will be read for decades to come.", "asin": "0375725784", "rank": "16374", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51pkYQ-Fk4L.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}