{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -27.4689682, "ratings": {"num_ratings": 11, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "this book is for a class, but I am going to read it again at my leisure because it is terrific"}, {"review_sentiment": 3.0, "review_text": "Read this for Australian Studies class...was OK"}, {"review_sentiment": 3.0, "review_text": "Malouf is one of the top writers in a tradition of great story telling without pinwheels and tricks. I didn't find this collection as compelling as his later work, but it is useful for understanding Malouf's writing career."}, {"review_sentiment": 1.0, "review_text": "Sorry, I realize this writer and this collection has been critically acclaimed, but all I did reading it was yawn and wonder - where is the wonder!  The pace is so slow, and the plots - what plots.  Reads more like a narrative of one of my relatives boring lives.I just don't understand the praise - 5 stars??????"}, {"review_sentiment": 5.0, "review_text": "David Malouf has written books that I return to and return to again for the language that is wonderful and the sense of place - Australia from its settlers' beginnings to modern time - that tells more about the uniqueness of that continent than a thousand pictures. One of the stories in this collection, Jacko's Reach is one of the most beautifully written evocations of the enduring quality of memory and wild places, full of mystery, that I have ever read. These are wonderful stories."}, {"review_sentiment": 4.0, "review_text": "I have read and commented upon seven of the nine novels that David Malouf has written. His novels are not lengthy but they all share the great talent this writer has. \"Dream Stuff\", is a collection of nine short stories that appear together for the first time. Just as he has done many times over with his novels, he presents a series of shorter works that are uniformly very good, and some that are excellent.There are two stories that were of great interest as the Author chose children to narrate the tale. At the age of 9 in, \"Closer\", a young girl is the hostess for the story, and in, \"Blacksoil Country\", our young male guide is but twelve. The choice of youth for narrators was interesting as the stories they shared were those of adult situations, feelings and actions. The word precocious would not accurately measure the insight these children have.All of the stories tend toward the darker spectrums of Human Nature. Even when the tale may just be deeply sad I believe it still shows the more negative aspects of people and Family. There is one story that stands out for its absolute brutality. It is particularly savage as it is unexpected, and random in its violence. Unfortunately it reflects what we too often read of in the news.I highly recommend the work of this Author. I have never picked up one of his works and come away with anything less than great admiration for his skill."}, {"review_sentiment": 5.0, "review_text": "David Malouf is a brilliant writer, as those readers who have digested \"Remebering Babylon\", \"Conversations at Curlew Creek\", etc. can attest.  Too often Malouf is classified as an Australian writer, a limiting category for a man who spends  half his year in Australia ad the other half in Tuscany!  But as far as the content of his works is concerned he references the immense, isolated Australia, a country very much in this century and yet still a part of the Last Frontier image.  In his works he describes characters who somehow reflect that isolation, that pioneer spirit, that insular view of the world.  In DREAM STUFF we are treated to hugely successful small stories that deal with man's tiny speck of space in a universe full of fear and trials.  Malouf is able to completely inhabit the female narrator as in \"Closer\", a tale of Pentecostal dealing (or rather not dealing) with things sensual.  \"Sally's Story\" is the agar plate for a larger novel - a woman who understands that the only way she will experience life outside her cramped environment is to serve as a \"hostess\" to GIs on leave from Vietnam.  In \"Lone Pine\" a couple escapes the secure tenderings of the workaday life in the city only to face nature in all its evil forces: their Idyll becomes the stage for murder by seemingly \"decent folk\".  And on it goes.  Malouf's language is lush while straight forward, his plots are deceptively simple until he leaves us wondering how to finish the dialogue he has started. Another brilliant book from one of the best writers of our time. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "David Malouf's winning of the first IMPAC Dublin award for Remembering Babylon  conferred belated recognition of one of the finest figures in English writing.  His string of  works, both poetry and fiction,  provide the reader with endless opportunities to view life  from many sides.  He has, as this book shows, a particular talent for presenting the world  through children's eyes.Dream Stuff is a collection of short stories mainly centred on how children perceive  themselves.  There are reviewers who claim Malouf paints a \"dark\" world.  This is a false  assessment.  A child's outlook has to contend with a variety of needs, often conflicting ones.  They have the desire to explore, to escape parental restraint, yet bear an underlying need for  security and stability.  Malouf is able to convey these contrary aims in subdued, but effective  portrayals.The stories in this collection point up those conflicts in carefully measured prose.  Throughout  these accounts of childhood, memories form a framework.  A young man coming to grips  with the fact that his missing father is unlikely to return.  A religious clan in a midst of a  family crisis.  A cycle of life from earliest recollections that return to create a reprise of visions  spurred by a bizarre assault and its resolution.As others have indicated, it's the final tale in this set that stands out as a jewel among the  collection.  In this \"Great Day\" of Audrey Tyler's seventy-second birthday, Malouf  demonstrates his matchless skill at presenting his characters.  Moving lightly among them  with accomplished dexterity, he conveys their persona with a admirable economy of words.  Within but a few pages we are given the family history, the depth of feelings and various  levels of personal interaction any writer must envy.  The old man is the pivot of their  existence, a circumstance they all ultimately realize, each in their own fashion.It's amazing to read reviews of this work continually pointing out his Australian roots.  None  of these stories is fixed in place.  Nothing in these stories condemns them to a particular  national framework.  It isn't necessary to know Australian conditions to absorb what these  tales convey.  They are timeless and represent environments any  reader here might  experience.  His view of life is far too wide-ranging to try to limit him in a national  framework.  Malouf has an unmatched ability to transcend age, gender, space and time  frames in presenting these narratives.  His talent should be recognized for that skill.  That  ability is quite sufficient for any reader to enjoy this book."}, {"review_sentiment": 4.0, "review_text": "My favorite Australian writer is David Malouf, and  I recommend  Remembering Babylon, which was shortlisted for the Booker, The Great World,  which is his masterpiece, and Harland's Half-Acre, which is his sleeper.  Dream Stuff is his second collection of short stories (not including Untold  Tales, a tiny collection available from Craftsman House).  I think Malouf  is often best when he has room to be expansive; originally a poet, he is a  master of capturing the intricacies of our emotional lives through mundane  moments.  In some of his short fiction, the dramatic moments can sometimes  be predictable, but his small moments are all fresh, alive with insight  into how human beings live inside themselves and with each other.  Ironically, the most plotty story, the title story, turns out to contradict  this generalization.  Set in modern Brisbane, a land of concrete and  disconnection, a moment of connections ends disastrously.  Any admirer of  Malouf's fiction will enjoy this book tremendously.  If you haven't tried  Malouf's work, start with The Great World, and you will soon end up reading  this book as well."}, {"review_sentiment": 5.0, "review_text": "\"It was another world up there, a place so hidden and old,  so deeply mythologized by the games they played in the twists and turns of its branches, their invented world of tribes and wars and castles, that the  moment you hauled yourself up into its big-leafed light and shade you shook  loose of the actual, were freed of the ground rules and the habits of a  life lived on floorboards and in room\".This could almost be a  metaphor for this book, this tangled world of yellow flowering native  hibiscus into which the boy, Jack, climbs to escape from reality. Another  world does haunt these stories: a timeless, Australian world of peculiar  light, of myth, and of the dark power of the land in which David Malouf's  various characters live. It is so much part of them that they are hardly  conscious of it, but it is this, as much as the ghosts, the strange events  and fantasies, which is the dream stuff of the book's title.Malouf, an  Australian poet who has just been awarded the 2000 Neustadt International  Prize for Literature, came late to prose writing. It took him a long time,  he said in a recent BBC interview, to discover how to make voices work in  prose. But the voices in these stories do work, and they work well. There  are male and female voices, young and old, and time spans a period which  extends from the Second World War to the present. The unifying element  throughout the stories is Australia.The first story is of Jack, an  eleven-year-old boy whose father is missing-in-action in a world war which  seems far distant from the lives of most Australians. Families spend the  long, hot summer holidays in a home-away-from home, camping at the beach.  American service men on leave come and go, filling in as escorts for the  young, lonely women, and children grow from childhood to adolescence.Jack's young mother comes to accept that her husband is dead long before  Jack does, and her life, seen through Jack's eyes, moves on in ways he does  not at first understand. Jack is poised between childhood and the beginning  of adolescence. And Malouf is expert at suggesting Jack's childish need to  keep his world safe and familiar, and the shock of sudden knowledge when he  is confronted with things he already knows but has not been ready to  accept.For Jack, maturity begins during a fierce thunder storm when he  runs for comfort to his mother's bedroom but finds himself, instead,  confronting the reality of her relationship with an American friend, Mitch,  and a ghostly vision of his father.Nine-year-old Amy, in the next  story, 'Closer', is very different to Jack. \"We're Pentecostals\",  she tells us at the start of her narrative. And her language is full of  biblical echoes and meanings, some of which she understands and some which  the reader understands but she does not. This allows Malouf to tell a story  which Amy does not fully comprehend although she is acutely aware of the  emotional tensions which surround it.Amy's Uncle Charles lives in Sodom  (which she tells us is Sydney) and has committed abominations for which he  has been banned from the family farm. In spite of the ban, each Easter and  Christmas he turns up at the farm and gazes at the gathered family from the  far side of the boundary fence before driving off again. Amy's picture of  him, blond, tanned, driving a silver BMW with the number plate GAY 437 is  one of the few false notes in the story, suggesting that Malouf is merely  creating a rather obvious moral parable. But the subtle revelation, through  Amy's naive voice, of the complex and distressing emotional tensions in the  family is far from moralising and is very moving.The hopeful dream  ending of the story, too, suggests, as elsewhere in the book, that Malouf  shares some of the faith that the Pentecostals have in a guiding spirit.  This is never spelled out and is always open to other, realistic meanings -  an offered hand, an image of \"a new day coming\" - but it is  there, balancing the darkness and violence which surfaces in so many of the  stories.A second, more recent, war story concerns Sally, who works as a  \"widow\" - a temporary wife for servicemen on rest and recreation  leave in Sydney from the Vietnam War. Malouf explores the feelings this  young woman has as she provides a substitute home for various young men,  some of whom she becomes emotionally close to, some of whom plan for a  future return, and others who are distant, distracted, boorish and  unpleasant. After acting the part of a wife for so long and for so many  needy men, a return to normal life when the war is over is difficult and  uncertain for her. The story has no clichéd happy ending but realistically  suggests a tentative hope of happiness when Sally meets a man who seems  self-confident and self-sufficient.'Dream stuff', the story which gives  the book its title, is altogether more complex. A writer (who could well be  Malouf, except that Malouf has said that there is no such thing as  autobiographical fiction) returns to his home-town of Brisbane to give a  book-reading. Childhood memories, violent and inexplicable events and a  disturbing dream occur, and are presented in a fragmented sequence of  passages which I found disconnected and puzzling on first reading. But the  BBC interview with Malouf was enlightening. Speaking of what might have  been, he said: \"If you leave a place in your early twenties, you're  always haunted by that other person you might have been. There are always  corners where you stand at seventeen waiting for someone who didn't turn  up\". Memories, fiction, unfinished business and other-peoples' lives,  this is the dream stuff of the story, just as surely as the marijuana grown  and secretly harvested in the huge fabled plantations of local myth.In  all the stories in this book, the inexplicable violence, the seedy  nightlife of Brisbane, the suggestion of some dark, ghostly inheritance  which is barely held in check by a thin veneer of civilisation, all seep in  from the land. It is an \"underground\", an ancient, dark, fecund,  tropical greenery, \"swarming with insects and rotting with a death  that [will] soon once again be life. It is, like the last, threatened  pocket of bush in 'Jacko's Reach', a place of legend and myth, of childhood  exploration and adolescent experiment. And, as in 'Lone Pine', it is the  vast, empty, unforgiving, barely explored expanse of Australia which is  fleetingly traversed by tourists, retirees and adventurers.For anyone  unfamiliar with the Australian bush, all this may seem fanciful. Those who  know it, will recognise it in these stories, just as they will recognise  Malouf' s evocations of Australian life. His people live and speak, dream  and die, in a land which they know, or learn, that they must accept and  co-exist with (just as the Aborigines once did), rather than fight to  control.Dream Stuff, certainly, is the work of a fine story-teller, and  Malouf's characters and their stories are as interesting and as strongly  presented in this book as the land they inhabit.Ann Skea Reviewer"}]}, "authors": ["David Malouf"], "isbn": "0375724494", "longitude": 153.0234991, "periods": ["2000s"], "title": "Dream Stuff: Stories", "word_cloud": "class go leisure terrific class ok top writer tradition great story tell pinwheel trick find collection compelling later work useful understanding write career realize writer collection critically acclaim read yawn wonder wonder pace slow plot plot narrative relatives bore understand praise star write return return language wonderful sense place settler beginning modern time tell uniqueness continent picture collection beautifully write evocation endure quality memory wild place full mystery ever wonderful comment upon novel write novel lengthy share great talent writer collection short appear together first time do many time novel present series shorter work uniformly good great interest choose child narrate tale age young girl hostess story young male guide choice youth narrator interest share adult situation feeling action word precocious accurately insight child tend darker spectrum tale sad believe still show negative aspect people family story stand absolute brutality particularly savage unexpected random violence reflect often highly recommend work never pick work anything le great admiration skill brilliant writer reader digest remember attest too often classify australian writer limit category man spend half year ad half far content work concerned reference immense isolate country much century yet still part last image work describes character somehow reflect isolation pioneer spirit insular view world treat hugely successful small deal man tiny speck space universe full fear trial able completely inhabit female narrator tale deal rather deal thing sensual agar plate larger woman understand way experience life cramp environment serve hostess leave couple escape secure rendering workaday life city face nature evil force become stage murder seemingly decent folk go language lush straight forward plot deceptively simple leaf wonder finish dialogue start brilliant best writer time recommend win first confer belated recognition finest figure english write string work poetry fiction endless opportunity view life many side show particular talent present world child collection short mainly center child perceive reviewer claim paint dark world false assessment child outlook contend variety need often conflict one desire explore escape parental restraint yet bear underlie need security stability able convey contrary aim subdue effective collection point conflict carefully measure prose account childhood memory form framework young man come grip fact miss father unlikely religious clan midst family crisis cycle life earliest recollection return create reprise vision spur bizarre assault others indicate final tale set stand jewel collection birthday demonstrate matchless skill present character move lightly accomplished dexterity conveys persona admirable economy word page give family history depth feeling various level personal interaction writer old man pivot existence circumstance ultimately realize amazing review work continually point australian root none fix place condemn particular national framework necessary know australian condition absorb tale convey timeless represent environment view life far try limit national framework unmatched ability transcend age gender space time frame present narrative talent recognize skill ability quite sufficient enjoy favorite australian writer recommend remember shortlist masterpiece sleeper second collection short include untold tiny collection available think often best room expansive originally poet master capture intricacy emotional life mundane moment short fiction dramatic moment sometimes predictable small moment fresh alive insight human being live potty story title story turn contradict generalization land concrete disconnection moment connection end disastrously any admirer fiction enjoy tremendously try start soon end read well world place hide old deeply mythologize game played twist turn branch invented world tribe war castle moment haul light shade shake loose actual freed ground rule habit life live floorboard room almost tangled world yellow flower native hibiscus boy climb escape reality world haunt australian world peculiar light myth dark power land various character live much part hardly conscious much ghost strange event fantasy stuff australian poet award come late prose write take long time say recent interview discover voice prose voice work work well male female voice young old time span period extends second present unifying element first story boy father world war seem far distant life family spend long hot summer holiday home camp beach american service men leave come go fill escort young lonely woman child grow childhood young mother come accept husband dead long life see eye move way first understand poise childhood begin adolescence expert suggest childish need world safe familiar shock sudden knowledge confront thing already know ready maturity begin fierce thunder storm run comfort mother bedroom find instead confronting reality relationship american friend ghostly vision next story different tell narrative language full biblical echo meaning understand understands allow story fully comprehend acutely aware emotional tension surround live tell commit abomination ban family farm spite ban turn farm gaze gather family far side boundary fence drive picture blond tan drive silver number plate false note story suggest merely create rather obvious moral parable subtle revelation naive voice complex distress emotional tension family far moralize hopeful end story suggest elsewhere share faith pentecostal guide spirit never spell always open realistic meaning offer hand image new day come balance darkness violence surface many second recent war story concern work widow temporary wife serviceman rest recreation leave explore feeling young woman provide substitute home various young men become emotionally close plan future return others distant distract boorish unpleasant act part wife long many needy men return normal life war difficult uncertain story cliched happy end realistically suggest tentative hope happiness meet man seem stuff story give altogether complex writer well say thing autobiographical fiction return give memory violent inexplicable event disturb occur present fragmented sequence passage find disconnect puzzle first reading interview enlighten speak say leave place early twenty always haunt person always corner stand seventeen wait someone turn fiction unfinished business life stuff story surely marijuana grow secretly harvest huge fabled plantation local inexplicable violence seedy nightlife suggestion dark ghostly inheritance barely hold check thin veneer civilization seep land underground ancient dark fecund tropical greenery swarm insect rot death soon life last threatened pocket bush place legend myth childhood exploration adolescent experiment vast empty unforgiving barely explore expanse fleetingly traverse tourist retire anyone unfamiliar australian bush fanciful know recognize recognize evocation australian life people live speak die land know learn rather fight certainly work fine character interest strongly present land", "genres": ["Fiction & Literature"], "summary": "Here are nine haunting stories from the award-winning author of Remembering Babylon, in which history and geography, as well as the past and the present, combine and often collide, illuminating the landscape and revealing the character of Australia.\r\n\r\nAn eleven-year-old boy sees his father in his own elongated shadow only to realize that he will not return from the war. In a parting moment, a young woman hired to “marry” vacationing soldiers, grasps the weight of the word “woe.” When a failing farmer senselessly murders a wandering aborigine, he imperils his son but discovers in the spring of sympathy that follows the power to influence others. Wise and moving, startling and lyrical, Dream Stuff reverberates with the unpredictability of human experience, revealing people who are shaped by the mysterious rhythms of nature as well as the ghosts of their own pasts.", "asin": "0375724494", "rank": "1934602", "city": "Brisbane", "image": "https://images-na.ssl-images-amazon.com/images/I/412ZVH10YAL.jpg", "country": "Australia", "story_arc": ["Tragedy", "Things only get worse"]}