{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 17, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "good read"}, {"review_sentiment": 4.0, "review_text": "Freedom Rising is a good historical telling of what our nation capital was like going through the nations trial by fire, the Civil War."}, {"review_sentiment": 4.0, "review_text": "I found more civil war history and less Washington detail. I was hoping to find a lot more detail about Washington and its times, with all its grimy geography and scummy characters. I found little of that and  indeed found more of a general discourse of the civil war conflicts raging elsewhere, all in far less detail than I could find elsewhere. I can't however fault its writing or research. Captivating writing kept me going throughout the book."}, {"review_sentiment": 5.0, "review_text": "I love visiting Washington DC and enjoy studying the Civil War period so this book brings the history of the city alive."}, {"review_sentiment": 3.0, "review_text": "War time Washington: Sharpsters, con men, spies, heroes, winners, losers. Some in uniform, some not. An eclectic mixture of the best and the worst the country had to offer and all focused on their own unique visions of opportunity.Ernest Furgurson captures the tumult of those four years, from Lincoln's early arrival, slipping into town in disguise, to his leaving as a corpse. Furgurson's Lincoln is a wonderfully human individual. And so are the rest of the supporting cast, the cabinet, congressmen, soldiers, contractors and everyday people who persevered in this most amazing struggle to save the Union and create a nation rededicated \"to the proposition that all men are created equal.\"This was no easy task, no simple accomplishment, but rather a rough, rowdy brawl that was almost always out of control. This is a most gripping account of the chronology of major and minor events, of the very few triumphs, and the almost continuous sacrifice of all of the participants in what had to have been a most maddening struggle. In reading this book you can begin to understand the continual frustration and disappointments that ultimate success demanded. You will not be disappointed. This is a very good work."}, {"review_sentiment": 3.0, "review_text": "This is a well written book. It is comprehensive yet not overwelming with detail. I am confused though how a journalist with Mr. Ferguson'snewapaper backgound would get some of the little facts WRONG!  I am a  member of the voluminous number who would be called Civil War Buffs (whatever that means)...yet I am not by any means an expert or an academic.  But, with my ameteur acquantence with the topic I am appalled that in one line Mr. Ferguson puts Gettysburg in \"Franklin\" not Adams county, Pennsylvania and in another states that Mrs. Lincoln's Brother in law was killed in September at \"Chattanooga\"-when in fact he was killed at the Battle of Chickamauga.  I must confess that such looseness with the facts-easlily checked-tends to put distrust in any other factual information he presents.  A newspaperman, which Mr. Ferguson was for many years, must get the Who, What and Where correct!  Sloppyness might be a result of poor editing...the final responsibility goes to the author."}, {"review_sentiment": 5.0, "review_text": "Ernest Furgurson uses the statue atop the Capitol as a metaphor for the survival of the U.S. and the liberation of African-Americans.  Even throughout the turmoil of the war, construction of the Capital continued, albeit haltingly, its progress symbolizing the triumph of the Union.  This book is a must read for anyone who lives or works in the capital.Riddled with southern sympathizers and spies, the capital nevertheless became a truly federal city. Slave markets stood on the south side of Independence Ave, now a two-mile-long chain of government departments, and even on Lafayette Square.  D St. and 21st, the present location of the State Department, was a huge stables; on Boxing Day, 1861, a fire broke out that killed thousands of horses and sent thousands more running through the city.  For days afterwards, the city stank of burned horse meat. Present day conservatives would say that they still haven't cleaned out all the horse---- from the area.  Federal Triangle was the red light district, catering to all tastes;  digs have found piles of bottles of expensive French champagne where the bawdy houses one stood.  Constitution Avenue was a canal -- Tiber Creek -- and all of the mall west from the Washington monument was the Potomac.  Within months of the outbreak of war, Washington saw a string of firsts -- the first use of trains for strategic mobility, the first use of aerial reconnaissance, the first machine gun, the first suspension of habeas corpus, the first nursing corps, the first aircraft carrier (a balloon moored to a boat in the Potomoc that allowed the feds to observe the Confederate withdrawal from Occoquan and the Pohick Creek area where I now live).  Furgurson writes of Lincoln, Stanton, Seward, Chase, Winfield Scott, Grant, and McLellan; of Confederate spies such as Antonia Ford; of dozens of soldiers and nurses, poets such as Whitman, and others who created the rich fabric of a capital at war, surrounded by hostiles.  Washington, Furgurson writes, went from a town divided and fearful in 1861 to a \"place of focused and confident power\" in 1865.  He does a superb job of reporting this huge political and physical transformation.Some other notes.  George Washington's grand-nephew fought on behalf of the Confederacy, and was killed in September 1861.  Some vengeful Northerners wanted to confiscate Mt. Vernon but a collection of women persuaded the military authorities to let them retain it as a national historic landmark.  If the hallmark of sharp political speech is that it remains as relevant today as when it was uttered, these words of Lincoln to a crowd celebrating his re-election bear diirectly on the calls of some to postpone the Iraqi elections of January 30, 2005.  \"We cannot have free government without elections, and if the rebellion could force us to forgo or postpone a national election, it might fairly claim to have already conquered and ruined us.\"\"Freedom Rising\" was enlightening as well in how deeply runs the Democratic Party's visceral distrust of the federal government, whether as a player on the national stage or more currently in the international arena.  The Democratic platform in 1864 \"shrugged at slavery\" and all but assured Lincoln's reelection.  Gideon Wells described the platform as \"unpatriotic, almost treasonable to the Union.  The issue is made up.  It is whether a war shall be made against Lincoln to get peace with Jeff Davis.  Those who met at Chicago prefer hostility to Lincoln rather than to Davis.\"  Democratic Party leaders still struggle with the dilemma of supporting a Republican leader in time of war."}, {"review_sentiment": 5.0, "review_text": "I work in Washington, D.C, specifically in the US Capitol, and I felt that while this work lacks significant historical interpretation (as some reviewers point out) we should remember that the author is a journalist first. This book gives a strong feel for what was going on in the city during the civil war, as if the reader were following events as they were likely to be covered in the newspapers at the time. There is also more in depth coverage, gleaned from personal accounts - as though the author were interviewing those writers, and as though the author / reader were working or living in the city at the time. It should be noted that MANY of the sites by the author are from contemporaneous periodicals. No surprise there. All these first hand accounts shed some much needed light on other than a typical military history of the city and its suburbs.Looked at in that light, this is an excellent work. It is unfettered with the typical historian's personal academic spin on events. I felt I was looking through a clearer and more familiar window into the past, as opposed to those fogged by the breath of the historian. Based on this read, I will definitely purchase the author's work on Richmond during the civil war."}, {"review_sentiment": 4.0, "review_text": "I must begin this review by stating that this is the first book I have ever read on the Civil War.  My review, thus, will be from the perspective of a person who possessed limited knowledge of the subject in retrospect to the other fine reviewers who have written in great detail about the subject.Overall, I enjoyed Ernest B. Furgurson's 'Freedom Rising: Washington in the Civil War', as I found many interesting and well researched subject matter easily presented and carefully constructed in the narrative.  Through an incredible amount of research that is well placed, Furgurson managed to keep my interest from the beginning of the book, which starts out with the creation of Lady Liberty's bronze statue, all the way through the inevitable. In between, the reader learns of the many scandels, the outlandish behavior of all the players, the suggested but failed compromises, and the evolution of the slavery issue from not as significant with respect to Lincoln's desire to keep the Union as one, to the importance of the matter in keeping the country one nation.  In contrast to the detail, I felt some of the more important players were minamized, particularly of U.S. Grant.  There were times that I felt there was a lack of consistancy on the author's direction, but was more than willing to take the journey, and understand the issues presented in the country's capitol."}, {"review_sentiment": 2.0, "review_text": "This book is not what I thought it would be (or possibly wanted it to be).  To be certain, it is a fine story of the Civil War written from the perspective of Washington.  But instead of detailing the events and personalities in the District of Columbia and the environs that make up its modern-day suburbs, it focuses instead on official Washington and the decisions it made for the nation.  Ferguson spends a lot of time explaining legislation, military orders, and presidential decrees that were issued from the capital, but the ramifications of them have little or nothing to do with Washington itself.  Furthermore, for anyone who has studied the Civil War in any detail, there is very little offered on these subjects that is revealing.I was hoping for a Civil War-era version of David Brinkley's \"Washington Goes to War\" (which is limited to observations of how the nation's capital evolved during World War II).  That book is riveting reading for anyone who wants to understand how Washington looked, felt, and grew during a critical period in its history.  This was the expectation, which admittedly may have been unfair, that I held for Freedom Rising.To suggest that there is nothing pertaining to my interests in the book would be inaccurate.  There is, for an example, an interesting tale of how Mount Vernon was preserved from hostilities.  There also is a great chapter on the history of slavery in the area and Lincoln's compensated emancipation in the District.  There are other stories taken from the Capitol, White House, and streets of the city.  But these nuggets are few and far between, leaving me feeling unfulfilled most of the times that I sat down to read it.The purpose of this submission is not to discredit Ferguson or his work.  It is well-written and well-intentioned.  I mean the author no disrespect.  But for readers like me who are interested in a detailed account of Washington the city during the Civil War, I cannot recommend this book."}]}, "authors": ["Ernest B. Furgurson"], "isbn": "0375404546", "longitude": -77.0366456, "periods": ["1800s"], "title": "Freedom Rising: Washington in the Civil War", "word_cloud": "good rise good historical tell nation capital go nation trial fire find history le detail hop find lot detail time grimy geography scummy character find little indeed find general discourse conflict rag elsewhere far le detail elsewhere however write research captivate write kept go love visit enjoy study period bring history city alive time con men spy hero winner loser uniform eclectic mixture best worst country offer focus unique vision capture tumult year early arrival slip town disguise leave corpse wonderfully human individual rest support cast cabinet congressman soldier contractor everyday people persevere amazing struggle save create nation rededicate proposition men create equal easy task simple accomplishment rather rough rowdy brawl almost always grip account chronology major minor event triumph almost continuous sacrifice participant madden struggle read begin understand continual frustration disappointment ultimate success demand disappoint good work well write comprehensive yet overwhelm detail confuse journalist background little fact wrong member voluminous number mean yet mean expert academic amateur acquaintance topic appal line put county state law kill fact kill looseness put distrust factual information present newspaperman many year correct poor edit final responsibility go author use statue atop metaphor survival liberation even turmoil construction continue haltingly progress symbolize triumph anyone live work southern sympathizer spy capital nevertheless become truly federal city market stand south side chain government department even present location huge stable box break kill thousand horse send thousand run city day afterwards city stank burn horse meat day conservative still cleaned horse area red light district catering taste dig find pile bottle expensive french champagne bawdy house stand canal mall west monument month outbreak saw string first first use train strategic mobility first use aerial reconnaissance first machine gun first suspension habeas corpus first nursing corp first aircraft carrier balloon moor boat allow fed observe withdrawal area live write spy dozens soldier nurse poet others create rich fabric capital surround hostile write go town divide fearful place focus confident power superb job report huge political physical note fight behalf kill vengeful northerner want confiscate collection woman persuade military authority let national historic landmark hallmark sharp political speech remain relevant today utter word crowd celebrate bear directly call postpone election free government election rebellion postpone national election fairly already conquer ruin rise enlighten well deeply run democratic visceral distrust federal government player national stage currently international democratic platform shrug slavery assure reelection describe platform unpatriotic almost treasonable issue make peace meet prefer hostility rather leader still struggle dilemma supporting republican leader time work specifically felt work lack significant historical interpretation reviewer point author journalist first give strong feel go city follow event likely cover newspaper time also depth coverage glean personal account author interview writer author work live city time note site author contemporaneous periodical surprise first hand account shed much need light typical military history city light excellent work unfettered typical historian personal academic spin event felt look clearer familiar window oppose fog breath historian base definitely purchase author work state first ever review thus perspective person possess limited knowledge subject retrospect fine reviewer write great detail enjoy find many interesting well research subject matter easily present carefully construct narrative incredible amount research well place manage keep interest beginning start creation bronze statue way inevitable learns many scandal outlandish behavior player suggest failed compromise evolution slavery issue significant respect desire keep importance matter keep country nation contrast detail felt important player minimize particularly time felt lack consistency author direction willing journey understand issue present country capitol think possibly certain fine story write perspective instead detail event personality environs make suburb focus instead official decision make nation spend lot time explain legislation military order presidential decree issue capital ramification little nothing anyone study detail little offered subject hop version limit observation nation capital evolve rivet read anyone want understand look felt grow critical period history expectation admittedly hold suggest nothing pertaining interest example interesting tale preserve hostility also great chapter history slavery area compensate emancipation stories take streets city nugget far leave feel unfulfilled time sit purpose submission discredit work mean author disrespect reader interested detailed account city recommend", "genres": ["Biography", "History", "Politics"], "summary": "Freedom Rising is a fresh, intensely human account of how the Civil War transformed the nation’s capital from the debating forum for a loose union of states into the seat of a forceful central government. \r\n    \r\nBefore 1861, Washington was a dusty, muddy city of 60,000, joked about by urban sophisticates from New York and Boston. But at the onset of war, thousands of soldiers, job seekers, nurses, good-time girls, gamblers, newly freed slaves–all kinds of Americans–poured in. For days, Washington was cut off from the North, and no one was sure whether it would become the capital of the Union or the Confederacy. \r\n    \r\nErnest Furgurson–author of the widely acclaimed Chancellorsville 1863, Ashes of Glory, and Not War but Murder–tells the story through the men and women who brought the city to rambunctious life. He re-creates historic figures such as William Seward, who fancied himself Abraham Lincoln’s prime minister; poet Walt Whitman, who nursed the wounded; and detective Allan Pinkerton, who tracked down Southern sympathizers; and he introduces intriguing others, such as Mayor James Berret, arrested for disloyalty; architect Thomas Walter, striving to finish the Capitol dome in the middle of war; and accused Confederate spy Antonia Ford, romancing her captor, Union Major Joseph Willard, operator of the capital’s premier hotel.  Here is Mary Lincoln, mourning the death of her son Willie, seeking solace from fakers who conducted séances in the White House. And here is the president–in all his compassion, determination, and complexity–inspiring the nation, wrangling with generals, pardoning deserters, and barely escaping death on the ramparts of Fort Stevens as Jubal Early’s Southern army invades the outskirts of Washington and fights the Union Army within five miles of the White House. For four years, the city was awash in drama and sometimes comedy, until the assassination of Lincoln by John Wilkes Booth became the tragedy of the century. \r\n    \r\nBy the time the grand two-day victory parade of 150,000 troops surged along Pennsylvania Avenue, the men and women who had arrived in such great numbers at the start of the war had made Washington a capital to be reckoned with throughout the world. Freedom Rising is an invaluable aid to understanding the making of America.", "asin": "0375404546", "rank": "1640198", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/5126755P7DL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}