{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 105, "rating": 4.1, "reviews": [{"review_sentiment": 2.0, "review_text": "I generally love Roth books, but this was particularly short, and overly concerned with breasts with little redeeming value. Sorry i bought it and never felt that way about a Roth book before."}, {"review_sentiment": 5.0, "review_text": "Mention Philip Roth to almost any literate woman and you'll hear a howl of outrage. \"A male chauvinist pig, an unrepentant Don Giovanni, a loathsome narcissist stroking his ego and thinking it's his shlang! Or vice-versa.\" I'll wager very few woman readers get past the first ten pages of The Dying Animal. Honestly, I almost tossed the book myself, being more or less post-erotic and easily bored by other people's lust. But I soldiered on. I'm not unhappy I did. It's a book to love and hate with equal fervor, because it's about a \"self\" that one must love and hate with open eyes. Roth is often taken as a paragon of self-adulation, and his character in this novel  -- a drama critic named David Krepesh -- anoints himself to be the ultimate evolutionary product of sexual liberation while simultaneously portraying himself as a hopeless victim of sexual obsession. Sex is life; sex is death.Alas, Roth's depiction of Krepesh as a hero/victim of the 60s jibes achingly with my own memory-image of myself in the throes of the \"sexual revolution.\" I despise Krepesh. I am Krepesh. (Or I was Krepesh then and would probably still be Krepesh today except for etc.) Yeah, the book is literary smut, but so is life. And then it turns out to be just what the title proclaims: a book about Death. With highly amusing interpolations and meanderings. It's just 150 pages. You might give it a shot."}, {"review_sentiment": 5.0, "review_text": "Saw the movie \"Elegy\" and wanted to read the book.  Sensitive and an interesting exploration of aging, and the interplay between older man and your woman. I can relate, for better or worse to many of Kepesh feeling and ramblings.......See the movie too, Ben Kingsley is superb, with Penelope Cruz as the young beauty"}, {"review_sentiment": 5.0, "review_text": "Made me cry - thoughtful book with beautiful language, meditations on love and loss and life."}, {"review_sentiment": 4.0, "review_text": "Excellent depiction of an aging man falling for a beautiful young woman. Sadness is instilled on the reader as tragedy develops. Narrative style is peculiar: Flow of consciousness that seems to be dictated to a recorder.. Ending is disappointing. Rich language!"}, {"review_sentiment": 5.0, "review_text": "Absolutely beautiful and brilliant writing."}, {"review_sentiment": 4.0, "review_text": "The book came right on time and in good condition . And I loved it was a good read !"}, {"review_sentiment": 5.0, "review_text": "See all my reviews of Roth's work. He is brilliant and by far the best of contemporary American authors. Deserves the Nobel Prize."}, {"review_sentiment": 5.0, "review_text": "Classic Roth"}, {"review_sentiment": 5.0, "review_text": "Yes, Roth is revisiting here but this time it is for real. He's past the clever lengthy depictions of male desire and old age because it is now he who will be dead soon. Hence the recent novellas of less than 200 words. Time is running out and he's cutting to the chase, to the essence: \"On the nights she isn't with me, I am deformed\". Brilliant."}]}, "authors": ["Philip Roth"], "isbn": "037571412X", "longitude": 0.0, "periods": ["1900s"], "title": "The Dying Animal", "word_cloud": "generally love particularly short overly concerned breast little redeem value buy never felt way almost literate woman hear howl outrage male chauvinist pig unrepentant loathsome narcissist stroke ego think slang wager woman reader get first ten page almost toss le easily bore people lust soldier unhappy hate equal fervor self hate open eye often take paragon character drama critic name anoints ultimate evolutionary product sexual liberation simultaneously portray hopeless victim sexual obsession life sex depiction jibe achingly throes sexual revolution despise probably still today literary smut life turn title proclaims highly amuse interpolation meanderings page shot movie want interest exploration age interplay older man woman relate better worse many feeling ramblings movie superb young beauty make cry thoughtful beautiful language meditation love loss life excellent depiction age man fall beautiful young woman instill tragedy develops style peculiar consciousness seem dictate end disappointing rich language absolutely beautiful brilliant writing come right time good condition love good review work brilliant far best contemporary american author deserve classic revisit time real past clever lengthy depiction male desire old age dead soon recent novella le word run cut chase essence night deform", "genres": ["Fiction & Literature"], "summary": "No matter how much you know, no matter how much you think, no matter how much you plot and you connive and you plan, you’re not superior to sex. With these words our most unflaggingly energetic and morally serious novelist launches perhaps his fiercest book. \r\n\r\nThe speaker is David Kepesh, white-haired and over sixty, an eminent cultural critic and star lecturer at a New York college–as well as an articulate propagandist of the sexual revolution. For years he has made a practice of sleeping with adventurous female students while maintaining an aesthete’s critical distance. But now that distance has been annihilated. \r\n\r\nThe agency of Kepesh’s undoing is Consuela Castillo, the decorous and humblingly beautiful 24-year-old daughter of Cuban exiles. When he becomes involved with her, Kepesh finds himself dragged–helplessly, bitterly, furiously–into the quagmire of sexual jealousy and loss. \r\n\r\nIn chronicling this descent, Philip Roth performs a breathtaking set of variations on the themes of eros and mortality, license and repression, selfishness and sacrifice. The Dying Animal is a burning coal of a book, filled with intellectual heat and not a little danger.", "asin": "037571412X", "rank": "139562", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41qXcqoJOqL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}