{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 271, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book"}, {"review_sentiment": 5.0, "review_text": "A great trip down not such long ago history.  A reminder of how important a free press is for our country."}, {"review_sentiment": 5.0, "review_text": "I found this book recently at a used book sale and bought it because I grew up in Washington DC reading the Washington Post.  From the size of the book, I expected it would be very detailed and possibly boring.  Was I ever wrong!  I am about 3/4 of the way through and have a hard time putting it down.Katharine goes into lots of details about events in her life, her thinking about herself and the world and others around her.  She is very candid in reviewing her mistakes and insecurities at the time and how she kept putting \"one foot in front of the other\" to get through personal tragedies that could have broken her.  I'm learning so much more than I ever suspected about her as a person and about the times we lived in from a different perspective.  She also had many great successes and contributed greatly to democracy and freedom of the press that are cornerstones of our American society.  Through her family's purchase of the Washington Post, its growth under her husband's control and and through her own management, she describes how the Post took its eventual place among the great examples of what a great newspaper can be.  She reminds us of the values that we hold dear and how fragile they can seem in the face of vicious attack by people who want to take our freedoms away .I am thoroughly enjoyed the walk down memory lane from her eyes."}, {"review_sentiment": 2.0, "review_text": "By page 150 I was bored to death, and still had 450 to go!  This woman was an editor????Start editing!!!"}, {"review_sentiment": 5.0, "review_text": "Loved this book.  Fun insights into some of the pivotal shapers of the century.  And nice to read about influential people who are not just interested in what is in it for them."}, {"review_sentiment": 3.0, "review_text": "Good long read,fascinating family and the amazing build of a newspaper ."}, {"review_sentiment": 5.0, "review_text": "This book is for anyone who is interested in Washington DC History and the Newspaper Business, of which I am also I lived through Watergate.  Fortunately for Mrs. Graham, she led an extraordinary life. She was born into privilege and money to Mr and Mrs. Eugene and Agnes Meyer, who are interesting in their own rite.  If her father had not rescued the failing Washington Post, she still might of had an interesting life, but maybe not so noticeable.  After college she began work as a reporter, set up by the father in Los Angeles.  She cam back to DC and met Phil Graham who became her Dads fair hair boy, to pass the Post on to, she had ups and downs while being a wife, mother, and runner of the household (who husband's just think happen). Her bucolic life takes a sudden turn with the death of her sister, her father and the mental illness, betrayal and death of her husband.  She then moves into the corporate world of the newspaper business and all the Post Company business, as she learns to play with big boys.  She also takes us through how political life in Washington affects her and the Post as we enter the 60's and 70's, through all the political changes, Watergate and on to the Pressman's Strike.  She gives the reader a look at her thoughts and feelings about herself, her parents, her children, and her famous friends and not so famous friends throughout the book, its a long but great read."}, {"review_sentiment": 3.0, "review_text": "Long long long, interesting content, but could of been shorter if not so much nitty detail about suppers etc"}, {"review_sentiment": 5.0, "review_text": "Mrs. Graham led an extraordinary life. She was born into privilege and money and worked as a reporter, in an era in which she was raised to be a wife, mother, and runner of households. She became one of the most powerful women in industry by pursuing the knowledge she needed, as she needed it. Mrs. Graham tells her story primarily through the peak events of her personal and corporate life: the suicide of her husband, the Pentagon Papers, and a major labor strike. A wonderful read."}, {"review_sentiment": 5.0, "review_text": "WOW! Watergate sounds like today! Probably the most amazing life story I've ever read!"}]}, "authors": ["Katharine Graham"], "isbn": "0375701044", "longitude": -77.0366456, "periods": ["1900s"], "title": "Personal History", "word_cloud": "great great trip long ago reminder important free press country find recently use sale buy grow read size expect possibly bore ever wrong way hard time put go lot detail event life think world others candid review mistake insecurity time keep put foot front get tragedy learn much ever suspect person time live different perspective also many great success contribute greatly democracy freedom press cornerstone american society family purchase growth husband control management describe take eventual place great example great newspaper remind value hold dear fragile seem face vicious attack people want freedom thoroughly enjoyed walk memory lane eye page bore death still woman editor editing love insight pivotal shape century nice influential people interested good long fascinate family amaze build newspaper anyone interested also live lead extraordinary life bear privilege money interest rite father rescue fail still interest life maybe noticeable college begin work reporter set father cam back meet become fair hair boy pas ups down wife mother runner household husband think bucolic life take sudden turn death sister father mental illness betrayal death husband move corporate world newspaper business business learns play big boy also take political life affect enter political change give look thought feeling parent child famous friend famous friend long great long long long interesting content much bitty detail supper etc lead extraordinary life bear privilege money work reporter era raise wife mother runner household become powerful woman industry pursue knowledge need need tell story primarily peak event corporate life suicide husband major labor strike wonderful sound today amaze life story ever", "genres": ["Memoir", "Politics", "Journalism"], "summary": "Winner of the 1998 Pulitzer Prize for Biography\r\n\r\nAn extraordinarily frank, honest, and generous book by one of America's most famous and admired women, Personal History is, as its title suggests, a book composed of both personal memoir and history.\r\n\r\nIt is the story of Graham's parents: the multimillionaire father who left private business and government service to buy and restore the down-and-out Washington Post, and the formidable, self-absorbed mother who was more interested in her political and charity work, and her passionate friendships with men like Thomas Mann and Adlai Stevenson, than in her children.\r\n\r\nIt is the story of how The Washington Post struggled to succeed -- a fascinating and instructive business history as told from the inside (the paper has been run by Graham herself, her father, her husband, and now her son).\r\n\r\nIt is the story of Phil Graham -- Kay's brilliant, charismatic husband (he clerked for two Supreme Court justices) -- whose plunge into manic-depression, betrayal, and eventual suicide is movingly and charitably recounted.\r\n\r\nBest of all, it is the story of Kay Graham herself. She was brought up in a family of great wealth, yet she learned and understood nothing about money. She is half-Jewish, yet -- incredibly -- remained unaware of it for many years.She describes herself as having been naive and awkward, yet intelligent and energetic. She married a man she worshipped, and he fascinated and educated her, and then, in his illness, turned from her and abused her. This destruction of her confidence and happiness is a drama in itself, followed by the even more intense drama of her new life as the head of a great newspaper and a great company, a famous (and even feared) woman in her own right. Hers is a life that came into its own with a vengeance -- a success story on every level.\r\n\r\nGraham's book is populated with a cast of fascinating characters, from fifty years of presidents (and their wives), to Steichen, Brancusi, Felix Frankfurter, Warren Buffett (her great advisor and protector), Robert McNamara, George Schultz (her regular tennis partner), and, of course, the great names from the Post: Woodward, Bernstein, and Graham's editorpartner, Ben Bradlee. She writes of them, and of the most dramatic moments of her stewardship of the Post (including the Pentagon Papers, Watergate, and the pressmen's strike), with acuity, humor, and good judgment. Her book is about learning by doing, about growing and growing up, about Washington, and about a woman liberated by both circumstance and her own great strengths.", "asin": "0375701044", "rank": "10395", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51j0Aco1hOL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}