{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 188, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Beautiful story. If you like pianos, music and Paris."}, {"review_sentiment": 5.0, "review_text": "Just a wonderful book..read it about three times now, fills you with hope that your find your ‘thing’ that just clicks with you...Perfect !"}, {"review_sentiment": 4.0, "review_text": "A beautifully written book which marries the joy of music (specially the piano) and the author's other love--writing with brilliance and clarity. I would have given 5 stars, but it's a little slow in places due to the historical accounts rather than a pure narrative of finding his love of piano once again...on his terms.  All in all, a wonderful read."}, {"review_sentiment": 4.0, "review_text": "The book was very enjoyable and it arrived on schedule.  Packing, however, was not very strong and there was slight damage."}, {"review_sentiment": 5.0, "review_text": "As a life long amatuer musician who grew up playing in church, Thad Carhart reminded me of my first love of the piano.  The years of lessons on the old Gulbranson Upright came flooding back into my memory.  The feel of the keys, the sound, the family around it singing our hearts out...all wonderful memories.Thad communicates his love for this complex, infuriating instrument that you can both love and hate. Love it for the emotions it can bring forth with music.  Hate it for it's unforgiving nature and the frustration in trying to master the unmastersble.Thank you, Thad, for rekindling in me the love for this most noble instrument."}, {"review_sentiment": 4.0, "review_text": "Very informative book that shows Mr Carhart's passion for the piano. Well written , some chapters technical, some about people. I will never look at a piano the same. Learned a lot."}, {"review_sentiment": 5.0, "review_text": "A treasure. Wonderful book on some joyful things in life: pianos and music and friends and Paris. He writes with great feeling. Now I want to read his other books . . . and learn to play the piano and return to Paris!"}, {"review_sentiment": 3.0, "review_text": "I had heard great things about this little book from friends for quite some time. Frankly, I was disappointed. The story line is very thin. However, the saving grace is that it provides a really good history of the piano and piano-building. Anyone interested in such a history will probably like this book more than I did."}, {"review_sentiment": 4.0, "review_text": "sentimental look into traditional  Parisien culture, from an admiring Francophile perspective."}, {"review_sentiment": 5.0, "review_text": "For anyone who has ever been attached to a piano--that lumbering piece of furniture that becomes whatever you make of it--this is a must-read. I was influenced in my love of pianos by my mother, who talked for years about saving up for a Wurlitzer spinet, and she did it! It was her pride and joy. It was my babysitter during summers alone at home when there really wasn't anything else to do.Because my mother's mother was a strict music teacher, and because my mother was a very shy child, her mother would not teacher her to play because she couldn't be brave enough to count out loud. Her mother being over-strict, mine refused to push me. And of course, I wish she would have. But the piano was my playmate, and I slowly worked my way through a few inappropriately difficult pieces over the summers. I have never become an accomplished player, but I do love playing \"at\" piano on this one that is more than I ever deserved.Carhart's story resonates with those of us who's hearts have bonded with a piano. Pianos are ridiculously complex and delicate or sturdy, whichever way they are personally inclined. They can be had for almost no money when somebody needs to get rid of a piano. I paid $300 for the piano in 1969, and probably $3000 in moving and tuning over the years. My 1920s Blasius & Sons upright grand, which I've had for 48 years, has been moved, stored, and moved at least 10 times. It is a trouper, and it can still be tuned to concert pitch.It is about to become the property of the local ragtime festival, and I can't wait to hear its destiny fulfilled by being played by worthy musicians. I will be standing around awaiting their praise as if it were an only child. I will strive to be rational. This piano is also a favorite of our 11-yr-old grandson, who is against the notion of moving it on. I have campaigned the notion of \"stewardship,\" saying that this piano is bigger than the two of us and that it has a destiny to fulfill. Together, we recorded our names and dates inside the lid yesterday, inspired by Carhart's story. Thank you, Thad! I am buying several copies to share with friends."}]}, "authors": ["Thad Carhart"], "isbn": "0375758623", "longitude": 2.3514992, "periods": ["2000s", "Recent Releases"], "title": "The Piano Shop on the Left Bank: Discovering a Forgotten Passion in a Paris Atelier", "word_cloud": "story piano music just wonderful time fill hope thing click perfect beautifully write marries joy music specially author love write brilliance clarity give star little slow place due historical account rather pure narrative finding love term wonderful enjoyable arrived schedule pack however strong slight damage life long amateur musician grow play church remind first love year lesson old come flood back memory feel key sound family sing heart wonderful communicates love complex infuriating instrument hate emotion bring forth music unforgiving nature frustration try master rekindle love noble instrument very informative show write chapter technical people never look learn lot treasure joyful thing life pianos music friend write great feeling now want learn play return hear great thing little friend quite time disappoint story line thin however save grace provide really good history interested history probably sentimental look traditional culture admire perspective anyone ever attach lumber piece furniture become make influence piano mother talk year save spinet joy babysitter summer alone home really anything else mother mother strict music teacher mother shy child mother play enough count loud mother mine refuse push course wish playmate slowly work way inappropriately difficult piece summer never become accomplished player love play ever story resonate heart bond ridiculously complex delicate sturdy way personally incline almost money somebody need rid pay probably move tune year upright grand year move stored move least time trouper still tune concert property local ragtime festival hear destiny fulfil play worthy musician stand await praise child strive rational also favorite grandson notion move campaign notion stewardship say bigger destiny together record name date lid yesterday inspire story buy several copy share friend", "genres": ["Art & Architecture", "History", "Travel Writing"], "summary": "Walking his two young children to school every morning, Thad Carhart passes an unassuming little storefront in his Paris neighborhood. \r\n\r\nIntrigued by its simple sign—Desforges Pianos—he enters, only to have his way barred by the shop’s imperious owner. Unable to stifle his curiosity, he finally lands the proper introduction, and a world previously hidden is brought into view. Luc, the atelier’s master, proves an indispensable guide to the history and art of the piano. Intertwined with the story of a musical friendship are reflections on how pianos work, their glorious history, and stories of the people who care for them, from amateur pianists to the craftsmen who make the mechanism sing. \r\n\r\nThe Piano Shop on the Left Bank is at once a beguiling portrait of a Paris not found on any map and a tender account of the awakening of a lost childhood passion.", "asin": "B002C5RM9I", "rank": "1062963", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/413-5B9aQjL.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}