{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 561, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "I am coming late for this (1999) debut novel for Z Smith. I was fully enthralled & engaged with the book, but was exhausted by its slow - make it snail pace. The plot advances so slowly like a wave in the middle of the ocean. I am calling it quits at 40%, but with the feeling that author shortcoming are way outweighed by her ability to plot characters (and stick with them, even when I forgot about them because they disappeared for a long while they come back with next appearance). A talent to reckon with back in '99 God knows where she is placed now. Her style seemed to follow Kundera a bit, even in her choice of characters. But he giving them a saving hand, she get distracted by the telling than leading them somewhere!"}, {"review_sentiment": 5.0, "review_text": "Darkly humorous, White Teeth weaves together the stories of two English families in this glimmering examination of cultural identity amid globalization."}, {"review_sentiment": 1.0, "review_text": "Not for me. Start right with a suicide attempt. I'm going to return this."}, {"review_sentiment": 4.0, "review_text": "My second time reading a novel by Zadie Smith. The novel is well written, and the storyline and characters are interesting and colorful."}, {"review_sentiment": 2.0, "review_text": "Slow and anti climatic ending!"}, {"review_sentiment": 5.0, "review_text": "Wonderful intermingling of cultural threads and metaphysical concerns, based in contemporary London. Sympathetic treatment of often stereotyped groups.Suitable for teenage adults and adult teenagers."}, {"review_sentiment": 1.0, "review_text": "I did not enjoy this book. This felt like it should have been a collection of stories rather than a novel. Many of the characters begin something and then the author just stops short."}, {"review_sentiment": 5.0, "review_text": "I first read this book over ten years ago and it is still as great an experience; the themes still ring true and the humour is timeless."}, {"review_sentiment": 5.0, "review_text": "Her humor and insight are tremendous. I'm not sure I liked the end, but it had to end someway. This ending worked."}, {"review_sentiment": 5.0, "review_text": "Wit, elegance, humor, this is excellent story-telling, and to think that it's a debut novel! Do read it, it's great food for soul and mind."}]}, "authors": ["Zadie Smith"], "isbn": "0375703861", "longitude": -0.12574, "periods": ["2000s"], "title": "White Teeth: A Novel", "word_cloud": "come late debut fully enthral engage exhausted slow make snail pace plot advance slowly like wave middle ocean call quits feel author shortcoming way outweigh ability plot character stick even forget disappear long come next appearance talent reckon back know place style seem follow bit even choice character give save hand get distract tell lead somewhere humorous weave together story english family glimmer examination cultural identity globalization not right suicide attempt go return second time read well write story line character interest colorful slow anti climatic end wonderful intermingle cultural thread metaphysical concern base contemporary treatment often stereotype teenage adult adult teenager enjoy felt collection story rather many character begin something author stop short first year ago still great experience theme still ring true humor timeless humor insight tremendous sure like end end someway end work elegance humor excellent think debut great food soul mind", "genres": ["Fiction & Literature"], "summary": "Zadie Smith’s dazzling debut caught critics grasping for comparisons and deciding on everyone from Charles Dickens to Salman Rushdie to John Irving and Martin Amis. But the truth is that Zadie Smith’s voice is remarkably, fluently, and altogether wonderfully her own.\r\n\r\nAt the center of this invigorating novel are two unlikely friends, Archie Jones and Samad Iqbal. Hapless veterans of World War II, Archie and Samad and their families become agents of England’s irrevocable transformation. A second marriage to Clara Bowden, a beautiful, albeit tooth-challenged, Jamaican half his age, quite literally gives Archie a second lease on life, and produces Irie, a knowing child whose personality doesn’t quite match her name (Jamaican for “no problem”). Samad’s late-in-life arranged marriage (he had to wait for his bride to be born), produces twin sons whose separate paths confound Iqbal’s every effort to direct them, and a renewed, if selective, submission to his Islamic faith. \r\n\r\nSet against London’s racial and cultural tapestry, venturing across the former empire and into the past as it barrels toward the future, White Teeth revels in the ecstatic hodgepodge of modern life, flirting with disaster, confounding expectations, and embracing the comedy of daily existence.", "asin": "0375703861", "rank": "12209", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/515SYDLdnKL.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}