{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 88, "rating": 3.7, "reviews": [{"review_sentiment": 3.0, "review_text": "Unique idea about a detestable human being who makes selfishness into an occupation in a 220 page monologue perfect for an actor looking for a one person show. But the character while sometimes brilliant and funny, is in the end not sympathetic."}, {"review_sentiment": 4.0, "review_text": "Interesting novel of the decline and fall of one man who admittedly never full understands his predicament. Told from a first person perspective. Also, Banville is a master at description of the environment in which the novel takes place."}, {"review_sentiment": 4.0, "review_text": "Freddie Montgomery , arrogant, self centred with pretentions of being a moneyed  gentleman, is drifting through life and hits trouble after taking a loan from the wrong people. Returning to Ireland he steals a Dutch Master from family friends ....murdering a chambermaid who witnesses his crime, Throwing the painting in a ditch, he awaits capture. Or is Freddie's account just a fiction ? He certainly committed murder....  A kind of updating (or re telling ) of \"Crime and Punishment\" that works well ; especially Freddie's increasing paranoia as things progress. What detracts and lets this book down is what I call \"The 80's Syndrome\" of literary writing where writers such as Banville are overly and unnecessarily erudite, to the point of being esoteric and egotistical. I happen to have read Robert Musil's \"Man Without Qualities\" , so knew what Freddy was inferring when he wondered if people looked on him as their Moosbrugger (Moosbruger was a sex murderer feted by the public and liberal elite) but other esoteric mentions I would need a search engine . This is an unnecessary conceit by Banville that really doesn't add to the book. (As does being overly Irish in naming a character Maoseachlainn. It may be a comment on the elitist legal system, but there are far better and less esoteric ways of doing that)  A good book, well worth a read. let down by the \"80's\" syndrome !"}, {"review_sentiment": 4.0, "review_text": "Wonderful writing in a style which is rare and sadly, but mostly, lost in the present day of girls gone and shades gone gray.  Banville's story is fast-paced and even thrilling for much of the book, but it becomes tedious near the end.  The hardly likeable, but highly interesting, main character is a source of pity from the outset.  Regardless of the book's shortcomings, I never found myself wanting to stop reading."}, {"review_sentiment": 3.0, "review_text": "Not a lovable protaganist at all,  but I love Banville's writing.  Great observer of human foibles and attention to detail."}, {"review_sentiment": 3.0, "review_text": "Could not finish this book. I found the main character obnoxious and a bore. Yes, I realize he is a narcissist and that should be taken into consideration, but the level of detail for the most mundane situations was beyond readable for me. I got about halfway through. Writing is good enough, just nothing to keep the interest up after a few passages at the front."}, {"review_sentiment": 1.0, "review_text": "I did not enjoy this book at all.  The main, and pretty much only character is so self-absorbed, narcissistic and unlikeable, that there needs to be something else to hold the interest.  I have read Banville before (The Sea and The Untouchable),as well as his Benjamin Black series, so I know he writes in an introspective and philosophical way, but this book did not hold my interest.  The banality of evil is an old subject, but this was just tiresome.  But for my rule that I must finish any book I start, I would not have finished this one."}, {"review_sentiment": 1.0, "review_text": "I had no sympathy with the main character as he was totally selfish and dislikable.  The best place for him was in prison."}, {"review_sentiment": 4.0, "review_text": "A hard book to review. The main character is about as unappealing as he could be, and his life drifts here and there with little meaning. A lot like Crime & Punishment or Camus if you like that sort of thing. Beautifully written -- one of the few books I read these days which I reread whole paragraphs just to savor the language. It takes a long time to get to the murder which turns out to be pointless and almost humorous in its utter stupidity. In the end I didn't find him very interesting, even as a psychological study. Why does he do anything? We never quite find out. I often like books with unappealing characters, which Freddie was, but ultimately also uninteresting (which accounts for the 4 star). I did enjoy it which is why it gets that many.The last lines of the book lead one to entertain the idea that this is all the wild hallucinations of a schizophrenic. I don't think so, but then all we know is what he says about himself. It is, for example, quite possible that his years in prison have affected the narrative in his mind -- not crazy maybe but warped. Maybe the pointlessness of his life in prison has led him to see his earlier life as more pointless than it was at the time. In that sense it might be read as a investigation of how we reconstruct our autobiographies.I do recommend it, but only if you understand what yu are getting yourself in for. Surely not everyone's cup of tea."}, {"review_sentiment": 4.0, "review_text": "John Banville is wonderfully gifted writer. I marvel at the way he describes how Freddie reacts to moments or events in his life. How John could conjure up a character like Freddie and such a gruesome crime is a tribute to his remarkable imagination. I have to keep my dictionary handy because John also has such an extraordinary grasp of the English language that he is able to choose just the right expression or word to describe Freddie's impressions of a landscape or an encounter with someone."}]}, "authors": ["John Banville"], "isbn": "0375725237", "longitude": -6.2602732, "periods": ["1900s"], "title": "The Book of Evidence", "word_cloud": "idea detestable human make selfishness occupation page monologue perfect actor look person show character sometimes brilliant funny end sympathetic interest decline fall man admittedly never full understands predicament tell first person perspective also master description environment take place arrogant self center pretension moneyed gentleman drift life hit trouble take loan wrong people return steal dutch family friend chambermaid witness crime throw paint ditch awaits capture account fiction certainly commit murder kind update tell punishment work well especially increase paranoia thing progress detract let literary writing writer overly unnecessarily erudite point esoteric egotistical happen know infer wondered people look sex murderer fete public liberal elite esoteric mention search engine unnecessary conceit really overly irish name character legal system far better le esoteric way good well worth wonderful write style rare sadly mostly lose present day girls go shade go gray story even thrill much becomes tedious end hardly likable highly interest main character source pity outset shortcoming never find want stop reading not lovable protagonist love write observer human foible attention detail find main character obnoxious realize narcissist take consideration level detail mundane situation readable get halfway write good enough nothing interest passage front enjoy main pretty much character narcissistic unlikable need something else hold interest banville well series know write introspective philosophical way hold interest banality evil old subject tiresome rule start sympathy main character totally selfish dis likable best place prison hard review main character unappealing life little mean lot sort thing write day reread whole paragraph savor language take long time murder turn pointless almost humorous utter stupidity end find interesting even psychological study anything never quite find often unappealing character ultimately also uninteresting account star enjoy get last line lead entertain idea wild hallucination schizophrenic think know say example quite possible year prison affect narrative mind crazy maybe warp pointlessness life prison lead see earlier life pointless time sense investigation recommend understand yew get surely everyone cup tea wonderfully gift writer marvel way describes react moment event life character gruesome crime tribute remarkable imagination keep dictionary handy also extraordinary grasp language able choose right expression word describe impression landscape encounter someone", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Shortlisted for the 1989 Booker Prize, a dark and unsettling crime classic.\r\n\r\nFrederick Charles St John Vanderveld Montgomery. Do you swear to tell the truth, the whole truth, and nothing but the truth? Don't make me laugh.\r\n\r\nFreddie Montgomery has committed two crimes. He stole a Dutch old-master painting from a wealthy family friend and murdered the chambermaid who caught him in the act. Narcissistic, greedy and reckless, Freddie travels through life apparently without remorse. However, as he narrates his testimony, he realises that the only person to be held responsible for his life, and his crimes, is himself. He just can't quite admit it yet . . .\r\n\r\nShortlisted for the 1989 Booker Prize, John Banville's The Book of Evidence is a wonderfully dark, insightful and unnerving crime novel that takes us deep into the unreliable mind of an improbable murderer.", "asin": "0375725237", "rank": "147063", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51nlR6SRaDL.jpg", "country": "Ireland", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}