{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 200, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "In mid-life and alone, Alice untertook a european journey to several countries which included an interesting internal journey as well."}, {"review_sentiment": 4.0, "review_text": "While not a new book I just found it and love Stainbach's writing - actually just loved and enjoyed her experiences abroad."}, {"review_sentiment": 5.0, "review_text": "One of the best travel books I've read in years. It makes me want to head to Europe for the next 6 months."}, {"review_sentiment": 4.0, "review_text": "Enjoyed this lighthearted book."}, {"review_sentiment": 5.0, "review_text": "What a great read-sharp, fun and insightful."}, {"review_sentiment": 5.0, "review_text": "A must read for any woman that likes or wishes to travel. <3"}, {"review_sentiment": 4.0, "review_text": "As a 60+ Yrs person, this book was interesting to me because of the universal ideas of travel, love, and friendship. I can't imagine that younger people will identify with the author's adventures."}, {"review_sentiment": 5.0, "review_text": "I love this book. It was a gift some years ago and I have since bought it several times for others."}, {"review_sentiment": 5.0, "review_text": "I was pleasantly surprised at the thought=provoking issues the author discussed - not just an entertaining read."}, {"review_sentiment": 4.0, "review_text": "I really enjoyed this book.  It made me happy and wanted me to try some of her travel \"ways\" on one or more of my journeys."}]}, "authors": ["Alice Steinbach"], "isbn": "0375758453", "longitude": 2.3514992, "periods": ["1900s"], "title": "Without Reservations: The Travels of an Independent Woman", "word_cloud": "alone undertook european journey several country include interesting internal journey well new find love write actually love enjoyed experience abroad best travel year make want head next month lighthearted great fun insightful wish travel person interest universal idea travel friendship younger people identify author adventure love year ago buy several time others pleasantly surprise issue author discuss entertain really enjoy make happy wanted try travel way journey", "genres": ["Memoir", "Travel Writing"], "summary": "\"In many ways, I was an independent woman,\" writes Pulitzer Prize–winning journalist Alice Steinbach. “For years I’d made my own choices, paid my own bills, shoveled my own snow.” \r\n\r\nBut somehow she had become dependent in quite another way. “I had fallen into the habit of defining myself in terms of who I was to other people and what they expected of me.” \r\n\r\nBut who was she away from the people and things that defined her? In this exquisite book, Steinbach searches for the answer to this question in some of the most beautiful and exciting places in the world: Paris, where she finds a soul mate; Oxford, where she takes a course on the English village; Milan, where she befriends a young woman about to be married. \r\n\r\nBeautifully illustrated with postcards from Steinbach’s journeys, this revealing and witty book transports you into a fascinating inner and outer journey, an unforgettable voyage of discovery.", "asin": "0375758453", "rank": "123414", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51XgmOHKFBL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}