{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.2083537, "ratings": {"num_ratings": 1038, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Marjane Satrapi was ten years old when the ayatollahs overtook Iran. Formerly educated in a French-language school with classrooms integrated by gender, she found her life uprooted and turned sideways. Teachers who, one year, told students the Shah was chosen by God, the next year told students to rip the Shah’s photos from their textbooks. Who can blame her for developing a drifting, nihilistic view of life?Satrapi’s memoirs, written in graphic novel form, first appeared in French in four volumes at the height of the 1990s “comix” craze; they were later reprinted in English in two volumes. (A one-volume edition exists.) Like most comix artists, Satrapi embraces an auteur mindset, with a single writer-artist, and minimal editorial influence.This permits an introspective, deeply personal approach to her telling her own story.Perhaps the most important theme in Satrapi’s memoirs is the contrast between her family’s secular, Westernized upbringing, and the increasingly repressive, theocratic regime. Before the Islamic revolution of 1979, Satrapi’s parents participated in anti-Shah marches, believing the eventual revolution would be primarily Marxist in nature. Imagine their shock when the ayatollahs became the revolution’s driving force, and eventual ideological captains. Like many, their sense of betrayal was palpable.Not that their Western ideals excludes Islam. As a child, Satrapi believes herself a prophet, in a lineage with Zoroaster, Jesus, and Mohammed. She has intimate conversations with God to understand her confusion. Later, as an adult, she quotes the Koran fluently when religious police attempt to squelch her voice. But the Satrapis’ religion doesn’t yoke them to the past. History, for them is a march toward secular democracy.This battle between secular and theocratic mostly happens behind closed doors. Satrapi’s parents attend parties where everyone drinks homemade wine, wears neckties, and dances to American rock, emblems of Western excess. On those rare occasions where Iran opens its borders, they smuggle in posters and cassettes of Marjane’s favorite American heavy metal artists. But they also hang blackout curtains and bribe cops, because the state encourages snitching on one’s neighbors.Later, as an adult, Satrapi studies art in Iran’s state-run universities. But Iran’s draconian modesty codes mean that, in life drawing class, the models must wear massive, billowing gowns. Satrapi organizes illicit after-dark classes where peers get to draw tasteful human nudity, in the Renaissance style. Her demands evolve consummately: where once she bought bootleg American music, she graduates to bootleg American contraception.Satrapi’s two-dimensional, black-and-white art, consistent with the comix movement, permits readers to see Iran through her eyes. We can see clashing crowds of protesters and counter-protesters without her having to write long-winded descriptions— and her flat, cartoonish art reveals how screaming ideology strips everyone of individuality. Later, she uses cutaway reveals to expose, say, how women dress beneath the veil, how they express individuality in a state that demands conformity.It’s possible to read Satrapi’s memoirs as moments in Iranian history; that’s how they’re often marketed. A nation’s struggle to overcome its past requires it to decide what future it wants to embrace. Satrapi’s liberal, educated family embraces the homo economicus model, believing an Islamic version of rational humanism will inevitably overtake the country. They simply don’t anticipate the confidence that religious conservatism promises people who feel dispossessed.But like the best classic literature, Satrapi’s memoir is fundamentally about its audience. As Marjane first witnesses her parents’ collisions with religious authority, and later embraces such conflicts herself, it’s impossible to avoid noticing that both sides wear ideological blinders. Satrapi uses absolutist thinking to confront absolutist religion. How often, we wonder, do we ignore our own absolutism? What sacred cows do we refuse to sacrifice, and not even notice?Satrapi sees the world in black-and-white because, essentially, she’s a child. As the story progresses, her art becomes more sophisticated and fully dimensional, because she herself becomes a more sophisticated soul. She loves her people, and when her parents ship her to Europe as a child for safety, she returns as an adult. But eventually, even that collapses under state pressure. To remain human and sane, she has to leave.In some ways, Satrapi retains her childhood aspirations to prophethood, Like Jesus said, a prophet lacks honor in his homeland. By exposing us to the corrupting influences of absolutism, Satrapi encourages us to understand the complexity of fellow humans. We cannot manage change without loving one another; and we cannot love without knowing one another. But Satrapi’s prophecy rejects dogmatism. Truth is messy, because it’s finally made of human beings."}, {"review_sentiment": 5.0, "review_text": "Good."}, {"review_sentiment": 5.0, "review_text": "bitches know this is a standard of gold for graphic novel lovers"}, {"review_sentiment": 1.0, "review_text": "This book is terrible"}, {"review_sentiment": 5.0, "review_text": "I love this graphic novel. This gave me so much insight into the Irian truth as described through this memoir."}, {"review_sentiment": 5.0, "review_text": "Awesome Book"}, {"review_sentiment": 5.0, "review_text": "Loved this book it's worth the read."}, {"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 5.0, "review_text": "Wow.  Great art, great story."}, {"review_sentiment": 3.0, "review_text": "The movie was better. Never thought I'd say that"}]}, "authors": ["Marjane Satrapi"], "isbn": "0375714839", "longitude": 16.3725042, "periods": ["1900s", "Recent Releases"], "title": "The Complete Persepolis", "word_cloud": "year old ayatollah overtook formerly educate school classroom integrate gender find life uprooted turn sideways year tell student choose next year tell student photo textbook blame develop drift nihilistic view life memoir write graphic form first appear french volume height comic craze later reprint volume edition exist comic artist embrace hauteur single minimal editorial permit introspective deeply personal approach tell important theme memoirs contrast family secular upbringing increasingly repressive theocratic regime revolution parent participate march believe eventual revolution primarily nature shock ayatollah become revolution drive force eventual ideological captain many sense betrayal western ideal exclude child believe prophet lineage intimate conversation understand confusion adult quote fluently religious police attempt squelch voice religion yoke past march secular battle secular theocratic mostly happen closed door parent attend party everyone drink homemade wine wear necktie dance american rock emblems western excess rare occasion open border smuggle poster cassette favorite metal artist also hang blackout curtain bribe cop state encourages snitch adult study art university draconian modesty code mean life draw class model massive billowing gown organize illicit class peer get draw tasteful human nudity style demand consummately bought bootleg american music graduate bootleg american art consistent comic movement permit reader see iran eye see clash crowd protester write flat cartoonist art reveals scream ideology strip everyone individuality use cutaway reveals expose say woman dress beneath veil express individuality state demand possible memoir moment iranian history often market nation struggle past require decide future want embrace liberal educate family embrace homo economics model believe version rational humanism inevitably overtake country simply anticipate confidence religious conservatism promise people feel best classic literature fundamentally audience first witness parent collision religious authority later embrace conflict impossible avoid notice side wear ideological blinder satrap us absolutist think confront absolutist religion often wonder ignore absolutism sacred cow sacrifice even notice see world essentially child story progress art becomes sophisticate fully dimensional becomes sophisticated soul love people parent ship child safety return adult eventually even collapse state pressure human sane way retain childhood aspiration prophet hood say prophet lack honor homeland expose corrupt influence absolutism encourage understand complexity fellow humans manage love love know prophecy reject dogmatism messy finally make human being good bitch know standard gold graphic lover terrible love graphic give much insight truth describe memoir love worth great art great story movie better think say", "genres": ["Memoir", "Comics & Graphic Novels"], "summary": "Here, in one volume: Marjane Satrapi's best-selling, internationally acclaimed graphic memoir.\r\n\r\nPersepolis is the story of Satrapi's unforgettable childhood and coming of age within a large and loving family in Tehran during the Islamic Revolution; of the contradictions between private life and public life in a country plagued by political upheaval; of her high school years in Vienna facing the trials of adolescence far from her family; of her homecoming--both sweet and terrible; and, finally, of her self-imposed exile from her beloved homeland. \r\n\r\nIt is the chronicle of a girlhood and adolescence at once outrageous and familiar, a young life entwined with the history of her country yet filled with the universal trials and joys of growing up.\r\n\r\nEdgy, searingly observant, and candid, often heartbreaking but threaded throughout with raw humor and hard-earned wisdom--Persepolis is a stunning work from one of the most highly regarded, singularly talented graphic artists at work today.\r\n\r\n\"A memoir of growing up as a girl in revolutionary Iran, Persepolis provides a unique glimpse into a nearly unknown and unreachable way of life... That Satrapi chose to tell her remarkable story as a gorgeous comic book makes it totally unique and indispensable.\" Time", "asin": "0375714839", "rank": "6464", "city": "Vienna", "image": "https://images-na.ssl-images-amazon.com/images/I/41j0HePe1BL.jpg", "country": "Austria", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}