{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 35.7006177, "ratings": {"num_ratings": 85, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "I'd already read Marjane Satrapi's books Persepolis 1 & Persepolis 2, which I really enjoyed reading a lot.. So I wanted to read another one of her books. I decided to read Embroideries by Marjane Satrapi as it sounded really appealing to me as a graphic novel. It did not disappoint. I loved the writing and artwork contained with in this graphic novel."}, {"review_sentiment": 5.0, "review_text": "Hilariously funny, not to long of a book (read it in a couple hours) but, I highly recommend it either way."}, {"review_sentiment": 5.0, "review_text": "I really enjoy Marjane's work. This is a very interesting piece."}, {"review_sentiment": 2.0, "review_text": "I ordered this book as required by a class I took, but it did not suit my taste."}, {"review_sentiment": 5.0, "review_text": "I embarked on this journey not knowing anything about this book. Sometimes I really like to just pick up a book blindly, not having read the back cover or heard anything about the book. This is due in part to the fact that I judge books by their covers. So my roommate had checked this book out the last time we went to the library and it was a short graphic novel, so I figured I could read it in a short sitting. I absolutely loved it. I like how Satrapi writes, with all of her family sitting around storytelling. I’ve not read Persepolis, although I watched the movie. This was a lovely trip through some family experiences related to marriage in Iran and family values, particularly how they affect women. This is a beautiful way to delve into women’s rights in the Middle East from the perspective of Middle Eastern women themselves, and I really respect how many of these women have different views surrounding sex, their bodies, and men. It’s a rich and full way to explore women’s rights, a way that tends not to be portrayed in media because people tend to push one side or the other, women being conservative and traditional or full-out radical, but this is not reality."}, {"review_sentiment": 5.0, "review_text": "I ordered this book for a friend's birthday as she is a huge fan of Marjane Satrapi.  When the book arrived I think I read it at least 3 times before gifting it to her!If you are a fan of Persepolis then you are already familiar with Satrapi's writing/drawing style.  This book is a little lighter of a read since it does not deal as much with war and politics.  This is a great gift to give to your best girl friend and then swap your own stories inspired by the ones of Marjane and her various friends and family members.  It is an amazing book, as expected."}, {"review_sentiment": 5.0, "review_text": "Enjoyable read, only con is that it was over to fast, I was able to read it in one sitting, Someone hoping for something similar to Persepolis would probably be disappointed, the pacing is entirely different in Embroideries"}, {"review_sentiment": 3.0, "review_text": "amazing work from the author once again although nothing beats Persepolis."}, {"review_sentiment": 5.0, "review_text": "Beautiful. If you liked her previous graphic novels, you will like this one."}, {"review_sentiment": 5.0, "review_text": "Pretty hilarious! I had good laughs while reading this for my fem studies course."}]}, "authors": ["Marjane Satrapi"], "isbn": "0375714677", "longitude": 51.401375, "periods": ["1900s"], "title": "Embroideries", "word_cloud": "already really enjoy read so want decide sound really appeal graphic disappoint love write artwork contain graphic hilariously funny long couple hour highly recommend way really work interesting piece order required class take suit taste embark journey know anything sometimes really pick blindly back cover heard anything due part fact judge cover so check last time go library short graphic figure sit absolutely love like write family sit storytelling watch movie lovely trip family experience related marriage family value particularly affect woman beautiful way delve woman right perspective woman really respect many woman different view surround sex body men rich full way woman right way tend portrayed medium people tend push side woman conservative traditional radical reality order friend birthday huge fan arrive think least time gift fan already familiar style little lighter deal much war politics great gift best girl friend swap story inspire one various friend family member amazing expect enjoyable con fast able sit someone hop something similar probably disappointed pace entirely different amazing work author nothing beat persepolis beautiful like previous graphic novel pretty hilarious good laugh read fem study course", "genres": ["Comics & Graphic Novels"], "summary": "From the best–selling author of Persepolis comes this gloriously entertaining and enlightening look into the sex lives of Iranian women. Embroideries gathers together Marjane’s tough–talking grandmother, stoic mother, glamorous and eccentric aunt and their friends and neighbors for an afternoon of tea drinking and talking. Naturally, the subject turns to love, sex and the vagaries of men.\r\n\r\nAs the afternoon progresses, these vibrant women share their secrets, their regrets and their often outrageous stories about, among other things, how to fake one’s virginity, how to escape an arranged marriage, how to enjoy the miracles of plastic surgery and how to delight in being a mistress. By turns revealing and hilarious, these are stories about the lengths to which some women will go to find a man, keep a man or, most important, keep up appearances. \r\n\r\nFull of surprises, this introduction to the private lives of some fascinating women, whose life stories and lovers will strike us as at once deeply familiar and profoundly different from our own, is sure to bring smiles of recognition to the faces of women everywhere—and to teach us all a thing or two.", "asin": "0375714677", "rank": "276999", "city": "Tehran", "image": "https://images-na.ssl-images-amazon.com/images/I/51S450G3QVL.jpg", "country": "Iran", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}