{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 35, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Such enjoyable prose.  Superb way to learn history.  He completely envelopes the reader in the narrative.  Read the entire series!"}, {"review_sentiment": 3.0, "review_text": "Not as good as Burr or Lincoln.  Narrator was boring. Good plot though"}, {"review_sentiment": 5.0, "review_text": "You cannot beat Gore Vidal.."}, {"review_sentiment": 4.0, "review_text": "In \"1876: A Novel\", Vidal’s work is best when he animates the politicians, most of them now historical footnotes, who dominated the federal government in the year of the American Centennial. These include the outrageous scoundrel J. G. Blaine, the likable adulterer Roscoe Conkling, the lawyerly and obsessive Samuel Tilden, the disingenuous manipulator James Garfield, and the shrewdly corrupt U.S. Grant, who resented the fact that America did not bestow riches upon him after his leadership in the Civil War.IMO, Vidal’s work is almost as good when he recreates a contemporaneous version of New York City. In doing so, he shows both the demimonde, in which James Gordon Bennett, the young, reckless, and cavorting publisher of the New York Herald Tribune, is an enthusiastic participant. And he shows Gilded Age New York, as he simulates the social milieu of Mrs. Astor and Ward McAllister, her society arbiter. Also in this historical mix is William Cullen Bryant, who was the editor at the Evening Post, a leading Republican newspaper.Tying these two worlds together is Vidal’s narrator, Charles Schermerhorn Schuyler, who is a 63 year-old journalist who has returned to America after more than thirty years in Europe, mostly in Paris; and Charlie’s thirty-something daughter Emma, who is the widow of a minor French nobleman. Charlie, who lost his fortune in the Panic of 1873, must both make his living as a journalist and do what he can to find a suitable husband for Emma.Emma is an interesting character. She is beautiful but practical and realizes she needs a well-to-do husband. Further, she is adept in high society, where she is regaled as a French princess and esteemed guest. At the same time, Charlie believes she is fully aware of the shallowness of society. And near the end of \"1876: A Novel\", Vidal drops a bombshell and Charlie is forced to confront Emma, who may have done something truly evil.Charlie Schuyler, in contrast, never really jells as a character. What he is, instead, is a cluster of roles the Vidal had to attribute to someone in order to make his novel work. He’s an experienced journalist who has written from Europe for both the Herald Tribune and the Evening Post. And his daughter is a minor French aristocrat. This gives him access to society, politicians, and the newspapers, which are covering the Grant Administration and the 1876 election. It’s all plausible; there could have been such a person. But Charlie never becomes more than Vidal’s fly on the wall. IMHO, he also suffers from terminal hauteur, which makes him dull.There is, btw, some inside-baseball in \"1876: A Novel\" that’s amusing. The best is Charlie on a visit with Ward McAllister to an estate in Rhinebeck, New York. There, the house was “a fine example of the Greek style… Six tall columns form a portico that overlooks a sweep of lawn ending in willow trees and the Hudson River. The house is beautifully proportioned with a north wing consisting of a single octagonal room two stories high and lit by a glass cupola that must make it unpleasantly hot in the summer and impossible to heat in the winter.” And guess who owned that house in 1976, when \"1876: A Novel\" was published?Rounded up and sorta recommended."}, {"review_sentiment": 4.0, "review_text": "I have regarded Gore Vidal with great ambivalence, admiring, among only a handful of his writings that I have tried,  City and the Pillar and not much else other than some of  his political writings.So, I was most surprised to encounter this masterfully wrought work.  So even handed in the writing, and such an education in the era in which it is set; A shocking story of presidential campaign corruption makes today's DC perhaps look timid in comparison.A very fine read, indeed."}, {"review_sentiment": 5.0, "review_text": "This is the first novel of Gore Vidal that I have read, and will certainly not be the last. Admittedly, by not having read him earlier, there was a major lacuna in my historical and literary American perspective.  The title intrigued: a bit more than a decade after the Civil War, the latter subject of which I have read my share. A historical “cusp,” with the effects of the Civil War still apparent, holding back the desire to “get on with life.” It was about a period in which I knew little.  Who was President, and how they obtained office was a bit “fuzzy.” Vidal’s well-written historical novel provided much illumination. It was written on the American bi-centennial, about events 100 years earlier. The most astonishing aspect are the “rhymes” of history, a more nuanced way of indicating how often history repeats itself. In writing about the stolen Presidential  Election of 1876,Vidal would foreshadow many aspects of the stolen election in the year 2000. And it also is very much about family, and the aging process.The novel is told from the point of view of Charles Schermerhorn Schuyler. He was sent to France as a Minister during the administration of Martin Van Buren (in the late 1830’s), and stayed abroad for more than three and a half decades. He is returning to the United States at the end of 1875, with his daughter Emma, who sports the title “Princess d’Agrigente.” All of which is a bit “passé,” since her husband, who obtained his “nobility” from Napoleon III is dead, as is the Second Empire, as well as Napoleon III himself, and thus Emma’s “nobility” seems to carry far more weight in post-Civil War America than the new Third Republic of post-Sedan France. Father and daughter had survived the Commune in Paris; he is a bit famous for having written a book about it. Coming back to America after that many years abroad, and he feels like “Rip Van Winkle.”  It resonated.The novel is well constructed and written. Schuyler has to reestablish himself as a writer in America. In the process, Vidal provides a tour-de-force of the American economic and political elite, and thus there are really only two cities: New York and Washington. The Astor’s, the “Railroad Barons” and the corruption within the administration of US Grant all are thick strands woven throughout the novel.  Why was the Grant administration so corrupt?  Vidal postulates that he was still sore about not having been properly remunerated for having saved his country as Wellington and Marlborough were, so he was willing to turn a blind eye to the \"sticky fingers\" that several of his ex-general buddies had. Also, Gore postulates in the action  that Schuyler – who is fictional – is the illegitimate son of Aaron Burr – but also subscribes to the dubious proposition that the non-fictional Van Buren is as well.My “page-turning” speed increased as Vidal depicts the stolen election of 1876. The Governor of New York, Samuel Tilden, won the election, flat out. (Schuyler was a Tilden confidant, and hoped to be named Ambassador to France). Tilden had a 3% margin in the popular vote. But then through the machination involving the Electoral College, the use of Federal troops in “un-reconstructed” Southern states, and old-fashioned hard cash, Rutherford B. Hayes, a candidate who won ZERO votes in the first round of the Republican National Convention became President. And the Rhymes?  The state of Florida was a key battleground in the fraud, Tilden, inexplicably would not fight as hard as Hayes, and in the end, the President was decided by ONE MAN: Joseph Bradley.The minor notes, the personal ones, also turned into major ones. The aging process, and its impact on a man of 63 is also a sub-theme. And of the family? Vidal faithfully depicts a basically loving, but somewhat distant relationship between Schuyler and his daughter, Emma. But after the climax of the stolen election, when I thought that I was in the winding-up denouement stage of the novel, Vidal throws a hard-strike on the inside corner that knocks you back with the question: Can you ever really know your own daughter? Hum. Overall, an excellent 5-star, plus novel."}, {"review_sentiment": 4.0, "review_text": "This book was interesting because of its cynicism -- Vidal was writing about 1876 and the corruption of American politics but it really felt like a critique of his own times. I was unaware of much of this history and so appreciated Vidal's insights and research. But, the characters were not as vibrant and interesting as in other books in the Empire series and the reader really had no heroes or heroines to root for."}, {"review_sentiment": 4.0, "review_text": "I first read this book, set in our country's centennial year, when it came out in time for our bicentennial in 1976.  I was then about the same age as its protagonist, Charlie Schuyler, was in the book's prequel, \"Burr\"; now I am almost as old as Charlie is in 1876, though hopefully in much better physical shape--how fat everyone was then being one of Vidal's major themes.1876 now comes across is a bit dated: it's ironic that notwithstanding his radical politics and flamboyant lifestyle, Vidal was a fairly traditional novelist. That said, it provides a fascinating portrait of New York and Washington, DC during the Gilded Age.  The book is now out of print--thank you, Amazon for working with used bookstores to provide \"lost treasures\"--I hope that it and the other volumes in Vidal's \"Narratives of Empire\" series will soon be reissued as a set."}, {"review_sentiment": 4.0, "review_text": "Good book. Not sure how much liberty the writer took with the facts ina historical novel."}, {"review_sentiment": 5.0, "review_text": "Great novel!"}]}, "authors": ["Gore Vidal"], "isbn": "0375708723", "longitude": 0.0, "periods": ["1800s", "1900s"], "title": "1876", "word_cloud": "such enjoyable prose way learn history completely envelop narrative entire series not good bore plot beat work best animate politician historical footnote dominate federal government year american include outrageous scoundrel likable adulterer lawyer obsessive disingenuous manipulator shrewdly corrupt resent fact bestow rich leadership work almost good recreates contemporaneous version show demimonde young reckless cavort publisher enthusiastic participant show simulate social milieu society arbiter also historical mix editor leading world together narrator journalist return thirty year mostly daughter widow minor french nobleman lose fortune living journalist find suitable husband interest character beautiful practical realizes need husband adept high society regale french princess esteem guest time believe fully aware shallowness society near end drop bombshell force confront do something truly contrast never really jell character instead cluster role attribute someone order make work experience journalist write daughter minor french aristocrat give access society politician newspaper cover election plausible person never become fly wall also suffer terminal hauteur make amuse best visit estate house fine example tall column form portico overlook sweep lawn end willow tree house beautifully proportion north wing consist single octagonal room story high lit glass cupola unpleasantly hot summer impossible heat guess own house publish sorta recommend regard great ambivalence admire handful writing try much else political surprise encounter masterfully wrought work so even hand write education era set shock story presidential campaign corruption make today perhaps timid fine indeed first certainly last admittedly earlier major lacuna historical literary american perspective title intrigued bit decade latter subject share historical cusp effect still apparent hold back desire get period know little obtain office bit historical provide much illumination write american event year earlier astonishing aspect rhyme history nuanced way indicate often history repeat write steal presidential many aspect steal election year also much family age tell point view send administration late stay abroad half decade return end daughter sport title bit pas husband obtain nobility dead well thus nobility seem carry far weight new daughter survive bit famous write back many year abroad feel well construct write reestablish writer process provide american economic political elite thus really city corruption administration thick strand weave administration corrupt postulate still sore properly remunerate saved country willing turn blind eye sticky finger several buddy also postulate action fictional illegitimate son also subscribe dubious proposition speed increase depict steal election election flat confidant hop name margin popular vote machination involve use troop state hard cash candidate vote first round become state key battleground fraud inexplicably hard end decide minor note personal one also turn major one age process impact man also family faithfully depict basically love somewhat distant relationship daughter climax stolen election think denouement stage throw corner knock question ever really daughter excellent plus interesting cynicism write corruption american politics really felt critique time unaware much history appreciate insight research character vibrant interesting series really hero heroine root first set country centennial year come time bicentennial age protagonist prequel almost old hopefully much better physical shape fat everyone major come bit dated ironic notwithstanding radical politics flamboyant lifestyle fairly traditional novelist say provide fascinating portrait print thank work use bookstore provide lose treasure hope volume series soon reissue set good not sure much liberty writer take fact ina historical great", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "Book 3/7 in the Narratives of Empire Series\r\n\r\nGore Vidal's Narratives of Empire series spans the history of the United States from the Revolution to the post-World War II years. With their broad canvas and large cast of fictional and historical characters, the novels in this series present a panorama of the American political and imperial experience as interpreted by one of its most worldly, knowing, and ironic observers.\r\n\r\nThe centennial of the United States was celebrated with great fanfare--fireworks, exhibitions, pious calls to patriotism, and perhaps the most underhanded political machination in the country's history: the theft of the presidency from Samuel Tilden in favor of Rutherford B. Hayes. This was the Gilded Age, when robber barons held the purse strings of the nation, and the party in power was determined to stay in power. \r\n\r\nGore Vidal's 1876 gives us the news of the day through the eyes of Charlie Schuyler, who has returned from exile to regain a lost fortune and arrange a marriage into New York society for his widowed daughter. And although Tammany Hall has faltered and Boss Tweed has fled, the effects of corruption reach deep, even into Schuyler's own family.\r\n\r\n\"Vidal writes so well that you find yourself holding your breath over something that is a foregone conclusion. . . . Vidal's talent makes the bloated characters of Washington live in a way history books don't.\"  The Boston Globe", "asin": "0375708723", "rank": "183662", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/513QFpCjubL.jpg", "country": "Washington D.C.", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}