{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 42, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "A terrific read, beautiful and provocative prose and excellent illustrations."}, {"review_sentiment": 3.0, "review_text": "Learned a LOT about Spain I didn't know!"}, {"review_sentiment": 5.0, "review_text": "This is a tremendous biography/critical appraisal by one of the world's top art critics of the artist with whom he had a lifelong obsession.  I knew little about Goya when I started this, but with Hughes as a guide, not just to Goya but to Spanish history, I found reading the book and viewing the illustrations quite rewarding.  The publishers did a great job with the placement of the pictures. That is, if Hughes comments about a specific picture on page 211, the picture is nearby, with a page or two at the most.  If you enjoy Hughes as a writer you might also try The Fatal Shore, Barcelona or Rome."}, {"review_sentiment": 5.0, "review_text": "great book,"}, {"review_sentiment": 5.0, "review_text": "Goya is one of the greatest artists who ever lived:  a court artist for kings, he also observed not only the common people, but the state of his mind, in the process creating a series of masterpieces that entered completely new territories.  I have been fascinated by his work for my entire life, and only now have I found a book that explores and interprets what he did in a way that really speaks to me.  Perhaps only Hughes could have done it - he was obsessed with Goya as well.He started off as a pretty conventional artist, as an apprentice, married correctly for court connections, and worked.  This was in the late Baroque period, and Goya became a popular artist for \"cartoons\" to be displayed in parlors of the rich - images of robberies, idyllic scenes, and popular stories.  Spain at the time was an extremely backward country, mired in feudal traditions that were blocking the modernization of its economy and society.  It didn't help that a reformist king, Carlos 3, had allowed his do-nothing son Carlos 4 to succeed him.At the time, Velasquez and others were experimenting with realistic character portraiture, which Goya mastered better than just about anyone.  He quickly found aristocratic patrons, particularly acolytes of the Spanish Enlightenment, or Ilustración.  They saw his talent and engaged him so that he could paint for them rather than for the cash-strapped church or the cartoons that bored him after 10 years of work.  The result are portraits of such exceptional discernment and intensity that they alone would have won him a place in art history.  He earned a place as the artist of the Royal Court of the last Bourbons; both Carloses loved his work.At the same time, he experimented with a number of media, particularly lithography.  Laboring apparently in solitude, he produced a series, Los Caprichos, that can only be described as surrealistic allegories.  There are donkeys playing the piano, witches, and owls springing from a sleeping man's head, like a precursor of Dali.  They can be interpreted in a myriad of ways, from an exploration of his own unconscious to an ironic reflection of the soul of his time - with the revived Inquisition, the fear of change, and simple human doubt at the decadent state of a kingdom unable to reform itself.  Though no one wanted them, Goya had meant them to be popular.  It was these images that got me started on Goya, and Hughes interprets them without jargon or the imposition of hyper-intellectual theories.  For me, it struck a perfect balance of art criticism and biography - in detailed historical context.From this stable position, everything was thrown into chaos by the Invasion of Napoleon's forces, resulting in the first guerilla war, i.e. a \"small\" war, that depended more on rebel skirmishes than the broad infantry engagements that suited the French forces.  Once again, Goya observed the carnage and suffering, this time in one of the most vicious wars of the century.  He expressed his feelings in a series of paintings and etchings that are at once realistic and as if from a nightmare, again approaching surrealism in their psychological agony.  He was, according to Hughes, the first person to accurately portray the true horrors of war, initiating a genre of historical realism along with allegory.  These are the images of corpses in trees, men before firing squads, and children weeping alongside dead adults.  Once again, this work was under-appreciated, only resurfacing 50 years after he was dead and forgotten.Of particular interest are the murals that he did in his home, the Black Paintings that were apparently only meant for himself.  These are some of the most disturbing and reviled images that have ever appeared, including the Floating Fates (a mystery because there are 4 and not the traditional 3) and Saturn Eating his Children, which art history books describe as the most hated painting of all time.  We have no idea what it means, he left no indications other than the images themselves.  Rediscovered later, they were painstakingly transferred to canvases for preservation.  If you are ever in Madrid, you must go to the Prada to see them - there has never been any like them before or since, they evoke a mood of despair and fear that cannot be described in words.The book is beautifully produced, on glossy pages with images interspersed throughout the text; this does make the book rather heavy, which makes casual reading somewhat difficult.  Of course, the format is too small for the reproductions to have a full impact, but they are necessary for the flowing narrative that Hughes offers.There are some questions I found unanswered, though of course so much is unknown about why Goya did what he did.  I would have liked a clearer idea of when he was re-discovered and how he work came to be known, for example.Recommended with enthusiasm.  This is one of the best art bios I have ever read."}, {"review_sentiment": 3.0, "review_text": "It was for school."}, {"review_sentiment": 5.0, "review_text": "The late Robert Hughes was a great critic and a wonderful writer.  By far the best book I have read on Goya!!"}, {"review_sentiment": 5.0, "review_text": "An excellent lively account which flows quickly. Provides a good overview of Spain at the end of the 18thC, a country of contrasts and great inequality. Hughes covers Goya's working life of 60 odd years and the historical context of a tumultuous Spain as Goya progressed from a talented but relatively junior painter of cartoons for the Royal Tapestry factory to court painter, society portraitist and social and political observer. Hughes' lively writing includes highly amusing pen pictures of several historical figures,e.g. Carlos IV.  I only wished I had read it before my recent visit to the Museo del Prado"}, {"review_sentiment": 5.0, "review_text": "I used this book for a paper on Goya in my college level art history class and it is INCREDIBLE. Hughes does an amazing job of analyzing pieces and really highlighting pieces I didn't expect. I'm so glad I bought it, I recommend it to everyone!"}, {"review_sentiment": 5.0, "review_text": "an art historical approach to the great painter's oeuvre with great reproductions"}]}, "authors": ["Robert Hughes"], "isbn": "0375711287", "longitude": -3.7035825, "periods": ["1700s", "1800s"], "title": "Goya", "word_cloud": "terrific beautiful provocative prose excellent illustration learn know tremendous appraisal world top art critic artist lifelong obsession know little start guide spanish history find read view illustration quite reward publisher great job placement picture comment specific picture page picture nearby page enjoy writer also great greatest artists ever live court artist king also observe common people state mind process create series masterpiece enter completely new territory fascinate work entire life find explores interpret way really speak perhaps do obsess start pretty conventional artist apprentice marry correctly court connection work late period become popular artist cartoon display parlor rich image robbery idyllic scene popular story time extremely backward country mire feudal tradition block modernization economy society help king allow son time others experiment realistic character portraiture master better anyone quickly find aristocratic patron particularly acolyte spanish saw talent engage rather church cartoon bore year result portraits exceptional discernment intensity alone art history earn place artist last love time experiment number medium particularly lithography labor apparently solitude produced series describe surrealistic allegory donkey play piano witch owls spring sleep man head precursor interpret myriad way exploration unconscious ironic reflection soul time revive fear change simple human doubt decadent state kingdom unable reform want mean popular image get start interpret jargon imposition theory struck perfect balance art criticism biography detail historical stable position everything thrown chaos force result first guerrilla war small war depend rebel skirmish broad infantry engagement suit french force once observe carnage suffering time vicious war century express feeling series painting etching realistic nightmare approach surrealism psychological agony accord first person accurately portray true horror war initiate genre historical realism allegory image corpses tree men fire squad child weep alongside dead adult once work resurface year dead particular interest mural home apparently mean disturb revile image ever appear include float fate mystery traditional art history describe hat painting time idea mean left indication image later painstakingly transfer canvas preservation ever never evoke mood despair fear describe beautifully produce glossy page image intersperse text make rather heavy make casual reading somewhat difficult course format small reproduction full impact necessary flow narrative question find unanswered course much clearer idea work come know enthusiasm best art bios ever school late great critic wonderful writer far best excellent lively account flow quickly good overview end country contrast great inequality cover work life odd year historical context tumultuous progress talented relatively junior painter cartoon factory court painter society portraitist social political observer lively write include highly amusing pen picture several historical figure wish recent visit lead use paper college level art history class amaze job analyze piece really highlight piece expect glad buy recommend everyone art historical approach great painter oeuvre great reproduction", "genres": ["Biography", "Art & Architecture", "History"], "summary": "Robert Hughes, who has stunned us with comprehensive works on subjects as sweeping and complex as the history of Australia (The Fatal Shore), the modern art movement (The Shock of the New), the nature of American art (American Visions), and the nature of America itself as seen through its art (The Culture of Complaint), now turns his renowned critical eye to one of art history’s most compelling, enigmatic, and important figures, Francisco José de Goya y Lucientes. With characteristic critical fervor and sure-eyed insight, Hughes brings us the story of an artist whose life and work bridged the transition from the eighteenth-century reign of the old masters to the early days of the nineteenth-century moderns. \r\n\r\nWith his salient passion for the artist and the art, Hughes brings Goya vividly to life through dazzling analysis of a vast breadth of his work. Building upon the historical evidence that exists, Hughes tracks Goya’s development, as man and artist, without missing a beat, from the early works commissioned by the Church, through his long, productive, and tempestuous career at court, to the darkly sinister and cryptic work he did at the end of his life. \r\nIn a work that is at once interpretive biography and cultural epic, Hughes grounds Goya firmly in the context of his time, taking us on a wild romp through Spanish history; from the brutality and easy violence of street life to the fiery terrors of the Holy Inquisition to the grave realities of war, Hughes shows us in vibrant detail the cultural forces that shaped Goya’s work. \r\n\r\nUnderlying the exhaustive, critical analysis and the rich historical background is Hughes’s own intimately personal relationship to his subject. This is a book informed not only by lifelong love and study, but by his own recent experiences of mortality and death. As such this is a uniquely moving and human book; with the same relentless and fearless intelligence he has brought to every subject he has ever tackled, Hughes here transcends biography to bring us a rich and fiercely brave book about art and life, love and rage, impotence and death. This is one genius writing at full capacity about another—and the result is truly spectacular.", "asin": "0375711287", "rank": "355917", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51Y6QTPP4WL.jpg", "country": "Spain", "story_arc": ["Tragedy", "Things only get worse"]}