{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 32, "rating": 3.7, "reviews": [{"review_sentiment": 1.0, "review_text": "Oh man, where to start.This book is pretty disjointed. The characters are hardly developed and the entire novel is a big downer.. the main character makes poor decisions one after another as she continues to make it clear to everyone around her, unknowingly to the reader, hates her home country of America. Due to this disdain she leaves to live in Mexico with literally no plan other than to freeload on a dude she hardly knows and his friends until opportunities are handed to her. Can't make rent but you're drunk everyday? Yeah let me flock to read this compelling story of your life struggles."}, {"review_sentiment": 4.0, "review_text": "thnaks"}, {"review_sentiment": 4.0, "review_text": "My first graphic novel I have read, I really enjoyed it, and thought it was a fun way to read a book! The plot ends a little unsatisfying-ly for myself, however, I would not let that discourage you from trying to read a graphic novel!"}, {"review_sentiment": 5.0, "review_text": "Jessica Abel logra capturar el sentimiento de la Ciudad de México, y yo sentí como que conocía a todos sus personajes.Jessica Abel captures the feeling of Mexico City, and I felt as if I knew each one of her characters"}, {"review_sentiment": 5.0, "review_text": "Fabulous book!! Recommended."}, {"review_sentiment": 5.0, "review_text": "I just wish she had more comics out there. I loved art babe, and La Perdida is wonderful!"}, {"review_sentiment": 5.0, "review_text": "The book was for my son's college course.  It was in great shape."}, {"review_sentiment": 5.0, "review_text": "Good Book!"}, {"review_sentiment": 2.0, "review_text": "Didn't really care for the story.  The protagonist is whiny, self-centered , immature, PIA.  It was hard to get through the entire book because I just wanted to slap her.  The only reason I finished it is because it was a required book for a Modern Topics in American Lit class I was taking."}, {"review_sentiment": 3.0, "review_text": "The book arrived on time as ordered.  Reading through it is iffy.  The artistry is good and the story appears interesting.  However, I had to read the book for a college class and it's honestly just not that engrossing.  I'm sure many people will like it, just not a page turner in my opinion. C4."}]}, "authors": ["Jessica Abel"], "isbn": "0375714715", "longitude": -99.1333416, "periods": ["2000s", "Recent Releases"], "title": "La Perdida", "word_cloud": "man pretty disjoint character hardly develop entire big main character make poor decision continue make clear everyone around unknowingly hat home country disdain leaf live literally plan freeload dude hardly know friend opportunity hand rent drunk everyday let flock compel story life struggle thanks first graphic really enjoy think fun way plot end little however try graphic logra capture sent como we conocía dodo such capture feel felt know character recommend wish comic love art babe wonderful son college course great shape good book really story protagonist whiny immature hard get entire want reason finish require class take arrived time order artistry good story appear interesting however college class honestly engross sure many people page turner opinion", "genres": ["Comics & Graphic Novels", "Fiction & Literature"], "summary": "From the Harvey and Lulu award–winning creator of Artbabe comes this riveting story of a young woman’s misadventures in Mexico City. Carla, an American estranged from her Mexican father, heads to Mexico City to “find herself.” She crashes with a former fling, Harry, who has been drinking his way through the capital in the great tradition of his heroes, William S. Burroughs and Jack Kerouac. Harry is good—humored about Carla’s reappearance on his doorstep—until he realizes that Carla, who spends her days soaking in the city, exploring Frida Kahlo’s house, and learning Spanish, has no intention of leaving.\r\n\r\nWhen Harry and Carla’s relationship of mutual tolerance reaches its inevitable end, she rejects his world of Anglo expats for her own set of friends: pretty-boy Oscar, who sells pot and dreams of being a DJ, and charismatic Memo, a left-wing, pseudo–intellectual ladies’ man. Determined to experience the real Mexico, Carla turns a blind eye to her new friends’ inconsistencies. But then she catches the eye of a drug don, el Gordo, and from that moment on her life gets a lot more complicated, and she is forced to confront the irreparable consequences of her willful innocence.\r\n\r\nJessica Abel’s evocative black–and–white drawings and creative mix of English and Spanish bring Mexico City’s past and present to life, unfurling Carla’s dark history against the legacies of Burroughs and Kahlo. A story about the youthful desire to live an authentic life and the consequences of trusting easy answers, La Perdida–at once grounded in the particulars of life in Mexico and resonantly universal–is a story about finding oneself by getting lost.", "asin": "0375714715", "rank": "296349", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/61QeWKqntUL.jpg", "country": "Mexico", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}