{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 51.2085526, "ratings": {"num_ratings": 95, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I am loving it.  It is a very good read"}, {"review_sentiment": 5.0, "review_text": "Dorothy Dunnett is a brilliant storyteller and the beginning of this series lives up to her reputation as the very best historical fiction writer"}, {"review_sentiment": 4.0, "review_text": "Well written, good character development of main characters but sometimes there were too many characters.  Interesting twist at the right time in the story."}, {"review_sentiment": 5.0, "review_text": "Doubtless there are many reviews of the content of this novel, it's history and characters. Dennett tells the story not through a relentless narrative, but with hints and feints like she's fencing with her reader until all the pieces come together. At the same time she does a wonderful job of world building, full of smells and dust and noises from the crowd. I found myself sneaking time away from my day to read a few more pages."}, {"review_sentiment": 5.0, "review_text": "Book arrived on time, in good condition and at a good price.  Unfortunately, the book was not completely to my liking."}, {"review_sentiment": 5.0, "review_text": "Great book and with so many characters and intrigues.  I started the book wondering if I would continue, to be drawn in further and further and just loved it.  Great writing, link to historical facts and robust characters.  A splendid read."}, {"review_sentiment": 5.0, "review_text": "This is the wonderful first volume of Dorothy Dunnett's series, \"The House of Niccolò.\" A rollicking adventure in mid 15th century Flanders and Italy. For a historian, it's absolutely true to the time and place. Immerse yourself in this romantic adventure."}, {"review_sentiment": 5.0, "review_text": "Wow !!! What a book.  You need to advertise this a lot so everybody can read these books.  Can't wait to startthe next book in the series."}, {"review_sentiment": 5.0, "review_text": "As usual, Dunnett provides a meticulously researched view of a world too unfamiliar to most of us, featuring protagonists who are highly intelligent -- indeed, like every Dunnett book, the more often you reread it, the more fun you have with it. The set piece with the ostrich is a classic scene that has stayed with me for almost 30 years."}, {"review_sentiment": 4.0, "review_text": "Dorothy Dunnett is an amazing author! Her extensive historical research is a huge addition to the book and helps the reader understand what life may have often been like in the times written (depending on your occupation). I especially enjoy the vicarious traveling with the characters."}]}, "authors": ["Dorothy Dunnett"], "isbn": "0375704779", "longitude": 3.226772, "periods": ["500-1400s"], "title": "Niccolò Rising: The First Book of The House of Niccolò", "word_cloud": "love good brilliant storyteller begin series live reputation best historical fiction writer well write good character development main character sometimes many character interest twist right time story many review content history character tell story relentless narrative hint feint fence piece together time wonderful job world build full smell dust noise crowd find sneak time away day page arrive time good condition good price unfortunately completely like many character intrigue start wonder drawn love write link historical fact robust character splendid wonderful volume series rollicking adventure mid century flanders historian absolutely true time place romantic adventure need lot everybody wait start the next series usual provide meticulously research view world unfamiliar feature protagonist highly intelligent indeed often reread fun set piece ostrich classic scene stay almost year amaze author extensive historical research huge addition help understand life often time write depend occupation especially enjoy vicarious travel character", "genres": ["Fiction & Literature", "Historical Fiction", "Renaissance"], "summary": "In this first book of The House of Niccolò series, the author of the Lymond Chronicles introduces a new hero, Nicholas vander Poele of Bruges, the good-natured dyer's apprentice who schemes and swashbuckles his way to the helm of a mercantile empire.\r\n\r\nWith the bravura storytelling and pungent authenticity of detail she brought to her acclaimed Lymond Chronicles, Dorothy Dunnett, grande dame of the historical novel, presents The House of Niccolò series. The time is the 15th century, when intrepid merchants became the new knighthood of Europe. Among them, none is bolder or more cunning than Nicholas vander Poele of Bruges.\r\n\r\nNiccolò Rising, Book One of the series, finds us in Bruges, 1460. Jousting is the genteel pastime, and successful merchants are, of necessity, polyglot. Street smart, brilliant at figures, adept at the subtleties of diplomacy and the well-timed untruth, Dunnett's hero rises from wastrel to prodigy in a breathless adventure that wins him the hand of the strongest woman in Bruges and the hatred of two powerful enemies. From a riotous and potentially murderous carnival in Flanders, to an avalanche in the Alps and a pitched battle on the outskirts of Naples, Niccolò Rising combines history, adventure, and high romance in the tradition stretching from Alexandre Dumas to Mary Renault. ", "asin": "0375704779", "rank": "485990", "city": "Bruges", "image": "https://images-na.ssl-images-amazon.com/images/I/51YEuJxAhnL.jpg", "country": "Belgium", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}