{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 209, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Love this book - Ellroy's best and a really cool look into the JFK conspiracy with fictionalized versions of historical figures. I don't normally post reviews for books but after seeing this one had so few reviews (it was published in 1995, never made into a TV series) I'm writing this one. It's one of my favorite novels and I highly recommend it. Classic James Ellroy style with a great plot that will make you think twice about what happened to Kennedy"}, {"review_sentiment": 5.0, "review_text": "Great service abd great buy. Thank you"}, {"review_sentiment": 5.0, "review_text": "WOW! Don't know how much is fact or fiction. Or conspiracy. I found it fascinating. Recommend it."}, {"review_sentiment": 5.0, "review_text": "Who knew"}, {"review_sentiment": 5.0, "review_text": "Three main characters & an all star cast of celebs, gangsters, miscreants & malcontents makes this one of my favorite books of the last year. I didn't catch the hype in 95', but I will spread it now."}, {"review_sentiment": 5.0, "review_text": "A profane, hellish vision. Focused and unflinching, like a jaguar three feet from a 200 pound meal. All the racism of the era, and the bigotry. A tale of hookers, Hollywood, and fratricide pumped through a junky's spike. Jack's political marriage, the girls he screwed, and that savoir faire. Bobby screwed the mob, with a rosary coda. Mr. Hoover only screwed power."}, {"review_sentiment": 5.0, "review_text": "This is one of my five favorite books, along with Ellroy's Killer on the Road. There are a million reviews so I won't describe the plot, just to say that it brilliantly mixes fiction and reality- similar to Don DeLillo's Libra about Lee Harvey Oswald and the CIA. This book is extremely violent and brutal. Ellroy writes these sentences and reading them feels like getting punched in the stomach. His words have a power about them which is why this is one of my favorite books ever written. Ellroy re-tells the Kennedy era his way, and it has a very realistic feel to it, as long as you have a genuinely negative view of people. In other words, there are no noble heroes in this book, no one is anywhere close to that. These people are monsters and they live in a world of extreme violence. I remember shaking while I read some of this. I had never experienced a book with such power. Not for everyone it is extremely violent and provides a negative version of America- but one has to admit that it is incredibly realistic. If you like this, you will probably enjoy his other crime noir novels like LA Confidential, or even his extremely personal book about his search for answers regarding his mother who was brutally murdered in LA when Ellroy was a child- My Dark Places."}, {"review_sentiment": 5.0, "review_text": "Excellent story and well paced with lots of interesting twists."}, {"review_sentiment": 4.0, "review_text": "As a lifelong Angelino, I appreciate how he intertwines historical fact with fiction utizing the vernacular of the period.  It lends a sense of authenticity to the reading."}, {"review_sentiment": 5.0, "review_text": "Ellroy is an incredible writer who writes compelling stories about very bad men doing very bad things. American Tabloid tells Ellroy's version of the events surrounding JFK's election, the Bay of Pigs invasion, and JFK's assassination. The story is told through the eyes of the an FBI agent, a double agent for the FBI and CIA, and an ex LA sheriff working as a fixer/dope procurer for Howard Hughes.I love this book, and can't say enough positive things about it. The two sequels, The Cold Six Thousand and Blood's a Rover are also great books and well worth your time. If you love crime stories, historical fiction, and colorful characters with colorful dialogue, do yourself a favor and read these books, or just about anything else by James Ellroy."}]}, "authors": ["James Ellroy"], "isbn": "037572737X", "longitude": -80.1936589, "periods": ["1900s"], "title": "American Tabloid", "word_cloud": "best really cool look conspiracy fictionalize version historical figure normally post review see review publish never make tv series write favorite novel highly recommend classic style great plot make twice happen service bad great buy much fact fiction conspiracy find fascinate know main character star cast celebs gangster miscreant malcontent make favorite last year catch hype spread profane hellish vision focus unflinching jaguar foot pound meal racism era bigotry tale hooker fratricide pump hunky spike political marriage girl screw savior afire screw mob rosary coda screw power favorite review plot say brilliantly mix fiction similar extremely violent brutal write sentence read feel get punch word power favorite ever write era way realistic feel long genuinely negative view people word noble hero anywhere close people monster live world extreme violence remember shake never experience power not everyone extremely violent provide negative version admit incredibly realistic probably crime nor novel even extremely personal search answer regard mother brutally murder place excellent story well paced lot interest twist lifelong appreciate intertwines historical fact fiction utilize vernacular period lend sense authenticity reading incredible writer write compel story bad men bad thing tell version event surround election invasion assassination story tell eye agent double agent ex sheriff work procurer love enough positive thing sequel also great well worth time love crime story historical fiction colorful character colorful dialogue favor anything else", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 1/3 in Underworld USA series\r\n\r\nThe '50s are finished. Zealous young senator Robert Kennedy has a red-hot jones to nail Jimmy Hoffa. JFK has his eyes on the Oval Office. J. Edgar Hoover is swooping down on the Red Menace. Howard Hughes is dodging subpoenas and digging up Kennedy dirt. And Castro is mopping up the bloody aftermath of his new communist nation.\r\n\r\nIn the thick of it: FBI men Kemper Boyd and Ward Littell. They work every side of the street, jerking the chains of made men, street scum, and celebrities alike, while Pete Bondurant, ex-rogue cop, freelance enforcer, troubleshooter, and troublemaker, has the conscience to louse it all up.\r\n\r\nMob bosses, politicos, snitches, psychos, fall guys, and femmes fatale. They're mixing up a molotov cocktail guaranteed to end the country's innocence with a bang. Dig that crazy beat: it's America's heart racing out of control. . . .\r\n\r\n\"A SUPREMELY CONTROLLED WORK OF ART.\" The New York Times", "asin": "037572737X", "rank": "158856", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/6162WwTkg%2BL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}