{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 28, "rating": 3.3, "reviews": [{"review_sentiment": 2.0, "review_text": "Truly enjoy Boyd's descriptive skills. Story would have been more satisfying witha confrontational comeuppance of Hogg."}, {"review_sentiment": 4.0, "review_text": "Quirky but good."}, {"review_sentiment": 4.0, "review_text": "Typically good work by the very busy Mr. Boyd."}, {"review_sentiment": 3.0, "review_text": "Quite a strange story, which took a while to get into.nhowever ,it was very well written."}, {"review_sentiment": 4.0, "review_text": "Good writing, interesting story."}, {"review_sentiment": 4.0, "review_text": "Great read. Boyd's character development second to none. Wonder if he'll ever introduce a twist to an ending?"}, {"review_sentiment": 4.0, "review_text": "I like this book for it exceptionally beautiful writing. One should have a very sharp imagination to make an exciting story  of the life of an insurance agent. I was not ready to give the book its well-deserved five stars since I was a little disappointed by its vague ending which  is somehow  characteristic for my beloved author Mr. Boyd/"}, {"review_sentiment": 2.0, "review_text": "The plot is dishevelled and waffly. The narrator is a bit dull and it is difficult to care what befalls him . The villians were better written . Jupiter was the most interesting character in the novel."}, {"review_sentiment": 4.0, "review_text": "Not the best of Boyd, but very readable just the same. A convincing story with unexpected turnings. One for the archives."}, {"review_sentiment": 3.0, "review_text": "William Boyd's 1998 detective-genre novel centers on a complicated insurance fraud scheme set in London and the efforts of Lorimer Black, an up-and-coming insurance loss adjuster, to sort out the scam and collect the substantial bonus he expects for his good work. The book has all the ingredients of a good read, a gorgeous, if hard -- to  -- get,  girl; greedy, astronomically  rich, Londoners; a rock star and a dowager; fish farms and drug smugglers, not to mention Black's family. Black, born  Milomre (Milo for short)  Blocj,  the youngest son of a Transnistrian gypsy family gamely working its way into middleclass from the margins of London's economy, took an English name and seems to have things going his way until one thing after another goes wrong. But, as always in such tales, there is a way out and Black/Blocj, equipped as he is by wit, pluck and luck, finds it. Boyd writes well. He doesn't patronize. I had to read the novel with The Concise Oxford English Dictionary at my elbow and it failed me on several occasions. He's concocted an engaging, if not always easy to follow or believe, plot. He makes a fetish of precise, detailed physical descriptions of the persons and places that occupy his pages. E.g., describing the patrons at the Cafe Matisse, one of Black's favorite restaurants, Black sees:\"A middle-aged couple - style: Eastern European intellectual - the man looking uncannily like Bertol Brecht, both bespectacled, both in drab zip-up waterproof jackets. A table of four consumptive hippies, three men with lank hair and poor beards and a girl (rolling her own), bead-swagged with a flower tattooed on her throat . . . . the obligatory lost-waif couple, two chalk-faced girls, black-clad, talking worriedly in furious whispers -- too young, in trouble, pimp fodder.\" All in all, the book is less, by a fair amount, than the sum of its parts. Read it on a plane or at the beach, no need to save it for a rainy day when you are willing to engage a more serious book, e.g. Boyd's \"An Ice-Cream War\" or \"Brazzaville Beach.\"End Note. My rating: three stars. In the hands of a new writer or one less accomplished than Boyd, I might well give it four. As this indicates, my ratings take into account what I think the writer is capable of as well as what the author produces. Boyd, as he has shown many times, is capable of better."}]}, "authors": ["William Boyd"], "isbn": "0375702164", "longitude": -0.12574, "periods": ["1900s"], "title": "Armadillo: A Novel", "word_cloud": "truly enjoy descriptive skill satisfy confrontational comeuppance quirky good typically good work busy strange story take get well write good write interesting story character development second none ever introduce twist end like exceptionally beautiful write sharp imagination make excite story life insurance agent ready give star little disappointed vague end somehow characteristic beloved author plot dishevel narrator bit dull difficult care befall villain better write interesting character not best convince story unexpected turning archive center complicate insurance fraud scheme set effort insurance loss adjuster sort scam collect substantial bonus expect good work ingredient good gorgeous hard get girl greedy astronomically rich rock star dowager fish farm drug smuggler mention family born short youngest son transnistrian gypsy family gamely work way middle class margin economy take english name seem thing go way thing go wrong always tales way equip wit pluck luck find write well elbow fail several occasion concoct engage always easy follow believe plot make fetish precise detailed physical description person place occupy page describe patron favorite restaurant black see couple style eastern european intellectual man look uncannily bespectacled drab waterproof jacket table consumptive hippy men lank hair poor beard girl roll flower tattooed throat obligatory couple girl talk worriedly furious whisper young trouble pimp fodder le fair amount sum part plane beach need save rainy day willing engage serious rating star hand new writer le accomplished well indicates rating take account think writer capable well author produce show many time capable better", "genres": ["Fiction & Literature", "Satire"], "summary": "From the award-winning author of A Good Man Africa and An Ice-Cream War comes Armadillo, a brilliant satirical noir set in contemporary London.\r\n\r\nTo his colleagues, Lorimer Black, the handsome, mild-mannered insurance adjuster rising through the ranks of his London firm, is known as the guy who has it all: the sleek suits, the enviable status. But when Lorimer arrives at a routine business appointment and finds his client hanging from a water pipe, his life spirals out of control. His company car is blowtorched after he investigates a fire at a luxury hotel. He becomes the fall guy of a new colleague who puts the company in the red and the victim of a vicious attack by the possessive husband of a mysterious actress.  \r\n        \r\nAs Lorimer becomes increasingly entangled in an apparent conspiracy that involves everyone he knows, his own past comes to light. A brilliant satirical noir, Armadillo confirms Boyd's place as England's most versatile, sublime novelist.", "asin": "0375702164", "rank": "802120", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41f3H6qFALL.jpg", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}