{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 38, "rating": 4.3, "reviews": [{"review_sentiment": 1.0, "review_text": "I can't believe someone is making money on this.  This is like going into a museum and seeing a blank canvas and the artist is revered.  They did it, I didn't.  Same thing with this book."}, {"review_sentiment": 4.0, "review_text": "Hurricane Katrina involved a big city with some people who wanted to be there when survival would have less stress elsewhere, but they could not know where money would reach them in the future. The clumps of people who were produced by feckless desire for rescue produced a collective experience like agitated hagfish producing slime while one apartment was drenched with the destruction of a huge collection of comics. Areas which were flooded had rats in some trees. A car parked in front of a store at the beginning of the book was never seen again after the water rose to the roof of a shed by the building. Hundreds of people died with terrible phone service."}, {"review_sentiment": 5.0, "review_text": "Nice quality"}, {"review_sentiment": 5.0, "review_text": "Great read!"}, {"review_sentiment": 5.0, "review_text": "son collage book he loves it"}, {"review_sentiment": 5.0, "review_text": "amazing read"}, {"review_sentiment": 5.0, "review_text": "A.D. is graphic journalism (of a sort) at its finest.  In a few hundred panels it does a superb job of conjuring the chaos of the Katrina events (pre-, midst, and post-), focusing on the true stories of a handful of survivors.  I found it riveting start to finish."}, {"review_sentiment": 5.0, "review_text": "Contemporary, relevant graphic novel. Given as gift."}, {"review_sentiment": 4.0, "review_text": "Great stories and a unique presentation"}, {"review_sentiment": 4.0, "review_text": "This graphic novel looks at Katrina and its aftermath, from five different viewpoints. (Note -- the flap says \"seven stories\", but it seemed to me that the couple's viewpoint was mostly that of the guy, and the two friends' was mostly that of Abbas.) Point of view aside, this book creates a powerful impression of \"what it was like\". The most dramatic stories are those of the people who suffered most -- Denise, and Abbas and Darnell -- but the others add to the strength of the overall impression. The graphics are particularly gripping early on, when the storm and the flooding are happening, but they work on many levels throughout the book. Someone criticized this book as being politically slanted -- how could it not be, considering what happened? I don't think it was slanted at all, I think it tells what happened."}]}, "authors": ["Josh Neufeld"], "isbn": "037571488X", "longitude": -90.0701156, "periods": ["2000s", "Recent Releases"], "title": "A.D.: New Orleans After the Deluge", "word_cloud": "someone make money go museum see blank canvas artist revere same thing involve big city people want survival stress elsewhere money clump people produce feckless desire rescue produce collective experience agitated haggish produce slime apartment drench destruction huge collection comic flood rat tree car park front store begin never see water rise roof shed building people die terrible phone service quality great son collage love amaze graphic journalism sort finest hundred panel superb job conjure chaos event midst focus true story handful survivor find rivet start finish contemporary relevant graphic gift story unique presentation graphic look aftermath different viewpoint note flap say story seem couple viewpoint mostly guy friend mostly view aside create powerful impression dramatic story people suffer others add strength overall impression graphic particularly grip early storm flood happen work many level criticize politically slant consider happen think slant think tell happen", "genres": ["Biography", "Comics & Graphic Novels", "Politics"], "summary": "Now in paperback, The New York Times best-selling graphic nonfiction masterpiece depicting the lives of seven New Orleanians before, during, and just after Hurricane Katrina.\r\n\r\nA.D.: New Orleans After the Deluge is a masterful portrait of a city under siege. Cartoonist Josh Neufeld depicts seven extraordinary true stories of survival in the days leading up to and following Hurricane Katrina.\r\n\r\nHere we meet Denise, a counselor and social worker, and a sixth-generation New Orleanian; “The Doctor,” a proud fixture of the French Quarter; Abbas and Darnell, two friends who face the storm from Abbas’ s family-run market; Kwame, a pastor's son just entering his senior year of high school; and the young couple Leo and Michelle, who both grew up in the city. Each is forced to confront the same wrenching decision–whether to stay or to flee.\r\n\r\nAs beautiful as it is poignant, A.D. presents a city in chaos and shines a bright, profoundly human light on the tragedies and triumphs that took place within it.", "asin": "037571488X", "rank": "104233", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/61%2BCofw2lDL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}