{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 32, "rating": 3.3, "reviews": [{"review_sentiment": 3.0, "review_text": "What happens to the psyche after one has been imprisoned and sexually molested? And what if you are male? What if no one believes you?  There arrives dissolution of trust in the world, and even in oneself. The tale held my interest, but I would have a difficult time recommending this book to a friend or loved one."}, {"review_sentiment": 4.0, "review_text": "A male dancer recounts firstly his experience of being recognised by some of his fans while running an errand to purchase cigarettes for his girlfriend.  After feeling a prick in his hand he wakes up chained to the floor of a room.  Three obsessed female fans tell him he's theirs now. They rape, sexually humiliate and use him for their pleasure. He has no idea if he will ever be set free of if they will eventually kill him.  They tell him what he is undergoing would be many a man's fantasy but for him it is nothing but a terrifying nightmare.The second half of his story (he tells us he escaped after 18 days on page 1 so I'm not giving away anything here) recounts his tale of what it is like to be a male victim of sexual assault, how he believes no one will believe his story and how he becomes obsessed with tracking down his torturers.This is a great insight into what life would be like for the victim of an horrendous sexual assault, torture and gang rape.  The added uniqueness of this book is that it deals with a male victim instead of a female which is more frequently written about.  The book as well as well as being a well written account of his ordeal tackles how as a victim he believes society would firstly believe and then treat a male victim of rape by females."}, {"review_sentiment": 3.0, "review_text": "This book was a disappointment, a decidedly weird book about a young English choreographer living in Amsterdam, who is drugged and kidnapped by three masked women, who then hold him prisoner for 18 days, before inexplicably setting him free.  During his captivity he's subjected to sexual and psychological abuse, although it seemed to me that none of it was anything close to the kind of suffering women are routinely subjected to, both in real life and in fiction, at the hands of men.  The nameless protagonist spends the rest of the novel searching for his abductors.  His method--to have sex with as many women as he can in order to examine their bodies and see if they resemble those of his captors--is an exercise in futility, although it does offer effective testimony to the emotionally disabling effects of sexual abuse.In the end the book is not merely unsatisfying, but downright frustrating.  Nothing is ever explained.  The victim never solves the mystery of his kidnapping, and never even finds the slightest clue, although at the conclusion of the book he has at least begun to face up to the psychological ramifications of his experience and his refusal to disclose it to anyone.  Perhaps this lack of explanation is the whole point--the idea that some of life's most wounding experiences can never be communicated to others, or adequately explained."}, {"review_sentiment": 4.0, "review_text": "The Book of Revelation is the story of the abduction, confinement, and subsequent gang-raping a la physical mutilation of a famous ballet dancer in Amsterdam, Holland.This ballet-dancer is walking to the store one afternoon and is suddenly approached by three hooded [fully cloaked] characters in an alleyway. A needle comes out of nowhere, instantly the dancer is anaesthetized, and hauled off to a [there is no other word for it]... a sex warehouse of sorts. Shackled to the floor from every limb, the dancer awakens to find the door in the corner of the room opening, and the abductors entering the room to begin their season of sexual torment and \"fun.\" [So far, sounds sort of like some run-of-the-mill Bret Easton Ellis \"sicko\" novel for sicko-men, right?] Hah! Guess again! The dancer in the story is a man. His captors are three women. And so it is that for the next eighteen days and nights these dames definitely have their way with him. Their [ahem...] fertile imagination seems to know no bounds! There is nearly infinitely more to the story than this aspect of it. The confinement section occupies less than the first half of the book. The real bulk of the story involves the way that this event affects the dancer, upon his release. Nothing emerges unscathed. His former relationships, his career itself, his own sexual behavior, all has undergone change. His life becomes a quest to bring a sense of closure to what happened. And this can only be done, it seems to him, if he finds his captors again. Confronts them. His search begins... What an amazingly well-written story. What a bizarre theme. And yet not so bizarre, really [perhaps]. All in all, it is a real sleeper. And Rupert Thomson proves here that he is an author worthy of the recognition of an Ian McEwan or a J.M. Coetzee."}, {"review_sentiment": 3.0, "review_text": "The main character, while running an errand for his dancer girlfriend, is kidnapped by three women, who remain masked throughout.  Confined to a room at an unknown location, he is essentially made into their sexual slave.  Horrific ordeal or fantasy?  I suppose it depends on one's point of view.  Although the description of the sexual acts performed on the man are certainly the most charged part of \"The Book of Revelations,\" I think the main point concerns the man's obsession with discovering the identities of his kidnappers, and the location of the room, after he is let go.  In this regard, it sort of reminded me of John Fowles' \"The Magus,\" which I believe to be one of the most overrated books ever written.  In both novels, the main characters' lives become defined by their respective pursuits of their former tormentors, even at the price of sacrificing their own lives and identities.\"The Book of Revelations,\" contains very little in the way of revelation, but it's an interesting read due to the bizarre subject matter (and alot shorter than \"The Magus\"!)."}, {"review_sentiment": 5.0, "review_text": "Rupert Thomson (1955) has written a fascinating and compelling sixth novel, and once you start reading 'The Book of Revelation', it's difficult to put the book down. A nameless 30-year old english dancer/choreographer lives and works in Amsterdam. He has a succesful career and for some years he's been living happily with his nice girlfriend Brigitte, also a dancer. In his life there are no real troubles, until... everything changes forever. He's abducted in Amsterdam by three cloaked and hooded women, who hold him captive and chained naked to the floor of an anonymous white empty room for eighteen days. For no apparent reason. During his captivity the only option there for him is total submission. The young women, presumably of his own age, appear often naked -though always hooded- to him. They have their way and play all kinds of games with him, mostly for their sexual pleasure. When the women's demands become more fierce, total dehumanisation and humiliation follows. The man is defenseless against this depraved performance of power, domination and desire. The ordeal he's subjected to includes rape and even brutal mutilation. For the reader this is a shocking nightmare as well.The captivity-part of the book reminded me of Pascal Bruckner's bizarre and weird, but brilliant novel 'les voleurs de beauté' (1997), and of two films where a similar sort of events takes place: Pasolini's 'Salo: the 120 days of Sodom' (1975) and Michael Haneke's 'Funny Games' (1998). What happens there is that you're forced to witness extreme atrocities, while you know there will be no escape from these brutal violations of human dignity. And of course, as a 'witness', it makes you sick, you feel horrible. It's the same with Thomson's 'Book of revelation', with one big difference, ... a relief. The man regains his freedom. After eighteen days the women all of a sudden decide to release him.The book is really about what follows then. Of course, after his release he's not really free. He will carry the horrible events he endured in captivity for the rest of his life, probably without ever knowing the identity of his torturers. In a brilliant way Thomson manages to describe the psychological process that accompanies the quest that now lies ahead of this deeply wounded man. His life-after looks like an endless re-evaluation. How to live with yourself, with these scars, how to deal with sexuality, with the people around you, and how to put your life in some sort of right track again... Facing all these problems the man begins a search for the women who made a ruin of his life. A search that will also bring his innermost self to the fore, in a way he never could have imagined.The outline and structure of the novel is well balanced, and the shifting of perspective, using the first person ('I'-form) and third person ('he'-form) alternately in different sections of the novel, works fine and efficient. I read all Thomson's novels and one of his best writing skills throughout his work is the use of analogies. In 'The Book of Revelation' display of that skill may not be as abundant as in 'The five gates of hell' and 'The insult' -his most mesmerizing and intoxicating novels- but the outline and the psychological development of the main character is as good as ever. And, what's more, in 'The Book of Revelation' Thomson reveals a deep wisdom to everyone of us about essentials of life, concerning relationships, sexuality, human dignity and freedom. A remarkable achievement, and taking into account the difficult subject Thomson is dealing with here, I consider 'The Book of Revelation' a succesful 'tour de force'. In an oeuvre that's far from complete I hope. [9-1-2001]"}, {"review_sentiment": 3.0, "review_text": "An interesting read with an intriguing premise. A male dancer is kidnapped and held prisoner by three unidentified women who keep him chained up and sexually abuse him. Once released, the emotionally and physically scarred protagonist must deal with the changes in himself and seek out the abusers. (There are some improbable moments: the character fails at one point to take the opportunity to free himself when he has the chance, and his sex life in one part of the book is more like that of James Bond.) However, it is precisely because the writing is so good and the circumstances described are so compellingly bizarre, that it is disappointing when the book ends up saying something that is rather obvious."}, {"review_sentiment": 1.0, "review_text": "being that I stayed up till all hours last night laboring through this trite novel in hopes of some revelation that the title suggests; I'm cranky and tired but I'll try to keep myopinion professional. It rather disturbs me that this book had been recommended to me by several women. Has this become some kind of feminist manifesto? I hope not.The novel is told in a draggy first person narrative. Every other paragraph begins with grade school sentences like \"As I looked at the trees in the park, I couldn't help but feel like...\" or \"I couldn't help but feel, as I looked at...\"Quite honestly I found the main character self-centered andself obsessed, but somehow we are led to believe his vanity iswarranted due to the fact that he is a dancer. Regardless of hisprofession, he is a bore, and unfortunately, their is no escapefrom this characters every self reference & petty meanderings from pg 1 t the unfullfilling end. I beg you, please do nothing to add to the hype of this novel."}, {"review_sentiment": 2.0, "review_text": "This book starts off with an interesting premise that never comes close to its potential.  Maybe it's the stereotypical English reserve, but I never got the impression that the protagonist was all that traumatized by his capitivity or the aftermath. When his girfriend of six years leaves him immediately after his return, he just shrugs it off like it was meant to happen and that was that.  Later, even five years after the event his inability to tell anyone about what happened makes no sense either since he didn't seem too traumatized to begin with. He just uses the experience to drop out of life and become a drifter without trying to deal with the experience and move on with his life. This is inexplicable since again, the experience didn't seem to bother him too much to begin with.  Another small issue, having been to Amsterdam once, it didn't appear that the author had ever been there. The few details he gives about Amsterdam and Holland could have been lifted from any tourists guide. He also appeared to know little about the Dutch language.  This was the first book I have read by Rupert Thomson and it doesn't give me the desire to read another. I'm glad I picked it up at a second hand bookstore."}, {"review_sentiment": 3.0, "review_text": "The blurb on the back cover of \"The Book of Revelation\" suggests that the novel \"fearlessly exposes our darkest fears to reveal the sinister connections between sex and power and how we are shaped by our experiences.\" It is a bold claim for Rupert Thomson's work, and one that, ultimately, cannot be sustained.\"The Book of Revelation\" tells the story of a talented, successful young dancer and choreographer living in Amsterdam with his girlfriend of seven years, Brigitte. One day he goes out to buy cigarettes for her and is drugged and kidnapped by three black-hooded women. They keep him chained and captive in a stark white room for eighteen days, where he is emotionally and sexually abused, made to masturbate and perform, and, ultimately, mutilated, before being released. This occurs in the first half of the book and is narrated in the third-person. The man is never identified by name and the third-person narrative voice has the desired effect of distancing the reader from the victim's experience, making the reader feel the stark, dehumanizing experience of the dancer. This first part of the book is psychologically disturbing and erotically charged, in a dark sort of way; it is, in other words, a powerful piece of writing.The second half of \"The Book of Revelation\" is written in the first person and relates what happens after the dancer is released by his captors. The victim remains unidentified by name, but the first-person narrative voice now brings the reader intimately into the mind of the dancer. Unfortunately, this part of the book requires the reader to suspend belief, the dancer's behavior seemingly at odds with what the claims of realism demand. Thus, upon his release, he makes his way back to his apartment, where he sees his girlfriend Brigitte. He does not tell her what has happened to him, nor does he tell anyone else. All he can say, at this point, is \"how difficult it is, sometimes, to find the right words, or any words at all.\" In some ways, his inability to communicate with his girlfriend (and others) is adumbrated at the beginning of the story, when he gets into an argument with Brigitte about her smoking, an argument that seems curiously devoid of any real interpersonal relationship. The effect of all this is to make the reader (or at least this reader) feel that the dancer's problems are as much a result of his own disfunctionality as they are of his bizarre kidnapping and captivity.From this point forward, the story is propelled by the dancer's unmitigated attempt to find the three women who held him captive. His only touchstones are the identifying marks he had observed on the naked bodies of those women. He is thus compelled to embark on a misogynistic crusade to sleep with every woman he meets in the hope that he can identify one of them by the revelation of her nakedness. This is one of the possible meanings of the book's title, a meaning suggested by the book's epigraph: \"Will there ever be anything other than the exterior and speculation in store for us? The skin, the surface--it is man's deepest secret.\"In the end, the dancer becomes a victim of his own obsession and his own inability to communicate, his inability to verbalize his experience and intimately share that experience with others. His redemption, if it will come at all, can only occur if he can overcome these inabilities, if he can \"reveal\" his kidnapping, his humiliation, his disturbed motivations; if he can tell his story, a book of revelation.\"The Book of Revelation\" is an interesting book which keeps you turning the pages, wanting to know what happens in the end, whether the dancer will ever find his captors. Rupert Thomson is also a writer with great imaginative and writing ability. It is certainly a book worth spending time with, but not quite deserving of some of the critical acclaim it has received."}]}, "authors": ["Rupert Thomson"], "isbn": "0375708456", "longitude": 4.8936041, "periods": ["2000s"], "title": "The Book of Revelation", "word_cloud": "happen psyche imprison sexually molest male believe arrive dissolution trust world even tale held interest difficult time recommend friend love male dancer recount firstly experience recognized fan run errand purchase cigarette girlfriend feel prick hand wake chain floor room obsess female fan tell rape sexually humiliate use pleasure idea ever set free eventually kill tell undergo many man fantasy nothing terrify second half story tell escape day page give away anything recount tale male victim sexual assault believe believe story becomes obsess track great insight life victim horrendous sexual assault torture gang rape added uniqueness deal male victim instead female frequently write well well well write account ordeal tackle victim believe society firstly treat male victim rape female disappointment decidedly weird young choreographer live drug kidnap masked woman hold prisoner day inexplicably set free captivity subject sexual psychological abuse seem none anything close kind suffer woman routinely subject real life fiction hand men nameless protagonist spends rest search abductor method sex many woman order examine body see resemble captor exercise futility offer effective testimony emotionally disable effect sexual end merely unsatisfying downright frustrate ever explain victim never solve mystery kidnapping never even find slightest clue conclusion least begin face psychological ramification experience refusal anyone perhaps lack explanation whole point idea life wound experience never communicate others adequately explain story abduction confinement subsequent la physical mutilation famous ballet dancer walk store afternoon suddenly approach hood fully cloaked character alleyway needle come nowhere instantly dancer anesthetize hauled word sex warehouse sort shackle floor limb dancer awaken find door corner room open abductor enter room begin season sexual torment fun far sound sort sicko right dancer story man captor woman next eighteen day night dame definitely way ahem fertile imagination seem know bound nearly infinitely story aspect confinement section occupies le first real bulk story involve way event affect dancer release emerge unscathed former relationship career sexual behavior undergone change life become quest bring sense closure happen do seem find captor search begin amazingly story bizarre theme yet bizarre really perhaps real sleeper prove author worthy recognition main character run errand dancer girlfriend kidnap woman remain masked confined room unknown location essentially make sexual slave fantasy suppose depend point view description sexual act perform man certainly charge part think main point concern man obsession discover identity kidnapper location room let regard sort remind believe overrate ever write novel main character live become defined respective pursuit former tormentor even price sacrifice life identities contain little way interest due bizarre subject matter a lot shorter write fascinate compel sixth start read difficult put nameless old english live work successful career year live happily nice girlfriend also dancer life real trouble everything change forever abduct cloak hood woman hold captive chain naked floor anonymous white empty room eighteen day apparent reason captivity option total submission young woman presumably age appear often naked always way play kind game mostly sexual pleasure woman demand become fierce total dehumanization humiliation follow man defenseless deprave performance power domination desire ordeal subject include rape even brutal mutilation shock nightmare remind bizarre weird brilliant velour film similar sort event take place day happen forced witness extreme atrocity know escape brutal violation human dignity course make sick feel horrible big difference relief man regain freedom eighteen day woman sudden decide release really follow course release really free carry horrible event endure captivity rest life probably ever know identity torturer brilliant way manage describe psychological process accompanies quest lie ahead deeply wounded man look endless live scar deal sexuality people put life sort right track problem man begin search woman make ruin life search also bring innermost fore way never structure well balance shift perspective use first person third person alternately different section work fine efficient best writing skill work use analogy display skill gate hell insult mesmerize intoxicate outline psychological development main character good ever reveal deep wisdom everyone essentials life concern relationship sexuality human dignity freedom remarkable achievement take account difficult subject dealing consider force oeuvre far complete hope interesting intriguing premise male dancer kidnap hold prisoner unidentified woman chain sexually once release emotionally physically scarred protagonist change seek abuser improbable moment character fail point opportunity free chance sex life part however precisely write good circumstance describe compellingly bizarre disappointing end say something rather obvious stay till hour last night labor trite hope title suggest cranky tired try my opinion professional rather disturb recommended several woman become kind feminist manifesto hope tell draggy first person narrative paragraph begin grade school sentence look tree park look honestly find main character and self obsess somehow lead believe vanity is warranted due fact dancer his profession bore unfortunately escape from character self reference petty meanderings pg unfulfilling end beg please nothing add hype start interesting premise never come close potential stereotypical reserve never get impression protagonist traumatize captivity aftermath girlfriend year leave immediately return shrug meant happen later even year event inability tell anyone happen make sense seem traumatize begin use experience drop life become drifter try deal experience move life inexplicable experience seem bother much small issue appear author ever detail give tourist also appear know little dutch language first desire glad pick second hand bookstore blurb back cover suggest fearlessly expose darkest fear reveal sinister connection sex power shape experience bold claim ultimately sustain tell story talented successful young dancer choreographer live girlfriend year day go cigarette drug kidnap woman keep chained captive stark white room eighteen day emotionally sexually abuse make masturbate perform ultimately mutilate release occur first half narrate man never identify name narrative voice desire effect distance victim experience make feel stark dehumanize experience dancer first part psychologically disturb erotically charge dark sort way word powerful piece second write first person relate happen dancer release captor victim remain unidentified name narrative voice brings intimately mind dancer part require suspend belief dancer behavior seemingly odds claim realism demand release make way back apartment see girlfriend happen anyone else say point difficult sometimes right word word way inability communicate girlfriend others adumbrate begin story get argument smoking argument seem curiously devoid real interpersonal relationship effect make least feel dancer problem much result dis functionality bizarre kidnap point forward story propel dancer unmitigated attempt find woman hold captive touchstone identify mark observe naked body woman thus compel embark misogynistic crusade sleep woman meet hope nakedness possible meaning title meaning suggest epigraph ever anything exterior speculation store skin surface man deepest secret end dancer become victim obsession inability communicate inability verbalize experience intimately share experience others redemption occur overcome inability reveal kidnap humiliation disturb motivation tell story interesting keep turn page want know happen end dancer ever find captor also writer great imaginative writing ability certainly spend time quite deserve critical acclaim receive", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "In an edgy psychological thriller that is as mesmerizing as it is profound, Rupert Thomson fearlessly delves into the darkest realm of the human spirit to reveal the sinister connection between sexuality and power.\r\n\r\nStepping out of his Amsterdam studio one April afternoon to buy cigarettes for his girlfriend, a dashing 29-year old Englishman reflects on their wonderful seven-year relationship, and his stellar career as an internationally acclaimed dancer and choreographer. But the nameless protagonist's destiny takes an unthinkably horrifying turn when a trio of mysterious cloaked and hooded women kidnap him, chain him to the floor of a stark white room to keep as their sexual prisoner, and subjected him to eighteen days of humiliation, mutilation, and rape. \r\n\r\nThen, after a bizarrely public performance, he is released, only to be held captive in the purgatory of his own guilt and torment: The realization that no one will believe his strange story. Coolly revelatory, meticulously crafted, The Book of Revelation is Rupert Thomson at his imaginative best.", "asin": "0375708456", "rank": "1632817", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/51EsDlMQbFL.jpg", "country": "The Netherlands", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}