{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 192, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Great read."}, {"review_sentiment": 5.0, "review_text": "Great read!"}, {"review_sentiment": 4.0, "review_text": "Vidal writes beautifully, but he does carry on. Still, his joy is that he demythologizes the Founders and he puts into play the obvious politics that must have driven the day. For that alone it's worth reading at least 3/4s of it."}, {"review_sentiment": 5.0, "review_text": "Gore Vidal is incredible. I love reading about history thru story telling. I have not finished the book, but it is very interesting, historical, and I highly recommend it especially if you are a Lincoln fan, and/or if you want to know more about the Civil War Era."}, {"review_sentiment": 3.0, "review_text": "This is a well written fiction book about Lincoln during the Civil War.  Even though it is classified as fiction, I can't help but think that most of the book is true.  I don't think Gore Vidal would/could have written this book without a great deal of research.  He spent a lot of time time on character development.  If you are interested in historical politics during this era, you will love the book.  It was too slow moving for my taste, but that is the only reason I downgraded it to three stars."}, {"review_sentiment": 5.0, "review_text": "Great writing. Kept interest throughout. Made us want a happy ending."}, {"review_sentiment": 5.0, "review_text": "Best historic novel that I read. Only matched by Burr, also by Gore Vidal."}, {"review_sentiment": 4.0, "review_text": "well written"}, {"review_sentiment": 5.0, "review_text": "Conversational history as it could well have been -- I admire Vidal's way of imagining the threads of the time and his weaving together a story."}, {"review_sentiment": 5.0, "review_text": "Excellent account of Lincoln and his cabinent"}]}, "authors": ["Gore Vidal"], "isbn": "0375708766", "longitude": -77.0366456, "periods": ["1800s"], "title": "Lincoln: A Novel", "word_cloud": "great great write beautifully carry still joy mythologize founder put play obvious politics day alone worth read least incredible love read history thru story tell finish interest historical highly recommend especially fan want know well write fiction classified fiction true think write great deal research spend lot time time character development interested historical politics era slow move taste reason downgrade star write interest want happy end historic only match also well write conversational history well admire vidal way imagine thread time weave together story excellent account cabinet", "genres": ["Fiction & Literature", "History", "Politics"], "summary": "Gore Vidal's Narratives of Empire series spans the history of the United States from the Revolution to the post-World War II years. With their broad canvas and large cast of fictional and historical characters, the novels in this series present a panorama of the American political and imperial experience as interpreted by one of its most worldly, knowing, and ironic observers.\r\n\r\nTo most Americans, Abraham Lincoln is a monolithic figure, the Great Emancipator and Savior of the Union, beloved by all. In Gore Vidal's Lincoln we meet Lincoln the man and Lincoln the political animal, the president who entered a besieged capital where most of the population supported the South and where even those favoring the Union had serious doubts that the man from Illinois could save it. Far from steadfast in his abhorrence of slavery, Lincoln agonizes over the best course of action and comes to his great decision only when all else seems to fail. As the Civil War ravages his nation, Lincoln must face deep personal turmoil, the loss of his dearest son, and the harangues of a wife seen as a traitor for her Southern connections. Brilliantly conceived, masterfully executed, Gore Vidal's Lincoln allows the man to breathe again.", "asin": "0375708766", "rank": "106522", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51xDoIBtQuL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}