{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 47.4983815, "ratings": {"num_ratings": 183, "rating": 2.7, "reviews": [{"review_sentiment": 2.0, "review_text": "A few funny moments, but the characters are unlikable"}, {"review_sentiment": 1.0, "review_text": "This book is not interesting at all. By the way, the title doesn't make any sense. It should've been called Budapest."}, {"review_sentiment": 4.0, "review_text": "It had its moments, but I bought it because I really liked \"The Song Is You.\" This got tedious at times, but I stayed with it."}, {"review_sentiment": 5.0, "review_text": "Love how Phillips captured that place (Budapest) and that time (1990-91, right after the fall of communism). I took this book with me on my own trip to Budapest, and it really set an incredible mood. I felt so much more connected to many of the places I visited after reading about them in this gem of a book."}, {"review_sentiment": 1.0, "review_text": "couldn't really get really get into this book."}, {"review_sentiment": 2.0, "review_text": "Interesting review of all the places in Budapest to see but the characters were not really people you could care about."}, {"review_sentiment": 2.0, "review_text": "I suppose there are those people who will find this book enjoyable; I am not one of them. In fact, the older this book becomes, the more dated it sounds. I read it a dozen years after its premiere and it was pretty painful to read. I agree with all the negative reviews of this book and give it two stars simply because I do not feel it was a total waste of time. I now know I do not have to read another book by this author, no matter what the reviews are. That's something good to know. Also, I did enjoy his oblique references to Vienna and his discussions of Budapest the city. I have enjoyed coffee in the Cafe Gerbeaud a few times and appreciate its prominent spot in this novel. The rest of the book is incomprehensible. Even the pseudo-cool title is more pseudo than cool; I never did get the point of it. I bought this book for $1 at the library book sale; I would want my money back, but, heck, it's the library. I'll just count it as a donation. If you don't care about plot, character development or interesting people, go ahead, give it a read. Otherwise, you can miss this one."}, {"review_sentiment": 2.0, "review_text": "I have not visited my native city of Prague for decades. For some reasons, this book starts in Budapest, not that far from Prague, but very different.Let's hope the book will write something about Prague later on. No, ,my negligence. Wikipedia has an entry for this writer and it mentions this book as happening in Budapest, not in Prague. The picture on the cover IS from Prague (the ancient Charles bridge) but the book has nothing to do with my native city. Oh well.So far, I do NOT like it but I will try to read it anyway."}, {"review_sentiment": 3.0, "review_text": "The best way to encapsulate this book is with the words of the great observer of human nature Robert Benchley in his wonderful short piece 'Christmas Afternoon', \"In the first place, there was the ennui. And such ennui as it was! A heavy, overpowering ennui, such as results from a participation in eight courses of steaming, gravied food, topping off with salted nuts which the little old spinster Gummidge from Oak Hill said she never knew when to stop eating--and true enough she didn't--a dragging, devitalizing ennui, which left its victims strewn about the living-room in various attitudes of prostration suggestive of those of the petrified occupants in a newly unearthed Pompeiian dwelling; an ennui which carried with it a retinue of yawns, snarls and thinly veiled insults, and which ended in ruptures in the clan spirit serious enough to last throughout the glad new year.\"I remember when Arthur Phillips' Prague came out and all the glowing reviews, The amazing, heartfelt, intellectual praise from every reviewer, every paper, every magazine. I remember thinking to myself, \"I've got to read this book!\"Then slowly came some tiny voices amid the howls.... \"You know, Prague is really pretty trite\", \"Prague is actually kind of boring\", \"If the book was cut in half it would still be a bit long\", \"What's the point?\"After reading these revised opinions, mind you this book was still high up in everyone's top 10 list, I decided I have no interest in reading this.Then it appeared on my book club list of July books, of course I voted against it but I was outnumbered.I can see why the other members of my book group would want to read this, The storie is  about ex-pat Americans, Canadians etc in Hungary. All of us in the book group are, or have been ex-pats, now in Japan. Still an ex-pat is an ex-pat.The book hits all the ex-pat touchstones: the exciting exoticness of your new location and the longing for your hometown and the familiar. Getting a chance to meet new and interesting people, and hopefully sleeping with them, and the tiredness of being different from them and never fitting in. The bitching and moaning and the, \"why can't they do it like we do it back home\" conversations that are legion for ex-pats.But truth be told… Those conversations are awfully boring and the people having them are equally boring. Honestly I've done my best to keep away from most ex-pats in the 11 years I've lived in Japan.But I bit the bullet and read this book, and for most of it I was pleasantly surprised and quite enjoyed it. But the ennui.... The ennui. I had the feeling by the end of the book that not only were the characters sick of the story and of Hungary, but that the author was also. At that point there is no amount of pithy phrases, droll observations, casual sex, Paprikash, or Unicum to soothe your soul. It's best to just close the book and go back home.Although I still want to drink some Unicum."}, {"review_sentiment": 1.0, "review_text": "I am only 42% finished and not sure I will complete it.  So far it's all about Budapest (which I visited a couple of weeks ago) and while some of the things mentioned made my visit feel a 'tiny' bit more familiar I'm finding the story line very confusing and quite boring in fact.  We also visited Prague at the end of our tour and had hoped this book would get me enthused about being there, but of course it didn't because I never got to that part IF it exists.  That is all that is holding my attention and the fact I rarely stop reading a book half way through.  \"Why this title!!\" I am wondering and the concept is a little like Mitchner's \"The Drifters\" it can no way compare."}]}, "authors": ["Arthur Phillips"], "isbn": "0375759778", "longitude": 19.0404707, "periods": ["1900s"], "title": "Prague: A Novel", "word_cloud": "funny moment character unlikable interesting way title make sense call moments buy really like be get tedious time stay capture place time right fall communism take trip really set incredible mood felt much connect many place visit read gem really really interest review place see character really people suppose people find enjoyable fact older becomes date sound dozen year premiere pretty painful agree negative review give star simply feel total waste time know author matter review something good know also enjoy oblique reference discussion city enjoy coffee time appreciate prominent spot rest incomprehensible even title pseudo cool never get point buy library sale money back heck library count donation care plot character development interest people go ahead give miss visit native city decade reason start far hope something later negligence entry writer mention happen picture cover ancient bridge nothing native city far not try anyway best way encapsulate word great observer human nature wonderful short piece first place ennui heavy overpower ennui result participation course steam gravies food topping salt nut little old spinster say never know stop eating true enough drag devitalize ennui left victim strew various attitude prostration suggestive petrified occupant newly unearthed pompeian dwell ennui carry retinue yawn snarl thinly veiled insult end rupture clan spirit serious enough last glad new year remember come glow review amazing heartfelt intellectual praise reviewer paper magazine remember think get then slowly come tiny voice howl know really pretty trite actually kind bore cut half still long point read revise opinion mind still high everyone top list decide interest reading appear club list course vote see member group store etc group still hit touchstone excite exoticness new location long hometown familiar chance meet new interesting people hopefully sleep tiredness different never fit bitching moan back home conversation legion conversation awfully bore people equally bore honestly do best year live bite bullet pleasantly surprise quite enjoy ennui ennui feel end character sick story author also point amount pithy phrase droll observation casual sex soothe soul best close go back still want drink finish sure complete so far visit couple week ago thing mention make visit familiar find story line confuse quite boring fact also visit tour hoped enthused course never get part exist hold attention fact rarely stop read half way title wonder concept little way compare", "genres": ["Fiction & Literature"], "summary": "A first novel of startling scope and ambition, Prague depicts an intentionally lost Lost Generation as it follows five American expats who come to Budapest in the early 1990s to seek their fortune—financial, romantic, and spiritual—in an exotic city newly opened to the West. They harbor the vague suspicion that their counterparts in Prague, where the atmospheric decay of post–Cold War Europe is even more cinematically perfect, have it better. Still, they hope to find adventure, inspiration, a gold rush, or history in the making. What they actually find is a deceptively beautiful place that they often fail to understand. What does it mean to fret about your fledgling career when the man across the table was tortured by two different regimes? How does your short, uneventful life compare to the lives of those who actually resisted, fought, and died? What does your angst mean in a city still pocked with bullet holes from war and crushed rebellion?\r\n\r\nJournalist John Price finds these questions impossible to answer yet impossible to avoid, though he tries to forget them in the din of Budapest’ s nightclubs, in a romance with a secretive young diplomat, at the table of an elderly cocktail pianist, and in the moody company of a young man obsessed with nostalgia. Arriving in Budapest one spring day to pursue his elusive brother, John finds himself pursuing something else entirely, something he can’t quite put a name to, something that will draw him into stories much larger than himself.\r\n\r\nWith humor, intelligence, masterly prose, and profound affection for both Budapest and his own characters, Arthur Phillips not only captures his contemporaries but also brilliantly renders the Hungary of past and present: the generations of failed revolutionaries and lyric poets, opportunists and profiteers, heroes and storytellers.", "asin": "0375759778", "rank": "494763", "city": "Budapest", "image": "https://images-na.ssl-images-amazon.com/images/I/61UIBp-rZkL.jpg", "country": "Hungary", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}