{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 64, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "One of those books you want to never end.  Fun, light hearted stories that make you feel you know the characters like friends."}, {"review_sentiment": 5.0, "review_text": "daughter had to read for school.she enjoyed it."}, {"review_sentiment": 5.0, "review_text": "I found this book thanks to my neighbor who was kind enough to pass the book on to me ... I enjoy finding new authors to me ... great chance to check out a book/author you might always know or ever see ... I enjoyed this read ... couldn't put it down. I've never traveled overseas ... but in this book you get to go to Spain... maybe one day I will get the chance. Set during WW1. Well written ... great read. Check it out. ( :"}, {"review_sentiment": 5.0, "review_text": "Easy read,  couldn't put it down, read in 1 day.Joy to the eyes,  escape to another world, looking forward to next volume by this author"}, {"review_sentiment": 5.0, "review_text": "One of my favorite books and writers from early teenage years.  Well deserved Nobel Laureate!!"}, {"review_sentiment": 3.0, "review_text": "This was a good read. I found the narrative and dialogue similar to my own style of writing, if I can get away with saying that about a Nobel Laureate. This made me eager to read but overall the stories were just novel, not groundbreaking. Excellent first novel from an awesome writer."}, {"review_sentiment": 5.0, "review_text": "So fun to get to know Naipaul's characters."}, {"review_sentiment": 5.0, "review_text": "Re-read an old favorite and discovered new nuances.  Still an enjoyable book.  Light and entertaining reading material."}, {"review_sentiment": 5.0, "review_text": "Miguel Street was amazing and an interesting read. I loved it. My copy arrived earlier than expected thank you."}, {"review_sentiment": 5.0, "review_text": "Book takes you on a nostalgic journey of Trinidad/West Indies during the 1930' Era. It is pitted with humor and paints a vivid picture of the \"Miguel Streets\" that embodies the culture and simplistic richness of those times."}]}, "authors": ["V.S. Naipaul"], "isbn": "0375713875", "longitude": 0.0, "periods": ["1900s"], "title": "Miguel Street", "word_cloud": "want never light heat story make feel know character friend daughter enjoy find thanks neighbor kind enough pas enjoy find new author great chance check always ever enjoy never travel overseas get maybe day get chance write great eye world look forward next volume author favorite writer early teenage year well deserve good find narrative dialogue similar style writing get away say make eager overall story groundbreaking first awesome writer so fun get know character old favorite discover new nuance still enjoyable entertain read material amaze interest love copy arrive earlier expect thank take nostalgic journey indie era pit humor paint vivid picture embody culture simplistic richness time", "genres": ["Fiction & Literature", "WWII", "Humour"], "summary": "“A stranger could drive through Miguel Street and just say ‘Slum!’ because he could see no more.” But to its residents this derelict corner of Trinidad’s capital is a complete world, where everybody is quite different from everybody else. \r\n\r\nThere’s Popo the carpenter, who neglects his livelihood to build “the thing without a name.” There’s Man-man, who goes from running for public office to staging his own crucifixion, and the dreaded Big Foot, the bully with glass tear ducts. There’s the lovely Mrs. Hereira, in thrall to her monstrous husband. \r\n\r\nIn this tender, funny early novel, V. S. Naipaul renders their lives (and the legends their neighbors construct around them) with Dickensian verve and Chekhovian compassion.\r\n\r\nSet during World War II and narrated by an unnamed–but precociously observant–neighborhood boy, Miguel Street is a work of mercurial mood shifts, by turns sweetly melancholy and anarchically funny. It overflows with life on every page.", "asin": "0375713875", "rank": "256013", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/51OY0ftn7mL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}