{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 17, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book! Especially for those who plan a trip to Cuba."}, {"review_sentiment": 4.0, "review_text": "A very delightful book. Revealing."}, {"review_sentiment": 5.0, "review_text": "Product exactly as described - prompt delivery."}, {"review_sentiment": 4.0, "review_text": "Readers of books about Cuba today look for answers to one question:  after Fidel, what?  Covering six months back in 1970, Dancing with Cuba leads to one answer:  Cuba will fall apart, for the revolutionary spirit Fidel Castro led has not succeeded.  Author Guillermoprieto believes only Fidel’s mesmerization of the populace holds it together. His magnetism possessed her in 1970 when she took on a teaching job at the Escuela National de Danza, the School of Dance, established to show Cuban progress in this artistic field.  She was spellbound by Fidel.  “There never had existed a more heroic, lucid man.”  Increasingly, however, she became distressed by food shortages and the absence of worldly attention to the arts. Her adventure in Cuba came about through her training under Merce Cunningham in New York City.  The master of a modern art form told her of the Cuban opening, and she followed it up.  Once there, she wondered at the naïveté of her students but plunged ahead with her courses on dance forms almost unknown on the island.The longer she taught the more concerned young Ms. Guillermoprieto became concerned about her own place in the world scheme of things.  Her lack of revolutionary drive disturbed her.  Was it possible Revolution had no place for Art?  She devotes numbingly prolix pages to her contemplation of suicide.Ms. Guillermoprieto apparently transferred some of her concerns to the leading students of her class.  A delegation of three came to her hotel room to tell her they were about to strike for better conditions and prospects, and hoped she would replace their current dance chief.  She thought the strike “absurd.”  It was settled through negotiation of minimal matters, and afterward the student situation improved.Ms. Guillermoprieto left before the end of the year, as she had told the school she planned.  In New York again, she soon dropped her former boyfriend – and ultimately the dance, to become a writer -- and now lives in Mexico City.  Her conclusion in Dancing with Cuba: “Fidel’s revolution has failed tragically in all its stated goals – greater social equality and better living conditions for all.”Robert Lincoln, a retired officer of the U. S. Foreign Service, lived in northern Virginia."}, {"review_sentiment": 3.0, "review_text": "There is much to recommend this book , particulary given recent developments between the US and Cuba. A young dance student of Mexican decent living in NYC during the late 1960s and studying modern dance is recruited to teach at the National Arts school in Havana and drinks up the atmosphere of revolutionary Cuba in the early 1970s.Her memoir of her time in Havana is a personal coming of age story with a revealing glimpse into  her thoughts on love and her bout with depression and contemplation of suicide. The scenes of Cuba struggling economically, the shortages and deprivation in stark contrast to the political rhetoric are interesting as a backdrop to her story. This is not a history of the Cuban revolution but a personal diary of how one young woman coped with being immersed into a society struggling to define itself and her observations are at times riveting and at other times naive .Overall I think while a bit dated it is still a good read for those with an interst in Cuba."}, {"review_sentiment": 5.0, "review_text": "This book is a commentary on a failing economic system as seen through the eyes of young woman utterly committed to ballet. That she has the acumen to look back twenty-five years and make sense of what she felt then and bring it to the page now makes her a wonderful storyteller. Her narrative provides a portal into a world few Americans understood except as a menace, and her change over the course of six months is a captivating tale told well. Read the book as a personal essay, not a commentary on politics, though it is."}, {"review_sentiment": 5.0, "review_text": "Her courage and  honesty grabbed me in the first pages, and never let go. Gillermoprieto's longing to submit herself to the demands of dance moved me deeply. As a fellow dancer, I understood her keen feeling that she would never be as good as she wanted to be. Perhaps every dancer with the capacity to be honest feels it too. It was also a revealing glimpse into the lives of artists in a country swept up in a political and ideological crisis. Wonderful writer. Great read."}, {"review_sentiment": 1.0, "review_text": "This book is a marketing tome for communism, a failed system. I was expecting more of a novel, but unfortunately it fell short of my expectations."}, {"review_sentiment": 4.0, "review_text": "In 1970, Alma Guillermoprieto left her home in New York to teach modern dance in Cuba for six months. There, she found herself in the heart of the Cuban revolution. Though a memoir all the way, the book is peppered with historical background and short biographies of Cuba's most important heroes and figures. The author tells of her desire to have the faith of Fidel Castro and Che Guevara, her horror over her ignorance of evil after watching a film on the Vietnam War, the conflict between her previous ideas about identity and purpose in comparison to those of her Cuban friends. Her memoir is a good recounting of her struggle, against the backdrop of Cuba's very complex history and culture. Though not by any means a reference on Cuban history, the book does give a good inside look at how Cubans as well as outsiders viewed the revolution that was taking place. This is an enjoyable coming of age memoir, especially for fans of dance and Cuba."}, {"review_sentiment": 2.0, "review_text": "Guillermoprieto's memoir of the Cuban Revolution is a very personal account of one person's experience in Cuba after the revolution.  She does not endeavor to provide broad background information regarding the history or politics in Cuba and is in fact quite naive and ignorant of even basic current events during the memoir.  While I wasn't particularly moved by her story, her aloof and intimate account of her time in post-revolution Cuba does provide a very readable and accessable introduction to the subject."}]}, "authors": ["Alma Guillermoprieto"], "isbn": "0375725814", "longitude": -82.3658671, "periods": ["1900s"], "title": "Dancing with Cuba: A Memoir of the Revolution", "word_cloud": "plan trip delightful revealing exactly describe prompt delivery reader today look answer question month back lead answer fall apart revolutionary spirit lead succeed believe memorization populace hold together magnetism possess take teach job establish show progress artistic field spellbind never exist heroic lucid however become distressed food shortage absence worldly attention arts adventure come train master modern art form tell open follow once wonder naivete student plunge ahead course dance form almost unknown longer taught concern young become concerned place world scheme thing lack revolutionary drive disturbed possible place devote fumblingly prolix page contemplation apparently transfer concern lead student class delegation come hotel room tell strike better condition prospect hop current dance chief think strike settle negotiation minimal matter afterward student situation leave end year tell school plan soon drop former boyfriend ultimately dance become writer live conclusion fail tragically state goal greater social equality better living condition retire officer live northern much recommend particular give recent development us young dance student decent live late study modern dance recruit teach school drink atmosphere revolutionary early time personal come age story reveal glimpse thought love depression contemplation scene struggle economically shortages deprivation stark contrast political rhetoric interest backdrop story history personal diary young woman cop immersed society struggle define observation time rivet time naive think bit dated still good inters commentary fail economic system see eye young woman utterly commit ballet acumen look back year make sense felt bring page make wonderful storyteller narrative provide portal world understood menace change course month captivate tale tell well personal essay commentary politics courage honesty grab first page never let long submit demand dance move deeply fellow dancer understand keen feel never good want perhaps dancer capacity honest feel also reveal glimpse life artist country sweep political ideological crisis writer marketing tome communism fail system expect unfortunately fell short expectation leave home teach modern dance month find heart way pepper historical background short biography important hero figure author tell desire faith horror ignorance evil watching film conflict previous idea identity purpose comparison friends good recount struggle backdrop complex history culture mean reference history good look well outsiders view take place enjoyable come age especially fan dance personal account person experience endeavor provide broad background information regard history politics fact quite naive ignorant even basic current event particularly move story aloof intimate account time provide readable accessible introduction subject", "genres": ["Memoir", "Art & Architecture"], "summary": "In 1970 a young dancer named Alma Guillermoprieto left New York to take a job teaching at Cuba’s National School of Dance. For six months, she worked in mirrorless studios (it was considered more revolutionary); her poorly trained but ardent students worked without them but dreamt of greatness. Yet in the midst of chronic shortages and revolutionary upheaval, Guillermoprieto found in Cuba a people whose sense of purpose touched her forever. \r\n\r\nIn this electrifying memoir, Guillermoprieto–now an award-winning journalist and arguably one of our finest writers on Latin America– resurrects a time when dancers and revolutionaries seemed to occupy the same historical stage and even a floor exercise could be a profoundly political act. Exuberant and elegiac, tender and unsparing, Dancing with Cuba is a triumph of memory and feeling.", "asin": "0375725814", "rank": "871374", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51fWb6PzxZL.jpg", "country": "Cuba", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}