{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 27, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Great.  Product works well on my smartphone."}, {"review_sentiment": 3.0, "review_text": "Nowhere near as good as \"A House for Mr. Biswas\", which I believe was his second novel. This one starts out OK but the second half rambles on and the characters are hard to follow, as is the patois that they speak. To be honest, I didn't really get the point of the book."}, {"review_sentiment": 4.0, "review_text": "Beautiful literary work of art. A classic that I will be re reading at a later date. A truer account of one's life would be dull, the fictional elements have really pulled it all together."}, {"review_sentiment": 5.0, "review_text": "This is one of the best books I have ever read."}, {"review_sentiment": 5.0, "review_text": "Easy to see why VS Naipaul won the Nobel Prize"}, {"review_sentiment": 5.0, "review_text": "Hilarious. I couldn't put it down. I recommend watching the movie as well."}, {"review_sentiment": 3.0, "review_text": "My son needed to read this book for Modern History Class.  Not the most interesting book."}, {"review_sentiment": 4.0, "review_text": "Didn't enjoy this as much as Naipaul's superb 'A House for Mr Biswas' but it's an entertaining read, following the rise of Ganesh Ramsumair. Set in the Trinidad of the 30s and 40s, Ganesh is a mediocre student and teacher. When he comes home to his father's funeral, he lapses into a life of inactivity...and accumulating books:\"Nine hundred and thirty book. Every book about one inch thick, I suppose.\"\"Makes about seventy-seven feet.\"Life moves on to initial and unsuccessful attempts at writing and massage, before re-inventing himself as a mystic. But his new success causes trouble with his father-in-law, and with a politician via the local press...There are some very humorous moments:flatulent aunt, ''The great Belcher\" - 'she was so overcome she could only belch and ask for water. She got Coca-Cola. It made her burp between belches and she remained uncommunicative for some time.'Or Ganesh's later literary efforts: 'Only two months after the publication of 'What God Told Me' Ganesh scored a stupendous success of scandal. His inspiration was the musical toilet-roll rack. Because 'Profitable Evacuation' was published during the war its title was misunderstood; fortunately for it might not have been allowed if the authorities knew that it was concerned more or less with constipation.'And yet as the book reaches its end, there is a serious side..."}, {"review_sentiment": 1.0, "review_text": "Not what I expected"}, {"review_sentiment": 3.0, "review_text": "Ganesh,after an unhappy spell at school, decides to become a masseur despite his education and the fact that half of Trinidad are masseurs.On marrying Ramgolom's daughter and extracting a dowry, he moves to Fuente Grove where he flourishes as a Hindu scholar, a mystic healer, author of such tomes as 101 questions and answers on Hinduism where such mysteries as 'What is Hinduism' are answered;'It is the religion of Hindu's'.Eventually he enters the world of politics... Naipaul's first novel is a comic look at the Indian community in Trinidad, a theme he pursued in the (better) 'Miguel Street' and perfected in his timeless comic work 'A House For Mr Biswas'. Having read those two works before 'Mystic Masseur' I found this very much a first novel and a prototype for his later comic works. This has all the ingredients of educated fools, the absurdities of religion and politics and martinet wives that hallmark Indian humour-probably all influenced by Naipaul's observations. Worth a read if you haven't read  'Miguel' or 'Biswas' and still so even if you have."}]}, "authors": ["V.S. Naipaul"], "isbn": "037570714X", "longitude": 0.0, "periods": ["1900s"], "title": "The Mystic Masseur", "word_cloud": "work well smartphone nowhere near good believe second start ok second half ramble character hard follow patois speak really point literary work art classic read later date truer account life fictional element really pull together best ever see hilarious recommend watch movie well son need not interest much superb entertain follow rise student teacher come home father funeral lapse life inactivity accumulate hundred thirty inch thick suppose foot move initial unsuccessful attempt write massage new success cause trouble politician local press humorous moment flatulent aunt great overcome ask water get make burp belch remain uncommunicative time later literary effort month publication tell score stupendous success scandal inspiration musical rack publish war title misunderstood fortunately authority know concerned le constipation yet reach end serious side not expect unhappy spell school decide become education fact half marry daughter extract dowry move flourish scholar healer author tome question answer mystery answer religion enters world politics first comic look community theme pursue better perfect timeless comic work have work find much first prototype later comic work ingredient educate fool absurdity religion politics martinet wife hallmark indian influence observation still even", "genres": ["Fiction & Literature"], "summary": "In this slyly funny and lavishly inventive novel–his first–V. S. Naipaul traces the unlikely career of Ganesh Ramsumair, a failed schoolteacher and impecunious village masseur who in time becomes a revered mystic, a thriving entrepreneur, and the most beloved politician in Trinidad. To understand a little better, one has to realize that in the 1940s masseurs were the island’s medical practitioners of choice. As one character observes, “I know the sort of doctors they have in Trinidad. They think nothing of killing two, three people before breakfast.”\r\n\r\nGanesh’s ascent is variously aided and impeded by a Dickensian cast of rogues and eccentrics. There’s his skeptical wife, Leela, whose schooling has made her excessively, fond. of; punctuation: marks!; and Leela’s father, Ramlogan, a man of startling mood changes and an ever-ready cutlass. There’s the aunt known as The Great Belcher. There are patients pursued by malign clouds or afflicted with an amorous fascination with bicycles. \r\n\r\nWitty, tender, filled with the sights, sounds, and smells of Trinidad’s dusty Indian villages, The Mystic Masseur is Naipaul at his most expansive and evocative.", "asin": "037570714X", "rank": "862155", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/51JUyIRZnUL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}