{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": -37.8142176, "ratings": {"num_ratings": 174, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "I read this book before a trip to Australia, and it helped me appreciate how Kelly is something of a folk hero in that country.  The author takes a creative approach by telling the story from Kelly's perspective.  It is tough to read because there is no punctuation and reads the way an uneducated immigrant from Ireland might talk.  Over time you get used to it, however.  You can't help but develop sympathy towards Kelly, because you understand his moral compass and realize how mistreated he was by outsiders growing up.  Read the book, then visit the Melbourne Goal to hear more about Kelly and his Gang."}, {"review_sentiment": 3.0, "review_text": "I particularly liked the WAY this story was told: interesting style, format and use of dialect. The story itself was well crafted and interesting up to a point. After a while, I just wanted it to end but having devoted so much time to it, I stuck it out. With a good cast, wilderness setting and strong editing, this would be a fun wild, outlaw gang movie. I feel comme ci comme ça about having read it."}, {"review_sentiment": 4.0, "review_text": "A good interpretation of why Ned Kelly was such a hero. I was headed to Australia and wanted to read some of their literature.  It is a historic novel and not true history, a little slow in parts, but it made the display of Ned Kelly and his armor at Melbourne's State Library of Victoria more interesting."}, {"review_sentiment": 5.0, "review_text": "In every age we need to be reminded that some who are labelled troublemakers are actually those with sufficient heart to stand up against misplaced authority and the self-seeking aims of the powerful and privileged few.  In America, Ned Kelly might have been a Martin Luther King Jr., a Caesar Chavez, or any of the multitude of unrecognized folk who sacrifice to do what is needed in their place and time.This is an excellent story.  Others have noted its strengths, so I'll let those reviews speak for me.  There's not a wrong note anywhere.  It's a masterpiece."}, {"review_sentiment": 5.0, "review_text": "Based on true events, this novel exudes the true feelings of the oppressed Irish in Australia.  Written with the Irish dialect, Ned and his family a fully drawn characters that move through the tragedy of their lot in life as if cursed by the Gods. Hard to put down but with no surprise at the end  owing to its adherence to the facts, you understand how Kelly has become the Robin Hood figure of Australia."}, {"review_sentiment": 3.0, "review_text": "Good book, appreciate the strong writing.  However, it is just not for me.  Heavy exposition.  I am impressed with all the page breaks and writing like Ned Kelly.  So that is fantastic."}, {"review_sentiment": 5.0, "review_text": "About a third of the way into this novel, I began wondering what so distinguished it that it was awarded the Booker Prize in 2001.  It was a very good story, but I could not discern much depth.  But the story gets ever better and the narrative technique becomes so captivating that by the end I see TRUE HISTORY OF THE KELLY GANG as a tour de force in storytelling and I have no inclination to second-guess its garnering the Booker.Ned Kelly is to Australia what Jesse James is to the United States and, I suppose, what Robin Hood is to England.  He was an outlaw or bushranger, who lived from 1854 to 1880.  The novel is in the form of an autobiography, written by Kelly so that his daughter (whom, it turns out, he never saw) would know the story of his life.  It is written in thirteen installments, collected in separate parcels deposited (according to the novel's conceit) in the Melbourne Public Library.  Kelly wrote his story over the last year of his life as he and his gang (composed of his brother Dan and two other alienated Irishmen) lived in the bush off the proceeds of bank robberies and with the sympathetic help of agrarian locals, all the while dodging an army of \"traps\" (constables).The style is that of a poorly educated man of the bush.  There are no commas or quotation marks, and the use of periods is indifferent.  Hence, sentences are crammed together in run-on fashion.  At times, it can be challenging to track, but one gets used to it.  There is a large measure of profanity, although, presumably for the tender ears of his daughter, Kelly censors it with blank spaces and the use of \"adjectival\" in lieu of the coarse and common word beginning with the letter \"f\".Was Ned Kelly a sociopathic reprobate?  (As was, based on my understanding, Jesse James.)  Or did his life experiences as Irish rubbish, \"a notch beneath the cattle\", turn him, ineluctably, into a horse thief, bank robber, and police killer?  According to the novel, the latter is definitely the case.  Peter Carey's Ned Kelly is noble and generous and intensely loyal and devoted to his family, especially his mother.  If I have any reservation, it is that this fictional Ned Kelly is simply too good.Still, Carey's picture of the colonial Australia that abused Ned Kelly and the dirt poor Irish -- many of them, like Ned, descendants of convicts exiled to New South Wales -- is instructive . . . and disturbing.  As a historical portrayal of brutal, at times Kafkaesque, authoritarian rule by the establishment, TRUE HISTORY OF THE KELLY GANG is well worth reading (in addition to the rip-roaring story)."}, {"review_sentiment": 4.0, "review_text": "There is no doubting the virtuosity of this great novelist.  Retelling this story in an epistolary style crafted to represent the semi-educated literary abilities of Australia's iconic anti-hero is an ingenious if at times annoying strategy.  Carey gives Kelly a \"voice\" he has never had, and an awareness of his own entanglement in a class struggle which has an apologetic function and is clearly fanciful although understandably so.  One of the best things about this book is its convincing depiction of the hardships of bush life, especially when you're a fugitive.  In that way it reminds me of \"Such is Life\" by Joseph Furphy."}, {"review_sentiment": 3.0, "review_text": "Disclaimer: I was brought up in NE Victoria. I come from a long line of Irish Catholic working class.  So this was all familiar to me.Ned Kelly is often regarded as an icon (of sorts) of Australian history, and most of us know the story of the bushranger/folk hero who was picked on by the police force when he was only trying to survive in a tough country – a man “more sinned against than sinning”, perhaps?! It’s an old story, but I thought perhaps Peter Carey would breathe some life into it!My first impression was - this doesn’t ring true.  The Irish-Australian speech doesn’t ring true.  The Irish myths and legends sound as if they’ve come from a book on Irish myths and legends – a whole chapter on the banshee seemed a bit excessive! The spelling and grammar of a supposedly illiterate person seemed very contrived – while some relatively simple words were misspelt, a more difficult word such as “adjectival’ was spelt correctly every time! So the uneducated, illiterate narration didn’t work for me.With all this in mind, it won’t come as a surprise to hear that I didn’t enjoy this at all.  Yes, I know the Kelly family had a terrible life, I know the Irish, particularly the Catholics, were looked down upon, and I know the police force at the time was corrupt and thuggish, but the protagonists came across as self-indulgent and self-pitying, ready-made victims in fact.  That’s harsh, and I almost feel a traitor to my Irishness (if there’s such a word! )in saying it!  However, that was my reaction.There was some attempt at characterisation, but to me the characters were fairly shallow, in some cases more stereotypes than anything else.I did try to keep all my reservations in check as I read, but I’m afraid I couldn’t!"}, {"review_sentiment": 4.0, "review_text": "Unique"}]}, "authors": ["Peter Carey"], "isbn": "0375724672", "longitude": 144.9631608, "periods": ["1800s"], "title": "True History of the Kelly Gang: A Novel", "word_cloud": "trip help something folk hero country author take creative approach tell story perspective tough punctuation read way uneducated immigrant time get use however sympathy towards understand moral compass realize mistreat outsider grow visit hear particularly like story tell interesting style format use dialect story well craft interesting point want end devote much time stick good cast wilderness set strong edit wild outlaw gang movie feel comm s comm a good interpretation hero head want literature historic little slow part make display armor interest age need remind labeled troublemaker actually sufficient heart stand misplace authority aim powerful privilege multitude unrecognized folk sacrifice need place excellent story note strength let wrong note masterpiece base event exude feeling oppress irish dialect family fully draw character move tragedy lot life curse put surprise end owe adherence fact understand become figure good appreciate strong writing however exposition impress page break write fantastic third way begin wonder distinguish awarded good story much depth story get ever better narrative technique become captivate see tour force storytelling inclination garner suppose outlaw bush ranger live form autobiography write daughter turn never saw story life write thirteen installment collect separate parcel deposit accord conceit write story last year life gang compose brother alienate irishman live bush proceeds bank robbery sympathetic help agrarian local dodge army trap constable style poorly educate man bush commas quotation mark use period indifferent sentence cram together fashion time challenge track get use large measure profanity presumably tender ear daughter censor blank space use adjectival lieu coarse common word begin letter f sociopath reprobate base understanding life experience irish rubbish notch beneath cattle turn ineluctably horse thief bank police killer accord latter definitely case noble generous intensely loyal devote family especially mother reservation fictional simply picture colonial abuse dirt poor many descendant convict exile instructive disturbing historical portrayal brutal time authoritarian rule establishment well read addition story doubt virtuosity great novelist story epistolary style craft represent literary ability iconic ingenious time annoy strategy give voice never awareness entanglement class struggle apologetic function clearly fanciful understandably best thing convince depiction hardship bush life especially fugitive way reminds such disclaimer bring come long line work class familiar often regard icon sort australian know story hero pick police force try survive tough country man sin sin perhaps old story think perhaps life first impression ring speech ring irish myth legends sound come irish myth legends whole chapter banshee seem bit excessive spelling grammar supposedly illiterate person seem contrived relatively simple word misspend difficult word adjectival sleep correctly time so uneducated illiterate narration work mind come surprise hear enjoy know family terrible life know irish particularly look know police force time corrupt thuggish protagonist come victim fact harsh almost feel traitor word say however attempt characterization character fairly shallow case stereotype anything try reservation afraid unique", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "“I lost my own father at 12 yr. of age and know what it is to be raised on lies and silences my dear daughter you are presently too young to understand a word I write but this history is for you and will contain no single lie may I burn in Hell if I speak false.”\r\n\r\nIn True History of the Kelly Gang, the legendary Ned Kelly speaks for himself, scribbling his narrative on errant scraps of paper in semiliterate but magically descriptive prose as he flees from the police. To his pursuers, Kelly is nothing but a monstrous criminal, a thief and a murderer. To his own people, the lowly class of ordinary Australians, the bushranger is a hero, defying the authority of the English to direct their lives. Indentured by his bootlegger mother to a famous horse thief (who was also her lover), Ned saw his first prison cell at 15 and by the age of 26 had become the most wanted man in the wild colony of Victoria, taking over whole towns and defying the law until he was finally captured and hanged. \r\n\r\nHere is a classic outlaw tale, made alive by the skill of a great novelist.", "asin": "0375724672", "rank": "139224", "city": "Melbourne", "image": "https://images-na.ssl-images-amazon.com/images/I/51P0eDcGazL.jpg", "country": "Australia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}