{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 155, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "V.S. Naipaul captures something important in the struggle of colonized people to enter into a new order, the nature of which they do not understand, and enter through a combination of consumerism and private property. Much confusion abounds among the poor about such distinctions. This is one of my all-time favorite books."}, {"review_sentiment": 5.0, "review_text": "No signs of aging in this masterpiece by Naipaul (a novel he excelled only much later in A Bend in the River)."}, {"review_sentiment": 3.0, "review_text": "I did not enjoy the book. The only reason I finished it was because I liked the writing style. I had a lot of difficulty to connect and like the main character. In fact, I was even glad he was so miserable: he really deserved it!The plot is quite blurry, timelines are nowhere to be seen. For instance, I had hard time understanding how old the main protagonist where, how long did it take from the event X to the event Y. I wish the book was shorter and better structured. But hey, Naipaul won Nobel prize for something!"}, {"review_sentiment": 4.0, "review_text": "Interesting perspective but drags on quite a bit.  Still I rather enjoyed it and there was quite a bit of sarcasm and humor in it."}, {"review_sentiment": 1.0, "review_text": "I do not understand the praise for this work; trashy and repetitive to me."}, {"review_sentiment": 1.0, "review_text": "This story was boring and depressing. Mr. Biswas was a very unlikable character - irresponsible, mean to his wife, a whiner and someone who seemed to like playing a victim."}, {"review_sentiment": 5.0, "review_text": "A classic I should have read long ago!"}, {"review_sentiment": 5.0, "review_text": "I loved this book.  It gave me insight into the lives of Indians....  and all the emotions Mr. Biswas felt....  His family and extended family....  what a bund of characters!"}, {"review_sentiment": 5.0, "review_text": "This has been a longtime favourite read of mine since I was in college. Its a bit of a drag, so is life - so get on with it. Naipual shows us why life is still worth living. Remember: an unexamined life is not worth living."}, {"review_sentiment": 5.0, "review_text": "Very interesting book. It is not exactly easy to read, many times I caught myself hating the characters other times cheering for them, then they disappoint me somehow, etc... The book presents so many perspectives, so many characters, that it is impossible to not develop empathy for each of them. Regarding the story itself, there are parts where many things happen, while in others it seems like a long waiting, just like life. I am a fan of the author and this was the harder book to read. (in a good, but painful way)"}]}, "authors": ["V.S. Naipaul"], "isbn": "0375707166", "longitude": 0.0, "periods": ["1900s"], "title": "A House for Mr. Biswas", "word_cloud": "capture something important struggle colonize people enter new order nature understand enter combination consumerism private property much confusion abound poor distinction favorite sign age masterpiece excel much later enjoy reason finish like write style lot difficulty connect main character fact even glad miserable really deserve plot quite blurry timeline nowhere see instance hard time understand old main protagonist long event event wish shorter better structure hey prize something interest perspective drag quite bite still rather enjoy quite bit sarcasm humor understand praise work trashy repetitive story bore depress unlikable character irresponsible mean wife whiner someone seem play victim classic long ago love give insight life emotion felt family extend family bind character longtime favorite mine college bit drag life get naipaul show life still worth live examined life live very interest exactly easy many time catch hat character time cheer disappoint somehow etc present many perspective many character impossible empathy story part many thing happen others seem long wait life fan author harder good painful way", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The early masterpiece of V. S. Naipaul’s brilliant career, A House for Mr. Biswas is an unforgettable story inspired by Naipaul's father that has been hailed as one of the twentieth century's finest novels.\r\n\r\nIn his forty-six short years, Mr. Mohun Biswas has been fighting against destiny to achieve some semblance of independence, only to face a lifetime of calamity. Shuttled from one residence to another after the drowning death of his father, for which he is inadvertently responsible, Mr. Biswas yearns for a place he can call home. But when he marries into the domineering Tulsi family on whom he indignantly becomes dependent, Mr. Biswas embarks on an arduous–and endless–struggle to weaken their hold over him and purchase a house of his own. \r\n\r\nA heartrending, dark comedy of manners, A House for Mr. Biswas masterfully evokes a man’s quest for autonomy against an emblematic post-colonial canvas.\r\n\r\n\"Naipaul has constructed a marvelous prose epic that matches the best nineteenth-century novels for richness of comic insight and final, tragic power.\" Newsweek\r\n\r\n", "asin": "0375707166", "rank": "87403", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/51rWrNovdOL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}