{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 64.145981, "ratings": {}, "authors": ["Jon Krakauer", "David Roberts"], "isbn": "0375752676", "longitude": -21.9422367, "periods": ["1900s"], "title": "Iceland: Land of the Sagas", "word_cloud": "", "genres": ["Travel Writing", "Photography"], "summary": "\"We raised our fists and cheered. . . . With the sagas in our heads, with Iceland at its wildest beneath our boots, it would not have been impossible to see Bárdr clumping along the summit ridge, prodding the glacier with his staff, ready to show us the way down.\"\r\n\r\nIceland is a pictorial classic on one of the last \"undiscovered\" countries in Europe--reissued for the first time in paperback.\r\n        \r\nIceland is often thought to be covered by ice, but in fact it is gloriously green. Lush meadows, wildflower fields, and miles of rich tundra cover a landscape of remarkable variety: deep lakes, bubbling hot springs, tumbling waterfalls, snow-capped mountains. It's also a landscape amazingly alive with massive lava flows and enormous glaciers. The human story of Iceland goes back more than eleven thousand years, and its heritage is told here in a treasury of riveting sagas of real-life heroes and all manner of supernatural beings.\r\n        \r\nBoth the land and the people of one of Europe's most gorgeous countries come to life in this colorful account of the authors' adventures as they walk, climb, and photograph their way through Iceland and connect to the bone-chilling sagas and the unfamiliar terrain. With breathtaking photographs from critically acclaimed writer and journalist Jon Krakauer, author of the international bestsellers Into Thin Air and Into the Wild, and a penetrating narrative from Outside contributing editor and travel writer David Roberts, Iceland splendidly captures the spirit of this enigmatic country. \r\n        \r\nCircumnavigating Iceland in summer and winter, Krakauer and Roberts encounter tales of monks and Vikings, outlaws and adventurers, trolls and witches. While touring and photographing, they discover the myths and legends of Iceland's stirring history. Numerous other feats--including a hazardous winter climb to the summit of one of Iceland's tallest mountains--round out a fascinating introduction to this unique and beautiful land.", "asin": "0375752676", "rank": "61761", "city": "Reykjavik", "image": "https://images-na.ssl-images-amazon.com/images/I/5135zYL98VL.jpg", "country": "Iceland", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}