{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 35, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "LeVine not only displays an unusual grasp of the geopolitics of oil but, through hundreds of interviews and meticulous research, he has also assembled a unique anecdotal history of the role of oil and politics in the dramatic reshaping of the former Soviet empire into a dozen or more splinter states bound together by tribal loyalties and historical dependencies. He is a fine story teller with a knack for weaving stories into proper historical context."}, {"review_sentiment": 5.0, "review_text": "Very interesting book, tells the story of the insiders, and the  the politics."}, {"review_sentiment": 5.0, "review_text": "This is such a comprehensive study of the region and the insurance and outs of the industry.  I really learned a lot!"}, {"review_sentiment": 5.0, "review_text": "I finished this book a few days ago. It is 400 pages long but a rather quick read. Steve LeVine describes how, after the fall of the Soviet Union in the early nineties, various oil companies competed for rights to petroleum reserves in the Caspian Sea, located primarily in the newly independent countries of Azirbaijan and Kazakhstan. Dealings and interactions between officials from Chevron, BP, Agip, and other corporations and leading government officials such as Nursultan Nazarbayev of Kazakhstan, Heydar Aliyev of Azirbaijan, Russian officials, and also high ranking American officials are presented in meticulous detail. From this book, one learns a great deal about how the oil industry operates and how oil companies, to remain profitable, must explore the world for new oil reserves and make deals with the governments of the countries with those reserves. Steve LeVine also informs the reader a great deal about both American and Russian geopolitical policies in the Eurasian region. Russia, in particular, is portrayed in a rather negative light as attempting to keep a stranglehold on former Soviet states. Anyhow, this is a book I highly recommend."}, {"review_sentiment": 5.0, "review_text": "Very informative book on the oil industry in Central Asia"}, {"review_sentiment": 4.0, "review_text": "I work in Tengiz, Kazakhstan so naturally  I found the history of this area very interesting."}, {"review_sentiment": 5.0, "review_text": "GREAT BACKGROUND INFORMATION FOR PERIOD AND FUTURE ISSUES"}, {"review_sentiment": 4.0, "review_text": "Excellent information on capitalism at the Caspian"}, {"review_sentiment": 4.0, "review_text": "The Caspian Sea is one of the most important oil regions in the world. However very little has been written about it. This book helps change that. Starting with the history of the development of the oil industry there, LeVine goes on to the modern day, detailing the way multinational oil companies came to dominate the region.There is a major focus on the personalities involved, backed by interviews with nearly everyone written about. At the same time that can be considered the only mark against the book; it is very personality-based, and at times feels like its an attack on a few select people. I would also have liked to see more information about the effects it had on the Caspian states themselves, but I realise that can be difficult with their reluctance to contribute in something that would be critical of their regimes. It also seems rather short considering the magnitude of the subject; an extra 100 pages of details would certainly not have hurt.As well, as the book was published in 2007, it is obviously unable to include the 2008 Russia-Georgia War and the repercussions of that conflict. So if you are looking for that, you will have to read other material.Overall a decent book that helps explain why the Caspian region is as it is in regards to oil and natural gas."}, {"review_sentiment": 5.0, "review_text": "This is a great book written by a great author. It is captivating and interesting and is presented in an easily absorbable and graceful fashion that makes it an easy and fun read."}]}, "authors": ["Steve LeVine"], "isbn": "0375506144", "longitude": 0.0, "periods": ["1900s", "2000s", "Recent Releases"], "title": "The Oil and the Glory: The Pursuit of Empire and Fortune on the Caspian Sea", "word_cloud": "display unusual grasp geopolitics hundred interview meticulous research also assemble unique anecdotal history role politics dramatic reshape former soviet dozen splinter state together tribal loyalty historical dependency fine story teller knack weave story proper historical context very interesting tell story insider politics comprehensive study region insurance out industry really learn lot finish day page long rather quick describe fall early ninety various company compete right petroleum reserve locate primarily newly independent country interaction official corporation lead government official official also high ranking american official present meticulous detail learn great deal industry operate company remain profitable world new reserve make deal government country reserve also inform great deal american geopolitical policy eurasian region particular portray rather negative light attempt stranglehold former soviet state anyhow highly recommend very informative industry work naturally find history area interesting great excellent information capitalism important region world however little write help start history development industry go modern day detail way multinational company come dominate major focus personality involve back interview nearly everyone write time consider mark time feel attack select people also see information effect state realist difficult reluctance contribute something critical regime also seem rather short consider magnitude subject extra page detail certainly well publish obviously unable include repercussion conflict so look decent help region regard natural gas great write great author captivate interest present easily absorb able graceful fashion make easy fun", "genres": ["Business & Finance", "History"], "summary": "Remote, forbidding, and volatile, the Caspian Sea long tantalized the world with its vast oil reserves. But outsiders, blocked by the closed Soviet system, couldn’t get to it. Then the Soviet Union collapsed, and a wholesale rush into the region erupted. Along with oilmen, representatives of the world’s leading nations flocked to the Caspian for a share of the thirty billion barrels of proven oil reserves at stake, and a tense geopolitical struggle began. The main players were Moscow and Washington–the former seeking to retain control of its satellite states, and the latter intent on dislodging Russia to the benefit of the West. \r\n\r\nThe Oil and the Glory is the gripping account of this latest phase in the epochal struggle for control of the earth’s “black gold.” Steve LeVine, who was based in the region for The Wall Street Journal, The New York Times, and Newsweek, weaves an astonishing tale of high-stakes political gamesmanship, greed, and scandal, set in one of the most opaque corners of the world. In LeVine’s telling, the world’s energy giants jockey for position in the rich Kazakh and Azeri oilfields, while superpowers seek to gain a strategic foothold in the region and to keep each other in check. At the heart of the story is the contest to build and operate energy pipelines out of the landlocked region, the key to controlling the Caspian and its oil. The oil pipeline that resulted, the longest in the world, is among Washington’s greatest foreign policy triumphs in at least a decade and a half. \r\n\r\nAlong the way, LeVine introduces such players as James Giffen, an American moneyman who was also the political “fixer” for oil companies eager to do business on the Caspian and the broker for Kazakhstan’s president and ministers; John Deuss, the flamboyant Dutch oil trader who won big but lost even bigger; Heydar Aliyev, the oft-misunderstood Azeri president who transcended his past as a Soviet Politburo member and masterminded a scheme to loosen Russian control over its former colonies in the Caspian region; and all manner of rogues, adventurers, and others drawn by the irresistible pull of untold riches and the possible “final frontier” of the fossil-fuel era. The broader story is of the geopolitical questions of the Caspian oil bonanza, such as whether Russia can be a trusted ally and trading partner with the West, and what Washington’s entry into this important but chaotic region will mean for its long-term stability.\r\n\r\nIn an intense and suspenseful narrative, The Oil and the Glory is the definitive chronicle of events that are understood by few, but whose political and economic impact will be both profound and lasting.", "asin": "B000W967HY", "rank": "710423", "city": "Kazakhstan", "image": "https://images-na.ssl-images-amazon.com/images/I/51bpTi%2BQ3FL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}