{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 22, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "I'm a great admirer of Gore Vidal, & have read all 7 of his 'Narratives of Empire.' Having acknowledged that, it's my feeling that 'Washington DC' is by far the weakest of the 7. It was the first of the series chronologically (i.e., in order of publication). It's much more a novel and much less a history lesson than the other 6. It also isn't exactly compatible with the others, since the character (newspaper publishing magnate) 'Blaise' doesn't have the half-sister 'Caroline' who figures prominently in most of the other books.The problem is not that it's a lousy novel. Rather, it appears to be a sort of tentative or experimental effort, some aspects of which worked pretty well, & others which didn't. My guess is that when Vidal wrote this book, he hadn't yet fully decided on the technique he'd use for portraying the development of the  American Empire -- a subject he understands with great clarity. Eventually, he settled on a formula that was more history lesson and less fiction. But in this initial member of the series, he still hadn't gotten clear on just how he was going to set forth his view of American history. So this volume wound up making far too much of his fictional characters, while relegating the really important stuff, like McCarthyism, to the background. For me, the only value of the book was seeing how a brilliant guy & fine prose writer like Vidal initially approached a very challenging project -- and, like many of us ordinary mortals, didn't entirely get it right, at least at first. Later, he got considerably better. (IMHO, the best of the series were 'Lincoln' & 'Burr.')"}, {"review_sentiment": 5.0, "review_text": "Vidal continues his mastery of the genre in his American Empire series, showing how Rome...ear, America, went from republic to empire, and we're all the worse for it. Excellent history reads like riveting fiction."}, {"review_sentiment": 5.0, "review_text": "Many reviewers on this site have been saying that this was one of the last, or the last, novel in Vidal's Empire series. It was actually the first, and it was published in 1967.  Washington D.C. and Empire are my two favorite novels within the Empire series for one simple reason, Mr. Vidal was alive and experienced these events first-hand. Not just because he was alive, but because he was his Senator grandfather's page at the Capitol, both in-session and out of session. How many people can say that they spent their childhood listening to politicians on the senate floor?Mr. Vidal succeeds in conveying the tenor that was heard from DC, and the results that it created throughout the world and time period.An engaging read, written by one of the greatest historians of all time. Why was he great? Because he was as honest as possible, but aimed to entertain in the small spots that he knew that he, nor anyone else, had enough information on the event or moment to describe in a historically accurate way. This is a novel after all."}, {"review_sentiment": 4.0, "review_text": "Gore Vidal’s 1967 novel Washington DC is elevated soap opera, something that might have been produced by a more literate Jacqueline Susann or Harold Robbins. Not that there’s anything wrong with that…The book is definitely a page turner as it chronicles the lives, loves, betrayals and ambitions of a set of stereotyped characters in the nation’s capital from the late 1930s through the mid 1950s. They include the ambitious young staffer, the alcoholic political wife, the veteran senator with the skeleton in his closet, the cynical journalist, the power-broker newspaper publisher and so on and so forth…Vidal makes all this very readable and enjoyable in a trashy sort of way. Washington DC isn’t anywhere near on par with Vidal’s previous book, Julian, about fifth century Roman emperor Julian the Apostate, but it is a lot easier to read.Vidal would eventually make this the first of a series of historical novels (though the last chronologically) featuring the families of some of these same characters. I’ll be reading and reviewing those in due course. Hopefully, they remain just as readable as Washington DC but a little more on the Julian level in terms of narrative sophistication and character development."}, {"review_sentiment": 5.0, "review_text": "Gore Vidal taught me so much about US history."}, {"review_sentiment": 3.0, "review_text": "Vidal's cynicism is fully evident in this book, and it really makes the story unappealing. History comes alive in Burr and Lincoln, is well represented in 1876 and Hollywood, but falls flat in this book. If you haven't read the others, start there. Vidal is a wonderful writer of historical fiction, but this isn't his best ..."}, {"review_sentiment": 5.0, "review_text": "Vidal's \"America Series\" is pure genius.  One of the great writers of the 20th century."}, {"review_sentiment": 5.0, "review_text": "If you like Gore Vidal...which I do....this is such a timely book in spite of its age.  He is superb at illuminating the crassness, vulgarity and humanity of everyone he describes and every event that he illuminates."}, {"review_sentiment": 3.0, "review_text": "1) Plot (3 stars) - In manipulative, superficial Washington DC of the 1940s, one man strives to rise up the political system while those around him react to his wake.  I wrote react because that's really what this book is about - a bunch of reactions, not actions.  It's intriguing, and at times insightful, but there's not a lot of action that pushes the narrative forward.2) Characters (3 stars) - There's Clay, the ambitious lead who wants to climb the political ladder and eventually gets pulled up through the powers of mass marketing.  There's the sultry and bitchy wife, Enid.  There's the brother-in-law, Peter, who without morals of his own, just watches others for things to copy.  And there are some older politicians trying to hold on to the past.  All in all, not a bad cast.  But not a particularly riveting one.  What saved them was Vidal's keen insight about human psychology when these characters interacted.3) Theme (2 stars) - I suppose the message here is that Washington politicians are shallow, self-interested, hypocrites.  Maybe this was news in the 60s when this book was published (though I doubt it), but I've certainly heard this message before.  It would have been nice if this exploration was a bit more balanced.4) Voice (4 stars) - Vidal is obviously intelligent, and it shines through in the diction, references, and psychological insights of his prose.  But some sections felt gossipy, and I wondered why he lowered his intelligent gaze so frequently to these hollow topics.5) Setting (3 stars) - Washington DC during its transition from village to the capital of an empire before and after the Second World War.  There were some interesting descriptions of Washington back when it was still just a large village, but, despite the title, setting didn't really seem to be the point of this book.6) Overall (3 stars) - Vidal is smart and he can write, but the struggles he writes about here felt more petty than noble.  Now, pettiness is fine; in fact, characters without pettiness are hard to believe.  But characters that are all pettiness, with no sense of the good or beautiful, just seem childish.  Maybe that's how the people of DC were, but it made it hard for this reader to care about these leads."}, {"review_sentiment": 5.0, "review_text": "Loud and clear, Gore Vidal's voice in all his books, and in the novel WASHINGTON DC, cannot be mistaken.  We read the novelist's commentary between each line of dialogue and his voice draws our attention to every sign of strength or weakness or hypocrisy and every shift in power no matter how subtle that fills every moment in this book.  Vidal's eye for detail is never merely descriptive; he zeros in on the way power in all its forms either motivates action or deludes its participant. For in every room in every house, where ever one finds two or more people together, a power play is taking place. Money, though certainly part of the process, never overwhelms the politics of power that drives WASHINGTON DC. The story spans many years in the lives of its characters, charting their transitions in life, some into and some out of the public eye, all of them in their own way jockeying for position.  Though published forty years ago, it would seem that the smell of old money and the back room trade offs, spelling progress or disaster in our nations capital, have not changed in any fundamental way.  Gore Vidal loves this playing field,  even as he savages the game that's being played. You get the sense that he believes the game is one we should take note of, and seriously consider. For the loss of innocence, that characterizes the main players' progressions here,  reflects upon an even greater loss for our country and all of us who live in it. Vidal's wit is, as always, sharp, but what makes this novel a stunning work of art is the sadness that hovers at first in the shadows,  then, by the end it overwhelms all."}]}, "authors": ["Gore Vidal"], "isbn": "0375708774", "longitude": -77.0366456, "periods": ["1900s"], "title": "Washington, D.C: A Novel", "word_cloud": "great admirer acknowledge feel far weakest first series chronologically order publication much much le history lesson also exactly compatible others character newspaper publishing magnate figure prominently problem lousy appear tentative experimental effort aspect work pretty well others guess write yet fully decide technique use portray development american subject understand great clarity settle formula history lesson fiction initial member series still gotten clear go set forth view american history volume wound make far much fictional character relegate really important stuff background value see brilliant guy fine prose writer initially approach challenge project many ordinary mortal entirely right least first get considerably better best series continue mastery genre series show ear go republic empire worse excellent history read rivet fiction many reviewer site say last last series actually first publish favorite novel series simple reason alive experience event not alive grandfather page session many people say spend childhood listen politician senate floor succeed convey tenor heard result create world time engage write greatest historian time great honest possible aim entertain small spot know anyone else enough information event moment describe historically accurate way elevate soap opera something literate not anything wrong definitely page turner chronicle live love betrayal ambition set stereotyped character nation capital late mid include ambitious young staffer alcoholic political wife veteran senator skeleton cynical journalist newspaper publisher make readable enjoyable trashy sort way anywhere par previous fifth century emperor lot easier eventually first series historical novel last chronologically feature family character read review due course remain readable little julian level term narrative sophistication character development teach much history cynicism fully evident really make story unappealing come alive well represent fall flat others start wonderful writer historical fiction best pure genius great writer century timely spite age superb illuminate crassness vulgarity humanity everyone describe event illuminates plot star manipulative superficial man strive political system react wake write react really bunch reaction action intrigue time insightful lot action push narrative star ambitious lead want climb political ladder eventually get pulled power mass marketing sultry bitchy wife moral watch others thing copy older politician try hold bad cast particularly rivet save keen insight human psychology character star suppose message politician shallow hypocrite maybe news publish doubt certainly hear message exploration bit star obviously intelligent shine diction reference psychological insight prose section felt gossipy wonder lowered intelligent gaze frequently hollow set star transition village capital empire interest description back still large village title set really point star smart write struggle write felt petty noble now pettiness fine fact character pettiness hard believe character pettiness sense good beautiful seem childish maybe people make hard care lead loud clear voice mistaken novelist commentary line dialogue voice draw attention sign strength weakness hypocrisy shift power matter subtle fill moment eye detail never merely descriptive zero way power form motivates action deludes participant room house ever find people together power play take place certainly part process never overwhelm politics power drive story span many year live character chart transition life public eye way jockey position publish year ago smell old money back room trade offs spell progress disaster nation capital change fundamental way love play field even savage game play get sense believe game take note seriously loss innocence characterize main player progression reflect even greater loss country live wit always sharp make stun art sadness hovers first shadow end overwhelms", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "Book 6/7 in the Narratives of Empire Series\r\n\r\nWashington, D.C., is the final installment in Gore Vidal's Narratives of Empire,his acclaimed six-volume series of historical novels about the American past. It offers an illuminating portrait of our republic from the time of the New Deal to the McCar-thy era.\r\n\r\nWidely regarded as Vidal's ultimate comment on how the American political system degrades those who participate in it, Washington, D.C. is a stunning tale of corruption and diseased ambitions.\r\n\r\nIt traces the fortunes of James Burden Day, a powerful conservative senator who is eyeing the presidency; Clay Overbury, a pragmatic young congressional aide with political aspirations of his own; and Blaise Sanford, a ruthless newspaper tycoon who understands the importance of money and image in modern politics.\r\n\r\nWith characteristic wit and insight, Vidal chronicles life in the nation's capital at a time when these men and others transformed America into \"possibly the last empire on earth.\"\r\n\r\n\"Washington, D.C. may well be the finest of contemporary novels about the capital,\" said The New Yorker, and the Times Literary Supplement deemed it \"a prodigiously skilled and clever performance.\"", "asin": "0375708774", "rank": "367932", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51k%2BEjyOS2L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}