{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 479, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "Good read"}, {"review_sentiment": 3.0, "review_text": "I found the story a little slow and the dialogue uncomfortable."}, {"review_sentiment": 1.0, "review_text": "Story took way too long to tell. I found it tedious and disappointing."}, {"review_sentiment": 3.0, "review_text": "It was too slow & long. Too much information not necessary. The author could have gotten to points r situations  faster. The author drags on & on."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this book but it was a little long.  I kind of skipped over some pages that weren't adding anything to the storyline."}, {"review_sentiment": 5.0, "review_text": "This is a wonderful read - full of suspense and unexpected turns of plot. The author's talent  is the finest!"}, {"review_sentiment": 3.0, "review_text": "too long"}, {"review_sentiment": 5.0, "review_text": "At least 300 pages too long but a great mystery, keeps you guessing till the end."}, {"review_sentiment": 5.0, "review_text": "Excellent Book"}, {"review_sentiment": 4.0, "review_text": "excellent read."}]}, "authors": ["Stephen L. Carter"], "isbn": "0375712925", "longitude": -77.0366456, "periods": ["2000s"], "title": "The Emperor of Ocean Park", "word_cloud": "good find story little slow dialogue uncomfortable take way long tell find tedious disappointing long too much information necessary author point r situation faster author drag enjoy little long kind skip page add anything story line wonderful full suspense unexpected turn plot author talent finest long least page long great mystery keep guess till end excellent excellent", "genres": ["Fiction & Literature", "Mystery & Suspense", "Politics"], "summary": "Book 1/3 in the Elm Harbor Series\r\n\r\nIn his triumphant fictional debut, Stephen Carter combines a large-scale, riveting novel of suspense with the saga of a unique family. The Emperor of Ocean Park is set in two privileged worlds: the upper crust African American society of the Eastern seabord—families who summer at Martha’s Vineyard—and the inner circle of an Ivy League law school. \r\n\r\nTalcott Garland is a successful law professor, devoted father, and husband of a beautiful and ambitious woman, whose future desires may threaten the family he holds so dear. When Talcott’s father, Judge Oliver Garland, a disgraced former Supreme Court nominee, is found dead under suspicioius circumstances, Talcott wonders if he may have been murdered. \r\n\r\n", "asin": "0375712925", "rank": "193667", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51t4aHvfo3L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}