{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 396, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "This book is written with magnificent flair and with deep understanding of the peacemakers as humans.  She zeroes in to paint colorful portraits of key persons; she pulls back to consider the geographic and ethnic aspects at play in the wrangling on all sides.  Very fine in every respect."}, {"review_sentiment": 5.0, "review_text": "Paris 1919 is a wide ranging and yet concisely written history of one of the seminal events of the 20th century. In the immediate aftermath of the First World War The leaders of the Allied nations, particularly the USA, Great Britain and France met to ostensibly put the pieces back together after the collapse of the Austria- Hungarian empire, the Ottoman Empire and Germany. The book includes a remarkable level of detailed anecdotal stories that illuminate the characters and interactions of the major personalities involved. Wilson, LLoyd George ,  Clemenceau and many others cross the stage in these pages as maps are redrawn, ethnic and tribal rivalries that had been dormant under the rule of now defeated empires are reawakened and a defeated Germany is chastised by the victors. Incredibly well researched and written this is an entertaining and fascinating book that brings to light the immense political pressures and difficulties faced by the Allies who were negotiating the fate of the world. It makes it clear that while the intentions were good as evidenced by Wilson's 14 points ( included as an appendix) , real world considerations and political jousting created the need for compromises and decisions that ultimately had tragic consequences. The author concludes that history has simplified these complex factors into essentially a formula that blames the stringent terms of the Treaty Of Versailles on what was to follow in Germany and lead to the rise of Hitler ,and makes a sound case that the reality and circumstances were much more complicated. From the Middle East to Eastern Europe to Africa and Asia the horse trading and decisions made in these fateful days , so well described in these pages, have echoed down the decades and many of those decisions shape the world we still live in almost 100 years later.Wilson's dream of a league of nations fairly constituted of nations of self -determined peoples seems naive in retrospect; a case of good intentions  colliding with reality that had innumerable and still not fully realized long term implications."}, {"review_sentiment": 5.0, "review_text": "A super book telling how the world was changed after WW1."}, {"review_sentiment": 5.0, "review_text": "Fabulous and complete review of effect on each country a result of Treaty"}, {"review_sentiment": 2.0, "review_text": "MacMillan concludes with some “what ifs” based on the flaw with her work.  The book is a defense of the League of Nations and the Treaty of Versailles.  While she ignores damning documents of the British begging Wilson to stop touring France collecting accolades and come to work, she does not alter facts.  She correctly identifies 1939 as the test of the work of 1919.  Her proof that Versailles was not the cause of the second world war is that Hitler would have wanted more land even if an absolute status quo was maintained in the prior settlement.  This statement comes just a few pages after pointing out that the Weimar Republic fell apart largely due to signing the treaty.  Even Hindenburg thought Hitler was a buffoon so it is very unlikely that Hitler would have had a successful career apart from the treaty.  The greatest flaw is that the work ignores Wilson diversion of the conference from one of a lasting peace to a League of Nations monument to himself.  The delays caused by this diversion allowed French and Italian greed to fester while the fourteen points became a lie to Germany that the peace would not look backward for a model.  Whether Germany had put together reports that the consequences of the peace would resemble what they became, Wilson had led them to believe this would not be the case.  MacMillan believes that the conference put into place many international legal norms and this justifies any other troubles.  This is a diversion.  The League of Nations was a failure, but it was worthwhile as a separate issue.  Wilson’s insistence that the League be the first order of business was inept.  If the League was discussed at all it should have been a separate issue and not part of the actual treaty.  When diplomats met in Paris, their job was to formulate a treaty.  The treaty they put together made the rise of Hitler and the Second World War unavoidable.  In the closing “what ifs”, MacMillan should have included “what if Wilson had not raised German expectations of a just peace and got down to business restraining France from its justified desire for revenge”."}, {"review_sentiment": 5.0, "review_text": "Outstanding history of a troubling time that screwed the world until today"}, {"review_sentiment": 4.0, "review_text": "delivery on time receive it next day . very nice . very good . It was a gift, they liked it a lot, works great. for myself,"}, {"review_sentiment": 4.0, "review_text": "An attempt to define and explain how the victors in WWI tried to develop the patchwork of a new Europe and the near east. In retrospect, some careless and unwise decisions. Western arrogance on display. Versailles treaty and it's contribution to tragic later events. Again demonstrates human fallibility, greed and errors of that time. We continue in the same vein, impelled by our human nature.  Certainly worth a read."}, {"review_sentiment": 4.0, "review_text": "The events of 1919 continue to impact us today and Margaret Macmillan provides an excellent narrative - well researched and written."}, {"review_sentiment": 5.0, "review_text": "Good read on the Paris Peace Conference - usable for students"}]}, "authors": ["Margaret MacMillan"], "isbn": "0375760520", "longitude": 2.3514992, "periods": ["1900s", "Recent Releases"], "title": "Paris 1919: Six Months That Changed the World", "word_cloud": "write magnificent flair deep understanding peacemaker humans zero paint colorful portrait key person pull back geographic ethnic aspect play wrangle side very fine respect wide range yet concisely write history seminal event century immediate aftermath leader particularly meet ostensibly put piece back together collapse hungarian empire include remarkable level detail anecdotal story illuminate character interaction major personality involve many others cross stage page map redrawn ethnic tribal rivalry dormant rule defeat empire reawaken defeat chastise victor incredibly well research write entertain fascinating brings light immense political pressure difficulty face ally negotiate fate make clear intention good evidence point include appendix real consideration political jousting create need compromise decision ultimately tragic consequence author conclude history simplify complex factor essentially formula blame stringent term follow lead rise make sound case reality circumstance much complicate horse trading decision make fateful day well describe page echo decade many decision shape still live almost year dream league nation fairly constitute nation people seem naive retrospect case good intention collide reality innumerable still fully realize long term implication super tell fabulous complete review effect country result conclude ifs base flaw work defense ignores damn document british beg tour collect accolade come work alter facts correctly identify test work proof cause second war want even absolute status quo maintain prior settlement statement come page point fell apart largely due signing treaty even think buffoon unlikely successful apart treaty greatest flaw work ignores diversion conference last peace monument delay cause diversion allow french greed fester fourteen point become lie peace backward model put report consequence peace become lead believe case believe conference put place many international legal norm justifies trouble diversion failure worthwhile separate issue insistence first order business inept discuss separate issue part actual treaty diplomat meet job formulate treaty put together make rise unavoidable close ifs include raise german expectation peace get business restrain justify desire revenge outstanding history troubling time screw today delivery time receive next day nice good gift like lot work great attempt define explain victor try patchwork new east retrospect careless unwise decision western arrogance display treaty contribution tragic later event again demonstrate human fallibility greed error time continue vein impel human nature worth event continue today provide excellent narrative well research write good usable student", "genres": ["Biography", "Politics", "WWI"], "summary": "New York Times Editors’ Choice \r\n\r\nFor six months in 1919, after the end of “the war to end all wars,” the Big Three—President Woodrow Wilson, British prime minister David Lloyd George, and French premier Georges Clemenceau—met in Paris to shape a lasting peace. \r\n\r\nIn this landmark work of narrative history, Margaret MacMillan gives a dramatic and intimate view of those fateful days, which saw new political entities—Iraq, Yugoslavia, and Palestine, among them—born out of the ruins of bankrupt empires, and the borders of the modern world redrawn.", "asin": "0375760520", "rank": "38710", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51KI3103w2L.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}