{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 35, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "Nothing to add."}, {"review_sentiment": 4.0, "review_text": "Not his best book, but I like it anyway."}, {"review_sentiment": 5.0, "review_text": "Eric Ambler was a prolific and talented suspense writer.  Background to Danger is about an ordinary civilian, a freelance reporter, caught up in pre-war intrigue he does not understand.  It is amazing that Ambler wrote this book before the outcome of the war could be known.  Brilliant."}, {"review_sentiment": 4.0, "review_text": "Background to DangerThe strength and effectiveness of a nation's armed forces depends on the supply of petroleum and other raw materials. Pan Eurasian Petroleum wants to get concessions from the Romanian government, but its plans were exposed by a leftist newspaper and were suspended. PEP will hire an expensive agent to fix this problem. Kenton, an English free-lance journalist, is on a train to Vienna in search of money. A stranger on this train offers him money to carry an envelope across the border from Germany. The author's knowledge of engineering is shown by his comments in Chapter II: \"vertical borers, milling machines and turret lathes\", \"all-geared head, straight bed S.S. and S.C lathe\". When Kenton goes to the hotel to deliver the envelope, he finds the stranger has been stabbed dead. The envelope contained photographs and military secrets.Kenton was followed, and captured by Colonel Robinson's men. Beaten and threatened unless he surrenders the secret papers. Kenton knew that Big Business pulled the strings of Government statesmen. \"Follow the money\" is always the clue to politics. But a near miracle occurs when Andreas appears and frees Kenton. They escape through the woods. During a talk, Andreas explains why Big Business needs somebody like Colonel Robinson: to do their dirty work, and to be expendable if caught (Chapter X). Zaleshoff explains why War Plans are secret, even if prepared for a contingency. Kenton tells them where the secret papers are hidden; but there are problems. Kenton is wanted for the murder, and, masked men stole the envelope with the secret papers. Kenton leaves for Prague. He gets on a tour bus and is befriended by a British salesman, who gives his opinion on western Europeans (Chapter XII).The book describes Kenton's escape across the border into Czechoslovakia. After he arrives by train in Prague, he is escorted away by two plains-clothes policemen. They are Zaleshoff's men. Exciting adventures and events follow. The incriminating secret papers are retrieved, then destroyed. Kenton returns to his post in Berlin by train, but no longer plays poker-dice. Ambler knew how to create a story that holds your interest until the end. You can compare this story to those of Buchan or Oppenheim."}, {"review_sentiment": 4.0, "review_text": "Background to DangerThe strength and effectiveness of a nation's armed forces depends on the supply of petroleum and other raw materials. Pan Eurasian Petroleum wants to get concessions from the Rumanian government, but its plans were exposed by a leftist newspaper and were suspended. PEP will hire an expensive agent to fix this problem. Kenton, an English free-lance journalist, is on a train to Vienna in search of money. A stranger on this train offers him money to carry an envelope across the border from Germany. The author's knowledge of engineering is shown by his comments in Chapter II: \"vertical borers, milling machines and turret lathes\", \"all-geared head, straight bed S.S. and S.C lathe\". When Kenton goes to the hotel to deliver the envelope, he finds the stranger has been stabbed dead. The envelope contained photographs and military secrets.Kenton was followed, and captured by Colonel Robinson's men. Beaten and threatened unless he surrenders the secret papers. Kenton knew that Big Business pulled the strings of Government statesmen. \"Follow the money\" is always the clue to politics. But a near miracle occurs when Andreas appears and frees Kenton. They escape through the woods. During a talk, Andreas explains why Big Business needs somebody like Colonel Robinson: to do their dirty work, and to be expendable if caught (Chapter X). Zaleshoff explains why War Plans are secret, even if prepared for a contingency. Kenton tells them where the secret papers are hidden; but there are problems. Kenton is wanted for the murder, and, masked men stole the envelope with the secret papers. Kenton leaves for Prague. He gets on a tour bus and is befriended by a British salesman, who gives his opinion on western Europeans (Chapter XII).The book describes Kenton's escape across the border into Czechoslovakia. After he arrives by train in Prague, he is escorted away by two plains-clothes policemen. They are Zaleshoff's men. Exciting adventures and events follow. The incriminating secret papers are retrieved, then destroyed. Kenton returns to his post in Berlin by train, but no longer plays poker-dice. Ambler knew how to create a story that holds your interest until the end. You can compare this story to those of Buchan or Oppenheim."}, {"review_sentiment": 4.0, "review_text": "Background to DangerThe strength and effectiveness of a nation's armed forces depends on the supply of petroleum and other raw materials. Pan Eurasian Petroleum wants to get concessions from the Rumanian government, but its plans were exposed by a leftist newspaper and were suspended. PEP will hire an expensive agent to fix this problem. Kenton, an English free-lance journalist, is on a train to Vienna in search of money. A stranger on this train offers him money to carry an envelope across the border from Germany. The author's knowledge of engineering is shown by his comments in Chapter II: \"vertical borers, milling machines and turret lathes\", \"all-geared head, straight bed S.S. and S.C lathe\". When Kenton goes to the hotel to deliver the envelope, he finds the stranger has been stabbed dead. The envelope contained photographs and military secrets.Kenton was followed, and captured by Colonel Robinson's men. Beaten and threatened unless he surrenders the secret papers. Kenton knew that Big Business pulled the strings of Government statesmen. \"Follow the money\" is always the clue to politics. But a near miracle occurs when Andreas appears and frees Kenton. They escape through the woods. During a talk, Andreas explains why Big Business needs somebody like Colonel Robinson: to do their dirty work, and to be expendable if caught (Chapter X). Zaleshoff explains why War Plans are secret, even if prepared for a contingency. Kenton tells them where the secret papers are hidden; but there are problems. Kenton is wanted for the murder, and, masked men stole the envelope with the secret papers. Kenton leaves for Prague. He gets on a tour bus and is befriended by a British salesman, who gives his opinion on western Europeans (Chapter XII).The book describes Kenton's escape across the border into Czechoslovakia. After he arrives by train in Prague, he is escorted away by two plains-clothes policemen. They are Zaleshoff's men. Exciting adventures and events follow. The incriminating secret papers are retrieved, then destroyed. Kenton returns to his post in Berlin by train, but no longer plays poker-dice. Ambler knew how to create a story that holds your interest until the end. You can compare this story to those of Buchan or Oppenheim."}, {"review_sentiment": 4.0, "review_text": "Background to DangerThe strength and effectiveness of a nation's armed forces depends on the supply of petroleum and other raw materials. Pan Eurasian Petroleum wants to get concessions from the Rumanian government, but its plans were exposed by a leftist newspaper and were suspended. PEP will hire an expensive agent to fix this problem. Kenton, an English free-lance journalist, is on a train to Vienna in search of money. A stranger on this train offers him money to carry an envelope across the border from Germany. The author's knowledge of engineering is shown by his comments in Chapter II: \"vertical borers, milling machines and turret lathes\", \"all-geared head, straight bed S.S. and S.C lathe\". When Kenton goes to the hotel to deliver the envelope, he finds the stranger has been stabbed dead. The envelope contained photographs and military secrets.Kenton was followed, and captured by Colonel Robinson's men. Beaten and threatened unless he surrenders the secret papers. Kenton knew that Big Business pulled the strings of Government statesmen. \"Follow the money\" is always the clue to politics. But a near miracle occurs when Andreas appears and frees Kenton. They escape through the woods. During a talk, Andreas explains why Big Business needs somebody like Colonel Robinson: to do their dirty work, and to be expendable if caught (Chapter X). Zaleshoff explains why War Plans are secret, even if prepared for a contingency. Kenton tells them where the secret papers are hidden; but there are problems. Kenton is wanted for the murder, and, masked men stole the envelope with the secret papers. Kenton leaves for Prague. He gets on a tour bus and is befriended by a British salesman, who gives his opinion on western Europeans (Chapter XII).The book describes Kenton's escape across the border into Czechoslovakia. After he arrives by train in Prague, he is escorted away by two plains-clothes policemen. They are Zaleshoff's men. Exciting adventures and events follow. The incriminating secret papers are retrieved, then destroyed. Kenton returns to his post in Berlin by train, but no longer plays poker-dice. Ambler knew how to create a story that holds your interest until the end. You can compare this story to those of Buchan or Oppenheim."}, {"review_sentiment": 4.0, "review_text": "Background to DangerThe strength and effectiveness of a nation's armed forces depends on the supply of petroleum and other raw materials. Pan Eurasian Petroleum wants to get concessions from the Roumanian government, but its plans were exposed by a leftist newspaper and were suspended. PEP will hire an expensive agent to fix this problem. Kenton, an English free-lance journalist, is on a train to Vienna in search of money. A stranger on this train offers him money to carry an envelope across the border from Germany. The author's knowledge of engineering is shown by his comments in Chapter II: \"vertical borers, milling machines and turret lathes\", \"all-geared head, straight bed S.S. and S.C lathe\". When Kenton goes to the hotel to deliver the envelope, he finds the stranger has been stabbed dead. The envelope contained photographs and military secrets.Kenton was followed, and captured by Colonel Robinson's men. Beaten and threatened unless he surrenders the secret papers. Kenton knew that Big Business pulled the strings of Government statesmen. \"Follow the money\" is always the clue to politics. But a near miracle occurs when Andreas appears and frees Kenton. They escape through the woods. During a talk, Andreas explains why Big Business needs somebody like Colonel Robinson: to do their dirty work, and to be expendable if caught (Chapter X). Zaleshoff explains why War Plans are secret, even if prepared for a contingency. Kenton tells them where the secret papers are hidden; but there are problems. Kenton is wanted for the murder, and, masked men stole the envelope with the secret papers. Kenton leaves for Prague. He gets on a tour bus and is befriended by a British salesman, who gives his opinion on western Europeans (Chapter XII).The book describes Kenton's escape across the border into Czechoslovakia. After he arrives by train in Prague, he is escorted away by two plains-clothes policemen. They are Zaleshoff's men. Exciting adventures and events follow. The incriminating secret papers are retrieved, then destroyed. Kenton returns to his post in Berlin by train, but no longer plays poker-dice. Ambler knew how to create a story that holds your interest until the end. You can compare this story to those of Buchan or Oppenheim."}, {"review_sentiment": 5.0, "review_text": "Amazingly timeless novel. Reads like it could've been contemporary. Has all the plot devices that a crime fiction should but does it beautifully."}, {"review_sentiment": 3.0, "review_text": "Eric Ambler knew what he was doing but the story does sometimes get away from him. By that I mean it goes to that place where so many adventure yarns get lost-- where Mr. Big forms a bond of respect with his adversary even though he plans to kill him. I don't think this cliche was original to Ambler but he was writing in the 1930s, before the construct was done to death in the James Bond novels and many others.If you like this kind of thing, this novel is a rollickingly good read. I didn't like it so well.--Llewellyn King"}]}, "authors": ["Eric Ambler"], "isbn": "037572673X", "longitude": 14.4212535, "periods": ["1900s"], "title": "Background to Danger", "word_cloud": "nothing add not best like anyway prolific talented suspense writer ordinary civilian freelance reporter catch intrigue understand amaze write war strength effectiveness nation arm force depend supply petroleum raw material want concession romanian government plan expose leftist newspaper suspend hire expensive agent fix problem journalist train search money stranger train offer money carry envelope border author knowledge engineering show comment vertical borer mill machine turret lathe head straight bed lathe go hotel deliver envelope find stranger stab dead envelope contain photograph military follow captured men threaten surrender secret paper know pull string statesman money always clue politics miracle occur appear free escape wood talk explain need somebody dirty work expendable caught explain secret even prepared contingency tell secret paper hide problem want murder mask men steal envelope secret paper leave get tour bus befriend british salesman give opinion western describe escape border arrives train escort away policeman zaleshoff men excite adventure event follow incriminating secret paper retrieve destroyed return post train longer play create story hold interest end compare story strength effectiveness nation arm force depend supply petroleum raw material want concession romanian government plan expose leftist newspaper suspend hire expensive agent fix problem journalist train search money stranger train offer money carry envelope border author knowledge engineering show comment vertical borer mill machine turret lathe head straight bed lathe go hotel deliver envelope find stranger stab dead envelope contain photograph military follow captured men threaten surrender secret paper know pull string statesman money always clue politics miracle occur appear free escape wood talk explain need somebody dirty work expendable caught explain secret even prepared contingency tell secret paper hide problem want murder mask men steal envelope secret paper leave get tour bus befriend british salesman give opinion western describe escape border arrives train escort away policeman zaleshoff men excite adventure event follow incriminating secret paper retrieve destroyed return post train longer play create story hold interest end compare story strength effectiveness nation arm force depend supply petroleum raw material want concession romanian government plan expose leftist newspaper suspend hire expensive agent fix problem journalist train search money stranger train offer money carry envelope border author knowledge engineering show comment vertical borer mill machine turret lathe head straight bed lathe go hotel deliver envelope find stranger stab dead envelope contain photograph military follow captured men threaten surrender secret paper know pull string statesman money always clue politics miracle occur appear free escape wood talk explain need somebody dirty work expendable caught explain secret even prepared contingency tell secret paper hide problem want murder mask men steal envelope secret paper leave get tour bus befriend british salesman give opinion western describe escape border arrives train escort away policeman zaleshoff men excite adventure event follow incriminating secret paper retrieve destroyed return post train longer play create story hold interest end compare story strength effectiveness nation arm force depend supply petroleum raw material want concession romanian government plan expose leftist newspaper suspend hire expensive agent fix problem journalist train search money stranger train offer money carry envelope border author knowledge engineering show comment vertical borer mill machine turret lathe head straight bed lathe go hotel deliver envelope find stranger stab dead envelope contain photograph military follow captured men threaten surrender secret paper know pull string statesman money always clue politics miracle occur appear free escape wood talk explain need somebody dirty work expendable caught explain secret even prepared contingency tell secret paper hide problem want murder mask men steal envelope secret paper leave get tour bus befriend british salesman give opinion western describe escape border arrives train escort away policeman zaleshoff men excite adventure event follow incriminating secret paper retrieve destroyed return post train longer play create story hold interest end compare story strength effectiveness nation arm force depend supply petroleum raw material want concession romanian government plan expose leftist newspaper suspend hire expensive agent fix problem journalist train search money stranger train offer money carry envelope border author knowledge engineering show comment vertical borer mill machine turret lathe head straight bed lathe go hotel deliver envelope find stranger stab dead envelope contain photograph military follow captured men threaten surrender secret paper know pull string statesman money always clue politics miracle occur appear free escape wood talk explain need somebody dirty work expendable caught explain secret even prepared contingency tell secret paper hide problem want murder mask men steal envelope secret paper leave get tour bus befriend british salesman give opinion western describe escape border arrives train escort away policeman zaleshoff men excite adventure event follow incriminating secret paper retrieve destroyed return post train longer play create story hold interest end compare story amazingly timeless like plot device crime fiction beautifully know story sometimes mean go place many adventure yarn get lose form bond respect adversary even plan kill think cliche original write construct do death novel many kind thing rollicking good like", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Kenton's career as a journalist depended on his facility with languages, his knowledge of European politics, and his quick judgment. Where his judgment sometimes failed him was in his personal life. When he finds himself on a train bound for Austria with insufficient funds after a bad night of gambling, he jumps at the chance to earn a fee to help a refugee smuggle securities across the border. \r\n\r\nHe soon discovers that the documents he holds have a more than monetary value, and that European politics has more twists and turns than the most convoluted newspaper account.\r\n\r\nERIC AMBLER (1909-1998) is widely regarded as the greatest writer of suspense stories in the English language, and as the inventor of the modern political thriller. His first novel was published in 1936 and he rapidly established a reputation as a thriller writer of extraordinary depth and originality. Ambler was described by John Le Carre as 'the source on which we all draw'. He was also an Oscar-nominated Hollywood scriptwriter.", "asin": "037572673X", "rank": "985469", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/512IrGkTegL.jpg", "country": "Czechia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}