{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 85, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Well written and read, Eric Ambler is a first class author!"}, {"review_sentiment": 5.0, "review_text": "Magnificent characters, intrigue, and storytelling. If you love Graham Greene but have read all of his books, Ambler will take you back to \"Greeneland\" by a different route. He's a sort of twin brother, a little less searching and deep, but a distinguished writer."}, {"review_sentiment": 3.0, "review_text": "Written way back in 1940, it would have been so different from what else was written way back then, that it must have shone like a beacon on a dark winter's night. Penguin Publishing (who else) seemed to have bought the rights to republish it as recently as 2009. Eric Ambler should be remembered as the ‘grand father of the thriller’ and must have ‘wooowed’ audiences much like Graham Greene did not long later. Greene turned many of his writings directly into film (and even had some of his scripts published after the movie: ‘The Third Man’ instantly comes to mind. Ambler, on the other hand, also had films made from his works, but these were secondary to his literary efforts).In this edition, we the reader, find that the main character in the story, Graham, has found himself in the midst of some pretty violent people. Indeed, they have been hired to kill him and seem to have him cornered. He doesn’t know where to turn or who to trust because even the people around him aren’t all what they seem. There’s a Greek trader, a female dancer, a German doctor and a very bad man in an old crumpled jacket all on the same ship together. It read a little an Agatha Christie story, but it wasn’t a who-dun-nit. There was a hint of Alistair McClean in the action and, dare I say it, a little of John le Carre in the espionage. But, Ambler was at the forefront of thriller writing with most of his work written way back during WW Two. Well, before these great writers.It made for an exciting read. (SPOILER ALERT) This reader thought that, however, that the villains in the story were too clever and articulate to be believable and that they would have been simply waiting for him on shore at the end of his voyage and collected him after he had cleared customs, rather than colluded with him and given articulated arguments whilst on board the ship. This reader would like to give it three and half stars for it, but with the simplified system used by Amazon, this reader has decided upon a tough but sound choice of three stars. Give him a read if you stumble upon him or on Kindle or even at a second hand bookshop (if you still go to those)."}, {"review_sentiment": 5.0, "review_text": "20 or more words required post in Amazon as Tim Davis & goodreads. I don't appreciate having to write reviews."}, {"review_sentiment": 5.0, "review_text": "I've liked every Eric Ambler novel I've read. This one is no exception. I recommend it highly for anyone who likes international intrigue."}, {"review_sentiment": 5.0, "review_text": "Great yarn.  Nice writing that keeps you riveted.My first with this author, will look for more."}, {"review_sentiment": 5.0, "review_text": "Journey into FearGraham was a highly paid engineer for an armaments manufacturer who often traveled abroad. The Anglo-Turkish Treaty meant a trip for him, and he enjoyed travel. The deal was closed, and Graham will leave the next morning. The company's representative takes him to a local nightclub. Someone watches him, then leaves. When he returns to his room, shots are fired at him. It was an attempt at murder, to sabotage the armaments deal. For reasons of personal security, Graham will return by ship. Colonel Haki shows Graham photographs of suspects, and Graham recognizes the man who was watching him.The ship docks at Athens. Mr Kuvetli asks Graham to show him around Athens. When they return, Graham finds a new passenger, one that he has seen before. Graham had been given a revolver for his protection, but he left it in his suitcase. When he decided to carry it, he found that it was gone. The enemy agents know he is defenseless, and can succeed either by stopping or delaying him. The German agent makes him an offer he can't refuse: die now, or take a 6-week vacation! But the latter choice means he would disappear without a trace, solely dependent on the mercy of his enemies. Firing a bullet into a gasoline tank acts as a deus ex machina. Of course, the good guy wins in the end. The individuals encountered in this book all have their little secrets.Ambler's novels feature an individual struggling against the powers of a state, and surviving. This 1940 story must have been written during the Sitzkrieg of 1939-1940."}, {"review_sentiment": 5.0, "review_text": "As a Graham Greene and Le Carre fan, I will put Eric Ambler in the same Pantheon of espionage thrillers...So delighted that he was prolific and has many other novels that I can follow up this one with"}, {"review_sentiment": 5.0, "review_text": "I read this many years ago and liked it.  Enjoyed it again now.Eric Ambler is a fantastic spy writer in the era of Graham Green and Len Deighton. great pre WW 2 book."}, {"review_sentiment": 5.0, "review_text": "This book is timeless:  written in 1940, read in 2014 – 74 years later – and just as relevant and interesting a mystery as one could read.  There is no sex, no profanity, and characters that are believable.  Only the lack of a cell phone dated the content.  It is a very good read."}]}, "authors": ["Eric Ambler"], "isbn": "0375726721", "longitude": 28.9651646, "periods": ["1900s"], "title": "Journey Into Fear", "word_cloud": "well write first class author magnificent character intrigue storytelling love back different route sort brother little le search deep distinguish writer way back different else write way back beacon dark winter night else seem bought right recently remember grand father thriller audience much long later turn many writing directly film even script publish movie instantly come hand also film make work secondary literary effort edition find main character story find midst pretty violent people indeed hire kill seem corner trust even people seem greek trader female dancer german doctor bad man old crumple jacket ship little story hint action dare say little le espionage forefront thriller writing work write way back great make excite think however villains story clever articulate believable simply wait shore end voyage collect clear custom rather collude give articulated argument whilst board ship half star simplify system use decide tough sound choice star give stumble even second hand bookshop still word require post goo dreads appreciate write review like exception recommend highly anyone like international intrigue write keep first author look highly pay engineer armament manufacturer often travel abroad meant trip enjoy deal close leave next morning company representative take local someone watch leave return room shot fire murder sabotage armament deal reason personal security return ship show photograph suspect recognize man watch ship dock athens ask show return find new passenger see give revolver protection leave suitcase decide carry find go enemy agent know defenseless stop delay german agent make offer die vacation latter choice mean trace solely dependent mercy enemy fire bullet gasoline tank act due ex machine course good guy win end individual encounter little novel feature individual struggle power state survive story write fan put espionage thriller so delighted prolific many novel follow many year ago like fantastic spy writer era great per timeless write year later relevant interesting mystery profanity character believable only lack cell phone date content good", "genres": ["Fiction & Literature", "Mystery & Suspense", "WWII"], "summary": "A thrilling, intense, and masterfully plotted classic suspense tale from one of the founders of the genre.\r\n\r\nReturning to his hotel room after a late-night flirtation with a cabaret dancer at an Istanbul boîte, Graham is surprised by an intruder with a gun. What follows is a nightmare of intrigue for the English armaments engineer as he makes his way home aboard an Italian freighter. Among the passengers are a couple of Nazi assassins intent on preventing his returning to England with plans for a Turkish defense system, the seductive cabaret dancer and her manager husband, and a number of surprising allies.\r\n\r\n“One of the best stories of international intrigue you’ll ever find.” The New Yorker\r\n", "asin": "0375726721", "rank": "255091", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/417v-hnbq2L.jpg", "country": "Turkey", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}