{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 176, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Another terrific, imaginative work by Chris Ware. Highly recommended"}, {"review_sentiment": 5.0, "review_text": "Awesome and shipped fast!"}, {"review_sentiment": 5.0, "review_text": "Got this as a present for a friend, he loved it!"}, {"review_sentiment": 5.0, "review_text": "amazing book, only downside is the comics were somewhat banged up inside the nice box. not sure how that happened."}, {"review_sentiment": 1.0, "review_text": "I have to say that I was intrigued when I got this. I figured it would spark some interest and give me some new ideas as a writer (after all, that is what I had seen it advertised as). Instead, I received a collective box of crap. There is no organization to this at all. It doesn't even seem like art to me. It feels like a bunch of half finished roots thrown into a box and sold, just to make money."}, {"review_sentiment": 5.0, "review_text": "Very creative. I gave this to my friend as a gift and it is jst full of creativity. It is really up to the reader/player to make it come to life. Really great if you're into comics."}, {"review_sentiment": 5.0, "review_text": "You don't read this comic. You build it, like a board game. I cannot say enough good things of Chris Ware. Man is a treasure."}, {"review_sentiment": 5.0, "review_text": "This is not a book; it's a work of art.  It's like the best Christmas present you could ever imagine.  It comes in a big heavy box, you have to unpack it slowly, and its wonders will unfold over an afternoon and then a lifetime."}, {"review_sentiment": 5.0, "review_text": "Every time i open this boxset it confuses me where to start, causing anxiousness and prompting me to put it back on the shelf and away immediately…..just like a bloody character in his books would do!............Thank you Chris Ware"}, {"review_sentiment": 3.0, "review_text": "It's okay, but not great for me.  Hard to rate though as the art work is fun and interesting."}]}, "authors": ["Chris Ware"], "isbn": "0375424334", "longitude": -87.6244212, "periods": ["2000s", "Recent Releases"], "title": "Building Stories", "word_cloud": "terrific imaginative work recommend ship fast present friend love amaze downside comic somewhat bang inside nice box sure happen say intrigue get figure interest give new idea writer see advertise instead receive collective box crap organization even seem art feel bunch half finish root box sell make money very creative give friend gift dist full creativity really come life great comic comic build board game say enough good thing treasure work art best present ever come big heavy box unpack slowly wonder unfold afternoon lifetime time open box set confuses start cause anxiousness prompting put shelf away bloody character okay great rate art work fun interest", "genres": ["Comics & Graphic Novels", "Humour"], "summary": "The New York Times Top 10 Book of the Year\r\n\r\nEverything you need to read the new graphic novel Building Stories: 14 distinctively discrete Books, Booklets, Magazines, Newspapers, and Pamphlets.\r\n \r\nWith the increasing electronic incorporeality of existence, sometimes it’s reassuring—perhaps even necessary—to have something to hold on to. Thus within this colorful keepsake box the purchaser will find a fully-apportioned variety of reading material ready to address virtually any imaginable artistic or poetic taste, from the corrosive sarcasm of youth to the sickening earnestness of maturity—while discovering a protagonist wondering if she’ll ever move from the rented close quarters of lonely young adulthood to the mortgaged expanse of love and marriage. Whether you’re feeling alone by yourself or alone with someone else, this book is sure to sympathize with the crushing sense of life wasted, opportunities missed and creative dreams dashed which afflict the middle- and upper-class literary public (and which can return to them in somewhat damaged form during REM sleep).\r\n \r\nA pictographic listing of all 14 items (260 pages total) appears on the back, with suggestions made as to appropriate places to set down, forget or completely lose any number of its contents within the walls of an average well-appointed home. \r\n\r\nAs seen in the pages of The New Yorker, The New York Times and McSweeney’s Quarterly Concern, Building Stories collects a decade’s worth of work, with dozens of “never-before-published” pages (i.e., those deemed too obtuse, filthy or just plain incoherent to offer to a respectable periodical).", "asin": "0375424334", "rank": "30914", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51ENGMTtTOL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}