{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 7, "rating": 3.7, "reviews": [{"review_sentiment": 1.0, "review_text": "Sorry I read it"}, {"review_sentiment": 4.0, "review_text": "Wanted to purchase a copy I could annotate while I taught this in class. I've only read \"Maggie,\" but really liked it. I imagine Crane's other short stories are just as powerful"}, {"review_sentiment": 5.0, "review_text": "this collection is invaluable. I recommend it to anyone interested in American literature and intellectual thought around the turn of the century."}, {"review_sentiment": 5.0, "review_text": "I bought this for an English class-- I just needed \"Maggie.\" However, after finishing it I was so impressed with Crane's writing ability that I finished the rest of the stories. These are great pieces of realism that are quick reads and still hold up today. Treat yourself to this amazing collection and enjoy the works of one of the greatest American writers of all time!"}, {"review_sentiment": 5.0, "review_text": "A master story teller who has an almost impish pleasure in the way words can portray character. He will find the telling word that comments on its own use. He creates the sense that the narrator is not a snob, not morally superior as Joyce, Dickens, or most the the famous ones will. I love em all dearly, but they can get awfully high tone. Crane is not telling you what to think, or how tragic the ole human condition is. He's telling you a story. And its a good one too."}, {"review_sentiment": 5.0, "review_text": "These stories are tough for the modern reader. They unfold at a slower pace, and the dated vocabulary might be distracting in print. It's the amazing performance of Dick Hill that breathes life into the stories on this recording. He has carefully analyzed each one and  fills the simple, sometimes repetitive dialogue with emotions that the first time reader would probably overlook. His voice is so flexible that you often forget there is only one reader. I have two of these stories on other recorded books, but I believe his interpretation is most true to the author's intentions and certainly the most entertaining.Bravo and thank you Dick Hill!"}, {"review_sentiment": 4.0, "review_text": "Stephen Crane is one of the most underrated turn-of-the-century American writers. This collection isn't a bad introduction to his work, but keep in mind that it doesn't include some of Crane's best short stories, such as \"The Open Boat\", \"The Monster,\" and \"The Blue Hotel.\" I'd recommend this collection to the Crane veteran, as it contains some of his lesser-known but equally important sketches and short stories."}]}, "authors": ["Stephen Crane"], "isbn": "0375756892", "longitude": 0.0, "periods": ["1800s"], "title": "Maggie, a Girl of the Streets and Other New York Writings", "word_cloud": "wanted purchase copy taught class really like imagine short story powerful collection invaluable recommend anyone interested american literature intellectual thought around turn century buy english class need however finish impressed write ability finish rest story great piece realism quick read still hold today amaze collection work greatest american writer time master story teller almost impish pleasure way word portray character find telling word comment create sense narrator snob morally superior famous one love em dearly awfully high tone tell think tragic ole human condition tell story good one story tough modern unfold slower pace date vocabulary distract amazing performance breathe life story record carefully analyze fill simple sometimes repetitive dialogue emotion first time probably voice flexible often forget story record believe interpretation true author intention certainly thank underrated american writer collection bad introduction work mind include best short story recommend collection veteran contain equally important sketch short story", "genres": ["Fiction & Literature"], "summary": "This harrowing tale of a young girl in the slums is a searing portrayal of turn-of-the-century New York, and Stephen Crane's most innovative work. \r\n\r\nPublished in 1893, when the author was just twenty-one, it broke new ground with its vivid characters, its brutal naturalism, and its empathic rendering of the lives of the poor. It remains both powerful, severe, and harshly comic (in Alfred Kazin's words) and a masterpiece of modern American prose.\r\n\r\nThis edition includes Maggie and George's Mother, Crane's other Bowery tales, and the most comprehensive available selection of Crane's New York journalism. All texts in this volume are presented in their definitive versions.", "asin": "B00VHBILQG", "rank": "886981", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41Rtqi3LDgL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}