{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 15.593325, "ratings": {"num_ratings": 53, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "At times I thought this was a book by an unaccomplished author.  THIS book certainly is not of Pulitzer quality.  I think he was trying to write another Out of Africa---and fell far short.  I was tempted to quit the book about half way but I rarely do that with a book.  The ending did wrap up some things in very bizarre ways, but at least it had an ending.  Having lived in Nigeria for two years, i could relate to much of the African aspects, and that is what brought me to the book.  I don't think all the sexual intrigues were vital to the plot.  I would have liked to have seen a couple hundred less pages and concentrate on the complications and paradoxes of African life"}, {"review_sentiment": 4.0, "review_text": "Have worked and lived n Sub-Saharan Africa. Caputo captures the daily life of ordinary Africans very well."}, {"review_sentiment": 3.0, "review_text": "Way too long.  With the 3 romantic relationships, it was often more a romance novel than anything else."}, {"review_sentiment": 5.0, "review_text": "Philip Caputo's book is one of my all-time favorite books. He is an excellent writer, bringing his characters and the scenery to life. I felt like I was in  every scene with the characters.  This is a book I did not want to end it was so good, since I had come to know everyone so well. I may add, this is the first time I have written this about a book."}, {"review_sentiment": 5.0, "review_text": "Eye opening view of how international aid groups are not only businesses first and foremost, but also how the services they provide enable despots to act with more barbarity, since they know the aid groups will always come to the rescue."}, {"review_sentiment": 5.0, "review_text": "5 starAnother Caputo book that opens up a world and takes you through an unknown place and grounds you in difficult and horrific circumstances. You are there with the characters and their raw experiences, it is not Vietnam, it is not Indian Country, it is not even Horn of Africa. It is the Sudan and Kenya. This a story of human conditions and consequences. It is well done."}, {"review_sentiment": 5.0, "review_text": "I love it"}, {"review_sentiment": 4.0, "review_text": "Caputo has a near epic novel. The story speaks to war, love, survival, mysticism and traditional chritianity; and all of the above are major themes in \"Acts of Faith.\" Caputo is able to shift readers' loyalties as the story moves forward. I had trouble setting the book down! Throughout, Caputo drops little witticisms that gave me a smile and forced me to go back and re-read these insights several times. I think he did a top-notch job in characterizing christian thought in average people. It was quite insightful, even damning, to follow Quinette's shameful manipulation of her understanding of the Bible. Quinette's faith in God, or is it her faith in her own desires, nearly made me crack a rib."}, {"review_sentiment": 5.0, "review_text": "Accurate depiction of the situation in that region of the world.  Believable and sympathetic characters."}, {"review_sentiment": 4.0, "review_text": "Really expanded my knowledge of modern Africa. Well developed characters, if very sad in certain ways. An excellent read."}]}, "authors": ["Philip Caputo"], "isbn": "0375725970", "longitude": 32.53565, "periods": ["1900s", "Recent Releases"], "title": "Acts of Faith", "word_cloud": "time think unaccomplished author certainly quality think try fell far short tempt quit half way rarely end wrap thing bizarre way least end have live year much aspect bring think sexual intrigue vital plot see couple le page concentrate complication paradox african life have work lived n capture daily life ordinary well long romantic relationship often romance anything else favorite excellent writer bring character scenery life felt scene character want end good come know everyone well first time write open view international aid group business first foremost also service provide enable despot act barbarity know aid group always come rescue star another open world take unknown place ground difficult horrific circumstance character raw experience indian even story human condition consequence well do love maputo story speak war love survival mysticism traditional christianity major theme able shift reader loyalties story move forward trouble set drop little witticism give smile force back insight several time think job characterize christian think average people quite insightful even damn follow shameful manipulation understand desire nearly make crack rib depiction situation region world sympathetic character really expand knowledge modern develop character sad certain way excellent", "genres": ["Fiction & Literature", "Politics"], "summary": "Philip Caputo’s tragic and epically ambitious new novel is set in Sudan, where war is a permanent condition. Into this desolate theater come aid workers, missionaries, and mercenaries of conscience whose courage and idealism sometimes coexist with treacherous moral blindness. There’s the entrepreneurial American pilot who goes from flying food and medicine to smuggling arms, the Kenyan aid worker who can’t help seeing the tawdry underside of his enterprise, and the evangelical Christian who comes to Sudan to redeem slaves and falls in love with a charismatic rebel commander. \r\n\r\nAs their fates intersect and our understanding of their characters deepens, it becomes apparent that Acts of Faith is one of those rare novels that combine high moral seriousness with irresistible narrative wizardry.   \r\n\r\n\"Nothing is omitted in this ambitious novel depicting the turbulent lives of several aid workers at the height of the Sudanese civil war. Caputo, a Pulitzer Prize-winning reporter and the author of a Vietnam memoir, includes more characters, plot lines, and big ideas than a single mind can track, but he writes so authoritatively that it doesn't matter. In the course of nearly seven hundred pages, he encompasses military offensives, the slave trade, arms-running operations, passionate romances, religious conversions, childhood memories, and rampant corruption, in a portrait of a place where \"God and the Devil are one and the same.\" Caputo lays the groundwork of the novel carefully, introducing his disparate cast of characters; then, as the various plot lines come together, the book picks up speed. Caputo may have set out to write an epic parable about the dangers of uncritical belief, but he ended up with, quite simply, a great story.\"  The New Yorker\r\n", "asin": "0375725970", "rank": "364845", "city": "Khartoum", "image": "https://images-na.ssl-images-amazon.com/images/I/514zuFMzemL.jpg", "country": "Sudan", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}