{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 225, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "Something interesting on every page.  So many notable characters they should have an index to keep track of them.  Some sentences are completely incomprehensible, if so, I just go on to the next one.  This translator has 3X bigger vocabulary than I do--keep a tablet by your side to look stuff up!"}, {"review_sentiment": 5.0, "review_text": "Awesome book, no problems with delivery."}, {"review_sentiment": 5.0, "review_text": "Beautifully written prose filled with profound observations about the human mind and memory, among other things."}, {"review_sentiment": 5.0, "review_text": "I finished the original C. K. Scott Moncrieff translation, bought book 7 of this series and decided to reread all the books of this newer fixed translation. The writing is far more natural and enjoyable..."}, {"review_sentiment": 5.0, "review_text": "Hard to give opinion."}, {"review_sentiment": 4.0, "review_text": "I bought this for a college level course and thoroughly enjoyed it, however, the edition that I received by First Rate Publishers didn't include a Table of Contents, any page numbers, or any of the publishing information. With that being said, I found using this text for the purpose of school challenging as I couldn't include citations, however, if you are buying this just for pure enjoyment I fully recommend this version!"}, {"review_sentiment": 3.0, "review_text": "well... It is a very hard book to read. I would not buy it if it is not because of my college requirement. It is not a traditional novel. My best way to get through it is by listening to the audiobook. However, I have to say, it is quite vivid and I might eventually finish all seven volume just because."}, {"review_sentiment": 3.0, "review_text": "The text actually has typographical errors.  It seems that spell check erroneously converted certain words: e.g., Francoise to franchise."}, {"review_sentiment": 5.0, "review_text": "My favorite author and book. This is my first read of this new revision."}, {"review_sentiment": 1.0, "review_text": "Bought this for a book club I'm in.  Unless you have a high tolerance for pain, I wouldn't read this.  OMG, I really don't understand why this was even published..lol."}]}, "authors": ["Marcel Proust"], "isbn": "0375751548", "longitude": 0.0, "periods": ["1800s"], "title": "In Search of Lost Time: Swann's Way, Vol. 1", "word_cloud": "something interesting page so many notable character index track sentence completely incomprehensible go next translator bigger vocabulary keep tablet side look stuff problem delivery beautifully write prose fill profound observation human mind memory thing finish original translation buy series decide reread newer fix translation writing far natural enjoyable opinion buy college level course thoroughly enjoy however edition receive include table content page number publish information say find use text purpose school challenge citation however buy pure enjoyment fully recommend version well hard college requirement traditional best way listening audio book however say quite vivid eventually volume text actually typographical error seem spell erroneously convert certain word franchise favorite author first new revision club unless high tolerance pain really even", "genres": ["Fiction & Literature"], "summary": "In Swann's Way, the themes of Proust's masterpiece are introduced, and the narrator's childhood in Paris and Combray is recalled, most memorably in the evocation of the famous maternal good-night kiss. The recollection of the narrato'.s love for Swann's daughter Gilberte leads to an account of Swann's passion for Odette and the rise of the nouveaux riches Verdurins.", "asin": "0375751548", "rank": "45795", "city": "", "image": "https://images-na.ssl-images-amazon.com/images/I/51OW%2BG6eCiL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}