{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 6.9349969, "ratings": {"num_ratings": 250, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "We read this for my book club and I'm so glad we did.Although there were times you weren't sure why a character was being described, it soon became apparent as they were brought into the next chapter with the protagonists. Anil was such a complex and profound character that I wasn't fond of the chapters where she was missing, but I also see that the story needed to be told from several perspectives. I do wish it had ended with Anil though. I wanted to know what she would do and where she would go,This is a book that needs to be discussed. There's a lot going on and it's not always clear what or why things are happening.It would be a great novel for a college history class. Anybody studying Sri Lanka?"}, {"review_sentiment": 5.0, "review_text": "Fascinating story.  Hard to put down."}, {"review_sentiment": 5.0, "review_text": "Another beautifully written book by this author.i never wanted it to end."}, {"review_sentiment": 5.0, "review_text": "A wonderful story by a gifted writer, very poignant, engrossing.  Sorry to have finished it!"}, {"review_sentiment": 4.0, "review_text": "Ok"}, {"review_sentiment": 5.0, "review_text": "Even on reflection, this is a 5. Not because we have a full picture of Anil (her former relationship with a woman named Leaf in New Mexico, indeed, the whole American Southwest portion of her life doesn't connect to anything in Sri Lanka; and there is little about her former stay in England)--we don't-- but because we come to live Sri Lanka in all its horrors, in all its varied spaces, and in all its life types. If I put the book down, I was drawn to return to this atmosphere time and again. Sure, there is little compelling about trying to identify a brutally murdered body, the resolution of which occurs too fast. But it's what happens along the way, and reflections on Sri Lankan culture and philosophical heritage from Sarath, Anil's partner forensic archaeologist, that makes a difference. As for the rest of Anil's character development, one cannot leave her sexuality aside, and, in a Bhuddist culture that doesn't worry about nakedness, Ondaatje handles this very well, though not in the same detail as he does with field surgery."}, {"review_sentiment": 5.0, "review_text": "One of my favorite authors.  He could write copy for cereal boxes and it would be readable."}, {"review_sentiment": 3.0, "review_text": "I read this book for my \"metaphysical detective novel\" university course. It's good, but hard to follow if you aren't used to the non-Linear style of writing."}, {"review_sentiment": 3.0, "review_text": "Nonlinear, not plot driven. Good for emersion into Sri Lankan culture. Why do I need nine more words? OK book"}, {"review_sentiment": 3.0, "review_text": "I mostly love the way Ondaatje writes, but the plot in this book was all over the place. It was never really clear why Anil was doing what she was doing or why it mattered."}]}, "authors": ["Michael Ondaatje"], "isbn": "0375724370", "longitude": 79.853845, "periods": ["1900s"], "title": "Anil's Ghost: A Novel", "word_cloud": "club glad time sure character describe soon become apparent bring next chapter protagonist complex profound character fond chapter miss also see story need tell several perspective wish end want know need discuss lot go always clear thing great college history class study fascinate story put beautifully write never want end wonderful story gift writer poignant engross finish ok even reflection not full picture former relationship woman name indeed whole american portion life connect anything little former stay come live horror vary space life type put draw atmosphere time sure little compel try brutally murder body resolution occur fast happen along way reflection culture philosophical heritage partner forensic archaeologist make difference rest character development leave sexuality aside culture worry nakedness handle well detail field surgery favorite author copy cereal box metaphysical detective university course good hard follow use style write plot driven good immersion culture need word ok mostly love way write plot place never really clear matter", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "With his first novel since the internationally acclaimed The English Patient, Booker Prize—winning author Michael Ondaatje gives us a work displaying all the richness of imagery and language and the piercing emotional truth that we have come to know as the hallmarks of his writing.\r\n\r\nAnil’s Ghost transports us to Sri Lanka, a country steeped in centuries of tradition, now forced into the late twentieth century by the ravages of civil war. Into this maelstrom steps Anil Tissera, a young woman born in Sri Lanka, educated in England and America, who returns to her homeland as a forensic anthropologist sent by an international human rights group to discover the source of the organized campaigns of murder engulfing the island. \r\n\r\nWhat follows is a story about love, about family, about identity, about the unknown enemy, about the quest to unlock the hidden past–a story propelled by a riveting mystery. Unfolding against the deeply evocative background of Sri Lanka’s landscape and ancient civilization, Anil’s Ghost is a literary spellbinder–Michael Ondaatje’s most powerful novel yet.", "asin": "0375724370", "rank": "219666", "city": "Colombo", "image": "https://images-na.ssl-images-amazon.com/images/I/51IbHpLf-KL.jpg", "country": "Sri Lanka", "story_arc": ["Tragedy", "Things only get worse"]}