{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 225, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "He's a brilliant writer - all the time - but this....!"}, {"review_sentiment": 3.0, "review_text": "Somehow I gleaned this guy wrote for the New Yorker.  Maybe they could offer him some remedial lessons on sentence structure.  I am sure the guy loves France, maybe he could write this in french instead and it would be more fluid.  In my life there are few books I have purchased and not finished; this is one."}, {"review_sentiment": 5.0, "review_text": "When this book was first published I fell in love - again - with Paris and I bought it for everyone I could think of who did as well.  It was and still is one of his most satisfying and engaging titles.. And even after the years have gone by, I would still rank it as one of the best, sweetest and perfectly written books about Paris from the eye of its beholder.  In the years since it was written I realized, sadly, that I would not live Paris and follow Gopnik's stay - but this is a book I buy over and over at book sales to give to another, who may not ever live in Paris, but dreams they will.Adam Gopnik has been one of my favorite writers for years.  His presence in the New Yorker is joy and I wonder often about Olivia's Havanese."}, {"review_sentiment": 5.0, "review_text": "I've read this book tree times and will probably read it again. If you are fond of France, the French and Paris, it's a perfect antidote to the daily news. Adam Gopnik is a good writer and more important a good family man."}, {"review_sentiment": 5.0, "review_text": "This is such a charming book.  This is not a tourist guide or nonstop praise for Paris, but just the ins and outs (written by a talented writer) of daily life with wife and child in an enigmatic city.  Some things are pretty and some are not, but he really pulls you in, and I found myself chuckling out loud more than once.  The characters are easy to identify with."}, {"review_sentiment": 5.0, "review_text": "I felt like I got to live for a while in Paris and I loved every minute.Whenever I want to go back, I listen to or read this book again, a pleasure.  Adam Gopnik is a fine writer who brings warmth and humor to his stories."}, {"review_sentiment": 5.0, "review_text": "While this is a great observational book about life in Paris, I loved it because of his big observations about life. It is at once beautiful and sad in its acknowledgement of cycles and the nature of human relationships. I absolutely loved it!"}, {"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 5.0, "review_text": "In 1995, Adam Gopnik, a writer for the New Yorker magazine, along with his wife and infant son moved from NYC to Paris.This book is a collection of his award-winning “Paris Journals” that he filed for the magazine. But unlike other books that are an assemblage of essays, this book is not choppy or undisciplined. It’s an intelligent, heartfelt look at the most beautiful city in the world at the turn of the twenty-first century. (Gopnik was there for Y2K but returned to America shortly thereafter.)Some critics have complained that Gopnik’s essays are outdated, but I think they transcend time. He has captured the very heart of Paris culture and attitude. It’s well worth reading whether you’re planning to visit Paris or not.I loved this book. 5 stars"}, {"review_sentiment": 5.0, "review_text": "It was delicious.  I've fallen in love with Adam Gopnik. It's ok. I told my husband."}]}, "authors": ["Adam Gopnik"], "isbn": "0375758232", "longitude": 2.3514992, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Paris to the Moon", "word_cloud": "brilliant writer time somehow glean guy write remedial lesson sentence structure sure guy love maybe french instead life purchase finish first publish fell buy everyone well still satisfy engaging even year go still best sweetest perfectly write eye beholder year write realize sadly follow stay buy sale give ever dream favorite writer year presence joy wonder often tree time probably fond french perfect antidote daily news good writer important good family man charm tourist guide nonstop praise ins out write talented writer daily life wife child enigmatic city thing pretty really pull find chuckle loud character easy felt get live love want back listen pleasure fine writer bring warmth humor story great observational life love big observation life beautiful sad acknowledgment cycle nature human relationship absolutely love great writer magazine wife infant son move collection file magazine assemblage essay choppy undisciplined intelligent heartfelt beautiful city world turn century return shortly thereafter critic complain essay outdated think transcend time capture heart culture attitude well read plan visit love star delicious fall ok tell husband", "genres": ["Memoir", "Travel Writing"], "summary": "Paris. The name alone conjures images of chestnut-lined boulevards, sidewalk cafés, breathtaking façades around every corner--in short, an exquisite romanticism that has captured the American imagination for as long as there have been Americans. \r\n\r\nIn 1995, Adam Gopnik, his wife, and their infant son left the familiar comforts and hassles of New York City for the urbane glamour of the City of Light. Gopnik is a longtime New Yorker writer, and the magazine has sent its writers to Paris for decades--but his was above all a personal pilgrimage to the place that had for so long been the undisputed capital of everything cultural and beautiful. It was also the opportunity to raise a child who would know what it was to romp in the Luxembourg Gardens, to enjoy a croque monsieur in a Left Bank café--a child (and perhaps a father, too) who would have a grasp of that Parisian sense of style we Americans find so elusive. \r\n\r\nSo, in the grand tradition of the American abroad, Gopnik walked the paths of the Tuileries, enjoyed philosophical discussions at his local bistro, wrote as violet twilight fell on the arrondissements. Of course, as readers of Gopnik's beloved and award-winning \"Paris Journals\" in The New Yorker know, there was also the matter of raising a child and carrying on with day-to-day, not-so-fabled life. Evenings with French intellectuals preceded middle-of-the-night baby feedings; afternoons were filled with trips to the Musée d'Orsay and pinball games; weekday leftovers were eaten while three-star chefs debated a \"culinary crisis.\"\r\n\r\nAs Gopnik describes in this funny and tender book, the dual processes of navigating a foreign city and becoming a parent are not completely dissimilar journeys--both hold new routines, new languages, a new set of rules by which everyday life is lived. With singular wit and insight, Gopnik weaves the magical with the mundane in a wholly delightful, often hilarious look at what it was to be an American family man in Paris at the end of the twentieth century. \"We went to Paris for a sentimental reeducation-I did anyway-even though the sentiments we were instructed in were not the ones we were expecting to learn, which I believe is why they call it an education.\"", "asin": "0375758232", "rank": "61865", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/511my9CjNgL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}