{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 35.7006177, "ratings": {"num_ratings": 43, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "Boring book"}, {"review_sentiment": 4.0, "review_text": "compared to this authors other book(s) - Persepolis,  This is a little sad, for the subject"}, {"review_sentiment": 5.0, "review_text": "Exquisite. To be savored."}, {"review_sentiment": 2.0, "review_text": "It is hard to separate my distaste for the characters in the book from my feelings about how Satrapi told/illustrated their story.  I have no sympathy whatsoever for the main character, Nassar Ali Khan -- regardless of how great a musician he (allegedly) once was -- and had no interest in his life.  Based on that, I should have given the book 1 star -- but I gave the book an additional star in recognition that Nassar Ali Khan was an actual person, this story is (supposedly) what actually transpired the last week of his life, and it is admirable that Satrapi had a desire to understand and communicate to the world at large an unusual story about one of her ancestral relatives.That said, I agree with other 1 and 2 star reviews that this book falls far short of her seminal work in Persepolis 1 & 2.  I am also disgusted that she would be in sympathy with Khan and (apparently) not see that it was malignant, petulant, unloving narcissism that fueled his every action."}, {"review_sentiment": 5.0, "review_text": "Nasser Ali selfishly decides to die, but before he does so, he reflects back on his life and we are given a look into his thoughts during the eight days before he passes. This book was fantastically dark and depressing, yet also very poignant and revealing. I didn't know whether to like Nasser Ali or not - but he felt so human. He plays favorites with his children, argues with his wife, can't get over the girl who got away, resents his brother for being their mother's favorite. What shocked me most was the fact that music was such a large part of his life and when he couldn't find a replacement tar he literally decided to die and die he did! Satrapi packed a lot of emotion into just 84 pages, primarily doing so through her illustrations. I have a lot of respect for her as an author and I'd be hard pressed to say whether I enjoyed this or her Persepolis stories more."}, {"review_sentiment": 4.0, "review_text": "The author skillfully compresses flashbacks, flashforwards and so MUCH storyline into a very small space. Even if you think you hate graphic novels you should try at least one Satrapi--if not this one then one of her other gems."}, {"review_sentiment": 3.0, "review_text": "Some aspects of the story telling were intriguing, once you realise the flash forwards and backwards are flagged only by subtle changes of costume. The musician in question who through the book wiils himself to death, has never engaged with his wife or children in any meaningful way, lusting only after the unattainable. I felt sadness for his family, who I feel the author treated, quite harshly, rather than with good humour."}, {"review_sentiment": 5.0, "review_text": "I started reading Marjane Satrapi when Persepolis got really popular, and I've been a fan ever since. In Chicken with Plums, she tells the story of her great uncle, a man who suffered deeply from depression. It's incredibly sad, but very well written and illustrated.For more reviews, check out [...]"}, {"review_sentiment": 5.0, "review_text": "A short graphic novel with an intense and melancholy story but will make you giggle with the authors humor in black and white."}, {"review_sentiment": 3.0, "review_text": "I must admit to disappointment; I was not expecting a graphic novel (I'm old: translate story in cartoon style).  I did love the movie that morphed from this story and since this book was not expensive I am quite content to pass it on to others who may enjoy it more.  Either I was unobservant or this was not described as a graphic novel.  If the latter, this needs to be remedied.  I was expecting some really exquisite description of the characters themselves and a graphic novel simply cannot fill this bill."}]}, "authors": ["Marjane Satrapi"], "isbn": "0375714758", "longitude": 51.401375, "periods": ["1900s"], "title": "Chicken with Plums", "word_cloud": "bore compare author little sad subject hard separate distaste character feeling story sympathy whatsoever main character regardless great musician allegedly interest life base give star give additional star recognition actual person story supposedly actually transpire last week life admirable desire understand communicate world large unusual story ancestral say agree star review fall far short seminal work also disgust apparently see malignant petulant unloving narcissism fuel action selfishly decide die reflect life give look thought day pass fantastically dark depress yet also poignant reveal know felt human play favorites child argue wife girl get away resent brother mother favorite shock fact music large part life replacement tar literally decide die die pack lot emotion page primarily illustration lot respect author hard press say enjoy story author skillfully compress flashback flash forwards small space even think hate graphic novel try least gem aspect story tell intriguing realist flash forward backwards flag subtle change costume musician question wail death never engage wife child meaningful way lust unattainable felt sadness family feel author treat quite harshly rather good humor start read get really popular fan ever tell story great uncle man suffer deeply depression incredibly sad well write review check short graphic intense melancholy story make giggle author humor black white disappointment expect graphic old translate story cartoon style love movie morph story expensive quite content pas others unobservant describe graphic latter need remedied expect really exquisite description character graphic simply fill bill", "genres": ["Biography", "Comics & Graphic Novels", "Music"], "summary": "“Chicken with Plums is a feast you’ll devour.”\r\n—Newsweek\r\n\r\nAcclaimed graphic artist Marjane Satrapi brings what has become her signature humor and insight, her keen eye and ear, to the heartrending story of a celebrated Iranian musician who gives up his life for music and love.\r\n\r\nWhen Nasser Ali Khan, the author’s great-uncle, discovers that his beloved instrument is irreparably damaged, he takes to his bed, renouncing the world and all its pleasures. Over the course of the week that follows, we are treated to vivid scenes of his encounters with family and friends, flashbacks to his childhood, and flash-forwards to his children’s future. And as the pieces of his story fall into place, we begin to understand the breadth of his decision to let go of life.\r\n\r\nThe poignant story of one man, it is also stunningly universal—a luminous tale of life and death, and the courage and passion both require of us.", "asin": "0375714758", "rank": "223338", "city": "Tehran", "image": "https://images-na.ssl-images-amazon.com/images/I/51BQ-HmeKcL.jpg", "country": "Iran", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}