{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 284, "rating": 3.5, "reviews": [{"review_sentiment": 3.0, "review_text": "I’m a big fan of Ishiguro, but this is easily one of his weaker novels.On the heels of The Unconsoled, this is in many ways a similar novel but apparently intended to be tighter and more grounded.Perhaps if I had read this one before the Unconsoled I would have preferred it, but I doubt it. To me the endless sprawl is one of the very things that made the Unconsoled great. This novel takes that away and is otherwise much the same."}, {"review_sentiment": 5.0, "review_text": "I like the style of writing because it deals with sincere feeling pervaded by a depth of personal loss. At the same time the main characters display positive thoughts about those close to them"}, {"review_sentiment": 5.0, "review_text": "There's an obsession that starts and a descent into madness and all the tight strings of reality fray at the edges until one is not sure of what's real or not and simply pursues the next thing regardless of value.It's never been captured like this before.Read this book."}, {"review_sentiment": 5.0, "review_text": "Georgeous writing, deeply moving story. Literature at its best."}, {"review_sentiment": 4.0, "review_text": "I love the way Kazuo Ishiguro writes -- confidently, and with great insight. His characters and plot lines are fascinating. However, I wasn't crazy about this one for a number of reasons.*  The narrator is a rather unlikable person. I suspect that he has Aspergers, or some other emotional/mental problem, because he ignores so many social cues, and engages in rather ridiculous pursuits (such as getting obsessed with solving a kidnapping case that is about 10 years old, in Shanghai, no less, which is undergoing a civil war and invasion from Japan). But then, maybe that was Ishiguro's point?*  The expats are totally clueless about conditions in China. They la-di-dah around with their cocktail parties and soirees as Shanghai is literally being destroyed beneath their eyes. But again, I wondered (after finishing the book) whether this was one of Ishiguro's points in the book?*  The narrator is equally clueless about women.*  I found the ending of the book to be so unbelievable, and so stretched to create a \"book-ends\" conclusion, that I became impatient and skimmed it.*  The descriptions of colonial life in Shanghai between the world wars are exquisite, especially as seen from a child's point of view."}, {"review_sentiment": 5.0, "review_text": "Just always love this author's books"}, {"review_sentiment": 3.0, "review_text": "Not very satisfying. The world a child sees doesn't get any better when fully explained 20 years later."}, {"review_sentiment": 4.0, "review_text": "The end of the book turned into a kind of magical realism which confused my book club.  They rated the novel \"odd\"  but loved the discussion - trying to figure out what the book was about - different kind of detective story,"}, {"review_sentiment": 5.0, "review_text": "He has never let me down; definitely one of my favourite writers."}, {"review_sentiment": 2.0, "review_text": "Out of respect for the author's reputation, I read this book to the end.....which was more than I achieved for last book of Ishiguro's that I read.  Ultimately I found WWWO quite disappointing.  To be honest, it takes many pages to tell a relatively simple story.  However, the chief issue i have is that the story revolves almost wholly around the character of Christopher Banks - and he's a deeply uninteresting, passive and ultimately deluded character who its quite hard to relate to or like.  The artifice that such an emotionally detached and deluded person could have become a \"famous detective\" is totally unconvincing in my eyes.  This is born out in his life's quest - to solve the mysterious disappearance of his parents in Shanghai some 20 years ago.  His elaborately conceived resolution is so illogical its silly - and it seems (plot spoiler coming) its absolutely wrong in every facet.  And in the end I couldn't even feel sorry for Christopher."}]}, "authors": ["Kazuo Ishiguro"], "isbn": "0375724400", "longitude": -0.12574, "periods": ["1900s"], "title": "When We Were Orphans", "word_cloud": "big fan easily weaker heel many way similar apparently intended tighter unconsoled doubt sprawl thing make unconsoled great take away otherwise much like style write deal sincere feel pervade depth personal loss time main character display positive thought close obsession start descent madness tight string reality fray edge sure real simply pursue next thing regardless never capture gorgeous write deeply move story best love way write confidently great insight character plot line fascinate however crazy number reason narrator rather unlikable person suspect asperger problem ignore many social cue engage rather ridiculous pursuit get obsess solve kidnap case year old le undergoing civil war invasion maybe point expat totally clueless condition cocktail party soirees literally destroy beneath eye wonder finish point narrator equally clueless woman find end unbelievable stretched create conclusion become impatient skim description colonial life world war exquisite especially see child point view just always love author not satisfy world child see get better fully explain year later end turn kind magical realism confuse club rat odd loved discussion try figure different kind detective story never let definitely favorite writer respect author reputation end achieve last ultimately find quite disappoint take many page tell relatively simple story however chief issue story revolve almost wholly character deeply uninteresting passive ultimately deluded character quite hard relate artifice emotionally detach deluded person famous detective totally unconvincing eye born life quest solve mysterious disappearance parent year elaborately conceive resolution illogical silly seem plot spoiler come absolutely wrong facet end even sorry", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "From the Booker Prize-winning, bestselling author of Remains of the Day comes this stunning work of soaring imagination.\r\n\r\nBorn in early-twentieth-century Shanghai, Banks was orphaned at the age of nine after the separate disappearances of his parents. Now, more than twenty years later, he is a celebrated figure in London society; yet the investigative expertise that has garnered him fame has done little to illuminate the circumstances of his parents' alleged kidnappings. Banks travels to the seething, labyrinthine city of his memory in hopes of solving the mystery of his own, painful past, only to find that war is ravaging Shanghai beyond recognition-and that his own recollections are proving as difficult to trust as the people around him.\r\n\r\nMasterful, suspenseful and psychologically acute, When We Were Orphans offers a profound meditation on the shifting quality of memory, and the possibility of avenging one’s past.", "asin": "0375724400", "rank": "25252", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51uhioEzehL.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}