{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 107, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "Wide ranging general history of a great city from the earliest times to the 1970s. Great on art and architecture. Easy reading. Robert Hughes always lets you know what he thinks."}, {"review_sentiment": 4.0, "review_text": "Gre read. A little repetitive."}, {"review_sentiment": 5.0, "review_text": "A terrific book and a great seller!"}, {"review_sentiment": 5.0, "review_text": "Robert Hughes'  brilliant revelation  of Imperial Rome as a complex world chiefly remembered for its art, the only thing that comes out of ancient Rome as an exemplar of beauty and truth, changed so much of what I thought of Rome from Ancient to Modern life and practice.A great study, the first critic to explode absurd, conventional ideas about culture and not tolerate the evaluations of the unintelligent."}, {"review_sentiment": 5.0, "review_text": "An excellent commentary and history to guide visitors to Rome, art lovers, and history buffs."}, {"review_sentiment": 5.0, "review_text": "What a writer!  Great stories with no punches pulled on art (or social) criticism."}, {"review_sentiment": 5.0, "review_text": "Fantastic book! Engaging and a great resource if you are planning on visiting Rome."}, {"review_sentiment": 5.0, "review_text": "Long book, I thought too long at first, but I enjoyed it and learned a lot. I now want to go to Rome and revisit lots of places I have seen and decide how I think of them now."}, {"review_sentiment": 2.0, "review_text": "I went to Rome, I plan going back, but this time with this book in my bagage! The statue of Aurelius? Hmmm..."}, {"review_sentiment": 5.0, "review_text": "the best book i've ever read."}]}, "authors": ["Robert Hughes"], "isbn": "0375711686", "longitude": 12.4829321, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "1500s", "500-1400s", "0-500s", "Pre Common Era"], "title": "Rome: A Cultural, Visual, and Personal History", "word_cloud": "range general great city earliest time art architecture reading always let know think little repetitive terrific great seller brilliant revelation complex world chiefly remember art thing come ancient exemplar beauty truth change much think life great study first critic explode absurd conventional idea culture tolerate evaluation unintelligent excellent commentary guide visitor art lover buff writer story punch pull art social criticism fantastic great resource planning visit think long first enjoy learn lot want revisit lot place see decide think go plan go back time baggage statue best ever", "genres": ["Memoir", "Art & Architecture", "History", "Ancient Rome"], "summary": "From Robert Hughes, one of the greatest art and cultural critics of our time, comes a sprawling, comprehensive, and deeply personal history of Rome—as a city, as an empire, and as an origin of Western art and civilization.\r\n \r\nStarting on a personal note, Hughes takes us to the Rome he first encountered as a hungry twenty-one-year-old fresh from Australia in 1959. From there, he goes back more than two thousand years to the city’s foundation, one mired in mythologies and superstitions that would inform Rome’s development for centuries. He explores in rich detail the formation of empire, the rise of early Christianity, the Crusades, the Renaissance, and takes us up to the present, through the rise and fall of Mussolini’s fascism. Equal parts idolizing, blasphemous, outraged, and awestruck, Rome is a portrait of the Eternal City as only Robert Hughes could paint it.", "asin": "0375711686", "rank": "112875", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51X32RygzVL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}