{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 206, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Good solid narrative.  Gripping.  Held my interest."}, {"review_sentiment": 4.0, "review_text": "Nothing to add."}, {"review_sentiment": 5.0, "review_text": "...of the spy genre (although his protagonists aren't spies), Eric Ambler is at the top of his form with Dimitrios.  The stories are dated, but then so is history.  the description of an army in retreat and a city in flames has haunted my memory for decades since I first read the book.  If you enjoy this story, don't miss Judgement on Deltchev and The Schirmer Inheritance by the same author."}, {"review_sentiment": 4.0, "review_text": "Very well written mystery from a past genre.  The story is really tight and characters are interesting.  I really enjoyed this book (and I rarely read mysteries anymore).  I am going to watch the movie, which I have heard is true to the book.  The movie version is titled \"The Mask of Dimitrious\"."}, {"review_sentiment": 5.0, "review_text": "The Classic of espionage thrillers."}, {"review_sentiment": 5.0, "review_text": "I loved this book when I read it 20-odd years ago, and still love it on my Kindle today. I think I recall that Alan Furst has a character read this book, and perhaps Ian Fleming had James Bond read it, as well. In any case, it is a legendary 1930s spy story."}, {"review_sentiment": 5.0, "review_text": "Ambler seems almost contemporary with his set ups of situations."}, {"review_sentiment": 5.0, "review_text": "A classic, and for good reason. I have read it ten times at least. I cannot read the first chapter without finishing it. Beautifully written, taut and suspenseful. A must read for anyone who likes spy stories, and mysteries about Europe between the wars."}, {"review_sentiment": 5.0, "review_text": "Most impressed by author's prose, rich and smooth like the naughtiest of chocolate ice creams (without sprinkles, cherries, cream or nuts). I wish I could articulate better what I felt/admired. The dialogue of Mr. Peters is superb, a masterpiece created via simple language. Closest I can recall to having felt the same way about an author's prose is DH Lawrence's Women in Love, though I don't recall whether Lawrence's vocabulary was as simple as Ambler's.It took me a while to be drawn in to the story. Googled some of the story's Asian events and they were legit, so for that reason too it was an interesting book. By the end I was very interested to learn the ending and was not disappointed."}, {"review_sentiment": 5.0, "review_text": "It's  a  classic  and  I wasn't  disappointed ."}]}, "authors": ["Eric Ambler"], "isbn": "0375726713", "longitude": 2.3514992, "periods": ["1900s"], "title": "A Coffin for Dimitrios", "word_cloud": "good solid narrative grip hold interest nothing add spy genre protagonist spy top form story date history description army retreat city flame haunt memory decade first enjoy story miss author very well write mystery genre story really tight character interest really enjoy rarely mysteries anymore go watch movie hear true movie version title classic espionage thriller love year ago still today think recall character perhaps well case legendary spy story ambler seem almost contemporary set ups situation classic good reason ten time least first chapter finish write taut suspenseful anyone spy story mystery war most impressed author prose rich like naughtiest chocolate ice cream sprinkle cherry cream nut wish better dialogue superb masterpiece create simple language recall felt way author prose recall vocabulary simple take draw story story asian event legit reason interesting end interest learn end disappointed classic disappoint", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "The classic story of an ordinary man seemingly out of his depth, this is Ambler's most widely acclaimed novel, \"one of the masterpieces of the genre\" The New York Times \r\n\r\nA chance encounter with a Turkish colonel leads Charles Latimer, the author of a handful of successful mysteries, into a world of sinister political and criminal maneuvers. At first merely curious to reconstruct the career of the notorious Dimitrios, whose body has been identified in an Istanbul morgue, Latimer soon finds himself caught up in a shadowy web of assassination, espionage, drugs, and treachery that spans the Balkans.\r\n\r\n\"Our greatest thriller writer.\" Graham Greene", "asin": "0375726713", "rank": "107478", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/510GM6S9WXL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}