{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 274, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "I doubt My Name is Red needs another recommendation but potential readers might need some guidance in understanding why critics consider the book a contemporary classic.Though the story is ostensibly a mystery, the real subject of the book is early modern Istanbul-its government, culture and people.  These are so ingeniously depicted that I'm surprised the book hasn't become celebrated as a work which lets a reader glimpse into a culture foreign to most contemporary Westerners.The theme of Turkey's divide between East and West, as exemplified in the work of figurative manuscripts, is best read for oneself rather than summarized.  Other themes such as the nature of art itself, the relationship between art and Islam and the relationships between master and pupil are strewn throughout the work.  All the while Pamuk tells such a compelling story that the narrative could have been published without this philosophical depth.There is a lot more that could be said about this novel: its serious themes right along playful asides that keep the novel from being too ponderous, the surprisingly realistic characters in a work of historical fiction (although the artists sometimes seem superhuman-Pamuk is an artist himself after all), the honest depiction of both the glories and depravities of Ottoman culture but, again, its best to discover these on your own than have someone provide spoilers of Pamuk's masterpiece.In brief, if you are looking for literary fiction which also depicts a largely unknown culture (except to Turks) you could hardly find a better choice.  If you are looking for an interesting mystery, you will find it but hopefully you will also take in this fascinating depiction of Ottoman culture."}, {"review_sentiment": 5.0, "review_text": "This book gives the feel of Turkey viewing Italy in 1590 just as Romola by George Eliot gives the feel of Italy viewing Turkey in the same decade.The two books also lay bare many of the religious struggles in the respective regions, including orthodoxy, blasphemy, heresy, and (more in Romola) true faith.In Romola the activity is the gathering of ancient texts. Ironically in Europe, Aristotle had been newly recovered because the Muslims had kept it safe and Averoes brought it back to Europe. There are texts of Platonists being gathered, like Ficino and Cabalists. The priest, Savanarola is a character and so is Machiavelli.In My Name is Red, the activity is the drawing and coloring of book illustrations. This mirrors the activity of text-gathering in Romola.I think someone could write some good thesis papers comparing these two books."}, {"review_sentiment": 4.0, "review_text": "I liked the way the story is told through not only people but also anthropomorphized concepts. I also like that it reveals a cultural history that I knew poorly.At times the style is overly verbose and gets lost in ornamentation, but I guess that is a stylistic way to mirror the subject matter."}, {"review_sentiment": 3.0, "review_text": "Well-written but complex. Interesting account of Turkish medieval society, including Islamic religious dominance. Of particular interest to readers who appreciate the visual arts as the book explores the contrasting values of Eastern VS Western (European) art."}, {"review_sentiment": 2.0, "review_text": "I am aware the book is good, but the print was too small for me to read."}, {"review_sentiment": 5.0, "review_text": "one of the best books i've ever read"}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 4.0, "review_text": "Very well. arrive on time, very patient and helpful. i need it , I have owned many knives over the years, but this is the first real\" bread product that I have ever owned. I really like the construction and design. It works exactly as advertised. I have used it on bread and tomatoes and it did the job perfectly well. I would recommend this product to anyone who needs a quality bread product.\""}, {"review_sentiment": 5.0, "review_text": "Not a fast or easy read but more than worth the effort.  Different in almost every way from Western novels."}, {"review_sentiment": 2.0, "review_text": "I could t help but feeling he is trying to be Salman Rushdi and once you have read Rushi or Eco, Pumak just won't do.."}]}, "authors": ["Orhan Pamuk"], "isbn": "0375706852", "longitude": 28.9651646, "periods": ["1600s"], "title": "My Name Is Red", "word_cloud": "doubt need recommendation potential reader guidance understand critic consider contemporary story ostensibly mystery real subject early modern government culture people ingeniously depict surprise become celebrated work let glimpse culture foreign contemporary theme exemplify work figurative manuscript best rather summarize other theme nature art relationship art relationship master pupil strewn work tell compelling story narrative philosophical lot say serious theme right along playful aside keep ponderous surprisingly realistic character work historical fiction artist sometimes seem artist honest depiction glory depravities culture best discover someone provide spoiler brief look literary fiction also depict largely unknown culture hardly better choice look interesting mystery find hopefully also take fascinate depiction culture give feel view give view also lay bare many religious struggle respective region include orthodoxy blasphemy heresy true activity gather ancient text newly recover keep safe bring text platonist gather cymbalists priest character activity draw color illustration mirror activity think someone good thesis paper compare like way story tell people also anthropomorphize concept also reveals cultural history know time style overly verbose get lose ornamentation guess stylistic way mirror subject matter complex account medieval society include religious dominance particular interest reader appreciate visual art explore contrast value western european art aware good print small best ever excellent very well arrive time patient helpful need own many knife year first real bread product ever own really construction design work exactly advertise use bread tomato job perfectly well product anyone need quality bread product not fast easy worth effort almost way western novel feel try", "genres": ["Fiction & Literature", "Mystery & Suspense", "Art & Architecture", "Historical Fiction"], "summary": "At once a fiendishly devious mystery, a beguiling love story, and a brilliant symposium on the power of art, My Name Is Red is a transporting tale set amid the splendor and religious intrigue of sixteenth-century Istanbul, from one of the most prominent contemporary Turkish writers. \r\n\r\nThe Sultan has commissioned a cadre of the most acclaimed artists in the land to create a great book celebrating the glories of his realm. Their task: to illuminate the work in the European style. But because figurative art can be deemed an affront to Islam, this commission is a dangerous proposition indeed. The ruling elite therefore mustn’t know the full scope or nature of the project, and panic erupts when one of the chosen miniaturists disappears. The only clue to the mystery–or crime? –lies in the half-finished illuminations themselves. Part fantasy and part philosophical puzzle, My Name is Red is a kaleidoscopic journey to the intersection of art, religion, love, sex and power. ", "asin": "0375706852", "rank": "45260", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51iRsOuPT%2BL.jpg", "country": "Turkey", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}