{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 306, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "I've wanted to read THE MOVIEGOER for many years, and now I finally have. My take on it may be slightly different than some. I see it as a kind of anti-war book. Its protagonist, Binx Bolling, is several years removed from his service in the Korean war, but he seems to be suffering from a kind of PTSD, which he refers to as the \"malaise,\" or the \"everydayness.\" Whatever he calls it, it has left him with a feeling of hopelessness, of \"why bother.\" A moderately successful stockbroker with his uncle's New Orleans firm, Binx has no particular ambitions beyond his present circumstances. He lives his bachelor life in a bare, unadorned apartment. He engages in meaningless serial dalliances with his secretaries. He has no close friends. The last time he can remember life being important was when he \"lay bleeding in a ditch\" in Korea. He takes refuge in movies.Walker Percy's novel also gives us a glimpse into New Orleans life in the late fifties. He shows us the inbred families of the crescent city, their attitudes toward the black servants they employ, as well as the strange, stratified carnival atmosphere of Mardi Gras. Indeed, everyone seems to expect Binx to marry his cousin, Kate, who is a story in herself, with her wildly fluctuating bipolar behavior. Binx does feel a surprisingly tender affinity toward his colorful cousin, and also shows immense tolerance and even affection for his several half-siblings, especially one who is crippled and sickly. In these particular relationships, he comes alive as a real and sympathetic character, in sharp contrast to his shallow affairs with his Marcia, Linda and Sharon secretaries.The book starts off rather slowly, I thought, but the second half grabbed me and kept me turning pages - the parts about Kate and her family, as well as his crippled half-brother, Lonnie. I understand now why THE MOVIEGOER, first published in 1962, has long been considered a minor classic of Southern Literature. Percy is a unique sort of writer, and a damn good one. Binx Bolling is a character I will not soon forget. Very highly recommended.- Tim Bazzett, author of the memoir, BOOKLOVER"}, {"review_sentiment": 5.0, "review_text": "This is a great novel in my opinion; it begins as a bit disjointed jaunt from movie palace to move palace with no discernible direction.  Not being a guy who likes to put a book down once it's begun; I soldiered on with great reward.  The lives and story come together nicely exploring many of our own deep seated philosophical and psychological conundrums."}, {"review_sentiment": 4.0, "review_text": "Excellent book. Quite a bit of humor actually, and speaks eloquently about the despair and exestential angst of modern life, with people searching in all the wrong places and distracting themselves to death."}, {"review_sentiment": 1.0, "review_text": "I had to stop reading it, as the story was going nowhere. Badly written too."}, {"review_sentiment": 5.0, "review_text": "Good Book!"}, {"review_sentiment": 5.0, "review_text": "Binx Bollinger is a Korean War Vet, stockbroker, skirt chaser and avid movie goer. The Moviegoer considers the question, is there more to life than this? While viewing his life through the lens of movies and actors, Binx considers his current life situation while thinking existentially about \"the quest\", something, what he cannot define, that has a greater meaning than the daily malaise.Two situations in particular are striking for Binx. Over Mardi Gras, with a relative who is near death, Binx participates in the Mass celebration. He watches as, wheelchair bound, Lonnie partakes of Communion. Perhaps as a consequence of his condition, Lonnie is much more contemplative than Binx, his own \"quest\" leading him to absolution and a religious life. While not fully convinced, Binx does consider his own life as a pilgrimage, but one mired in merde.Binx also falls in love with his Aunt's step-daughter. Kate suffers from psychological conditions and is considered suicidal. Probably she sees stability in Binx, and desires what she is lacking. Seeing a future with Kate, and a desire to go to medical school, he marries her and moves to North Carolina. He leaves his search for the \"quest\" open, but refuses to discuss the matter anymore as he no longer considers himself qualified."}, {"review_sentiment": 4.0, "review_text": "Great writing. Unusual characters. I really enjoyed this book but am not recommending it to my book club. I think the structure of the novel would not please them."}, {"review_sentiment": 2.0, "review_text": "I guess that it went over my head.  I used to live in New Orleans and liked all the references to the area but I just could not really get into the story.I never really figured out what was going on.  Maybe the writing is a little dated."}, {"review_sentiment": 5.0, "review_text": "Delve into the southern writings of bayous ,mystery and family relationships. Written by a master in New Orleans."}, {"review_sentiment": 3.0, "review_text": "I can’t believe I’m a lifelong avid reader who, at 75, had never before read Walker Percy’s National Book Award winning 1961 novel The Movie-goer.  At any rate, I’m grateful that I finally decided to delay reading the latest new thing and instead contend with Percy’s uneven and troubling debut work and determine what I think about it.I can’t concur with those who have given this book iconic status, but if you can get through the confusion and frequent overwriting in Part One, Part Two, which begins at page 64 and is probably the strongest section of the book, solidifies, assumes commanding tone, and provides genuine rewards.  Here’s the opening to the ninth chapter of Part Two:“For some time now the impression has been growing upon me that everyone is dead.“It happens when I speak to people.  In the middle of a sentence it will come over me: yes, beyond a doubt this is death.  There is little to do but groan and make an excuse and slip away as quickly as one can.  At such times it seems that the conversation is spoken by automatons who have no choice in what they say.  I hear myself or someone else saying things like: “In my opinion, the Russian people are great people, but __” or “Yes, what you say about the hypocrisy of the North is unquestionably true.  However —“ and I think to myself: this is death.  Lately it is all I can do to carry on such everyday conversations, because my cheek has developed a tendency to twitch of its own accord.  Wednesday as I stood speaking to Eddie Lowell, I felt my eye closing in a broad wink.”I hear something of Henry Miller there, and when gastrointestinal eruptions occur shortly later in the same chapter, I hear something of John Kennedy Toole.  But again, this is a debut novel and some influences are to be expected.  (Percy was instrumental in getting Toole ’s A Confederacy of Dunces published after Toole’s death.)This book probably has more appeal for readers who like their authors steeped in Kierkegaard and Catholicism.  I pretty much don’t.  And more than half a century after this book was published, alienation and antiheroes have worn  pretty thin."}]}, "authors": ["Walker Percy"], "isbn": "0375701966", "longitude": -90.0701156, "periods": ["1900s"], "title": "The Moviegoer", "word_cloud": "want many year finally take slightly different see kind protagonist several year remove service war seem suffer kind refers malaise everydayness call leave feel hopelessness moderately successful stockbroker uncle firm particular ambition present circumstance live bachelor life bare unadorned apartment engage meaningless serial dalliance secretary close friends last time life important lay bleed ditch take refuge also give life late fifty show inbred family crescent city attitude black servant employ well strange stratify carnival atmosphere indeed everyone seem expect cousin story wildly fluctuate bipolar behavior feel surprisingly tender affinity colorful cousin also show immense tolerance even affection several especially cripple sickly particular relationship come alive real sympathetic character sharp contrast shallow affair start rather slowly think second half grab kept turn page part family well cripple understand first publish long consider minor classic southern unique sort writer damn good character soon very highly author memoir great opinion begin bit disjointed jaunt movie palace move palace discernible direction not guy like put begin soldier great reward life story come together nicely explore many deep seated philosophical psychological conundrum excellent bit humor actually speak eloquently despair existential angst modern life people search wrong place distract death stop read story go nowhere badly write good book stockbroker skirt chaser avid movie goer considers question life view life lens movie actor considers current life situation think existentially quest something define greater mean daily situation particular strike relative death participate celebration watch wheelchair partakes perhaps condition much contemplative quest lead absolution religious life fully convinced life pilgrimage mired also fall love suffers psychological condition consider suicidal probably see stability desire lack see future desire go medical school marries move leave search quest open refuse discuss matter anymore longer considers qualify write unusual character really enjoy recommend club think structure guess go head use live like reference area really never really figure go maybe write little dated southern writing bayou mystery family relationship master believe lifelong avid never win rate grateful finally decide delay read latest new thing instead uneven trouble debut work determine think give iconic status confusion frequent overwrite begin page probably strongest section solidifies assume command tone provide genuine reward here open ninth chapter time impression grow everyone happen speak people middle sentence yes doubt death little groan make excuse slip away quickly time seem conversation speak automaton choice say hear someone else say thing opinion russian people great people say hypocrisy unquestionably true however think death lately carry everyday conversation cheek develop tendency twitch accord stand speak felt eye closing broad hear something gastrointestinal eruption occur shortly later chapter hear something debut influence expect instrumental get publish death probably appeal reader author steep pretty much half century publish alienation antihero wear pretty thin", "genres": ["Fiction & Literature"], "summary": "Winner of the 1961 National Book Award\r\n\r\nThe dazzling novel that established Walker Percy as one of the major voices in Southern literature is now available for the first time in Vintage paperback.\r\n\r\nThe Moviegoer is Binx Bolling, a young New Orleans stockbroker who surveys the world with the detached gaze of a Bourbon Street dandy even as he yearns for a spiritual redemption he cannot bring himself to believe in. On the eve of his thirtieth birthday, he occupies himself dallying with his secretaries and going to movies, which provide him with the \"treasurable moments\" absent from his real life. But one fateful Mardi Gras, Binx embarks on a hare-brained quest that outrages his family, endangers his fragile cousin Kate, and sends him reeling through the chaos of New Orleans' French Quarter. \r\n\r\nWry and wrenching, rich in irony and romance, The Moviegoer is a genuine American classic.", "asin": "0375701966", "rank": "37093", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/41j6uAo3iML.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}