{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2028, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book. I learned much about the East; also, the beginning of man’s search of God."}, {"review_sentiment": 5.0, "review_text": "I titled this a must read and that really sums up my opinion of Hawaii and all of Mr. Mitchner’s books.  The amount or historical information and the imaginary dialogue characters is mind blowing.  In truth, this is not the first time that I have read this book and I’m sure I check in again someday before my time is done."}, {"review_sentiment": 5.0, "review_text": "Different than the movie. Not necessarily better, but if you’ve seen the movie you’ll like the book since it’s not too similar."}, {"review_sentiment": 5.0, "review_text": "This is by far my favorite Michener book. It pulls together the story of how Hawaii came to be - weaving tales of the native population and their trip from Bora Bora to their new home in Hawaii, the New England missionaries and ship captains who acquired the land, and built the the economy and the Chinese and then the Japanese who were brought in to work the fields. It is difficult to weave the strands of different stories into a coherent whole but it works here. I first read this book many years ago before a first trip to Hawaii. I enjoyed it just as much this time."}, {"review_sentiment": 5.0, "review_text": "I think this is my third time around with this book.  The stories within the story are fascinating to anyone who is interested in history."}, {"review_sentiment": 5.0, "review_text": "One of Michener's grand, epic novels.  It starts with the formation of the islands and from there goes on for ages and generations.  I have read this three times.  When it first was published, then in the late eighties when I lived on Maui, and again now.  A captivating read."}, {"review_sentiment": 5.0, "review_text": "Great book, one of his best."}, {"review_sentiment": 5.0, "review_text": "A powerful historical novel with deep insight into humanity's hunt for meaning.Not an easy read, but we'll crafted and compelling."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 4.0, "review_text": "I re-read \"The Source\" following a recent trip to the Holy land. I've always enjoyed Michener's historical fiction and I thoroughly enjoyed this re-visit to the history of Judaism. While some what dated due to it publication date of the mid sixties, it still resonated with me.It makes me want to do additional research into current literature on Jewish/Palestinian relations and the influence of Orthodox Jews on the state of Israel."}]}, "authors": ["James A. Michener"], "isbn": "0375760377", "longitude": 0.0, "periods": ["1800s", "1900s", "500-1400s"], "title": "Hawaii", "word_cloud": "learn much also begin man search title really opinion amount historical information imaginary dialogue character mind blow truth first time sure check someday time do movie not necessarily better see movie similar far favorite pull together story come weave tale native population trip new home missionaries ship captain acquire land build economy chinese japanese bring work field difficult weave strand different story coherent whole work first many year ago first trip enjoy much time think third time story story fascinate anyone interested history grand epic novel start formation island go age generation time first publish late eighty live captivating best powerful historical deep insight humanity hunt easy craft compelling excellent follow recent trip land always enjoy historical fiction thoroughly enjoyed history date due publication date mid sixty still resonate make want additional research current literature relation influence state", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Pulitzer Prize–winning author James A. Michener brings Hawaii’s epic history vividly to life in a classic saga that has captivated readers since its initial publication in 1959. \r\n\r\nAs the volcanic Hawaiian Islands sprout from the ocean floor, the land remains untouched for centuries—until, little more than a thousand years ago, Polynesian seafarers make the perilous journey across the Pacific, flourishing in this tropical paradise according to their ancient traditions. Then, in the early nineteenth century, American missionaries arrive, bringing with them a new creed and a new way of life. \r\n\r\nBased on exhaustive research and told in Michener’s immersive prose, Hawaii is the story of disparate peoples struggling to keep their identity, live in harmony, and, ultimately, join together.\r\n\r\n“Wonderful . . . [a] mammoth epic of the islands.” The Baltimore Sun", "asin": "0375760377", "rank": "8544", "city": "", "image": "https://images-na.ssl-images-amazon.com/images/I/517%2B6QNBqQL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}