{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 187, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "I haven't even read the book yet, don't even know where to find it actually."}, {"review_sentiment": 5.0, "review_text": "Sad and intense. Marvelous."}, {"review_sentiment": 4.0, "review_text": "Breathtaking sentences scattered throughout this achingly sad story of love and not love. Four stars given for this and the ability to take us along in short, sometimes disorienting sections."}, {"review_sentiment": 5.0, "review_text": "An amazing, existential conflation of a life, freed from the previously unaware oppression of the living, Duras' book speaks loudly to those beyond youth.  Truly phenomenal as she moves in and out of many points of view to create a thoroughly fleshed out life, articulating truth in a uniquely universal way."}, {"review_sentiment": 4.0, "review_text": "This is a well made, very sharp product at a great price point. I'd definitely recommend it and would buy other products from the seller. Another nice touch is that the seller contacted me to ask if I was satisfied. I am. low price and high quality. SINDY very love it , best service, patient. very fast, receive it next day,"}, {"review_sentiment": 3.0, "review_text": "I read this book after traveling in Cambodia and seeing the actual house where the Chinese lover lived.  I enjoyed being there, and seeing photos of the couple and families more than the book!"}, {"review_sentiment": 5.0, "review_text": "Only one of two books I own.  As a library employee, I don't need to buy or keep books -- but when I bought this book in 1985 it is only one of two I have ever kept.  I was dazzled by author's style of writing and wanted to keep this with me, always."}, {"review_sentiment": 5.0, "review_text": "This is an eloquently written narrative about a young French girl's taboo affair with an older, wealthy Chinese man.  The affair takes place in Saigon during a time of political turmoil, which adds a lot of emotion and imagery to the story line."}, {"review_sentiment": 3.0, "review_text": "I think I need to see the movie to appreciate this book. I picked it up because I was traveling in Cambodia at the time and was in the area the film was made."}, {"review_sentiment": 5.0, "review_text": "Beautifully written, in a spartan way.  A far cry from my preferred reading, but I very much enjoyed this all the same."}]}, "authors": ["Marguerite Duras"], "isbn": "0375700528", "longitude": 0.0, "periods": ["1900s"], "title": "The Lover", "word_cloud": "even yet even know find actually intense breathtaking sentence scatter achingly sad story star give ability short sometimes disorient section amazing existential conflation life free previously unaware oppression live speaks loudly youth phenomenal move many point view create thoroughly flesh life articulate truth uniquely universal way well make sharp product great price point definitely recommend product seller nice touch seller contact ask satisfy low price high quality love best service patient fast receive next day travel see actual house chinese live enjoy see photo couple family only library employee need buy ever keep dazzle author style write want keep always eloquently write narrative young french girl taboo affair older wealthy man affair take place time political turmoil add lot emotion imagery story line think need movie appreciate pick travel time area film make beautifully write spartan way far cry preferred reading much enjoy", "genres": ["Fiction & Literature", "Romance", "Historical Fiction"], "summary": "An international best-seller with more than one million copies in print and a winner of France’s Prix Goncourt, The Lover has been acclaimed by critics all over the world since its first publication in 1984.\r\n\r\nSet in the prewar Indochina of Marguerite Duras’s childhood, this is the haunting tale of a tumultuous affair between an adolescent French girl and her Chinese lover. In spare yet luminous prose, Duras evokes life on the margins of Saigon in the waning days of France’s colonial empire, and its representation in the passionate relationship between two unforgettable outcasts.\r\n\r\n\"Powerful, authentic, completely successful . . . perfect.\" The New York Times ", "asin": "0375700528", "rank": "26919", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51-PYYMQ-pL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}