{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 35.6828378, "ratings": {"num_ratings": 56, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "A Lolita for people who wanted Lolita to get REVENGE >:)"}, {"review_sentiment": 3.0, "review_text": "Having read other books, I was disappointed not to like this one.  I know it is just personal taste, because it has been enjoyed by many"}, {"review_sentiment": 4.0, "review_text": "I tend to divide Tanizaki's work into two groups: the subtle and the explicit (or even shocking). _Some Prefer Nettles_ and _The Makioka Sisters_ belong to the first group; the second is illustrated by works such as his early stories, _Quicksand_, _The Key_, and _Naomi_ (1924). I understand several of Tanizaki's early novels are not available in English, but _Seven Japanese Tales_ contains the short story that made Tanizaki famous, \"The Tattooer\" (1910). That story already included the trope of the femme-fatale, which is developed in _Naomi_. This is a novel about the unmasking of a person, a fascinating topic when we consider that etymologically the word \"person\" means \"mask\" (a theme developed exquisitely and devastatingly in Ingmar Bergman's film _Persona_).Naomi is fifteen years old when Joji Kawai, our twenty-eight-year-old anti-hero, meets her at a café and becomes obsessed with her. At first he simply wants to educate her, to form her, so the reader may perceive him as a Pygmalion figure. The situation, however, deteriorates quickly, and layer by layer Naomi is divested of her disguise and revealed as a ruthless manipulator. Strictly speaking, there is no plot in _Naomi_. The novel traces a development in perception, and the reader sees Naomi transformed before Joji Kawai's eyes.Also translated as _A Fool's Love_, _Naomi_ is precisely the story of a fool in love. Some might argue that love makes fools of us all, and this is true to a certain extent, but Joji Kawai is abnormally willing to let others play with his feelings. Due to the nature of the obsession depicted, _Naomi_ has been compared to Nabokov's _Lolita_. There is even a passage that recalls Humbert Humbert's savoring of Lolita's name. \"Naomi, Naomi,\" the protagonist/narrator says, \"I don’t know how many times the name was repeated between us. It was the appetizer that accompanied our sake. We relished its smooth sound, licked it with our saliva and raised it to our lips, as though it were a delicacy even tastier than beef” (198-199). I would also compare the novel to Leopold von Sacher-Masoch's famous _Venus in Furs_ (1870), which gave rise to the term \"masochism.\" Joji Kawai is simply a toy in Naomi's hands, and it is impossible not to feel sorry for him.As in several other works, Tanizaki shows in this novel a deep understanding of the psychology of abusive relationships. Joji is caught in a trap, and he walked into it by himself. He says: \"Gradually, I forgot my innocent notion of ‘training’ [Naomi]: I was the one being dragged along, and by the time I realized what was happening, there was nothing I could do about it” (49). Naomi is his parasite, and even though he is not benefiting from the relationship at all, he is given just enough to ensure that he will remained hooked. \"Here I have to acknowledge how base males are,\" he says. \"Whatever transpired in the daytime, I always gave in to her at night. Or, rather than 'gave in,' I should say that the animal in me was subdued by her” (163). Women do not deceive men, Joji affirms, but rather men \"rejoice in being deceived\" (51). Once he has been reduced to an animal, he will stay with Naomi as long as she fulfills his most basic needs. This, in short, is not _Love Story_.My reading of _Naomi_ comes after a slight disappointment with _Some Prefer Nettles_ (please see my review). I must say that while I realize that Tanizaki opened many doors in Japanese literature with his exploration of dark desires, I prefer his more subtle stories. I continue to regard _The Makioka Sisters_ as his masterpiece. It explores family dynamics in the context of historical changes, and at the same time paints a stunning psychological portrait of each of the main characters. The main achievement of _Naomi_ consists in its masterful unveiling of the true nature of a person, the progressive revelation of what lies beneath the surface. _The Makioka Sisters_ is more panoramic; _Naomi_ is focused. For good or ill, when we look for masterpieces we tend to go for scope. As an enthusiast of the novella, I want to think that I am immune to the charms of extensive, heavy tomes, but when it comes to Tanizaki, while I enjoy his shorter works, it is still his longest book that I favor.If you're looking for another Tanizaki story about an unhealthy bond, I recommend \"A Portrait of Shunkin,\" which was also adapted into an animated short in the beautiful _Animated Classics of Japanese Literature_ series.My next Tanizaki will probably be _A Cat, a Man, and Two Women_.Thanks for reading, and enjoy the book!"}, {"review_sentiment": 4.0, "review_text": "i am a fan of tanizaki. ımho he is the most successful representative of the \"democratic\" era of japan. true to his style and subject matter this book deals with the confusion of the time, the unachievable westernness, the clash between the times and the culture and the people and the relationships...portrayed very honestly and dramatically. the man being the putty in the hands of so-called submissive girl/woman. makioka sisters is still my favorite but i quite loved this one as well"}, {"review_sentiment": 2.0, "review_text": "Give Tanizaki credit for a portrait of Japan and the teetering attractions to the West of some of its population.  This is the 1920s, after all, yet there is no hint in this account of what Japan would become in the 1930s leading into World War II. That's all distant.  Instead we have a fast read of two unlikable characters with a lot of crying and yelling.  Naomi herself has not one whit of sensuality about her, yet winds up sleeping around in a franzy, no doubt the primary reason the authorities had the newspaper that was serializing the story stop publication. From a contemporary perspective, we understand the lack of sexual explicitness, even in a presumably passionate (on one side, anyway) relationship (we get the same in Anna Karenina after all), but the re-coupling is mechanical and unsatisfying."}, {"review_sentiment": 1.0, "review_text": "Very easy to read and follow along with the story line but I would NOT recommend.I found Naomi, a girl of 15 who grows up to be a domineering and insolent \"wife,\" to be hypocritical in all her doings in trying to conform to the \"Western\" way of life and her perceptions of being a proper \"lady,\" when her actions of unfaithfulness and rude societal behaviors clearly goes against all morals. Not to mention, it is claimed Naomi holds a certain point of intelligence but I am left with the impression of naivety and childish whims that annoys me.Then there's Joji, her 28 year old husband, who I thoroughly detested throughout the book. His \"love\" for Naomi allows her to humiliate and emasculate him. He is blinded by his passion and even when confronted with the reality on multiple accounts that Naomi is no better than any other human, he is still beguiled by her \"charms\" and will do anything to provide her with the luxurious life she seeks.Overall, I found this book a great disappointment and will not be reading it twice."}, {"review_sentiment": 1.0, "review_text": "Do you enjoy traveling inside the mind of a desperate, hopeless, and insecure man who will stop at nothing to court a little girl? If you answered yes to this question, you have better get your hands on this novel. This man simply infuriated me throughout the entire book. His lack of self-respect drives me insane."}, {"review_sentiment": 5.0, "review_text": "Loved it!"}, {"review_sentiment": 5.0, "review_text": "I loved this book. Upon first reading the book I had already decided I was going to love Naomi but as I kept reading I didn't like her, then I didn't like Joji then I felt bad for everyone involved and finally I was just neutral with everyone in the book. It makes you think about everything a person goes through to make another person happy. In my opinion no one in this book was a winner."}, {"review_sentiment": 4.0, "review_text": "I am posting under my husbands' amazon account. I read this for an Asian History class. The story was very intriguing and really opened your knowledge up about how the Japanese saw modernity at this time, and how complex the dynamics of tradition and westernization were and are!! The main couple praised western looks, fashion, dance, shows, anti-male dominant relationships, living together, etc... but in the end these things hurt their relationship and their is an interesting dynamic between praising western society ideals and then realizing that some of these are disruptive to their relationship and traditional ways of living that might be more favorable. Naomi is taken from her more traditional upbringing with her mother and raised to become educated, dress western, and do western things to become the ideal woman for her husband as his \"trophy wife\" but becomes bratty and the main male character becomes more and more sheepish due to his poor self-confidence and lack of control. I recommend it to students or readers age 18 and above due to some sexual content."}]}, "authors": ["Junichiro Tanizaki"], "isbn": "0375724745", "longitude": 139.7589667, "periods": ["1900s"], "title": "Naomi", "word_cloud": "people want have disappoint know personal taste enjoy many tend divide work group subtle explicit even shock first group second illustrate work early story understand several early novel available english japanese contains short story make famous story already include trope develop unmasking person fascinate topic etymologically word person mean mask theme develop exquisitely devastatingly film fifteen year old meet cafe becomes obsess first simply want educate form situation however deteriorate quickly layer layer divest disguise reveal ruthless manipulator speaking plot trace development perception see transform translate precisely story fool make fool true certain extent abnormally willing let others play feeling nature obsession depict compare even passage recall savor name say know many time name repeat appetizer accompanied sake relish sound lick saliva raise lip delicacy even tastier beef also famous give rise term masochism simply toy hand impossible feel sorry several work show deep understanding psychology abusive relationship catch trap walk say gradually forget innocent notion training drag time realize happen nothing even benefit relationship give enough remain hooked here acknowledge base male say transpired daytime always give night rather say animal subdue deceive men joni affirms rather men rejoice deceive once reduce animal stay long fulfill basic need short reading come slight disappointment please review realize open many door japanese literature exploration dark desire prefer subtle story continue regard masterpiece explore family dynamic context historical change time paint stun psychological portrait main character main achievement consist masterful unveil true nature person progressive revelation lie surface panoramic focus good ill masterpiece tend scope enthusiast novella want think immune charm extensive heavy tome come enjoy shorter work still longest look story unhealthy bond recommend also adapt animated short beautiful classic japanese next probably reading enjoy fan tanizaki successful representative democratic era japan true style subject matter deal confusion time achievable we sternness clash time culture people relationships portray honestly dramatically man putty hand submissive makioka sister still favorite quite love well credit portrait teeter attraction population yet hint account leading distant instead fast unlikable character lot cry yell whit sensuality yet wind sleep frenzy doubt primary reason authority newspaper serialize story stop publication contemporary perspective understand lack sexual explicitness even presumably side anyway relationship mechanical unsatisfying very easy story line find girl grow domineer insolent wife hypocritical doings try conform western way life perception lady action unfaithfulness rude societal behavior clearly go moral not mention claim hold certain point intelligence leave impression naivety childish whim annoy year old husband thoroughly detest love allow humiliate emasculate blind passion even confront reality multiple account better human still beguile charm anything provide luxurious life find great disappointment reading twice travel mind desperate hopeless insecure man nothing court little girl answer question better hand man simply infuriate entire lack drive insane love love first reading already decide go keep read like felt bad everyone involve finally neutral everyone make think everything person go person happy opinion winner post husband amazon account asian class story intrigue really open japanese saw modernity time complex dynamic tradition westernization main couple praise western look fashion dance show dominant relationship live together etc end thing hurt relationship interesting dynamic praise western society ideal realize disruptive relationship traditional way live take traditional upbringing mother raise become educated dress western western thing become ideal woman husband trophy wife become bratty main male character become sheepish due poor lack control recommend student reader age due sexual content", "genres": ["Fiction & Literature", "Humour", "Erotica"], "summary": "Junichiro Tanizaki’s Naomi is both a hilarious story of one man’s obsession and a brilliant reckoning of a nation’s cultural confusion.\r\n \r\nWhen twenty-eight-year-old Joji first lays eyes upon the teenage waitress Naomi, he is instantly smitten by her exotic, almost Western appearance. Determined to transform her into the perfect wife and to whisk her away from the seamy underbelly of post-World War I Tokyo, Joji adopts and ultimately marries Naomi, paying for English and music lessons that promise to mold her into his ideal companion. \r\n\r\nBut as she grows older, Joji discovers that Naomi is far from the naïve girl of his fantasies. And, in Tanizaki’s masterpiece of lurid obsession, passion quickly descends into comically helpless masochism.", "asin": "0375724745", "rank": "171309", "city": "Tokyo", "image": "https://images-na.ssl-images-amazon.com/images/I/51Y4bEu4sOL.jpg", "country": "Japan", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}