{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 132, "rating": 4.0, "reviews": [{"review_sentiment": 2.0, "review_text": "Really? Why bother? Very disappointing. It's as if the publisher ordered more sex in the next one, please! Doesn't hold a candle to the first books and may turn me off to the rest of the series."}, {"review_sentiment": 5.0, "review_text": "A great read!  All of Furst books are terrific."}, {"review_sentiment": 4.0, "review_text": "I have yet to be disappointed by any of Furst's books. If you're any type of historian minded reader these are great books. Most of his books deal with pre WWII east European countries, stuff most of us know little about. Spies galore and beautiful women, what's not to like??"}, {"review_sentiment": 2.0, "review_text": "I nearly gave up on this book but I kept going thinking something must happen soon !! I had to wait until nearly the end of the book before the story developed into anything remotely interesting. The story revolves around a Frenchman living in Paris who makes movies. WW2 comes along and interrupts his world. I found the book had little plot as such and meandered along describing day to day life in Paris under occupation as the main character goes from one lunchtime meeting to another, all viewed through rose tinted glasses. I was disappointed in this book particularly considering the Kindle price."}, {"review_sentiment": 4.0, "review_text": "This, the 4th book in the series, does not live up to the levels of the first 3.  The story just isn't as good, and didn't leave me with anticipation as the others did.  What I mean by that, is that when I finished a chapter or came to a point where I could stop for a while in the first 3 books, I would think of what situation the character was in and how he would proceed during the day(s) when I wasn't reading it.  That didn't happen with The World at Night. And, to add a Spoiler Alert, the next book in the series is just a continuation of the 4th book, and I felt insulted by this.  Just as when a movie producer decides to make TWO movies out of ONE book (Part 1 and Part 2) just to maximize the profit, Furst produced 2 books but could easily have released one long book. He chose to release a 324 page book (this one), followed by a \"Part 2\" book (Red Gold) of 272 pages.  Considering the first book, Night Soldiers, was a robust 519 pages, I have to call him out on this money-grab.  A good story, but not great.  I'll take an extra star off my review of Red Gold for this, for sure."}, {"review_sentiment": 4.0, "review_text": "Having recently read and reviewed the thirteenth out of fourteen novels in the Night Soldiers series which I enjoyed enormously, I thought I would try one earlier in the series, randomly picking number four, published way back in 1996. Not quite as good in plot and character development, but superlative in describing and evoking what occupied Paris and France may have been like in 1940 after the Germans waltzed in. A frightening and confusing place - who can be trusted, who is watching you, keeping your head down, queuing up for bread, sorting ration cards, what you are willing to do to get food, petrol, out of Paris, out of France, citizens now refugees leaving the city with nowhere to go or means of getting there.Jean Casson is a film producer, lives a good life, divorced, more women than he knows what to do with. When the Germans arrive, and the French government gives in without a fight, it sets something off in Casson. He realises he is still crazy in love with the beautiful Citrine, an actress who has fled to the south of France. Jean himself is asked to produce a movie which may or may not be Nazi propaganda, and may or may not be run by a bunch of allied spies or Nazi spies, and in the process, somehow, gets involved with a group of money smugglers. His first trip is to Spain where things don't go entirely to plan, bringing him to the attention of the German occupiers. And then his problems really start, always trying to stay just one step ahead of the SS. So pretty good plot line really, but it is all sort of disconnected, things happen and you can't quite recollect how the happening happened. Despite going back through the pages looking for the connection.I expect living in France during this time was quite surreal and disorienting.  This certainly comes through in the writing, a frightening and horrible time. So maybe the loosely held threads are supposed to be like that. But there is no getting away from the vivid descriptions of Paris and France, the fear of the population, the brutality of the Germans, and the looking away of many of the locals. Suspicion and betrayal saturating the air. It's not a bad read, but could be better."}, {"review_sentiment": 5.0, "review_text": "Furst is such a good author and this doesn't disappoint."}, {"review_sentiment": 4.0, "review_text": "Wonderful novel.  Was Jean Renoir the basis for the main character? Somebody take me to Heininger's."}, {"review_sentiment": 3.0, "review_text": "He is locked into a formula and I am having trouble remembering which book I have read recently because they are so much alike.  the first few books of his I read I really enjoyed but the last few are twins of the others with the same characters popping up. what started out as a window into the lives of a person caught in Europe during WWII, or just as it started, has become repetitive.  I have read 6 of his books but this is the last one. I recommend his books if this is the first time you have read one."}, {"review_sentiment": 4.0, "review_text": "I am interested in this period of history and Furst seems to be knowledgeable.  He writes with a rather laid back style, which does not necessarily create a great amount of suspense and angst.  I would say that the author is more interested in a realism in mood and fidelity in story and actions, than in the high suspense of a historical thriller.  Still, with my personal interest in this period of history, Furst books are probably more accurate and historically faithful, than books where the point is high dramatic suspense."}]}, "authors": ["Alan Furst"], "isbn": "0375758585", "longitude": 2.3514992, "periods": ["1900s"], "title": "The World at Night: A Novel", "word_cloud": "really bother very disappoint publisher order sex please first rest series great terrific yet disappoint type historian mind great most deal per east european country stuff know little galore beautiful woman nearly give keep go think something soon wait nearly end story develop anything remotely interest story revolve live make movie come along interrupt find little plot meander describe day day life occupation main character go lunchtime meeting viewed rise tinted glass disappoint particularly consider price series live level first story good leave anticipation others mean finish chapter come point first situation character day read happen next series continuation felt insulted movie producer decides make two movie profit produce easily long choose release page follow page consider first robust page call good story great take extra star review sure have recently review thirteenth fourteen novel series enjoy enormously think earlier series randomly pick number publish way back not quite good plot character development superlative describe evoke occupied waltz frightening confuse place trust watch keep head queue bread sort ration card willing food petrol citizen refugees leave city nowhere go mean get film producer live good life divorce woman know arrive french government give fight set something realities still crazy love beautiful actress flee south ask produce movie propaganda bunch allied spy spy process somehow get involve group money smuggler first trip thing go entirely plan bring attention german occupier problem really always try step ahead pretty good plot line really sort disconnect thing happen quite happen happen go page look expect live time quite surreal disorient certainly come write frighten horrible time maybe loosely hold thread suppose get away vivid description fear population brutality look away many local betrayal saturate air bad durst good author disappoint basis main character lock formula trouble remember recently much first really enjoy last twin others character pop start window life person catch start become repetitive last recommend first time interested period history seem knowledgeable write rather lay style necessarily great amount suspense angst author interested realism mood fidelity story action high suspense historical thriller still personal interest period history probably accurate historically faithful point high dramatic suspense", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII"], "summary": "Paris, 1940. The civilized, upper-class life of film producer Jean Casson is derailed by the German occupation of Paris, but Casson learns that with enough money, compromise, and connections, one need not deny oneself the pleasures of Parisian life. \r\n\r\nSomewhere inside Casson, though, is a stubborn romantic streak. When he’s offered the chance to take part in an operation of the British secret service, this idealism gives him the courage to say yes. \r\n\r\nA simple mission, but it goes wrong, and Casson realizes he must gamble everything—his career, the woman he loves, life itself. \r\n\r\nHere is a brilliant re-creation of France—its spirit in the moment of defeat, its valor in the moment of rebirth.", "asin": "0375758585", "rank": "142060", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51xvDCM8FCL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}