{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 5537, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "I enjoyed the care taken to recreate the world of the fair at this time.  I was most interested in Holmes's story, and wanted more focus on that.  The pace was a little strange at times, but overall I enjoyed the read."}, {"review_sentiment": 5.0, "review_text": "This book was such a wonderful read."}, {"review_sentiment": 5.0, "review_text": "One of the best books I've read"}, {"review_sentiment": 4.0, "review_text": "I want to preface my book review by saying that this book will not be for everyone. That’s for sure. And the reason for that is that one of the storylines is extremely grim. It covers a serial killer known as HH Holmes who killed anywhere from 9 to 200 people during Chicago World‘s Fair at the turn of the 19th century. However, that storyline (which is covered by the word devil in the title), is only one of the two storylines that runs through the book.The other storyline is the creation, execution, and after effects of the Chicago World‘s Fair (known as the White City) that took place in the late 1890s during the Gilded Age. It is the story of a group of courageous, talented, and persistent men (and a few women too) who had a vision and were able to carry it out. What they pulled off is extraordinary! And the list of players reads like a Who’s Who of important people in American architecture, history, entertainment, politics, etc.In some ways, I can see how some reviewers were disappointed because they felt like this was really two totally different books thrown together. But I liked the novelistic approach that the author took even though this is nonfiction. His exhaustive research showed. And getting a break from the grim details of the serial killer every other chapter was a welcome respite. The juxtaposition between the two stories was fascinating."}, {"review_sentiment": 3.0, "review_text": "Fascinating story about the 1893 World's fair and dealing with a serial killer named H.H. Holmes who used the hotel to lure his victims (mostly women) to their deaths.Book was well written and the author did his research.  It's all well done."}, {"review_sentiment": 5.0, "review_text": "This nonfiction history of the Chicago World's Fair of 1893 kept me engrossed.  It is written in a novelized manner that I found entertaining and easy to read.  The dual narratives of architect Daniel Burnham's harried overseeing of the Fair's production and serial murderer H. H. Holmes nefarious deeds worked well together.I was wrapped up in both storylines and even amazed by how fascinating I found the portions about the set up of the Fair, the obstacles and trials faced in getting it open and the numerous characters involved in its operation.Extremely well researched and written in prose befitting the Gilded Age. Some readers may find The Devil in the White City lengthy and over detailed, but it really satisfied this reader."}, {"review_sentiment": 5.0, "review_text": "Great!"}, {"review_sentiment": 5.0, "review_text": "Awesome book, love the quality book covering, looks like a $100 book !"}, {"review_sentiment": 5.0, "review_text": "Very good book, informative.It was well research.It was a good read"}, {"review_sentiment": 5.0, "review_text": "Captivating story.Couldn't put it down."}]}, "authors": ["Erik Larson", "Erik Larson"], "isbn": "0375725601", "longitude": -87.6244212, "periods": ["1900s", "1800s"], "title": "The Devil in the White City: Murder, Magic, and Madness at the Fair That Changed America", "word_cloud": "enjoy care take recreate world time interested story want pace little strange time overall enjoy wonderful best want preface review say everyone sure reason story lines extremely grim cover serial killer know kill anywhere people turn century however story line cover word title story lines run story line creation execution effect known take place late gild story group courageous talented persistent men woman vision able carry pull extraordinary list player read important people american architecture history entertainment politics way see reviewer disappoint felt really totally different together like novelist approach author take even nonfiction exhaustive research show get break grim detail serial killer chapter respite juxtaposition story fascinate fascinate story deal serial killer name use hotel lure victim mostly woman well write research well do nonfiction history keep engross write novelized manner find entertain easy dual narrative architect harry oversee production serial murderer nefarious deed work well wrap story lines even amaze fascinating find portion set obstacle trial face get open numerous character involve well research write prose befitting reader lengthy detail really satisfied great love quality cover look very good well good captivate put", "genres": ["Biography", "History", "True Crime", "Fiction & Literature", "Historical Fiction", "True Crime"], "summary": "Two men, each handsome and unusually adept at his chosen work, embodied an element of the great dynamic that characterized America’s rush toward the twentieth century. The architect was Daniel Hudson Burnham, the fair’s brilliant director of works and the builder of many of the country’s most important structures, including the Flatiron Building in New York and Union Station in Washington, D.C. \r\n\r\nThe murderer was Henry H. Holmes, a young doctor who, in a malign parody of the White City, built his “World’s Fair Hotel” just west of the fairgrounds—a torture palace complete with dissection table, gas chamber, and 3,000-degree crematorium. Burnham overcame tremendous obstacles and tragedies as he organized the talents of Frederick Law Olmsted, Charles McKim, Louis Sullivan, and others to transform swampy Jackson Park into the White City, while Holmes used the attraction of the great fair and his own satanic charms to lure scores of young women to their deaths. What makes the story all the more chilling is that Holmes really lived, walking the grounds of that dream city by the lake.\r\n\r\nThe Devil in the White City draws the reader into a time of magic and majesty, made all the more appealing by a supporting cast of real-life characters, including Buffalo Bill, Theodore Dreiser, Susan B. Anthony, Thomas Edison, Archduke Francis Ferdinand, and others. In this book the smoke, romance, and mystery of the Gilded Age come alive as never before.\r\n\r\nErik Larson’s gifts as a storyteller are magnificently displayed in this rich narrative of the master builder, the killer, and the great fair that obsessed them both.", "asin": "0375725601", "rank": "840", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51IqhTjyl-L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}