{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 35, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Very Nice !!! Thank You !!!"}, {"review_sentiment": 5.0, "review_text": "Very informative!"}, {"review_sentiment": 4.0, "review_text": "good historic novel too little historic and too much novel"}, {"review_sentiment": 5.0, "review_text": "No better way to get a reasonably accurate history of the period, with commentary about the media that is as true to today, if not more so, than it was at the time the book was set, or written."}, {"review_sentiment": 5.0, "review_text": "Mr. Vidal uses faction to make history more interesting.  Teddy Roosevelt comes alive in this book.  This is a great read"}, {"review_sentiment": 5.0, "review_text": "1"}, {"review_sentiment": 1.0, "review_text": "THIS REVIEW IS NOT OF MR. VIDAL'S NOVEL. IT IS OF THE QUALITY OF THE COVER AND BINDING.There is a film on the cover of the book that is falling off. It actually has a different texture than the rest of the Vidal books in my collection, which is weird because they are all the same edition. This bothers me to no end."}, {"review_sentiment": 5.0, "review_text": "An astonishing and reassuring history of our Americans political traditions.  Witty. Urbane.  Erudite. Highly entertaining.  Beautifully written.  Read it. You will love it."}, {"review_sentiment": 4.0, "review_text": "Great historically, but a little gossipy"}, {"review_sentiment": 4.0, "review_text": "historical characters brought to life in an interesting and enjoyable story,examining the role of media and money in politics. As true today as it was back then.l"}]}, "authors": ["Gore Vidal"], "isbn": "037570874X", "longitude": 0.0, "periods": ["1800s"], "title": "Empire", "word_cloud": "very very informative good historic little historic much better way get reasonably accurate history period commentary medium true today time set write use faction make history interesting come alive great film cover fall actually different texture rest collection weird edition bother end astonishing reassuring history political tradition entertain write love historically little gossipy historical character bring life interest enjoyable story examine role medium money politics true today back", "genres": ["Fiction & Literature", "History", "Politics"], "summary": "\"Mr. Vidal demonstrates a political imagination and insider's sagacity equaled by no other practicing fiction writer I can think of. And like the earlier novels in his historical cycle, Empire is a wonderfully vivid documentary drama.\" —The New York Times Book Review\r\n\r\nIn this extraordinarily powerful epic Gore Vidal recreates America's Gilded Age—a period of promise and possibility, of empire-building and fierce political rivalries. In a vivid and beathtaking work of fiction, where the fortunes of a sister and brother intertwine with the fates of the generation, their country, and some of the greatest names of their day, including President McKinley, Theodore Roosevelt, William Jennings Bryan, William and Henry James, the Astors, the Vanderbilts, and the Whitneys, Gore Vidal sweeps us from the nineteenth century into the twentieth, from the salvaged republic of Lincoln to a nation boldly reaching for the world.", "asin": "037570874X", "rank": "405066", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/513YHi3nUEL.jpg", "country": "Washington D.C.", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}