{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 2, "rating": 3.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Exquisite debauchery. Better than 50 Shades, anyway."}, {"review_sentiment": 1.0, "review_text": "This is a poor excuse for a book. It is essentially poorly written, pretentious, pointless  pornography couched in a World War II story. It is weak, repetitive, boring and, for those who know the term, \"drek\" it applies perfectly."}]}, "authors": ["Marc Behm"], "isbn": "038039958X", "longitude": 13.3888599, "periods": ["1900s"], "title": "The Queen of the Night", "word_cloud": "exquisite debauchery anyway poor excuse essentially poorly write pretentious pointless pornography couch story weak repetitive boring know term trek applies perfectly", "genres": ["Fiction & Literature", "WWII", "Erotica"], "summary": "She is every inch a woman - and every bit a Nazi. Edmonde, beautiful and depraved, who quotes Shakespeare, then screams \"Seig Heil\" and plunges into orgies of impossible desire and brutal savagery. Edmonde, who moves from bedroom to bedroom, woman to woman, from beerhall to bunker in the twilight world of the Nazi pantheon. \r\n\r\nThe Queen Of The Night parallels the moral slide of the Third Reich with the sexual and violent excesses of an amoral amorous woman. The result is a bizarrely beautiful novel - a savage satire, brilliant and macabre.\r\n\r\nBehm, an American settled in France, wrote one of the great novels of obsessive detective fiction, The Eye of the Beholder. Its predecessor was even weirder, one woman’s Sadean journey through the horrors of wartime “engulfed by the dementia of history”. \r\n\r\nInspired by The Magic Flute, what follows often reads like a disco version of Wagner, ending in notable squalor in the Berlin bunker for a blasphemous version of Downfall: “Hitler and his general staff escaping from Berlin in an Amt VI gas chamber! Lunatic!” Delirious, tasteless and sublime.", "asin": "038039958X", "rank": "4763070", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/41nPJtEeo5L.jpg", "country": "Germany", "story_arc": ["Tragedy", "Things only get worse"]}