{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 45.5202471, "ratings": {"num_ratings": 129, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "It's a good book.  Mikal Gilmore tells the story very well."}, {"review_sentiment": 5.0, "review_text": "This book is an effort by the youngest brother of Gary Gilmore to try to make sense of how two of his brothers ended up violent (and in the case of Gary notorious) criminals, while he and a quiet gentle older brother did not.  Mikal tries to piece together his family's history, which is particularly difficult in the case of the father who used multiple aliases. What is not in doubt is that their father was a con man, a liar, and frequently violent (especially towards Gary and his wife). His mother had rebelled from the strictures of her Mormon upbringing by taking up with him, but their marriage was right out of Who's Afraid of Virginia Wolf. It's hard to understand why she stayed with him, but it becomes evident to Mikal at the time of her father's death that she loved him, deeply enmeshed in an unhealthy co-dependency.  Mikal comes across as an insightful person and a reliable narrator of his own and his family history. The only time I really doubted him was when he said he bore no ill will or anger towards either of his parents. Given the long litany of abuse and betrayals this either seems deeply unhealthy or almost Christ-like in his capacity to forgive. Well worth reading."}, {"review_sentiment": 3.0, "review_text": "The Executioner's Song was much better."}, {"review_sentiment": 5.0, "review_text": "Amazing book about a terrible family story. A truly great accompaniment to Norman Mailer's \"The Excecutioner's Song\"."}, {"review_sentiment": 5.0, "review_text": "As advertised"}, {"review_sentiment": 5.0, "review_text": "Awesome book had to purchase it for one of my college classes"}, {"review_sentiment": 5.0, "review_text": "Fantastic Book.  Riveting from start to finish."}, {"review_sentiment": 5.0, "review_text": "I first read Mikal Gilmore's memoir, \"Shot in the Heart\", when it was originally published in the middle 1990's. It was before ordinary readers were reviewing books, so I never reviewed it. However, I have just reread the book in the Kindle form and I want to let others know just how brilliant the book truly is.Mikal Gilmore is the youngest brother of Gary Gilmore, a drifter and ne'er-do-well, who murdered in cold blood two young Mormon men in Salt Lake City, on two consecutive nights in the mid-1970's. Tried and convicted for his crimes, Gary Gilmore was sentenced to death by shooting. His was the first execution in the United States in many years, and Gilmore demanded to be executed. He wouldn't countenance any appeal to his sentence; he wanted to die. And die Gary Gilmore did; shot in the heart by five men with rifles.Gary and Mikal Gilmore were the second and fourth sons of Frank and Bessie Gilmore. Mismatched from the start, Frank and Bessie were the hell that made their four sons' lives disasters. Two of the four were criminals, the oldest son was damaged for life, and Mikal managed to escape, at least on the outside, from a wasted life. Mikal Gilmore drifted around in his adulthood, working as a journalist and maintaining a mostly normal existence. But the both the crimes and the ghosts of his past - beginning in infancy - plagued him. His book - now 20 or so years old - is his attempt to explain to others - and himself - just how those ghosts bedeviled his life and those of his parents and brothers.Don't let anyone tell you that the past isn't at least a bit indicative of the future. The Gilmore family is proof that terrible parenting - going back many generations - is the cause of bad futures. Mikal Gilmore's beautifully written memoir is a sad look at a family's past and a not particularly hopeful look at its future."}, {"review_sentiment": 5.0, "review_text": "Outstanding book.  Mikel Gilmore is a terrific writer."}, {"review_sentiment": 5.0, "review_text": "So much life injected into a story about death."}]}, "authors": ["Mikal Gilmore"], "isbn": "0385478003", "longitude": -122.6741949, "periods": ["1900s"], "title": "Shot in the Heart", "word_cloud": "good tell story well effort youngest brother try make sense brother end violent case notorious criminal quiet gentle older brother try piece together family history particularly difficult case father use multiple alias doubt father con man liar frequently violent especially towards wife mother rebel stricture upbringing take marriage right hard understand stay become evident time death love deeply enmesh unhealthy come insightful person reliable narrator family history time really doubt say bore ill anger parent long litany abuse betrayal seem deeply unhealthy almost capacity forgive read much better amaze terrible family story truly great accompaniment advertised awesome purchase college class fantastic start finish first memoir originally publish middle ordinary reader review never review however reread form want let others know brilliant truly youngest brother drifter murder cold blood young men consecutive night try convict crime sentence death shoot first execution many year gilmore demand execute appeal sentence want die die men second fourth son start hell make son live disaster criminal oldest son damage life manage escape least outside wasted life drift around adulthood work journalist maintain mostly normal existence crime ghost begin infancy plague year old attempt explain others ghost bedevil life parent anyone least bit indicative future family proof terrible parent go back many generation cause bad future beautifully write memoir sad look family particularly hopeful look future outstanding terrific writer so much life inject story death", "genres": ["Memoir", "True Crime"], "summary": "WINNER OF THE LOS ANGELES TIMES BOOK PRIZE\r\n\r\nHaunting, harrowing, and profoundly affecting, Shot in the Heart exposes and explores a dark vein of American life that most of us would rather ignore. It is a book that will leave no reader unchanged.\r\n\r\nGary Gilmore, the infamous murderer immortalized by Norman Mailer in The Executioner's Song, campaigned for his own death and was executed by firing squad in 1977. Writer Mikal Gilmore is his younger brother. In Shot in the Heart, he tells the stunning story of their wildly dysfunctional family: their mother, a black sheep daughter of unforgiving Mormon farmers; their father, a drunk, thief, and con man. It was a family destroyed by a multigenerational history of child abuse, alcoholism, crime, adultery, and murder. \r\n\r\nMikal, burdened with the guilt of being his father's favorite and the shame of being Gary's brother, gracefully and painfully relates a murder tale \"from inside the house where murder is born... a house that, in some ways, [he has] never been able to leave.\" \r\n\r\nShot in the Heart is the history of an American family inextricably tied up with violence, and the story of how the children of this family committed murder and murdered themselves in payment for a long lineage of ruin.", "asin": "0385478003", "rank": "96307", "city": "Portland", "image": "https://images-na.ssl-images-amazon.com/images/I/51niOW-AKPL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}