{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 9684, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "So realistic, and I kept thinking no way could this happen. Could it? I couldn't put it down. Full of suspense and found myself feeling the fear and mystery as I read. Excellent reading."}, {"review_sentiment": 5.0, "review_text": "Good book, sad ending"}, {"review_sentiment": 5.0, "review_text": "Enjoyed the book...held my interest all the way thru...read like a mystery.  Would recommend the book for all to read."}, {"review_sentiment": 2.0, "review_text": "I read The Handmaids Tale because of all the good reviews.But all I have to say about it is that it is a extremely boring book!"}, {"review_sentiment": 2.0, "review_text": "Hope the tv show comes up with a plot.  Kept waiting for something to happen.  Read the first couple of chapters then read the afterwards, all the plot your going to get"}, {"review_sentiment": 5.0, "review_text": "This book too me a while to get through as I felt there were some slow points but after I watched the 1st season on Hulu I had to know what the book said. I felt it was very interesting and really must have taken someone with extreme intelligence too write so many years ago."}, {"review_sentiment": 4.0, "review_text": "This was a good book. It took a little while for me to get into it at the beginning. The ending was very odd. It felt incomplete"}, {"review_sentiment": 5.0, "review_text": "Could not stop reading this book, very interesting and compelling story line. Keeps the reader guessing and the author managed to keep the excitement very high. Also really enjoyed the ending."}, {"review_sentiment": 5.0, "review_text": "Good novel. The author tells a good story and makes the reader care. She tells the story a little at a time, so the reader is at always in suspense.She makes one want to know the ending."}, {"review_sentiment": 4.0, "review_text": "It was at first difficult for me to get into the narrators elaborate thoughts but I found the book to be well written and engaging!"}]}, "authors": ["Margaret Atwood"], "isbn": "038549081X", "longitude": -71.0595678, "periods": ["2000s"], "title": "The Handmaid's Tale", "word_cloud": "so realistic keep think way suspense find feel fear mystery excellent read good sad end enjoy hold interest way mystery good say extremely boring tv show come plot wait something first couple chapter afterwards plot go get felt slow point watch season know say felt interest really take someone extreme intelligence write many year ago good take little get begin end odd felt incomplete read interesting compelling story line guess author manage keep excitement high also really enjoy end good author tell good story make care tell story little time always make want know end first difficult get narrator elaborate thought find well write engage", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "The seminal work of speculative fiction from the Booker Prize-winning. Partially fictionalised, post-nuclear Cambridge and Boston are the settings for Atwood's The Handmaid's Tale.\r\n\r\nOffred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Handmaids are valued only if their ovaries are viable.\r\n\r\nOffred can remember the days before, when she lived and made love with her husband Luke; when she played with and protected her daughter; when she had a job, money of her own, and access to knowledge. But all of that is gone now….\r\n\r\nFunny, unexpected, horrifying, and altogether convincing, The Handmaid's Tale is at once scathing satire, dire warning, and literary tour de force.\r\n\r\n", "asin": "038549081X", "rank": "216", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/51mI9Ml1%2ByL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}