{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 217, "rating": 3.8, "reviews": [{"review_sentiment": 1.0, "review_text": "Boring and poorly written"}, {"review_sentiment": 4.0, "review_text": "Interesting novel set in the tulip crazed Holland of the 17th century.  The best part of the book for me, frankly, was the setting.  Holland was at a truly pivotal moment in its development largely thanks to the development of a substantial middle class with money to invest in art (think Rembrandt, Hals, Vermeer, etc), and tulip futures!If you like a novelization of the period, and particularly the tulip craze, you may also like Gregory Maguire's (yes, the author of Wicked!) Confessions of an Ugly Stepsister. If you want to learn more about how Holland wound up bound to this flower, I also  enjoyed the book Tulipmania."}, {"review_sentiment": 3.0, "review_text": "Fiction always disappoints me, because it is too simple: too few characters, too little complex dialogue, unreal situations.  I enjoyed the history that was the background for this book, but not the main story line as much.  Oh, well..."}, {"review_sentiment": 5.0, "review_text": "Excellent read!"}, {"review_sentiment": 5.0, "review_text": "What an epic story told with an artistic almost poetic rhythm. A classic love affair but so many whimsical twists. I thoroughly loved it!"}, {"review_sentiment": 5.0, "review_text": "Wonderful novel - wonderful movie"}, {"review_sentiment": 4.0, "review_text": "Book was well written but I expected to learn more about the Tulip-mania in Amsterdam at the time, not elicit affairs and schemes that had very little to do with Tulips."}, {"review_sentiment": 3.0, "review_text": "This book was a little far-fetched. I found it rather tedious with nothing to make me wish to read anything further by this writer."}, {"review_sentiment": 5.0, "review_text": "Karma is just. That’s all I have to say that describes this book to a capital T!! Such a great book!"}, {"review_sentiment": 5.0, "review_text": "I thought it was good since I  am a horticulturist and have known about this from history.  But I think that the book  should have focused more on the tulip bulb industry and breeding and production which makes a certain bulb species so valuable.  Even today there are different grades and prices for specific species. The cheapest that are sold are referred to as \"the floor sweepings\", meaning all the leftovers. There is now tight security involving shipments from Holland which land on the New York docks.Before  when the shipments arrived the most valuable species no longer arrived although they had been loaded and sent. Also the containers were left on the hot docks and not given priority to be dispersed so heat sensitive monitors are in the containers and blame for mishandling can be determined for insurance claims."}]}, "authors": ["Deborah Moggach"], "isbn": "0385334923", "longitude": 4.8936041, "periods": ["1600s", "Recent Releases"], "title": "Tulip Fever", "word_cloud": "bore poorly write interest set craze century best part frankly set truly pivotal moment development largely thanks development substantial middle class money invest art think future like novelization period particularly craze also author wicked want learn wound flower also enjoy always disappoint simple character little complex dialogue unreal situation enjoy history background main story line much well excellent epic story tell artistic almost poetic rhythm classic love affair many whimsical twist thoroughly love wonderful wonderful movie well write expect learn time elicit affair scheme little little find rather tedious nothing make wish anything writer say describes capital great think good horticulturist known history think focused bulb industry breed production make certain bulb specie valuable even today different grade price specific species cheapest sell referred floor sweeping mean leftover tight security involve shipment land shipment arrive valuable specie longer arrive load sent also containers leave hot dock give priority disperse heat sensitive monitor container blame mishandle determine insurance claim", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "n 1630s Amsterdam, tulipomania has seized the populace. Everywhere men are seduced by the fantastic exotic flower. But for wealthy merchant Cornelis Sandvoort, it is his young and beautiful wife, Sophia, who stirs his soul. She is the prize he desires, the woman he hopes will bring him the joy that not even his considerable fortune can buy.\r\n\r\nCornelis yearns for an heir, but so far he and Sophia have failed to produce one. In a bid for immortality, he commissions a portrait of them both by the talented young painter Jan van Loos. But as Van Loos begins to capture Sophia's likeness on canvas, a slow passion begins to burn between the beautiful young wife and the talented artist.\r\n\r\nAs the portrait unfolds, so a slow dance is begun among the household’s inhabitants. Ambitions, desires, and dreams breed a grand deception—and as the lies multiply, events move toward a thrilling and tragic climax.\r\n\r\nIn this richly imagined international bestseller, Deborah Moggach has created the rarest of novels—a lush, lyrical work of fiction that is also compulsively readable. Seldom has a novel so vividly evoked a time, a place, and a passion.\r\n\r\n“Sumptuous prose . . . reads like a thriller.” The New York Times Book Review", "asin": "0385334923", "rank": "29368", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/510Mf48oSHL.jpg", "country": "The Netherlands", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}