{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 158, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I have found the author to give a splendid description of complex human relationships.i am a devoted  fan since reading atonement."}, {"review_sentiment": 4.0, "review_text": "Quite a plot with a strong ending. It's especially interesting for those who have been to Berlin."}, {"review_sentiment": 1.0, "review_text": "This is the second of his books that I've read, and I really, really didn't like it.  I couldn't stand either of the main characters and the choices they made.  Thinking back, the characters in Atonement, the other that I've read, did some awful things and were also not terribly likable, but I liked that book well enough to try a second one.  Not sure whether I'll read a third now."}, {"review_sentiment": 5.0, "review_text": "Ian McEwan's writing excels because he simply does not merely tell us what the characters do,  ... he allows usinto thought processes which lead to the actions."}, {"review_sentiment": 4.0, "review_text": "An old book but well done. Enjoyed the character development. McEwan did not waste time on a lot of sidelines to the plot. A fairly quick read but very good."}, {"review_sentiment": 3.0, "review_text": "This was a hard read for me due to the violence and gratuitous eroticism.  But it would make for a really good movie with its sympathetic characters, gripping suspense and unusual plot twists."}, {"review_sentiment": 5.0, "review_text": "This is the tenth Ian McEwan novel I have read.  For me, he is one of the best at getting inside the minds of his characters, and bringing out the nuances in human relationships.We are introduced to Leonard as a conscientious technician working in a spy tunnel in Cold War Berlin.  Inexperienced with women, he begins a relationship with the congenial Maria, and they fall in love.  But Maria is recovering from an abusive marriage.  The ex-husband won't leave them alone and tragedy ensues.The dismemberment scene was hard to read (it's chapter 18 if you want to skip it).  But I don't think it was entirely gratuitous, for during this terrible night we see the strands of Leonard and Maria's love begin to unravel.  From then on, this is one phenomenal page-turner!"}, {"review_sentiment": 1.0, "review_text": "Didn't like it at all."}, {"review_sentiment": 5.0, "review_text": "Admiration, respect, but no envy. Greatness should not be envied."}, {"review_sentiment": 4.0, "review_text": "Good and interesting book. Would definitely recommend to others"}]}, "authors": ["Ian McEwan"], "isbn": "0385494335", "longitude": 13.3888599, "periods": ["1900s"], "title": "The Innocent", "word_cloud": "find author give splendid description complex human devote fan reading atonement quite plot strong end especially interesting second really really main character choice make character awful thing also terribly likable like well enough second not sure third write excels simply merely tell character allow us into thought process lead action old well do character development waste time lot sideline fairly quick good hard due violence gratuitous eroticism really good movie sympathetic character grip suspense unusual plot twist tenth best get inside mind character bring nuance human introduce conscientious technician work spy tunnel woman begin relationship congenial fall love recover abusive marriage alone tragedy dismemberment scene hard chapter want skip think entirely gratuitous terrible night strand begin unravel phenomenal admiration respect envy envy good interesting definitely recommend others", "genres": ["Fiction & Literature", "Historical Fiction", "Cold War"], "summary": "The setting is Berlin. Into this divided city, wrenched between East and West, between past and present; comes twenty-five-year-old Leonard Marnham, assigned to a British-American surveillance team.\r\n\r\nThough only a pawn in an international plot that is never fully revealed to him, Leonard uses his secret work to escape the bonds of his ordinary life -- and to lose his unwanted innocence.\r\n\r\nThe promise of his new life begins to be fulfilled as Leonard becomes a crucial part of the surveillance team, while simultaneously being initiated into a new world of love and sex by Maria, a beautiful young German woman. It is a promise that turns to horror in the course of one terrible evening -- a night when Leonard Marnham learns just how much of his innocence he's willing to shed.", "asin": "0385494335", "rank": "444295", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51Da2dUojUL.jpg", "country": "Germany", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}