{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 7, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "A story of a group of people who met each evening to talk about nothing important, but to enjoy each other's company. reminded me of the 60s when one simply met friends, and spent the evening with them, \"drifting\" in conversation."}, {"review_sentiment": 3.0, "review_text": "Naguib Mahfouz has chosen an unlikely crew of people for his book, a group of stoners who meet nightly on a houseboat to smoke concentrated marijuana and talk philosophy and life.  One of the members of this little gang has been hitting the MJ too hard and is starting to have problems at work, and all the members of this group suffer problems with nihilism and too much escapism.  Always seeking new blood, they invite a female journalist to their group, but she comes with an agenda, which is to study them and write them up in a play.  Accordingly, she is taking notes.  More importantly, her questions to the group cause them to question themselves and their routines, to a certain extent.  After an all-nighter of blowing dope and philosophizing, the members of the group decide to take a drive in the country, but it goes horribly wrong when the super-stoned driver of the vehicle hits and kills a man.  The group then tears itself apart as its members try to decide whether or not to take responsibility for their hit-and-run.  In the meantime the member who is having problems at work attacks his boss in the druggy aftermath of the previous all-nighter and loses his job, with dim prospects for other employment.This book reads smoothly, and you can envision the different characters pretty easily based on their comments.  Just as the all-nighter starts to feel long, the characters decide to take their doomed drive and change the scenery.  The entire book follows about three days in the characters' lives, and as such it doesn't explore the characters in depth.  Instead Mahfouz gives us the excessive lives of the characters in a brief snapshot that perfectly captures their addictions and excesses.  The easy camaraderie of the characters rapidly falls apart when tested, and it's every man for himself as the enormity of their crime comes home.  None of the characters is particularly sympathetic, so you don't feel very sorry for them, but there is a sense of loss for their wasted nights and vapid stances.  It's a good read for something different, but these are not characters worth spending any real time with."}, {"review_sentiment": 3.0, "review_text": "The work of Mahfouz can be divided, it's said, into four periods: historical, realist, experimental and traditional. For many, his great accomplishment was the Cairo Trilogy, from the realist period. This novel, which I assume belongs to the experimental phase, failed to fascinate by comparison.It had some interest: to present the characters' frivolity and dissipation and finally to confront them with the consequences of their actions. Yet I couldn't help comparing this novel with his earlier, realistic work, with its deeper characters and relationships and more entrancing stories. Here, on the other hand, all the characters were weak, and little attention was given to their development. Maybe their weakness was the point, since the author seemed to be portraying the loss of direction of the Egyptian elites, but it didn't make for an absorbing read.Maybe part of the problem, aside from the theme, was that the author seemed unable to make up his mind about which point of view to tell the story from. Much of it was from the character Zaki's perspective -- in the third person -- though the novel didn't go that deeply into his character. Other times, it followed other characters, superficially.This story has been filmed, and it made a livelier film than a novel, in my opinion.Some excerpts:\"Everyone is writing about socialism . . . while most writers dream of acquiring a fortune, and of nights full of dazzling society.\"\"We can see that the ship of state sails on without need of our opinion or support; and that any further thinking on our part is worth nothing, and would very likely bring distress and high blood pressure in its wake.\"\"Real knowledge provides an ethical system in an age when morals are crumbling. It is manifested in a love of truth; in integrity in judgment; in a monastic devotion to work; in cooperation in research; and in a spontaneous disposition toward an all-embracing, humanist attitude. Is it possible, on the level of the particular, for scientific excellence to replace opportunism in the hearts of the new generation?\"\"Like many whom I meet at social gatherings, he is apparently exquisitely cultured but inwardly hollow, crumbling, stinking of his own miserable decay . . . . [Another] imagines herself to be a pioneering martyr, whereas in fact she is a pioneer only in the incoherent depravity of addiction.\"\"He had not read a newspaper for a long time; he knew nothing of current events except what he picked up from his friends' delirious commentaries that merged into the endless babble of the smoking party. Who were the ministers? What were the policies? How were things going? But who cares! As long as you can walk along a deserted street without a thug attacking you, as long as Amm Abduh brings you the good stuff every evening, as long as there is plenty of milk in the refrigerator, then things must be going well.\""}, {"review_sentiment": 4.0, "review_text": "Intellectuals gather every evening on a boat for drug and sex parties. One of them writes a play with the members of the group as main characters. Their common attitude: flight for reality, nihilism and defeatism. The fervour after the Nasser revolution is gone: \"Revolutions are planned by cunning foxes, fought by the brave and won by the cowards.\"But ultimately they are confronted with reality when one of them kills a person in a car accident and flees. Will the name of the culprit be revealed to the police? The group falls apart.Mahfouz punches Samuel Beckett and his 'theatre of the absurd' K.O. when he cleverly remarks that Beckett filed a complaint against an editor who failed to fulfil his contract. His plays may be absurd, but not the royalties. It was all just a pose.Indeed, more a book for Egyptian readers, but also with a universal theme: don't shun your responsibilities.Highly recommended."}, {"review_sentiment": 5.0, "review_text": "Winning the Nobel Prize for literature (in 1988) certainly didn't hurt him any, andnow Naguib Mahfouz has become a house-hold name (for the literati, at least). Whenone reads a Prize-winner, one expects substance and style, and Mahfouz, if histranslators are honest, certainly seems worthy of the Swedish honor. In \"Adrift on theNile,\" nihilism is the word, as a group of like minded intellectuals gather nightly on ahouseboat moored on the famous river where they question anything that can bequestioned--\"but no answers,\" they claim. \"There are never any answers,\" as they callinto account any topic brought up. It is a \"din in iniquity,\" for sure, as good Egyptiankif (and a well-stoked pipe) help to bring out their curiousity cum intellect. That is,until, toward the end of this short novel, the group takes a ride out into the desertwhere a disaster happens. It's Jay Gatsby, final chapter, of course.Mahfouz is compared to Proust, Camus, Salinger, and an introspective Hemingway,and justifiably so. Hailed as the \"widest-read Arab writer currently published in theU.S.,\" Mahfouz has certainly wielded his own influence among international readerssince the '88 Prize; alas, it seems it took the impact of this award for his books toachieve their circulation, but that doesn't diminish his themes, his philosophies, hisimpact on both socially significant issues and modern literature.\"Adrift on the Nile\" reads fast and it is short; yet it packs a punch that seems to scoreto the very soul. The houseboat literally becomes a ship of fools, adrift on theSargasso Sea, headed into the Bermuda triangle. Existentialists will love this one.(Billyjhobbs@tyler.net)"}, {"review_sentiment": 3.0, "review_text": "A sort of Eqyptian Bartelby the Scrivener meets Brian de Palma. The book portrays a group of overeducated and generally understimulated, underemployed professionals who meet nightly in a hookah ritual that seems to roll on like the everpresent Nile until the one night when an outing changes things forever.  The book marvelously conveys modern aimlessness, ennui, and the haunting presence of the past.  Short, but depressing."}, {"review_sentiment": 4.0, "review_text": "I truly enjoyed this book.  I'd actually rate it 8.5 on the 1-10 scale.  The passion and readability of Adrift on the Nile led me to other works of Mafouz, all of which provide the unique entertainment experience that comes only from a mesmerizing novel .  Being such a short book, Adrift on the Nile is impossible to put down once started"}]}, "authors": ["Naguib Mahfouz"], "isbn": "0385423330", "longitude": 31.243666, "periods": ["1900s"], "title": "Adrift on the Nile", "word_cloud": "story group people meet even talk nothing important enjoy company remind simply friend spent even drift conversation choose unlikely crew people group stoners meet nightly houseboat smoke concentrate marijuana talk philosophy life member little gang hit hard start problem work member group suffer problem nihilism much escapism seek new blood invite female journalist group come agenda study write play accordingly take note more importantly question group cause question routine certain extent blow dope philosophize member group decide take drive country go horribly wrong driver vehicle hit kill man group tear apart member try take responsibility meantime member problem work attack druggy aftermath previous loses job dim prospect read smoothly envision different character pretty easily base comment start feel long character decide doomed drive change scenery entire follow day character life explore character depth instead give excessive live character brief snapshot perfectly capture addiction excesses easy camaraderie character rapidly fall apart test man enormity crime come home none character particularly sympathetic feel sorry sense loss waste night vapid stance good something different character spend real time work divide say period historical realist experimental traditional many great accomplishment realist period assume belongs experimental phase fail fascinate interest present character frivolity dissipation finally confront consequence action yet compare earlier realistic work deeper character relationships entrance story here hand character weak little attention give development maybe weakness point author seem portraying loss direction egyptian elite make absorb part problem aside theme author seem unable make mind point view tell story much character perspective third person go deeply character other time follow character story film make livelier film excerpt write socialism writer dream acquire fortune night full dazzle society see ship state sail need opinion support think part nothing likely distress high blood pressure wake real knowledge provide ethical system age moral crumble manifest love truth integrity judgment monastic devotion work cooperation research spontaneous disposition humanist attitude be possible level particular scientific excellence opportunism heart new generation many meet social gathering apparently exquisitely culture inwardly hollow crumble stink miserable decay imago pioneer martyr whereas fact pioneer incoherent depravity addiction newspaper long time know nothing current event picked friend delirious commentary merge endless babble smoke party minister policy how thing go care long walk deserted street thug attack long bring good stuff evening long plenty milk refrigerator thing go well intellectual gather evening boat drug sex party write member group main character common attitude flight reality nihilism defeatism fervor revolution go plan cunning fox fight brave coward ultimately confront reality kill person car accident flees culprit reveal group fall punch absurd cleverly remark file complaint editor fail fulfill contract play royalty egyptian reader also universal theme shun recommend win literature certainly hurt and now name literati least when one read expect substance style his translators honest certainly seem worthy swedish honor the nile nihilism word group mind intellectual gather nightly houseboat moor famous river question anything be questioned answer claim never answer call into account topic bring din iniquity sure good pipe help curiosity cum intellect short group take ride desert where disaster happen final chapter compare introspective justifiably hail arab writer currently publish certainly wield influence international readers since ala seem take impact award to achieve circulation diminish theme philosophy his impact socially significant issue modern literature read fast short yet pack punch seem score to houseboat literally become ship fool the sargasso head triangle existentialist love sort egyptian meet portrays group over educated generally under stimulated underemployed professional meet nightly hookah ritual seem roll ever present night out change thing forever marvelously conveys modern aimlessness ennui haunt presence depressing truly enjoyed actually rate scale passion readability lead work provide unique entertainment experience come mesmerize be short impossible put start", "genres": ["Fiction & Literature"], "summary": "This moving and perceptive story centres upon a group of disaffected middle-class Cairenes who gather on a house-boat on the River Nile every evening to smoke kif, drink, and discuss politics. Their host is an addict, so dependent that he is in danger of losing his job.\r\n\r\nOne evening they venture out for a drive which ends in tragedy, destroying their easy camaraderie and exposing the frailty of human relationships. In his elegant but economic prose, Mahfouz once again creates - out of the simplest of plots - a telling commentary on human nature.", "asin": "0385423330", "rank": "511878", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51hfIKHwpCL.jpg", "country": "Egypt", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}