{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 201, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "Very interesting take about the impact of Katrina on very different---and real---people. Each person had an interesting and very different background in the same city and the book did a great job of walking us through the way each person and his loved ones lived in NOLA before, during and after the storm."}, {"review_sentiment": 5.0, "review_text": "Riveting, well composed."}, {"review_sentiment": 5.0, "review_text": "Incredible book! Enjoyed it very much."}, {"review_sentiment": 5.0, "review_text": "I bought this book and read it soon after it came out.  It was a page turner - fascinating on so many levels.  It gave new meaning to government bureaucracy.  This is an unforgettable book that I am remembering now while listening to news on the Houston flood.  I wish this author would write a book about Houston after this flood is over."}, {"review_sentiment": 5.0, "review_text": "great book"}, {"review_sentiment": 5.0, "review_text": "Anyone who loves New Orleans should read this book.  Nine true stories with uplifting endings, who could ask for more?"}, {"review_sentiment": 5.0, "review_text": "This is an excellent book. The storytelling is compelling and the characters are extremely interesting. I purchased this after a recent trip to New Orleans. I came home obsessed and had to know more about the people and the city of New Orleans. This book filled me in even more on the magic of the city. Read it!"}, {"review_sentiment": 4.0, "review_text": "It was so interesting following these people for that length of time.  It helped to understand the problems of New Orleans."}, {"review_sentiment": 4.0, "review_text": "This was an interesting read.  Great character development, and the characters chosen were balanced and diverse"}, {"review_sentiment": 4.0, "review_text": "This was a good introduction to New Orleans before visiting there.  It's not about Bourbon street, but it is about people and music."}]}, "authors": ["Dan Baum"], "isbn": "0385523203", "longitude": -90.0701156, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Nine Lives: Mystery, Magic, Death, and Life in New Orleans", "word_cloud": "very interesting impact different real person interest different background city great job walk way person love one live storm rivet well compose incredible much buy soon come page turner fascinate many level give meaning government bureaucracy unforgettable remember listen news flood wish author flood great anyone love true story uplifting ending excellent storytelling compelling character extremely interest purchase recent trip come home obsess know people city fill even magic city interest follow people length time help problem interesting character development character choose balanced diverse good introduction visit street people music", "genres": ["Biography", "History"], "summary": "Nines Lives is a multivoiced biography of a dazzling, surreal, and imperiled city, told through the lives of nine unforgettable characters and bracketed by two epic storms: Hurricane Betsy, which transformed New Orleans in the 1960s, and Hurricane Katrina, which nearly destroyed it. \r\n\r\nDan Baum brings this kaleidoscopic portrait to life, showing us what was lost in the storm and what remains to be saved.", "asin": "0385523203", "rank": "59351", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51B4gxCw93L.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}