{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 8, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Very good."}, {"review_sentiment": 2.0, "review_text": "Maybe if I was really into hockey I would have been able to finish King Leary; the sum total of everything else wasn't enough to keep me reading.  There are some memorable images of highly unconventional hockey games, and times when the idiosyncratic language surprised and delighted me.  The main character and narrator, whose soul, so to speak, is placed at the center of this novel, is too familiar, and Quarrington's plot moves along like a bulldozer on a one lane road--long before I abandoned the book, I was sick of staring at it's slowly moving parts.Much better is Quarrington's novel Whale Music, which seems to be his second attempt at the same story.  The persistence paid off."}, {"review_sentiment": 3.0, "review_text": "I am pathetically easy to please when it comes to books. I love pretty much every genre made available. I can settle down for a mystery. I adore a good dose of romance. I especially love books in the sci-fi and fantasy genre. More than all of this I adore hockey books. I am a huge hockey fan (supporting my Pittsburgh Penguins and Saskatoon Blades) and have over two dozen hockey books in my library.I picked up \"King Leary\" on a whim a while ago. It looked interested and it was on the Canada Great Read's list.Despite being easy to please, I was terribly disappointed. This is the first time I have read a hockey book that I have been disappointed by. Towards the end I was terribly confused and found the book jumping from past to present too quickly to follow. There are some very hilarious and chuckle-worthy parts of the book, but in all I think it truly disappointed me.I terribly hate to write about a book that has disappointed me, as I feel so \"gah\" afterwards, but there we have it.If you are a hockey or a sports fan, I recommend \"Tropics of Hockey\" by Dave Bidini. \"Searching for Bobby Orr\" by Stephen Brunt. \"Thunder & Lightning\" by Phil Esposito. These three are a far better example of wonderful hockey stories, in and away from the NHL."}, {"review_sentiment": 4.0, "review_text": "Elderly former hockey star Percival Leary, born in one-nine-zero-zero, is contacted at his residence, the South Grouse Nursing Home, one day by a representative of \"Canada's best-selling ginger ale beverage\" and asked to travel to Toronto to do a commercial for the product. He agrees, taking a nurse and his roommate, Blue Hermann, former newspaper reporter who wrote about Leary (also known by his Indian nickname, Loofweeda). Leary spends a lot of time reminiscing about the antics of his youth, time spent in a reformatory, friend and fellow hockey player Manfred Armstrong Ozikean, glory days as King of the Ice, career ending injury, and two adult sons. The telling involves a lot of bragging, crazy words and humor, and a bit of sadness. The trip itself involves lots of surprises. And although I am not a fan of the sport (and could have done without the two-page dream sequence of Chapter 35), I really enjoyed this unusual, quirky-character-filled, overwhelmingly funny book chosen as the Canada Reads 2008 selection. Also good: Seabiscuit by Laura Hillenbrand and The Perfect Mile by Neal Bascomb."}, {"review_sentiment": 5.0, "review_text": "[...] -- Congratulations to our friend and colleague Paul Quarrington, and kudos to champion Dave Bidini, in today's KING LEARY'S win on CANADA READS!  There is so much great coverage of all the books (isn't soooo Canadian to be soooo even handed in awards stuff - LOL!!) that we just want to add our little piece, directly from the boys themselves.Be sure to pick up the new Porkbellys Futures CD fronted by PQ with his long-time musical collaborator Martin Worthy and fab musicians Chas Elliott, Stuart Laughton, and Rebecca Campbell. [...] . PQ's next novel, The Ravine, is now in the stores. [...]The Ravine(c) BookShorts Literacy Program; shot on location at Toronto Public Library, Pape Danforth Branch during FREEDOM TO READ WEEK."}, {"review_sentiment": 5.0, "review_text": "King Leary is an old man now, but in his heydey he was the king of the ice, leaving opponents clutching at air as he executed the famous St Louis Whirligig. He is tracked down by an androgyous advertising company hack to  promote a brand of ginger ale, and together they commence a  laughter-inducing trip to the big city to make ads.This book will have  you holding your stomach and wiping your eyes. It would be worth the read  just to find out the real meaning of the King's Indian nickname, Loofweda,  which he translates as \"skates like the wind\"."}, {"review_sentiment": 4.0, "review_text": "King Leary is a very funny novel.  I really enjoyed this book because its setting is right around where I live.  The characters in this novel seemed real and alive.  Paul Quarrington is an author who really gets involved in  his work.  This novel is a great recommendation to anyone who really  enjoy's a good Canadian laugh!Happy Reading and enjoy!"}, {"review_sentiment": 5.0, "review_text": "Thoroughly enjoyed this book. Based loosely on hockey as it was earlier in the 20th century. Written in the first person, a style of which Quarrington is a master (see also \"Whale Music\"). Also, like Whale Music,  very touching at times."}]}, "authors": ["Paul Quarrington"], "isbn": "0385666012", "longitude": -79.387207, "periods": ["1900s", "2000s", "Recent Releases"], "title": "King Leary", "word_cloud": "very good maybe really hockey able sum total everything else enough keep reading memorable image highly unconventional hockey game time idiosyncratic language surprise delight main character narrator soul speak place center familiar plot move bulldozer lane road long abandon sick star slowly move better seem second attempt story persistence pay pathetically easy please come love pretty much genre make available settle mystery adore good dose romance especially love fantasy genre more adore hockey huge hockey fan support dozen hockey pick whim look interested easy please terribly disappoint first time hockey disappoint end terribly confuse find jump past present quickly follow hilarious part think truly disappointed terribly hate write disappoint feel hag afterwards hockey sport fan recommend far better example wonderful hockey story elderly former hockey star bear contact residence day ginger ale beverage ask travel commercial product agree take nurse roommate former newspaper reporter write also know indian nickname spend lot time reminisce antic youth time spent reformatory friend fellow hockey player glory day career end injury adult son tell involves lot brag crazy word humor bit sadness trip involve lot surprise fan sport do dream sequence chapter really enjoy unusual overwhelmingly funny choose selection also good congratulation friend colleague kudos champion today win much great coverage soot soot even hand award stuff want little piece directly boys sure pick new front musical collaborator fab musician store c shot location old man heyday ice leave opponent clutch air execute famous track androgynous advertising company hack promote brand ginger together commence trip big city make hold stomach wipe eye real mean indian nickname translate skate wind funny really enjoy set right live character seem real alive author really get involved work great recommendation anyone really good canadian laugh happy enjoy thoroughly enjoy base loosely hockey earlier century first person style master see also also touch time", "genres": ["Fiction & Literature", "Historical Fiction", "Humour", "Sport"], "summary": "Selected as the 2008 CBC Canada Reads Winner!\r\n\r\n\"A dazzling display of fictional footwork… The author has not written just another hockey novel; he has turned hockey in a metaphor for magic.\" Maclean's\r\n\r\nPercival Leary was once the King of the Ice, one of hockey's greatest heroes. Now, in the South Grouse Nursing Home, where he shares a room with Edmund \"Blue\" Hermann, the antagonistic and alcoholic reporter who once chronicled his career, Leary looks back on his tumultuous life and times: his days at the boys' reformatory when he burned down a house; the four mad monks who first taught him to play hockey; and the time he executed the perfect \"St. Louis Whirlygig\" to score the winning goal in the 1919 Stanley Cup final.\r\n\r\nNow all but forgotten, Leary is only a legend in his own mind until a high-powered advertising agency decides to feature him in a series of ginger ale commercials. With his male nurse, his son, and the irrepressible Blue, Leary sets off for Toronto on one last adventure as he revisits the scenes of his glorious life as King of the Ice.", "asin": "0385666012", "rank": "2697428", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/514tZ3h0FPL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}