{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 393, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Another great Atwood book. A different way of telling the story. Great characters. Twists and turns. Keeps you thinking! Very enjoyable."}, {"review_sentiment": 4.0, "review_text": "a little difficult in getting started.  But once you get into it, thi gs go quickly.  a good read all in all"}, {"review_sentiment": 5.0, "review_text": "This novel based on a true story is captivating and intriguing. Couldn't put it down as the main character,Grace is an enigma. Good read.. ."}, {"review_sentiment": 5.0, "review_text": "Acting was great. Wish the complexity of the novel could have been put forth in this series. So, we've had Atwood's Handmaid's Tale and Alias Grace what's next? Edible Woman? Moral Disgrace? Bring them all!"}, {"review_sentiment": 4.0, "review_text": "I like this book. The author did a great job of filling in the gaps of a 150 year old murder mystery to make it interesting today. I still don't know if Grace really did it."}, {"review_sentiment": 4.0, "review_text": "I was drawn into this when I heard that Netflix would be making a short series based on it. I felt it is somewhat slow paced, but enjoyable. I almost quit though at one point, however I am sincerely glad I stuck with it. The Grace character is beautifully written. However I could have done completely without Simon Jordan and his distracting side story. Hated him in the end."}, {"review_sentiment": 5.0, "review_text": "I found his novel thought provoking with the well crafted characters with individual world views and human foibles. The creation of existing in a different era was successful as well. She also brought up important questions about truth we think we know, violence and different class powers. I’ve yet to see the six part series on Netflix!"}, {"review_sentiment": 5.0, "review_text": "This is the first book by Margaret Atwood that I have read. The big hype is over “The Handmaid’s Tale” because of the Hulu series, but the tale of “Alias Grace” is much more in my interest. I saw the trailer for it and the impending release on Netflix, so I just had to drop everything to read it. I thoroughly enjoyed it too. I was expecting more of a ‘gasp’ revelation at the end though. There was a gasp, but a small one and without the usual cursing.I’ve watched the first episode on the show now and I know I will enjoy that just as much as the book."}, {"review_sentiment": 5.0, "review_text": "Very interesting story based on fact.  Intriguing to read.  I especially liked the ending, however, I understand it may not be authentic."}, {"review_sentiment": 5.0, "review_text": "I should have read this story a long ago. Wonderfully written and compelling, you will love Grace, innocent or not."}]}, "authors": ["Margaret Atwood"], "isbn": "0385490445", "longitude": -79.387207, "periods": ["1900s"], "title": "Alias Grace", "word_cloud": "great different way tell story character turn think very enjoyable little difficult get start thigh g quickly good base true story captivate intriguing put main character enigma act great wish complexity forth series next like author great job fill gap year old murder mystery make interesting today still know really draw hear make short series base felt somewhat slow pace enjoyable almost quit point however sincerely glad stick character beautifully write however do completely distract side story hat end find thought provoke well craft character individual world view human foibles creation exist different era successful well also bring important question truth think know violence different class power yet see part series first big hype series tale much interest saw trailer impend release drop everything thoroughly enjoy expect gasp revelation end small usual watch first episode show know enjoy much very interesting story base fact especially like end however understand story long ago wonderfully write compelling love innocent", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In this astonishing new work by the author of the bestselling The Robber Bride and Cat's Eye, Margaret Atwood re-creates a mysterious and disturbing murder and breathes new life into one of the most enigmatic and notorious women of the nineteenth century.\r\n\r\nGrace Marks has been convicted for her involvement in the vicious murders of her employer, the wealthy Thomas Kinnear, and his housekeeper, Nancy Montgomery. Years later, Dr. Simon Jordan--an up-and-coming expert in the burgeoning field of mental illness--listens to Grace's story, from her family's difficult passage from Ireland to Canada, to her time as a maid in Thomas Kinnear's household. As Grace relives her past, Jordan draws her closer to a dark maze of relationships and her lost memories of the day her life was shattered.\r\n\r\nSuperbly evoking a century past, and alive with mesmerizing storytelling, Alias Grace is vintage Atwood.\r\n\r\n\"Atwood has surpassed herself, writing with a glittering, singing intensity.\" New York Review of Books", "asin": "0385490445", "rank": "1442", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51EBc6V-ngL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}