{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 256, "rating": 3.9, "reviews": [{"review_sentiment": 2.0, "review_text": "Readable, just, but not one of his best efforts.  The author can certainly write and keep you reading but this was a little heavy and far fetched for this reader.  I would still try McEwan in the future as he has written some good novels in the past."}, {"review_sentiment": 2.0, "review_text": "Was disappointed and bored with repetitive content."}, {"review_sentiment": 5.0, "review_text": "Ian McEwan's Enduring Love is one of those novels you never forget. One of the most memorable openings I've ever read and the book was unputdownable. Period. It begins with a highly dramatic incident unfolding a story that is deeply, creepily, psychological. Highly recommended."}, {"review_sentiment": 2.0, "review_text": "I thought this book dragged on... I liked it at first but then I found it slow and didn't keep my attention."}, {"review_sentiment": 4.0, "review_text": "Slow paced drama. After experiencing a tragedy, Joe and Clarissa's life as a couple is not the same when Parry decides to be part of a forced relationship. It build all this euphoria about what Parry wants and gets, and the climax could be longer, more detailed in my opinion."}, {"review_sentiment": 5.0, "review_text": "Surprising, gripping. High tension!"}, {"review_sentiment": 5.0, "review_text": "Though mis-titled, excellent touch and feel of a marriage relationship from both perspectives and how fragile the balance and illusions of love are or can be.  Terrific descriptions of the characters' tipping points and how actions or non-actions, slight or great, can alter feelings or perceptions, slightly or greatly. Bit confused about the title, but the story will hopefully endure. When it comes to writing, Sir McEwan can pound a pint or two."}, {"review_sentiment": 5.0, "review_text": "\"...but this pinprick is as notional as a point in Euclidian geometry...\"I earmarked the first page of Chapter Two upon encountering this unique simile author McEwan employs to illustrate a defining moment of his story, an instant from which the entire tale springs.  What marvelous creativity in this author's repertoire!  How does one fill a blank sheet of paper with sentences as rich and vivid as this?  How can you not love an author who is able to conjure \"pinprick,\" \"notional,\" and \"Euclidian\" not only in the same brief clause, but in tight proximity to each other?  Craftsmanship at its very best. Of course, the English are the best writers of English.  And McEwan is one of their best.\"Saturday\" and \"On Chesil Beach\" are my favorite McEwan works, but very much enjoyed finding this earlier novel.  Highly recommend."}, {"review_sentiment": 5.0, "review_text": "A very fascinating book that we read for bookclub. I recommend it highly."}, {"review_sentiment": 5.0, "review_text": "Mr. McEwan never disappoints!"}]}, "authors": ["Ian McEwan"], "isbn": "0385494149", "longitude": -0.12574, "periods": ["1900s"], "title": "Enduring Love: A Novel", "word_cloud": "readable best effort author certainly write reading little heavy far fetched still future write good novel disappoint bore repetitive content novel never forget memorable opening ever unputdownable period begin highly dramatic incident unfold story deeply creepily psychological recommend think drag like first find slow keep attention pace drama experience tragedy life couple decide part force relationship build euphoria want get climax detailed opinion surprise grip high tension excellent touch feel marriage relationship perspective fragile balance illusion love description character tip point action slight great alter feeling perception slightly greatly confused title story hopefully come write pound pint pinprick notional point euclidean geometry earmark first page chapter encounter unique simile author employ illustrate define moment story instant entire tale spring marvelous creativity author fill blank sheet paper sentence rich author able conjure pinprick notional euclidean brief clause tight proximity best course best writer best favorite work much enjoy find earlier fascinating book club recommend highly never disappoints", "genres": ["Fiction & Literature"], "summary": "In one of the most striking opening scenes ever written, a bizarre ballooning accident and a chance meeting give birth to an obsession so powerful that an ordinary man is driven to the brink of madness and murder by another's delusions. Ian McEwan brings us an unforgettable story—dark, gripping, and brilliantly crafted—of how life can change in an instant.", "asin": "0385494149", "rank": "91375", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/510S29ZqCdL.jpg", "country": "England", "story_arc": ["Tragedy", "Things only get worse"]}