{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 653, "rating": 3.6, "reviews": [{"review_sentiment": 1.0, "review_text": "I am reading this for our book  club for Oct I could not get into this book I've tryed too it's not my reading type of story to me boring I guess it's got alot of great reviews Maybe other like it I could rate better books than this on the best seller list that for sure"}, {"review_sentiment": 5.0, "review_text": "The Imperfectionists is beautifully, humorously and sensitively written. Each character in the newspaper room is  flawed, neurotic, and in their own way at times heroic. EAch has real individuality and a story that touches us. A beautiful, thoroughly enjoyable book, highly recommended!"}, {"review_sentiment": 1.0, "review_text": "I couldn't get past the first chapter!"}, {"review_sentiment": 4.0, "review_text": "Got for book club.  Different from what I usually read.  Good story and relating of characters."}, {"review_sentiment": 3.0, "review_text": "This is a series of related vignettes, which slowly put together the story of a newspaper. Each vignette tells a tale about a person related to the paper somehow - a foreign correspondent, an editor, a reader... But each tale is a cruel one, relating horrible parts of each life. Infidelities and breakups, deaths and betrayals. There is humor, but generally unkind humor. Each story arc, including the overall story of the newspaper, ultimately plummets downward. It is well-written, but most certainly not uplifting."}, {"review_sentiment": 5.0, "review_text": "I read this book several years ago, when it first was published. I wasn't going to write a review, but when I read some of the negative reviews and remembered the book so well and how I'd so enjoyed it, I felt I had to throw in my 2 cents' worth. The mere fact that I recall the book and the pleasure it gave me is very notable. I read a lot, and a lot of different stuff. The novels I read  tend to be mystery/cop/detective fiction. This book stands out as none of those. It was unique in its form; beautifully rendered in its characterizations; and other wise a delight. It was as much a page-turner as one gets from  non-thriller fiction. Well worth the read!"}, {"review_sentiment": 5.0, "review_text": "Each chapter reads like a short story as the characters are brought forwardThe Imperfectionists (2010) is Rachman’s debut novel that follows the private lives of the reporters, editors, and executives of an international English-language newspaper in Rome as they struggle to keep it and themselves going. Each chapter reads like a short story as the characters are brought forward. Fifty years and many changes later, the paper founded by a millionaire from Atlanta resides in a dingy office with stains on the carpet. Nothing about the editor, the lazy obituary writer, the financial officer, a freelance writer that makes up news in order to get noticed, disappoint for they are but a few of the compelling, interesting, funny, pathetic, brilliant people I wouldn’t have missed for the world. I can’t say enough positive things about this story, this writer, this experience of entering Rachman’s world of journalism fictionalized by an author with credentials that make this a delightful, authentic read."}, {"review_sentiment": 5.0, "review_text": "The Imperfectionists was one of the most memorable books I have ever read.  I absolutely loved it.  I read a review by Christopher Buckley who gave this book raves.  It's a fairly intricate plot and I don't want to get into the details except to say that this book is entertaining, thoughtful, and thought provoking.  I could become philosophical about some of the plot lines.  Just read it, you won't be sorry."}, {"review_sentiment": 5.0, "review_text": "An incredible book with very true portrayal of the life of journalists.  I am shocked it didn't make more waves and highly recommend as an enjoyable,  yet thought provoking read.  One of the rare books that you can both read at a beach or assign to a college class."}, {"review_sentiment": 5.0, "review_text": "Excellent book!"}]}, "authors": ["Tom Rachman"], "isbn": "0385343671", "longitude": 12.4829321, "periods": ["2000s", "Recent Releases"], "title": "The Imperfectionists", "word_cloud": "read club read type story boring guess get a lot great review maybe rate better best seller list sure beautifully humorously sensitively write character newspaper room flaw neurotic way time heroic real individuality story touch beautiful thoroughly enjoyable highly recommend first chapter club usually story relate character series relate vignette slowly put together story newspaper vignette tell tale person related paper somehow foreign correspondent editor tale cruel relating horrible part life breakups death betrayal humor generally unkind humor story include overall story newspaper ultimately plummet downward certainly uplift several year ago first publish go write review negative review remember well enjoy felt throw cent mere fact recall pleasure give notable lot lot different stuff novel tend fiction stand none unique form beautifully render characterization wise much get fiction chapter read short story character bring forward the debut follow private life reporter editor executive international newspaper struggle go chapter read short story character bring forward year many change later paper found millionaire reside dingy office stain carpet editor lazy obituary writer financial officer freelance writer make news order get notice disappoint compel interesting funny pathetic brilliant people miss world say enough positive thing story writer experience enter world journalism fictionalize author credential make delightful authentic memorable ever absolutely love review give raf fairly intricate plot want detail say entertain thoughtful thought provoking philosophical plot line incredible true portrayal life journalist shock make wave highly recommend enjoyable yet think provoke rare beach assign college class excellent", "genres": ["Fiction & Literature", "Journalism"], "summary": "The newspaper was founded in Rome in the 1950s, a product of passion and a multi-millionaire's fancy. Over fifty years, its eccentricities earned a place in readers' hearts around the globe. But now, circulation is down, the paper lacks a website, and the future looks bleak. \r\n\r\nStill, those involved in the publication seem to barely notice. The obituary writer is too busy avoiding work. The editor-in-chief is pondering sleeping with an old flame. The obsessive reader is intent on finishing every old edition, leaving her trapped in the past. And the publisher seems less interested in his struggling newspaper than in his magnificent basset hound, Schopenhauer. \r\n\r\nThe Imperfectionists interweaves the stories of eleven unusual and endearing characters who depend on the paper. Funny and moving, the novel is about endings - the end of life, the end of sexual desire, the end of the era of newspapers - and about what might rise afterward.\r\n\r\n\"The charming and enthralling story of an idiosyncratic English-language newspaper in Rome and the lives of its staffers as the paper fights for survival in the internet age. A precise, playful fiction with a deep but lightly worn intelligence.\" Times Literary Supplement.", "asin": "0385343671", "rank": "57147", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51ubU8v6SJL.jpg", "country": "Italy", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}