{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 55.6867243, "ratings": {"num_ratings": 344, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "I have no way of knowing whether any of the statements of facts introduced into this book are true.  Is it true that in the Arctic a drowned body will never come to the surface because there is no microbial activity to release oxygen to make the body float?  Is it true that there is an intestinal worm related to the guinea worm that lives only in sea mammals? Is it true that the ice from congealed fog is more dangerous to a ship than the ice from snow or rain?  Here is a whole universe of knowledge which comes handed to the reader on a platter, the understanding of which becomes the difference between death and survival.Smilla, of course, being half Inuit and half Danish polymath, understands this universe.  In fact, she understands it much better than she understands the world of Western civilization represented in this book by metallurgy, medical research, and money.  She is drawn into this world by another element she barely understands – love.  She has learned to love a child, and the child is dead.  Was it an accident?  Because of what Smilla knows about the boy, and about snow, she is pretty sure it was not.Smilla’s  exploration into what really happened leads her to danger, anger, passion, revenge, greed, torture, several icy plunges into freezing water, and lots of explanations about ice.  This is a good book to read next to a crackling fire with a cozy afghan around your knees.  Not so good if you are on a cruise to Greenland.As I was thawing out mentally from the vast empty ice floes of northern Greenland where the novel played out its last pages, I began to see a few areas in the plot where Hoeg was skating on pretty thin ice.  But while I was reading, they didn’t show, and even after, they didn’t matter much.  Smilla’s cold universe was amazingly real, whether it was true or not."}, {"review_sentiment": 1.0, "review_text": "I donated this book to Goodwill as soon as I read it because this novel is just trash. How in the world did it become the best book of the year? I thought this dumb story would never come to an end."}, {"review_sentiment": 3.0, "review_text": "This book starts off well enough as a good mystery. However, by halfway through, I was really slogging through it.  Most of it is completely unrealistic. And it doesn't get any better!  There are a few \"aha\" moments but the most part I had a hard time finishing it.  There are too many unanswered questions at the end."}, {"review_sentiment": 5.0, "review_text": "COULDN'T PUT IT DOWN"}, {"review_sentiment": 3.0, "review_text": "Plot is intriguing but I am disappointed with ending. Carácters are interesting but not convincing. It's OK"}, {"review_sentiment": 2.0, "review_text": "It was really good up to a point. Then it was as if the author didn't know how to end things. I liked the descriptions of life in Greenland."}, {"review_sentiment": 5.0, "review_text": "If you like mathematical and scientific analytical descriptions in your novel, this book is for you. In addition, I enjoyed learning about the Inuit and Danish culture and the relationship that ice serves for both. The heroine is a symbol of truth like the books she reads, including Euclid's, The Elements."}, {"review_sentiment": 4.0, "review_text": "I love this story.  It makes one think about why people do what they do.  Motives are sometimes quite complex."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed this book.  The plot is quirky and interesting.  The ending is not what you would expect."}, {"review_sentiment": 5.0, "review_text": "Seven stars. . . .  Oddly enough, this book is available in two translations.  I find this excellent translation to be quite superior to the other version, \"Miss Smila's Feeling for Snow\".  Even the title shows part of the nuanced difference.  This is an excellent adventure story, well worth rereading!"}]}, "authors": ["Peter Hoeg"], "isbn": "0385315147", "longitude": 12.5700724, "periods": ["1900s"], "title": "Smilla's Sense of Snow", "word_cloud": "way know statement fact introduce true true drown body never come surface microbial activity release oxygen make body float be true intestinal worm relate guinea worm live sea mammal be true ice congeal fog dangerous ship ice rain here whole universe knowledge come hand platter understand becomes difference death course half half polymath understands universe fact understands much better understands world civilization represent metallurgy medical research money draw world element barely understand learn child child dead accident know boy pretty sure exploration really happen lead danger anger passion revenge greed torture several icy plunge freeze water lot explanation ice good next crackling fire cozy afghan around knee not good cruise thaw mentally vast empty ice floe northern play last page begin see area plot skate pretty thin ice read even matter much cold universe amazingly real true donate soon trash world become best year think dumb story never end start well enough good mystery however halfway really slog most completely unrealistic better aha moment part hard time finish many unanswered question end put plot intrigue disappoint end interest convince ok really good point then author know end thing like description life like mathematical scientific analytical description addition enjoy learn danish culture relationship ice serve heroine symbol truth read include element love story make think people motif sometimes quite complex really enjoy plot quirky interest end star oddly enough available translation find excellent translation quite superior version even title show part nuanced difference excellent adventure story well reread", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "She thinks more highly of snow and ice than she does of love.  She lives in a world of numbers, science and memories--a dark, exotic stranger in a strange land.  And now Smilla Jaspersen is convinced she has uncovered a shattering crime...\r\n\r\nIt happened in the Copenhagen snow.  A six-year-old boy, a Greenlander like Smilla, fell to his death from the top of his apartment building.  While the boy's body is still warm, the police pronounce his death an accident.  But Smilla knows her young neighbor didn't fall from the roof on his own.  Soon she is following a path of clues as clear to her as footsteps in the snow.  For her dead neighbor, and for herself, she must embark on a harrowing journey of lies, revelation and violence that will take her back to the world of ice and snow from which she comes, where an explosive secret waits beneath the ice....", "asin": "0385315147", "rank": "136628", "city": "Copenhagen", "image": "https://images-na.ssl-images-amazon.com/images/I/51NbWCOu6iL.jpg", "country": "Denmark", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}