{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 96, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "liked"}, {"review_sentiment": 5.0, "review_text": "Wow.  A treasure trove of information.  Synthesizes a wide variety of historical material."}, {"review_sentiment": 4.0, "review_text": "The reader acquires a true \"feel\" of what was London and what London has become.  The author takes you through what seems a timeless journey while retaining interest and the desire to continue on."}, {"review_sentiment": 5.0, "review_text": "This is an incredible collection of historical information!"}, {"review_sentiment": 4.0, "review_text": "This was given to me as a birthday present. While it took a while to finish, I enjoyed every part of this as if it was a James Michener-type sweeping story. That's quite a feat, considering this is non-fiction."}, {"review_sentiment": 5.0, "review_text": "A very idiosyncratic stroll through the history of London.  It's not a standard history book, more vignettes of various topics related to the city.  It's perfect book for bedside reading.  Not a page turner that you can't put down, more like a leisurely stroll with an interesting friend with a conversation that ranges all around London.  The writing is very good, and I find myself repeatedly amazed at how the author was able to organize and present such a plethora of relatively unrelated information in such a cogent manner."}, {"review_sentiment": 4.0, "review_text": "Lots of information on the founding/formation of London, but sometimes very dry and hard to follow on the Kindle.  I would have appreciated maps, maps, and more maps to help me follow along better with the street and place names."}, {"review_sentiment": 4.0, "review_text": "A very complete history.  My advice would be to feel free to skip around between the sections to find what interest you the most."}, {"review_sentiment": 4.0, "review_text": "Having bought this book for personal study, I would say this is well written, with supplemental pictures.  While I don't believe this to be a complete overview by any means, it was a good start to my study of London and its history."}, {"review_sentiment": 5.0, "review_text": "I really like Peter Ackroyd's work."}]}, "authors": ["Peter Ackroyd"], "isbn": "0385497717", "longitude": -0.12574, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases", "1500s", "500-1400s", "0-500s", "Pre Common Era"], "title": "London: A Biography", "word_cloud": "like treasure trove information wide variety historical material acquires true feel become author take seem timeless journey retain interest desire continue incredible collection historical information give birthday present take finish enjoy part sweep story quite feat consider idiosyncratic stroll history standard history vignette various topic related city perfect read not turner leisurely stroll interest friend conversation range write good find repeatedly amaze author able organize present plethora relatively unrelated information cogent manner information sometimes dry hard follow appreciate map map map help along better street place name complete history advice free skip section find interest have buy personal study well write supplemental picture believe complete overview mean good start study history really work", "genres": ["Biography", "Art & Architecture", "History"], "summary": "A masterpiece -- the culmination and distillation of Peter Ackroyd’s lifelong passion for the history and topography of London. Vividly anecdotal and brilliantly original.\r\n\r\nPerhaps the most important study of the city ever written, London confirms Ackroyd’s status as what one critic called, “our age’s greatest London imagination.” Much of Peter Ackroyd’s work has been concerned with the life and past of London, but this new book is his definitive account of the city. For Ackroyd’s London is a living organism, with its own laws of growth and change, so London is The Biography , as the book is subtitled, not a History. Here Ackroyd portrays London from the time of the Druids to the beginning of the twenty-first century, noting magnificence in each age. But this is not a simple chronological record.\r\n\r\nHe writes chapters on the history of silence, the history of light, the history of childhood, the history of Cockney speech, and the history of drink. He constructs a comprehensive, multilayered image of the place, animated by his concern for the close relationship between the present and the past, and the peculiar ‘echoic’ quality of London which actively affects the lives and personalities of its citizens.", "asin": "0385497717", "rank": "65442", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51QqSLJK15L.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}