{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 37, "rating": 3.3, "reviews": [{"review_sentiment": 2.0, "review_text": "was just 'ok' for me"}, {"review_sentiment": 5.0, "review_text": "Not finished with the book yet but so far I have absolutely loved it."}, {"review_sentiment": 1.0, "review_text": "Boring, meandering writing."}, {"review_sentiment": 5.0, "review_text": "Excellent book. A very fun fictional read about a small group of doctors at varying points in their careers."}, {"review_sentiment": 2.0, "review_text": "Boring. Not very good book."}, {"review_sentiment": 3.0, "review_text": "The ending was a little disappointing. Though, the stories are well written and accurate depictions of life as a medical provider."}, {"review_sentiment": 5.0, "review_text": "Great read!"}, {"review_sentiment": 1.0, "review_text": "Book looked down right crappy. I'm creeped out to even touch it. I opened the package and had one look at it and said hell no."}, {"review_sentiment": 5.0, "review_text": "happy with purchase/shipping, will use again"}, {"review_sentiment": 3.0, "review_text": "I really liked this book, but I'm a doctor-wannabe.  I did find it interesting to learn about these doctors and how their lives intertwine. I enjoyed the writing but the ending was far roo abrupt."}]}, "authors": ["Vincent Lam"], "isbn": "0385661444", "longitude": -79.387207, "periods": ["2000s"], "title": "Bloodletting & Miraculous Cures: Stories", "word_cloud": "not finish yet far absolutely love bore meander write excellent fun fictional small group doctor vary point career bore not good end little disappointing well write accurate depiction life medical provider great look right crappy creeper even touch open package look say hell happy use really like find interesting learn doctor live intertwine enjoy write end far too abrupt", "genres": ["Fiction & Literature"], "summary": "Bloodletting &amp; Miraculous Cures welcomes readers into a world where the most mundane events can quickly become life or death. By following four young medical students and physicians – Ming, Fitz, Sri and Chen – this debut collection from 2006 Scotiabank Giller Prize winner Vincent Lam is a riveting, eye-opening account of what it means to be a doctor. Deftly navigating his way through 12 interwoven short stories, the author explores the characters’ relationships with each other, their patients, and their careers. Lam draws on his own experience as an emergency room physician and shares an insider’s perspective on the fears, frustrations, and responsibilities linked with one of society’s most highly regarded occupations.\r\n\r\n“I wanted to write about the way in which a person changes as they become a physician — how their world view shifts, and how they become a slightly different version of themselves in the process of becoming a doctor,” Lam explains. “I wanted to write about the reality that doing good and trying to help others is not simple. It is ethically complicated and sometimes involves a reality that can only be expressed by telling a story.”\r\n\r\nIn the book’s first story, “How to Get into Medical School, Part 1,” students Ming and Fitz wrestle with their opposing personalities and study techniques, while coming to terms with a growing emotional connection that elicits disapproval from Ming’s traditional Chinese-Canadian parents. Lam’s exceptional talent for describing scenarios with great precision is showcased in “Take All of Murphy,” when Ming, Chen, and Sri find themselves at a moral crossroads while dissecting a cadaver. Throughout the book, readers are treated to the physicians’ internal thoughts and the mental drama involved with treating patients, including Fitz’s struggle with self-doubt in “Code Clock” and Chen’s boredom and exhaustion in “Before Light.”\r\n\r\nFrom delivering babies to evacuating patients and dealing with deadly viruses, the four primary characters in Bloodletting &amp; Miraculous Cures are made thoroughly human by Lam’s insightful detail, realistic dialogue, and expert storytelling. The medical world is naturally filled with drama, but it’s the author’s ability to give equal weight to the smaller moments that really brings this book to life.", "asin": "0385661444", "rank": "1770620", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/414EFv7Hd9L.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}