{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 7, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "This was a unique and satisfying novel"}, {"review_sentiment": 5.0, "review_text": "I cannot write a review as I bought the book for a gift for my 99 year old uncle for his birthday."}, {"review_sentiment": 5.0, "review_text": "Richard Zimler's second novel, Hunting Midnight, casts as its central character a descendant of the title character in his first novel, The Last Kabbalist of Lisbon.  The new work is set in Porto, Portugal, in the early 19th century, 300 years after the first novel. Because it contains a wide range of ingredients - a  South African Bushman, a Scottish winegrower in Portugal, South Carolina slaves, child abuse, characters' artistic  pursuits, Beethoven, reverence for nature - it is perhaps more universal in its appeal than the first book.  But it also has its Jewish (and Kulanu) components, such as the narrator's discovery that he is descended from Jews, and the occurrence of an anti-Jewish pogrom in Porto. The author writes skillfully as the voice of the young Scottish-Portuguese half-Jew as well as that of a slave girl in the American South.  He also imparts a seemingly deep knowledge of Bushman belief and culture, in addition to snatches of Portuguese and Hebrew, and departures into Jewish philosophy and Scottish song and literature.  The story-telling style is tight, with straightforward prose that builds up tension and suspense effectively. These disparate elements might seem a bit too much, but it all works well together, and Hunting Midnight is a great read of almost-epic proportions.  While The Last Kabbalist was also a mesmerizing, suspenseful experience, it was more parochial.  The first novel was a best-seller in Portugal and did well internationally.  The second novel, being truly universal, may well do even better."}, {"review_sentiment": 5.0, "review_text": "Zimler's book is a triumph of modern fiction: an absolutely gripping narrative of love and loss set against a backdrop of fantastic historic drama.  Zimler rises to the incredible quality of his bestselling The Last Kabbalist of Lisbon.  The characters are rich and fully realized, and their conflicts are vital and real.  They grow throughout the book, so that by the end you feel a real intimacy with them.  The period setting is elegantly realized; you feel as though you are living in these far-away times, going to the bird market, observing the early forms of racism, encountering the ravages of the Inquisition.  This is a story of family too, and the close bonds of the central characters are extremely vivid.  I loved this book.  Read it at once."}, {"review_sentiment": 5.0, "review_text": "Zimler's book is a triumph of modern fiction: an absolutely gripping narrative of love and loss set against a backdrop of fantastic historic drama.  Zimler rises to the incredible quality of his bestselling The Last Kabbalist of Lisbon.  The characters are rich and fully realized, and their conflicts are vital and real.  They grow throughout the book, so that by the end you feel a real intimacy with them.  The period setting is elegantly realized; you feel as though you are living in these far-away times, going to the bird market, observing the early forms of racism, encountering the ravages of the Inquisition.  This is a story of family too, and the close bonds of the central characters are extremely vivid.  I loved this book.  Read it at once."}, {"review_sentiment": 5.0, "review_text": "As an avid reader who has been ritually disappointed by the so-called \"literary\" sensations of the past year, it is a true joy to find a book with a heart and soul, written by an author at the top of his game.This mesmerizing, beautifully written tale of the friendship between a freed African slave and a bereaved child will make you weep on every page, such is the realism of emotion Zimler packs into each page.  He is distinctly not an author given to mawkish sentimentality.  This is the unputdownable book of the year that thoroughly deserves a wider audience.  It is, as the flap copy suggests, an out-and-out masterpiece."}, {"review_sentiment": 5.0, "review_text": "In 1800 Porto, Portugal, the memories of the Spanish Inquisition linger as Jews hide their faith to avoid a repeat of their previous fate.  In this environs nine-year-old John Zarco Stewart becomes a friend with slightly older street person Daniel.  John soon learns that his family is Jewish, which is why they are shunned by much of the townsfolk and fail to practice in their home.  Violeta joins the two boys, but the guys one day find marks on her body as if somone battered her.  She insists she fell, but her two pals think her odious uncle assaulted her.When Daniel drowns and Violeta's family removes her from Porto, John feels bored and guilty because he thinks he caused misfortune for his two only pals until his papa brings home a new companion, African Bushman Midnight, who turns into a friend and mentor.  As John becomes an adult, he marries, but a secret from the past propels him to journey to America where he starts a new adventure with a black woman.HUNTING MIDNIGHT is a biographical fiction that consists of two stories.  The first part of the book centers on the coming of age of the narrator.  This segment is insightful as it provides depth to life on the Iberian peninsular during the Napoleonic Era, but also moves forward slowly as the misadventures seem somewhat trivial.  The latter half of the book focuses on adventures of John the adult in the Americas.  This is quite exciting as John adapts to a strange new world.  Richard Zimmler returns his audience to Portugal three centuries after his delightful THE LAST KABBALIST OF LISBON with a strong historical tale.Harriet Klausner"}]}, "authors": ["Richard Zimler"], "isbn": "0385336446", "longitude": 0.0, "periods": ["1700s"], "title": "Hunting Midnight", "word_cloud": "unique satisfying write review buy gift year old uncle birthday second cast central character descendant title character first last new work set early century year first contains wide range ingredient south african winegrower slave child abuse character artistic pursuit reverence nature perhaps universal appeal first also jewish component narrator discovery descend occurrence pogrom author write skillfully voice young well slave girl american also impart seemingly deep knowledge belief culture addition snatch departures jewish philosophy song literature style tight straightforward prose build tension suspense effectively disparate element bit much work well together great proportion last also mesmerize suspenseful experience parochial first well internationally second truly universal well even better triumph modern fiction absolutely grip narrative love loss set backdrop fantastic historic drama rise incredible quality bestselling last character rich fully realize conflict vital real grow end feel real intimacy period set elegantly realize feel living time go bird market observe early form racism encounter ravage story family close bond central character extremely vivid love triumph modern fiction absolutely grip narrative love loss set backdrop fantastic historic drama rise incredible quality bestselling last character rich fully realize conflict vital real grow end feel real intimacy period set elegantly realize feel living time go bird market observe early form racism encounter ravage story family close bond central character extremely vivid love avid ritually disappointed literary sensation year true joy find heart soul write author top mesmerize beautifully write tale friendship free bereave child make weep page realism emotion pack page distinctly author give mawkish sentimentality unputdownable year thoroughly deserve wider audience flap copy suggests masterpiece memory spanish linger hide faith avoid repeat previous fate environs become friend slightly older street person soon learn family shun much townsfolk fail practice home join boy guy day mark body someone batter insist fell pal think odious uncle assault drowns family remove feel bore guilty think cause misfortune pal papa bring home new companion turn friend mentor become adult marries secret past propels journey start new adventure black biographical fiction consist story first part center come age narrator segment insightful provide depth life peninsular also move forward slowly misadventures seem somewhat trivial latter half focus adventure adult quite exciting adapts strange new world return audience century delightful strong historical", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "From the internationally bestselling author of The Last Kabbalist of Lisbon comes a novel of incomparable scope and beauty that takes the reader on an epic journey from war-ravaged nineteenth-century Europe to antebellum America. A bereft child, a freed African slave, and the rich history of Portugal’s secret Jews collide memorably in Richard Zimler’s mesmerizing novel--a dazzling work of historical fiction played out against a backdrop of war and chaos that unforgettably mines the mysteries of devotion, betrayal, guilt, and forgiveness.\r\n\r\nHunting Midnight\r\n\r\nAt the dawn of the nineteenth century in Portugal, John Zarco Stewart is an impish child of hotheaded emotions and playful inquisitiveness, the unwitting inheritor of a faith shrouded in three hundred years of secrecy--for the Jews of the Iberian Peninsula have been in hiding since the Inquisition. But a season of loss and bitter discovery brings his innocence to an abrupt end. It is only the ministrations of a magical stranger, brought to Porto by his seafaring father, that restore his safety: Midnight, an African healer and freed slave, the man who will become John’s greatest friend and determine the course of his destiny.\r\n\r\nWhen Napoleon’s armies invade Portugal, violence again intrudes on John’s fragile peace, and seals his passage into adulthood with another devastating loss. But from the wreckage comes revelation as he uncovers truths and lies hidden by the people he loved and trusted most, and discovers the act of unspeakable betrayal that destroyed his family--and his faith. And so his shattering quest begins as he travels to America, to hunt for hope in a land shackled by unforgivable sin.\r\n\r\nWith stunning insight and an eye for rich historical detail--from the colorful marketplaces of Porto to the drowsy plantations of the American South, from the Judaism John discovers as a young man to the mystical Africa that Midnight conjures from his memories--in Hunting Midnight Richard Zimler has crafted a masterpiece.", "asin": "0385336446", "rank": "2759706", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/412FPN97X5L.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}