{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 27, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Nice insights to life swirling about the secretiveness of the Vatican.  While Hutchinson can't crack the walls of secrecy protecting the Vatican, he does offer some insights into aspects that I found very interesting.  This is the third or fourth book I have read about modern Rome and the Vatican, this one offered some fresh insights.  Besides, it is a pleasant read."}, {"review_sentiment": 1.0, "review_text": "very negative"}, {"review_sentiment": 5.0, "review_text": "Wonderfully fun and interesting information on the internal workings of the world's smallest country, great read before or after visiting the Vatican."}, {"review_sentiment": 1.0, "review_text": "A lazy book.  Fine for people who aren't interested in actual research or good writing.  Author writes extensively about foyers and the attitudes of secretaries because he simply can not be bothered to explore any further.  I get the impression that his wife kicked him out of his stupor every now and then and made him go the supermarket, or \"banco\", which he wrote about months later as a kind of revelatory experience when he realized he was low on revelatory experiences.  Felt completely manipulated by author's attempt to make this book look like a book."}, {"review_sentiment": 5.0, "review_text": "I am preparing for a trip to Rome and picked this up on impulse.  It was a delightful laugh-out-loud funny read with a lot of interesting information.  I later watched a National Geographic special on Rome and found that I knew quite a few things the special covered from reading the book.  There are interesting fact-filled chapters on the Swiss Guard, how to tell the status of the clergy based on what they are wearing, and the history of the maintenance men for the Vatican.  There was even a chapter on the excavations under St Peter's Basilica including some stories that I doubt we'll hear on the tour!  I am so glad I read this and will be marking a few chapters for my husband to read as well."}, {"review_sentiment": 5.0, "review_text": "There are many light 'travel' books intended to give a personal account of some aspect of the author's experience in a foreign country or city.  This book fits into that category with a particular emphasis on the Vatican.  Anyone planning a trip to Rome should consider some of the 'traveler' books along with the many excellent travel guides that are available to help you understand the city.  The \"traveler' books are generally much more interesting to read.\"When in Rome\" is a lot of fun. Robert Hutchinson provides great insight into the Vatican and how it works (or at times doesn't!) I am reminded of the question once asked of Pope John XXIII: \"How many people actually work in the Vatican?\" Answer: \"Not Many!\"I have been to Rome many times, but this book was still informative for me and is highly recommended for those planning a first trip to Rome, and even for the experienced traveler."}, {"review_sentiment": 5.0, "review_text": "Hutchinson served his purpose.  He provided just enough detail about the stories he picked to keep the lay reader interested, and varied his stories widely enough to provide a wide angle portrait of the Vatican.  A humorous and thoughtful look at the place and the institution which has, for better or worse, been the very center of Catholicism and the Catholic conciousness for 2,000 years."}, {"review_sentiment": 4.0, "review_text": "Upon the advise of a good tour guide, I purchased this book after visiting and utterly enjoying the Eternal City. Please note that this is certainly not the ultimate guide to the Vatican or to understanding Catholicism.  It is merely a collection of the amusing anecdotes of a journalist, who like other journalists has the opportunity to live in another part of the world and then comment about his impressions of adapting or accepting another culture.In this instance, Hutchinson moves to Rome with the sole purpose of writing a \"what I did on my summer vacation\" book on the Vatican.  He and his wife and three children, all practising Catholics already feel that affinity to Rome, the Pope and the Vatican that all Catholics innately experience.  Here, Hutchinson explores with pure delight his connection with an institution that has lasted through 2000 years of tumultuous change and yet like the rock it was built upon, invariably stays the same.Hutchinson's Roman adventures are sprinkled liberally with his slightly irreverant humor and yes, as other reviewers have commented, he does repeat himself.  But instead of looking cynically upon these faux pas, think of Hutchinson as the prodigal son (or any other excited tourist with a film projector filled with slides) returning from the unknown and merely so thrilled by what he has seen and experienced, can barely contain himself.  Enjoy his exuberance, visit Rome and share in it.Although most entertaining for me were Hutchinson's stories about St. Peter's bones, the Borgia popes, and the holy relics, I found the entire book one refreshing breeze of a read that brought back for me the sound of the Vespas in a city that juxtaposes the old with the new in a very stylish and sophisticated way.  Recommended reading for AFTER that trip to Rome---to relish all those \"Roman\" sensations all over again."}, {"review_sentiment": 4.0, "review_text": "In her New York Times Book Review, Sandra Mardenfeld tells us that When in Rome is \"...an interesting but rarely startling account.\"  She either didn't read it or is on the Curia payroll."}, {"review_sentiment": 5.0, "review_text": "I read this book on the bus to and from work each day and it really brought me back to the time I lived in Rome.  I really enjoyed the sarcastic views and \"insider\" information about the Vatican.  I recommend this book to any Italophile!"}]}, "authors": ["Robert J. Hutchinson"], "isbn": "0385486472", "longitude": 12.4829321, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s", "500-1400s"], "title": "When in Rome: A Journal of Life in Vatican City", "word_cloud": "insight swirl secretiveness wall secrecy protect offer insight aspect find interest third fourth modern rome offer fresh insight pleasant negative wonderfully fun interest information internal working world smallest country great visiting lazy people interested actual research good writing write extensively foyer attitude secretary simply bother explore get impression wife kick stupor make go supermarket bacon write month later kind regulatory experience realize low regulatory experience completely manipulate author attempt make look prepare trip pick impulse delightful funny lot interest information later watch special find know quite thing special cover reading interest chapter swiss tell status clergy base wear history maintenance men even chapter excavation include story doubt hear tour glad mark chapter husband well many light intend give personal account aspect author experience foreign country fit category particular emphasis planning trip consider along many excellent travel guide available help traveler generally much interesting lot fun provide great insight work time remind question ask many people actually work not rome many time still informative highly recommended planning first trip even experience traveler serve purpose provide enough detail story pick keep lay interested varied story widely enough provide wide angle portrait humorous thoughtful look place institution better worse center consciousness year advise good tour guide purchase visit utterly enjoy note certainly ultimate guide understand merely collection amuse anecdote journalist journalist opportunity live part world comment impression adapt accept instance move sole purpose writing summer vacation wife child practice already affinity innately experience here explore pure delight connection institution last year tumultuous change yet rock build invariably stay adventure sprinkle liberally slightly irreverent humor yes reviewer comment repeat instead look cynically faux pa think prodigal son excite tourist film projector fill slide return unknown merely thrill see experience barely contain exuberance visit share entertain story bone popes holy relic find entire refreshing breeze bring sound juxtaposes old new stylish sophisticated way recommend reading trip relish sensation tell interest rarely startle account payroll bus work day really bring time live really enjoy sarcastic view insider information recommend italophile", "genres": ["Memoir", "History", "Religion", "Travel Writing"], "summary": "Lighthearted and altogether fascinating, When in Rome is a delightful backstairs tour of one of the world's most mysterious and eccentric cities. With his wife and three young sons, Robert Hutchinson moved to Rome shortly before his thirty-ninth birthday, intending to explore the Vatican in depth. He sought to capture \"the personality of the place: the smells and the traffic, the rich delicacies of Roman food, the perils of the Italian language, the way Italian monsignori push their way to the front of the line, just like their lay countrymen.\" When in Rome is the extraordinary journal of his Roman sojourn.\r\n\r\nWith playful good humor, Hutchinson introduces the varied and colorful individuals who live and work in the Vatican. In the process, he explores the mysterious orders of medieval knights, some dating back to the First Crusade, which still play a vital role in the Vatican; explains how bumbling Vatican archaeologists found, and then lost, the bones of St. Peter; probes the sex lives of the popes, from the \"pornocracy\" of Sergius III to the incestuous orgies of Rodrigo Borgia; experiences high fashion in the Holy See, including a visit to the pope's personal tailor; encounters the weird relics of Catholicism, such as the mummified body of St. Pius X and a museum made entirely out of human bones; recounts the true story behind the True Cross, now kept in a run-down church near the Colosseum; and much, much more.\r\n\r\nHumorous, irreverent, but ultimately respectful, When in Rome does for the Vatican what A Year in Provence did for the French countryside, in an unforgettable and unprecedented eyewitness account of one of the most fascinating places on Earth.", "asin": "0385486472", "rank": "977054", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/41hlVA199RL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}