{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 678, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "this is a great story with a rich plot, wonderful use of the language with equal amounts of joy and pathos."}, {"review_sentiment": 4.0, "review_text": "It took some time for me to get into this novel, but once I did, I found it to be quite amazing. The characters are full and the long story is very interesting. I was surprised at the end!"}, {"review_sentiment": 3.0, "review_text": "I wanted to like The Blind Assassin more than I did because I've heard such amazing things about Margaret Atwood, but I think I started with the wrong book of hers.I definitely had a slow start with The Blind Assassin. I liked the writing but the story didn't draw me in until 75-100 pages in. However, I'm glad I stuck with it because as the story progressed and the pieces started fitting together, I ended up enjoying the book. I did have the ending pretty much figured out before it happened, but it all came together perfectly, and I did like the ending. I thought there was a little bit of revenge that Richard deserved.While this book wasn't my favorite, I'm definitely intrigued to read more by Atwood."}, {"review_sentiment": 4.0, "review_text": "Fluid plot and prose, yet can stall in places to sluggish, a little bit like the main character herself. The charactes and atmosphere are both colourful and relatable. Overall, an excellent read albeit a tragic one."}, {"review_sentiment": 5.0, "review_text": "Margaret Atwood creates extraordinary women characters, placed in situations that feel so familiar and true. Anyone who enjoyed The Handmaid’s Tale should consider The Blind Assassin, also Alias Grace."}, {"review_sentiment": 3.0, "review_text": "I don't know what made me say its ok. I just know I liked most of the book, however, I found quite a bit of repetition getting on my nerves. The last part of the book was great. A definite cliff hanger. well done."}, {"review_sentiment": 5.0, "review_text": "Full disclosure, haven’t read it yet so this review is not based on my opinion of the content or author. That being said I’ve never been disappointed with Atwood’s work.I received a brand new copy, as expected, in perfect condition. All pages intact, so far no issues found concerning the printing itself. Very satisfied with this purchase, considering I paid far less than the price listed on the back cover."}, {"review_sentiment": 5.0, "review_text": "So, this is what all the loud applause is about!!  If only I had known, I'd be swimming in Atwood titles by now."}, {"review_sentiment": 5.0, "review_text": "I absolutely adored this book! Even though I guessed the major \"twist\" fairly early on, it wasn't spoiled for me. Love love love love love!"}, {"review_sentiment": 4.0, "review_text": "A"}]}, "authors": ["Margaret Atwood"], "isbn": "0385720955", "longitude": -79.387207, "periods": ["1900s"], "title": "The Blind Assassin: A Novel", "word_cloud": "great story rich plot wonderful use language equal amount joy pathos take time get find quite amaze character full long story interesting surprise end want hear amaze thing think start wrong definitely slow start like write story draw page however glad stick story progress piece start fit together end enjoy end pretty much figure happen come together perfectly end think little bit revenge favorite definitely intrigue plot prose yet stall place sluggish little bit main character character atmosphere colorful repeatable overall excellent tragic create extraordinary woman character place situation familiar true enjoy also know make say ok know like however find quite bit repetition get nerve last part great definite cliff hanger well do disclosure yet base opinion content author say never disappoint receive brand new copy expect perfect condition page intact far issue find concern print very satisfied purchase consider pay far le price list back cover so loud know swim title absolutely adore even guess major twist fairly early spoil love love love love", "genres": ["Fiction & Literature", "Historical Fiction", "Science Fiction"], "summary": "The Blind Assassin opens with these simple, resonant words: \"Ten days after the war ended, my sister Laura drove a car off a bridge.\" They are spoken by Iris, whose terse account of her sister's death in 1945 is followed by an inquest report proclaiming the death accidental. But just as the reader expects to settle into Laura's story, Atwood introduces a novel-within-a-novel.\r\n\r\nEntitled The Blind Assassin, it is a science fiction story told by two unnamed lovers who meet in dingy backstreet rooms. When we return to Iris, it is through a 1947 newspaper article announcing the discovery of a sailboat carrying the dead body of her husband, a distinguished industrialist.\r\n\r\nBrilliantly weaving together such seemingly disparate elements, Atwood creates a world of astonishing vision and unforgettable impact.", "asin": "0385720955", "rank": "13410", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51edQ-RUewL.jpg", "country": "Canada", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}