{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 10, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Powerful novella with brief chapters about a love tragedy in Cairo, Egypt, with significant political and religious undercurrents. It all ends in September 1981, with the nation groaning from the effects of years of economic liberalization and a retreating state. The already privileged, the well-connected and the ruthless grow fabulously rich, many millions on fixed salaries lose out despite working second jobs. They cannot keep up with inflation. The novella is primarily about Elwan and Randa, who grew up together with their families’ apartments one on top of the other. They have been in love and engaged for 11 years, even have the same employer. Now that they are both 26, they still cannot afford to marry. They have only kissed.Their sad predicament affects everyone in their close circle of family and colleagues, incl. Elwan’s grandfather, who is fond of him and tries to lift his spirits with wisdoms from the Book. The now devout octogenarian— living in with his son & wife and grandson, passing his remaining days watching soaps on TV and reading the Book—is also keenly aware that Elwan and his parents live harsher lives in less hopeful times than he himself: when young, there was little opprobrium to fulfilling one’s natural desires, letting go, partying, drinking, consorting with warm and generous prostitutes (all sins to be atoned for in later life). It was also easier to find affordable housing and marry young. Grandfather is a Sufi Muslim and would love to be able to perform miracles for Elwan and everyone like him. Aware of his spiritual limits, he increasingly welcomes meeting the angel the Almighty sends to collect His every creation’s soul.One character pronounces solemnly that Egypt in 1981 truly hit rock bottom, it cannot get any worse. What a prophecy! During a recently-decreed National Holiday, live on TV,  Elwan’s frustration and fury finally explode. Then, nation-wide, TV-screens go dark, then the sounds of military march music, then chants from the Book…"}, {"review_sentiment": 4.0, "review_text": "My issues with this book are more with the edition than with the literary qualities of the work. First, I confess I was influenced by the blurb, particularly the words \"mischievous\" and \"irony,\" to believe this book was at least partly satirical in a humorous way. I didn't find it so at all. It is well-structured, with a narrative that draws the reader into its tension, even if some plot points are rather obviously foreshadowed. (If such obviousness was Mahfouz's intention, the book is that much gloomier.) The grandfather's mischief may have been in his youth, but not in the book's present tense. The irony perhaps lies less in the tone than in how the story of the individuals' difficulties in some way mirrors the country's.I have to say \"perhaps\" and \"in some way\" here, because even though I'm old enough to remember the Six Day War, Nasser and the Sadat assassination, much of the important historical background remains obscure to the uninitiated Western reader. E.g., the grandson continually laments his \"fallen hero,\" though it was never clear to me whether this was Nasser or someone else; various significant dates are referred to without explanation; and there are significant references by name to various other offstage persons without it always being clear whether they are historical or fictional. Yes I tried a search engine, but not always with success; and anyway, continual online searches really destroy the flow and pleasure of reading fiction. A simpler workaround would be a preface or afterword that briefly sketches the social and political context of the story. But Mahfouz's centenary has already come and gone (2011), so it's not clear what would motivate a re-issue of this work that would include such a helpful addition. All in all, a book I admired for its craft, but was not able to enjoy."}, {"review_sentiment": 5.0, "review_text": "I've got most of Mahfouz books in my library, really enjoy his works, lots of \"words of wisdom\" a fine and delicate \"connective tissue\" bridging past and present."}, {"review_sentiment": 4.0, "review_text": "A short novella, written from the viewpoints of three people on the eve of Anwar Sadat's assassination. Two lovers are separated by a poor economy that they both blame on Sadat's open market policy, while the suitor's grandfather provides a continuity with Egypt of the past. Well-written, the book packs a punch out of proportion to the slim book size."}, {"review_sentiment": 4.0, "review_text": "Always focusing on aspects of Egyptian social and political history, Nobel Prize-winning novelist Naguib Mahfouz here depicts three generations of one family as they try to survive the socially tumultuous period between the Six Day War with Israel in 1967 and the assassination of Anwar Sadat in 1981.  The loss of the Six Day War in 1967 was a national humiliation for Egypt, which lost the Sinai Peninsula and the Gaza Strip, as a result.  In 1973, President Anwar Sadat tried to regain the lost territories with a surprise attack that initiated the Yom Kippur War, but again Egypt failed to win a strong military victory.  Sadat's willingness to negotiate with the Israelis, however, resulted in the Egyptians' regaining of the Sinai Peninsula in exchange for Egypt's recognition of Israel and the establishment of normal diplomatic relations under the Camp David Accords. It made him very unpopular at home.This tumultuous period was also a time of enormous economic hardships.  Sadat had turned away from the Soviets, with whom Nasser had had a close association, and had established the Infitah, his attempt to establish a free-market economy in the desperately poor country.  As Elwan Fawwaz Muhtashimi, one of the main characters in this novel says, however, \"For this we cursed him, our hearts full of rancor.  Ultimately, he [Sadat] was to keep for himself the fruits of victory, leaving us his Infitah, which only spelled out poverty and corruption.  This is the crux of the matter.\"Alternating points of view among Muhtashimi Zayed, his grandson Elwan Fawwaz Muhtashimi, and Elwan's fiancée Randa Sulayman Mubarak, Mahfouz creates a novel which shows the domestic difficulties faced by educated Egyptian city-dwellers as they try to live their lives under this unpopular, less structured new economic system.  Elwan and Randa have been engaged for eleven years, unable to marry because Elwan's salary is too low for him to save enough for an apartment, furniture, and the expenses of a family.  Elwan and Randa both work for the same employer, and their relationship with each other and with their boss shows the stresses of their long engagement.  The interrelationships between their two families also become tense, and as each narrator describes his/her own feelings, Mahfouz speeds ahead with his story, which at times feels as if it is moving in double-time toward its ironic conclusion.Keeping the narrative firmly fixed on the everyday lives of his characters, Mahfouz shows the failures of the political system and the desperate acts to which some residents are driven by circumstance.  Though the novella is short, Mahfouz provides a rare and often ironic vision of life in Cairo during the period which concludes with Anwar Sadat's assassination.  As Elwan walks in the city that night, he sees\" a trace of death on every passerby,\" but as he thinks about the assassination, he believes that \"Tomorrow cannot be worse than today.  Even chaos is better than despair.\"  n  Mary WhippleAkhenaten: Dweller in Truth A NovelThe Mirage: A Modern Arabic Novel (Modern Arabic Novels)Karnak CaféMorning and Evening Talk"}, {"review_sentiment": 5.0, "review_text": "The Day the Leader Was Killed by Naguib Mahfouz(translated by Malak Mashem), (orig. pub. in 1985).This is a slender novel by Mahfouz, only 103 pages. Mahfouz is one of the greatest writers of the Middle East in recent times. He was recognized for his accomplishment with the Nobel Prize in Literature. Almost anyone in the Middle East you talk to knows of him. He died only this year. It was, in fact, primarily through him that the novel as a form of writing was introduced into the Middle East. And O, how richly! The warmth and humane eye of his novels ponders the streets of Cairo, Egypt, the lives and loves and struggles and sorrows of humanity in the alleys and streets and behind the closed doors. The universal commonality of people is clearly brought to the fore in his deft works.I don't care to make this a lengthy and needless praise. My purpose here is to hopefully bring to mind some of the noble and lovely, etc. things for for at the least my fuller contemplation.The story is exquisitely told. It is about the love of a working age couple under the stresses of poverty and political unrest in Egypt. Each chapter alternates between three characters, Elwan and Randa and Elwan's grandfather, Mutashimi Zayed.The grandfather in the story is a pious Sufi Muslim that has had a wild past. The kind of sweetness and stress on universal love in Sufi Islam comparative to the moreaustere and stern and miltant strains seems to be reflected in Mahfouz's books in general, but that is just a guess.This book is a fine piece of art. It takes a writer like Mahfouz to be able to find the exact sentences with which to somehow evoke depth of emotion in his characters and the corresponding resonance in his readers in so few words. It takes a truly praiseworthy elegance of mind to trace the inner thoughts and lives of these three characters in a way that really captures depth and dimension, passion and sweetness, anger and despair, not just in them but also in the peripheral characters through their eyes.There is something about Mahfouz's writings that is like a kind of sunlit illumination. I don't mean this sentimentally. First there is his broad eye which is reminiscent of Tolstoy for how much he takes in and the deft verisimilitude with which he paints a picture of the lives in his story. And there is the soulful focus on people. People are central to his writings. By the sunlit I mean this kind of attention to each person, even to the villains, that somehow is soft like the light of sunset. There is a kind of benevolence and knowing in his novels. He sees a great deal and does not hesitate to portray the dark motives and the evil behaviors but he treats all with a dignity so that there is a kind of perspective that is not inimical to the command to love ones enemies.This book was also for me a chance to reflect on the exterior pressures such as finances and family on love. The portrayal of poverty and the sense of its oppressiveness and strain was also made more palpable. Elwan was not able to make enough money to pay for a flat and so he had to postpone marrying Randa until her parents began to intervene and her lecherous and ambitious boss sought to make the most of the opportunity and to enlist her in his project like a useful item rather than an end in herself. The dignity and the pride and humbleness in the midst of poverty is portrayed in a moving way in these characters, each with their perspectives and cares and perceptions and emotions. The grandfather's love for his grandson as he is nearing the end of his life with the distance of age is also movingly depicted.Reading a book on the Triune God and going in increasingly rarified air, it was a true respite to turn to this novel on a sleepless night.Such a novel I think depicts simply and elegantly and truthfully something that is often denied now, put out of mind as strange and foreign, or even militantly and openly attacked, the perception that men and women have natures, that love can grow up naturally and more or less purely between them, and that these routes can be abandoned by warping ways that effect our character, such as ambition, which stifles and paves over the possibility of true love in a man or woman's breast, by solidified ways of thinking and basing their life which negate the other, the Thou, preventing the fullness of the I and Thou relationship. It is in this sense a good and gentle reminder of the natural and a beacon to seek it. One of the sins condemned in Romans 1 is the lack of natural affection (such as a mother who abandons her baby). C.S. Lewis discusses this concept as it was conveyed in an archaic meaning of the word kinde in a poem by George Herbert:\"In Herbert's `I the unkinde, ungratefull' (from Love) the modern meaning would be disastrous; the idea of general beneficence fromman to God borders on the absurd. Herbert is classing himself with `unkind mothers' and `unnatural children' as one who, with gross insensibility, makes no response to the arch-natural appeal of the tenderest and closest personal relation that can be imagined; one who is loved in vain.\" -C.S. Lewis, Studies in Words, p. 32-33.This is what I think of when I think of the effects of idolatry, on me and on others. The plastering over of natural affections, the replacement of them with void and drugs and distractions, with buzz and squirminess and shallow vapidity in the presence of the profound and lovely and whole.In every country it seems there are always those growing up who view their country with a canny eye, who love the people and life they know enough to caressingly portray truth about it, granted with the imperfection and limitation of man. But they are always signs, it seems, to point us all, any who will heed, to truths which are plain to all except when pushed out by idolatry."}, {"review_sentiment": 4.0, "review_text": "The Day the Leader Was Killed is a succinct but significant work in contemporary Egypt. Naguib Mahfouz, through his sober and lyrical prose, has skillfully woven one of the darkest political backdrops in Egyptian history into his novel. Sealing off the seventies and reaching the threshold of a new decade, President Anwar al-Sadat implemented the Infitah, an open-door economic policy that would expedite the country forward to modernization. Like many of Mahfouz's works, this story is told in alternating first-person narratives by three characters--Muhtashimi Zayed, a pious, retired family patriarch; his grandson Elwan Fawwaz Muhtashimi; and Elwan's strong-willed, beautiful fiancée Randa Sulayman Mubarak. The story builds upon around this middle-class family and through the family's perspective zooms a picture of the social, economic, religious, gender and interpersonal aspects of the larger society in Egypt. For the patriarch, who devoted his whole life to prayers and religious rituals, his life was nothing but loneliness. He was especially despondent that the younger generation drifted from the Koran to whose life made a substantial influence. The old man could not forget \"the woes of the world\" (25) when he thought of his beloved grandson. Randa, like all her female contemporaries, faced gender challenges and the clash between traditional values and modern ideals.The novelette evokes the assassination of Egyptian president Anwar Sadat on October 6, 1981. Sadat was saluting troops at the annual military parade when a team of assassins began firing weapons and throwing grenades into the reviewing stand. Sadat, along with 20 others was instantly killed in the deadly attack. The underlying cause of the fatal massacre traced back to the Camp David Accords between Israel and Egypt in 1978, which led to a negotiated peace between the two countries in the following year. The historic agreement brought peace to Egypt but no prosperity. The economy still slumped with no trace of a turn-around. Poverty-stricken Muslims and Copts in Egypt rubbed in friction and exploded into some gruesome round of violence in the Cairo slum. This is the very socioeconomic backdrop on which Mahfouz adroitly set his novel. Like the Cairo Trilogy and many of his works, Mahfouz captures and chronicles the most crucial of his own times. 4.0 stars."}, {"review_sentiment": 4.0, "review_text": "\"The Day the Leader Was Killed,\" by Naguib Mahfouz, has been translated into English by Malak Mashem. The short author bio on the book's opening page notes that Mahfouz was born in Cairo, has received the Nobel Prize in literature, and \"is the most prominent author of Arabic fiction published in English today.\"This novel takes place during the \"Infitah,\" an \"open-door\" economic policy in place under Egyptian President Sadat. The story is told in alternating first-person chapters by three characters: Muhtashimi Zayed, a retired old man; his grandson Elwan; and Elwan's fiancee, Randa. Both Elwan's and Randa's families face economic troubles, and the young couple faces uncertainty regarding their own future.This novel is a fascinating look at modern Egyptian family life. I found it interesting that while the book deals with three generations of Egyptians, it is only characters from the youngest and oldest generations that actually \"speak\" directly to the reader. Mahfouz looks at the issues of gender, economics, religious faith, and family ties in the lives of these two families and the larger community. I was particularly moved by Mahfouz's portrayal of the old man's spiritual life; Muhtashimi Zayed is a Muslim in whose life the Quran is an important element. I was also intrigued by Mahfouz's exploration of the challenges faced by the modern young Arab woman, caught between contemporary ideals and traditionalism. Overall, a compelling multigenerational portrait."}, {"review_sentiment": 5.0, "review_text": "Najib Mahfouz in his compact dry story details the hardships faced by the people of Egypt from the economic liberation. Intifah, Anwar Sadat's open-door economic policy has increased disparities between the rich and poor, creating havoc in lives of its citizens. In this economic meltdown is Fawad and his fiance Randa whose commitment for each other is tested by realities of times.In a subtle undertone, this novel has reflections to the struggle faced by masses presently in the middle east. Interesting aspect of this novel are the personal battles faced between self righteousness vs corruption, advancements vs traditions."}, {"review_sentiment": 5.0, "review_text": "Once again, Mahfouz in THE DAY THE LEADER WAS KILLED gives us a great story reflecting contemporary life in Egypt.  He captures the reader's mind and leads the reader to empathize with the sentiment and emotion of the  characters who encounter life during the time of INFITAH."}]}, "authors": ["Naguib Mahfouz"], "isbn": "0385499221", "longitude": 31.243666, "periods": ["1900s"], "title": "The Day the Leader Was Killed", "word_cloud": "powerful novella brief chapter love tragedy significant political religious undercurrent end nation groan effect year economic liberalization retreat state already privileged ruthless grow fabulously rich many million fixed salary lose work second job keep inflation novella primarily grow together family apartments top love engage year even employer now still marry sad predicament affect everyone close circle family colleague incl fond try lift spirit wisdom book devout live son wife grandson pass remain day watch soap tv reading also keenly aware parent live harsher life le hopeful time young little opprobrium fulfil natural desire let go party drinking consort warm generous prostitute sin atone later life also easier find affordable housing marry young able perform miracle everyone spiritual limit increasingly welcome meet sends collect creation character pronounces solemnly truly hit rock bottom worse prophecy live tv frustration fury finally then dark sound military march music chant issue edition literary quality work first confess influence blurb particularly word mischievous irony believe least partly satirical humorous way find narrative draw tension even plot point rather obviously foreshadow obviousness intention much gloomier grandfather mischief present irony perhaps lie le tone story individual difficulty way mirror say perhaps way even old enough remember assassination much important historical background remain obscure uninitiated western grandson continually lament fall hero never clear someone else various significant date refer explanation significant reference name various offstage person always clear historical fictional yes try search engine always success anyway continual online search really flow pleasure read fiction simpler workaround afterword briefly sketch social political context story centenary already come go clear work helpful addition admire craft able enjoy get library really work lot word wisdom fine delicate connective tissue bridge past present short novella write viewpoint people eve assassination lover separate poor economy blame open market policy suitor grandfather provide continuity pack punch proportion slim size always focus aspect egyptian social political history novelist depict generation family survive socially tumultuous period assassination loss national humiliation lose result try regain lose territory surprise attack initiate fail strong military victory willingness negotiate however result regain exchange recognition establishment normal diplomatic relation make unpopular tumultuous period also time enormous economic hardship turn close association establish attempt economy desperately poor country main character say however curse heart full rancor ultimately fruit victory leave spell poverty corruption crux matter alternate point view grandson fiance create show domestic difficulty face educated egyptian try live live unpopular le structured new economic system engage eleven year unable marry salary low save enough apartment furniture expense family work employer relationship bos show stress long engagement interrelationship family also become tense narrator describes feeling speed ahead story time feel move ironic narrative firmly fix everyday live character show failure political system desperate act resident driven circumstance novella short provide rare often ironic vision life period conclude assassination walk city night see trace death passerby think assassination believe worse today chaos better despair n talk translate slender page greatest writer recent time recognize accomplishment anyone talk know die year fact primarily write introduced richly warmth humane eye novel ponders street live love struggle sorrow humanity alley street closed door universal commonality people clearly bring fore deft care make lengthy needle praise purpose hopefully bring mind noble lovely etc thing least fuller story exquisitely tell work age couple stress poverty political unrest chapter alternate character grandfather story pious wild kind sweetness stress universal love comparative more austere stern militant strain seem reflect general fine art take writer able find exact sentence somehow evoke depth emotion character correspond resonance reader word take truly praiseworthy elegance mind trace inner thought live character way really capture depth dimension passion sweetness anger despair also peripheral character something writing kind sunlit illumination mean sentimentally broad eye reminiscent much take deft verisimilitude paint picture live story soulful focus people people central writing sunlit mean kind attention person even villains somehow soft light sunset kind benevolence knowing novel see great deal hesitate portray dark motif evil behavior treat dignity kind perspective inimical command love one also chance reflect exterior pressure finance family love portrayal poverty sense oppressiveness strain also make palpable able make enough money pay flat postpone marry parent begin intervene lecherous ambitious bos seek make opportunity enlist project useful item rather dignity pride humbleness midst poverty portray move way character perspectives care perception emotions grandfather love grandson near end life distance age also movingly go increasingly ratify air true respite turn sleepless think depicts simply elegantly truthfully something often deny put strange foreign even militantly openly attacked perception men woman nature love naturally le purely route abandon warp way effect character ambition stifle pave possibility true love man woman breast solidified way think base life negate prevent fullness thou relationship sense good gentle reminder natural beacon seek sin condemn lack natural affection mother abandon baby discuss concept conveyed archaic meaning word kind poem unkind ungrateful modern meaning idea general beneficence frogman border absurd class mother child gross insensibility make response appeal tenderest closest personal relation imagine love vain think think effect idolatry others plaster natural affection replacement void drug distraction buzz quirkiness shallow vapidity presence profound lovely country seem always grow view country canny eye love people life know enough cares singly portray truth grant imperfection limitation man always sign seem point truth pushed idolatry succinct significant work contemporary lyrical prose skillfully woven darkest political backdrop egyptian history seal seventy reach threshold new decade implement economic policy country forward modernization many work story tell alternate narrative character pious retire family patriarch grandson beautiful fiance story build family family perspective zoom picture social economic religious gender interpersonal aspect larger society patriarch devote whole life prayer religious ritual life nothing loneliness especially despondent younger generation drift life make substantial influence old man woe world think beloved grandson female contemporary face gender challenge clash traditional value modern novelette evokes assassination president salute troop annual military parade team assassins begin fire weapon throw grenade review stand others instantly deadly attack underlying cause fatal massacre trace back lead negotiated peace country follow year historic agreement bring peace prosperity economy still slump trace rub friction explode gruesome round violence slum socioeconomic backdrop adroitly set many work capture chronicle crucial time star translate short author open page note born receive literature prominent author fiction publish english today take place economic policy place story tell alternate chapter character retire old man grandson fiancee family face economic trouble young couple face uncertainty regard fascinate look modern family life find interesting deal generation character youngest oldest generation actually speak directly look issue economics religious faith family tie live family larger community particularly move portrayal old man spiritual life life important element also intrigue exploration challenge face modern young woman catch contemporary ideal traditionalism overall compelling multi generational portrait compact dry story detail hardship face people economic liberation economic policy increase disparity rich poor create havoc life citizen economic meltdown fiance commitment test reality subtle undertone reflection struggle face mass presently middle east aspect personal battle face righteousness v corruption advancement v tradition once give great story reflect contemporary life capture mind lead sentiment emotion character encounter life time", "genres": ["Fiction & Literature"], "summary": "From the Nobel Prize laureate and author of the acclaimed Cairo Trilogy, a beguiling and artfully compact novel set in Sadat's Egypt.\r\n\r\nThe time is 1981, Anwar al-Sadat is president, and Egypt is lurching into the modern world. Set against this backdrop, The Day the Leader Was Killed relates the tale of a middle-class Cairene family. Rich with irony and infused with political undertones, the story is narrated alternately by the pious and mischievous family patriarch Muhtashimi Zayed, his hapless grandson Elwan, and Elwan's headstrong and beautiful fiancee Randa.  \r\n\r\nThe novel reaches its climax with the assassination of Sadat on October 6, 1981, an event around which the fictional plot is skillfully woven. The Day the Leader Was Killed brings us the essence of Mahfouz's genius and is further proof that he has, in the words of the Nobel citation, \"formed an Arabic narrative art that applies to all mankind.\"\r\n\r\n\"A Dickens of the Cairo cafes.\" Newsweek", "asin": "B0020MZ83A", "rank": "14731339", "city": "Cairo", "image": "", "country": "Egypt", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}