{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 100, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Wonderful book. Very worthwhile reading."}, {"review_sentiment": 4.0, "review_text": "Very good book , America,s history. Worthy to read"}, {"review_sentiment": 5.0, "review_text": "extremely informative book! Filled with \"never knews\"..."}, {"review_sentiment": 5.0, "review_text": "Arrived in a timely fashion. Product was described perfectly. Better than expected. Packaging was well done and did not damage the paperback book."}, {"review_sentiment": 5.0, "review_text": "Despite perplexing use of the hyphen and mistakes confusing the words gentile and genteel I loved this book. The early tales of the studios founders is a great read. But the book really comes into its own when the nasty politics begin to take a toll on the Studios. While many of the film executives were almost deaf to Hitler and his murder of Jews, the national swing to the right and paranoid fear of communists came close to destroying the studios. The studio heads cooperated with the HUAC and betrayed the writers and directors genius and creativity was responsible for the decades of profit for studio bosses. The studio heads had the hubris to pretend that they were the creative force in what a become a reflection of American culture and a major economic contributor to American prosperity. But their refusal to unionize and their refusal to accommodate the Screen Writers Guild in many ways contributed to the downfall of their empire."}, {"review_sentiment": 5.0, "review_text": "Dr. Boyce Watkins recommended this book and he couldn't have been more right.  Absolute perfection."}, {"review_sentiment": 3.0, "review_text": "my family  member  actress dorothy  dandridrige  got a good taste  of racist jewish white supremacy,was originally chosen to  portray 'cleopatra\" in the original hollyweird movie...until abruptly  a little  known actress  white actress  names  'elizabeth  taylor'  was  eventually chosen to replace our cousin dorothy....a  beautiful,talented and  sexy  woman  who  represented 'cleopatra' more closely than elizabeth taylor a caucasian did.....dorothy was  the first  african  nominated for an academy  award...the women in my family are all truly beautiful,,my own mother,, dorothy's first cousin did modeling when we were kids...my mother modeled the 'camelot'  jackie kennedy ensemble  and knocked them dead. pillbox hat,long gloves,heels,and flowing dress,us  she was  just 'mom'.......google  'mostafa hefny black eygptian'....to see  first  hand  how white supremacy tries to  co opt and  appropriate any  black accomplishments as white  even  using  their racist government  i.e. directive 15 omb...[ office of management and budget \\.......god is  not  mocked...A  M  E  R  I  C  A =  I  A  M  E  R  I  C  A....  [ rearrange the word america ]...."}, {"review_sentiment": 4.0, "review_text": "Very very very complete, but it started drag just bit at the 350 page mark..."}, {"review_sentiment": 5.0, "review_text": "Great book"}, {"review_sentiment": 3.0, "review_text": "Gabler's book may be OK (barely, in my opinion), especially if this is the first (and likely the last) book you'll read about Hollywood in the classical, \"studio system\" age, but, after the opening chapters, where the Jewish immigrant roots of the early Hollywood movie entrepreneurs are laid out, his approach doesn't add much.  For a much better book covering the same period, I recommend \"The Genius of the System: Hollywood Filmmaking in the Studio Era\" by Thomas Schatz (albeit limited to a more comprehensible, in-depth, comparative study of MGM, Warners, Universal, and Selznick International).  Other good books to \"get used to the water\" regarding this era include Budd Schulberg's \"Moving Pictures: Memories of a Hollywood Prince\" and Irene Mayer Selznick's \"A Private View.\"  And, there are useful memoirs/biographies on many directors: Frank Capra, Elia Kazan, and Billy Wilder, and the influential MCA agent/talent packager Lew Wasserman (for the business side of Hollywood from the 50s through the 90s, after the classical \"studio system\" age."}]}, "authors": ["Neal Gabler"], "isbn": "0385265573", "longitude": -118.244476, "periods": ["1900s", "Recent Releases"], "title": "An Empire of Their Own: How the Jews Invented Hollywood", "word_cloud": "wonderful very worthwhile reading very good history extremely informative fill never knee timely fashion describe perfectly expect well do damage paperback perplex use hyphen mistake confuse word gentile genteel love early tale studio founder great really come nasty politics begin toll many film executive almost deaf murder national swing right paranoid fear communist come close destroy studio studio head cooperate betray writer director genius creativity responsible decade profit studio boss studio head hubris pretend creative force become reflection american culture major economic contributor american prosperity refusal unionize refusal accommodate many way contribute downfall recommend perfection family member actress dorothy dandridrige get good taste racist jewish white supremacy originally choose portray original holly weird movie abruptly little known actress white actress name taylor eventually choose cousin dorothy beautiful talented sexy woman represent closely elizabeth taylor caucasian first african nominate academy award woman family truly beautiful mother dorothy first cousin model kid mother model jackie kennedy ensemble knock dead pillbox long glove heel flow dress hefty black eygptian see first hand white supremacy try co opt appropriate black accomplishment white even use racist government directive omb office management budget mock c c rearrange word america very complete start drag bit page mark great barely opinion especially first likely last classical studio system age open chapter jewish immigrant root early movie entrepreneur lay approach add much much better cover period recommend limited comprehensible comparative study other good get use water regard era include useful many director influential packager business side classical studio system age", "genres": ["History", "Film"], "summary": "A provocative, original, and richly entertaining group biography of the Jewish immigrants who were the moving forces behind the creation of America's motion picture industry. \r\n \r\nThe names Harry Cohn, William Fox, Carl Laemmle, Louis B. Mayer, Jack and Harry Warner, and Adolph Zucker are giants in the history of contemporary Hollywood, outsiders who dared to invent their own vision of the American Dream.  Even to this day, the American values defined largely by the movies of these émigrés endure in American cinema and culture. \r\n\r\nWho these men were, how they came to dominate Hollywood, and what they gained and lost in the process is the exhilarating story of An Empire of Their Own.", "asin": "0385265573", "rank": "127224", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51WQxF5stdL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}