{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 3021, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "For anyone who needs a new outlook on life, this is the book for you. Vonnegut offers the reader a new way of thinking as well as an incredible account of historical fiction."}, {"review_sentiment": 4.0, "review_text": "Kurt Vonnegut’s Slaughterhouse-Five is a postmodern work with writing that is straightforward and unadorned in style and with a structure that is as blurred and fluid as the Tralfamadorian idea of time. The novel is set in Germany, in upstate New York, and on the foreign planet of Tralfamadore, and the author continually draws the reader’s attention to the fact that he or she is reading a book. With a peripheral first person narrator combined with third person omniscient perspective, authorial interjections, and a form and content that tangle around one another, the tale is experimental, absurd, and brilliant. An autobiography, a war drama, and science fiction, Slaughterhouse-Five is blunt, grim, ironic, and darkly humorous.Slaughterhouse-Five follows clownish Billy Pilgrim from optometry school to the Battle of the Bulge, where he is captured by the Germans and eventually transported to a POW camp in an abandoned slaughterhouse in Dresden. Billy Pilgrim’s experience as a prisoner of war and survivor of the infamous, horrific, and long-classified firebombing of Dresden is an echo of that of the author’s. Upon the war’s end and liberation, Billy Pilgrim attempts to return to civilian life, marries, has a nervous breakdown, fathers two children, and survives both a plane crash and an alien abduction. The events of Pilgrim’s life and experiences are told in an extreme non-linear fashion that jumps in time and is posited as all happening simultaneously. Time, as his alien captors inform him, is but an illusion:  separate, eternal, and happening in the same instance as every other moment.With equal eloquence and madness, Vonnegut presents a narrative that is stripped down to action. The story is stark and sparse with very little description and an utter lack of sympathy toward emotion. Even so, Vonnegut’s most famous work is a heartrending glimpse into the mind of a man struggling to rebuild himself after the horrors of war. Free will is nonexistent, and people are continually trapped in life—by government edicts, by chains, by family, by social expectation. The character of Billy Pilgrim is a witness to the pain and drudge and horror of life. Unable to face that futility and helplessness, he escapes into the world of science fiction.Slaughterhouse-Five is bitingly and unapologetically an anti-war novel, first published in 1969, when the public still felt the repercussions of WWII and were appalled by the war in Vietnam. The author himself was a man shaped and haunted by his experiences in war. Vonnegut posits that war is fought by fools and children and that righteous self-assurance and the arrogance of morality are dangerous and often spawns of war.There are no heroes in this story, and the villains are those who romanticize and glorify violence. Slaughterhouse-Five explores the injustice of suffering and how cruelty is a side effect of war. Helplessness, disconnection, and confusion abound. “So it goes.”__________RecommendationHighly recommended for fans of postmodern, absurdist literature and for those interested in the artistic offshoots of WWII"}, {"review_sentiment": 5.0, "review_text": "I enjoyed the novel just as much this time as when I first read it in the seventies. Kurt Vonnegut is the master of pairing the bizarre and the hilarious with the tragic and violent. It is difficult to imagine a more imaginative and dramatic way of depicting the fire-bombing of Dresden."}, {"review_sentiment": 4.0, "review_text": "The cover is very thin and cheap looking, but looks ok"}, {"review_sentiment": 5.0, "review_text": "It's a long-famed classic, but somehow I'd never picked Slaughterhouse Five up to read before - nor had I seen the movie. As one of those gaps in my reading, I was keen to see what the fuss was about, and a chance find of the paperback in a local shop sealed the deal.Slaughterhouse Five defies the usual structure of writing, following the story of Billy Pilgrim - and in part the author too - as he comes unstuck in time. While the author treads to tell the tale of the bombing of Dresden in World War Two, Pilgrim's story zigzags through time, sometimes finding himself on the fields of war, sometimes finding himself as a caged exhibit in a distant alien zoo, sometimes experiencing the mundane parts of his life as an optometrist. It's like the author has taken three decks of cards - one for each of those parts of Pilgrim's story - and riffle shuffled them into one stack.There's wry humour here alongside the horror of the war as Pilgrim meets all kinds of people, many of whom are not long for this world, and each death in the book capped off with the words \"So it goes\". It's remarkable how laconic the narrative is as it deals with such nightmares, but it still hits home.I'm not sure what expectations I had when I picked this book up - but it certainly exceeded them. I might have wished for more in the alien aspects of the story, as they in some ways feel rather whimsical and not explored as much as they could be, but that's a minor complaint. It's a smashing book, and one that opens your eyes to the realities of war in ways you might not anticipate."}, {"review_sentiment": 3.0, "review_text": "For anyone who needs a new outlook on life, this is the book for you. Vonnegut offers the reader a new way of thinking as well as an incredible account of historical fiction. I would recomend it to anyone"}, {"review_sentiment": 4.0, "review_text": "The book was unusual, -weird- but so was the cruel lives of the prisoners of war of World War 2."}, {"review_sentiment": 4.0, "review_text": "Great book. Good shape, but very small."}, {"review_sentiment": 4.0, "review_text": "I listened to the audiobook performed by James Franco which was great. I have been into listening to books I have already read recently (1984, Moby Dick, Red Badge of Courage) as a way of coming back to stories that seem relevant today.  I started Slaughter House Five right after The Things They Carried. Both books have such a great dead panned view of the absurdity and inhumanity of war.  There were parts of the book that were a little to silly for me but overall it was a pleasure to revisit this satire in our own crazy time."}, {"review_sentiment": 5.0, "review_text": "Difficult to describe but I liked it. Very much (:Extra words so I can submit:Love Dash Cellar Door"}]}, "authors": ["Kurt Vonnegut"], "isbn": "0385333846", "longitude": 0.0, "periods": ["1900s"], "title": "Slaughterhouse-Five: A Novel (Modern Library 100 Best Novels)", "word_cloud": "anyone need new outlook life offer new way think well incredible account historical fiction postmodern work write straightforward unadorned style structure blur fluid idea time set upstate foreign planet author continually draw attention fact read peripheral first person narrator combine third person omniscient perspective authorial interjection form content tangle tale experimental absurd brilliant autobiography war drama science fiction blunt grim ironic darkly follow clownish optometry school capture eventually transport camp abandon slaughterhouse experience prisoner war survivor infamous horrific firebomb echo author war end liberation attempt return civilian life marries nervous breakdown father child survive plane crash alien abduction event life experience tell extreme fashion jump time posit happen simultaneously alien captor inform illusion separate eternal happen instance equal eloquence madness present narrative strip action story stark sparse little description utter lack sympathy emotion even famous work heartrending glimpse mind man struggle rebuild horror war nonexistent people continually trapped government edict chain family social expectation character witness pain drudge horror life unable face futility helplessness escape world science bitingly unapologetic ally first publish public still felt repercussion appal war author man shape haunted experience war posit war fought fool child righteous arrogance morality dangerous often spawn hero story villain glorify violence explores injustice suffer cruelty side effect war disconnection confusion recommend fan postmodern absurdist literature interested artistic offshoot wwii enjoy much time first seventy master pair bizarre hilarious tragic violent difficult imagine imaginative dramatic way depict cover thin cheap look look ok classic somehow never pick see movie gap reading keen fuss chance find paperback local shop seal defies usual structure write follow story part author come unstuck time author tread tell tale bombing story zigzag time sometimes finding field war sometimes find caged exhibit distant alien zoo sometimes experience mundane part life optometrist author take deck card part story riffle shuffle wry humor horror war meet kinds people many long world death cap word so go remarkable laconic narrative deal nightmare still hit sure expectation pick certainly exceed alien aspect story way feel rather whimsical explore much complaint smash open eye reality war way anyone need new outlook life offer new way think well incredible account historical fiction anyone unusual cruel live prisoner war good shape small listen audio book perform great listen already recently way come back story seem relevant today start right carry great dead pan view absurdity inhumanity war part little silly overall pleasure revisit satire crazy time describe like very much word submit", "genres": ["Fiction & Literature", "Historical Fiction", "Science Fiction", "WWII", "Satire"], "summary": "Slaughterhouse-Five, or The Children's Crusade: A Duty-Dance with Death (1969) is a satirical novel by Kurt Vonnegut about World War II experiences and journeys through time of Billy Pilgrim, from his time as an American soldier and chaplain's assistant, to postwar and early years. It is generally recognized as Vonnegut's most influential and popular work. \r\n\r\nA central event is Pilgrim's surviving the Allies' firebombing of Dresden as a prisoner-of-war. This was an event in Vonnegut's own life, and the novel is considered semi-autobiographical", "asin": "0385333846", "rank": "1478", "city": "Dresden", "image": "https://images-na.ssl-images-amazon.com/images/I/41jp-9I57KL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}