{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 6, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Michael Redhill's \"Consolation\" is the kind of book that needs a book prize award to draw the attention of readers and though it didn't win big, it was longlisted for the Man Booker Prize in 2007. And what a wonderfully written novel it is. There's wondrous poetry and a certain rather attractive lyricism to Redhill's prose that makes \"Consolation\" such a pleasure to spend one's precious hours with.There are two stories running alongside each other here, a back story of immense romanticism and interest that testify to the pioneering spirit of early immigrants into the North American continent in the 19th century, fore grounded by a rather bitter and strident cast of present day characters trying to come to terms with a family suicide and professional disgrace connected with a shipwreck theory that beneath the construction site for a sports arena lies tangible evidence of certain photographic plates carrying pictures of old Toronto. The suicide's guilt ridden widow Marianne, tries to vindicate the belief of her deceased husband, against the strong objection of her daughter who urge letting bygones be bygones, by holing herself in a hotel room overlooking the site hoping to get government approval to unearth archaelogical evidence to clear her husband's name. As it turns out, her prospective son-in-law holds the key to the mystery surrounding her husband's death.Surprisingly but then perhaps not, it is the back story set in the 19th century of English apothecary Jem Hallam's sojourn westwards in search of a better life, his capitulation to rivals controlling the trade, his life transforming chance meeting with Ennis and Claudia, that would enthrall and hold me captive throughout. This back story is so gloriously life affirming and poignant, its characters so well formed, human and believable, the present day story becomes an unwelcome distraction.  The plot is static, the prose sometimes obscure or terse, and the characters unaccountably bad tempered and unsympathetic. I couldn't wait to get back to Hallam's story every time the narrative switched back to the present.\"Consolation\" is only marred by a denouement that promised much but sadly disintegrated into a muddy mess. I must have missed something if other readers didn't also go \"huh\" ?? Despite this, \"Consolation\" is a tremendous piece of work I enjoyed very much and would highly recommend to other readers of serious fiction."}, {"review_sentiment": 5.0, "review_text": "My mother recommended this novel to me not long before she died, so it will have a bittersweet memory to it as long as I live.  Neither she nor I have ever been to the mighty city it illuminates so gravely, Toronto, but maybe that fact added to the childlike wonder and mystery with which poet Michael Redhill has composed his story.  There is something Oz like, something Byzantian, to the life history of any great city, and Redhill piles this sense on thick, at the same exact time as his narrative becomes literally a place of deconstruction.  This leads to a peculiar sense of being given something wonderful, and of losing something equivalent, as the novel's plot seesaws back and forth between the present day and the world of early Ontario, back in the 1850s when a hardy band of winterized pioneers were making a mini-England out of a cursed and chilblained landscape.  Not to mention that it was the early days of photography, an infant art that, in recent years, has seen a huge market constructed around it, so that everyday photographs, not only \"art\" photography, of a certain era has been widly prized behind its makers' wildest dreams.On top of which, CONSOLATION has the rich characters and the exotic spectrum of histories churning that animated Pasternak's DOCTOR ZHIVAGO or indeed Tolstoy's ANNA KARENINA.  If i turn to Russian models to get at my experience of living through CONSOLATION, maybe it is because Redhill's novel has a moral authority that haunts the reader long after he or she has finished the very last page.  Up until then we have been anxiously awaiting the results of a mystery--so the photos exist, the photos that researcher David Hollis staked his professional reputation on?  A ring of photos that, laid end to end, would represent the old city of Toronto, circa 1850, like the mirrors on the edge of a revolving music box?  Marianne, his widow, thinks she has it figured out, and she's waiting grimly as one of those mariners wives of the 19th century, stalking her widow's walk from her hotel room overlooking the construction of a new civic area.  She's a fascinating character, but from one perspective more than a little mad.  In this she is a true daughter of Canada, as we see from the grand, operatic switch to the daily life of Jem Hallam, the man who might have taken the photos.Hallam is a brilliantly drawn character, vulnerable, talented, generous, superstitious, given to strange bouts of obsession and drawn to all the \"wrong\" elements in life.  He is the exemplar of the early settlers of Canada, the men and women whom fate drew together to form a city.  His relationship with the master photographer under whom he serves as apprentice, and with the master's assistant, the beautiful Claudia, serve as wheels to propel his story closer and closer to what seems like an inevitable heartbreak.  I was just about four fifths through with the story when I realized where I had heard the name of the author, Michael Redhill, before.  He is one of the editors of BRICK magazine in Canada, and I had had some e-mail dealings with him about fifteen months ago.  Why did he not mention he had CONSOLATION coming up around the corner?  You know how US authors don't miss a trick, and they'll turn their e-mail \"signatures\" into living, Vegas, adverts for their novels!  I thought of CONSOLATION also while looking at Edweard Muybridge's panoramic photos of San Francisco (1877-1878), of course a far later epoch of photography than the one Redhill handles.  I won't spoil the ending for you but be prepared, you're in for one of those grand, satisfying finales."}, {"review_sentiment": 4.0, "review_text": "Michael Redhill's novel Consolation is a book with several faces. It is a miniature history of the city of Toronto, a mystery of the non-murder sort, and a touching character study that focuses on the attempts of two groups of people, separated by more than a century, who are forced to deal with life's adversities when they least expected to have to do so.David Hollis is a university historian, a late twentieth century man obsessed by his city's history and the people who lived in it before him. He has become convinced that a complete set of the earliest photographs ever taken of the city of Toronto was lost in a storm just offshore and that they are now buried under streets built on reclaimed land that was once part of Lake Ontario. He has dedicated his life to identifying the Toronto of the 1850s that is hidden by the Toronto of today, but when he finds that he has Lou Gering's disease he knows that he has little time left to convince anyone of authority to help him find the lost photographic plates.Jem Hallam is newly arrived in the Toronto of 1855, sent to the city from London to start a new pharmacy at the direction of his father. Hallam left behind a wife and two daughters, hoping that they would join him in Toronto as soon as the business began to show a profit. Things do not go well for Jem Hallam and, although he is never seems quite sure how it all happened, he eventually finds himself in the photography trade and living with a dying photographer and a woman he took into his life in order to save her from a sure death on the streets of the city.In alternating segments, the reader is able to follow both the efforts of David Hollis to identify the possible location of the missing plates and the evolution of Jem Hallam from failed pharmacist to successful photographer. Hollis, becoming more and more helpless at the hands of the cruel disease he suffered, and finding little support in his quest from colleagues, decided to end his life. It is left up to his wife and his daughter and her fiancé to try to salvage his reputation as they try to stop the construction of a new sports facility on the very spot identified by Hollis as likely to be the final resting place of this important record of Toronto's early history.Redhill seamlessly moves back and forth between the stories of these two men whose lives have become intertwined despite the fact that they lived more than a century apart. Jem Hallam, forced to fight for his survival in a manner he had no way to foresee when he arrived in Toronto, and feeling guilty for carving out a new life for himself with strangers while abandoning his wife and daughters in London to the care of his father, eventually produces the photos that David Hollis will so desperately search for in the future. Or did he? That's where the mystery begins."}, {"review_sentiment": 5.0, "review_text": "Michael Redhill's \"Consolation\" layers memory, perception, place, time, grief, secrets, relationship, and hope in an irresistible rubbing of century against century and life against life. Throughout the lifespan of the book Redhill's character's gain compassion, and this compassion dawns as wisdom--for many of the lives that we follow so intimately here. I can only feel gratitude that this book exists.--Janet Grace Riehl, author Sightlines: A Poet's Diary"}, {"review_sentiment": 4.0, "review_text": "Reviewed by Joe Graham for Reader Views (2/07)Michael Redhill's \"Consolation\" is a fascinating story that switches from an excavation project in Toronto in 1997 to the developing city of Toronto in 1855.  David Hollis is a historian who believes that a sunken ship with photographic plates of early Toronto is waiting to be discovered under the streets of Toronto.  But his colleagues believe he is wrong and David, who is suffering from Lou Gehring's disease, takes his life. His wife, Marianne, his daughter, Bridget and her fiancé, John try to come to grips with David's death and the existence or non-existence of the photographic plates. Marianne moves into the Harbor Light Hotel where she can watch the excavations for the Union Arena in the area where David believes the ship went down.  Her obsession with that excavation puts a strain on her relationships with Bridget and John. But that is only half the story that Redhill has to tell.Jem Hallam has come from England to try to set up a pharmacy business in the developing city of Toronto in 1855. His father is a druggist in England and the family hopes to expand their business interests. He is separated from his father, his brother and his young wife and two daughters.  Jem finds the loneliness and the weather of the new city hard to deal with. He also finds that he has a hard time breaking into a pharmacy business that is already controlled by another family. He meets Sam Ennis, a photographer and begins to develop an interest in photography.  With the help of Sam and Claudia Rowe, a model for Ennis, they begin to develop a photography business and they do a set of photos of Toronto as record of the developing city.Redhill has created a fascinating study of two families interacting with life and facing some of the same decisions and dilemmas even though they are separated by over 100 years. When I was reading, I wanted to be in the present passages with Marianne as she watched the excavation, and I wondered along with Marianne if they would find anything and what they would do if they did find something. But I was also, eager to get back to the world of 1855 Toronto to see how Hallam was doing as he struggled to adapt in his new environment.I would recommend \"Consolation\" to anyone that enjoys a mystery that is not a murder mystery. This book is more of a character study of the participants, Marianne, John, Bridget, Jem and Claudia, and how they react when faced with the unexpected challenges of life.  And of course, there is the mystery of the photographic plates, did they exist or not and will they be found or not.  And finally, the book is an examination of history and what it can say to us. David Hollis spends his life exploring the history of earlier residents of Toronto and he feels like their lives speak to us in the future. Does the past speak to us and what can it tell us? Read \"Consolation\" and see what Redhill and his characters think.Received book free of charge."}, {"review_sentiment": 4.0, "review_text": "Throughout history, humankind has been fascinated with those who lived before them. At any given moment, hundreds of archaeologists and historians are searching for remnants of lost civilizations and peoples from aeons past.In this new novel, Michael Redhill introduces us to one such historian, David Hollis. Through much research, Hollis feels he has pinpointed the location of a steel strongbox, containing an enormous treasure: glass negatives from the earliest pictures ever taken of Toronto when it was still in its newborn stages. Unfortunately, we no sooner meet Hollis than we lose him. He has Lou Gehrig's disease, and commits suicide in the very first chapter. We learn more about Hollis from his wife, Marianne, than from observing him.Marianne, upon her husband's untimely demise, determines that she will vindicate his life's work, and sets out to find the strongbox. She learns the exact location, underneath a landfill being excavated for a sports stadium. She takes up residence in a hotel overlooking the project, and watches and waits for her opportunity to find the treasure.Throughout the book, we also become aquainted with the citizens of early Toronto. This is a remarkable glimpse into the past for those of us firmly rooted in the 21st century. I found these chapters more enjoyable than the present-day chapters.This book provides a haunting look at the past, the present, and what men will do for fame, honor, and money.Armchair Interviews says: Unique look at Toronto's history."}]}, "authors": ["Michael Redhill"], "isbn": "0385659512", "longitude": -79.387207, "periods": ["1800s", "1900s"], "title": "Consolation: A Novel", "word_cloud": "kind need prize award draw attention reader win big long listed man wonderfully write wondrous poetry certain rather attractive lyricism prose make pleasure spend precious hour story run alongside back story immense romanticism interest testify pioneer spirit early immigrant north american continent century fore ground rather bitter strident cast present day character try come term family suicide professional disgrace connect shipwreck theory beneath construction site sport arena lie tangible evidence certain photographic plate carry picture old suicide guilt ridden widow try vindicate belief deceased husband strong objection daughter urge let bygone bygone hole hotel room overlook site hop get government approval unearth archaeological evidence clear husband name turn prospective hold key mystery surround husband perhaps back story set century apothecary sojourn westward search better life capitulation rival control trade life transform chance meeting captive back story gloriously life affirm poignant character well form human believable present day story become unwelcome distraction plot static prose sometimes obscure terse character unaccountably bad temper unsympathetic back story time narrative switch back present consolation mar denouement promise much sadly disintegrate muddy mess miss something reader also go huh tremendous piece work enjoy much highly reader serious fiction mother recommend long died bittersweet memory long live ever mighty city illuminates gravely maybe fact add childlike wonder mystery poet compose story something something byzantine life history great city pile sense thick exact time narrative becomes literally place deconstruction lead peculiar sense give something wonderful lose something equivalent plot seesaw back forth present day world early back hardy band winterize pioneer make cursed chilblain ed landscape not early day photography infant art recent year see huge market construct everyday photograph art photography certain era wily prize maker wildest top rich character exotic spectrum history churn animated indeed turn russian model get experience living maybe moral authority haunt long finish last page anxiously await result mystery photo exist photo researcher stake professional reputation ring photo lay end end old city circa mirror edge revolve music box widow think figure wait grimly mariner wive century stalk widow walk hotel room overlook construction new civic area fascinate character perspective little mad true daughter see grand operatic switch daily life man take brilliantly draw character vulnerable talented generous superstitious give strange bout obsession drawn wrong element life exemplar early settler men woman fate together form city relationship master photographer serve apprentice master assistant beautiful serve wheel propel story closer closer seem inevitable heartbreak fifth story realize hear name author editor magazine deal fifteen month ago mention consolation come around corner know author miss trick turn signatures live advert novel think also look panoramic photo course far later epoch photography handle end prepared grand satisfying finale several face miniature history city mystery sort touch character study focus attempt group people separated century force deal life adversity least expect university historian late twentieth century man obsess city history people live convinced complete set earliest photograph ever take city lose storm offshore bury street build reclaim land part dedicate life identify hidden today find disease know little time leave convince anyone authority help lost photographic newly arrive send city start new pharmacy direction father leave wife daughter hop soon business begin show profit go well never seem quite sure happen eventually find photography trade live die photographer woman take life order save sure death street alternate segment able follow effort possible location miss plate evolution fail pharmacist successful photographer become helpless hand cruel disease suffer find little support quest colleague decide end life leave wife daughter fiance try salvage reputation stop construction new sport facility spot identify likely final rest place important record early seamlessly move back forth story men life become intertwined fact lived century apart force fight survival manner way foresee arrive feel guilty carve new life stranger abandon wife daughter care father eventually produce photo desperately search future mystery begin layer memory perception place time grief secret relationship hope irresistible rubbing century century life life lifespan character gain compassion compassion dawn wisdom many life follow intimately feel gratitude author sight lines review fascinate story switch excavation project develop city historian believe sunken ship photographic plate early wait discover street colleague believe wrong suffer disease take life wife daughter fiance try grip death existence photographic plate move watch excavation area believe ship go obsession excavation put strain relationship half story come try set pharmacy business develop city father druggist family hop expand business interest separate father brother young wife daughter find loneliness weather new city hard deal also find hard time break pharmacy business already control family meet photographer begin interest photography help model begin photography business set photo record develop create fascinate study family interact life face decision even separated year read want present passage watch excavation wonder anything something also eager back world see struggle adapt new anyone enjoy mystery murder mystery character study participant react face unexpected challenge life course mystery photographic plate exist find finally examination history say spend life explore history earlier resident feel life speak future read see character free charge history humankind fascinate live give moment hundred archaeologist historian search remnant lose civilization people eon new introduce historian much research feel pinpoint location steel strongbox contain enormous treasure glass negative earliest picture ever take still newborn stage unfortunately sooner meet lose disease commits suicide first chapter learn wife observe husband untimely demise determines vindicate life work set find strongbox learn exact location underneath landfill excavate sport stadium take residence hotel overlook project watch wait opportunity find also become acquainted citizen early remarkable glimpse firmly root century find chapter enjoyable provide haunt past present men fame honor say look history", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "“There is a vast part of this city with mouths buried in it . . . . Mouths capable of speaking to us. But we stop them up with concrete and build over them and whatever it is they wanted to say gets whispered down empty alleys and turns into wind. . . .” \r\n\r\nThese are among the last words of Professor David Hollis before he throws himself off a ferry into the frigid waters of Lake Ontario. A renowned professor of “forensic geology,” David leaves in his wake both a historical mystery and an academic scandal. He postulated that on the site where a sports arena is about to be built lie the ruins of a Victorian boat containing an extraordinary treasure: a strongbox full of hundreds of never-seen photographs of early Toronto, a priceless record of a lost city. His colleagues, however, are convinced that he faked his research materials.\r\n\r\nDetermined to vindicate him, his widow, Marianne, sets up camp in a hotel overlooking the construction site, watching and waiting for the boat to be unearthed. The only person to share her vigil is John Lewis, fiancé to her daughter, Bridget. An orphan who had come to love David as his own father, John finds himself caught in a struggle between mother and daughter–all the while keeping a dark secret from both women.\r\n\r\nInterwoven into the contemporary story is another narrative set in 1850s: the tale of Jem Hallam, a young apothecary struggling to make a living in the harsh new city so he can bring his wife and daughters from England. Crushed by ruthless competitors, he develops an unlikely friendship with two other down-on-their-luck Torontonians: Samuel Ennis, a brilliant but dissolute Irishman, and Claudia Rowe, a destitute widow. Together they establish a photography business and set out to create images of a fledgling city where wooden sidewalks are put together with penny nails, where Indians spear salmon at the river mouth and the occasional bear ambles down King Street, where department stores display international wares and fine mansions sit cheek-by-jowl with shantytowns.\r\n\r\nConsolation moves back and forth between David Hollis’s legacy and Jem Hallam’s struggle to survive, ultimately revealing a mysterious connection between the two narratives. Exquisitely crafted and masterfully written, Michael Redhill’s superlative book reveals how history is often transformed into a species of fantasy, and how time alters the contours of even the things we hold most certain. As complex and layered as the city whose story it tells, Consolation evokes the mysteries of love and memory, and what suffering the absence of the beloved truly means.", "asin": "0385659512", "rank": "1155643", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51k0DlRjVKL.jpg", "country": "Canada", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}