{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 324, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book,loved audio as well."}, {"review_sentiment": 5.0, "review_text": "The book is great and Vonnegut is timeless in his writing - I recognize characters from today in the pages."}, {"review_sentiment": 5.0, "review_text": "Vonnegut always delivers!"}, {"review_sentiment": 4.0, "review_text": "I enjoyed this book which reads like only a Vonnegut book does, a story told by an observer, rich with oddball characters and plenty of thoughts about humanities shortcomings. Vonnegut's style is unique, the story jumps all over the place, yet is easy to follow and nothing really happens. That is to say, it's all told to the reader as though it already happened. Social commentary: Humans are essentially big-brained bipeds who make a mess of things. I liked the play on the randomness of the character's lives against the idea of Darwin's evolution. All the supposed randomness adds up to the survival of the species through natural selection and our eventual evolution to______, I won't spoil it. The story happens in 1986, and could have been written today. The captain, Adolf von Kleist, charming, yet useless in regards to navigation and leadership, is a metaphor for those moronic figureheads we love to elect to steer our country. They have \"...(little understanding of )...how things really worked, what it was all about, what was really going on\" (pg 140). If KV was alive today there would be an new character, an orange haired von Kleist, steering the next ark out to sea and entirely missing the Galapagos."}, {"review_sentiment": 2.0, "review_text": "I read this book for book club. Otherwise I would not have finished it. None of the characters are likable. The premise is laughable. World War III is about to begin and the only survivors of the human race are shipwrecked on a deserted island in the Galapagos. The narrator is a ghost figure, dead before the time of the shipwreck, and still around one million years later. Humans have \"evolved\" in that short time into seal like beings. It's just a ridiculous premise for an un-likable book."}, {"review_sentiment": 4.0, "review_text": "Galapagos comes out the gates swinging, in full Vonngegut, absurdist style. The narrator is a ghost who is retelling events he witnessed (also as a ghost) a million years before, in 1986. The book basically lays out its entire plot in the first ten or so pages. There was global catastrophe with economic, militaristic, and pathogenic elements, which decimated humanity. The survivors of the human race are people on a cruise ship marooned on the Galapagos islands during these events. The spectral narrator places blame for the catastrophe on the “big brains” human beings had in 1986, which mired civilization in useless conceptualization (money and financial markets) and made people lie and behave cruelly to one another, according to Vonnegut. In the ensuing million years following this catastrophe, the ghost witnesses the simultaneous repopulation an devolution of humanity. People slowly lose their “big brains” and becoming - as he spottily describes them throughout the novel - these sort of seal like, small brained humanoids, who survive primary by catching fish with their teeth.  What made me initially unimpressed by the book was its adherence to a certain cultural trope regarding the separation of humanity and nature - with nature representing good, and humanity representing evil - that western culture and modern American culture in particular is replete with. I also find the narrator’s thinking that that money has no value beyond what people imagine it to have - while at face value true - to be a gross simplification of a very complex mechanic. Also, the central theme (or joke, depending on how the reader interprets Vonnegut’s satire) that humanity evolutionarily doomed itself be becoming too intelligent, to be a muddled thesis. It would seem to me that the armageddon of the novel would have been prevented by extreme intelligence, rather than caused by it.  The core pillars of the book’s points would seem to me to basically bedrock principals of modern day leftism: 1) capitalism is evil, 2) humanity is separate from nature, inferior to nature, and is destroying nature. That said, Vonnegut’s narrative style is such that you can never be sure the degree to which he himself believes in these concepts, and the extent to which he is actually poking fun at them. All in all he seems to do both. The devolution and return to nature that humanity undergoes following the apocalypse does not result in a more admirable life form; the narrator is pretty clear now that all people do is sun on beaches, catch fish in their mouths, mate, and die at like 15 years of age. This return to nature is the punchline at the end of the joke that is the rise and fall of human civilization. This sense of humor prevents the book from seeming to sermonize or even seeming to impart any easily discernible lesson, and is largely what makes Vonnegut such a clever and entertaining author. There are some funny scenes, the structure of the narrative is very interesting and smart, and the ideas played around with here regarding evolution are interesting."}, {"review_sentiment": 4.0, "review_text": "Typically a fan of Vonnegut, this one takes a little more dedication to get through.  I also read the Kindle edition and the text was printed so closely together, I did not find it altogether pleasant to read.  Recommended for the avid Vonnegut reader who wants to check out all of his work."}, {"review_sentiment": 5.0, "review_text": "hilarious."}, {"review_sentiment": 2.0, "review_text": "If new to Vonnegut, read Slaughter-House Five, Cat's Cradle, and Sirens of Titans.  I'm reading Galapagos presently and I'm finding it to be the hardest to finish.  Still has funny moments, but few and far between.  He also uses a unique literary tool, an asterisk in front of character's names, to announce characters who will soon die.  Aside from that, fairly boring read written about an impending doom to \"big brain\" human beings, whom have superfluous uses for their \"big brains.\""}, {"review_sentiment": 3.0, "review_text": "Why does Amazon recommend to me, in daily emails, books that I might enjoy? And when I clicked on this one, I was taken to a page full of \"bodice rippers\" of which I have no interest whatsoever. There were no Kurt Vonnegut novels at all!It's my own fault. I usually don't click on these \"Daily Deals.\"I'm posting this here in hopes that Amazon will get the message."}]}, "authors": ["Kurt Vonnegut"], "isbn": "0385333870", "longitude": 0.0, "periods": ["1900s"], "title": "Galapagos: A Novel", "word_cloud": "love audio well great timeless write recognize character today page always delivers enjoy read story tell rich oddball character plenty thought humanity shortcoming style unique story jump place yet easy follow nothing really happen say tell already happen commentary essentially biped make mess thing like play randomness character live idea evolution suppose randomness add survival specie natural selection eventual evolution story happen write today captain charm yet useless regard navigation leadership metaphor moronic figurehead love elect steer country little understanding thing really work really go pg alive today new character orange haired con steer next ark sea entirely miss club otherwise none character likable premise laughable begin survivor human race shipwreck deserted island narrator ghost figure dead time shipwreck still year later evolve short time seal being ridiculous premise come gate swing full absurdist style narrator ghost retell event witness also ghost year basically lay entire plot first ten page global catastrophe economic militaristic pathogenic element decimate humanity survivor human race people cruise ship maroon islands event spectral narrator place blame catastrophe big brain human being mire civilization useless conceptualization money financial market make people lie behave cruelly accord ensue year follow catastrophe ghost witness simultaneous depopulation devolution humanity slowly lose big brain become spottily describe sort seal small brain humanoid survive primary catch fish teeth make initially unimpressed adherence certain cultural trope regard separation humanity nature nature represent good humanity represent evil western culture modern american culture particular replete also find narrator think money value people imagine face value true gross simplification complex mechanic also central theme joke depend interprets satire humanity evolutionary doom become intelligent muddle thesis armageddon extreme intelligence rather cause core pillars point basically bedrock principal modern day leftism capitalism evil humanity separate nature inferior nature destroy nature say narrative style never sure degree believe concept extent actually poke fun seem devolution return nature humanity undergoes follow apocalypse result admirable life form narrator pretty clear people sun beach catch fish mouth mate die year age return nature punchline end joke rise fall human civilization sense humor prevents seem even seem impart easily discernible lesson largely make clever entertain author funny scene structure narrative interesting smart idea play regard evolution interesting typically fan take little dedication get also edition text print closely together find altogether pleasant avid want work hilarious new read presently find hardest finish still funny moment far also use unique literary tool asterisk front character name announce character soon die fairly bore write impending doom big brain human being superfluous us big brain recommend daily email click take page full bodice ripper interest whatsoever novel fault usually click daily deal post hope get message", "genres": ["Fiction & Literature", "Science Fiction", "Satire"], "summary": "Galápagos takes the reader back one million years, to A.D. 1986. A simple vacation cruise suddenly becomes an evolutionary journey. Thanks to an apocalypse, a small group of survivors stranded on the Galápagos Islands are about to become the progenitors of a brave, new, and totally different human race. In this inimitable novel, America’s master satirist looks at our world and shows us all that is sadly, madly awry–and all that is worth saving.", "asin": "0385333870", "rank": "22222", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/41HTTtNS5%2BL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}