{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 2557, "rating": 3.3, "reviews": [{"review_sentiment": 3.0, "review_text": "I liked this one. A co-worker of mine forced it into my hands so I had no choice: this is one I had to read.Though I didn't know much about it going in, it pretty much read how I thought it would. It was a fast read, and though I was unsure whether I would end up liking it the end sealed it for me. Reading it made me think of Next Life Might Be Kinder by Howard Norman or A Certain Matter by Kenzaburo Oe. The ending so much made me think of The Heart Keeper by Francoise Sagan, one of the best books I've read this year and now on my favorites shelf. Except her book is short, weird, funny as well.But overall, a good read. I won't ever revisit it, but I enjoyed it."}, {"review_sentiment": 1.0, "review_text": "This book was just confusing and made little sense"}, {"review_sentiment": 4.0, "review_text": "If you need to love the main character and feel good about the ending in order to love the book, this book isn’t for you. It was fascinating and a little unsettling to like and sympathize with the narrator at the start, only to start questioning your own judgement as the book progresses. Also, as a side note, don’t bother watching the movie version. It strays very far from the book and is poorly done."}, {"review_sentiment": 2.0, "review_text": "Not a fan. But had a good book club discussion."}, {"review_sentiment": 1.0, "review_text": "Horrible.  Tedious.  So anxiously introspective it made me feel anxious the whole way through.  Not a single likable character.  Don’t think the ending was a shock."}, {"review_sentiment": 4.0, "review_text": "Okay, whoa. This one was a doozy. It was not what I was expecting, in a good way. Every single character in this book is perfectly unlikeable as their most common traits are selfishness, opportunism and the ability to rationalize a litany of poor choices. The Dinner was dark and twisted and only got darker and more twisted as the page numbers increased. I think one of the reasons the actions and thoughts of the characters in the book are hard to swallow is that they’re all fairly realistic actions and thoughts. Everything in this book could have happened. And it’s in those small reactions and actions, and millisecond thoughts portrayed by the characters, in which you witness the devil in all of us. This book can be read in a sitting or two, and should be if possible, in order to be properly digested. It’s a wild ride through a hellish dinner with an entree of dark secrets and a dessert of violence. When you close the book, be prepared to sit for a moment - it’ll take a moment or two to hit your stomach."}, {"review_sentiment": 2.0, "review_text": "Would not recommend this book. I was very disappointed.  Left too many questions and throughout the book it jumped around to unimportant information."}, {"review_sentiment": 5.0, "review_text": "Beautifully scripted and kept my interest!  I found the weaving of the story to keep me on the edge of my seat.  It's a book I just had to finish the minute I started it!"}, {"review_sentiment": 1.0, "review_text": "Ugh! The book was awful. Gone Girl was written so much better. Really feel the author is disturbed."}, {"review_sentiment": 5.0, "review_text": "Pretty decent book"}]}, "authors": ["Herman Koch"], "isbn": "0385346859", "longitude": 4.8936041, "periods": ["2000s", "Recent Releases"], "title": "The Dinner", "word_cloud": "like mine force hand choice know much go pretty much think unsure like end seal make next life end much make think best year favorites short weird funny overall good ever enjoy confuse make little sense need love main character good end order fascinate little unsettling sympathize narrator start start question judgment progress also side note bother watch movie version stray far poorly do not fan good club discussion horrible anxiously introspective make feel anxious whole way not single likable character think end shock whoa dozy expect good way single character perfectly unlikable common trait selfishness opportunism ability rationalize litany poor choice dark twist get darker twist page number increase think reason action thought character hard swallow fairly realistic action thought small reaction action millisecond thought portray character witness devil sit possible order properly digest wild ride hellish entree dark secret dessert violence close prepared sit moment moment hit stomach disappointed leave many question jumped unimportant information beautifully script kept interest find weave story edge seat finish minute start awful write much better really author disturbed decent", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "\"A European Gone Girl.\" —The Wall Street Journal\r\n\r\nAn internationally bestselling phenomenon, soon to be a major motion picture: the darkly suspenseful, highly controversial tale of two families struggling to make the hardest decision of their lives—all over the course of one meal.\r\n\r\nIt's a summer's evening in Amsterdam, and two couples meet at a fashionable restaurant for dinner. Between mouthfuls of food and over the scrapings of cutlery, the conversation remains a gentle hum of polite discourse. But behind the empty words, terrible things need to be said, and with every forced smile and every new course, the knives are being sharpened.\r\n     \r\nEach couple has a fifteen-year-old son. The two boys are united by their accountability for a single horrific act; an act that has triggered a police investigation and shattered the comfortable, insulated worlds of their families. As the dinner reaches its culinary climax, the conversation finally touches on their children. As civility and friendship disintegrate, each couple show just how far they are prepared to go to protect those they love.\r\n     \r\nSkewering everything from parenting values to pretentious menus to political convictions, this novel reveals the dark side of genteel society and asks what each of us would do in the face of unimaginable tragedy.", "asin": "0385346859", "rank": "20885", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/51pewTBmhhL.jpg", "country": "The Netherlands", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}