{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 16, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "Boooooo this book sucks! So freaking boring. Made me fall asleep after three pages... terrible read and an even worse buy"}, {"review_sentiment": 4.0, "review_text": "This is an interesting piece of literature as we see the differences of France and Guadeloupe. It makes us think that the country we live on is not always perfect but there are flaws in itself and the progression of finding the identity of who we are and what part we take. Hence the name, 'Crossing the Mangrove' which describes the difficulty of progression from Point A to Point B.Through different perspectives of characters, the audience has to create the conclusion of who the mysterious foreigner, Roger, is. This is the underlying theme and is what runs the plot - the differences of attitude.It's an OK read, not personally my top favourites however."}, {"review_sentiment": 5.0, "review_text": "All the Conde books I received were in exceptional condition. Very pleased."}, {"review_sentiment": 5.0, "review_text": "good condition"}, {"review_sentiment": 5.0, "review_text": "I had to read the French version for a French literature class and decided after I read the original French version that I would give the English version a try and it is amazing as well.  The translation is very good and I would recommend either the French or the English version!  Very interesting book."}, {"review_sentiment": 4.0, "review_text": "This book was easy to read and enjoyable tale. The reader will be able to relate a lot of this book with personal experiences and still be taken to a new place with a unique culture."}, {"review_sentiment": 4.0, "review_text": "Here is an elegant writer in any language and about any place who relays stories about characters in rural Guadeloupe who collectively relate the mystique of the place, the mixture of cultural expectations, of extended family, of constant involvement in each other's lives, and of the power of story-telling.  I enjoyed every page."}, {"review_sentiment": 4.0, "review_text": "Do we really know who our neighbors are, who our friends are, what thoughts they keep to themselves, not to be shared with even their own family members?Francis Sancher is found dead in the mud along the path to Riviere au Sel, but the story isn't about how he died or even if someone had killed him. His wake, attended by everyone in the village, both those who detested the man and the few who liked him, is the event during which each person is lost in his or her own thoughts, analyzing the decisions they made, significant events in their lives and how they met Francis.Through the internal monologues, we're given a glimpse into the nature of Francis, a man who was complex, verbose, and yet secretive. In each of the internal monologues, there is a thread of sadness, some thicker than others, telling of dreams that have been set aside, hope that has been lost, children who are unloved and passions left unanswered.All the personal stories are beautifully nuanced. They highlight the caste system that existed in Guadaloupe based on the color of one's skin and provide a richly detailed cultural journey into this part of the world."}, {"review_sentiment": 4.0, "review_text": "I recently visited Cuba.  I loved the people!  The culture and attitude towards life is a joy to behold.  Read this book with an open mind and an open heart."}, {"review_sentiment": 5.0, "review_text": "This book was ordered as part of a bundle of textbooks needed for the Spring 2013 semester. The books arrived within two days due to my Amazon Prime subscription, and were in brand new condition. I am very satisfied with my order and all of the products will be very useful in my classes this semester. I will continue to buy books from Amazon in the future!"}]}, "authors": ["Maryse Conde"], "isbn": "0385476337", "longitude": 0.0, "periods": ["1900s"], "title": "Crossing the Mangrove", "word_cloud": "suck so freak bore fall asleep page terrible even worse buy interesting piece literature see difference make country live always perfect flaw progression find identity part name describe difficulty progression different perspective character audience create conclusion mysterious foreigner underlying theme run plot difference personally top favorite however receive exceptional condition very pleased good condition french version french literature class decide original french version english version try amaze well translation good french version very interesting easy enjoyable tale able relate lot personal experience still take new place unique culture here elegant writer language place relay story character rural collectively relate mystique place mixture cultural expectation extend family constant involvement live power enjoy page really neighbor friends thought share even family member find dead mud path au story die even someone kill wake attend everyone village detest man like event person lose thought analyze decision make significant event live meet internal monologue give glimpse nature man complex verbose yet secretive internal monologue thread sadness thicker others tell dream set hope lose child unloved passion leave personal story beautifully nuanced highlight caste system exist base color skin provide richly detailed cultural journey part world recently visit love people culture attitude towards life joy behold open mind open heart order part bundle textbooks need spring semester arrive day due subscription brand new condition satisfy order product useful class semester continue future", "genres": ["Fiction & Literature"], "summary": "In this beautifully crafted, Rashomon-like novel, Maryse Conde has written a gripping story imbued with all the nuances and traditions of Caribbean culture. \r\n\r\nFrancis Sancher--a handsome outsider, loved by some and reviled by others--is found dead, face down in the mud on a path outside Riviere au Sel, a small village in Guadeloupe.  None of the villagers are particularly surprised, since Sancher, a secretive and melancholy man, had often predicted an unnatural death for himself. As the villagers come to pay their respects they each--either in a speech to the mourners, or in an internal monologue--reveal another piece of the mystery behind Sancher's life and death.  \r\n\r\nLike pieces of an elaborate puzzle, their memories interlock to create a rich and intriguing portrait of a man and a community. In the lush and vivid prose for which she has become famous, Conde has constructed a Guadeloupean wake for Francis Sancher.  \r\n\r\nRetaining the full color and vibrance of Conde's homeland, Crossing the Mangrove pays homage to Guadeloupe in both subject and structure.", "asin": "0385476337", "rank": "329342", "city": "Guadeloupe", "image": "https://images-na.ssl-images-amazon.com/images/I/5168hzQN%2BNL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}