{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 199, "rating": 3.7, "reviews": [{"review_sentiment": 3.0, "review_text": "Every parent’s nightmare. That was my first take on the book, and, as a parent, I wanted to read no more. But I read more, and ups and downs of the story continued to remind me of what such a loss would feel like: the opposite of pleasant. I stubbornly read on, waiting for something to happen. What happened next were variations on a theme: missing kid, frantic mother, repeat. I finished it, but not with pleasure. Perhaps others will experience it differently."}, {"review_sentiment": 5.0, "review_text": "good"}, {"review_sentiment": 5.0, "review_text": "While reading this well-written novel, you will become one of the characters: Emma, or her father, or her father's fiancé, or? An author who tells a believable story can create people you want to be, or were, or despise. Michelle Richmond accomplishes this task with much aplomb. Enjoy!"}, {"review_sentiment": 2.0, "review_text": "It started off with a great plot line, but it ended up being an awful book. The author wasted so much time on useless leads and details, and could have developed the plot line and the relationships between characters. The author is a good writer, which is why I gave the book two stars, but failed to work with the interesting plot line. I ended up skimming the book just to finish it. Do not waste your time."}, {"review_sentiment": 2.0, "review_text": "A bit contrived and repetitive.  The best parts were the discussion of mr"}, {"review_sentiment": 4.0, "review_text": "Overall, I thought this was a good read."}, {"review_sentiment": 5.0, "review_text": "Though the subject matter is a bit upsetting to me, I could not put this book down! I read it in three days!"}, {"review_sentiment": 4.0, "review_text": "Couldn't put this one down. Interesting story, well written."}, {"review_sentiment": 5.0, "review_text": "Wow!  I couldn't put the book down.  Ms. Richmond is an amazing author, and I am looking forward to reading her next book."}, {"review_sentiment": 5.0, "review_text": "When I go on vacation, I like to read books that place in that locale. This year my destination was San Francisco, and I happened upon this wonderful novel about memory, obsession, and one woman’s search for a missing child.I don’t know about you, but when I hear about a child who has gone missing without a single trace, I shake my head, say a quick prayer, and tell others that I cannot imagine what the parents are feeling. Michelle Richmond did an amazing job in keep the character in one place yet moving forward at the same time, all the while letting readers be voyeurs of this horrific happening.Freelance photographer Abby Mason is the step-mother-to-be to six-year-old Emma. Abby loves her new role as fiancée and as friend and mom. Abby and Emma go to the foggy Ocean Beach almost every day. Today it may be summer, but it’s almost always cold and foggy at this remote beach. Emma twists her tiny hand from Abby’s and runs ahead. Momentarily distracted by a dead seal pup, when Abby turns back to Emma, she has disappeared in the fog. Literally, she is gone.Readers will get a behind-the-scenes look at a search for a missing child. The police and volunteers who comb the area, the flyers, the reward posting, the sleepless nights, the inability to choke down more than a few morsels of food, the fear that grips Abby and Jake, Emma’s father.Police at first believe she has drowned. Then they look at the Jake and Abby as possible suspects. Jake goes on national television to plead with anyone who may have seen Emma, especially her mother, Lisbeth, who abandoned Jake and Emma three years earlier.As the minutes turn to hours to days to weeks to months, the police give up as new, more solvable cases capture their attention. After months, Jake wants to hold a memorial service and move on with life. But not Abby, she refuses to believe that Emma cannot be found.Readers go with her on her travels through the Bay area, shoving flyers into strangers’ hands, practically begging for help. Readers go with Abby on her quest to locate any memory of their surroundings on the beach that day.I don’t often have a need to peek at a novel’s ending, but the tension is so great that it was all I could do not to peep at the ending.I give The Year of Fog 6 out of 5 stars."}]}, "authors": ["Michelle Richmond"], "isbn": "0385340125", "longitude": -122.4192363, "periods": ["2000s", "Recent Releases"], "title": "The Year of Fog", "word_cloud": "parent nightmare first parent want up down story continue remind loss opposite pleasant stubbornly wait something happen next variation theme miss kid frantic mother repeat finish pleasure perhaps others experience differently good read character father father author tell believable story create people want despise accomplish task much aplomb start great plot line end author waste much time useless lead detail plot line relationships character author good writer give star fail work interest plot line end skim finish waste time bit contrived repetitive best part discussion rm overall think good subject matter bit upsetting day put story well write amaze author look forward read next go vacation like place locale destination happen upon wonderful memory obsession woman search miss know hear child go miss single trace shake head say quick prayer tell others imagine parent feel amaze job character place yet move forward time let reader voyeur horrific photographer love new role fiance friend mom go foggy almost day summer almost always cold foggy remote beach twist tiny hand run ahead momentarily distract dead seal pup turn back disappear look search miss child police volunteer comb area flier reward post sleepless night inability choke morsel food fear grip first believe drown then possible suspect go national television anyone see especially mother abandon year minute turn hour day week month police give new solvable case capture attention month want memorial service move life refuse believe go travel area shove flier stranger hand practically beg help go quest locate memory surroundings beach often need peek end tension great star", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Life changes in an instant. On a foggy beach. In the seconds when Abby Mason—photographer, fiancée soon-to-be-stepmother—looks into her camera and commits her greatest error. Heartbreaking, uplifting, and beautifully told, here is the riveting tale of a family torn apart, of the search for the truth behind a child’s disappearance, and of one woman’s unwavering faith in the redemptive power of love—all made startlingly fresh through Michelle Richmond’s incandescent sensitivity and extraordinary insight.\r\n\r\nSix-year-old Emma vanished into the thick San Francisco fog. Or into the heaving Pacific. Or somewhere just beyond: to a parking lot, a stranger’s van, or a road with traffic flashing by. Devastated by guilt, haunted by her fears about becoming a stepmother, Abby refuses to believe that Emma is dead. And so she searches for clues about what happened that morning—and cannot stop the flood of memories reaching from her own childhood to illuminate that irreversible moment on the beach.\r\n\r\nNow, as the days drag into weeks, as the police lose interest and fliers fade on telephone poles, Emma’s father finds solace in religion and scientific probability—but Abby can only wander the beaches and city streets, attempting to recover the past and the little girl she lost. With her life at a crossroads, she will leave San Francisco for a country thousands of miles away. And there, by the side of another sea, on a journey that has led her to another man and into a strange subculture of wanderers and surfers, Abby will make the most astounding discovery of all—as the truth of Emma’s disappearance unravels with stunning force.\r\n\r\nA profoundly original novel of family, loss, and hope—of the choices we make and the choices made for us—The Year of Fog beguiles with the mysteries of time and memory even as it lays bare the deep and wondrous workings of the human heart. The result is a mesmerizing tour de force that will touch anyone who knows what it means to love a child.\r\n", "asin": "0385340125", "rank": "964572", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51YwnG6slTL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}