{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 3269, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "This is probably the best climbing book I have read despite the controversy surrounding some aspects. It was as enthralling as books like Endurance and as readable. I was with the author on the mountain and felt the terrible pain of the losses they endured, the guilt of the survivors and the many \"what ifs\" after the event.The author relays his personal experiences climbing Everest in 1996 with a number of groups. This was the tragic year when many of the participants didn't make it off the mountain due to a catalogue of errors and an untimely snow storm. He also documents a lot of the history of other climbs and delves into the personalities and characters of some of the great climbers.More generally, I am drawn to these adventure books and stories which hold a certain fascination. But whenever I read about the cost ($70,000 minimum,) the risk ( 1 in 4 people die in an Everest attempt) and the pain and possible life changing injuries from frost bite, I am always glad I can just read about it from the warmth and comfort of a safe altitude on dry ground.There is something unique about people who set out to achieve these goals. Krakauer describes them like thisTo become a climber was to join a self-contained, rabidly idealistic society, largely unnoticed and surprisingly uncorrupted by the world at large. The culture of ascent was characterised by intense competition and undiluted machismo, but for the most part, its constituents were concerned with impressing one another only. Getting to the top of any given mountain was considered much less important than how one got there: prestige was earned by tackling the more unforgiving routes with minimal equipment, in the boldest style imaginableI find myself wondering how they feel when it is all over. They have spent a fortune, risked everything, endured much pain, put their waiting family through a nightmare and possibly lost colleagues or friends to a gruesome death. What is it all for? Is it worth it? What are they really seeking?Reading books like this, one might suppose that most climbers do it for the beauty of the scenery or the thrill of the surroundings. However, it is clear from this book and others that these aspects very much take a back seat. Instead, it is a competition to be the best in the field and it can take over a person's life. Climbing mountains is what they dream about and ultimately what they live for. It can become an obsession in the same way that sport or work or any other hobby can. That is when it becomes dangerous and purposeless.God created each of us with a vacuum that only He can fill. Man will seek to deny this and seek pleasure and fulfillment in many places other than God. These things then become idols. They must be kept in their proper place and we need to keep a proper perspective.This is a great book. The strong language is not so great hence the less than perfect rating. There is no sexual content and no violence. There are upsetting scenes of death."}, {"review_sentiment": 5.0, "review_text": "I don't really care about the drama of disagreement regarding the facts of the tragedy of 1996, so with that in mind, I loved this book. Jon's writing is fluid, real, and colored with his perspective, which I wouldn't have any other way."}, {"review_sentiment": 4.0, "review_text": "Strongly recommended if you like the \"disaster porn\" genre."}, {"review_sentiment": 5.0, "review_text": "Loved the book, not a mountaineer. It reads like catharsis, hard to tell is that is manufactured or genuine sometimes. It provided, however momentarily, a glance into the sense of urgency and peril that high altitude climbing provides for its practitioners. Well worth the read for a desk jockey like myself, but Krakauer seems to be implicitly seeking the approval of an elite group of mountaineers that he will likely not achieve."}, {"review_sentiment": 5.0, "review_text": "Well written. Puts the reader on the mountain with all the elements, danger and loss at the hands of Everest."}, {"review_sentiment": 1.0, "review_text": "This is the most disappointed I've ever been by a non fiction bestseller. If you have to read it, but it used or borrow it from a library.Objectively the writing is horrible. Krakauer's style is just clunky, emotionally vacant, and boring. He bombards the reader with a useless 186 pages of dull, useless information, all the while boating about his own climbing abilities and critizing the real heroes of this venture. Also *spoiler alert* this bum is sleeping in his tent while his teammates are dying in the snow, but bully for him because he massage it to the top.I honestly don't think he deserved to write this and I regret buying it new."}, {"review_sentiment": 3.0, "review_text": "I approached this hoping it would help me understand why anyone would want to climb Everest; I came away more baffled than ever.  What a nightmare this book is.  It's worse than a nightmare -- it really happened!"}, {"review_sentiment": 3.0, "review_text": "If I had to rate this book out of 5 stars I would give it a 3 out of 5 stars. The book was overall good, but as I continued to read it, I noticed a lot of boring parts of the book. There were intense moments to the book, but the only way for me to truly love a book is if there was close to no boring moments. I will admit that the book had intense parts and there were some moments that I didn't want to put the book down, but I believe that's how it should be almost the entire time reading a book."}, {"review_sentiment": 5.0, "review_text": "Jon Krakauer presents an action packed adventure while providing a first hand account of his team's Everest expedition. Krakauer outlines key hardships and how his team got around these obstacles. Themes such as perseverance, determination, and man vs. nature are prominent. Young adults looking for a nail-biter within grueling moments will relate with this novel."}, {"review_sentiment": 4.0, "review_text": "I am very picky when it comes to reading books.  When I am looking for a new book to read there are a few certain things that I look for because if I pick something that doesn’t accommodate the criteria I most likely won’t finish the book.The first thing I look for is:The book Looks interesting and exciting.When I am looking for a new book to read I look for something that stands out to me that I think I’m going to like.  I like to read books that are fast paced and have a lot going on because I am not much of a reader and I get bored easily.Second:It is about something that I am interested in (something I can relate to).Like I said earlier, if i am not interested in a book I most likely won’t read it.  When I'm looking for a new book I look to see if it has things in it that I find interesting or they do things i also like to do.  I think this is probably the most important thing to me when I'm looking for a new book.Lastly:It’s not extremely long.I’m really busy and to be completely honest reading books are not at the top of my list when it comes to things to do.  I like to read books under about 300 pages because if I don't finish a book quickly I will most likely end up not finishing it at all.These are some of the things I look for when I'm looking for a new book.  As you can tell I'm not an avid reader although I love to read when I find something I like.  I’ve found that by using the criteria above to pick out a book, I tend to find books I like to read.I read the book “Into Thin Air’’ by Jon Krakauer. I thought this was a great book overall and I will be using the criteria below to rate this book.  When I rate a book I like to have 5 categories I look for and give it one star for every time it meets that criteria. The 5 Things I look for are:1. The book is interesting and excitingThis book was very interesting although there were some parts that got a little boring at times.  It was necessary for him to talk about the things he did but I was excited to get into the action of climbing the actual mountain.2. It is about something that I am interested in (something I can relate to)This book could not have been any better in terms of things I am interested in.  I’m not much of a mountain climber, but I love to learn about the outdoors and it was really cool to learn in depth about Mount Everest.3. It stays on topic and doesn’t get too side-trackedI thought this book did a good job of staying on track and and it all seemed to flow and fit perfectly into the story.4. The plot is easy to followIt was really cool reading this book and being able to refer to the map of the ascent as his group made there way up the mountain.  This made it easy to know where they were at all times in the story so you never get confused.5. It’s not extremely longThis book had 291 pages making it the perfect amount. it was enough to get his point across but not so long that I got bored.In Conclusion I would rate this book 4-5 stars according to my rating system.  It met all the criteria except for one.  Towards the beginning of the book he spends a lot of time talking about what got him interested in wanting to climb Everest and about all the invites he declined because of other obligations.  I was eager to get into the exciting climbing and disaster portion of the story and it made it hard to continue reading at the beginning.  Other than that, this was an incredible book that told an amazing story and I would recommend it to anyone who enjoys climbing or the outdoors."}]}, "authors": ["Jon Krakauer"], "isbn": "0385494785", "longitude": 0.0, "periods": ["1900s"], "title": "Into Thin Air: A Personal Account of the Mt. Everest Disaster", "word_cloud": "probably best climb controversy surround aspect enthral readable author mountain felt terrible pain loss endure guilt survivor many ifs author relay experience climb number group tragic year many participant make mountain due catalogue error untimely snow storm also document lot history climb delve personality character great generally draw adventure story hold certain fascination cost minimum risk people die attempt pain possible life change injury frost bite always glad warmth comfort safe altitude dry something unique people set achieve goal describe this to become climber join rabidly idealistic society largely unnoticed surprisingly corrupted world large culture ascent characterize intense competition undiluted machismo part constituent concerned impress get top give mountain consider much le important get prestige earn tackle unforgiving route minimal equipment boldest style imaginable i find wonder feel spend fortune risk everything endure much pain put wait family nightmare possibly lose colleague friends gruesome death be worth really seek read climber beauty scenery thrill surroundings however clear others aspects much back seat instead competition best field person life mountains ultimately live become obsession way sport work hobby become dangerous create fill seek deny seek pleasure fulfillment many place thing become idol proper place need proper great strong language great hence le perfect rating sexual content violence upset scene death really drama disagreement regard fact tragedy mind love write fluid real color perspective way strongly recommend porn genre love mountaineer read catharsis hard tell manufacture genuine sometimes provide however momentarily glance sense urgency peril high altitude climb provide practitioner desk jockey seem implicitly seek approval elite group mountaineer likely achieve well write mountain element danger loss hand disappoint ever fiction bestseller use borrow write horrible style clunky emotionally vacant boring bombard useless page dull useless information boat climb ability criticize real hero venture also bum sleep tent teammate die snow bully massage honestly think deserve write regret buy new approach hop anyone climb come away baffle ever nightmare worse nightmare really happen rate star star overall good continue notice lot boring part intense moment way truly love close boring moment admit intense part moment want put believe almost entire time reading present action pack adventure provide first hand team expedition outline key hardship team get obstacle perseverance determination man nature prominent adult look grueling moment picky come read look new certain thing look pick something accommodate criterion likely finish first thing look interesting look new look something stand think go like fast paced lot go much get bore something interested something relate say earlier interested likely look new look see thing find interesting thing also like think probably important thing look new extremely really busy completely honest read top list come thing like page finish quickly likely end finish thing look look new tell avid love find something like find use criterion pick tend find like think great overall use criterion rate rate category look give star time meet criteria look interesting exciting this interest part get little boring time necessary talk thing excite action climb actual something interested something relate better term thing interest much mountain climber love learn outdoors really cool learn depth stay topic think good job stay track seem flow fit perfectly plot easy follow it really cool read able refer map ascent group make way mountain make easy time story never extremely long this page make perfect amount enough get point long get rate star accord rating system meet criterion begin spends lot time talk get interested want climb invite decline obligation eager exciting climb portion story make hard continue read begin other incredible tell amazing story anyone enjoy climb outdoors", "genres": ["Memoir", "Sport"], "summary": "A bank of clouds was assembling on the not-so-distant horizon, but journalist-mountaineer Jon Krakauer, standing on the summit of Mt. Everest, saw nothing that \"suggested that a murderous storm was bearing down.\" He was wrong. The storm, which claimed five lives and left countless more--including Krakauer's--in guilt-ridden disarray, would also provide the impetus for Into Thin Air, Krakauer's epic account of the May 1996 disaster.\r\n\r\nBy writing Into Thin Air, Krakauer may have hoped to exorcise some of his own demons and lay to rest some of the painful questions that still surround the event. He takes great pains to provide a balanced picture of the people and events he witnessed and gives due credit to the tireless and dedicated Sherpas. He also avoids blasting easy targets such as Sandy Pittman, the wealthy socialite who brought an espresso maker along on the expedition. Krakauer's highly personal inquiry into the catastrophe provides a great deal of insight into what went wrong. But for Krakauer himself, further interviews and investigations only lead him to the conclusion that his perceived failures were directly responsible for a fellow climber's death. Clearly, Krakauer remains haunted by the disaster, and although he relates a number of incidents in which he acted selflessly and even heroically, he seems unable to view those instances objectively. In the end, despite his evenhanded and even generous assessment of others' actions, he reserves a full measure of vitriol for himself. \r\n", "asin": "0385494785", "rank": "4222", "city": "Alaska", "image": "https://images-na.ssl-images-amazon.com/images/I/511pyvWg3YL.jpg", "country": "Mount Everest", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}