{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 26, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "A particularly lively look at two iconic figures of the mid-20th century and their times.  the stark differences in their characters and yet their interdependence that was so creative.  the description of Weimar Germany and the subsequent Nazi period is striking.  The complicated role of their women serves an excellent counterpoint to their remarkable  relationship only further enhances the narrative.  A great read."}, {"review_sentiment": 5.0, "review_text": "Brilliant.  We know a little about almost all of these players, male and female.  Katz tells us lots and lots more, with fascinating details.  The nature of the Brecht-Weill collaboration is explored in depth.  One only wonders now whether \"The Threepenny Opera\" will come to be known someday as a musical work by Weill or a theatrical work by Brecht, or continue to be known as their shared collaboration.  The work itself seems deathless."}, {"review_sentiment": 4.0, "review_text": "Weill and Brecht have been intriguing to me since I realized they are the team that brought forth “Mac the Knife”.  I knew snatches of their lives such as the “Beggars/Three Penny Opera”, “Mother Courage”, the HUAC , Hollywood, Broadway and East Germany.  This book put it together for me.Pamela Katz focuses on the “Partnership” which was only a part, but a pivotal part, of their respective careers and on the three women who made their work possible.  The “Beggars/Three Penny Opera” is the centerpiece of this partnership. Its development and first production commands ¼ or more of the text and is woven into all that follows.Brecht as described here fits the spoiled ego-centered director-producer stereotype. He rails at the actors and re-writes their lines even up minutes before opening. He has children by 3 different women.Actress Helene Weigel takes responsibility for her two children with Brecht and Brecht’s son by another despite Brecht’s marriage to the mother of another daughter.  Elizabeth Hauptmann (at points she seems homeless but for his office) gives up all for him.  While he sees her as a translator, she is at minimum an anonymous collaborator. She most likely wrote “Alabama Moon” and probably many other Brecht pieces. While emotionally unsatisfying (and often degrading) these may have been the best career situations the two women could have attained given the male driven culture of the time. Hauptmann received 12.5% royalties on many works and connections for her other work; Through Brecht, Weigel was connected when she needed to re-start her acting career and became the “official” widow with a sizable estate.Weill has an altogether different personality and uncomplicated life style. He is fiercely loyal to Lottie Lenya (despite both her and his affairs), writing songs to feature her and negotiating her roles. His lifestyle is conventional (likes home and garden) and works well with others.The book takes you from Brecht's and Weill's very different childhoods, to their meeting, to their collaborations to their legal issues and their parting.  After death, there is a description of the “war of the widows”. There are pieces of how the Nazi’s took over in the streets (demonstrations and violence), in theaters (shouting and letting rats loose before ultimately shutting them down) and in private offices (burning private papers and works of artists).  Neither Weill not Brecht wanted to leave Germany but both had to and both went in ways characteristic of their personalities. Weill found artistic freedom in the US and Brecht who could not so easily bombast his way could not adjust and became, essentially,a man without a country until he settled in East Germany.The author’s research shows in the detail which is more than many readers would want. General readers will find it wordy and might not appreciate the extensive artistic criticism. At points the writer changes styles from reportorial, to journalistic, to something like a novel’s narrative.  For Brecht and Weill fans, it is a must read.  Others with an interest in these artists or a desire to know more about them will find a lot of information."}, {"review_sentiment": 5.0, "review_text": "I love The Three Penny Opera. Now I understand it form a historian perspective as well as a stunning work of art. It is even more an astonishing work that I knew."}, {"review_sentiment": 5.0, "review_text": "Excellent book, well-researched, and thoroughly reported.  Thank you, Ms Katz, from us Weill fans out here!!"}, {"review_sentiment": 1.0, "review_text": "Rather disappointing. A lot of rather lame invention about both Brecht and Weill thought there is no doubt the major points of their careers are covered."}, {"review_sentiment": 4.0, "review_text": "Art moves society, politics, and humanity at its core--and without most individual's inkling of what initiated the change.  Katz chronicles Brecht, Weill, Lenya and their lover's impact at the theatrical fulcrum of German events 1928 through WWII. Their work participates in the societal changes pre-war.  Was it Brecht's immediate broad brush social dialogues, Weill's longer view pragmatism in orchestration, or Lenya's act-out-and-see that  engenders the more significant events and changes, or just the synergy of collaboration among great artists?  The Nazis closed Brecht's theaters, Weill's music came to film for a generation and The Three Penny Opera continues its run throughout the western world. Katz's history provides insight into the current American politic, and how three people changed opera, stage, theater, and music forever."}, {"review_sentiment": 1.0, "review_text": "I didn't enjoy it at all.  The plot was circuitous, repetitive and not particularly enlightening.  The characters were poorly delineated; the times in which they lived, blandly portrayed.  I was very disappointed and didn't finish it."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this book very much but I want to know who let the author's error that Beatrice Arthur played Polly Peachum in the 1954 revival of \"The Threepenny Opera\" get past them?  For the record, the role was played by Jo Sullivan and Bea Arthur played Lucy Brown.  When I reached this comment, I suddenly began wondering how much of the remaining book was as misinformed."}, {"review_sentiment": 5.0, "review_text": "Bertolt Brecht and Kurt Weill were two key figures in the cultural renaissance that occurred in Weimar Germany.  Who does not think of Weimar Germany without automatically thinking of THE THREEPENNY OPERA?  And how could one separate it from Lotte Lenya’s role as Pirate Jenny and her performance of the song, “Mack the Knife?”Pamela Katz’s THE PARTNERSHIP: BRECHT, WEILL, THREE WOMEN, AND GERMANY ON THE BRINK (New York: Doubleday, 2014) captures the mood of Germany between renaissance and tragedy.  She skillfully portrays the decadence and charm of the era through the lives of Brecht, Weill and those who were professionally and romantically linked to them.I especially like what has been referred to as her “novelization of biography.”  It makes the book far more enjoyable to read than if it were a dull scholarly tome.  That is not to say that it is not a well-researched and documented work.  It is that, but it is also a good choice for anyone interested in Becht and Weill or Weimar culture.Anyone who enjoys THE PARTNERSHIP would also enjoy Otto Friedrich’s BEFORE THE DELUGE: A PORTRAIT OF BERLIN IN THE 1920S (Haper & Row, 1972, 1995)."}]}, "authors": ["Pamela Katz"], "isbn": "0385534914", "longitude": 13.3888599, "periods": ["1900s", "Recent Releases"], "title": "The Partnership: Brecht, Weill, Three Women, and Germany on the Brink", "word_cloud": "particularly lively look iconic figure century time stark difference character yet interdependence creative description subsequent period strike complicated role woman serve excellent counterpoint remarkable relationship enhances narrative great know little almost player male female tell lot lot fascinate detail nature collaboration explore depth wonder come know someday musical work theatrical work continue know shared collaboration work seem deathless intrigue realize team bring forth know snatch live put together focus part pivotal part respective career woman make work possible centerpiece partnership development first production command text woven describe fit spoil stereotype rail actor line even minute open child different take responsibility child son marriage mother daughter point seem homeless office give see translator minimum anonymous collaborator likely write probably many piece emotionally unsatisfying often degrade career situation woman give male driven culture time receive royalty many work connection work connect need act career become official widow sizable altogether different personality uncomplicated life style fiercely loyal affair write song feature negotiate role lifestyle conventional like home garden work well take different childhood meeting collaboration legal issue part death description war widow piece take street demonstration violence theater shout let rat loose ultimately shut private office burn private paper work artists want leave go way characteristic personality find artistic freedom easily way become essentially man country settle author research show detail many reader reader find wordy extensive artistic criticism point writer change style reportorial journalistic something narrative fan interest artist desire know lot information love now understand form historian perspective well stunning work art even astonish work know excellent thoroughly report fan rather disappoint lot rather lame invention think doubt major point career cover art move society politics humanity core individual inkling initiate change chronicle lover impact theatrical fulcrum german event wwii work participate societal change immediate broad brush social dialogue longer view pragmatism orchestration engender significant event change synergy collaboration great artist close theater music come film generation continue run western world history provide insight current american politic people change opera stage theater music forever enjoy plot circuitous repetitive particularly enlighten character poorly delineate time live blandly portray disappoint finish enjoy much want know author error play revival past record role play play reach comment suddenly begin wonder much remaining misinform key figure cultural renaissance occur think automatically think separate role performance song capture mood renaissance tragedy skillfully portray decadence charm era live professionally romantically link especially like referred novelization make far enjoyable dull scholarly tome say document work also good choice anyone interested enjoy also", "genres": ["Biography", "Art & Architecture", "History", "Weimar Republic", "Music", "Drama"], "summary": "Among the most creative and outsized personalities of the Weimar Republic, that sizzling yet decadent epoch between the Great War and the Nazis' rise to power, were the renegade poet Bertolt Brecht and the rebellious avant-garde composer Kurt Weill. \r\n\r\nThese two young geniuses and the three women vital to their work—actresses Lotte Lenya and Helene Weigel and writer Elizabeth Hauptmann—joined talents to create the theatrical and musical masterworks The Threepenny Opera and The Rise and Fall of the City of Mahagonny, only to split in rancor as their culture cracked open and their aesthetic and temperamental differences became irreconcilable. \r\n\r\nThe Partnership is the first book to tell the full story of Brecht and Weill's impulsive, combustible partnership, the compelling psychological drama of one of the most important creative collaborations of the past century. It is also the first book to give full credit where it is richly due to the three women whose creative gifts contributed enormously to their masterworks. \r\n\r\nAnd it tells the thrilling and iconic story of artistic daring entwined with sexual freedom during the Weimar Republic's most fevered years, a time when art and politics and society were inextricably mixed.", "asin": "0385534914", "rank": "771286", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51YUISZNVzL.jpg", "country": "Germany", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}