{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 109, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "It was a little boring and sappy, just not my kind of book."}, {"review_sentiment": 1.0, "review_text": "There was too much switching back and forth from past to present.  I could not follow who, what, where, all the goings on.  I was unable/unwilling to finish!  Too frustrating."}, {"review_sentiment": 4.0, "review_text": "Hard to put down. Love it."}, {"review_sentiment": 4.0, "review_text": "The Map of Love covers a time and place in history that is not commonly known to people in the United States. The time period moves between the early and late 20th century and tells the story of a family, but especially of Anna - an English woman (Christian) in love with an Egyptian (Muslim) man. In addition to political intrigue, the book explores colonialism, racism, religion, society, and the beginnings (continuation) of the current turmoil in the Middle East. The novel is well written and Soueif handles the transitions between times well. My biggest problem was keeping track of characters with Egyptian names/honorifics."}, {"review_sentiment": 3.0, "review_text": "The novels feels very long. The characters don't develop, they stand for ideas, for generations, they symbolize things, but they are not complex enough to successfully portray real people. Many background characters are really sketchy. The servant types are truly medieval in their devotion to their masters. There is a lot of history and politics in this novel. It feels like not much has changed since 1910! The main problem with the book is that after about 250 pages, the reader gets tired. The same people, the same characters, predictable statements, happy family life, unhappy political situation, wonderful traditions, great religion, beautiful country, loyal servants etc.. Kids get born, people die, wars begin and end. The author had a good idea for a novel and half way through the inspiration left her..."}, {"review_sentiment": 5.0, "review_text": "One of my top ten favorite books!"}, {"review_sentiment": 2.0, "review_text": "Skip the first boring 100 pages and you might enjoy the book.  I was hoping to learn more about the Palestinian viewpoint.  Just a tiny peek."}, {"review_sentiment": 4.0, "review_text": "How skillfully the author wove events in the early 20th century with those in the late 20th century, and how creative the arrangement of clues as the story unfolded.  Character Anna, however, nearly always expressed optimism, an approach I would admire if such consistently high mood seemed plausible in the context of her time."}, {"review_sentiment": 5.0, "review_text": "1997. “A story can start from the oddest things. For Amal al-Ghamrawi, this story started with a trunk”.  Inside Amal finds letters and dairies hidden for almost a hundred years. From them she unlocks a moving romance, an axis around which spin the history and politics of Egypt. She rediscovers herself and her family and her country. This novel by an accomplished author combines the best of romantic and historical fiction.1896. Lady Anna Winterbourne, a young English widow, comes to Cairo. She meets the charismatic Sharif al-Baroudi.  Their love is celebrated on a stormy stage. A bright new generation seeks to free the land from the dying Ottoman Empire and the new colonialists of Britain and France. Sharif is part of that generation.Politics and history of the time are a key part of the story. The reader would need to have some knowledge of and interest in the period.Alongside the main love story runs a contemporary affair – a word I chose deliberately - between Omar, an internationally recognised musician, and  a young  American student, Isabel. It is Isabel who brings the trunk to Amal. Omar is Amal’s older brother. The two time frames loop in and out as the tapestry is woven. Numerous connections  are revealed between the modern day couple and Sharif and Anna - I will not spoil these.As a century earlier with Anna and Sharif, so the politics of modern day Egypt intimately affect Isabel  and Omar. Central to both periods is the question of Palestine and the embryonic, then established,  state of Israel.Ahdaf explores many themes personal and political. She explores the problem for Arab intellectuals, like herself and her creation Omar, torn between east and west, tradition and modernity, religion and secularism. The author crafts intriguingly the emotional ties of brothers and sisters, compared to those between husband and wife. Much else besides.Very occasionally the prose slips as the author is carried away by the lovers, but Anna and Sharif are grounded enough to pull her back on line. Some of the writing is exquisite. “old people are starved of touch: no husband, no lover, no child to slip a hand into a hand. I watched her in her last years: her hand stroking, stroking, the chairs, the table, the bedspread”.Ahdaf’s vision of her land and its people is broad and deep. This I enjoyed."}, {"review_sentiment": 4.0, "review_text": "I first discovered Ahdaf Soueif through her book In the Eye of the Sun and was looking forward to reading this one. This book is beautifully written, with as much prose and poetry as her first one. However, I found it got too political towards the end and stopped focusing on the story and instead on Egyptian politics of both the past and 1998, which I didn't find as interesting. Otherwise it was great."}]}, "authors": ["Ahdaf Soueif"], "isbn": "0385720114", "longitude": 31.243666, "periods": ["1900s"], "title": "The Map of Love", "word_cloud": "little boring sappy kind much switching back forth present going finish frustrating put cover time place history commonly know people time period move early late century tell story family especially woman man addition political intrigue explores colonialism racism religion society beginning continuation current turmoil well write handle transition time well biggest problem keep track character egyptian novel feel long character develop stand idea generation symbolize thing complex enough successfully portray real people many character really sketchy servant type truly medieval devotion master lot history politics feel much change main problem page get tire people character predictable statement happy family life unhappy political situation wonderful tradition great religion beautiful country loyal servant get bear people die war begin author good idea half way inspiration leave top ten favorite first bore page hop learn palestinian viewpoint tiny peek skillfully author wove event early century late century creative arrangement clue story unfolded however nearly always express optimism approach consistently high mood seem plausible context time story start oddest thing story start trunk find letter dairy hide almost year unlocks move romance axis spin history politics rediscover family country accomplish author combine best romantic historical young widow come meet charismatic celebrate stormy stage bright new generation seek free land die new colonialist part history time key part story interest main story run contemporary affair word choose deliberately internationally recognize musician young american student bring trunk older brother time frame loop tapestry woven numerous connection reveal modern day couple spoil century earlier politics modern day intimately affect period question embryonic establish state explores many theme personal political explore problem arab intellectual creation east west tradition modernity religion secularism author craft intriguingly emotional tie brother sister compare husband wife much else occasionally prose slip author carry away lover ground enough pull line write exquisite old people starve touch husband lover child slip hand hand watch last year hand stroke stroke chair table bedspread vision land people broad deep enjoy first discover look forward read beautifully write much prose poetry first however find get political towards end stop focus story instead egyptian politics find interesting otherwise great", "genres": ["Fiction & Literature", "Romance", "Historical Fiction"], "summary": "Booker Prize Finalist\r\n\r\nHere is an extraordinary cross-cultural love story that unfurls across Egypt, England, and the United States over the course of a century. Isabel Parkman, a divorced American journalist, has fallen in love with a gifted and difficult Egyptian-American conductor. Shadowing her romance is the courtship of her great-grandparents Anna and Sharif nearly one hundred years before.\r\n\r\nIn 1900 the recently widows Anna Winterbourne left England for Egypt, an outpost of the Empire roiling with political sentiment. She soon found herself enraptured by the real Egypt and in love with Sharif Pasha al-Baroudi, an Egyptian nationalist. When Isabel, in an attempt to discover the truth behind her heritage, reenacts Anna’s excursion to Egypt, the story of her great-grandparents unravels before her, revealing startling parallels for her own life.\r\n\r\nCombining the romance and intricate narrative of a nineteenth-century novel with a very modern sense of culture and politics—both sexual and international—Ahdaf Soueif has created a thoroughly seductive and mesmerizing tale.", "asin": "0385720114", "rank": "90456", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51ha5x-au3L.jpg", "country": "Egypt", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}