{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 79, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Love this author!"}, {"review_sentiment": 3.0, "review_text": "Beautifully written- an exquisite book until the very end. No satisfying ending. DUH! Maybe I've missed something???"}, {"review_sentiment": 5.0, "review_text": "excellent for its price"}, {"review_sentiment": 5.0, "review_text": "It's a well-known fact that Margaret Atwood is a wonderful author, but she really shines in this novel.  Completely underrated work of hers... probably because The Handmaid's Tale gets so much publicity with the new series out.  The Edible Woman tracks quite an interesting history of psychological falling-apart based around the heroine's diet.  As Marian can consume fewer and fewer items that make up an essential diet, she is forced to conclude that perhaps the issue is not herself, but an extraneous force.  Definitely worth the read, I could not put it down."}, {"review_sentiment": 4.0, "review_text": "New to me. Old to the world. Still a charming and relevant story by a skilled writer"}, {"review_sentiment": 4.0, "review_text": "My wife stumbled over the word \"soggy\" on the first page of Edible Woman and could only bring herself to limp forward a couple more before collapsing.  I tripped over the word \"stolid\" in the book's very first sentence.  A nasty stub, I must admit.  Any narrative in the first person should best be cleansed of the word stolid until a full chapter in, in my opinion.  Just too freakin' snooty right off the bat.  Even the first sentence of James' Portrait of a Lady was less snooty by comparison.  Of course it didn't have stolid in it.  First couple of chapters in, the characters were dull and uninteresting to me.  I could barely sacrifice the energy to turn the page; though I suspect the characters themselves (if they were real) wouldn't have blamed me.  What kept me going at first was the dated feel to the story.  Though published in '69, it was written by Atwood in '65.  The main character, Marian, informs the reader early on \"I'm certain I'm being groomed for something higher up, but as I have only hazy notions of the organizational structure of Seymour Surveys(the character's employer) I can't imagine what.\"  Yikes.  Sounds kinda flighty, even for the 60s.  Dull, but flighty.  This book starts slow, as I've said.  My initial question after the first two chapters was how the hell did it get published in the first place?  Publishers are notorious for reading a couple of pages and tossing a manuscript under the desk if it only partially grabs a reader in its beginning.  Did I mention it has freakin' stolid in the first sentence?  Oh.  Anyway, turns out the publisher allegedly \"lost\" the manuscript for about four years.  Sure, that's the ticket.  How did it manage to get found, read, and released, you ask?  I'd be speculating of course, but I envision someone took it accidentally into the office restroom after an over-adventurous lunch at a nearby foreign restaurant.  You choose it's ethnicity according to personal prejudice and plausible dysenteric qualities.  Well, the good news is that the abject dullness of the first couple of chapters appears to have a point.  The point is to give the main character and narrator of the first part the appearance of being normal.  If you've read anything of Atwood's fiction however(before this, I hadn't), you've already likely guessed, she isn't.  Spoilers, sort of:  Marian works at her job.  Marian has a hunky, lawyer boyfriend.  Marian meets an odd drifty piece of crap graduate student while soliciting interviews for her job.  Marian suddenly freaks out and bolts from an evening out with hunk and friends.  Hunk and friends manage to capture her.  Hunk(being a lawyer, but not too smart) decides to ask her to marry him the very day after.  She says sure.  WTF?  The rest of the book deals with the slow worsening of the nonsense begun in the first part.  The second part is narrated in the third person.  Marian's voice has been cancelled.  She shuts herself off from eating food, gradually, progressively, and semi-rationally.  Food plays an important part in this novel, as the title would seem to insist.  A bigger theme, I feel, is the prevalence of human need for sufficient autonomy, if not at times outright militant autocracy.  Marian's excuses as to why she won't eat certain foods sound veganish at first.  Poor animals...  Right to live for all...  Every life is precious, even a lettuce leaf...  Marian's refusal to eat seems much less about a refusal to kill, to consume, to exploit; more does it feel a method of systematically segregating oneself off from any and all outside invading influences, even if only they be edible nourishment.  Also, Marian's decision to leave all decisions to her fiancé symbolized separation for me, not submission.  When assaulted on all sides, best to circle all wagons until the danger passes.  I feel this is less a feminist novel; more a mental health survival story.  This is an interesting book, though one with way too many references to chesterfields.  Atwood does a fantastic job of painting mental illness in subtle tones.  The slight shifts in characters' moods throughout unsettle the reader. The story keeps you guessing about itself.  The end is original and intriguing.  Atwood's first is indeed an impressive first.  And my toe has almost completely healed by now.  Did I mention the word stolid is in the first sentence?"}, {"review_sentiment": 4.0, "review_text": "This is Atwood's first published novel in 1969, and for a debut novel, it is surprisingly polished, bearing in mind her young age then. The main character is Marian, a university grad who is rooming with another young woman, Ainsley, in a house with a religious, sanctimonious landlady, who seems every ready to be outraged and confrontational with her two tenants.Reflective of the time of the novel, and even now, it captures the struggles of young women like Marian who were navigating a minefield of gender roles and relations, and forging their independence and identities in changing times. Faced with more 'conventional' friends like the oft-pregnant Clara, who had taken the more tried and tested route available with an early marriage and a trove of kids, and set against the more worldly Ainsley who professes to never wanting to be tied down by any kind of conjugal binds, Marian finds herself at the crossroads when her new relationship with Peter, a young, dashing and upcoming lawyer in training, reaches a new plateau and she contemplates marriage and the dreaded \"settling down\". Then a complication arises which threatens to overwhelm her as she grapples with what she really wants and the direction her life should take.Split into two parts and a coda of sorts, it is interesting that the first part is written in Marian's first-person voice, while the second part sees Marian's increasingly inexplicable actions in the third person, before resolving into a first person coda, as if Marian regains her voice after grappling with a journey of self-discovery/actualisation she cannot quite comprehend or articulate herself in the second part.While assured in substance and writing, I couldn't help noticing the many obvious tropes and thematic references used to address the fulfilment of femininity and the games men and women play, with the one most commonly seen in this novel about the contrary nurturing and destructive impulses that define the relationships between the sexes. Duncan, a significant (and awfully detestable and self-involved) character in the sequence of events, tells Marian rather smugly, \"I can tell you're admiring my febrility. I know it's appealing, I practise at it; every woman loves an invalid. I bring out the Florence Nightingale in them. Be careful.\"The characters constantly jolt me with either their sudden explosiveness on the one hand or frustrate me with their inert and yet manipulative intent on the other, but never quite gain my full empathy. However, I see this as indicative of the overall unsettling subject matter which cannot be resolved."}, {"review_sentiment": 1.0, "review_text": "Felt was a waste of money, only read because it was a book club choice."}, {"review_sentiment": 2.0, "review_text": "For me, the book was a little boring and stupid at some points. Good topic and the message is good, but that doesn't mean you need to behave like that to reach that conclusion."}, {"review_sentiment": 4.0, "review_text": "I am only a third of the way through the book, and I am very intrigued by it. The point of view changes, which I strongly dislike, but besides that it is definitely keeping me interested! It isn't a book full of action; It's more of a steady, in the characters head type of book, which I personally enjoy! I would recommend it!"}]}, "authors": ["Margaret Atwood"], "isbn": "0385491069", "longitude": -79.387207, "periods": ["1900s"], "title": "The Edible Woman", "word_cloud": "author exquisite end satisfy end miss something excellent price fact wonderful author really shin completely underrated work probably get much publicity new series track quite interesting history psychological base heroine diet marian consume fewer fewer item make essential diet force conclude perhaps issue extraneous force worth world still charm relevant story skilled writer wife stumble word soggy first page limp forward couple collapse trip word stolid first nasty stub narrative first person best cleanse word stolid full chapter opinion freaking snooty right bat even first sentence le snooty comparison course stolid couple chapter character dull uninteresting barely energy turn page suspect character real keep go first date feel story publish write main character marian informs early certain groom something higher hazy notion organizational structure character employer kinda flighty even flighty start slow say initial question first chapter hell publish first place notorious read couple page toss manuscript desk partially grab begin mention stolid first sentence turn publisher allegedly lose manuscript year sure ticket manage get find release ask speculate course envision someone take accidentally office restroom lunch nearby foreign restaurant choose ethnicity accord personal prejudice plausible dysentery quality well good news abject dullness first couple chapter appear point point give main character narrator first part appearance normal anything fiction however already likely guessed sort work job marian hunky lawyer boyfriend marian meet odd drift piece crap graduate student solicit interview job marian suddenly freak bolt even hunk friend friends manage capture lawyer smart decide ask marry day say sure rest deal slow worsen nonsense begin first part second part narrate third person marian voice cancel shut eat food gradually progressively play important part title bigger theme feel prevalence human need sufficient autonomy time outright militant autocracy marian excuse certain food sound veganism first animal live life precious even lettuce leaf marian refusal eat seem much le refusal kill consume exploit feel method systematically segregate invade influence even nourishment also marian decision leave decision fiance symbolize separation submission assault side best circle wagon danger pass feel le feminist mental health survival story interesting way many reference chesterfield fantastic job paint mental illness subtle tone slight shift character mood unsettle story keep guess end original intriguing first indeed impressive first toe almost completely heal mention word stolid first sentence first publish debut surprisingly polish bearing mind young age main character university grad room young house religious sanctimonious landlady seem ready outrage confrontational time even capture struggle young woman marian navigate minefield gender role relation forge independence identity change time friend take try tested route available early marriage trove kid set worldly profess never want tie kind conjugal bind marian find crossroads new relationship young dash upcoming lawyer training reach new plateau contemplate marriage dread settle then complication arises threaten overwhelm grapple really want direction life part coda sort interest first part write marian voice second part see marian increasingly inexplicable action third person resolve first person coda regain voice grapple journey quite comprehend articulate second assure substance writing notice many obvious trope thematic reference use address fulfillment femininity game men woman play commonly see contrary nurture destructive impulse define relationship sex significant awfully detestable character sequence event tell marian rather smugly tell admire fertility know appeal practice love invalid bring careful character constantly jolt sudden explosiveness hand frustrate inert yet manipulative intent never quite gain full empathy however see indicative overall unsettling subject matter resolve waste money club choice little boring stupid point good topic message good mean need behave reach conclusion third way intrigue point view change strongly dislike besides definitely keep interested full action steady character head type personally enjoy", "genres": ["Fiction & Literature"], "summary": "Marian has a problem. \r\n\r\nA willing member of the consumer society in which she lives, she suddenly finds herself identifying with the things being consumed. She can cope with her tidy-minded fiancé, Peter, who likes shooting rabbits. She can cope with her job in market research, and the antics of her roommate. She can even cope with Duncan, a graduate student who seems to prefer laundromats to women. But not being able to eat is a different matter. Steak was the first to go. Then lamb, pork, and the rest. Next came her incapacity to face an egg. Vegetables were the final straw. But Marian has her reasons, and what happens next provides an unusual solution. \r\n\r\nWitty, subversive, hilarious, The Edible Woman is dazzling and utterly original. It is Margaret Atwood’s brilliant first novel, and the book that introduced her as a consummate observer of the ironies and absurdities of modern life.\r\n\r\n“Articulate and sophisticated.… Extraordinarily witty, and full of ironic observation.… A tour de force.” Toronto Star\r\n", "asin": "0385491069", "rank": "83477", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/41ZD55E34FL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}