{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 449, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "A good enjoyable read from start to finish. Anyone who enjoys friendships, first love, and just a good hearted story, will want to read this."}, {"review_sentiment": 5.0, "review_text": "Loved it! One of her best  - hated having to finish it . On to the next one."}, {"review_sentiment": 5.0, "review_text": "This is my third Binchy book, and I have loved all three. I plan to read all of them.  Her story lines and character are not to be outdone by anyone.  I will be very sad when I have read the last one."}, {"review_sentiment": 1.0, "review_text": "I borrowed this book from our local library, but by the time I got to page 276, I decided to give up.  This is the first Maeve Binchy book that I have ever read, and in all likelihood, it will be the last.  I found the book too juvenile for my tastes.  This is the kind of book that I would have read as a teenager in middle school, not as a 54-year woman.  The story was just dragging on and on, and I found myself becoming increasingly exasperated.  The characters were both unrealistic and shallow.  I tried to force myself to finish this book, but I simply could not.  This is middle school reading at best."}, {"review_sentiment": 5.0, "review_text": "I think this is my favorite Maeve Binchey book. These aren't sappy everyone lives happily ever after stories but not terribly disturbing either. I love her characters!!!"}, {"review_sentiment": 5.0, "review_text": "It's a great read, you have characters you cheer for and others you want to slap!  Worth the time to read."}, {"review_sentiment": 5.0, "review_text": "Well-developed & character driven but not forsaking for a solid plot. Just as the Circle of Friends in the protagonist's life come full circle, plot devices come full circle to create a believable world you can melt into and characters who you can strongly identify with."}, {"review_sentiment": 5.0, "review_text": "One of her best novels. The later ones are terrible"}, {"review_sentiment": 3.0, "review_text": "Not like her other books. I was disappointed!"}, {"review_sentiment": 5.0, "review_text": "One of my favorite books of all time. I read it one to two times a year. Getting the Kindle version was the logical step so I can read without worrying about having to get up to turn off the light if I get sleepy!"}]}, "authors": ["Maeve Binchy"], "isbn": "0385341733", "longitude": -6.2602732, "periods": ["1900s"], "title": "Circle of Friends", "word_cloud": "good enjoyable start enjoy friendship first good heat story want love best hat finish next one third love plan story line character anyone sad last borrow local library time get page decide first ever likelihood last find juvenile taste kind middle school woman story drag find become increasingly exasperate character unrealistic shallow try force finish simply middle school reading best think favorite sappy everyone live happily ever stories terribly disturb love character great character cheer others want slap time character drive forsake solid plot protagonist life come full plot device come full create believable world melt character strongly best novels later one terrible not disappoint favorite time time year get version logical step worry turn light get sleepy", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "It began with Benny Hogan and Eve Malone, growing up, inseparable, in the village of Knockglen. Benny—the only child, yearning to break free from her adoring parents...Eve—the orphaned offspring of a convent handyman and a rebellious blueblood, abandoned by her mother's wealthy family to be raised by nuns. Eve and Benny—they knew the sins and secrets behind every villager's lace curtains...except their own.\r\n\r\nIt widened at Dublin, at the university where Benny and Eve met beautiful Nan Mahlon and Jack Foley, a doctor's handsome son. But heartbreak and betrayal would bring the worlds of Knockglen and Dublin into explosive collision. Long-hidden lies would emerge to test the meaning of love and the strength of ties held within the fragile gold bands of a...Circle Of Friends.", "asin": "0385341733", "rank": "513082", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51dFtBVhwpL.jpg", "country": "Ireland", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}