{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 424, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "We view a funeral, political scandal, attempted rape, news scoop that is swiftly thwarted, symphony composition, and double murders - through the minds and black hearts of many.  More than a page turner. More like a barn burner. The end - what the hell? Tense, terse, driving, relentless."}, {"review_sentiment": 4.0, "review_text": "as a fan of mcewan’s writing, i bought this book shortly after the publication release.  about a year ago, while scanning titles in my home library and seeing Amsterdam, i realized that i couldn’t recall what the book was about, and i had a feeling that i didn’t understand it.  i buy books from used book stores and at library sales, so i have plenty of unread books.  i put Amsterdam in the pile of unread books, my intention being to read the book again.  a few days ago, i began rereading the book. i read the opening pages aloud.  a woman died, her body cremated. outside the crematorium are her husband and three former lovers, a politician, a composer and a newspaper editor.  the four men are points on a square with the woman as point in the center connecting to them.  of the lines of the square, connecting the four men, three are solid, one missing, presenting an equation to be solved.  near the end of the book, a conversation between the composer and a conductor applies equally to the musical composition and the plot composition with ‘the amoral inevitability of pure geometry’. … “Clive wanted the great conductor to bless his symphony with a lofty compliment and angled a question accordingly: ‘Do you think the whole piece is hanging together well?  Structurally, I mean.’ “it does hang together well, and in conclusion those two points connect as the fourth line, solving the equation.  however, mathematical puzzles and structural integrity are different animals.  the conclusion is constructed of flimsy material, translated in literary language, what starts out as serious fiction ends with an action so subtle in execution as to be silliness.  one can spend endless hours attempting to make sense of it, perhaps in a moral context, perhaps as karma or even as divine comedy, or one can accept it as a fitting ending without asking why and accepting that in the realm of fiction this is the turn mcewan wanted to apply and leave it at that."}, {"review_sentiment": 3.0, "review_text": "Starts interestingly, soars high during the first and second act and the finale is a letdown. Agree with other critics that the language is great, and makes me want to re-read several lines, and I might re-visit some passages - the ones that describe human nature, and aligns it to nature in general, there are several quote-worthy passages here.However, the ending, though is a neat twist, seems out of character. It seems forced.One might justify it as dark comedy or something similar, but still, there is a lack of a strong buildup towards this finale - much like Clive's composition."}, {"review_sentiment": 3.0, "review_text": "I really wanted to like this book, but I couldn't get into it. The premise was interesting, but the story dragged and then turned downright ridiculous. I do not recommend it."}, {"review_sentiment": 5.0, "review_text": "The plot took an interesting, almost humorous twist.  The author is a talented writer.  I read it years ago and read it again after recommending it to my book club."}, {"review_sentiment": 3.0, "review_text": "Quirky and entertaining, a good read."}, {"review_sentiment": 4.0, "review_text": "An excellent example of the surprise-ironic ending, and of course a biting commentary on the literary/artistic pretensions of the high-culture celebrity class."}, {"review_sentiment": 3.0, "review_text": "The story was compelling to a point but the ending was apparent before the end.  Were each of the two protagonists so self-absorbed that they didn't have any suspicions about the actions of the other?"}, {"review_sentiment": 4.0, "review_text": "Requested gift?"}, {"review_sentiment": 3.0, "review_text": "I fail to understand why there are so many great reviews on this book. The story is rather choppy, the ending is ridiculous, first 70% of the book the exposition."}]}, "authors": ["Ian McEwan"], "isbn": "0385494246", "longitude": 4.8936041, "periods": ["1900s"], "title": "Amsterdam", "word_cloud": "view funeral political scandal attempt rape news scoop swiftly thwart symphony composition double murder mind black heart many more page turner more barn end hell terse driving relentless fan mcewan write buy shortly publication release year ago scan title home library see realize feeling understand buy use store library sale plenty unread put pile unread intention day ago begin reread opening page aloud woman die body cremate outside crematorium husband former lover politician composer newspaper editor men point square woman point center connect line square connect men solid miss present equation solve near end conversation composer conductor applies equally musical composition plot composition amoral inevitability pure geometry want great conductor bless symphony lofty compliment angle question accordingly whole piece hang together well structurally hang together well conclusion point connect fourth line solve equation however mathematical puzzle structural integrity different animal conclusion construct flimsy material translate literary language start serious fiction end action subtle execution silliness spend endless hour attempt make sense perhaps moral context perhaps even divine comedy accept fit end ask accept realm fiction turn mcewan want apply start interestingly soar high first second act finale letdown critic language great make want several line one human nature align nature general several passage end neat twist seem character seem dark comedy something similar still lack strong buildup towards finale much composition really want premise interesting story drag turned downright ridiculous recommend plot take interest almost humorous twist author talented writer year ago recommend club entertain good excellent example end course bite commentary pretension celebrity class story compel point end apparent end protagonist suspicion action request gift fail understand many great review story rather choppy end ridiculous first exposition", "genres": ["Fiction & Literature", "Humour"], "summary": "The Booker Prize-winning contemporary morality tale—cleverly disguised as a comic novel—from the acclaimed author of Atonement.\r\n\r\nOn a chilly February day, two old friends meet in the throng outside a London crematorium to pay their last respects to Molly Lane. Both Clive Linley and Vernon Halliday had been Molly's lovers in the days before they reached their current eminence: Clive is Britain's most successful modern composer, and Vernon is a newspaper editor. Gorgeous, feisty Molly had other lovers, too, notably Julian Garmony, Foreign Secretary, a notorious right-winger tipped to be the next prime minister.\r\n\r\nIn the days that follow Molly's funeral, Clive and Vernon will make a pact with consequences that neither could have foreseen…", "asin": "0385494246", "rank": "268031", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/51nI78xPzoL.jpg", "country": "The Netherlands", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}