{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 5, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Perhaps because I'm a sucker for back humor, I absolutely loved this book. Great descriptive writing, complex characters and funny as hell. I found it only because I was curious about the British double-agent code named \"Garbo\", and I'm so glad I did. I read several books a week, usually, so that's a lot of books read over the decades: this one soared high, high up my all-time favorites list within just a few chapters, and the author sustained the suspense and the humor all the way to the end.The trouble with Kindle editions is that you can't share great reads with friends, so I'm off to prowl the used book collections to see if I can't find some hardbound copies to give away."}, {"review_sentiment": 4.0, "review_text": "A pleasant holiday read that keeps you guessing. I look forward to reading the others in the series."}, {"review_sentiment": 3.0, "review_text": "Reasonable."}, {"review_sentiment": 5.0, "review_text": "If you are familiar with WW2 Garbo, you will enjoy this fiction/fact imagined story.Who knows? Garbo was a cowboy. Try it."}, {"review_sentiment": 5.0, "review_text": "Derek Robinson is more well-known as the author of books about pilots and aeroplanes in the world wars, but on the side he's produced several espionage novels that demonstrate his usual taste in black humor and bloody-minded bureaucracy.Our hero is Luis Cabrillo, a young Spaniard who survives the Spanish Civil War doing odd jobs for foreign journalists, and decides to offer his services to British Intelligence in 1941. MI5 doesn't want him so he goes across the street to the Abwehr, the German version. They snap him right up and train him in all the modern espionage arts, and before too long he's on his way to London.But he only makes it as far as Lisbon, where he carries out his duties to the letter -- except the reports he mails back are entirely fictitious.As the afterword tells us, Luis is based on a real spy who became a double-agent during the war, and all of the outrageous exploits and adventures of THE ELDORADO NETWORK are based on fact. Even more extraordinary is the revelation that all of the German spies in England at the time were working for the British.This is not your average deadpan espionage novel. The world as Derek Robinson sees it is run by charismatic amateurs, and that goes for the Germans, the British, and Luis Cabrillo himself. Everyone, regardless of rank or position, muddles through as best they can. Mr Robinson's usual ferocious wit can't hurt, and the dialogue of the book is a real treat.The book is out of print, and undeservedly so. I was lucky enough to dig a copy out of the depths of my college library; my library also has both sequels (ARTILLERY OF LIES and RED RAG BLUES). Find them if you can."}]}, "authors": ["Derek Robinson"], "isbn": "0393013227", "longitude": -3.7035825, "periods": ["1900s"], "title": "The Eldorado Network", "word_cloud": "perhaps sucker back humor absolutely love descriptive writing complex character funny hell find curious british code name glad several week usually lot decade soar high high favorite list chapter author sustain suspense humor way trouble edition share great read friend prowl used collection see hardbound copy give away pleasant holiday keep guess look forward read others series reasonable familiar enjoy imagine know cowboy author pilot aeroplanes world war side produce several espionage novel demonstrate usual taste black humor hero young survive spanish job foreign journalist decide offer service british want go street abwehr german version snap right train modern espionage art long way make far carry duty letter report mail back entirely afterword tell base real spy become war outrageous exploit adventure base fact even extraordinary revelation german spy time work average deadpan espionage world see run charismatic amateur go british regardless rank position muddle best usual ferocious wit dialogue real print undeservedly lucky enough dig copy depth college library library also sequel", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII"], "summary": "1941. Hitler is rampant. Spain is neutral. Madrid, like Casablanca, the launching pad for spies from all sides. The most daring and audacious of all is codenamed \"Eldorado.\"\r\n\r\nYoung, inexperienced, hotheaded, he had no right to survive, let alone succeed. Now his network is the most valuable in Europe, and the fates of armies lie in his hands.\r\n\r\nBut who does he work for? Or is he only in it for himself? One thing's for sure. War may be a dirty business, but it certainly brings home the bacon.\r\n\r\nBased on a true story, The Eldorado Network is the first novel in Derek Robinson's acclaimed Luis Cabrillo Quartet. A tense and gripping espionage thriller from a master of action and suspense.", "asin": "0393013227", "rank": "3241329", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51nMhOzt6HL.jpg", "country": "Spain", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}