{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 162, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "A wonderful insight to the native culture of coastal British Columbia"}, {"review_sentiment": 1.0, "review_text": "Boring, boring, boring."}, {"review_sentiment": 5.0, "review_text": "Great condition. Thanks"}, {"review_sentiment": 5.0, "review_text": "Without giving away any spoilers, I'd say that the story arc of this book is of subsidiary importance to me. Reading it taught me many things about the value of old growth forests and about the unsustainable rate at which humans have managed to convert this invaluable resource into lumber. I also learned about the Haida people of the Pacific Northwest.If you have any interest in and/or love for the planet, reading this book will be helpful in improving your world view."}, {"review_sentiment": 5.0, "review_text": "A friend recommended this book. He had read it and knwww my wife and I were going on a trip to Alaska and Victoria Island. This book takes place in both of those areas. The author interweaves a couple of story lines through the book which is more about the areas mentioned and the history of logging there. We spent four days on Victory Island then did a seven day cruise through Alaska.  I was still reading the book so it wsss very interesting to see thdd land and get a feel for the native people of the areas. For that reason, I give it a five. I havecrewad this author before and know he can get very drawn out with the details of his historical background. Here, he did it again.  I found myself skipping through a good bit of it with still getting a feel for the land, people and the separate stories going on. His characters and how they were woven into the history of logging and hunting were perfect. If you are interested in over harvesting the land (Really, raping the land for lumber), and how that effected the landscape and the Native Indians,  this is a great read. The history of the trees,  the land and the people will keep you turning pages."}, {"review_sentiment": 5.0, "review_text": "This was an excellent book covering many fascinating subjects ranging from tree history to logging to Native American trade and Canadian history.  I really recommend this excellent work."}, {"review_sentiment": 5.0, "review_text": "This is a really good read for anyone interested in Haida/Tlinget history, or resource extraction in the Pacific Northwest."}, {"review_sentiment": 5.0, "review_text": "A gripping book, and much more than simply the tale of the destruction of an icon on Haida Gwaii.  The subtitle is apt, although it is an open question whether the term 'madness' refers to the single disturbing act of Grant Hadwin's felling this tree or to the wanton destruction, vastly accelerated following the industrial revolution, of entire ecosystems for no other reason than short sighted self interest or downright greed.The author convincingly introduces readers to the world of Hadwin, the experienced and efficient logger, into the abominable logging practices sanctioned by both government and industry not so long ago, then the protagonist's gradual conversion into becoming what one would now describe as an eco-terrorist. He also writes engagingly about the islands, the Haida themselves, their history and culture, but refrains from romanticizing. We also learn what an important place this iconic tree took in the beliefs of the Haida and about the deep scars its destruction caused.'The Golden Spruce is a fascinating and well written tale, but more than just a story about this tree and Haida Gwaii, In some way it is also one about a microcosm representative of man's uneasy relationship with the world he inhabits since earliest times.."}, {"review_sentiment": 3.0, "review_text": "Not the easiest read but interesting no less."}, {"review_sentiment": 4.0, "review_text": "A moving story about the greatest tragedy encountered by First nation Americans"}]}, "authors": ["John Vaillant"], "isbn": "0393328643", "longitude": -123.11554, "periods": ["2000s"], "title": "The Golden Spruce: A True Story of Myth, Madness, and Greed", "word_cloud": "wonderful insight native culture coastal british bore bore boring great condition thanks give away spoiler say arc subsidiary importance teach many thing value old growth forest unsustainable rate human manage convert invaluable resource lumber also learn people interest love planet read helpful improving world view friend recommend wife go trip take place area author interweave couple line area mention history log spend day day still read wuss interesting see thud land feel native people area reason give havecrewad author know draw detail historical background here find skip good bit still get feel land people separate story go character weave history log hunt perfect interested harvesting land rap land lumber effect landscape native great history tree land people turn page excellent cover many fascinating subject range tree history log native american trade canadian history really excellent work really good anyone interested history resource extraction gripping much simply tale destruction icon subtitle apt open question term refers single disturb act fell tree wanton destruction vastly accelerate follow industrial revolution entire ecosystems reason short sight self interest downright author convincingly introduce reader world experience efficient logger abominable logging practice sanction government industry long ago protagonist gradual conversion become also write engagingly island history culture refrain romanticize also learn important place iconic tree take belief deep scar destruction cause fascinate well write tale tree way also microcosm representative man uneasy relationship world inhabit earliest not easiest interest le move greatest tragedy encounter nation", "genres": ["Science & Nature"], "summary": "A tale of obsession so fierce that a man kills the thing he loves most: the only giant golden spruce on earth.\r\n\r\nWhen a shattered kayak and camping gear are found on an uninhabited island in the Pacific Northwest, they reignite a mystery surrounding a shocking act of protest. Five months earlier, logger-turned-activist Grant Hadwin had plunged naked into a river in British Columbia's Queen Charlotte Islands, towing a chainsaw. When his night's work was done, a unique Sitka spruce, 165 feet tall and covered with luminous golden needles, teetered on its stump. Two days later it fell.\r\n\r\nAs vividly as John Krakauer puts readers on Everest, John Vaillant takes us into the heart of North America's last great forest.", "asin": "0393328643", "rank": "38690", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/41%2B-UmKsimL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}