{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 23, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "Book was in really bad shape and smelled."}, {"review_sentiment": 5.0, "review_text": "❤️ I was impressed by the amazing condition this edition was in!"}, {"review_sentiment": 5.0, "review_text": "I read this book many decades ago, in the 80's and never forgot it.  I put it down as my favourite book of all times.  She give a wonderful perspective of male and female in every situation.  Probably not for all folks and some of my friends thought it a bit tedious.  Excellent writing as Simone truly presents. It's great long winter book.  After I read this I read everything by Simone."}, {"review_sentiment": 5.0, "review_text": "Simone writes about love like no one else."}, {"review_sentiment": 3.0, "review_text": "Hard to get into and understand, requires knowledge of French history and literary figures at the time."}, {"review_sentiment": 5.0, "review_text": "In perfect state!"}, {"review_sentiment": 5.0, "review_text": "The Mandarins is an interesting look into the lives of French intellectuals trying to rebuild the world in a post WWII environment.  Beauvoir's account closely follows the lives of Beauvoir, Albert Camus, Jean-Paul Sartre, and Nelson Algren.  I recommend this book to anyone interested in the lives of French Existentialists, post-WWII French culture, or, just a good read.My favorite part of the novel was Beauvoir's focus on the role of an intellectual.  Each character has a different opinion.  Each opinion changes over the course of seemingly endless setbacks.  Some give in to despair.  Others rebel against their circumstances."}, {"review_sentiment": 5.0, "review_text": "As someone with an antipathy to existentialism, feminism, the French and soap operas, I came to Simone de Beauvoir's The Mandarins expecting to find myself loathing the experience.  My attitude turned around quite rapidly because of the writing, the plotting and the fascination of watching the internal debates of French leftists who were coming to terms with the recent impotence of their nation and, consequently, their own irrelevance in the face of the upstart, gauche Americans. (See p. 516 [\"Admitting that you belong to a fifth rate nation and an outmoded era is not something that you can do overnight.\"].)I thought that De Beauvior's writing - or at least this translation - was excellent.  The sentences were fairly simple and direct, and there were frequent instances where de Beauvior's observations were charming.  For example, after Nadine, the daughter of Anne Dubrieulh - the first person narrator/de Beauvior figure - joins the Communist Party, Anne observes that \"[Nadine] soon began examining all my acts and words in the light of historical materialism.\" (p. 197.)Kids will do that.The plotting is first-rate.  De Beauvior uses a technique where she employs two perspectival characters -Henri Perron and Anne Dubrieulh. When Henri Perron - the Albert Camus figure - is the central character, the story is narrated in the third person; when Anne Dubrieulh is the central character, the story moves to a first person narrative.  The change in writing perspective is interesting because de Beauvior will sometimes \"loop back\" to cover scenes and times that Henri had previously narrated, and we see the same scene told from Anne's perspective.The soap opera of the book focuses on Henri and Anne's interactions with other people.  Henri is the editor/publisher/co-owner of a newspaper started under the Resistance named L'Espoir (the \"Hope.\")  Henri is married to Paula, who he seems to be fond of but finds her cloying love for him to be stifling him.  Henri has to work through the question of whether he will keep L'Espoir an independent Leftist newspaper or be sucked into the plans of Robert Dubrieulh (\"Dubrieulh\") - the Jean Paul Sartre analog - to turn L'Espoir into the house propaganda organ of Dubrieulh's political party/movement, the S.R.L, which Dubrieulh conceives as a broad leftist front aligned with the Communist Party, but not Communist.  Henri succumbs to the force of Dubrieulh's personality and his apparent submissiveness to Dubrielh, and then regrets that decision when the issue of whether to print an expose about the Soviet death camps splits Dubrieulh and Henri, with Dubrieulh judging that it would be far worse to give aid and comfort to Anti-Communists than to allow the death camps to continue, and Henri having some residual adherence to an idea of a commitment to truth that transcends politics.Through the long political ratiocinations, we see Henri philander.  First, he has an affair with the Dubrieulh's eighteen year old daughter, Nadine, then he takes up with a Quisling wanna-be actress - which results in him perjuring himself for a Nazi collaborator - and then he returns to Nadine, who connives at trapping Henri in a marriage by getting pregnant.  Nadine goes from Henri to Henri's younger friend Lambert.  Lambert goes from a leftist journalist to a right wing newspaperman. Paula, Henri's wife, goes from being a woman in the grips of obsessive compulsion about her husband, to out and out insanity on the same subject, but, fortunately, she is saved by psycho-analysis before the book ends.Anne's story was less interesting and seems to be mostly about Anne's obsession with Anne.  Anne has sex with Scriazine - the Arthur Koestler analog - which seems fairly meaningless.  She goes to America, plots having sex with the husband of a couple she is staying with, but then meets Lewis, an American writer, with whom she becomes infatuated.  She goes on for pages about how wonderful love is, and how great it is to be loved for a woman her age - she is a 39 year old dowager - and then when the embers of passion die down for Lewis, Anne goes on for pages about the hurt of not being loved for a woman her age and contemplates suicide.  This material might be pure gold for soap opera lovers, but it did not impress me, largely because I felt that Anne had no clue what she was talking about; her idea of love seemed to be a kind of unexamined narcissism.  I, frankly, became annoyed with Anne and puzzled by de Beauvior's approach to feminism.  Anne is a psycho-analyst, but she permits herself to be talked to as if she was a child by Lewis.  At one point, Lewis advises her that he is \"going to wind up believing that there is a brain inside that little skull.\" (p. 477.)  As noted in other reviews, based on this book, where the women seem to identify their value in reference to what men they have attached themselves to, it seems that de Beauvior had a rather misogynistic view of her sex.The plotting of all this was excellent.  For example, de Beauvior introduces the poison that Anne will contemplate taking at the end of the book in an earlier scene involving Anne and Paula.  There is a character named Marie Ange who cons an interview out of Henri, which seems like a puzzling throw-away scene, but the effects of the story published from that interview will be seen at different times throughout the book.  Marie Ange pops up unexpectedly at different points.  I enjoyed seeing how her life developed over time.However, what caught my interest was the historical value of the book.  The book keeps time to historical events - the retreat of the Germans out of France, the surrender of Germany, the use of the Atomic bomb, the Malagasy Uprising of 1947 - and shows the attitude of French intellectuals to these events.A large part of the book is taken up by the problem of the Communist Party.  The problem is that Henri's coterie of intellectuals wanted to be Communists but they didn't want to make a full commitment to Communism, much less anything else.  They want to have their cake and eat it, too, but the Communists won't permit a left that is not under their control or which refuses to permit itself to be used as patsies.  The big issue for non-Communist intellectuals seems to have been whether they should support the United States or the Soviet Union.  It seems that for most, there never was a question about supporting the Soviet Union over the United States - of course, they were going to support the Soviet Union (p. 584) - but this allegiance seems to have been more a matter of conformity to class expectation.  What we get from reading The Mandarins seems to be that the French Left made most of its decisions based on projecting their attitudes on their enemies.  Thus, on a number of different occasions, Henri and his friend describe their fear and loathing about becoming a colony of the United States.  This fear and loathing is never expressed in terms of what the Americans will do - except that Americans are somehow uncivilized and uncultured (they will never be able to control themselves with their Atom bomb (p. 241) - but there are descriptions about what it means to be a colonized power, specifically a colony of the French during the Malagasy Uprising. Being a colony of France is not an attractive option.  I got the sense that the French intellectuals were basically saying something like, \"gosh, we know how we act when we are the colonizers, so why should those Americans act any better?\"Similarly, the only explanation given for the pro-Communist/pro-Soviet attitude is a salve on a guilty conscience, specifically guilt because Henri and his class of intellectuals are rather well-off.  We know that they are well-off because they are drinking champagne, going out on the town, living in houses, and not going hungry.  When Henri contemplates supporting the Soviet Union - or when he feels guilt or doubt about pointing out that the Soviets have death camps - he explains to himself that only the Soviet Union is likely to feed millions of starving Chinese. According to Henri, \"American domination meant the perpetual oppression and undernourishment of all Oriental countries.\" (p. 242.) Of course, the Communists did have a pesky habit of treating people as things. (p. 241 - 242), Henri ratiocinates his way to supporting Communism by asking \"but what does that mean compared to feeding the hungry?\" (p. 242.)  Nadine, likewise, explains her brief foray into the Communist Party by explaining that if she had been a member of the Communist Party she would not have had to feel guilty about the hungry kids she saw in Portugal during her trip there with Henri. (p. 171.)  Likewise, there is a revealing scene where Anne is talking to some Americans about American support for Henry Wallace - FDR's former vice president until he was dumped in favor Harry S Truman because of Wallace's Leftist/Communist sympathies.  Anne receives the explanation that \"[t]hat man will never create a real leftist party.  He's just an alibi for people who want to buy themselves a clear conscience cheaply.\" (p. 553.)  A few pages later, Anne is shocked at finding Americans who don't agree that America will become fascist, and she drops the conversation because she realized that they \"wanted to continue leading their comfortable, carefree, esthetes' life; no argument would dent their genteel egotism\" (p. 563), which seems like a strange critique coming from a woman flits over to America at whim to have an affair and seems to want nothing more than to continue her comfortable, carefree, esthete's life.Of course, for all their talk of guilt and questions about how they should live, none of these people are ever seen as donating to charity, feeding the poor, or doing anything constructive about the plight of the hungry.  Henri does permit himself to be used as a front man for a committee established by the Communist Party to condemn France's mistreatment of rebel politicians after the suppression of the Malagasy Uprising (p. 576), but it is part of the sloth typical of the French intellectual left that this is not a project initiated by Henri.  Ironically, Henri agrees to act as the front man by a Communist who slandered him previously.  The Communist explains that the slander was \"just business\" which he had to do for the Party.  Apparently, Henri accepts the idea that party loyalty trumps honesty and good manners.We also see the development of the Anti-Communist Left, which leads some former fellow travellers to move into conservative circles.  Scriazzine - a refugee from Eastern Europe - takes the leading oar in attempting to get his colleagues to take an interest in the violation of human rights on the left, mostly to no avail.  Lambert gets fed up with the mealy-mouth temporizing of Dubrieulh concerning the thuggishness of the Communist Party and eventually aligns with the conservative writer Volange - about whom it is stipulated that he is somehow unworthy simply because he is conservative and seems to drink too much, albeit he is polite to Henri at social occasions.  Because of the Communist Party's own policies, anarchists were forced to choose between communism and \"Gaullism.\" (p. 584.)In short, what we see throughout The Mandarins is the demonizing of the Other that existentialism and Sarte were supposed to have condemned. The book exposes the \"bad faith\" of the French non-Communist intellectual left who are not living a life of autonomy; they are making decisions based on whether it will antagonize the Communist Party against them or will give aid to people who they feel are even worse than the adherents of philosophy with death camps, i.e., if it will give comfort to the right.In other words, the characters in The Mandarins are nothing if not about \"buying grace on the cheap\" rather than choosing to make a tough decision that will force them to break with their comfortable, carefree, esthetes' life and their genteel egotism.Henri is the archetype of this bad faith.  Everything he does involves temporizing based on the feelings of other people.  He does write an expose of the Soviet death camps, but he waters it down as much as he can.  He wants to maintain the autonomy of L'Espoir, but he doesn't want to offend Dubrieulh.  He permits himself to commit perjury for his Quisling lover.I wondered throughout the book if this was the message that de Beauvior intended to communicate. I can't imagine that it was, although the bad faith of the left circa World War II is similarly attested to in George Orwell's Homage to Catalonia where it seemed that so long as the form of a socialist society was maintained, the fact that the government was permitting the murder of priests and the burning of churches, and the Communists were using private torture facilities to punish their political enemies was a problem of means, not ends.  Ultimately, Henri and Dubrieulh agree that their own temporizing and desire to have their cake and eat it too, to be autonomous heroes of conscience who make sure that they don't fall out of favor with the right sort of people, proves that \"personal morality just doesn't exist.\" (p. 518.)Was it de Beauvior's intent to leave a massive text showing the flaws and limitations of the non-communist Marxist worldview?  I am not sure, but that seems to be what she did."}, {"review_sentiment": 5.0, "review_text": "I just finished reading Simone de Behavior's masterpiece, The Mandarins. I have been reading it for a while, the novel weighs in at just over 600 pages. It was very satisfying and I hated to see it end. It holds a special place in my heart as it is populated with the fictional equivalents of some of my favorite literary figures: Simone herself, Jean Paul Sartre, Albert Camus, Arthur Koestler, and Nelson Algren. One can easily see why it won France's most prestigious award, The Prix Goncourt. The novel presents a fascinating account of postwar France and how a group of intellectuals struggled in the aftermath trying to rebuild a just society. I particularly liked Simone's stylistic approach to the book, switching from third person in Paris, to first person in Chicago when she described her passionate love affair with Nelson Algren. In the end, we will always have Paris. I remember it well: the Germans wore gray you wore blue."}, {"review_sentiment": 3.0, "review_text": "I have read a part of The Mandarins by Simone de Beauvoir. The version I am reading is in 3 parts, and I read the first part which has the subtitle: Anne. The Mandarins is a roman-à-clef which describes the intellectual left-wing millieu in post WW2 Paris. The central character of the account is \"Henri\" which is considered to be Albert Camus. It's interesting to see the left-wing movement at this place and time. All the people in the millieu continously suffer bad conscience because many of their political friends died in the resistance and in concentration camps inflicted by the Nazis and Fascists during WW2, so they feel somehow guilty about still being alive. Henri is the editor of a small newspaper L'espoir (The Hope), but it's difficult for him to stay independent, he needs money for the newspaper to survive. They are several parties who are willing to support him, like the communists or SRL (a liberal, non-Communist political group), but they all want to suppress the independance of L'espoir. Also American agents contact Henri offering him support, but on the condition that he must not write critical about the Portuguese dictator Salazar, because the Americans are negotiating army bases on the Azores with Portugal. Henri is a person asking questions and as he says himself in the novel: That if you continue asking questions the meaningnessless of life eventually stares you in the head. So the great void is lurking all the time in Henri's life. The book somewhat describes a male chauvinsistic millieau. The womans in the book mostly play the role of lovers to often infidel men. Often a young womans insight into the political intellectual affairs of the men goes through the bed. One gets a sense of a young Simone de Beauvoir sitting on the lap of these older intellectual men taking notes for her novel. It's quite interesting to witness the intellectual left-wing at this place and time. The people are quite earnest about their political aims, they see it as a struggle for life and death about the future of the world. The men also feel insulted in their France national pride. During WW2 they had envisioned themselves in a postwar world forming the new world, but then they come to learn that France is just a little part of Europe having little to say to the greater powers of the world like USA and USSR. It's intesting to see the development of movements in history. The socialism somewhat started with philosophers like Marx in the mid 19th century. In the mid 20th century people are still very earnest about their cause. And then you look at left-wing today in Europe, which is a middle-class phenomena, using some of the same phraseology but actually only feeling contempt towards the lower classes of society."}]}, "authors": ["Simone de Beauvoir"], "isbn": "0393318834", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Mandarins", "word_cloud": "really bad shape smell impress amaze condition edition many decade ago never forget put favorite time give wonderful perspective male female situation probably folk friend thought bit tedious write truly present great long winter everything simone simone write else get understand require knowledge french history literary figure time perfect state interesting look live french intellectual try rebuild world post environment account closely follow life recommend anyone interested live french french culture good favorite part focus role intellectual character different opinion opinion change course seemingly endless setback give despair rebel circumstance someone antipathy existentialism feminism french soap opera come expect loathing experience attitude turn quite rapidly write plot fascination watch internal debate french leftist come term recent impotence nation consequently irrelevance face upstart gauche belong fifth rate nation outmode era something think write least translation excellent sentence fairly simple direct frequent instance observation charm example daughter first person figure join observe soon begin examine act word light historical materialism p plotting use technique employ perspective character figure central character story narrated third person central character story move first person narrative change write perspective interesting sometimes loop cover scene time previously narrate see scene tell soap opera focus interaction people newspaper start name marry seem fond find cloy love stifle work question keep independent leftist newspaper suck plan analog turn house propaganda organ political conceives broad leftist front align succumb force personality apparent submissiveness regret decision issue print expose soviet death camp split judging far give aid comfort allow death camp continue residual adherence idea commitment truth transcends long political ratiocination see philander affair eighteen year old daughter take quisling actress result perjure nazi collaborator return connive trap marriage get pregnant go younger friend go leftist journalist right wing newspaperman wife go woman grip obsessive compulsion husband insanity subject fortunately save story le interesting seem mostly obsession sex analog seem fairly meaningless go plot sex husband couple stay meet lewis american writer becomes infatuate go page wonderful love great love woman age year old dowager ember passion die go page hurt love woman age contemplate suicide material gold soap opera lover impress largely felt clue talk idea love seem kind examined narcissism frankly become annoyed puzzle approach feminism permit talk child point advise go believe brain inside little skull p noted review base woman seem value reference men attach seem rather misogynistic view plot excellent example introduces poison contemplate take end earlier scene involve character name con interview seem puzzle scene effect story publish interview see different time pop unexpectedly different point enjoy see life develop caught interest historical value keep time historical event retreat surrender use bomb show attitude french intellectual large part take problem problem coterie intellectual want want full commitment much le anything else want cake eat left control refuse permit use patsy big issue intellectual seem support seem never question support course go support allegiance seem matter conformity class expectation read seem french make decision base project attitude enemy thus number different occasion friend describe fear loathe become colony fear loathe never express term somehow uncivilized uncultured never able control bomb description mean colonized power specifically colony french colony attractive option get sense french intellectual basically say something gosh know act colonizer act better explanation give attitude guilty conscience specifically guilt class intellectual rather know drink champagne go town living house go hungry contemplate support feel guilt doubt point soviet death camp explain likely fee million starve chinese accord henri american domination mean perpetual oppression undernourishment oriental country p course pesky habit treat people thing ratiocinate way support ask mean compare feed hungry p likewise explain brief foray explain member guilty hungry kid saw trip p reveal scene talk american support former vice president dump favor sympathy receive explanation man never create real leftist party alibi people want clear conscience cheaply p page later shock finding agree become fascist drop conversation realize want continue lead comfortable carefree aesthetes life argument genteel egotism seem strange critique come woman flit whim affair seem want nothing continue comfortable carefree aesthete course talk guilt question live none people ever see donate charity feed poor anything constructive plight hungry permit use front man committee establish condemn mistreatment rebel politician suppression part sloth typical french intellectual left project initiate agree act front man slander previously explain slander business accept idea party loyalty trump honesty good also see development lead former fellow traveler move conservative circle refugee take lead attempt colleague interest violation human right leave mostly avail get feed temporize concern sluggishness eventually align conservative writer stipulate somehow unworthy simply conservative seem drink much polite social occasion policy anarchists force choose communism p short see demonize other existentialism suppose condemn expose bad faith french intellectual leave living life autonomy make decision base antagonize aid people feel even worse adherent philosophy death camp give comfort word character nothing buy grace cheap rather choose tough decision force break comfortable carefree aesthetes life genteel bad faith involve temporize base feeling people write expose soviet death camp water much want maintain autonomy want offend permit commit perjury wonder message intend communicate bad faith leave circa similarly attest seem long form socialist society maintain fact government permit murder priest burn church use private torture facility punish political enemy problem mean end ultimately agree temporize desire cake eat autonomous hero make sure fall favor right sort people prove personal morality exist p intent leave massive text show flaw limitation marxist worldview sure seem finish read read weighs page satisfy hat see end hold special place heart populate fictional equivalent favorite literary figure simone jean easily prestigious present fascinate account postwar group intellectual struggle try rebuild society particularly like stylistic approach switch third person first person describe passionate love affair end always remember well wear gray wore blue part version read part first part subtitle describe intellectual milieu post central character account consider interest movement place time people milieu continuously suffer bad conscience many political friend die resistance concentration camp inflict feel somehow guilty still alive editor small newspaper difficult stay independent need money newspaper survive several party willing support communist liberal political group want suppress independence also american agent contact offering support condition critical dictator negotiate army base person ask question say continue ask question meaninglessness life eventually star head so great void lurking time life somewhat describes male chauvinistic millieau woman mostly play role lover often infidel men young woman insight political intellectual affair men go bed get sense young sit lap older intellectual men take note quite interesting witness intellectual place time people quite earnest political aim see struggle life death future world men also feel insulted national pride envision postwar world form new world come learn little part little say greater power world inset development movement history socialism somewhat start philosopher mid century mid century people still earnest cause look today phenomenon use phraseology actually feel contempt towards lower class society", "genres": ["Fiction & Literature", "WWII"], "summary": "\"Salty, frank, and realistic.\" ― San Francisco Chronicle\r\n\r\nIn her most famous novel, The Mandarins, Simone de Beauvoir takes an unflinching look at Parisian intellectual society at the end of World War II. In fictionally relating the stories of those around her ― Jean-Paul Sartre, Albert Camus, Arthur Koestler, Nelson Algren ― de Beauvoir dissects the emotional and philosophical currents of her time. \r\n\r\nAt once an engrossing drama and an intriguing political tale, The Mandarins is the emotional odyssey of a woman torn between her inner desires and her public life. \"Much more than a roman a clef . . . a moving and engrossing novel.\" ― New York Times", "asin": "0393318834", "rank": "67358", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41OaQ10ZmVL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}