{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 4, "rating": 3.6, "reviews": [{"review_sentiment": 2.0, "review_text": "Yes: a great yarn, but the writing is often pretentious, clumsy and obscure. This is not the fault of the translator: even educated French-speakers are baffled about the meaning of some sentences in the French version. Why any sane person would choose this book in French as suitable for second-language school students is beyond me."}, {"review_sentiment": 5.0, "review_text": "Reading Rufin is always such a thrill. And since, I believe, he writes in French, I have to applaud whomever has done the translating to English, perhaps he himself has done so. Every sentence of this man's writing is a pleasure to read and the fact that the sentences weave into such wonderful stories with amusing characters amplifies the bliss of reading his works. The story is sweetened by the fact that it's based on a factual historical account of the early attempts to colonize the area that is present day Rio De Janeiro.  Rufin has novelized that story quite well. One thing I particularly liked was the positive light shown on the native population in this story.  Another is the courage and coming of age developments of the children that were brought along to act as interpreters (based on the expectation that children were better able to learn a new language quickly). Fascinating cultural practices are fleshed out as well, case in point cannibalism.  I want to explain that better but you must read the book for the story does it better."}, {"review_sentiment": 4.0, "review_text": "Rufin's story is great adventure told by a subtlety humorous narrator-no small achievement given the seriousness of Brazil Red's themes.  This would also be a terrific book for advanced young readers, age fourteen and up. A rare book that makes history  real, entertaining, and meaningful. Because of its child protagonists, Just and Colombe, Brazil Red favorably reminded me of Philip Pullman's The Golden Compass."}, {"review_sentiment": 4.0, "review_text": "If you approach this book expecting high literature, you're going to be disappointed. It is not cerebral and the writing is at time clumsy. But if you enjoy a historical novel full of derring-do and exotic locales, with good guys and bad guys and a forest full of sixteenth-century proto-Brazilians, go ahead. As in all good adventure yarns, the love scenes (except with the treacherous betrayer) provide nothing but a slowing down of the action. I was driven to research the history of \"la France Antarctique\" and was introduced to a bit of French history I had never even heard of. I've already passed my copy on to a friend who has reported he's as gripped as I was. And he's a professor of French literature!"}]}, "authors": ["Jean-Christophe Rufin"], "isbn": "0393336549", "longitude": 0.0, "periods": ["1500s"], "title": "Brazil Red", "word_cloud": "great yarn write often pretentious clumsy obscure fault translator even educate baffle meaning sentence french version sane person french suitable school student read always thrill believe write french applaud whomever do translate english perhaps do sentence man write pleasure fact sentence weave wonderful story amuse character amplifies bliss read work story sweeten fact base factual historical account early attempt colonize area present day novelize story quite well thing particularly like positive light show native population story courage come age development child bring act interpreter base expectation child better able learn new language quickly cultural practice flesh well case point cannibalism want explain better story better story great adventure tell subtlety humorous small achievement give seriousness theme also advanced young reader age fourteen rare make history real entertaining meaningful child protagonist favorably remind compass approach expect high literature go disappoint cerebral write time clumsy enjoy historical full exotic locale good guy bad guy forest full go ahead a good adventure yarn love scene treacherous betrayer nothing slow action drive research history introduce bit french history never even already pass copy friend report gripped french literature", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "An extraordinary adventure, set against a forgotten event of the Renaissance: the French colonization of Brazil.\r\n\r\nBrazil Red tells the story of two orphaned children, Just and Colombe, who are dragged off on the French colonizing expeditionthey are meant to learn the native languages and act as interpreters. Everything in this novel is outsized: the setting, a jungle still populated by cannibals; the characters, including Villegagnon, the expedition's eccentric leader, who might be a model for Cyrano or d'Artagnan; and the events, a dress rehearsal for the Wars of Religion ten years in the future. \r\n\r\nThe story is based on a factual historical account of the early attempts to colonize the area that is present day Rio De Janeiro.\r\n\r\nPacked with portraits, landscapes, and action, Brazil Red is a novel about coming of age and discovering love. On a deeper level, the story follows the destinies and decisions of Just and Colombe, presenting two conflicting views of man and nature. On one hand, a conquering European civilization, offering liberation but delivering death. On the other, the Indian world, with its sensuality, its harmony, its sense of the sacred, its continual call to happiness.", "asin": "0393336549", "rank": "3023433", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/51ymAQLVeyL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}