{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 116, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "EXCELLENT INTERESTING HISTORY BOOK WELL PUT TOGETHER HISTORICALY"}, {"review_sentiment": 5.0, "review_text": "A phenomenally interesting book about Istanbul, a hotel and Turkey during the formation of the Turkish Republic.This book looked interesting, and you don't have to be a Turkophile to find this history fascinating.  The book is so well-written, the flow of the narrative is wonderful and the stories are just so engrossing.  Absolutely, a wonderful exposition of the end of World War and the collapse of the Ottoman Empire and the beginning of the modern Turkish Republic.  Having seen the movie The Water Diviner (amongst some others), the period is really wonderfully evoked by this author.Highly recommended."}, {"review_sentiment": 4.0, "review_text": "great read"}, {"review_sentiment": 5.0, "review_text": "Well written and researched"}, {"review_sentiment": 5.0, "review_text": "A delightful and reliable survey of early 20th Century Istanbul!  Sound history, reliable and a delight to read.  A great story well told!"}, {"review_sentiment": 5.0, "review_text": "And history made in Istanbul during the two world wars. \"Quarter of  the Jews that made it to  Palestine during Second World War passed through Istanbul \""}, {"review_sentiment": 5.0, "review_text": "I love the book! Changed my way of looking at and thinking about this beautiful city. This book provides so much information about this historical city in a very fun way."}, {"review_sentiment": 5.0, "review_text": "Been there, great book."}, {"review_sentiment": 4.0, "review_text": "Fascinating historical background of a melting pot of Eastern and Western politics, religions, philosophical and military influences. Islam, Jewish, Christian, Russian Orthodox and Catholic did overlap and learned not only to live together, but also how to govern together. The social and political power exchanges are interestingly presented for the reader to better understand the critical historical role of Istanbul/Constantinople. In parts of the story, I found the detail exhausting, though accurate. However, a good read which I am glad to have experienced!"}, {"review_sentiment": 5.0, "review_text": "Wow, what a delight to have this book in my library. If you love Istanbul, you'll love this book."}]}, "authors": ["Charles King"], "isbn": "0393351866", "longitude": 28.9651646, "periods": ["1900s"], "title": "Midnight at the Pera Palace: The Birth of Modern Istanbul", "word_cloud": "excellent phenomenally interesting hotel formation look interesting find history fascinate flow narrative wonderful story engross absolutely wonderful exposition end collapse begin see movie among st others period really wonderfully evoke recommend great well write research delightful reliable survey early history reliable delight great story well tell history make world war make pass love change way look think beautiful city provide much information historical city fun way great fascinate historical background melt pot politics religion philosophical military influence overlap learn live together also together social political power exchange interestingly present better understand critical historical role part story find detail exhaust accurate however good glad experienced delight library love love", "genres": ["History"], "summary": "“Timely . . . brilliant . . . hugely enjoyable, magnificently researched and deeply absorbing.”―Jason Goodwin, New York Times Book Review\r\n\r\nAt midnight, December 31, 1925, citizens of the newly proclaimed Turkish Republic celebrated the New Year. For the first time ever, they had agreed to use a nationally unified calendar and clock. Yet in Istanbul―an ancient crossroads and Turkey's largest city―people were looking toward an uncertain future. \r\n\r\nNever purely Turkish, Istanbul was home to generations of Greeks, Armenians, and Jews, as well as Muslims. It welcomed White Russian nobles ousted by the Russian Revolution, Bolshevik assassins on the trail of the exiled Leon Trotsky, German professors, British diplomats, and American entrepreneurs―a multicultural panoply of performers and poets, do-gooders and ne’er-do-wells. During the Second World War, thousands of Jews fleeing occupied Europe found passage through Istanbul, some with the help of the future Pope John XXIII. At the Pera Palace, Istanbul's most luxurious hotel, so many spies mingled in the lobby that the manager posted a sign asking them to relinquish their seats to paying guests.\r\n\r\nIn beguiling prose and rich character portraits, Charles King brings to life a remarkable era when a storied city stumbled into the modern world and reshaped the meaning of cosmopolitanism.\r\n\r\n32 photographs", "asin": "0393351866", "rank": "442030", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51fv5M0A7-L.jpg", "country": "Turkey", "story_arc": ["Tragedy", "Things only get worse"]}