{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 251, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "I think it was a little under developed. I liked the different perspectives and the plot but halfway through I felt like the author was just trying to finish it up."}, {"review_sentiment": 5.0, "review_text": "Great Condition"}, {"review_sentiment": 2.0, "review_text": "Writing style is inconsistent and characters are not well developed"}, {"review_sentiment": 4.0, "review_text": "This novels got commentary on racial issues, cheating in relationships, power, and culture. Decent read, but some of the translated material is difficult to understand at times."}, {"review_sentiment": 5.0, "review_text": "The copy of this book is beautiful and arrived very swiftly. I also liked how the book presented a side of the story that the text that its main character was based off- \"Jane Eyre\"- neglected to mention. I would recommend this text to anyone seeking more information on Bronte's Bertha Mason."}, {"review_sentiment": 5.0, "review_text": "The end of \"Jane Eyre\" will never feel happy again."}, {"review_sentiment": 5.0, "review_text": "This is one of my all-time favorite novellas.  It feels like a book ahead of its time, considering how it challenges paternalistic structures and shifts modern perspectives on a classic literary work.  Bronte certainly pushed the envelope in Jane Eyre by creating a heroine who bucked traditional feminine ideals, but Rhys takes it one, large step further.  Bertha is no longer the beastly villain.  Rather, Rhys humanizes her and fleshes out her backstory, and we as readers come to appreciate the complex powers at play in Antoinette's life--colonialism, racism, sexism, spirituality, psychology... Antoinette defies categorization, and so she is stripped of her individuality, dehumanized, and reshaped into a more palatable (read: submissive) woman.  This is an important book for women worldwide, and I share it with all my friends.  Such an enduring masterpiece!"}, {"review_sentiment": 4.0, "review_text": "Useful in class."}, {"review_sentiment": 2.0, "review_text": "Personally, I hated this book. The edition is nice, though."}, {"review_sentiment": 5.0, "review_text": "This book changed my view of Mr. Rochester.  I always thought of him as poor Mr. Rochester, forced into an arranged marriage with a mad woman and how kind of him not to put her in an asylum.  Now I think, with all of his money, he could have cared for her much better.  But, it was punishment, not kindness.  This book was a quick read and wonderfully written.  I never gave Antoinette much thought although Jane Eyre has always been one of my favorite stories.  Very good book."}]}, "authors": ["Jean Rhys"], "isbn": "0393352560", "longitude": 0.0, "periods": ["1800s"], "title": "Wide Sargasso Sea", "word_cloud": "think little develop like different perspective plot halfway felt author try finish condition write style inconsistent character well develop novel get commentary racial issue cheat relationship power culture translate material difficult understand time copy beautiful arrive swiftly also like presented side story text main character base neglect mention text anyone seek information end never feel happy favorite novellas feel ahead time consider challenge paternalistic structure shift modern perspective classic literary work certainly push envelope create heroine buck traditional feminine ideal take large step longer beastly villain humanize flesh backstory reader come appreciate complex power play life colonialism racism sexism spirituality psychology defy categorization strip individuality dehumanize reshape palatable submissive woman important woman worldwide share friend such endure masterpiece useful class personally hat edition nice change view always think poor force arrange marriage mad woman kind put asylum now think money much better punishment kindness quick wonderfully write never give much think always favorite story very good", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "This “tour de force” (New York Times Book Review) celebrates its 50th anniversary.\r\n\r\nWide Sargasso Sea, a masterpiece of modern fiction, was Jean Rhys’s return to the literary center stage. She had a startling early career and was known for her extraordinary prose and haunting women characters. With Wide Sargasso Sea, her last and best-selling novel, she ingeniously brings into light one of fiction’s most fascinating characters: the madwoman in the attic from Charlotte Brontë’s Jane Eyre. \r\n\r\nThis mesmerizing work introduces us to Antoinette Cosway, a sensual and protected young woman who is sold into marriage to the prideful Mr. Rochester. Rhys portrays Cosway amidst a society so driven by hatred, so skewed in its sexual relations, that it can literally drive a woman out of her mind.\r\n\r\nA new introduction by the award-winning Edwidge Danticat, author most recently of Claire of the Sea Light, expresses the enduring importance of this work. Drawing on her own Caribbean background, she illuminates the setting’s impact on Rhys and her astonishing work.", "asin": "0393352560", "rank": "19359", "city": "Dominica", "image": "https://images-na.ssl-images-amazon.com/images/I/51kbodhNI5L.jpg", "country": "Jamaica", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}