{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 36, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "HIstorical fiction at best. I read it years ago and bought this as a gift for a friend going to Ethiopia. Isfahan was just as good."}, {"review_sentiment": 5.0, "review_text": "I loved this jaunt through a past century: Morocco, Abyssinia, France.  A good story to illuminate what those times were.The writing is  translated from the initial French text and is a bit wordy but is wonderfully descriptive."}, {"review_sentiment": 4.0, "review_text": "This is an entertaining book.  I would recommend it for easy reading."}, {"review_sentiment": 5.0, "review_text": "and no one is suprised! A fictional story about XVIIth/XVIIIth century Abyssinia (today's Ethopia) based on the memoirs of the French doctor Charles Poncet, one of very rare Europeans (or westerners) to enter the country that did not want the foreingers on its soil. His testimony describes Ethiopia and Gondar, its capital city of these times in a very detailed way. In the background of this main plot, the Jesuits plotting to bring real faith to Abyssinians (let's not forget that Abyssynia met with Christian faith in early 4th century and did not need any \"christianization\"). You won't stop reading this novel before it ends!"}, {"review_sentiment": 5.0, "review_text": "get it! excellent novel, and difficult to find a used copy. better than his other novel isfahan. may have to buy another copy :)"}, {"review_sentiment": 2.0, "review_text": "Yet another interesting concept, well begun, but ultimately retreating to cliché. The first half of the book is quite good - detailing the travels of an embassy from Louis IV to the Negus (emperor) of Abyssinia in 1699. The novelist makes good use of the intrigues and mistrust among the various Catholic and other Western factions. The hero is a young herbalist whose medical knowledge gives him near miraculous powers, and provides several easy escapes from intricate plot devices. But these sections do impart a good sense of what it might be like to travel in these then unknown parts of the world, down the Nile, through Egypt and the Sudan, and ultimately to Ethiopia. (A good map would have been handy for this, as the areas involved are not well-known, even today.) But, about half way through, the descriptions and background can't hide the predictability of the plot, and the Candidean romantic subplot detracts from the overall effect."}, {"review_sentiment": 4.0, "review_text": "This is a tale of the adventures and travails of a French doctor living in Egypt during the reign of Louis XIV (i.e. the seventeenth century).  One could describe this novel as an attempt to mix the best of Patrick O'Brian, William Thackeray, and Maurice Druon, although this work falls far short of the lofty heights of literature achieved by this triumverate.  This is a translation of a work originally written in French that won the author the prestigious Prix Goncourt award for Best First Novel.  Must have been a lean year.  The main character, Jean-Baptiste Poncet, is a self-taught doctor living in Cairo.  He is very much the modern (20/21st century) man, and holds few of the ideals and prejudices of his 17th century contemporaries.  The story centers on a journey that Poncet and several companions take through Egypt into the wilds of Abyssinia nominally to bring catholicism to the natives and expand the realm of both Louis XIV and the Catholic Church.  This is a good effort at historical fiction by Rufin, but ultimately it falls short of the likes of Druon, and probably not of enduring value.  The characters are one dimensional and cliched (the scheming priests, the ministerial sycophant, the greedy Arab merchant, etc.).  The author never succeeds in painting a picture of the land, of the people, or of the culture of the time.  I never felt that I was immersed in 17th century Egypt, and I learned almost no history or culture.  The plot is entirely predictable, and the love affair tedious and common.  There are a few flashes of greatness in this novel, and I generously rated this book at four stars (3.5 stars is probably fair) because of the obvious thoughtful effort put in by the author, but there are just too many fatal weaknesses to label this a great novel.  Fundamentally, this book just doesn't have the `feel' of a great work of historical fiction.  This is a decent, but not outstanding, novel.  I look forward to reading more from Mr. Rufin as he refines his craft."}, {"review_sentiment": 4.0, "review_text": "It's an exciting novel of merit. Jean-Christophe Rufin's book \"The Abyssinian\" combines intrigue, drama, adventure, romance, and more intrigue worthy of the time spent reading it.Set in 17th-century Cairo during the reign of Louis XIV, Jean-Baptiste Poncet, is the young protagonist, a French doctor who, alas, is practicing without a license in Egypt. Through his connections with the French consul, he is dispatched on a diplomatic mission to the King Negus, of Abyssinia to try to open up diplomatic opportunities. It is a dangerous mission, as Christians are not welcomed following, some 50 years prior, the expulsion of the Jesuits from the area. And during the course of the book, Poncet has to confront many personal obstacles, both physically and emotionally.A \"period piece\" of the first water, \"The Abyssinian\" combines the typical melodrama of such a tine in literature-the daring adventures, the daring romances, the daring intrigues. Rufin seems to have captured well these characteristics as he's made a novel that is compelling to read, one that, despite the obvious melodrama, captures the reader's interest tout suite with lots of wit, creativity, and cleverness.To call this book \"larger than life\" is perhaps an understatement but it's what one would expect if it were written by 18th or 19th century novelists! I look for further Rufin works of fiction! (Billyjhobbs@tyler.net)"}, {"review_sentiment": 4.0, "review_text": "I really enjoyed this book and its sequel.  They are both \"simply\" adventure stories and are not on a par with other timeless literature or history/political analysis, but they took me to a place and time about which I know only a little and that I would otherwise never be able to see.  The characters are interesting if not so developed as, say, Holden Caulfield or any of Mary Renault's.That being said, I was sad when the adventure was over and the events, settings, and characters stayed with me for months.  I hope there will be a third book.  I haven't had this much fun for quite a while."}, {"review_sentiment": 3.0, "review_text": "The reviews of this book were glowing, but I found the book to be good but not great. It's a pleasant read but so are a lot of books. the writing (or at least the English translation) is not sparkling, and the plot is frankly pretty pedestrian. Good summertime reading."}]}, "authors": ["Jean-Christophe Rufin"], "isbn": "0393321096", "longitude": 2.3514992, "periods": ["1600s", "1700s"], "title": "The Abyssinian", "word_cloud": "historical fiction best year ago buy gift friend go good love jaunt past century good story illuminate time write translated initial french text bit wordy wonderfully descriptive entertaining easy reading surprise fictional story century today base memoir french doctor rare westerner enter country want foreigner testimony describe capital city time detailed way background main plot jesuit plot bring real faith meet christian faith early century reading end excellent difficult find use copy better isfahan copy yet interesting concept well begin ultimately retreat first half quite good detailing travel embassy emperor novelist make good use intrigue mistrust various factions hero young herbalist medical knowledge give miraculous power provide several easy escape intricate plot device section impart good sense travel part world ultimately ethiopia good map area involve even today way description predictability plot romantic subplot detracts overall effect tale adventure travail french doctor live reign seventeenth century attempt mix best work fall far short lofty height literature achieve triumvirate translation work originally write french author prestigious award lean year main character doctor living much modern century man hold ideal prejudice century contemporaries story center journey several companion take wild nominally bring catholicism native expand realm good effort historical fiction ultimately fall short like probably endure value character dimensional cliched scheme priest ministerial sycophant greedy merchant author never succeed painting picture land people culture time never felt immersed century learn almost history culture plot entirely predictable love affair tedious common flash greatness generously rat star star probably fair obvious thoughtful effort put author many fatal weakness label great great work historical fiction decent outstanding look forward read refines craft excite merit combine intrigue drama adventure romance intrigue worthy time spend reading reign young protagonist french doctor practice license connection french consul dispatch diplomatic mission try open diplomatic opportunity dangerous mission welcome follow year prior expulsion area course confront many personal obstacle physically period piece first water combine typical tine dare adventure dare romance dare intrigue seem capture well characteristic make compel obvious melodrama capture interest suite lot wit creativity call larger life perhaps understatement write century novelist look work fiction really enjoy sequel simply story par timeless literature analysis take place time know little otherwise never able see character interest develop say sad adventure event setting character stay month hope third much fun quite review glow find good great pleasant lot write least english translation sparkle plot frankly pretty pedestrian summertime reading", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In 1699, Louis XIV of France sent an embassy to the most mysterious of oriental sovereigns, the Negus, or King, of Abyssinia (modern-day Ethiopia).\r\n\r\nLouis' hope was to lure that country into the political and religious orbit of France. Jean-Baptiste Poncet, young apothecary/physician to the pashas of Cairo, is the hero of this romantic epic embroidering upon the known details of that long-forgotten embassy. Selected by the French consul to lead the mission. \r\n\r\nPoncet travels through the deserts of Egypt and the mountains of Abyssinia to the court of the Negus, thence to Versailles and back again. Along the way he falls madly in love with the consul's daughter, treats the Negus for a mysterious skin ailment, and gains a disastrous audience with the king of France.\r\n\r\n\"An absorbing and unforgettable book.\" Los Angeles Times", "asin": "0393321096", "rank": "347217", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/516QrtBHFcL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}