{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 1231, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Review A Clockwork OrangeA Clockwork Orange by Anthony Burgess was an interesting read. Right from the start, Burgess creates an interesting world of the nadsats with brutality and slang, while simultaneously creating a commentary on the government and the influence society has on youth. It creates a compelling tall of discontent, danger, and manipulation.Your humble narrator is a droog known as Alex. Even his name creates an interesting beginning allowing you to see someone who is powerful and strong. He has a love of Beethoven and violence. Something that the story revolves around. He leads a band of three others who violently attack a man coming from the library and then mug a shop owner all before going back and hanging out back at a pub. The story continues to show violence with the rape and brutality against a couple outside of the city.Burgess sets up the world through Alex’s eyes and voice leaving the audience to figure out the slang given based solely on everything else in the sentence. It makes it a hard read, especially early on until you find yourself fully entranced in the world. However, the greatest thing about his use of slang is how it de-sensitizes the reader to the brutality that is shown and done by the narrator. The slang creates a disconnected feeling that oddly makes the rape and assaults easier to cope with.Alex eventually finds himself at odds with his compatriots. He admonishes one of them, and it comes back to him tenfold which is only the beginning of this cause and effect nature of the book. Alex admonishes Dim. Dim beats him and allows him to get caught. Alex beats Billyboy near death. Billyboy and Dim beat him near death when they’re cops years later. Alex beats the writer and rapes his wife. The writer and his friends try to get Alex to kill himself. Alex brutalizes the man leaving the library. That man and several others attack Alex.The main drive of the story is the idea of free will. This is most prominently presented with the Ludovico technique that the state uses to ‘cure’ Alex. He can no longer do violence because it makes him sick. However, that sickness comes from the cure and not from himself. The same could be said about Alex himself. Alex was created because of his society that does not have any sort of order. His parents don’t seem to pay him much mind earlier in the novel, and then basically tell him to find someone else to go in the middle. The police are only seen well after crimes are committed in the beginning, and just as bad as the violent teens later. Alex was meanders through life as a product of his surroundings, and his choices become relative. The only true choice he makes is to step away from the violence and settle down at the end of the novel.Burgess tells a good story about freewill and the impact of government in society. It’s important to see the possible carnage that can happen when a government does not do its duty for the people, and continues to fight against itself instead of fighting for the people. It’s a great story to impart wisdom of ages past to the future, and allow us to strive to make sure such a time does not come to pass."}, {"review_sentiment": 5.0, "review_text": "great story, however it helps to know a Slavic language prior to reading as the main character speaks in an English/Slavic hybrid language which might be tricky for some to pick up without some prior exposure."}, {"review_sentiment": 5.0, "review_text": "If you liked the movie read the book it gives greater insight in to who Alex really is."}, {"review_sentiment": 4.0, "review_text": "I saw the Stanley Kubrick movie adaptation of this book many years ago but never read the book until now.  I'd say Kubrick did the book justice with his film.  In fact, I'd almost believe the book was written especially for him.Burgess wrote this story as a narrative with 15-year old Alex speaking, using language made up by the hoodlum teenagers in the story.  I felt this 'language' (actually just silly word replacement) was overdone and distracted from the story, even making parts confusing.  He could have done with less of that.  Also, there is too much use of the word like throughout the story.  I know it is common in speech to like throw that in occasionally, especially in youths, but Burgess seemed to add the word in the wrong places sometimes, making his sentences like awkward.  It was as if an old man was trying to sound cool by using the language of the younger generation, but wasn't quite getting it right.  I was like, you know, this is wrong.  Maybe Burgess' word count was too low, so he just added the word like to the story enough to get the count up.  I still enjoyed the book.  To me, this was a very interesting story that I took as a predecessor to the dystopian stories so common today.Spoiler alert.  In case there is anyone left who has not heard the whole story, don't read the next paragraph.I think the story is brilliant.  It is the story of a teenage, ultra violent, hoodlum being caught and imprisoned for murder and then rehabilitated using a brainwashing technique that removes his choice to do evil.  In the end, he is returned to his old self.  Was this the result of his injury from jumping out of a window onto the street or did the government take advantage of his unconscious state to undue the damage they did to his brain as a political maneuver?  Regardless of how it happened, the hoodlum Alex is back.  An extra chapter has him outgrowing his violent youth, ready to find a wife and raise a son. I'm not sure I think that last chapter was necessary, and it actually is not included in all versions of the book.  The version I read was the restored text version."}, {"review_sentiment": 4.0, "review_text": "I liked this book,but it took some deciphering. This to me was a coming-of-age type book with a violent twist."}, {"review_sentiment": 5.0, "review_text": "Great product and fast shipping!"}, {"review_sentiment": 1.0, "review_text": "couldn't get through the first couple pages"}, {"review_sentiment": 4.0, "review_text": "I will give most books a try even if I have heard negative. comments about it beforehand. Anthony Burgess certainly wrote a controversial book when he penned this tale of a vicious fifteen-year-old boy. This is a hard-hitting novel is a slam against societal over-saturation and over-stimulation of youth producing dehumanized people - criminals. This terror-filled book pulls no punches and is relentlessly violent. In Burgess's nightmarish future, criminals run rampant. The riveting but repulsive tale is told by Alex, a sociopath who has developed his own language of violence and contempt. His social ideology is like a Pandora's box to those he indoctrinates. He soon infects all around him and seems heel-bent on destruction, including his own. A Clockwork Orange is a frightening look into the face of evil and what should society do to 'help/redeem\" him. This is not a book for everyone but it is stellar effort."}, {"review_sentiment": 4.0, "review_text": "Intriguing and disturbing novel."}, {"review_sentiment": 5.0, "review_text": "great book thanks"}]}, "authors": ["Anthony Burgess"], "isbn": "0393312836", "longitude": -0.12574, "periods": ["1900s"], "title": "A Clockwork Orange", "word_cloud": "interest start create interesting world nadsats brutality slang simultaneously create commentary government influence society youth create compel tall discontent danger humble narrator drug know even name creates interest begin allow someone powerful strong violence story revolves lead band others violently attack man come library mug shop owner go back hang back story continue show violence rape brutality couple set world eye voice leave audience figure slang give base solely everything else sentence make hard especially early find fully entrance world however greatest thing use slang brutality show do narrator slang create disconnect feel oddly make rape assault easier cope eventually find odds compatriot admonish come back tenfold beginning cause effect nature admonish beat allow caught beat death beat death cop year later beat writer rape wife writer friends man leave library man several others attack main drive story idea free prominently present technique state use cure longer violence make sick however sickness come cure say create society sort order parent seem pay much mind earlier basically someone else go police see well crime committed begin bad violent teen later meander life product surroundings choices become relative true choice make step away violence settle end tell good story freewill impact government society important see possible carnage happen government duty people continue fight instead fight people great story impart wisdom age future allow strive sure time come pas great story however help language prior read main character speaks hybrid language pick prior exposure like movie give greater insight really saw movie adaptation many year ago never say justice film fact almost believe write especially write story narrative old speaking use language make hoodlum teenager story felt actually silly word replacement overdone distract story even make part confuse do le also much use word story know common speech throw occasionally especially youth seem add word wrong place sometimes make sentence awkward old man try sound cool use language younger generation quite get right like know wrong maybe word count low add word story enough get count still enjoy interest story take predecessor dystonia story common alert case anyone leave heard whole story next think story brilliant story teenage ultra violent hoodlum catch imprisoned murder rehabilitate use brainwash technique remove choice evil end return old self result injury jumping window street government advantage unconscious state undue damage brain political maneuver happen hoodlum back extra chapter outgrow violent youth ready wife son sure think last chapter necessary actually include version version restore text version like take decipher type violent twist product fast shipping first couple page give even hear negative comment beforehand certainly write controversial penned tale vicious boy slam societal youth produce dehumanized people criminal pull punch relentlessly violent nightmarish future criminal run rampant rivet repulsive tale tell sociopath develop language violence social ideology box indoctrinate soon infect seem destruction include frighten look face evil society everyone stellar effort intrigue disturb great thanks", "genres": ["Memoir", "Fiction & Literature", "Science Fiction"], "summary": "\"Great Music, it said, and Great Poetry would like quieten Modern Youth down and make Modern Youth more Civilized. Civilized my syphilised yarbles.\"\r\n\r\nA vicious fifteen-year-old droog is the central character of this 1963 classic. In Anthony Burgess's nightmare vision of the future, where the criminals take over after dark, the story is told by the central character, Alex, who talks in a brutal invented slang that brilliantly renders his and his friends' social pathology.\r\n\r\nA Clockwork Orange is a frightening fable about good and evil, and the meaning of human freedom. When the state undertakes to reform Alex to \"redeem\" him, the novel asks, \"At what cost?\"\r\n\r\nThis edition includes the controversial last chapter not published in the first edition and Burgess's introduction \"A Clockwork Orange Resucked.\"\r\n\r\n“I do not know of any other writer who has done as much with language as Mr. Burgess has done here ― the fact that this is also a very funny book may pass unnoticed.” William S. Burroughs", "asin": "0393312836", "rank": "4470", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41Y5oe4rmlL.jpg", "country": "England", "story_arc": ["Tragedy", "Things only get worse"]}