{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 4, "rating": 3.1, "reviews": [{"review_sentiment": 1.0, "review_text": "Not for me so far. Will try it again"}, {"review_sentiment": 4.0, "review_text": "This one is much tougher sledding than some of his other books. I enjoyed it, and you really felt like you were swirling around in all the minds of the various characters, sometimes mixed together, but it's not really about plot, but about experience. If you like these kinds of books then you'll like this one, but I'd start with The End of The World or the Natural Order of Things first."}, {"review_sentiment": 5.0, "review_text": "Is this book really a threnody, as some claim, a song of lamentation for Antunes' characters? I'm not satisfied with this metaphor though I can agree there are plenty of sorrows in his book, set in \"...the steamy world of Lisbon's demimonde\" with drag queens and their entertainment amid sexual and drug abuse. The inside cover tries to give a road map of what the book is about, trying to smooth out some of the turbulent seas of ambiguity of the text itself. Each reader who actually reads the text, it seems to me, will have to constructed his or her own raft of imagination to get through. Otherwise, the reader's interest and concentration will be drowned. Different rafts; different book. As a poet, my raft was a place to absorb Antunes' poetic riches and inspiration for my own work. I was undisturbed by my inability to know for certain which character or mind was expressing itself or that I would lose the thread of the story frequently. I was astonished I could read extended pages somewhat lost as to what action was happening and yet know the feelings Antunes was communicating, probes into what it was like to be Carlos/Soraia, Judite, Gabriella, Dona Amelia. Paulo, who some see as the principal character, I saw as more or less a foil rather than a protagonist. However, my raft floated quite well with minimum concern for plot or closure. In fact I thought the ending, which I will not disclose, was too novel-like compared with the trip I was completing. I was beached.  I doubt there will ever be a final consensus about What Can I Do When Everything's on Fire? I think Antunes has taken his title most seriously, and each reader is on his or her own. But even if you conclude it \"caters to confusion and instability,\" if you are a poet, it is a treasure chest to be pillaged and plundered.  Don't read this book first if you have not read other works of Antunes. His Fat Man and Infinity is the best place to start. Then read one of his other novels, say, Knowledge of Hell, especially if you have worked or been in a state run mental institution.  Then take on the Fire."}, {"review_sentiment": 3.0, "review_text": "Antonio Lobo Antunes, the talented Portuguese novelist who has perennially been short-listed for the Nobel Prize, in his latest novel rendered into English by Gabriel Garcia Marquez' translator of choice Gregory Rabassa, produced a work that is absolutely fascinating, yet awfully challenging due to its artistry, licentious literary psychosis and dramatic density. Yes! it makes for a lugubrious clambering atop a dystopian heap of fragmentary observations and quotidian digressions that culminate into a climactic burrow of sorts. This is a work that should be read for the juggling peripheral avocations that testify to the supple pliancy of its narrative ingeniousness rather than for the merits, or demerits of its programmatic structural strains.What can I Do When Everything's on Fire begins with a three-page \"dramatis personae\" listing 71 characters (11 principal, 27 secondary, 33 tertiary - leaving out the supernumeraries). The list is well serving for without it, trudging through the work would be a task of daunting proportions. The comparison that have been designated with Joyce and Faulkner are raised primarily because of a style that seeks to give some order through a chaotic conflagration, but the combustible mannerism is burning brightest within this sleight-of-hand, in fact the cloud of smoke that frustrates this maze of a production on occasions seems to rise above the cut-throat dry human drama only to vanish as quickly as it appears. It is a poetic threnody of madness and despair that finds its identity in a searing scorching savagery that streams through the prescient chambers of a conscious dissolution as it were a river of lava washing the passages that are illuminated and absolved by an incandescent impressionism that evacuates and overwhelms.The plot is rather simple, and allowing for the confusing mechanics of the stream-of-consciousness bravado employed by Antunes, it tells the story of Paulo, the son of Lisbon's most flamboyant drag queen, as he tries to trace his youth and psychologize his life while excavating the madness that has sustained it. The prose is stunted, it lacks punctuation, it applies neo-grammatical formations that trouble the narrative as it weaves its way through an hallucinatory world where dreams have more values than life and dreaming is a force that drives and feeds the fire that burns and consumes.Paulo has unresolved issues that stammer on as a host of colorful characters aggravate the rash of addictive and extraordinary tendencies inflamed beyond cooling. Paulo rushes through the demi-monde ambiance with two primary questions \"Who's my father?\" and \"Why doesn't my mother love me more?\" and sprays this search by way of heroin injected with a candor that buries the soul of social mores as innocence foolishly ignites the presence of a mysterious terrible angst.Raised by petty bourgeois guardians, Paulo is tutored in the ways of heroin addiction by the suicide-bound Rui, and he's eventually involved in a relationship with Gabriela, a maid at the mental ward where he is regularly committed, only to later sacrifice her sexual services for drug money. It's Arnofsky's Requiem for a Dream and Pie in prose, a menacing quest for self-knowledge amid the chaos of the present and the detritus of the past. All the while we await the final explosion where so much destitution becomes a pyre for the demigods of the universe as they become so impatient with the fate of these characters that they burn the threads that guide them altogether forgetting that someone must be in charge. However Antonio Lobo Antunes' virtuosity shines through such a moral conflagration where the sacrificial victim of such defamation seems to be human nature itself; as nothing makes sense and leads to nowhere save for its own mistrusted destiny.The story takes place over several decades or maybe just a few weeks or even days. At times it seems to be narrated by ghosts, but this could be just Paulo's fractured mind at work. The themes are death, disease, decay and skewed identity, all constants in Antunes' oeuvre. The oblique symbolism - ships, birds, fish and flowers - are typical of Antunes' works, and they are set ablaze here with no mercy or resistance.The complexity of the style makes it a harrowing read, the fragmentary, and at times hollow resonance, caters to confusion and instability, but it is not meant to be an easy book, or one to be savored for its lyrical fluidity, rather it frustrates all designations, every turn being a return and every return an escape, ultimately making of it a descent into a Hell where Heart of Darkness lies searing in all its luminescence."}]}, "authors": ["António Lobo Antunes"], "isbn": "0393329488", "longitude": -9.1365061, "periods": ["1900s"], "title": "What Can I Do When Everything's On Fire?", "word_cloud": "not far much sled enjoy really felt swirl mind various character sometimes mixed together really plot experience like kind start end first be really threnody claim song lamentation character satisfy metaphor agree plenty sorrow set steamy world demimonde drag queen entertainment sexual drug inside cover try give road map try smooth turbulent sea ambiguity actually read text seem construct raft imagination otherwise interest concentration drown raft different poet raft place absorb poetic rich inspiration work undisturbed inability know certain character express thread story frequently astonish page somewhat lose action happen yet know feeling communicate probe see principal character saw le foil rather protagonist however raft float quite well minimum concern plot closure fact think end compare trip complete beach doubt ever final consensus think attunes take title seriously even conclude caters confusion instability poet treasure chest pillage plunder first work best place start then novel say especially work state run mental institution then fire talented portuguese novelist perennially latest render translator choice produce work absolutely fascinate yet awfully challenge due artistry licentious literary psychosis dramatic density make lugubrious clamber atop dystonia heap fragmentary observation quotidian digression culminate climactic burrow sort work juggle peripheral avocation testify supple pliancy narrative ingeniousness rather merit demerit programmatic structural begin persona list character principal secondary tertiary leave supernumerary list well serve trudge work daunt proportion comparison designate raise primarily style seek give order chaotic conflagration combustible mannerism burn brightest fact cloud smoke frustrates maze production occasion seem rise dry human drama vanish quickly appear poetic threnody madness despair find identity sear scorch savagery stream prescient chamber conscious dissolution river lava wash passage illuminate absolved incandescent impressionism evacuate rather simple allow confuse mechanic bravado employ tell story son flamboyant drag queen try trace youth psychologist life excavate madness sustain prose stunt lack punctuation applies formation trouble narrative weave way hallucinatory world dream value life dream force drive feed fire burn unresolved issue stammer host colorful character aggravate rash addictive extraordinary tendency inflame cool rush ambiance primary question father mother love spray search way heroin inject candor buries soul social more innocence foolishly ignites presence mysterious terrible petty bourgeois guardian tutor way addiction eventually involve relationship maid mental ward regularly commit later sacrifice sexual service drug money prose menace quest chaos present detritus await final explosion much destitution become pyre demigod universe become impatient fate character burn thread altogether forget someone however virtuosity shin moral conflagration sacrificial victim defamation seem human nature nothing make sense lead nowhere mistrust story take place several decade maybe week even day time seem narrated ghost fractured mind work theme death disease decay skew identity constant oblique symbolism ship bird fish flower typical work set mercy complexity style make harrow fragmentary time hollow resonance caters confusion instability meant easy savor lyrical fluidity rather frustrate designation turn return return escape ultimately make descent lie sear luminescence", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A soaring, symphonic epic by the Portuguese master novelist, considered to be the \"heir to Conrad and Faulkner\" (George Steiner).\r\n\r\nThe razor-thin line between reality and madness is transgressed in this Faulknerian masterpiece, António Lobo Antunes's first novel to appear in English in five years. What Can I Do When Everything's On Fire?, set in the steamy world of Lisbon's demimonde―a nightclub milieu of scorching intensity and kaleidoscopic beauty, a baleful planet populated by drag queens, clowns, and drug addicts―is narrated by Paolo, the son of Lisbon's most legendary transvestite, who searches for his own identity as he recalls the harrowing death of his father, Carlos; the life of Carlos's lover, Rui, a heroin addict and suicide; as well as the other denizens of this hallucinatory world. \r\n\r\nPsychologically penetrating, pregnant with literary symbolism, and deeply sympathetic in its depiction of society's dregs, Lobo Antunes's novel ventriloquizes the voices of the damned in a poetic masterwork that recalls Joyce's Ulysses with a dizzying farrago of urban images few readers will forget.", "asin": "0393329488", "rank": "269356", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/41y0Ia7vN9L.jpg", "country": "Portugal", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}