{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 72, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Fascinating!  Took me right back to when I was there."}, {"review_sentiment": 5.0, "review_text": "satisfied"}, {"review_sentiment": 4.0, "review_text": "With a series of stories that travel through time and take place in different neighborhoods of Paris this book examines the complicated history and the rich, varied culture of Paris. Paris is like art itself ; it is mysterious, illusive, brutal, beautiful, violent, passionate, and sultry. This historical travelogue gives the reader a unique tour of Paris."}, {"review_sentiment": 4.0, "review_text": "Detailed stories of notable and interesting people in Paris's history."}, {"review_sentiment": 3.0, "review_text": "Quite a different type of history book.  Each chapter is a different story.  Be ready to be surprised by some of the stories.  Most were interesting but a couple challenged my interest.  Most chapters written like a historical novel adding conversations that would obviously not be known but I personally didn't mind that.  It made the stories more interesting and real.  Worth a read if you are very interested in the history of Paris."}, {"review_sentiment": 5.0, "review_text": "Great writer.  I'm stunned."}, {"review_sentiment": 1.0, "review_text": "I found this book tedious. It isn't history, it isn't historical fiction. You go from story to story wondering what's true. I don't need this kind of chimera approach to Paris. I was disappointed in Graham Robb. I think he needs a new publisher with an editor who can keep him corralled."}, {"review_sentiment": 5.0, "review_text": "An appreciated gift."}, {"review_sentiment": 5.0, "review_text": "I am still reading this book but I am finding it so interesting."}, {"review_sentiment": 5.0, "review_text": "Absolutely fascinating. Beautifully written by a person who knows and loves his subject. If I can't travel with Robb as the tour guide's tour guide, then this work will have to do."}]}, "authors": ["Graham Robb"], "isbn": "0393339734", "longitude": 2.3514992, "periods": ["1700s", "1800s", "1900s", "2000s"], "title": "Parisians: An Adventure History of Paris", "word_cloud": "fascinate right back satisfied series story travel time place different neighborhood examines complicate rich varied culture art mysterious illusive brutal beautiful violent passionate sultry historical travelogue give unique tour detailed story notable interesting people quite different type chapter different story ready surprise story most interesting couple challenge interest most chapter write historical add conversation obviously personally mind make story interest real worth interested great writer stun find tedious historical fiction go story story wonder true need kind chimera approach disappoint think need new publisher editor corral appreciated gift still read find interest absolutely fascinate write person know love subject guide tour guide work", "genres": ["History"], "summary": "The New York Times bestseller: the secrets of the City of Light, revealed in the lives of the great, the near-great, and the forgotten—by the author of the acclaimed The Discovery of France.\r\n\r\nThis is the Paris you never knew. From the Revolution to the present, Graham Robb has distilled a series of astonishing true narratives, all stranger than fiction, of the lives of the great, the near-great, and the forgotten.\r\n\r\nA young artillery lieutenant, strolling through the Palais-Royal, observes disapprovingly the courtesans plying their trade. A particular woman catches his eye; nature takes its course. Later that night Napoleon Bonaparte writes a meticulous account of his first sexual encounter. A well-dressed woman, fleeing the Louvre, takes a wrong turn and loses her way in the nameless streets of the Left Bank. For want of a map—there were no reliable ones at the time—Marie-Antoinette will go to the guillotine.\r\n\r\nBaudelaire, the photographer Marville, Baron Haussmann, the real-life Mimi of La Boheme, Proust, Adolf Hitler touring the occupied capital in the company of his generals, Charles de Gaulle (who is suspected of having faked an assassination attempt in Notre Dame)—these and many more are Robb’s cast of characters, and the settings range from the quarries and catacombs beneath the streets to the grand monuments to the appalling suburbs ringing the city today. The result is a resonant, intimate history with the power of a great novel. 16 pages of full-color illustrations", "asin": "0393339734", "rank": "238257", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51RMmAP6xPL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}