{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 150, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Laugh-out-loud funny!  I have read lots of Wodehouse, but this was my first actual Bertie & Jeeves novel.  I swear, nobody does that understated British humor like Wodehouse."}, {"review_sentiment": 5.0, "review_text": "Plenty of others have summarized the plot, so I'll say here simply that I laughed so hard as I read this that I was concerned about disturbing my (townhouse) neighbors. Wonderful, zany plot, fantastic dialogue -- perfect Wodehouse."}, {"review_sentiment": 5.0, "review_text": "The one word review of this book is \"Hilarious\". It's my third or fourth time I've read it and it pleasesIt is the classic Jeeves and Wooster story. Bertie has to steal a sliver cow creamer from Pop Basset without getting his spine pulled out by Roderick Spode - all the while trying to patch up the tiff between Madeline Basset and Gussie Finknottle. If the Finknottle/Basset marriage is off then Bertie will have to marry Madeline - because that is what a gentleman does. \"...after being blackmailed by an aunt at breakfast, I was now being blackmailed by a female crony before dinner. Pretty good going, even for this lax post-war world.\" [p 86]Thank goodness for Jeeves.But, it's not really about the plot - hilarious as it is - the plot is only there to set up the dialogue between Bertie and the rest of the cast. Here Bertie is describing Gussie trying to get away from Spode who wants to beat Gussie into a jelly. \"... confronted with Spode in the flesh, he now retreated to the wall and seemed, as far as I could gather, to be trying to get through it. Foiled in this endeavour, he stood looking as if he had been stuffed by some good taxidermist.\" [p 123]And when Bertie helps Gussie escape out a second floor window through the use of a sheet: \"I don't think I have ever assisted at a ceremony which gave such universal pleasure to all concerned. The sheet didn't split, which pleased Gussie. Nobody came to interrupt us, which pleased me. And when I dropped the suitcase, it hit Gussie on the head, which delighted Aunt Dahlia. As for Jeeves, one could see that the faithful fellow was tickled pink at having been able to cluster round and save the young master in his hour of peril. His motto is 'Service'\".[p 217] But of course there are plenty of pages left and the hour of Bertie's peril has only just started.This book is full of my favorite sayings of Bertie's- I don't mind people talking rot in my presences, but it must no be utter rot.[p 162]- He was more to be pitied than censured. [p 185]- I would have preferred to get oustide a curried egg or two. [p 186] [What a great way to say you want to eat something!]- ...like a Scottish elder rebuking sin from the pulpit [p 139]and of course my favorite of all time- What I want from you is less of the 'Well, really sir' and more of the buckling-to spirit. Think feudally Jeeves.I can't think of a better summer read. We still have a week or two of summer left - pick it up and have a laugh."}, {"review_sentiment": 5.0, "review_text": "P. G. Wodehouse is very funny, writes an interesting story which maintains one's interest at the same time, entertains. His writing makes one feel as if your in the U.K."}, {"review_sentiment": 5.0, "review_text": "Another place, another time- very charming when you're want to be transported to gentler times. Such a brilliant and elegant writer."}, {"review_sentiment": 5.0, "review_text": "Jeeves does the business, as usual, in this excellent romp.Several intertwined storylines are satisfyingly resolved by the fish-eating, gentleman's gentleman."}, {"review_sentiment": 5.0, "review_text": "One of the few  books where Bertie wooster is for a change portrayed as smart.Simply hilarious."}, {"review_sentiment": 5.0, "review_text": "Second reading through it was even better than the first!"}, {"review_sentiment": 5.0, "review_text": "One of the funniest novels in the English language. Do not deny yourself this peerless pleasure. Jeeves supplies the strategy Bertie needs to strike a blow against fascism and save himself from the living hell of domesticity."}, {"review_sentiment": 5.0, "review_text": "Bertie in his typical fashion clings to bachelorhood against all odds while still being a gentleman and loving nephew, only through the excellent efforts of Jeeves.If you love Sweetness and Light you will love this book."}]}, "authors": ["P. G. Wodehouse"], "isbn": "0393339815", "longitude": -0.12574, "periods": ["1900s"], "title": "The Code of the Woosters", "word_cloud": "funny lot first actual swear nobody understated british humor others summarize plot say simply laugh hard concern disturb townhouse neighbor zany plot fantastic dialogue perfect word review third fourth time pleases it classic jeeves story steal sliver cow creamer get spine pull try patch tiff marriage gentleman blackmail aunt breakfast blackmail female crony dinner good go even lax world p goodness really plot hilarious plot set dialogue rest cast here describe try away want beat jelly confront flesh retreat wall seem far try foil endeavor stand look stuffed good taxidermist p help escape second floor window sheet think ever assist ceremony give universal pleasure concern sheet split pleased nobody come interrupt pleased drop suitcase hit head delight faithful tickle pink able cluster round save young master hour motto p course plenty page leave hour full favorite saying mind people talk rot presence rot p pity censured p outside curry egg p great way say want eat something scottish elder rebuke sin pulpit p course favorite want le really sir spirit feud ally better summer still week summer leave pick laugh funny writes interest story maintain interest time entertain writing make feel place charming want transport gentler time such brilliant elegant writer jeeves business usual excellent intertwine story lines satisfyingly resolve gentleman gentleman wooster change portray hilarious second read even better first funniest novel english language deny pleasure supply strategy need strike blow fascism save live hell domesticity typical fashion cling bachelorhood odds still gentleman love nephew excellent effort love", "genres": ["Fiction & Literature", "Humour"], "summary": "Follow the adventures of Bertie Wooster and his gentleman’s gentleman, Jeeves, in this stunning new edition of one of the greatest comic novels in the English language. \r\n\r\nWhen Aunt Dahlia demands that Bertie Wooster help her dupe an antique dealer into selling her an 18th-century cow-creamer, Dahlia trumps Bertie's objections by threatening to sever his standing invitation to her house for lunch, an unthinkable prospect given Bertie's devotion to the cooking of her chef, Anatole. \r\n\r\nA web of complications grows as Bertie's pal Gussie Fink-Nottle asks for counseling in the matter of his impending marriage to Madeline Bassett. It seems Madeline isn't his only interest; Gussie also wants to study the effects of a full moon on the love life of newts. Added to the cast of eccentrics are Roderick Spode, leader of a fascist organization called the Saviors of Britain, who also wants that cow-creamer, and an unusual man of the cloth known as Rev. H. P. \"Stinker\" Pinker. \r\n\r\nAs usual, butler Jeeves becomes a focal point for all the plots and ploys of these characters, and in the end only his cleverness can rescue Bertie from being arrested, lynched, and engaged by mistake!", "asin": "0393339815", "rank": "64749", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51y-vyC1hiL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}