{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 47, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "GREAT BOOK"}, {"review_sentiment": 4.0, "review_text": "Preston is not only an excellent historian, but also one who can give perspective and objectivity to his beloved Spain.  What a history! So dark and menacing.  This wonderful country can't simply walk away from it all, it has to be somehow delivered!"}, {"review_sentiment": 5.0, "review_text": "Great \"Exhaustive!\" account of the Spanish Civil War atrocities. Of course like virtually every account of the SCW, this one tends to \"favor\" the Republican side. Wish someone somewhere would give us an account from the Nationalist side. Still a very good read. Anyone interested in the SCW should read this book."}, {"review_sentiment": 4.0, "review_text": "By many standards, Francisco Franco, the Spanish dictator in power from 1939-1975 is a forgotten murderer and despot. By virtue of his longevity in office and the increasing irrelevancy of Spain as a major international power, his regime seemed to become more of a relic; a lingering curio from another era with a bemedaled, pot-bellied, prancing buffoon in the seat of power. Yet, the catalogue of his crimes is vast and rivals the depredations of Pol Pot and Stalin, but is second to those of his supporters in Nazi Germany, both in terms of scale and mechanization, though perhaps not in brutality.To refresh and reveal to the annals of history these overlooked and/or submerged murders, Paul Preston has assembled this prodigious record of Francoist regime crimes. The catalogue is so extensive it's oftentimes overwhelming. The utterly gratuitous and generally vengeful murders, usually conducted by feudal landlords and their mercenary minions, adds another revolting dimension to the crimes. Yet, Franco and his fascist paladins reveled in the carnage. True enough that Francoist Spain eventually became a minor pariah on the international scene, yet justice was never administered by the UN or other nations, even including those of the Warsaw Pact.Because of the encylopedic nature of this history, it's sometimes difficult reading. The book strives for (and succeeds) status as an academic reference. Nonetheless, even a cursory reading is useful, especially as context for the Civil War: Franco's African Army pioneered the methods used domestically overseas, a fact well known to his opponents at the time of his rebellion. Plus, the Nazi and Italian Fascist regimes were able to refine many military techniques (e.g., terror bombing) used to great avail during WW-2 during this conflict.In the final analysis, the fact that a book like this one is needed is testimony to the fact that, as Dostoevsky once wrote in \"The House of the Dead\", \"Man is a creature that can get used to anything and I think that is the best definition of him\". It seems that forgetting is a convenient means of accomplishing that end and Preston's book is a good corrective for those who are determined to remember."}, {"review_sentiment": 5.0, "review_text": "This is a very meticulously reaearched book on a very interesting and seldom explored subject which he notes is partially due to reluctance of Spanish government to allow researchers much access to governmental files regarding the Francoist regime. My grandpa was a young chuld survivor of the Spanish civil war and I showed him both the illustrations and the subject of the book and he cried - in a good way because he had not found much literature on the array of atrocities committed particularly by Franco's Legion on the citizens of northern and all together civilians of Spain. He does a good job at explaining the various factions and takes time to have a glossary exploring and explaining at the beginning."}, {"review_sentiment": 5.0, "review_text": "The brutality and senselessness of the killing comes alive in Prof Paul Prestons words. An often forgotten aspect of the Spanish Civil War is now in the open and under scrutiny for the public."}, {"review_sentiment": 5.0, "review_text": "A brilliant book with extremely realistic stories of the true horrors of the Spanish civil war which nobody dared to record in spainduring the Franco regime and possibly after his death."}, {"review_sentiment": 1.0, "review_text": "Do not confuse this as an effort to objectively present a history of the Spanish war and its dreadful human cost.  The author is an apologist for the left, and the bias in the book is overwhelming to my mind.  While the violence on both sides is well documented, and I'm sure well researched, invariably the Nationalist atrocities are presented as without justification, while the Republican events are twisted to somehow appear as natural reactions to various alleged persecutions.  Additionally, as others have pointed out, the tedium of the book makes it extremely difficult to read in extended sessions.  I was eager to read the book, and was quite disappointed."}, {"review_sentiment": 5.0, "review_text": "If he accomplished nothing else (and he did) Preston's greatest contribution to understanding the tragedy of the Spanish Civil War was to provide clear distinctions between the largely programmatic genocide practiced by the Nationalists and the ad hoc (though certainly murderous) atrocities committed by the Republican side.  The clear implication is that Franco's brutal, systematic campaign of murder and terror evolved into an equally murderous and brutal dictatorship since his was an institutionalized brutality.  The Republicans had no such carefully constructed system of murder; consequently, they committed fewer of them."}, {"review_sentiment": 5.0, "review_text": "A thorough description of the evolution of the Spanish Civil War starting with the 2nd Republic. Preston makes an unbiased recount with tons of notes and bibliography. A much needed information of a period of the Spanish history that has been mislead or hushed in the official narrative. Recommended for any interested in the recent Spanish history and for any Spaniard that wants to know the real history."}]}, "authors": ["Paul Preston"], "isbn": "0393345912", "longitude": 2.1774322, "periods": ["1900s"], "title": "The Spanish Holocaust: Inquisition and Extermination in Twentieth-Century Spain", "word_cloud": "great excellent historian also give perspective objectivity beloved history dark menacing wonderful country simply away somehow delivered account atrocity course virtually account tend favor side someone somewhere account nationalist side still good interested many standard dictator power forget murderer despot virtue longevity office increase irrelevancy major international power regime seem become relic linger curio era bemedaled prance buffoon seat power catalogue crime vast rival depredation second supporter term scale mechanization perhaps refresh reveal annals history overlook submerged murder assemble prodigious record regime crimes catalogue extensive oftentimes overwhelm utterly gratuitous generally vengeful murder usually conduct feudal landlord mercenary minion add revolt dimension crime yet fascist paladin revel carnage enough eventually become minor pariah international scene yet justice never administer nation even include encyclopedic nature history sometimes difficult read strives succeed status academic reference even cursory read useful especially context pioneer method use domestically overseas fact well know opponent time rebellion nazi italian regime able refine many military technique terror bomb use great avail final analysis fact needed testimony fact write creature get use anything think best definition seem forget convenient mean accomplish good corrective determine meticulously research interesting seldom explore subject note partially due reluctance government researcher much access governmental file regard francois regime grandpa young child survivor civil war show illustration subject cry good way find much literature array atrocity commit particularly citizens northern together civilian good job explain various faction take time glossary explore explain begin brutality senselessness kill come alive word often forgotten aspect open scrutiny public brilliant extremely realistic story true horror civil war nobody dare record spainduring regime possibly death effort objectively present history war dreadful human cost author apologist leave overwhelming mind violence side well document sure well research invariably atrocity present justification republican event twist somehow appear natural reaction various alleged persecution additionally others point tedium make extremely difficult extended session eager quite disappointed accomplish nothing else greatest contribution understand tragedy provide clear distinction largely programmatic genocide practice ad ho certainly murderous atrocity commit republican side clear implication brutal systematic campaign murder terror evolve equally murderous brutal dictatorship institutionalize brutality carefully construct system murder consequently commit fewer thorough description evolution start make unbiased recount ton note much need information period history mislead hush official narrative interested recent history want know real history", "genres": ["History", "Spanish Civil War"], "summary": "Long neglected by European historians, the unspeakable atrocities of Franco’s Spain are finally brought to tragic light in this definitive work.\r\n\r\nEvoking such classics as Anne Applebaum’s Gulag and Robert Conquest’s The Great Terror, The Spanish Holocaust sheds light on one of the darkest and most unexamined eras of modern European history. As Spain finally reclaims its historical memory, a full picture can now be drawn of the atrocities of Franco’s Spain—from torture and judicial murders to the abuse of women and children.\r\n\r\nPaul Preston provides an unforgettable account of the systematic terror carried out by Spain’s fascist government. 16 pages of illustrations", "asin": "0393345912", "rank": "205041", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/512J0rFYzwL.jpg", "country": "Spain", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}