{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 36, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Exactly what I was looking for!"}, {"review_sentiment": 2.0, "review_text": "An enervating account of the eccentric misadventures of various vainglorious illuminati, meant mainly for the amusement of MFAs and similar \"clever\" cognoscenti."}, {"review_sentiment": 4.0, "review_text": "really enjoyed the book, light, funny and a quick read"}, {"review_sentiment": 3.0, "review_text": "An interesting tale."}, {"review_sentiment": 5.0, "review_text": "This book had lain idle on my shelf since I had received a signed first edition as a member of a local book club. For months, I'd passed it by in favor of more \"serious\" reading. But being chair-bound for several weeks with an injury, I found myself burrowing deeper into my multiple stacks of unread books and dusted off (what proved to be) this delightful volume.Its light, fast-moving story line and diverse characters have been tonic to my broken body and discouraged outlook. No heavy mental lifting required, but nonetheless well-written, thoroughly engaging, and just plain fun. (I laughed out loud more than once.) Throughout, I eagerly raced from one chapter to the next to see what surprises awaited among the many plot gyrations and unexpected layers of character interface.The book was well worth my time, a welcome lift to sagging spirits. I was sorry to reach the last page."}, {"review_sentiment": 5.0, "review_text": "A glorious romp through the world of writing workshops, guided by an expert con man we can't help but like.  In \"Famous Writers I Have Known,\" James Magnuson has created a wonderfully entertaining page-turner, made all the more scintillating by the obvious parallels to real-world authors and a real-world MFA program at a well-known university.  Magnuson lets us all feel like insiders as he pokes fun at all the players in a writing community, allowing us to laugh at ourselves and our pretenses in the process."}, {"review_sentiment": 4.0, "review_text": "A likeable narrator and the inner workings of 2 easily recognizable famous author archetypes.  Throw in humor and intrigue.  You'll get a kick out of it."}, {"review_sentiment": 4.0, "review_text": "Hand soap was horrible. I threw it away!!!!! The smell was terrible!!!!!!!!"}, {"review_sentiment": 3.0, "review_text": "The plot was clever but the storytelling was dull.  I really didn't care about anyone, particularly the protagonist/antagonist.  He was a colorless zero and I found it difficult to find anything to like or hate about him.  Also, his attempts at humor generally fell flat and were more annoying than funny. I finished the book primarily because I wanted to see how Mr. Magnuson mechanized the end of the story.  It's tidy but unrewarding."}, {"review_sentiment": 4.0, "review_text": "What a marvelous academic read. Faculty lounges will never be the same again. Magnuson knows only too well the nooks and crannies where faculty peccadilloes lurk. He casts a wide net."}]}, "authors": ["James Magnuson"], "isbn": "0393240886", "longitude": -97.7436995, "periods": ["2000s", "Recent Releases"], "title": "Famous Writers I Have Known: A Novel", "word_cloud": "exactly look enervate account eccentric misadventures various vainglorious illuminati mean mainly amusement similar clever cognoscenti really enjoy light funny quick interesting tale lain idle shelf receive sign first edition member local club month pass favor serious read several week injury find burrow deeper multiple stack unread dust proved delightful light story line diverse character tonic break body discourage outlook heavy mental lifting require nonetheless thoroughly engage plain fun laugh loud eagerly race chapter next see surprise await many plot gyration unexpected layer character well worth time welcome lift sag spirit sorry last page glorious romp world write workshop guide expert con man know create wonderfully entertain make scintillate obvious parallel author program university let insider poke fun player write community allow laugh pretense process likable narrator inner working easily recognizable author archetype humor intrigue get soap horrible throw smell terrible plot clever storytelling dull really anyone particularly colorless zero find difficult anything hate also attempt humor generally fell flat annoy funny finish primarily want see mechanize end story tidy unrewarding marvelous academic faculty lounge never know well nook cranny faculty peccadillo lurk cast wide net", "genres": ["Fiction & Literature", "Satire"], "summary": "“A triumphantly preposterous fish-out-of-water campus caper . . . hilarious.” Washington Post\r\n\r\nIn this brilliant mix of literary satire and crime caper, Frankie Abandonato, a small-time con man on the run, finds refuge by posing as V. S. Mohle—a famously reclusive writer—and teaching in a prestigious writing program somewhere in Texas. Streetwise and semiliterate, Frankie finds that being treated as a genius agrees with him.\r\n\r\nThe program has been funded by Rex Schoeninger, the world’s richest novelist, who is dying. Buzzards are circling, angling for the remains of Rex’s fortune, and Frankie quickly realizes that he has been presented with the opportunity of a lifetime. Complicating matters is the fact that Rex is haunted by a twenty-five-year feud with the shadowy Mohle. What rankles Rex is that, while he has written fifty bestsellers and never gotten an ounce of literary respect, Mohle wrote one slender novel, disappeared into the woods, and become an icon. Determined to come to terms with his past, Rex has arranged to bring his rival to Texas, only to find himself facing off against an imposter.\r\n\r\nFamous Writers I Have Known is not just an unforgettable literary romp but also a surprisingly tender take on two men—one a scam artist frantic to be believed, the other an old lion desperate to be ", "asin": "0393240886", "rank": "1553709", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51ALn6PeDcL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}