{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 32, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "His images pop with magic. He captures the experience of immigrants and refugees - raw, real transformations. The writer's ability to capture complexity and distill it into a potent story is inspiring."}, {"review_sentiment": 4.0, "review_text": "Deeply psychological novel about a disturbed Lebanese migrant who lives on the underbelly of a city in Canada."}, {"review_sentiment": 5.0, "review_text": "Great read. It deserves much praise. It made me laugh and think."}, {"review_sentiment": 5.0, "review_text": "One of the best books ı have recently read. Thank you Rawi Hage. İt is a psychological journey of an immigrant which no doubt many similar lives must have experienced."}, {"review_sentiment": 3.0, "review_text": "Not really a recommended read.  The main character thinks he's at least part cockroach.  Not a very interesting one at that."}, {"review_sentiment": 3.0, "review_text": "I found the story a bit difficult to follow and the ending very abruptI doubt I would read any other works from this author, the style of writing does not suit my taste"}, {"review_sentiment": 4.0, "review_text": "Ambitious and somewhat rewarding, Cockroach is entertaining. Rawi Hage knows the difference between character development and a blank wall. What's the difference between fascinating character development and creative plotting? Nothing. They are synonymous, and as a successful author myself, I know about character development and creative plotting ingredients that contribute to a successful novel. Cockroach fascinated me with its presentation of a desperate foreigner's visions while living in a rich foreign land, his presentation about greedy, self-serving individuals where civility is cut in pieces, where human ethics is shredded and where cultural differences aren't really different at all when humanity is concerned. The novel really is \"...an uncompromising vision of humanity.\""}, {"review_sentiment": 5.0, "review_text": "extended analogy about how those on the bottom see so much  more than those on the top.This brilliant man has been displaced to a country that has no use for him, a country that is part of a ruling \"elite\" of nations that have decimated his own homeland.They can't understand him even while they try to \"help\" him.The scenes about therapy are pricelss."}, {"review_sentiment": 5.0, "review_text": "Oh my! What a novel! What a narrator! I quite simply put off letting this novel end because I just knew whatever came next for me to read would be less than this wonderful. Oh, yes, and when you get to it, what an ending it is!The novel is set in cold, cold Montreal where \"menacing armies of heavy boots\" encase people's feet. Wouldn't a cockroach see our feet that way even though the narrator isn't really a cockroach? But he most certainly is a human one!The narrator is totally outside life in Montreal, a voyeur, and definitely a psychopathic one. (I think the two people who wrote the two-star reviews didn't realize that this narrator is indeed psychopathic. Big time!)Born in Lebanon, he migrated to Montreal and for reasons we don't know for most of the novel, he has been released--unfortunately for many of his victims--from some type of institution. The release has been contingent upon his seeing a therapist named Genevieve.In one scene he writes, \"I like to pass by fancy stores and restaurants and watch the people behind thick glass, taking themselves seriously, driving forks into their mouths... I also like to watch the young waitresses in their short black dresses... Although I no longer stand and stare.\" And then he proceeds to tell what happened the prior summer when he did that, an episode that led to police being called in, and our cockroach narrator informs them that he was only looking at his own reflection in the glass. And then it seems he watched as the couple he was staring at left, the man opening from a distance with his remote the door to the BMW. And, yes, our narrator manages to get into the car without being seen, manages then to get into their house from the parked car in the garage, manages to see some elements of their getting ready for bed--his focus upon the woman--and then admits this: \"At the couple's home I stole his gold ring, his cigarettes, a Roman vase, his tie...\"As he says about himself when he steals or plans his advances on women, \"I was the insect beneath them.\"I am so much in agreement with the reviewer who wrote this: \"You can pick practically any paragraph on any page and be awed by the magic of his bleak words as he, piling metaphor upon metaphor, captures the bitter cold of a Montreal winter and a world of darkness.This is one of the most amazing novels I have read in recent years. And I read as many as two novels a week."}, {"review_sentiment": 4.0, "review_text": "Rawi Hage's Cockroach is an intriguing tale narrated by a more self-aware  Gregor Samsa as he tries to navigate through the immigrant community in contemporary Montreal.  He's a dark and twisted man--there is nothing light-hearted about this novel, but its bitter, black humor is compelling.  The novel is not for the faint of heart--sex, drugs and violence (though none of it gratuitous) fill the pages.  Kudos to Hage for drawing a bleak picture, while never giving us a bleak novel."}]}, "authors": ["Rawi Hage"], "isbn": "0393337871", "longitude": -73.6103642, "periods": ["1900s", "Recent Releases"], "title": "Cockroach: A Novel", "word_cloud": "image pop magic capture experience immigrant refugees raw real transformation writer ability capture complexity distill potent story inspiring psychological disturb lebanese migrant life underbelly city deserve much make laugh think best i recently psychological journey immigrant doubt many similar life not really recommend main character think least part cockroach not interest find story bit difficult follow end abrupt i doubt author style write suit taste ambitious somewhat reward entertain know difference character development blank wall difference fascinate character development creative plot nothing synonymous successful author know character development creative plotting ingredient contribute successful fascinate presentation desperate foreigner vision live rich foreign land presentation greedy individual civility cut piece human ethic shred cultural difference really different humanity concern really uncompromising vision humanity extend analogy bottom see much brilliant man displace country use country part rule elite nation decimate even help scene therapy priceless narrator quite simply put let end know come next wonderful end set cold cold menacing army heavy boot encase people foot foot way even narrator really certainly human narrator totally outside life voyeur definitely psychopathic think people write review narrator indeed psychopathic big time migrate reason know release unfortunately many victim type institution release contingent see therapist name scene write pas fancy store restaurant watch people thick glass take seriously drive fork mouth also like watch young waitress short black dress longer stand stare proceeds tell happen prior summer episode lead police call cockroach narrator informs look reflection glass seem watched couple star leave man open distance remote door yes narrator manages get car see manages get house park car garage manage see element get ready bed focus woman admits couple home steal gold ring cigarette vase tie say steal plan advance woman insect much agreement reviewer write pick practically paragraph page awe magic bleak word pile metaphor metaphor capture bitter cold winter world amazing novel recent year many novel week intrigue tale narrate try navigate immigrant community contemporary dark twisted man nothing bitter black humor compel faint heart sex drug violence none gratuitous fill page draw bleak picture never give", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "\"Funny and sharp . . . playful and erotic.\"―New York Times Book Review\r\n\r\nIn Montreal's restless immigrant community, our unnamed narrator is living in despair. Forced to visit a therapist after a suicide attempt, he brings us back to his childhood in a war-torn country, forward into his current life in the smoky émigré cafés where everyone has a tale, and out into the frozen nighttime streets of Montreal, where he imagines himself to be a cockroach invading the lives of the privileged, but willfully blind, citizens who surround him. \r\n\r\nCockroach is a carnivalesque, philosophical novel that weaves dark humor with an accusatory, satirical voice, spawning from the subsurface to challenge humanity and its downfall.\r\n\r\n“There is something exhilarating about [Cockroach's] relentlessness. . . . The narrator is ambiguous, untrustworthy, sly, and filled with a despair both nasty and noisy; but he is also deeply wounded, oddly lovable, his voice both moving and manipulative.” New York Review of Books", "asin": "0393337871", "rank": "1002514", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/517RrFDp8ZL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}