{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 60, "rating": 3.7, "reviews": [{"review_sentiment": 2.0, "review_text": "Plowing through. It hasn't grabbed me yet, but I'm hanging in there!"}, {"review_sentiment": 5.0, "review_text": "People did not like this book.  However this is the first Abu-Jaber book I have read and although at first the people seemed annoying, the more I delved into the book the more I could understand them and worry about them.  It is not a happy book with a happy ending...but I think it depicts what can happen to a family when people aren't listening to each other.  Mom wanted to put the kids in \"her\" ideal for each..and ignored that they didn't fit.Although it's amazing nothing happened to the daughter roaming around on her own as she was, I think if the story continued we would find her quite bruised .  I really enjoyed this book."}, {"review_sentiment": 5.0, "review_text": "This book examines a family that has unraveled - mom and dad are living alone in a home, their adult son living a completely separate life from them (for example, the parents have no idea that their son has a girlfriend, let alone that he has moved in with her or that she is pregnant).  Most fundamentally, their 13 year old daughter has run away from home, and allows the family only small periodic peaks into her life.  Mom and dad barely speak, and they are all clearly lost.  And yet these flawed characters are lovingly fleshed out and shaped by Abu-Jaber, and by the middle of the book you begin feeling for them.  By the end, you are rooting for them.  By the very end, you can barely restrain your hope that it all works out for them.The book follows this broken family through a difficult time in their lives. I found the end of the novel to be the most engaging and well drafted, especially when events start taking place in the store (I won't say more to avoid spoilers).  I found some of the sub-plots unnecessary diversions (the entire Solange part of the story was relatively worthless to me).  I also found the book to be slow to keep my interest, but once it did - wow.The author writes beautifully, and has a clear love for the locations she sets her novel in and for fine food.  I really enjoyed the book, and I must say that as a parent of three children the book really got to me when it turned to the discussion of the relationship between these two parents and their children.A wonderful book, well worth a read.  I hope she writes more novels for many years to come."}, {"review_sentiment": 2.0, "review_text": "I listened to this on cd's from the library.  I sometimes struggle with this format as my mind gets occupied with driving and I miss a minute and have to go back and listen to the last 3 to catch the brief period I missed.  Not with this book.  I could miss several minutes and miss NOTHING!  This story was boring.  The characters were individually and completely unlikeable.  One slightly interesting component related to the mother and the neighbor had no closure at all.  It's like the author forgot about that storyline and just left it out at the halfway mark.  I listened to the end believing there had to be something worthwhile if I just stuck with it.  There wasn't.  Such a disappointment.  Will never get another book by this author."}, {"review_sentiment": 4.0, "review_text": "Great read, you could feel allot of the families emotion, pain, and sense of loss however, a young girl on her own that many years to romanticized, it had to be much tougher, hard, without basic necessities the hook misses that completely you get a sense it was a part life NOT"}, {"review_sentiment": 5.0, "review_text": "Loved the south Florida setting and the glimpse into the darker side of the South Beach scene.  Enjoyed the baking sections, their lyrical description.  Inter-family relationships fascinating.  Loved the intriguing, annoying neighbor bird.  You could feel the sultry heat and humidity of the Florida afternoons,"}, {"review_sentiment": 4.0, "review_text": "Diana Abu-Jaber's novel Birds of Paradise is a gut-wrenching family drama set against the backdrop of the tropical suburbs that surround Miami.The Muir family is living a seemingly picture-perfect middle-class life. They have a lovely home, great jobs and beautiful children. Look closer and they're a mess.. Each member of the family lives in isolation. They hold in their pain and they fear expressing both their problems and their desires.The parents, Avis and Brian have long stopped communicating and their marriage is on the brink of collapse. Their adult son, Stanley, has quit college to pursue his dream of owning a community grocery store. He worries that his parents disapprove of choices. The youngest child, Felice, ran away from home in high school and has been living on the streets for years. All four people want to repair their wounds, but a sense of pride and the struggle to communicate keeps forcing them to stay apart, only compounding the situation.The story is told through all four characters, alternating the focus with each chapter. I found Felice's story to be by far the most compelling. It was kind of like an episode of Dateline with all of the details of the teenagers living on the streets. It was horrible to read, yet I kept wanting more. I felt like the author must have had experience or was very well researched, because the details just rang true. At times, I forgot that I was reading fiction.Overall, I really enjoyed this novel. Abu-Jaber has a beautiful, lyrical quality to her writing and she really made the city of Miami come alive through her descriptions. In the story, Avis has a baking business and I loved Abu-Jabers flowing paragraphs describing the amazing pastries and cakes. Don't read this story on an empty stomach or while dieting!My only fault is maybe it tried to accomplish too much. There was a lot going on with all of the characters and it overreached. I was unevenly interested in the various story lines and it led to an uneven pacing. I wish that Felice had been the primary focus of the story, as there was plenty of information with her character to warrant an entire novel. The twist as to why she ran away from home is loaded and could have been explored more deeply. It's a shock.I look forward to reading more stories by Abu-Jaber. She is a talented storyteller and has a wonderful writer's voice.Like my review? Check out my blog!"}, {"review_sentiment": 5.0, "review_text": "I thought this was a good book to think and talk about with my book group. Will recc. It to others"}, {"review_sentiment": 3.0, "review_text": "I think why I didn't care for it that much was because I never felt anything for the characters.  The daughter leaving home, it made no sense to me why she would.  Both parents loved her very much.  The mother was loony toons."}, {"review_sentiment": 5.0, "review_text": "You might become exasperated by one of the characters in this story, but it's a captivating read by a great story-teller."}]}, "authors": ["Diana Abu-Jaber"], "isbn": "039334259X", "longitude": -80.1936589, "periods": ["2000s", "Recent Releases"], "title": "Birds of Paradise: A Novel", "word_cloud": "plow grab yet hang people however first first people seem annoy delve happy happy end think depicts family people listen want put kid ideal ignore amazing nothing happen daughter roam think story continue quite bruise really enjoy examine family unravel mom dad live alone home adult son live completely separate life example parent idea son girlfriend alone move pregnant fundamentally year old daughter away home allows family small periodic peak life dad barely speak clearly lose yet flaw character lovingly flesh shaped middle begin feel end rooting end barely restrain hope work follow break family difficult time live find end engage well draft especially event start take place store avoid spoiler find unnecessary diversion entire part story relatively worthless also find slow keep interest author write beautifully clear location set fine food really enjoy parent child really get turned discussion relationship parent wonderful well hope writes novel many year come listen cd library sometimes struggle format mind get occupied driving miss minute go back listen last catch brief period miss not several minute miss nothing story bore character individually completely unlikable slightly interesting component relate mother neighbor closure author forget story line leave halfway mark listen end believe something worthwhile stick such disappointment never author allot family emotion pain sense loss however young girl many year romanticize much tougher hard basic necessity hook miss completely get sense part life love south setting glimpse darker side scene baking section lyrical description relationship fascinate intrigue annoy neighbor bird sultry heat humidity afternoon family drama set backdrop tropical suburb surround family live seemingly life lovely home great job beautiful child closer member family live isolation hold pain fear expressing problem parent long stop communicate marriage brink collapse adult son quit college pursue dream own community grocery store worry parent choice youngest child run away home high school live street year people want repair wound sense pride struggle communicate keep force apart compound story tell character alternate focus chapter find story far compel kind episode detail teenager live street horrible yet keep want felt author well research detail ring true time forget read really enjoy beautiful lyrical quality write really make city come alive description story baking business love flow paragraph describe amazing pastry cake do story stomach diet fault maybe try accomplish much lot go character overreach unevenly interest various story line lead uneven pacing wish primary focus story plenty information character warrant entire twist run away home load forward read story talented storyteller wonderful writer review blog think good think talk group rec others think care much never felt anything character daughter leave home make sense parent love much mother loony tun exasperated character story captivate great", "genres": ["Fiction & Literature"], "summary": "At thirteen, Felice Muir ran away from home to punish herself for some horrible thing she had done—leaving a hole in the hearts of her pastry-chef mother, her real estate attorney father, and her foodie-entrepreneurial brother. \r\n\r\nAfter five years of scrounging for food, drugs, and shelter on Miami Beach, Felice is now turning eighteen, and she and the family she left behind must reckon with the consequences of her actions—and make life-affirming choices about what matters to them most, now and in the future.\r\n\r\n“A full-course meal, a rich, complex and memorable story that will leave you lingering gratefully at [Abu-Jaber’s] table.” The Washington Post", "asin": "039334259X", "rank": "1019740", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51F170Ic3SL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}