{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 46.4846583, "ratings": {"num_ratings": 35, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "After visiting Odessa this summer, reading this book not only summarizes Odessa story but also gives a great sense of what this city is all about"}, {"review_sentiment": 3.0, "review_text": "Initially i was very keen to read this book and there were lots of good tidbits to glean from the historical facts, but in the end, for me, it was a bit pedantic and a boring read."}, {"review_sentiment": 5.0, "review_text": "Paint me a picture, sad as it is."}, {"review_sentiment": 5.0, "review_text": "Just incredible"}, {"review_sentiment": 5.0, "review_text": "Love this book.! It,s equally entertaining as it,s historically deep.the author gave priceless information on the historical periods of the city, especially it was super educational to learn about the Rumanian occupation during the WW II."}, {"review_sentiment": 3.0, "review_text": "A bit long-winded.An interesting coda in the Bloomberg article about the 2014 Target heist (which apparently originated in Odessa):\"Odessa is the Tortuga of the Russian-speaking world, notorious since czarist times as a gathering spot for gangsters, swindlers, and pirates. Today it’s a haven for 'carders.'\""}, {"review_sentiment": 4.0, "review_text": "Interesting new discoveries and new trails to follow."}, {"review_sentiment": 5.0, "review_text": "Utterly fascinating history of Odessa.  Amazingly easy to read scholarship paints an extraordinary picture of this amazing city/harbor in Russia where populations and cultures changed as people discovered its capacity for ports.  The author traces the various cultures that moved within it, sometimes adding to its greatness, sometimes challenging its inhabitants for purposes of their own  I actually found it hard to put down at times."}, {"review_sentiment": 5.0, "review_text": "Great author, great book"}, {"review_sentiment": 5.0, "review_text": "Wonderful!  Well written,highly informative."}]}, "authors": ["Charles King"], "isbn": "0393342360", "longitude": 30.732564, "periods": ["1700s", "1800s", "1900s", "Recent Releases"], "title": "Odessa: Genius and Death in a City of Dreams", "word_cloud": "visit summer reading summarize story also give great sense initially keen lot good tidbit glean historical fact end bit pedantic boring picture sad just incredible equally entertain historically author give priceless information historical period especially super educational learn romanian occupation bit interesting coda article heist apparently originate world notorious czarist time gather spot gangster swindler pirate today interest new discovery new trail follow utterly fascinate history easy scholarship paint extraordinary picture amaze population culture change people discover capacity port author trace various culture move sometimes add greatness sometimes challenging inhabitant purpose actually find hard put time author great write highly informative", "genres": ["History"], "summary": "A colorful account of the transformation of one of Europe's foremost Jewish cities, told through the stories of its geniuses and villains.\r\n\r\nItalian merchants, Greek freedom fighters, and Turkish seamen; a Russian empress and her favorite soldier-bureaucrats; Jewish tavern keepers, traders, and journalists―these and many others seeking fortune and adventure rubbed shoulders in Odessa, the greatest port on the Black Sea.\r\n\r\nHere a dream of cosmopolitan freedom inspired geniuses and innovators, from Alexander Pushkin and Isaac Babel to Zionist activist Vladimir Jabotinsky and immunologist Ilya Mechnikov. Yet here too was death on a staggering scale: not only the insidious plagues common to seaports but also the mass murder of Jews carried out by the Romanian occupation during World War II. \r\n\r\nDrawing on a wealth of original source material, Odessa is an elegy for the vibrant, multicultural tapestry of which a thriving Jewish population formed an essential part, as well as a celebration of the survival of Odessa's dream in a diaspora reaching all the way to Brighton Beach. 25 black-and-white illustrations", "asin": "0393342360", "rank": "977794", "city": "Odessa", "image": "https://images-na.ssl-images-amazon.com/images/I/618rZWT1%2BDL.jpg", "country": "Ukraine", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}