{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 266, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Great read if you like court room dramas!"}, {"review_sentiment": 2.0, "review_text": "I could not finish this book.  The characters were incredibly self absorbed and I saw what was coming several chapters in.  I also looked online to read news stories about the actual crime."}, {"review_sentiment": 4.0, "review_text": "First two hundred pages, great!  Last 500 felt like driving through Nebraska."}, {"review_sentiment": 5.0, "review_text": "Great true story and a wonderful insight on trial technique by a master attorney!"}, {"review_sentiment": 5.0, "review_text": "Riveting. An excellent read!"}, {"review_sentiment": 4.0, "review_text": "Some areas within the book were a little drawn out, but overall a really hard book to put down!"}, {"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 5.0, "review_text": "Very interesting true crime story"}, {"review_sentiment": 5.0, "review_text": "A fascinating read by a great legal mind and superb writer of non-fiction. It's actually a 'page-turner'. I remember hearing about the case in college and enjoyed learning the details from multiple angles."}, {"review_sentiment": 2.0, "review_text": "I skipped. More's pages than I read in the. Trial. Too much technical law jibberish. I would. Have requested a refund."}]}, "authors": ["Vincent Bugliosi", "Bruce Henderson"], "isbn": "0393327965", "longitude": -157.8556764, "periods": ["1900s", "Recent Releases"], "title": "And the Sea Will Tell", "word_cloud": "like court room drama character incredibly absorb saw come several chapter also look online news story actual crime first hundred page great last felt drive true story wonderful insight trial technique master attorney rivet excellent area little drawn overall really hard put great very interesting true crime story fascinating great legal mind superb writer actually remember hear case college enjoy learn detail multiple angle skip more page trial too much technical law gibberish request refund", "genres": ["Biography", "History", "True Crime"], "summary": "ALONE WITH HER NEW HUSBAND on a tiny Pacific atoll, a young woman, combing the beach, finds an odd aluminum container washed up out of the lagoon, and beside it on the sand something glitters: a gold tooth in a scorched human skull. \r\n\r\nThe investigation that follows uncovers an extraordinarily complex and puzzling true-crime story. Only Vincent Bugliosi, who recounted his successful prosecution of mass murderer Charles Manson in the bestseller Helter Skelter, was able to draw together the hundreds of conflicting details of the mystery and reconstruct what really happened when four people found hell in a tropical paradise. \r\n\r\nAnd the Sea Will Tell reconstructs the events and subsequent trial of a riveting true murder mystery, and probes into the dark heart of a serpentine scenario of death.", "asin": "0393327965", "rank": "67778", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51bgQakSn5L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}