{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 45, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "Not getting through the book as fast as I would like. Great detail and info"}, {"review_sentiment": 4.0, "review_text": "Great read for anyone who loves New Orleans as characterized in its food.  Being from Wisconsin, Sara does an amazing job of painting a wonderful mural of the soul of New Orleans... if that can be done.  She does so not just with the history of a drink, dish, or food item, but also with how people in New Orleans live.  She does so with humor that will disturb any quiet evening with chortles, yet with a profound salute to the people, their heritage, and lifestyle.  Kudos Sara!"}, {"review_sentiment": 4.0, "review_text": "Wasn't my fave food-read but fun to read, anyway."}, {"review_sentiment": 5.0, "review_text": "Excellent read for those interested in NOLA food culture  and post Katrina effects"}, {"review_sentiment": 5.0, "review_text": "Paired with Tom Fitzmorris's Hungry Town part of the definitive history of NOLA cuisine andand pre and post Katrina."}, {"review_sentiment": 5.0, "review_text": "I am drinking a Sazerac cocktail as I write this review. Roahen moved to New Orleans with her medschool student husband. With a limited background as a line cook, she becomes food editor for a local paper. In the process she explores the little nooks and crannies of New Orleans cuisine , learning to cook it as she goes. Each chapter focuses on one item, e.g., the Sazerac or poboys, but extends to people and origins. In the process of transforming herself into a native through the culture of food, she drew me back to a city I always have loved. Although the book spans pre- and post-Katrina the hurricane and its damage do not dominate the book or the spirit of the people in it. If you love New Orleans and its food, this book will give you a laundry list of new eateries to try on your next visit."}, {"review_sentiment": 5.0, "review_text": "It made me appreciate New Orleans all the more. Love the food and the stories that go with it!"}, {"review_sentiment": 5.0, "review_text": "Forgot to post this here. From a bit I wrote on Rowley's Whiskey Forge in 2008. As true today as it was then:During Tales of the Cocktail this past July, author/distiller Mike McCaw and I mosied up to a table where a lithe young woman was talking to all comers and mixing Sazeracs and brandy old fashioneds for any who cared to sample. Bottles of brandy, whiskey, bitters, and the local anise spirit Herbsaint were at the ready, though running low, as the hordes of reveling attendees wound down Cocktail Hour.Suddenly, she went wide-eyed. “Oh my gosh! Did that guy just steal my book?” Sure enough, the russet-and-red hardback she had authored with its cover of a time-worn cocktail sign was now nowhere to be seen, nor was the unsteady admirer who had been thumbing it moments before. That week, with the Hotel Monteleone was awash in premium swag, some thieving cad absconded with Sara Roahen’s personal copy of Gumbo Tales.Just because the thief was in his cups doesn’t mean he was wrong. In fact, he might have made off with one of the choicest take-aways in the hotel. If New Orleans has ever been good to you, then take his lead and beg, borrow, or steal...no, buy a copy of Gumbo Tales without delay.Roahen, a Wisconsin transplant, has proven her food chops—as a line cook, restaurant reviewer for the New Orleans weekly Gambit, board member of the Southern Foodways Alliance, and, tenaciously, in her attempts to trace Wisconsin’s brandy old fashioned cocktails back to the Sazerac through an anonymous Mississippi riverboat captain.She has written a book at turns both gut-wrenching and bust-out-loud funny about finding her place at the New Orleans table (and, apparently, not a few bars). In the process, she wrestles with defining gumbo, boiling live crawfish, the city’s seeming disinterest in vegetables (unless breaded, fried, cooked down, or dressed up with crab, ham, sausage, and cheese), its cult-like following of Hansen’s sno-balls, its robust St Joseph’s Day feasts, po-boy sandwiches, and an influx of newcomers, learning how and why, as she does, to remain in that postdiluvian city.Those of us interested in the drinking and food cultures of New Orleans savor classic cookbooks such as Lafcadio Hearn’s 1885 La Cuisine Creole for shedding light on the origins of creole cooking. Others help explain the growth of both creole and Cajun cookery, such as Paul Prudhomme’s 1984 Chef Paul Prudhomme’s Louisiana Kitchen or John Folse’s recent encyclopedic tomes on South Louisiana cookery (all of which, by the way, contain an abundance of recipes for alcoholic beverages, sips, and nips from absinthe drips to brandy milk punches).Roahen’s book belongs on the same shelf, though it is something else. For one, it has no recipes. Like the city itself now, Gumbo Tales is defined by what some have called the federal floods, but which many just call Katrina. Here, the floods are both a lens for examining, and a touchstone that unites, everyone with connections to the city.Katrina doesn’t mean just the 2005 hurricane itself, but also its evil twin Rita. It means the broken levees, the flooding, the deaths, the harrowing devastation, the political ineptitude, the broken families, and displaced lives that followed the storm and which continue to affect daily life in the city. All of that is enough to make even courageous constitutions turn to drink.Listen to her take:Earlier this week, from my car, I saw a man walk past a water-stained sofa that someone had hauled to the curb weeks ago. He got a few feet beyond it and then doubled back to arrange two of the sofa’s cushions that had gone askew. My throat tensed at this small gesture toward fixing our overwhelming mess.Your throat may tense while reading Gumbo Tales, too. Mine did. It also prodded me to mix a Sazerac, made my mouth water, my stomach growl, and the walls echo with belly laughs as she readily points out her own foibles and outright lies:\"No one but my kindergarten teacher flinched when at six years old I mentioned my desire to become a cocktail waitress when I grew up.\"Or, in an effort to convince a reluctant Vietnamese restaurant owner that she was a seasoned trencherman:\"I eat duck blood all the time.\"Concerning a certain New Orleans fascination with a revered sno-ball queen:\"Most of her followers do not want to date Ashley Hansen. We want to be her.\"Some have said “Let New Orleans sink. It’s their own fault for living there.” The first chapter alone lays open that imbecilic rationale that could only be meant by those who’ve never been or, having been, never left the French Quarter and who know it only as a modern Gomorrah of tacky t-shirts, cirrhotic livers, hustles, and corruption.To think that way is to say that humans are all teeth, toenails, and elbows. Yes, of course, we have those things—and what would we be without them?—But that’s so laughably far from reality nobody could seriously believe it.Intentionally or not, the book is an eloquent argument for why the Crescent City is worth saving. Even after the storms, it remains one of the most vibrant cities in the United States (I’m not unbiased: my own mother recently referred to the place as “your beloved New Orleans” so take my endorsement with a grain of rice). Read the book, but when you’re done, put it away and high-tail it to New Orleans. Go for the first time, go for the tenth time. Just go.Though she denies Gumbo Tales is a guidebook, a newcomer to the city or an inquisitive visitor who wants to get to know the place more intimately than a casual conventioneer does could do worse than to get a map, a highlighter, and a notebook to mark out, neighborhood by neighborhood, a hit list of po-boys, sno-balls, esoteric cocktails, bakeries, miscellaneous eateries, and watering holes.New Orleans is one of the world’s great culinary destinations because of the people who love it so much. Roahen nailed it when she writes that people love the city as they love a person. And few have captured its residents’ obsessions with eating and drinking more poignantly and lyrically than a transplanted Midwesterner who has embraced the New Orleans table with the zealotry of a convert.Sara Roahen has found her place."}, {"review_sentiment": 4.0, "review_text": "I read this book before taking a long weekend to New Orleans. It was an interesting read before our visit."}, {"review_sentiment": 5.0, "review_text": "At my restaurant, I wanted to throw a salute to New Orleansbrunch. The main feature of the event was crab gumbo. I hadto prepare myself for questions about the history of gumbo andthis book was filled with everything gumbo and more. Excellentbook."}]}, "authors": ["Sara Roahen"], "isbn": "0393335372", "longitude": -90.0701156, "periods": ["2000s", "Recent Releases"], "title": "Gumbo Tales: Finding My Place at the New Orleans Table", "word_cloud": "not get fast detail info anyone love characterize food amaze job paint wonderful mural soul do history drink dish food item also people live humor disturb quiet evening chortle yet salute people heritage lifestyle fave fun anyway interested food culture post effect part definitive history cuisine and and per post drink cocktail write review move med school student husband limited background line cook become food editor local paper process explores little nook cranny cuisine learn cook go chapter focus item boys extend people origin process transform native culture food draw back city always love span hurricane damage spirit people love food laundry list eatery try next visit make appreciate food story go post bit write true today mosh lithe young woman talk comer mix brandy old fashioned care sample brandy whiskey bitter local anise spirit ready run low horde revel attendee go gosh guy steal enough hardback author cover cocktail sign nowhere see unsteady admirer thumb moment week awash premium swag thieve cad abscond personal copy thief cup mean wrong fact choicest hotel ever good lead beg borrow steal buy copy transplant proven food line cook restaurant weekly board member tenaciously attempt trace brandy old fashion cocktail back anonymous riverboat write turn funny apparently bar process wrestle define boil live crayfish city seem disinterest vegetable bread fried cooked dress crab ham sausage cheese follow robust feast sandwich influx newcomer learn remain postdiluvian interested drinking food culture savor classic cookbook shed light origin creole cook help growth creole cookery recent encyclopedic tome cookery way contain abundance recipes alcoholic beverage sip nip absinthe drip brandy milk punch belong shelf something else recipe city define call federal flood many call here flood lens examine touchstone unite everyone connection mean hurricane also evil twin mean broken levee flood death harrow devastation political ineptitude broken family displace life follow storm continue affect daily life city enough even courageous constitution turn earlier week car saw man walk sofa someone haul curb week get foot double back arrange sofa cushion go askew throat tense small gesture fix overwhelm throat read also prod mix make mouth water stomach growl wall echo belly laugh readily point foible outright lie one kindergarten teacher flinch year old mention desire become cocktail waitress grow effort convince reluctant vietnamese restaurant owner season trencherman eat duck blood time concern certain fascination revere queen most follower want date want say sink fault live first chapter alone lay open imbecilic rationale never never leave french modern tacky cirrhotic liver hustle think way say human teeth toenail elbow course laughably far reality nobody seriously eloquent argument save even storm remain vibrant city unbiased mother recently refer beloved take endorsement grain rice do put first time tenth time deny newcomer city inquisitive visitor want know intimately casual conventioneer map highlighter notebook mark neighborhood neighborhood hit list esoteric cocktail bakery miscellaneous eatery water world great culinary destination people love much nail write people love city love person capture resident obsession eat drink poignantly lyrically transplanted embrace zealotry find take long weekend interesting visit restaurant want salute main feature event crab had to prepare question history and this fill everything", "genres": ["Essay", "Travel Writing", "Food and Wine"], "summary": "“Makes you want to spend a week―immediately―in New Orleans.” ―Jeffrey A. Trachtenberg, Wall Street Journal\r\nA cocktail is more than a segue to dinner when it’s a Sazerac, an anise-laced drink of rye whiskey and bitters indigenous to New Orleans. For Wisconsin native Sara Roahen, a Sazerac is also a fine accompaniment to raw oysters, a looking glass into the cocktail culture of her own family―and one more way to gain a foothold in her beloved adopted city. Roahen’s stories of personal discovery introduce readers to New Orleans’ well-known signatures―gumbo, po-boys, red beans and rice―and its lesser-known gems: the pho of its Vietnamese immigrants, the braciolone of its Sicilians, and the ya-ka-mein of its street culture. By eating and cooking her way through a place as unique and unexpected as its infamous turducken, Roahen finds a home. And then Katrina. With humor, poignancy, and hope, she conjures up a city that reveled in its food traditions before the storm―and in many ways has been saved by them since.", "asin": "0393335372", "rank": "153700", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51jZ64q-XLL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}