{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 117, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "This tragic novel examines the lives of multiple generations of an extended family to illuminate the societal chaos of Mao Zedong's Cultural Revolution. Both intimate and universal, with vibrant characters and an epic scale."}, {"review_sentiment": 3.0, "review_text": "Thien, Madeleine.  Do Not Say We Have NothingThis book is about life in contemporary China under the rule of Chairman Mao.  It gives a frightening picture of living under an unenlightened dictatorship, and recalls George Orwell’s 1984, with its thought police, its constantly booming loudspeakers and government espionage methods cramping any suggestion of individualism.  But this novel is far from being a fantasy but a living nightmare in which individuals and government officials are named and presumably exposed.  It perpetually asks the implied question, ‘What would you, the reader, do?’  Those who seem to suffer the most are young professionals, since the book deals constantly with Chinese artists, especially musicians, whose work being non-verbal is therefore especially subject to scrutiny.I found the book to be over-long, made up of various confessions, without giving the reader a pole for sympathy.  It begins in Vancouver with Ma-li, occasionally transliterated as Mary, who is seeking her lost father, Ba Lute, but who is almost immediately introduced to a new arrival, Ai-ming,  a few years her senior, who is terrified in the open environment of the West.  She is constantly cold and afraid to go out.  The reader is just getting invoved with this relationship when the author switches to her ‘real’ subject - life in contemporary China, from the sudden disappearance of dissenters, to closed doors to all those suspected of ‘Rightism.’We meet scores of characters, many of whom appear to be quiet anti-revolutionists even as they are chanting ‘Long live Chairman Mao, the Great  Helmsman,’ and we are told about their inner lives, given retrospects within retrospects, for the dead past is their only means of survival.  We forget about Ma-li and Ai-ming for nearly 100 pages to learn about the ambitions and inevitable failures of the composer, Sparrow, who has been taught that ‘desire, or something so small as love, was always subservient to revolution,’ but ‘the truth Sparrow felt led to another life entirely.  He knew or feared they could not be reconciled.’This is an ambitious and heartfelt book, but this reader needed masses of notes to keep track of who was who - and was not as subject to tears as most of her characters."}, {"review_sentiment": 5.0, "review_text": "The book is beautifully written, it's hard to put it down. It is also extremely moving and at times heart wrenching knowing that those political events are true and so many people's lives were lost."}, {"review_sentiment": 2.0, "review_text": "Have given myself permission to stop reading this book! Too many books too little time to read books that wander about as this one does. This book had nothing to hold my attention."}, {"review_sentiment": 5.0, "review_text": "Breathtaking and immensely moving novel."}, {"review_sentiment": 5.0, "review_text": "Absolutely loved everything about this book - the characters, the historical background, the mystery and complexity in the writing.  One of the most absorbing novels I have read this year."}, {"review_sentiment": 5.0, "review_text": "A troubling image of Chinese folk in the West and in China. Beautifully written story of a woman essentially orphaned by the Cultural Revolution and her search for meaning in life."}, {"review_sentiment": 3.0, "review_text": "I am a \"China Hand\".  I speak and read Chinese and I was predisposed to like this book but after awhile I grew weary of it.  It is excessively long, the cast of characters is not easy to keep straight, and the leaps from the present to the past and back to the present are confusing.  Also, all the wordy references/allusions to music really added very little of substance to the book and I found myself skimming over them.  The tale just doesn't advance with any sense of purpose.  A page-turner it is not."}, {"review_sentiment": 1.0, "review_text": "I just could not care or warm to any chaacters. Gave up on this a quarter way through."}, {"review_sentiment": 5.0, "review_text": "I enjoyed the book. It humanized and made real one of greatest cultural/ political upheavals of our time and which I knew practically nothing about."}]}, "authors": ["Madeleine Thien"], "isbn": "039360988X", "longitude": -123.11554, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Do Not Say We Have Nothing", "word_cloud": "tragic examine life multiple generation extend family illuminate societal chaos intimate universal vibrant character epic scale life contemporary rule give frightening picture living unenlightened dictatorship recall think police constantly boom loudspeaker government espionage method cramp suggestion individualism far fantasy live nightmare individual government official name presumably expose perpetually ask implied question suffer young professional deal constantly chinese artist especially musician work therefore especially subject find make various confession give pole sympathy begin occasionally transliterate seek lose father almost immediately introduced new arrival year senior terrify open environment constantly cold afraid go get involved relationship author switch real subject life contemporary sudden disappearance dissenter close door suspect score character many appear quiet even chant live tell inner life give retrospect retrospect dead past mean survival forget nearly page learn ambition inevitable failure composer teach desire something small love always subservient revolution truth felt lead life entirely know fear ambitious heartfelt need mass note keep track subject tear character beautifully write hard put also extremely move time heart wrench know political event true many people live lose give permission stop read many little time attention breathtaking immensely move absolutely love everything character historical background mystery complexity write absorb novel year troubling image chinese folk write story woman essentially orphan search mean life speak chinese predispose awhile grow weary excessively long cast character easy keep straight leap present back present confusing also wordy music really add little substance find skim tale advance sense purpose warm character give quarter way enjoy humanize make real greatest political upheaval time know practically", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Winner of the 2016 Scotiabank Giller Prize and Finalist for the 2016 Man Booker Prize\r\n\r\n“In a single year, my father left us twice. The first time, to end his marriage, and the second, when he took his own life. I was ten years old.”\r\n\r\nMaster storyteller Madeleine Thien takes us inside an extended family in China, showing us the lives of two successive generations―those who lived through Mao’s Cultural Revolution and their children, who became the students protesting in Tiananmen Square. \r\n\r\nAt the center of this epic story are two young women, Marie and Ai-Ming. Through their relationship Marie strives to piece together the tale of her fractured family in present-day Vancouver, seeking answers in the fragile layers of their collective story. Her quest will unveil how Kai, her enigmatic father, a talented pianist, and Ai-Ming’s father, the shy and brilliant composer, Sparrow, along with the violin prodigy Zhuli were forced to reimagine their artistic and private selves during China’s political campaigns and how their fates reverberate through the years with lasting consequences.\r\n\r\nWith maturity and sophistication, humor and beauty, Thien has crafted a novel that is at once intimate and grandly political, rooted in the details of life inside China yet transcendent in its universality.\r\n\r\n\"A vivid, magisterial novel that reaches back to China's civil war and up to the present day.\" The Guardian", "asin": "039360988X", "rank": "76568", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/61URvJoRYJL.jpg", "country": "Canada", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}