{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 52, "rating": 3.1, "reviews": [{"review_sentiment": 3.0, "review_text": "This book could've been so much more than it was. It had a good story, good plot, but it was done to death by word and sentence repetition, like \"I'm seventeen\" and \"wearing a whore's green boots.\" This really dragged down the flow. \"Yes, I know you are seventeen and wearing a whore's green boots\" I kept saying. I don't know if this is the fault of the writer or the lack of taking responsibility from the editor. I haven't read the author's two other books but my guess is the former.Sad, because I really wanted to enjoy this book. I'll give it 3 stars for effort."}, {"review_sentiment": 2.0, "review_text": "After reading all the fabulous publicity from well-known writers, magazines, reviewers, NPR -- claiming  this book was \"sensuous\" \"luminous\"  a literary and erotic \"masterpiece\" no less. etc.etc., I was expecting something spectacular.  Unfortunately, it just doesn't live up to this marketing hyperbole. Characterization, Plot, Setting are ignored -- the author stakes everything on her minimalist style, on her opening line \"That day I am 17 and I am wearing the boots of a whore\"  -- and the narrator's tough talking voice and her autoerotic obsession with her own body and its effect on Manet.  Granted, such obsessions may have played a realistic part in the  psyche of a modele de profession in the times of Manet --but by making this the core of the book, the author reduces Victorine to a kind of cartoon who thinks exclusively about sex . Victorine Meurent was actually a very interesting woman -- she became an artist herself and even briefly enjoyed a bit of fame and even rivalry with the man for whom she had posed. She also lived to be eighty while he died at 51 of syphilis, (which some scholars suggest might be proof that they did not have a physical relationship, since she never seems to have developed the disease). The author includes some frank details in some of the sex scenes which don't really enhance them and which some of the other readers here found distasteful. I won't comment on that, but I will say that I thought it odd that given the many sex scenes in the book and the narrator's informing us how much she wants it, there doesn't seem to be any pleasure in it - she doesn't seem to be enjoying it much. That may be intentional on the part of the author, to show us a person who is primarily an object and as presented here, the victim of a patronizing system. Another thing that struck me though was that the key to  the real Victorine's personality wasn't sex drive but ambition - that ambition, clothed in her beauty and fired along by her strong instincts, intelligence and independence, are what allowed her to change her destiny, ending up on the other side of the easel.  From Gibbon's book, we don't get much sense of what must have been a complex personality."}, {"review_sentiment": 2.0, "review_text": "This is a mediocre, stiffly written novel, a fictionalized treatment of the relationship between Edouard Manet and his model, Victorine Meurant. The author seems to think she’s a female Earnest Hemingway; she writes in a flat, affectless, repetitious and overly-simplified style that sounds like an entry in one of those Hemingway caricature contests. I suppose she’s trying to achieve the voice of Victorine, an uneducated but sexually adventurous factory worker in Paris who became Manet’s model and mistress. The text is liberally sprinkled with French, which is often left untranslated. Although the author dutifully mentions many places and street names, she never for a moment conveys anything of the actual feeling of the life in those streets. It takes more than research to bring the past back to life— it takes a talent this author lacks.I will, however, give her credit for one thing: she frankly discusses the birth control Manet and his mistress use. Most novels that contain as much sexual description as this one does (none of it very attractive) omit that subject entirely."}, {"review_sentiment": 3.0, "review_text": "choppy narrative and strained sexual content. however, it was very interesting to learn more about Manet, his painting techniques, his group of artistic and intellectual friends … and Paris"}, {"review_sentiment": 2.0, "review_text": "Historical novels are my favorite genre when I'm looking for a new read, but I wouldn't recommend this one to anyone. The two protagonists are poorly developed & emotionally flat. The only aspect of the novel that truly drew me into the book was the excellent depiction of the artists' creative process. It was fascinating to read about how the artist & his muse (also an artist) communicated their artistic viewpoints. However, I found it very distasteful to read the sections about the couple's sexual relations. I don't think I'm a prude at all, but I don't find references to feces & birth control in any way sensual. I wish I had read more of the readers' reviews before purchasing this book because it was a waste of time & money."}, {"review_sentiment": 5.0, "review_text": "Gibbon's has captured an artist's eye and the internal thinking of a serious artist in her novel!She is able to convey deep feelings and emotions to her reader and also engage all the senses with her words.I admire her writing and how she conveys the senses through it. The love of color is apparent in her characterizations in Paris Red. The relationships become real and very thoughtful in provoking a reaction as I read about them. She used her characters well and also the city of Paris. The touches of French language made me pause and think about the meaning behind them. Culture and time period are weaved into the story about an artist and his model. The model's reflection about his painted canvases and his use of colors made it very authentic in an artistic realm. The last painting of her seems to lead into a serious evolution in the artist's career. There could be another installment of this story and the characters presented here.I am looking forward to reading a new novel from Gibbons."}, {"review_sentiment": 3.0, "review_text": "I purchased this book because I have a particular interest in Victorine Meurent and was hoping to find that she was well portrayed in this novel.I was disappointed. Victorine is not very interesting in this book, and neither is Manet. His vision was not focused on, her independence was not at all in evidence, let alone her own ambition to be a painter and how, as usual, she was not encouraged to pursue her own dream to paint because she was a woman. I hate to put it this way, but, according to Ms. Gibbon, she's just a victim of a self-absorbed artist. And what is this constant reference to her green boots, 'the boots of a whore'. It would probably have been much better as a short story, because the scenes became repetitive, over and over they're having sex, and then he paints. I really do believe that both of these people in their real lives were much more interesting. This book is just a gimmick to appeal to someone like me who took the bait and bought the book, hoping for a good read about Victorine. I'll never pick up another book by Ms. Gibbon. Read Alias Olympia to get a better idea of Victorine Meurent, although there isn't much known about her."}, {"review_sentiment": 1.0, "review_text": "I read it for fun, then I realized, I just read and it wasn't much fun.The plot is weak, the characters not well developed"}, {"review_sentiment": 1.0, "review_text": "If you are interested in art or Manet in particular, this is likely not a book you will enjoy. If you are looking for erotica under the guise of a novel about art, this is it. This book lacks substance and is full of cliché lines and unoriginal ideas. The author even throws in a few basic French phrases for no other reason than to decorate the prose. I returned this book to the library after reading 1/3 of it."}, {"review_sentiment": 3.0, "review_text": "Nice portrait of a woman, but I would have liked a little more about the artists in the book.  It was a light read."}]}, "authors": ["Maureen Gibbon"], "isbn": "0393244466", "longitude": 2.3514992, "periods": ["1800s", "Recent Releases"], "title": "Paris Red", "word_cloud": "good story good plot do death word sentence repetition seventeen wear whore green boot really dragged flow yes know seventeen wear whore green boot keep say know fault writer lack take responsibility editor author guess really want enjoy give star effort read fabulous publicity writer magazine reviewer claim sensuous luminous literary erotic masterpiece le expect something spectacular unfortunately live marketing hyperbole ignore author stake everything minimalist style open line day wear boot whore narrator tough talk voice auto erotic obsession body effect obsession realistic part psyche profession time make core author reduce kind cartoon think exclusively sex actually interest woman become artist even briefly enjoyed bit fame even rivalry man pose also live eighty die syphilis scholar suggest physical relationship never seem developed author include frank detail sex scene really reader find distasteful say think odd give many sex scene narrator inform much want seem pleasure seem enjoy much part author show person primarily object present victim patronize system thing strike key real personality sex drive ambition ambition clothe beauty fire strong instinct intelligence independence allow change destiny end side easel much sense personality mediocre stiffly write fictionalized treatment relationship model author seem think female write flat affect less repetitious style sound entry caricature contest suppose try achieve voice uneducated sexually adventurous factory worker become model mistress text liberally sprinkle french often leave untranslated author dutifully mention many place street name never moment conveys anything actual feeling life street take research bring past back take talent author however credit thing frankly discuss birth control mistress use novel contain much sexual description none attractive omit subject entirely choppy narrative strain sexual content however interesting learn paint technique group artistic intellectual friend historical novel favorite genre look new anyone protagonist poorly develop emotionally flat aspect truly draw excellent depiction artist creative process fascinate artist muse also artist communicate artistic viewpoint however find distasteful section couple sexual relation think prude find reference feces birth way sensual wish reader review purchase waste time money capture artist eye internal thinking serious artist able convey deep feeling emotion also engage sens admire write conveys sense love color apparent characterization relationship become real thoughtful provoke reaction use character well also city touch french language make pause think mean culture time period weave story artist model model reflection paint canvas use color make authentic artistic realm last painting seem lead serious evolution artist career installment story character present look forward read new gibbon purchase particular interest hop find well portrayed disappointed interest vision focus independence evidence alone ambition painter usual encourage pursue dream paint woman hate put way accord victim artist constant reference green boot boot probably much better short story scene become repetitive sex paint really believe people real life much interest gimmick appeal someone take bait buy hop good never pick better idea much know fun realize much plot weak character well develop interested art particular likely look erotica guise art lack substance full cliche line unoriginal idea author even throw basic french phrase reason decorate prose return library reading portrait woman little artist light", "genres": ["Fiction & Literature", "Romance", "Art & Architecture", "Historical Fiction"], "summary": "Paris, 1862. A young girl in a threadbare dress and green boots, hungry for experience, meets the mysterious and wealthy artist Édouard Manet. The encounter will change her—and the art world—forever.\r\n\r\nAt seventeen, Victorine Meurent abandons her old life to become immersed in the Parisian society of dance halls and cafés, meeting writers and artists like Baudelaire and Alfred Stevens. As Manet’s model, Victorine explores a world of new possibilities and stirs the artist to push the boundaries of painting in his infamous portrait Olympia, which scandalizes even the most cosmopolitan city.\r\n\r\nManet becomes himself because of Victorine. But who does she become, that figure on the divan?\r\n\r\nIntense, erotic, and beautifully wrought, Paris Red evokes the unconventional love story of a painter and his muse that changed the history of art.", "asin": "0393244466", "rank": "1110656", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/512n4conV%2BL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}