{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 29, "rating": 3.7, "reviews": [{"review_sentiment": 1.0, "review_text": "Did NOT care for the book at all. In fact, I thought I was getting an entirely different book with the same name. The OTHER Good Morning Midnight was excellent."}, {"review_sentiment": 2.0, "review_text": "character is not fully developed - seems totally infused with \"self\""}, {"review_sentiment": 3.0, "review_text": "In Jean Rhys’ post-modern novel, Good Morning, Midnight, we follow the wanderings and perspectives of Sasha Jensen, an American who has come back to Paris. There is a definitive gloomy, fatalistic, disillusioned approach to Sasha’s narrative, as she tries to not only drink herself to death, but meditates on the failed experiences of love and hope. To say that Rhys’ novel is a tad depressing is a bit of an understatement, but amongst the bleakness and gloom, there is a definite introspective look into the character of Sasha, and I think Rhys certainly captures the overall sense of nihilism that encapsulates the entire narrative.Jean Rhys captures the alienation and lack of identity of Sasha with such lyrical accuracy. Here is one such example: “I am empty of everything. I am empty of everything but the thin, frail trunks of the trees and the thin, frail ghosts in my room.”As our narrator sheds more light on her past—and present—condition, we learn all the failings of her personal life she had to endure. We get bits and pieces of her life in a fragmentary, stream-of-consciousness type of narration, and we get a sense that her downward spiral has contributed to her drinking habits and over all bleak frame of mind.I think this quite possibly (next to Ethan Frome) might be the single most depressing book I’ve ever read. I do think Rhys captures what she intends to capture, and there certainly is a lyrical almost poetic, style to her writing that is impressive. But, wow, I had to set this book down every now and then just to be able to endure it for the long haul. If you read, you might want to read another book alongside, something opposite this one; you know, something happy and cheery."}, {"review_sentiment": 5.0, "review_text": "Good Morning, Midnight is a book that will stay with me for a while. This is a stream or consciousness, first person narrative about a sad and lonely main character. From page one, I wanted to know her. I wanted to understand the reasons why she chose to drink her life away. The book did not disappoint. I loved it!!!"}, {"review_sentiment": 5.0, "review_text": "Bought this copy to give away, because I wanted to share the experience. That's how much I liked it."}, {"review_sentiment": 3.0, "review_text": "Rhys is a modernist writer and she tends to write in the stream of consciousness style so it can be a bit difficult to read. So it took a bit for me to get into the book, plus it’s about a woman who is spiraling into madness. And I think I’m overly emphatic because the book just added to my own depression. And spoiler! the book doesn’t have a happy ending. I know that I’m not painting a positive review of the book, but I liked it. I would just say if you are someone who is an empathetic reader, you may want to read this in the summer when the sun is shinning, and it’s maybe easier to find a happy place while reading it."}, {"review_sentiment": 5.0, "review_text": "I wanted a hardcover copy of this book, and this 1969 printing of it was the only one I could find."}, {"review_sentiment": 5.0, "review_text": "Fascinating that the best portraits of despairing women in 1930s France were written by Scott Fitzgerald (“Tender Is the Night”) and Jean Rhys (“Good Morning, Midnight”).  Both were self-exiled English-speakers drawn to France, where they found the perfect setting for female characters who struggled on, hopelessly.  Fitzgerald’s novels may have had a broader canvas, but for deep penetration into the soul of sadness, Rhys is superior.  “Good Morning, Midnight” is a brief stream of the consciousness of Sasha Jensen, who has run out of options in London and returned to the scene of earlier downfalls, Paris.  She is profoundly disappointed by men, close to penniless, well aware that she is turning into a raddled old drunk.  She lurches from one bound-to-fail relationship to another.  However, the conclusion is not death in a gutter, as you might imagine.  Why read page after page anatomizing self-destructiveness?  Where a random search yields lines like: “What is she (Sasha herself) doing here?  I have seen that in people’s eyes all my life.”  You read on because you can’t take your eyes off this train wreck, it’s so damned well written.  “I often want to cry,” Sasha says.  “That is the only advantage women have over men—at least they can cry.”  Rhys wrote several other books in this existentialist vein, and should be regarded as one of the finest writers of the 20th century."}, {"review_sentiment": 4.0, "review_text": "I enjoyed the reading."}, {"review_sentiment": 3.0, "review_text": "Ok book at best"}]}, "authors": ["Jean Rhys"], "isbn": "0393303942", "longitude": 2.3514992, "periods": ["1900s"], "title": "Good Morning, Midnight", "word_cloud": "fact think get entirely different name excellent character fully develop seem totally infuse self follow wandering perspective back definitive gloomy fatalistic disillusion approach narrative try drink death meditates fail experience hope tad depress bit understatement among st bleakness gloom definite introspective look character think certainly capture overall sense nihilism encapsulate entire capture alienation lack identity lyrical accuracy here example empty everything empty everything thin frail trunk tree thin frail ghost narrator shed light learn failing personal life endure get bit piece life fragmentary type narration get sense downward spiral contribute drink habit bleak frame think quite possibly next single depressing ever think capture intend capture certainly lyrical almost poetic style write impressive wow set able endure long haul alongside something opposite know something happy cheery stream consciousness first person narrative sad lonely main character page want know want understand reason choose drink life away disappoint love copy want share experience much like modernist writer tend write stream consciousness style bit difficult take bit get woman spiral madness think overly emphatic add depression spoiler happy end know paint positive review like someone empathetic summer sun shin maybe easier find happy place reading want hardcover copy print fascinate best portrait despair woman write draw find perfect set female character struggle hopelessly novel canvas deep penetration soul sadness superior brief stream consciousness option return scene earlier downfall profoundly disappoint men close penniless well aware turn raddled old drunk lurch relationship however conclusion death gutter page page anatomize random search yield line see people eye eye wreck damn well write often want cry say advantage woman least write several existentialist vein regard finest writer century enjoy read ok best", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "Sasha Jensen has returned to Paris, the city of both her happiest moments and her most desperate. Her past lies in wait for her in cafes, bars, and dress shops, blurring all distinctions between nightmare and reality. \r\n\r\nWhen she is picked up by a young man, she begins to feel that she is still capable of desires and emotions. Few encounters in fiction have been so brilliantly conceived, and few have come to a more unforgettable end.\r\n\r\n\"No one who reads Good Morning, Midnight will ever forget it.\" New York Times", "asin": "0393303942", "rank": "163466", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51YjMYh0lJL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}