{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 195, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I loved it!  The author has such a style that even if there was no plot at all it would fascinate me."}, {"review_sentiment": 5.0, "review_text": "Discovered Jay McInerney from WSJ Wine reviews but was inclined to read this book after a recent Eater Upsell interview"}, {"review_sentiment": 5.0, "review_text": "It reminded me of my younger careless days, Bright Lights,Big City is a quick read that resumes in 200 pages a scream of a generation."}, {"review_sentiment": 4.0, "review_text": "Vintage, is right!  Total 80's novel, I think McInerney's breakout book.  Definitely conveys the flavor of the era in NYC."}, {"review_sentiment": 5.0, "review_text": "An excellent book in a unique format. It is a great story, and it is very well written: it is the whole package.I wouldn’t say that you need to work to understand this book, but in order to get the most out of it you definitely have to give it your undevided attention. I wouldn’t recommend reading it while eating lunch for example."}, {"review_sentiment": 5.0, "review_text": "Enjoyed this book immensely. A quick read too. Not sure why I never read it before. I recommend it to all."}, {"review_sentiment": 4.0, "review_text": "have not read yet - enjoyed other books by this author"}, {"review_sentiment": 2.0, "review_text": "Bright Lights, Big City.Nothing but pure unadulterated fluff. Tries to capture but fails miserably in trying to capture the essence of the characters."}, {"review_sentiment": 4.0, "review_text": "Although not McInerney's best work, this book was entertaining and a quick read. If it had been the first of his books I read, I might not continue. But I really enjoy his writing and look forward to his next books."}, {"review_sentiment": 5.0, "review_text": "He makes it work.  I felt like I was on the same roller coaster ride.  Emotionally and physically.  Great story the only complaint I have is that it went to fast."}]}, "authors": ["Jay McInerney"], "isbn": "0394726413", "longitude": 0.0, "periods": ["1900s"], "title": "Bright Lights, Big City", "word_cloud": "love author style even plot review incline recent interview remind younger careless day quick resume page scream generation vintage right total think breakout conveys flavor era nyc excellent unique format great story well write whole say need work order get definitely undecided attention recommend read eat lunch example immensely quick not sure never recommend yet enjoy author pure unadulterated fluff capture fail miserably try capture essence character best work entertain quick first really write forward next make work felt roller coaster ride physically story complaint go fast", "genres": ["Fiction & Literature"], "summary": "With the publication of Bright Lights, Big City in 1984, Jay McInerney became a literary sensation, heralded as the voice of a generation. The novel follows a young man, living in Manhattan as if he owned it, through nightclubs, fashion shows, editorial offices, and loft parties as he attempts to outstrip mortality and the recurring approach of dawn. With nothing but goodwill, controlled substances, and wit to sustain him in this anti-quest, he runs until he reaches his reckoning point, where he is forced to acknowledge loss and, possibly, to rediscover his better instincts. This remarkable novel of youth and New York remains one of the most beloved, imitated, and iconic novels in America.", "asin": "0394726413", "rank": "55973", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51yO4QqrQzL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}