{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 1143, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "before you spend your $6.99, be warned, the book is riddled with typos, often 3 or 4 to a page. Whoever approved the file for publication should get fired."}, {"review_sentiment": 5.0, "review_text": "An excellent classic of its genre -- the hard-boiled detective novel.  If you have really been through the wringer with all of \"today's\" books and want to take yourself back to a simpler, better, more defined time, then \"The Big Sleep\" is a very good novel with which to begin.  It is not long and reads very quickly.  For all of us who have always wondered where the parodies and satires and even serious depictions of private eyes have come from, this is where it all started."}, {"review_sentiment": 5.0, "review_text": "The master at work."}, {"review_sentiment": 5.0, "review_text": "Excellent novel"}, {"review_sentiment": 4.0, "review_text": "Raymond Chandler is a master at evoking setting and character with sharp, powerful prose.  He should be read by every reader who appreciates the genre of detective fiction, and studied by every serious writer, no matter the genre. His private eye, Philip Marlowe, is iconic, but his treatment of women leaves much to be desired.  Just keep in mind, he's a product of his era (The Thirties)."}, {"review_sentiment": 5.0, "review_text": "a classic that doesnt dissapoint. named my cat marlowe."}, {"review_sentiment": 5.0, "review_text": "I love the Bogart/Bacall screen version, but the novel has a complete (though challenging) plot. In the book, you’ll finally find out what happened to “Shawn” (Rusty) Regan, Bacall’s husband. Little sister, Carmen, has a much more dominant role, and Geiger’s backstory business is much steamier than hinted at in the film.When Marlowe finally meets “Mrs. Eddie Mars,” Carmen’s sister (Bacall) isn’t there ... and the dynamic is much more suspenseful. Although I love THE BIG SLEEP, I actually think that two of Chandler’s less popular works are his triumphs: THE HIGH WINDOW and PLAYBACK.In short, even if you’ve seen the 1940s film adaptation dozens of times and have memorized the plot, you will find THE BIG SLEEP a very satisfying read."}, {"review_sentiment": 2.0, "review_text": "The book is great! This particular Kindle edition is terrible - typos, typos, typos. Just one example\" every \"cl\" is displayed as \"d\". Good that I've read the book about 1 thousand times."}, {"review_sentiment": 3.0, "review_text": "Mildly interesting. Massively confuding"}, {"review_sentiment": 5.0, "review_text": "School books"}]}, "authors": ["Raymond Chandler"], "isbn": "0394758285", "longitude": -118.244476, "periods": ["1900s"], "title": "The Big Sleep", "word_cloud": "spend warn riddled typo often page approve file publication get fire excellent classic genre detective really wringer today want simpler better defined time good long read quickly always wonder parody satire even serious depiction private eye come start master work excellent master evoke set character sharp powerful prose appreciate genre detective fiction study serious writer matter genre private eye iconic treatment woman leave much desire mind product era thirty classic doesn't disappoint name cat marlowe love screen version complete challenge plot finally happened husband sister much dominant role backstory business much steamier hint finally meet sister dynamic much suspenseful love actually think le popular work short even see film adaptation dozens time memorized plot find satisfying great particular edition terrible typo typo typo example cl display thousand time mildly interest massively confide school", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "When a dying millionaire hires Philip Marlowe to handle the blackmailer of one of his two troublesome daughters, Marlowe finds himself involved with more than extortion. Kidnapping, pornography, seduction, and murder are just a few of the complications he gets caught up in.\r\n\r\n\"Chandler [writes] like a slumming angel and invest[s] the sun-blinded streets of Los Angelos with a romantic presence.\"", "asin": "0394758285", "rank": "18804", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/513T9%2BL2dSL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}