{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 23, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "This is a VERY enjoyable book, but it's a stretch to describe it as \"the biography of Mexico City.\"  It is not!  It's more of a history of the politics of the country of Mexico with the city as a backdrop; the closer you get to the present day, the more so it becomes."}, {"review_sentiment": 5.0, "review_text": "I thought the book was going to be a bore because it is sinking but I actually found it extremely good!"}, {"review_sentiment": 4.0, "review_text": "Excellent account of conquest, colonial and modern history of Mexico, the city and the country. A couple of statements made me frown, though. The one claim that stuck in my mind is the author stating that man has been in the Americas for 30 thousand years. Really? I thought the accepted time line was 14 thousand years or so."}, {"review_sentiment": 5.0, "review_text": "Was my opening read to living for six years in DF. And what a read it is/was.Mexican history as seen through the world of Mexico City, always a challenge and often a uniquely exciting place to live. Plan to buy another copy for a friend retiring in El Norte Mexico."}, {"review_sentiment": 5.0, "review_text": "This is a fantastic Mexican history book."}, {"review_sentiment": 5.0, "review_text": "If you want to read only one book to understand Mexico, this is the book. Well written and understandable. At times even funny!"}, {"review_sentiment": 5.0, "review_text": "I know Mexico City better than most Chilangos, speak Spanish and love history.  I have lived in DF off and on for ten years.Although fact-filled the writing is never tedious, I have found only one mini-error in the entire book, Kandell writes with elan and utilizes king's English to its utmost.  If you are interested in Mexican history this book is a must have ... but difficult to find in that it has been out of print since 1990 ... hard to find a copy!I treasure my copy of La Capital so much I don't lend it out because it is an irreplaceable reference book of my favorite city (I have lived in London, Paris, Hong Kong, Copenhagen, Munich - all great cities - but El Distrito Federal is hands-down my concept of a Total City in that its 573 square miles encompass totality.I love this book so much that I have read it twice.  And the second reading was better than the first!  You can't say that for many books!"}, {"review_sentiment": 5.0, "review_text": "This marks the sixth or seventh time I have read Kandell's very good account of the history of Mexico City.  I tend to read it every few years when I feel this country is heading in the wrong direction - one can draw many parallels between this biography of Mexico City and the United States."}, {"review_sentiment": 5.0, "review_text": "The best book about Mexico City ever written. Just like Michener's Hawaii. From it's geological conception till the down fall in the 80's when corruption was king. ( Still is ). I wish someone would write a book like this about Havana: Americas First Capital."}, {"review_sentiment": 4.0, "review_text": "This is an amazing account of Mexico City, stretching from the Aztecs to modern times.  It's a page turner, reads like a novel but imparts a profound sense of history. I first read it years ago when I was traveling to Mexico City regularly.  It gave me an insight and understanding into that enigma of a city that I couldn't have gotten anywhere else. A beautiful and fascinating book."}]}, "authors": ["Jonathan Kandell"], "isbn": "0394540697", "longitude": -99.1333416, "periods": ["1600s", "1700s", "1800s", "1900s", "Recent Releases", "1500s", "500-1400s"], "title": "LA Capital: The Biography of Mexico City", "word_cloud": "enjoyable stretch describe history politics country backdrop closer present day becomes think go sink actually find extremely good excellent account conquest colonial modern history country couple statement make frown claim stick mind author state man year really think accepted time line year open live year history see world always challenge often uniquely exciting place live copy friend retire fantastic history want understand write understandable time even funny know better speak spanish history live ten write never tedious find entire write elan utilizes king english utmost interested history difficult print hard find copy treasure copy much lend irreplaceable reference favorite live great city concept square mile encompass love much twice second reading better first many mark sixth seventh time good account history tend year feel country head wrong direction draw many parallel best ever write geological conception till corruption king still wish someone amazing account stretch modern time page turner read imparts sense history first year ago travel regularly give insight understanding enigma anywhere else beautiful fascinating", "genres": ["Biography", "History", "Politics"], "summary": "From the ancient geological rumblings that formed the city's unique setting to the recent tremors that devastated the city in 1985, the capital's complex story unfolds. The countless individuals, both famous and unknown, who shaped Mexico' history come alive . . . they prosper, decline, and rise again before being extinguished by political and social upheavals beyond their control.", "asin": "0394540697", "rank": "232870", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51D9%2BWnWmCL.jpg", "country": "Mexico", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}