{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 69, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "This is forever one of my favorite books even though I have yet to finish all avenues it provides. The seller I purchased from was outstanding and got the book to me a week early along with a sweet handwritten note! Strong recommendations to anyone looking for a novel adventure."}, {"review_sentiment": 4.0, "review_text": "Interesting novel, the original hypertext. Can be read two ways (and I'm guessing more) according to the front cover. My issue is not with the content of the book but the book itself. I've read the book the linear way - Chapters 1-57, and my book has started spitting out pages in the 250 range. Literally, 3-5 pages have fallen out of the book while reading. I bought the book brand new, this is my first time reading it, so I am frustrated.I have to read the book the second, hopscotch way, and am not looking forward to it with the falling pages."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 2.0, "review_text": "Was a mandatory book for my Comparative World Literature Course so it wasn't to interesting, but it did arrive on time."}, {"review_sentiment": 1.0, "review_text": "Extremely confusing book"}, {"review_sentiment": 4.0, "review_text": "I received this book in good condition."}, {"review_sentiment": 5.0, "review_text": "One of the best books ever, it's Jazz made literature, it's the study of a character, is the study of metaphysics, it's just a random short story seem from many points, it's a game, every single page deals with what the an author can achieve to free thyself from common standards of what writing should be like, is more than one book, you'll never read the same thing twice.Also you need to speak some spanish and french to fully understand it.I'm a native spanish speaker and read it in spanish, many puns would not be understandable, if you get confuse that's ok, that is the whole idea."}, {"review_sentiment": 5.0, "review_text": "Great story , such an interesting way to write teh book"}, {"review_sentiment": 1.0, "review_text": "This book was a struggle. I struggled with every page. I am an avid reader and for some reason, this book felt like laborious work to finish."}, {"review_sentiment": 5.0, "review_text": "Great book"}]}, "authors": ["Julio Cortazar"], "isbn": "0394752848", "longitude": 2.3514992, "periods": ["1900s"], "title": "Hopscotch", "word_cloud": "forever favorite even yet finish avenue provide seller purchase outstanding get week early along sweet handwritten note recommendation anyone look adventure interest original hypertext way guess accord front cover issue content linear way chapter start spit page range page fall read buy brand new first time read second way look forward fall page excellent mandatory interest arrive time extremely confuse receive good condition best ever make literature study character study metaphysics random short story seem many point game single page deal author achieve free thyself common standard write never thing need speak spanish french fully understand native spanish speaker spanish many pun understandable confuse ok whole idea story interest way write the struggle struggle page avid reason felt laborious work finish great", "genres": ["Fiction & Literature"], "summary": "Translated by Gregory Rabassa, winner of the National Book Award for Translation, 1967\r\n\r\nHoracio Oliveira is an Argentinian writer who lives in Paris with his mistress, La Maga, surrounded by a loose-knit circle of bohemian friends who call themselves \"the Club.\" A child's death and La Maga's disappearance put an end to his life of empty pleasures and intellectual acrobatics, and prompt Oliveira to return to Buenos Aires, where he works by turns as a salesman, a keeper of a circus cat which can truly count, and an attendant in an insane asylum. Hopscotch is the dazzling, freewheeling account of Oliveira's astonishing adventures.\r\n\r\n\"Cortazar's masterpiece . . . The first great novel of Spanish America.\" The Times Literary Supplement", "asin": "0394752848", "rank": "55761", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51%2BFFnEAW3L.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}