{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 49, "rating": 3.1, "reviews": [{"review_sentiment": 3.0, "review_text": "Think texts laden with lush, detailed descriptions of everything whether relevant or not and you've got the feel for this book. It was a bit much at times when you expect the action to pick up--and there are great long detours of descriptions of people and their moods and surroundings.  Trails of thought and character that I struggled to follow to its pointless end. I stuck it out to the end but now I'm not sure why."}, {"review_sentiment": 3.0, "review_text": "As much as I love mysteries, I could only bring my self to read only 28%.  Way too wordy (fluff).  It's not necessary to the story and if edited out would make a better book, in my opinion."}, {"review_sentiment": 3.0, "review_text": "Been a while since I read this book. However I did manage to finish the story, though for me it was a struggle."}, {"review_sentiment": 1.0, "review_text": "No matter how much acclaim this book has garnered, that foes not excuse a pretentious writing style.  Present tense story telling is supposed to give a sense of immediacy.  It sets my teeth on edge.  This book was abandoned before I finished a chapter.  Others may enjoy this book.  I did not."}, {"review_sentiment": 4.0, "review_text": "Enjoyable way to spend your quiet time"}, {"review_sentiment": 5.0, "review_text": "A good introduction to the characters helps to keep the reader moving through a long, complicated plot.,"}, {"review_sentiment": 1.0, "review_text": "About one quarter through the book and I could not do any more.  Overly wordy mental ruminations that were whimsical and nonsensical.  First nine chapters could have reduced to one chapter if it were just a plot easily followed instead of meandering thoughts."}, {"review_sentiment": 5.0, "review_text": "Blew me away when I read it on appearance.  I'm too old now to give a fresh perspective."}, {"review_sentiment": 1.0, "review_text": "Which explains why so many people don’t find this book boring to the point of stupefaction, as I did. There’s something for everyone, apparently. Some are connoissuers of the aesthetics of tedium. I’m not one.I guess some people like morose, self-pitying characters whose every mundane daily action gets delineated in tedious detail, along with every boring memory they have. And trust me, there are a lot of those since we spend so much time in the past, learning everything they ever did in their vapid lives. By page 200, I was rooting for the psycho to wipe them all out, just to put them out of their misery – and mine. (At least he’s funny, even if his pathology is risible. But in fairness to Mr. Smith, this came a few years before people became hip to the psycho killer/profiler thing.)Also to be fair, there’s one other funny thing here. I’m not giving away any spoiler by saying that the deep dark horrible terrible transgression of the moral order that engenders all of this is…wait for it….: a  case of the clap. I don’t care who you are, funny is funny. And reading this book, you’ll be desperate to find anything amusing.I also have to surmise that many readers don’t mind leaden prose that goes on and on and on endlessly in descriptive detail. One reason I got this was the comparisons to Dickens, among others. Well, I just read “Martin Chuzzlewit,” where Chuck spends three pages describing the sign over a tavern and makes it sing. This guy spends the same amount of time describing a street I saw within the first two sentences. At least Dickens had the excuse of being paid by the word.So, don’t be fooled by those who drop names like his, or Pynchon’s or Dostoevsky’s or Kafka’s. This is not literature. This is just long. I can only think that those who compare this to their work haven’t actually read any of those authors, because there’s nothing here remotely reminiscent of any of them. And BTW: Bellow did Chicago better.Bottom line: If you’re a fan of mysteries and detective fiction, stay away. If you’re a fan of fine literature, stay away.Pick up something by Jim Williams instead. Now, there’s a guy who shows how to do genre and classy lit at the same time."}, {"review_sentiment": 1.0, "review_text": "Confusing and not a very satisfying read."}]}, "authors": ["Mark Smith"], "isbn": "0394487664", "longitude": -87.6244212, "periods": ["1900s"], "title": "The death of the detective", "word_cloud": "lade lush detailed description everything relevant get bit much time expect action pick great long detour description people mood surroundings think character struggle follow pointless end stick end sure much love mystery self wordy fluff necessary story edit better opinion however manage finish story struggle matter much acclaim garner foe excuse pretentious write style tense story tell suppose give sense immediacy set teeth edge abandon finish chapter others enjoyable way quiet time good introduction character help move long complicate quarter overly mental rumination whimsical nonsensical chapter chapter plot easily follow instead meander thought away appearance old give fresh perspective explain many people find boring point stupefaction something everyone apparently connoisseur aesthetics tedium guess people morose character mundane daily action get delineate tedious detail boring memory trust lot spend much time learn everything ever vapid life page root psycho wipe put misery mine least funny even pathology risible fairness come year people become hip psycho thing also fair funny thing give away spoiler say deep dark horrible terrible transgression moral order engenders case clap care funny funny reading desperate find anything also surmise many reader mind leaden prose go endlessly descriptive detail reason get comparison others spend page describe sign tavern make sing guy spend amount time describe street saw first sentence least excuse pay fool drop name literature long think compare work actually author nothing remotely reminiscent line fan mystery fiction away fan fine literature stay something instead now guy show genre classy lit time confuse satisfy", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "“Remarkable for both its ambition and its accomplishment, it reads as though it were written by a resurrected Charles Dickens, one chilled by a hundred years of graveyard brooding…every page is a pleasure to read.” The New York Times\r\n\r\nA killer calling himself The Deathmaker is on the loose, pursued by Arnold Magnuson, a grief-stricken detective on the verge of a mental breakdown. Magnuson’s dogged investigation to find the killer, and himself, takes him deep into urban Chicago, laying bare the corrupt city and its seething soul in all its macabre, heartbreaking, and violent complexity. It’s a sprawling, utterly compelling story, widely regarded as a stunning literary achievement and perhaps the best detective novel ever written.\r\n\r\n“A masterpiece . . . raises Dickens’ benign ghost to remind us again that we're all connected, all both innocent and guilty,” Kirkus Reviews", "asin": "0394487664", "rank": "2039030", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/615ChN52TvL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}