{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 3, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Before Evans's collaboration with James Agee in \"Let Us Now Praise Famous Men\", he collaborated (sort of) with Carleton Beals on a book on Cuba, \"The Crime of Cuba\".  Evans's photographs of Cuba are not nearly as well known as his photographs of the hardscrabble Depression South, but, arguably, they are as penetrating, and they certainly are more diverse.  Among other things, they are the earliest examples of Evans's \"cool documentary treatment\" and they announce, \"Here is a great photographer.\"In April 1933 an editor at Lippincott asked Evans to take photographs for a polemical book by Beals, a leftist writer who was very critical of the then Cuban dictator Gerardo Machado and anxious to show how American support of Machado had created an economic catastrophe in Cuba.  Evans agreed after acceptance of his conditions that he have complete freedom to choose the photographs for publication and that they be collected at the end of the book so that they appeared to be an independent entity and not simply illustration of the text.  Indeed, according to legend, Evans had not read Beals's text when he went to Havana in May 1933.  He was in Cuba for three weeks.  When his personal funds ran out, his way was paid for by Ernest Hemingway; the two had never met before, but Hemingway was eager for the company of someone equally qualified in literary conversation and in drinking.In the end, Evans contributed thirty-one photographs to the published \"The Crime of Cuba\".  This book, WALKER EVANS: HAVANA 1933, contains seventy of the photographs Evans took in Cuba, including most of the photographs he selected for \"The Crime of Cuba\".  The volume is introduced by an excellent essay by Gilles Mora that gives the historical background and discusses the place of Evans's Cuban photographs in his overall body of work.  The photographs were selected by Mora and by John T. Hill, who also was responsible for the sequencing of their presentation.  (One of Mora's points is that Evans attached a great deal of significance to the sequencing of his photographs, any collection of which he viewed as a composite artistic/documentary statement and, as such, more important than any single photograph.)Among the photographs are crowd scenes, street scenes, portraits of individuals, cityscapes, the waterfront, a few country villages, signs, and a classic one that Evans entitled \"Havana Citizen\" of a tall and lanky dark man, quite worldly in white suit and straw boater at a newsstand.  Especially arresting are the photographs of the poor: a street vendor of caramel candy, men in dirty clothes sleeping in shaded public places, two women sleeping on a street bench, one with a wooden, unnatural leg and foot, a beggar, and coal-dust blackened dock workers.  A kinship with Evans's later Farm Security Administration photographs is quite evident.WALKER EVANS: HAVANA 1933 is noteworthy as early yet representative photographs by Walker Evans and as documentation of pre-revolutionary Cuba.  I find it as engaging as the other more familiar collections of Evans's photographs."}, {"review_sentiment": 5.0, "review_text": "Walker Evans, at twenty nine, sailed to Cuba in 1933 on assignment to photograph the country for a Lippincott published book called “The Curse of Cuba,” a purple prose expose’ written by a leftist New York writer yearning for a revolution.  Evans met Ernest Hemingway in a bar, they became friends and palled around together so much so that Hemingway had him stay another week at his expense.Evans was independent enough not to succumb to the author’s politics,  so he crafted his own photography essay, promising “a real Cuban narrative … naïve, true, pure, sound and a work of art as well as a document.”“Havana 1933” is one of two books presenting his promised artistry, the other “Cuba” with an essay by Andre Codrescu. The Havana photos in this book show the famous Evans’ detachment at an early time of his development. His up close portraits of the sullied, dirt covered dock workers are intensely personal showing the relaxed confidence of each of his subjects. The languor of the heat of Havana jumps from the shots of the sleepy denizens of Havana. The alert, stately Afro-Cuban, white suited and hat at a news stand, his eyes are riveting,  captures the diversity and confidence of pre revolution Cuba.This is the artistry of one of America’s foremost photographer; his book is worth revisiting again and again."}, {"review_sentiment": 5.0, "review_text": "\"Walker Evens Havana\" shows the city of Havana as it was before the revolution.  The photographs are a clear, beautiful depiction of city life and its beauty.  A must for anyone interested in Cuba or Havana!"}]}, "authors": ["Gilles Mora"], "isbn": "0394574931", "longitude": -82.3658671, "periods": ["1900s"], "title": "Walker Evans: Havana 1933", "word_cloud": "evans collaboration now collaborate sort photograph nearly well know photograph hardscrabble arguably penetrate certainly diverse thing earliest example cool documentary treatment announce here great photographer editor ask evans take photograph polemical seal leftist writer critical dictator anxious show american support create economic catastrophe agree acceptance condition complete freedom photograph publication collect end appear independent entity simply illustration text indeed accord legend text go week personal fund ran way pay never meet eager company someone equally qualify literary conversation end contribute photograph publish contain seventy photograph take include photograph select volume introduce excellent essay give historical background discuss place photograph overall body work photograph select also responsible sequence presentation point attached great deal significance sequence photograph collection view composite statement important single photograph photograph crowd scene street scene portrait individual cityscape waterfront country village sign classic entitle tall lanky dark man quite worldly white suit straw boater newsstand arrest photograph poor street vendor caramel candy men dirty clothes sleep shade public place woman sleep street bench wooden unnatural leg foot beggar blacken dock worker kinship later photograph quite evans early yet representative photograph documentation find engage familiar collection evans photograph twenty sail assignment photograph country publish call purple prose expose write leftist writer yearn revolution meet bar become friend pal together much stay week independent enough succumb author politics craft photography essay promise real narrative nave true pure sound work art well presenting promise artistry essay photo show famous detachment early time development close portrait sully dirt cover dock worker intensely personal showing relaxed confidence subject languor heat jump shot sleepy denizens alert stately white suit news stand eye rivet capture diversity confidence per revolution foremost photographer revisit show city revolution photograph clear beautiful depiction city life beauty anyone interested", "genres": ["Essay", "Art & Architecture", "Travel Writing"], "summary": "Walker Evans, at twenty nine, sailed to Cuba in 1933 on assignment to photograph the country for a Lippincott published book called “The Curse of Cuba,” a purple prose expose’ written by a leftist New York writer yearning for a revolution. Evans met Ernest Hemingway in a bar, they became friends and palled around together so much so that Hemingway had him stay another week at his expense.\r\n\r\nEvans was independent enough not to succumb to the author’s politics, so he crafted his own photography essay, promising “a real Cuban narrative … naïve, true, pure, sound and a work of art as well as a document.”\r\n\r\n“Havana 1933” is one of two books presenting his promised artistry, the other “Cuba” with an essay by Andre Codrescu. The Havana photos in this book show the famous Evans’ detachment at an early time of his development. His up close portraits of the sullied, dirt covered dock workers are intensely personal showing the relaxed confidence of each of his subjects. The languor of the heat of Havana jumps from the shots of the sleepy denizens of Havana. The alert, stately Afro-Cuban, white suited and hat at a news stand, his eyes are riveting, captures the diversity and confidence of pre revolution Cuba.\r\n\r\nThis is the artistry of one of America’s foremost photographer; his book is worth revisiting again and again.", "asin": "0394574931", "rank": "1256750", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51qpVi1ZL0L.jpg", "country": "Cuba", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}