{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Set among the Indian community of Trinidad, this is the story of 'Baby' Khoja, married off by the matriarch of her well-to-do family to the unpleasant Ram Lutchman, a bus driver.Neither is pleased at the match: 'The girl he was to marry did not inspire him...Her nose was the best part of her...When Ram thought of her, he tried to think only of her nose.' Baby must cope with violence and Ram's mistress, as well as her two unpromising children. But with the assistance of Mr Khoja, the self-important paterfamilias, Ram is levered into a better job and the Lutchmans' life seems to be on the ascendant...For the first half of the novel I wondered where it was going. Told equally from Ram's and Baby's perspectives, it seemed like a slightly shapeless family chronicle, albeit wonderfully written with brilliantly drawn characters from the extended family who feature largely in their lives.But halfway through, events suddenly shift, and I became increasingly immersed, wanting to see how the Lutchmans' lives turn out."}, {"review_sentiment": 5.0, "review_text": "Brilliant writing.  A must read for anyone interested in the caribbean literature.  The world lost a true literary master with Shiva's death in 1985."}]}, "authors": ["Shiva Naipaul"], "isbn": "039442493X", "longitude": 0.0, "periods": ["1900s"], "title": "Fireflies", "word_cloud": "community story marry matriarch family unpleasant bus please match girl marry inspire nose best part think try think nose violence mistress well unpromising child assistance paterfamilias lever better job life seem ascendant first half wonder go equally perspectives seem slightly shapeless family chronicle wonderfully write brilliantly draw character extend family feature largely halfway event suddenly shift become increasingly immersed want see live turn write anyone interested caribbean literature world lose true literary master death", "genres": ["Fiction & Literature", "Humour"], "summary": "The Khojas are an important Indian family in Trinidad. At their head is Mr Khoja, piously enshrined by his flock of quarrelsome sisters, and at the bottom of the hierarchy is the girl who becomes Mrs Lutchman, who scrapes a living by running a roadside vegetable stall, the heroine of this novel.", "asin": "039442493X", "rank": "4367148", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/51Pm85jrs5L.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}