{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1132, "rating": 4.7, "reviews": [{"review_sentiment": 1.0, "review_text": "What a miserable piece of propaganda.  I found it fitting, however, that the Germans were the cool cats and the Jews were.... well... rats obviously."}, {"review_sentiment": 5.0, "review_text": "This is very interesting to read. I decided to read this early for a requirement for my class. I fell in love with it! It's adorable and takes you to the time of the holocaust. I now want more to read. It's one of the best history books I own now. So much fun to read and I enjoyed it. Almost read this all in one day it was so addicitive."}, {"review_sentiment": 3.0, "review_text": "This is required reading in some classes at the university where I work. So, when I spotted it at a thrift store, I decided to check it out.This is a creative effort at retelling the history of a particular holocaust survivor, using black-and-white graphic novel format. Art Spiegelman depicts the Jews in his story as mice, hence the name of the book, Maus. The Poles he illustrates as pigs (not very complementary, if you ask me), while the Nazis are cats.The story frame is Art Spiegelman asking his dad, Vladek, about World War II. Each chapter is a combination of the present and the past, as Artie pumps his dad for information, and then Vladek shares his memories from the thirties and forties. The comic book style of the illustrations both simplifies and sanitizes some of the violence of the stories. However, it's a bit disturbing to see how Art, his dad and his stepmother get along so poorly. The elder Spiegelman is the stereotypical miserly Jew who blames everyone else for his unhappiness. Artie is not very respectful, and his stepmother can't seem to do anything right.It's interesting, from a historical standpoint to see how devious the Nazis were. They incrementally withdrew the rights of the Jews, keeping them unbalanced, but not resisting. Gradually, the Nazis beat the Jews into submission and then tightened the noose on them, so that they were always a little hopeful things would not turn out as bad as they thought--until it was too late to escape. They were the proverbial frog slowly being boiled to death in the pot of water. It's depressing to think about--particularly when you consider the same thing is being done to American Christians nowadays.This book ends in a very distressing spot--with Vladek and his first wife Anja captured trying to escape from Poland and then sent off to the death camps. Guess that's to get you to buy the second book or purchase the version that has both in a single volume.If you have a bunch of young, barely literate teenage kids that you want to teach about the holocaust, then a comic book might be one way to get them interested. However, there are a lot better books available specifically for young people that have a less depressing tone and less baggage brought into the story by folks who clearly never triumphed over their experiences emotionally."}, {"review_sentiment": 5.0, "review_text": "Riveting story and great art.  Awesome buy, highly recommend!"}, {"review_sentiment": 5.0, "review_text": "Spiegelman takes the story of Jews in Nazi Germany and tells it using graphics of mice. Instead of dehumanizing the whole experience, it miraculously heightens them. The reader becomes absorbed in the tale and the storytelling. the artwork is both simple and complex at the same time, and feels to be a perfect fit.Worthy of the Pulitzer Prize it won, and the many other accolades it has received. If there were ever a book that deserved more than five stars, Maus is it.Those who find this a complelling read might also want to see books by Will Eisner, another artist who tells stories through \"sequential art.\""}, {"review_sentiment": 5.0, "review_text": "Powerful graphic novel."}, {"review_sentiment": 5.0, "review_text": "I've read many Holocaust books. This is certainly one of the best..."}, {"review_sentiment": 5.0, "review_text": "Such a creative way of storytelling. This is a must-read for anyone interested in the Holocaust."}, {"review_sentiment": 5.0, "review_text": "Our son loves graphic novels and is presently studying the holocaust in school. This book is the perfect complement to other literature he is reading, such as “Night“ by Eli Wiesel.  Somehow this book achieves the impossible, that is, making the Holocaust accessible to the reader while sparing none of the details.  I simply couldn’t put it down until I finished it. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "A harrowing tale of survival, Art Spiegelman's Maus is as haunting and clever at critics have claimed for decades. The art is charming and realistic for the Jewish people are mice and the Germans are cats. It's a clever metaphor that will draw you in deep. I found Spiegelman's own conversations with his father to be the most engaging parts as he must struggle to accept his father for the man he is in all his charms and faults. Maus is sad, terrifying, historic, and charming all the way home."}]}, "authors": ["Art Spiegelman"], "isbn": "0394747232", "longitude": 0.0, "periods": ["1900s"], "title": "My Father Bleeds History", "word_cloud": "miserable piece propaganda find fit however cool cat well rat obviously interesting decide early requirement class fell adorable take time holocaust want best so much fun enjoy day required reading class university work so spot thrift store decide creative effort retell particular holocaust survivor use graphic format depict story mouse hence name illustrate pig complementary ask story frame ask dad chapter combination present past pump dad information share memories thirty forties comic style illustration simplifies sanitize violence story however bite disturb see stepmother get poorly elder stereotypical miserly blame everyone else unhappiness respectful stepmother anything interesting historical standpoint see devious incrementally withdraw right keep unbalanced resist beat submission tighten noose always little hopeful thing bad think late escape proverbial frog slowly boil death pot water depress think particularly consider thing do american end distress spot first wife capture try escape send death camp get second purchase version single bunch young barely literate teenage kid want teach holocaust comic way get interested however lot better available specifically young people le depress tone le baggage bring story folk clearly never triumph experience emotionally rivet story great art buy highly recommend take story tell use graphic mouse instead dehumanize whole experience miraculously heighten becomes absorb tale storytelling artwork simple complex time feel perfect many accolade receive ever deserve star find compel also see artist tell story sequential art powerful graphic many holocaust certainly best such creative way storytelling anyone interested son love graphic novel presently study holocaust school perfect complement literature read achieve impossible make accessible spar none detail simply put finish recommend harrowing tale survival haunt clever critic claim art charm realistic jewish people mouse cat clever metaphor draw deep find conversation engage part man charm fault sad terrify historic charm way home", "genres": ["Comics & Graphic Novels", "Historical Fiction", "WWII"], "summary": "The first installment of the Pulitzer Prize-winning graphic novel acclaimed as “the most affecting and successful narrative ever done about the Holocaust” (Wall Street Journal) and “the first masterpiece in comic book history” (The New Yorker).\r\n\r\nA brutally moving work of art—widely hailed as the greatest graphic novel ever written—Maus recounts the chilling experiences of the author’s father during the Holocaust, with Jews drawn as wide-eyed mice and Nazis as menacing cats.\r\n\r\nMaus is a haunting tale within a tale, weaving the author’s account of his tortured relationship with his aging father into an astonishing retelling of one of history's most unspeakable tragedies. It is an unforgettable story of survival and a disarming look at the legacy of trauma.", "asin": "0394747232", "rank": "6425", "city": "Auschwitz", "image": "https://images-na.ssl-images-amazon.com/images/I/61kA6pBDYvL.jpg", "country": "Kraków", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}