{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 32, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Amazing how politics haven't changed."}, {"review_sentiment": 5.0, "review_text": "Excellent on all fronts, very pleased"}, {"review_sentiment": 5.0, "review_text": "David Brinkley was a man who often seemed as much an observer of the human comedy as a hard news journalist.  That was on full display in his ABC program This Week with David Brinkley in the 1980s and 1990s.  Not surprisingly, Washington Goes to War is loaded with sarcasm and irony, humorous anecdotes involving some of Brinkley’s favorite targets in the world of WWII Washington, such as Washington socialites, Dixiecrat politicians, conservatives, isolationists, lackadaisical civil servants, to name a few.For example, Brinkley found the thinking of Washington socialites baffling:  “Why such frenzy to fill the dinner table with people who might be famous but might also be insufferably dull?  Archduke Otto of Austria, the pretender to the nonexistent Austro-Hungarian throne of the Hapsburgs, continued to be sought after even when he was found to be a bore who ate like a timber wolf and then sat lumpishly and groggily in the living room refusing to leave until pushed.  Why did the hostesses pursue this?”Brinkley makes it clear from the start that he is aware of his limitations as a journalist writing history, that is, that he is not a scholarly historian.  This allows him to dispense with an index.  Likewise, he identifies his sources in a bunch at the end of the book, while not employing footnotes.His book is a fast, smooth, engaging read.  He creates a sharp sense of time and place through the inclusion of specific details about the clothing, diet, advertisements, housing, amusements, mores, and the like, that typified 1940-1945 Washington.  He does not ignore such tough issues of the day as racism, sexism, and cronyism.  He spends a lot of time on his well-rounded portrait of FDR, of whom Brinkley seems to have been enamored."}, {"review_sentiment": 5.0, "review_text": "What we all only thought we new at that time.  Now pretty much describes the \"why\"."}, {"review_sentiment": 5.0, "review_text": "A great read. I read it twice."}, {"review_sentiment": 5.0, "review_text": "This is one of the most fascinating stories, unknown to most readers,of how the \"Politically-oriented\", bureaucratic city of Washington woke up on the afternoon/early evening tea-time to find it, not the City - the United States, had been attacked. David Brinkley was an on-the-spot reporter at the time and his book explains in splendid detail how Washington turned from behaving like a headless chicken to become the most important town in the free world. Brilliant book. I am nearly 80 and I have this book beside my bed because Kindle has, stupidly, not made it available on their otherwise wonderful service."}, {"review_sentiment": 5.0, "review_text": "A fun story."}, {"review_sentiment": 5.0, "review_text": "GREAT READ!! Especially to anyone who lived in DC during this period."}, {"review_sentiment": 5.0, "review_text": "Good book about Government Girls during WWII - of which I was one, so I thoroughly enjoyed it."}, {"review_sentiment": 5.0, "review_text": "Interesting - very detailed account of that place and time."}]}, "authors": ["David Brinkley"], "isbn": "0394510259", "longitude": -77.0366456, "periods": ["1900s"], "title": "Washington Goes to War", "word_cloud": "amaze politics change excellent front please man often seem much human comedy hard news journalist full display program not surprisingly load sarcasm irony humorous anecdote involve favorite target world socialites politician conservatives isolationist lackadaisical civil servant name example find think socialites baffle frenzy fill dinner table people also insufferably dull pretender nonexistent throne continue seek even find bore ate timber wolf sit lumpish groggily living room refuse leave push hostess pursue make clear start aware limitation journalist write history scholarly historian allow dispense index identify source bunch end employ fast smooth engage create sharp sense time place inclusion specific detail clothe diet advertisement housing amusement more typified ignore tough issue day racism sexism cronyism spend lot time portrait seem enamor think new time now pretty much describes great twice fascinating story unknown reader bureaucratic city wake even find attack reporter time explain splendid detail turn behave headless chicken become important town free world nearly beside bed stupidly make available otherwise wonderful service fun story great anyone live period good thoroughly enjoy interest detailed account place time", "genres": ["History", "WWII", "Politics"], "summary": "David Brinkley, one of America's most respected and celebrated news commentators, turns his journalistic skills to a personal account of the tumultuous days of World War II in the sleepy little Southern town that was Washington, D.C.\r\n\r\nCarrying us from the first days of the war through Roosevelt's death and the celebration of VJ Day, Brinkley surrounds us with fascinating people. Here are the charismatic President Roosevelt and the woman spy, code name \"Cynthia.\" Here, too, are the diplomatic set, new Pentagon officials, and old-line society members -- aka \"Cave Dwellers\" We meet the brashest and the brightest who actually ran the government, and the countless men and women who came to support the war effort in any way they could -- all seeking to share in the adventure of their generation.\r\n\r\n\"Astonishing. . . Told with endearing detail . . . He knows his Washington well.\" The New York Times\r\n\r\n\"HILARIOUS AND INSTRUCTIVE . . . Brinkley has written an impressionist history, comparable to a pointillist painting composed of small points of color that, seen whole, comprise a remarkably truthful record of reality.\" The Washington Post", "asin": "0394510259", "rank": "100145", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51ELCAF%2Bc6L.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}