{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 4, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "An older Czech man recommended I read The Cowards while traveling in the Czech Republic. The book was the perfect traveling companion.Skvorecky's novel's subtle comedy and remembrances of youth during a week-long liberation from the Germans kept my interest. The story revolves on Daniel's late-teen wants, all driven by his desire for Irene, his (perhaps) one love. His quest for resistance action, assisting English POWs, and daydreams have as their goal winning Irene, even if appearances are otherwise. Skvorecky's insight into male teen-dome is brilliant.Yet the novel doesn't miss hitting on themes of courage, survival, revenge, pity, and the question of self-preservation as cowardice or wisdom.Opened and closed by Daniel's love of jazz's honesty, the book was, for me, a perfect read. Substance, humor, memories of my youth, and jazz."}, {"review_sentiment": 4.0, "review_text": "This novel was written in the late 1940's by a respected Czech author when aged 24. The pivotal event in the novel, set in a small town north of Prague, covers the week in the township as the Germans are leaving and the arrival of the Russians. The main character is a young man, Danny Smiricky, who is experiencing all the emotions of love, friendship and adventure during this momentous week in the history of the Czech Republic. The translation is a very readable account centering on the young men as they flex their muscles in excited anticipation of the forthcoming liberation. The novel is very good at describing various flawed characters of the township as they try to reorganise their township without the imposed control of the German occupation."}, {"review_sentiment": 4.0, "review_text": "This is one of the several novels by Joseph Skvorecky which presents the daily life of his alter ego Daniel Smiricky. \"The Cowards\" is not about coward people, it is about local people in the small town of Kostelec (north Bohemian Nachod)whose aim is to survive living their ordinary lives in the last days of the Nazi Protectorate, seven days of May, from the fourth to the eleventh May 1945. The Germans are quickly withdrawing from the Eastern front as fast as the Red Army advances towards Central Europe, while the people of Kostelec prepare a \"revolution\" against the Nazi opressors to welcome finally the Soviet troops who will \"liberate\" them.The main intention of the author, from my point of view, is to remark that both the revolution and the liberation are a complete farce, that History, as written in books, is a great deal of falsified propaganda. Danel Smiricky and his friends of the jazz band are by no means interested in heroic feats nor care about patriotism but about girls and music.But Skvorecky gives a moving view of his characters and events, an intimate vision, tender, dramatic, satyrical, funny, critical, full of humour and nostalgia, as only Czech writers can, because I have always found that Czech writers have the incredible ability to combine the trivial with the deep, the ordinary with the remarkable, the comical with the dramatic, the harsh with the tender.Of course, this novel, being one of the earliest by Skvorecky, lacks the maturity of \"The Engineer of Human Souls\"; nevertheless, it is worth while to read it and realize that nothing is what it seems and that History is subject to countless manipulations."}, {"review_sentiment": 3.0, "review_text": "This semi-autobiographical novel is the first in a series by  Czech-cum-Canadian author Josef Skvorecky that charts the life of Danny  Smiricky, a Czech sometimes-saxophonist and full-time womanizer.  The story  opens during WWII in German-occupied Kostelec, a town not far from Prague.  The way Smiricky tells it, the war and the occupation are minor hardships  and major bores; what really matters is the pursuit of his two true loves:  jazz and women.  Like most egotistical men, Danny is most charming in his  youth, and this novel displays him at his finest.  His exchanges with  friends and musings on the unattainable Irena are entertaining, and his  rhapsodies on a solo with his jazz band and the fit of the ever-tantalizing  Mitza's uniform go even further to make up for long stretches of  disaffected self-indulgence.  As a portrait of everyday life during  wartime, the novel is excellent.  Skvorecky captures the sort of daily  details that bring a historical event to life in an intimate and personal  way.  One just wishes that the main character didn't block the view quite  so often."}]}, "authors": ["Josef Skvorecky"], "isbn": "039428058X", "longitude": 14.4212535, "periods": ["1900s"], "title": "The Cowards", "word_cloud": "older man recommend travel perfect travel subtle comedy remembrance liberation keep interest story revolve want driven desire perhaps quest resistance action assist english daydream goal win even appearances otherwise insight male miss hit theme courage survival revenge pity question cowardice close jazz honesty perfect humor memory youth jazz write late respect author age pivotal event set small town north cover week township leave arrival main character young man experience emotion love friendship adventure momentous week history translation readable account center young men flex muscle excite anticipation forthcoming liberation good describing various flaw character township try township impose control german occupation several novel present daily life alter ego coward people local people small town north bohemian aim survive living ordinary life last day day fourth eleventh quickly withdraw front fast red advance towards people prepare revolution oppressors welcome finally soviet troop liberate main intention author point view remark revolution liberation complete farce write great deal falsify propaganda friends jazz band mean interested heroic feat care patriotism girl give move view character event intimate vision tender dramatic satirical funny critical full humor nostalgia writer always find writer incredible ability combine trivial deep ordinary remarkable comical dramatic harsh course earliest skvorecky lack maturity nevertheless worth nothing seem subject countless manipulation first series author chart life womanizer story open town far way tell war occupation minor hardship major bore really matter pursuit true love jazz woman egotistical men charm youth display exchange friends musing unattainable entertain rhapsody solo jazz band fit uniform go even make long stretch disaffect portrait everyday life wartime excellent capture sort daily detail bring historical event life intimate personal way wish main character block view quite often", "genres": ["Fiction & Literature", "WWII", "Humour"], "summary": "Girls, jazz, politics, the golden dreams and black comedy of youth--these are the compelling ingredients of The Cowards.\r\n\r\nMay 1945, a small town in Czechoslovakia.  The Germans are withdrawing.  The Red Army is advancing.  And Danny Smiricky is being forced to grow up fast.  Observing with contempt the antics of the town's citizens playing it safe, he adopts the role first of reluctant conscript, then of dashing partisan.\r\n\r\nThe Cowards is the story of an uncomplicated, talented youth caught up in momentous historic events who refuses to be bored to death by politics--or to lie down and die without a fight.\r\n\r\n“An important piece of history is marvelously recorded here, and anyone who wants to know how it felt to be young, idealistic, and innocent at the end of the war. . . should read The Cowards.” The Times Literary Supplement", "asin": "039428058X", "rank": "8903511", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51D6RZZYAZL.jpg", "country": "Czechia", "story_arc": ["Tragedy", "Things only get worse"]}