{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 261, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Great fact-filled tome. Hard to read with the very small type font."}, {"review_sentiment": 3.0, "review_text": "A comprehensive history, but it would be better if it were half the length. Not every letter or poem or song of early settlers needs to be included."}, {"review_sentiment": 5.0, "review_text": "Beautifully written and a highly approachable book!"}, {"review_sentiment": 5.0, "review_text": "Excellent read on the history of there founding of Australia! Very engaging look into the transportation system. Three more words"}, {"review_sentiment": 5.0, "review_text": "Read several years ago and purchased this copy for friend. Well researched and well written."}, {"review_sentiment": 4.0, "review_text": "Very detailed account of Australia's founding Particularly all the criminal transfers to the islands. Detailed but interesting."}, {"review_sentiment": 5.0, "review_text": "Wonderful book somewhat in the style of James Michener."}, {"review_sentiment": 5.0, "review_text": "Excellent read.  Fascinating subject, well written, incisive.  Perhaps the best non-fiction book I've ever read."}, {"review_sentiment": 5.0, "review_text": "great book"}, {"review_sentiment": 3.0, "review_text": "Hard getting started on this, rather dry."}]}, "authors": ["Robert Hughes"], "isbn": "0394753666", "longitude": 151.2164539, "periods": ["1700s", "1800s", "1900s"], "title": "The Fatal Shore: The Epic of Australia's Founding", "word_cloud": "tome small type font comprehensive history half length not letter poem song early settler need include beautifully write highly approachable excellent history engage look transportation system word read several year ago purchase copy friend researched well write very detailed account criminal transfer island detail interesting wonderful somewhat style excellent fascinate subject well write incisive perhaps best ever great get start rather dry", "genres": ["History", "Social & Cultural Studies", "Politics"], "summary": "The Fatal Shore. The epic of Australia's founding by Robert Hughes is a history of the birth of Australia which came out of the suffering and brutality of England's infamous convict transportation system.\r\n\r\nIt also focuses on the historical, political and sociological reasons that led to British settlement. It was originally published in 1986.\r\n\r\n\"A brilliant and enduring achievement...history of the highest order combining thorough research with vivid narrative and thoughtful assessment.\" Arthur M. Schlesinger", "asin": "0394753666", "rank": "43412", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51LYmdWZyRL.jpg", "country": "Australia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}