{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 41, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "I would just like to say that this book is not banned in Saudi Arabia, I am Saudi and I have seen it many times displayed either in local bookshops or in book fairs, by the way the original Arabic version is 5 volumes and this English translated version is only the first volume (the other volumes are worst)"}, {"review_sentiment": 5.0, "review_text": "could be ok. Bought for my class."}, {"review_sentiment": 5.0, "review_text": "Excellent service on getting it to me. A bit of a rare edition. Much appreciated! Gives an excellent perspective on many of the things we have migrated towards in the last 100 years since we - and the region and the religion itself - has brought us to the meltdown we are now seeing. Illuminating! And a most worthy read."}, {"review_sentiment": 5.0, "review_text": "So interesting. It's a pretty thick book but it's such a great harmony of history and plot/story line.You will learn SO much about the history of Saudi Arabia and the oil industry. The story is pretty great, too. Definite page-turner."}, {"review_sentiment": 5.0, "review_text": "This is an excellent read for anyone who has an interest in the Middle East, and the oil economy."}, {"review_sentiment": 5.0, "review_text": "Really enjoyed this book. Incredible storytelling."}, {"review_sentiment": 5.0, "review_text": "An ammmmmaaaaaaaaaazing (amazing) novel. I cant wait to read the next two. great discovery."}, {"review_sentiment": 4.0, "review_text": "This book was surprisingly enjoyable. There are many characters just thrown at you and it takes time to adjust to the way its narrated but overall it was a nice novel/"}, {"review_sentiment": 4.0, "review_text": "My only complaint is that it is rather dense and sluggish at times. But overall, a very fascinating take on what happened in Saudi Arabia during oil discovery times."}, {"review_sentiment": 2.0, "review_text": "Very hard to read"}]}, "authors": ["Abdelrahman Munif"], "isbn": "039475526X", "longitude": 0.0, "periods": ["1900s"], "title": "Cities of Salt", "word_cloud": "ban saudi see many time display local bookshop fair way original version volume translate version first volume volume worst class excellent service get bit rare edition much appreciate excellent perspective many thing migrate last year region religion bring see worthy so interesting pretty thick great harmony history learn so much history oil industry story pretty great excellent anyone interest oil economy really enjoy incredible storytelling ammmmmaaaaaaaaaazing amazing cant wait next great discovery surprisingly enjoyable many character take time adjust way narrate overall nice complaint rather dense sluggish time overall fascinating take happen oil discovery time very hard", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Banned in several Middle Eastern countries, this novel records the encounter between Americans and Arabs in an unnamed Gulf emirate in the 1930s. As oil exploration begins, the destruction of an oasis community amounts to \"a breaking off, like death, that nothing and no one could ever heal.\" \r\n\r\nThe promise inherent in the creation of a city divided into Arab and American sectors provides the novel's most striking revelation: here not merely two cultures, but two ages, meet and stand apart. \r\n\r\nAlternatively amused and bewildered by the Americans and their technological novelties, the Arabs sense in their accommodation to modernity the betrayal of their own traditions.", "asin": "039475526X", "rank": "75962", "city": "Saudi Arabia", "image": "https://images-na.ssl-images-amazon.com/images/I/51IRrhM4rQL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}