{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 34, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "In my opinion this is the best of Ellison's work even though it is unfinished. I bought the book so I could read it again as when I moved from a much larger residence ,I gave up many books and now regret it."}, {"review_sentiment": 5.0, "review_text": "Im a fan of Ralph Ellison so this is also a favorite"}, {"review_sentiment": 5.0, "review_text": "Not \"The Invisible Man,\" but a great American Novel!"}, {"review_sentiment": 5.0, "review_text": "Yes, THE Ralph Ellison has a novel on freedom, published posthumously in 1999. A fascinating tale of the attempted assassination of Senator Bliss Sunraider who passes for white and reeks havoc on the Black constituents who reared him as a young man. On his death bed, he calls for the man who loved him most, his adopted father and biological uncle the Rev. AZ Hickman, an old Black preacher. Hidden within the story line is the celebration that freedom comes only when Whites recognize that their freedom is tied to the freedom of Blacks. Wonderfully written as only Ellison can. BuytheBook."}, {"review_sentiment": 5.0, "review_text": "Yes, THE Ralph Ellison has a novel on freedom, published posthumously in 1999. A fascinating tale of the attempted assassination of Senator Bliss Sunraider who passes for white and reeks havoc on the Black constituents who reared him as a young man. On his death bed, he calls for the man who loved him most, his adopted father and biological uncle the Rev. AZ Hickman, an old Black preacher. Hidden within the story line is the celebration that freedom comes only when Whites recognize that their freedom is tied to the freedom of Blacks. Wonderfully written as only Ellison can. BuytheBook."}, {"review_sentiment": 4.0, "review_text": "Bought this book for an Ellison class.  Don't remember much about it but I definitely remember it not be better than \"Invisible Man\"."}, {"review_sentiment": 5.0, "review_text": "This book is an amazing way to learn more about black culture and history through story.  It is important to hear the viewpoint from a different angle and realize what has really happened; yes, years and years ago but at times I wonder if we have made any progress or are we falling back???  I still hope that one day Dr. King's dream comes to fruition."}, {"review_sentiment": 5.0, "review_text": "An excellent book. I had read it earlier. The books recently purchased were gifts for friends who had not read novel"}, {"review_sentiment": 5.0, "review_text": "A novel about the truth as seen through the eyes of a fiction--indeed, the truth, to Ellison, was always suspect to the lie and again, as in the phrase the emancipation myth, where freedom wasn't given by the law but the law was only subject to the people who inforced it as truth, and thus Juneteenth, as the title of the last great work by an even greater artist, seems to be apt, for it suggests this dichotomy that Ellison was to work in all of his career.Always a symbolist at heart, Ellison demonstates in Juneteenth the potential of words to turn even the most innocent of scenes on its head, fleshing out the meaning of slavery in something so unrelated as a circus as when Daddy Hickman takes Bliss to the circus, and Bliss innocently asks how come the lions don't catch the trainer, and Daddy Hickman explains that the lions are mastered. And with that small amount of information, the reader is instantly transported into the real scene Ellison wants his reader to notice. Of course, the genius of all this is Ellison's use of the word \"mastered\" instead of \"trained,\" as that one word becomes the window through which we begin to see the ritual of the circus as having the potential to speak to us about the deeper convention of race.And that is Ellison par excellent, for he is always using unrelated events to talk about other things.There are so many things that can and should be said about Juneteenth that I could never exhaust the subject. Not that I am trying to, but one thing is for sure, those who have an intimate knowledge of Shadow and Act, and Going To The Territory and of course Invisible Man will see the influence of those books on Juneteenth. In scene after scene, Ellison calls up his references like a bandleader calls on the Brass section to riff on the beat, to live in the music, and Ellison, in Juneteeth, is more than anything else, living inside himself, inside the basement of Invisible Man, inside all of the history of literature and once in a while he peeks out at us, peeks as from a glass darkly to see if it okay to come out and play."}, {"review_sentiment": 5.0, "review_text": "A little known book. This could be the American novel that transends time and place. The characters and descriptions are of the depth that is rarely described in modern literature."}]}, "authors": ["Ralph Ellison"], "isbn": "0394464575", "longitude": -77.0366456, "periods": ["1900s"], "title": "Juneteenth: A Novel", "word_cloud": "opinion best work even unfinished buy move much larger residence give many regret fan also favorite not invisible great american freedom publish posthumously fascinate tale attempt assassination pass white reek havoc constituent rear young man death bed call man love adopt father biological uncle old preacher story line celebration freedom come recognize freedom tie freedom write freedom publish posthumously fascinate tale attempt assassination pass white reek havoc constituent rear young man death bed call man love adopt father biological uncle old preacher story line celebration freedom come recognize freedom tie freedom write class much definitely remember better invisible man amazing way learn black culture history story important hear viewpoint different angle really happen year year ago time wonder make progress fall still hope day dream come fruition excellent earlier recently purchase gift friend truth see eye fiction indeed truth always suspect lie phrase emancipation myth freedom give law law subject people unforced truth thus title last great work even greater artist seem apt suggests dichotomy work symbolism heart demonstrate potential word turn even innocent scene head flesh mean slavery something unrelated circus take circus innocently ask come lion catch trainer explain lion master small amount information instantly transport real scene want notice course genius use word master instead trained word become window begin see ritual circus potential speak deeper convention par excellent always use unrelated event talk many thing say never subject not try thing sure intimate knowledge go course see influence scene scene call reference bandleader call section riff beat live music anything else live inside basement history literature peek peek glass darkly see okay come play little known transcends time place character description depth rarely described modern literature", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "NATIONAL BESTSELLER\r\n\r\n\"[A]n extraordinary book, a work of staggering virtuosity. With its publication, a giant world of literature has just grown twice as tall.\" Newsday\r\n\r\nFrom Ralph Ellison--author of the classic novel of African-American experience, Invisible Man--the long-awaited second novel. Here is the master of American vernacular--the rhythms of jazz and gospel and ordinary speech--at the height of his powers, telling a powerful, evocative tale of a prodigal of the twentieth century. \r\n\r\n\"Tell me what happened while there's still time,\" demands the dying Senator Adam Sunraider to the itinerate Negro preacher whom he calls Daddy Hickman. As a young man, Sunraider was Bliss, an orphan taken in by Hickman and raised to be a preacher like himself. \r\n\r\nIt’s set primarily in Washington DC in the 1950s. Bliss's history encompasses the joys of young southern boyhood; bucolic days as a filmmaker, lovemaking in a field in the Oklahoma sun. And behind it all lies a mystery: how did this chosen child become the man who would deny everything to achieve his goals? \r\n\r\nBrilliantly crafted, moving, wise, Juneteenth is the work of an American master.", "asin": "0394464575", "rank": "1902940", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/71Q0G6X4TTL.gif", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}