{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 13, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Wonderful book.  I wish the author had not smoked and drunk so much so that he would have had a longer life."}, {"review_sentiment": 5.0, "review_text": "Classic, complex Richler. Need to know Montreal a bit to appreciate fully."}, {"review_sentiment": 5.0, "review_text": "I narrated the book.First time ever tackling something like this. Admittedly some of my characters are off AND - I pronounced all the French words properly but had an American producer who thought I was saying them wrong and replaced them with the 'American pronounciations'. But I take full blame. I hope you can enjoy the audible book. It still turned out well and I hope I did justice to this wonderful book!"}, {"review_sentiment": 3.0, "review_text": "Not a great book.  It has a great start but sputters out."}, {"review_sentiment": 5.0, "review_text": "Joshua Then And Now is a compelling novel penned by Canada's most intriguing writer. Joshua now is in hospital with broken limbs and a battered visage. Journalists are snooping around his house looking for tips. Joshua is a local writer, a celebrity of sorts, and there is rumour he has done something illegal, has had a split with his wife, and has been involved in a homosexual affair. Scandal is in the air. His father, Reuben, a former prize fighter (and, as we later find out, an amateur Bible scholar - despite being Jewish) keeps the reporters at bay; he doesn't seem concerned.The novel flashes back to Joshua then, from his childhood in Montreal to his days spent on Ibiza to the months and weeks prior to his apparent accident - and what a ride it is. Richler fans should delight in the bits about Ibiza, having fun wondering just how much of it is autobiographical. We know Richler lived on the Spanish isle, and we know he had trouble with a German named Mueller (Dr. Dr. Mueller in the novel; in Austria each doctorate deserves a title) and that he had to leave suddenly, like Joshua Shapiro did. We also see Richler's imagination flowing and spinning from his summer home at Lake Memphremagog, featured in Barney's Version. And we see variations on Richler's classic characters: the blue-blooded Hornbys, \"rotten to the core\" and cognizant of it, Jack Trimble: a man who scraped and clawed his way to the top, ignored by Westmount's and McGill's elite until they needed him to make money for them; Reuben: Joshua's ostensibly dopey but street-savvy (former boxer, Bible quoting, Labatt's drinking) father, Joshua's sex-starved Jewish mother, uncle Oscar: forced to drive a cab at age 69, Joshua's brother-in-law, a 40-year old rich brat (one of the Hornbys) who we think has been horribly framed.This book really drew me in, but then I got lost a little in the middle. The flashback sequences are not dated, but like with Richler's subsequent Solomon Gursky Was Here it's not so much a matter of figuring out when the time-shift is but why. However, unlike the weightier and more literary Solomon Gursky Was Here, Joshua Then And Now didn't make me wonder if Richler knew where he was going and if his descriptive wanderings weren't inspired by too many glasses of scotch. In Joshua, the storyline straightens out, right on cue, and you see the method in the madness. At page 200, I was thinking, `This might be one of his weaker ones,' but by p. 300, I was marvelling.What a shame Mordecai Richler is no longer with us. There is no one in Canada writing books like his nowadays, and there is one less erudite social critic to lampoon the politically correct CBC, insincere politicians, the politics of special pleading, or other Canadian silliness. Richler possessed a humour, wit, intellect, and irony that just isn't there now - and he was a better writer than just about anyone who wins the Giller Prize these days. They just don't make `em like that anymore.4.5 stars, rounded up to 5.Troy Parfitt is the author of Why China Will Never Rule the World"}, {"review_sentiment": 2.0, "review_text": "this book is a most difficult read. it is almost like a history lesson. the whole idea of going back and forth from persent to past, made it a most trying excersise to read. if you are a casual reader from age 17 and lower; do not attempt to read this. this was the hardest, most boring and most challenging book i have yet to come across. read with caution and lots of time ahead of you."}, {"review_sentiment": 5.0, "review_text": "This book is classic Mordecai Richler:His main character, Joshua, is a Montreal Jew who is opinionated, cynical and comes from a seedy background: and yet, is able to survive, become successful and marries into a well-off family that have their own set of closet skeletons.  The story has many interesting twists and emotions vary from the serious, sad or sometimes, to the very funny.  Like many of Richler's characters, there is a gutsy determination, a sense of purposeful indignation about Joshua that you can admire and identify with.The novel is well written and easy to read and uses sporadic explicit language.This is sure to please anyone who has enjoyed other Richler books such as \"Barney's Version\" or \"St. Urbain's Horseman\".  A recommended read!"}, {"review_sentiment": 4.0, "review_text": "Mordecai Richler definitely came out of hiding with the release of Joshua Then and Now, a literary marvel that made me roll in my chair with uncontrollable laughter.  This novel has many features worthy of praise.  First, Joshua's character can go both ways in terms of admiration: some readers admire this crude character while othere despise the man who is a mere image of Richler.  Second, continual flashbacks to different periods and settings make Joshua Then and Now a page-turner.  The novel also had its lows.  It was evident that Richler took a shortcut in producing this novel as Joshua Shapiro's character was a reflection of his own.  Also, the novel could have done without scenes dealing with the William Lyon Mackenzie King Memorial Society as this did little to advance the novel.  All in all, Joshua Then and Now was a success, preaching audiences about the importance of moral and sound family values.  Mr. Richler, your comic energy and satires will be missed forever."}, {"review_sentiment": 3.0, "review_text": "The novel is definitely funny. I had the strange luck to read it during my internship at the Royal Victoria Hospital in Montreal, which is where scenes of Joshua's infirm wife took place. Richler easily gets me to belly-laugh. BUT, part of his humor is based on homophobia. Joshua is mistaken for gay and his mother enthusiastically and misguidely marches with PFLAG. I think such humour is of the \"lowest common denominator\" variety. In this as in other books of his, Richler relies on gay people, or misidentified straight people for a cheap laugh, which I don't appreciate.The rest of the book is great and I recommend it."}, {"review_sentiment": 5.0, "review_text": "This was the first Richler novel I've read and it was wonderful!  There were characters and scenarios so well drawn that I could not help myself from laughing out loud.  It is one of the few novels I wished never ended."}]}, "authors": ["Mordecai Richler"], "isbn": "0394493516", "longitude": -73.6103642, "periods": ["1900s"], "title": "Joshua Then and Now", "word_cloud": "wonderful wish author smoke drunk much life classic complex know bit appreciate fully narrate time ever tackle something character pronounce french word properly american producer think say wrong replaced pronunciation take full blame hope enjoy audible still turn well hope justice wonderful not great great start sputter compel pen intriguing writer hospital break limb batter visage journalist snoop around house look tip local writer celebrity sort rumor do something illegal split wife involve homosexual affair air father former prize fighter later find amateur scholar jewish keep reporter bay seem flash back childhood day spend month week prior apparent accident ride fan delight bit fun wonder much know live spanish isle know trouble german name doctorate deserves title leave suddenly also see imagination flow spin summer home feature variation classic character rotten core cognizant man scrap clawed way top ignore elite need money ostensibly dopey former boxer quote drink father mother uncle force drive cab age old rich brat think horribly really drew get lose little middle flashback sequence date subsequent here much matter figure however weightier literary here wonder know go descriptive wandering inspire many glass scotch story line straightens right cue see method madness page think weaker one shame longer write nowadays le erudite social critic lampoon politically correct insincere politician politics special pleading canadian silliness possess wit intellect irony better writer anyone win day make star round author difficult almost history lesson whole idea go back forth present make try excersise casual age lower attempt hardest boring challenge yet come caution lot time ahead classic main character opinionated cynical come seedy background yet able survive become successful marries family set closet skeleton story many interesting twist emotion vary serious sad sometimes funny many character gutsy determination sense purposeful indignation admire identify well write easy us sporadic explicit sure please anyone enjoy recommend definitely come hide release literary marvel make roll chair uncontrollable laughter many feature worthy praise character go way term admiration reader admire crude character other despise man mere image continual flashback different period setting make also low evident take shortcut produce character reflection also do scene deal little advance success preach audience importance moral sound family value comic energy satire miss forever definitely funny strange luck internship scene infirm wife take place easily get part humor base homophobia gay mother enthusiastically misguidedly march think humor lowest common denominator variety relies gay people misidentified straight people cheap rest great recommend first wonderful character scenario well draw laugh novels wish never end", "genres": ["Fiction & Literature", "Humour"], "summary": "Joshua Then and Now is about Joshua Shapiro today, and the Joshua he was. His father a boxer turned honest crook, his mother an erotic dancer whose greatest performance was at Joshua’s bar mitzvah, Joshua has overcome his inauspicious beginnings in the Jewish ghetto of Montreal to become a celebrated television writer and a successful journalist. \r\n\r\nBut Joshua, now middle-aged, is not a happy man. Incapacitated by a freak accident, anguished by the disappearance of his WASP wife, and caught up in a sex scandal, Joshua is besieged by the press and tormented by the ghosts of his youth. \r\n\r\nSet in Montreal, the novel chronicles the rocky journey we all make between the countries of the past and the present. Raucous, opinionated, tender, Joshua Then and Now is a memorable excursion into Mordecai Richler's comic universe.\r\n\r\n“A richly comic satire in the best uninhibited Richler tradition, full of sharp jabs and ticking bombs...” Globe and Mail", "asin": "0394493516", "rank": "2402689", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/51O6U5IqZIL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}