{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 343, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a brilliant elucidation and proof of Acton's famous aphorism that power tends to corrupt and absolute power corrupts absolutely. It is more perfect in this respect than his monumental and equally fine tomes on Lyndon Johnson who at least had principles and who having got to the top he intended to put into practice before being derailed by Vietnam. He was a truly tragic figure for which admiration and disgust vie in the mind of the readerThere is no redeeming feature in Caro's depiction of Moses who was a truly vile man through and through and who desired power solely for power's sake. His character for all his ability is comprehensively demolished by this great work. Unfortunately the infrastructure he built and which destroyed so much of value in New York even if it could be demolished would not restore what has been lost.Perhaps most culpable in this tale is not the way that mayors caved into this demonic ego but the way the vaunted press lapped up everything Moses said and almost never challenged it. Where are America's investigative journalists? Largely comatose. But here I have my one quibble. There is no mention at all of the journalist Jane Jacobs, nor of her influential book,The Death and Life of American Cities, and nor of her considerable role in toppling Moses from his pedestal. This is an odd omission, and we know that she read Caro's hatchet job with relish, commenting that even though she knew Moses was an awful man this book was a shocking revelation. She had opposed his policies but not exposed his vile personality in all its vividness. It took Caro - one man delving deep into documents and sources, -to pull all the threads together to weave a shroud for a vampire.  Moses was a monster, a racist, a bully a self-centred egotist, only interested in himself, indifferent to those he demeaned or whose lives he destroyed. It reminds me at least of another who has recently attained great power.  Men such as Moses are the American nightmare."}, {"review_sentiment": 2.0, "review_text": "I had hoped to understand WHY people want power.  This book didn't answer that question."}, {"review_sentiment": 5.0, "review_text": "Wonderful read for those grappling with career exploration, activist struggles, or just any form of existential crisis that calls one's ambition and morality into question. Note that for the hardcover, the paper sleeve gets wrinkled really easily."}, {"review_sentiment": 5.0, "review_text": "On the whole, as for the amount of information contained in this biography it truly does merit a high rating.  The author was quite fastidious is gathering and gleaning all that is included in the work.  I was somewhat inundated with all the data presented.  I know to many Robert Moses will still be held in high regard, his name still appears apparently on many landmarks that he built in his long association with the city and state of New York.  What I look for mainly in a biography is one that tells about the person, unbiased and factual, this is such a book.  It matters little whether I do or do not hold them in high regard, and that is the way I tend to view the book, information on people or subject that influenced or made a mark on society in some way.  It is a rather lengthy book but I do recommend it to anyone who enjoys biographies as it is one of the best I have read to date."}, {"review_sentiment": 2.0, "review_text": "Interesting history, but way too long and involved. Moses accomplished a lot, often by rolling over anyone who got in his way."}, {"review_sentiment": 4.0, "review_text": "don't remember"}, {"review_sentiment": 5.0, "review_text": "Absolutely a spectacular book about New York, the City at the center of it, and the man behind both for over four decades."}, {"review_sentiment": 3.0, "review_text": "Incredible story but way too long"}, {"review_sentiment": 4.0, "review_text": "A thousand pages of hard-to-put-down!"}, {"review_sentiment": 5.0, "review_text": "Brilliant biography of the man who shaped the NY with major public works and the power which he yielded to make it happen.  It is a vivid account of the adage, absolute power corrupts.Author, Robert Caro is an author of the highest caliber and highly recommend this and the series he has written on the life of  LBJ."}]}, "authors": ["Robert A. Caro"], "isbn": "0394720245", "longitude": 0.0, "periods": ["1900s"], "title": "The Power Broker: Robert Moses and the Fall of New York", "word_cloud": "brilliant elucidation famous aphorism tend corrupt absolute corrupts absolutely perfect respect monumental equally fine tome least principle get top intend put practice derail truly tragic figure admiration disgust vie mind reader there redeem feature depiction truly vile man desire solely character ability comprehensively demolish great work unfortunately infrastructure build destroyed much value even culpable tale way mayor cave demonic ego way vaunted press lap everything say almost never challenge investigative journalist largely comatose one quibble mention journalist influential considerable role topple pedestal odd omission know hatchet job relish comment even knew awful man shock revelation oppose policy expose vile personality vividness take man delve deep document source pull thread together weave shroud vampire monster racist bully egotist interested indifferent demean life destroy remind least recently attain great nightmare hop people want answer question wonderful grapple career exploration activist struggle form existential crisis call ambition morality question hardcover paper sleeve get wrinkle really easily whole amount information contain biography truly merit high rating author quite fastidious gather gleaning include work somewhat inundate data present know many still hold high regard name still appear apparently many landmark build long association city state look mainly biography tell person unbiased factual matter little hold high regard way tend view information people subject influence make mark society way rather lengthy recommend anyone enjoy biographies best date interest history way long involved accomplish lot often roll anyone get way absolutely spectacular center man decade incredible story way long page brilliant biography man shape major public work yield make vivid account adage absolute author highest caliber highly recommend series write life", "genres": ["Biography", "Art & Architecture"], "summary": "One of the most acclaimed books of our time, winner of both the Pulitzer and the Francis Parkman prizes, The Power Broker tells the hidden story behind the shaping (and mis-shaping) of twentieth-century New York (city and state) and makes public what few have known: that Robert Moses was, for almost half a century, the single most powerful man of our time in New York, the shaper not only of the city's politics but of its physical structure and the problems of urban decline that plague us today.\r\n\r\nIn revealing how Moses did it--how he developed his public authorities into a political machine that was virtually a fourth branch of government, one that could bring to their knees Governors and Mayors (from La Guardia to Lindsay) by mobilizing banks, contractors, labor unions, insurance firms, even the press and the Church, into an irresistible economic force--Robert Caro reveals how power works in all the cities of the United States. Moses built an empire and lived like an emperor. He personally conceived and completed public works costing 27 billion dollars--the greatest builder America (and probably the world) has ever known. Without ever having been elected to office, he dominated the men who were--even his most bitter enemy, Franklin D. Roosevelt, could not control him--until he finally encountered, in Nelson Rockefeller, the only man whose power (and ruthlessness in wielding it) equalled his own.", "asin": "0394720245", "rank": "6553", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51FOnlIEruL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}