{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 42, "rating": 3.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I thought Mr. Thereoux nailed it in this book. He describes well an angry widow, her shambolic son, and the cultural ignorance they swim in as Hong Kong is being turned over to the Chinese. A wise and thoughtful book about cowardice and family."}, {"review_sentiment": 5.0, "review_text": "Great story brought back great memories of living in Hong Kong before handover."}, {"review_sentiment": 2.0, "review_text": "lots of predictable sexual innuendo for the pleasure of straight white men who have asian chick fetishes!!"}, {"review_sentiment": 1.0, "review_text": "I am not sure whether this author was trying to make a mockery of the Brits or the Chinese. The story was poorly put together.  History since 1997 proved that the author was totally short sighted.  Sorry I wasted time reading this book."}, {"review_sentiment": 5.0, "review_text": "if you want a pre-handover snapshot of life of a Brit colonist, this is a splendid book."}, {"review_sentiment": 5.0, "review_text": "Yes, this was Kowloon Tong, for somebody who grew up on the island.  A good read."}, {"review_sentiment": 3.0, "review_text": "A dispiriting and dreary novel without one admirable character. The book’s first half showed promise, but the author then seemed to lose interest and energy. The result is a dwindling, episodic plot without causality, the characters incapable of taking independent action or surprising the reader in any way. Theroux, a fan of Georges Simenon, seems influenced here by the latter’s spare psychological novels, with their claustrophobic settings and weak, haunted protagonists. However, Theroux fails to deliver the tension, insight and humanity of Simenon’s best. This is the fourth Theroux book I’ve read in the last month, albeit the first novel. Enough for now."}, {"review_sentiment": 1.0, "review_text": "Theroux's Pride and Prejudice of HK. Depressing and stereotypical. Maybe Theroux tried to use stereotypes to mock stereotypes, but too bad it failed. No one in my lit class likes it.Read this kind of books critically."}, {"review_sentiment": 4.0, "review_text": "I know Paul Theroux mostly from hit great books on travel. This novel on Hong Kong, from the perspective of British people, that earned their livelihood in HK was very interesting. As someone that now lives in Hong Kong I recognize many observations and locations. The business practices of father and son in Kowloon Tong are a joy to read. Great book."}, {"review_sentiment": 1.0, "review_text": "Paul Theroux is a wonderful travel writer; too bad he did not stick to that genre.  Kowloon Tong is a poor book--poorly written, poorly plotted--poor characters.  The stereotyping of English people living in Hong Kong is almost too much to even talk about.  To have lived in Hong Kong for forty years and have the mother character still refer to Chinese as \"Chinky-Chongs\" is patently absurd.  The main character, \"Bund\" (appropriately named) has the fewest amount of will ever devised in a man/son.  His inability to stand up to his mother in anyway makes the characer seem totally unreal.  No one is really like this character.  He is bullied into selling his property (by his mother); he cannot have any relationship at all without worrying about his mother's feelings; he follows her directions/desires/orders without a whimper.  Her response to his losing the woman he supposedly loves, \"They all look alike; you can always find another\" is just ridiculous.  Perhaps I miss the sarcasm, the irony, or whatever high-sounding literary term is that could be applied to this book, but if I had not paid good money for it, I definitely would have chucked it afte the first thirty pages!"}]}, "authors": ["Paul Theroux"], "isbn": "0395901413", "longitude": 114.1628131, "periods": ["1900s"], "title": "Kowloon Tong: A Novel of Hong Kong", "word_cloud": "think nail describe well angry widow shambolic son cultural ignorance swim turn wise thoughtful cowardice family story bring back great memory live handover lot predictable sexual innuendo pleasure straight white men asian chick fetish sure author try mockery story poorly put together prove author totally short sight waste time reading want snapshot life colonist splendid somebody grow good dispiriting dreary admirable character first half show promise author seem lose interest energy result dwindle episodic plot causality character incapable take independent action surprising way fan seem influenced latter spare psychological novel claustrophobic setting weak haunted protagonist however fail tension insight humanity best fourth last month first stereotypical try use stereotype mock stereotype bad fail lit class like kind critically know mostly hit great travel perspective british people earn livelihood interesting someone live recognize many observation locations business practice father son joy wonderful travel writer bad stick genre poor poorly write poorly plot poor character stereotype english people live almost much even forty year mother character still refer chinese patently absurd main character appropriately name fewest amount ever devise inability stand mother anyway make character totally unreal one really like character bully sell property mother relationship worry mother feeling follow response lose woman supposedly love look alike always find ridiculous perhaps miss sarcasm irony literary term pay good money definitely first thirty page", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Ninety-nine years of colonial rule are ending as the British prepare to hand over Hong Kong to China. For Betty Mullard and her son, Bunt, it doesn't concern them - until the mysterious Mr. Hung from the mainland offers them a large sum for their family business. They refuse, yet fail to realize Mr. Hung is unlike the Chinese they've known: he will accept no refusals. \r\n\r\nWhen a young female employee whom Bunt has been dating vanishes, he is forced to make important decisions for the first time in his life - but his good intentions are pitted against the will of Mr. Hung and the threat of the ultimate betrayal.\r\n\r\n\r\n\"A moody thriller . . . cleverly, tightly constructed, fast-paced.\" The New York Times", "asin": "0395901413", "rank": "872997", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/51NXF3ZuaRL.jpg", "country": "China", "story_arc": ["Tragedy", "Things only get worse"]}