{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 18, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Powerful"}, {"review_sentiment": 4.0, "review_text": "When it comes to spinning stories of 1960's New Orleans as the backdrop, I think of this as the anti \"Confederacy of Dunces.\"This book captures the stink and grime of an impoverished city with a phantasmagorical plot featuring over the top right wing rabble rousers, civil rights con artists, drunk dreamers and corrupt politicians.One can easily see how this festering  swamp of racism, paranoia and corruption hatched a Lee Harvey Oswald or Jim Garrison - they would fit right in as characters in this book.This is a humidity soaked and alcohol drenched journey though the the underbelly of an America in the throes of one of its ugliest eras, as the backlash against civil rights reached its peak and the war in Indochina was just beginning.  Unemployment, failure, race riots and poverty pervade the French Quarter, not Mardi Gras parades or tourist frivolity.  Even temporary success is met with complete cynicism, as its lucky beneficiaries are all to aware of its fleeting nature.A tough read, but an entertaining rebuttal to those who wax nostalgic about the \"good old days.\"  Things may look bad now, but we have experienced far worse."}, {"review_sentiment": 3.0, "review_text": "This jambalaya of human flotsam and jetsam set in New Orleans in 1963 was Robert Stone’s first novel. Published in early 1967, Hall of Mirrors in part reflects its time of great social upheaval, mixing retrograde conservatism and shyster religiosity with naive liberal social justice idealism and let-your-freak-flag-fly libertarianism.Unfortunately, the book is at least a third too long, with many fairly tedious passages, and the main character, Rheinhardt, a cynical drunk who gets a job as a disk jockey for a radical right wing radio station, is not exactly one to engage the reader’s sympathy (at least, he didn’t engage mine).If there is any sympathy to be had, it is for Geraldine, a 20-year-old widow from West Virginia with some legitimate gripes about life who foolishly takes up with Rheinhardt, and Morgan Rainey, a naive, out-of-his-depth do-gooder learning some hard lessons about life. But the rest of the crew are either laconic potheads or, in the case of the radio station’s right wingers, such crude stereotypes that it’s hard to take them seriously.There were some things I really liked about Hall of Mirrors. Certain scenes come off marvelously, such as those in which Rainey tries to elicit some connection with poor blacks he visits while conducting home visits for a social services survey. But there are too many others, especially those involving Reinhardt and Geraldine, that drag. Theirs is just not that interesting a relationship, yet it chews up lots of screen time while more interesting plot threads, such as the goings-on at the radio station, are left largely unexplored until near the end, where a major publicity stunt ends in a tragi-farcical race riot.Given the plaudits many of Stone’s subsequent novels received, Hall of Mirrors can probably be regarded as a warmup exercise for better things to come."}, {"review_sentiment": 1.0, "review_text": "This was a very tedious book to read with no redeeming social values and no person whom I could identify with. I would not recommend it"}, {"review_sentiment": 4.0, "review_text": "Robert Stone is a gifted writer.  I have read three novels by Stone.  \"A Flag for Sunrise\", \"Dog Soldiers\" and \"Hall of Mirrors\".  \"A Flag for Sunrise\" is my favorite but the other two are close behind.Stone's main characters are primarily extremely disillusioned people.  Alchoholics,drug addicts,sociopaths--or combinations of these things.  But fundamentally they are disatisfied with their lives.  The way Stone describes the alchohol and drug trips--and the disillusionment of his characters--makes one wonder if perhaps,he has been there himself.It seems obvious that Stone's writer's voice resonates with the style of Hemmingway and Graham Greene--and draws deeply from the themes of Greene and Hemmingway.  Most assuredly he has chosen very gifted writers to empathsize with.I definitely recommend all three of these novels.  Perhaps beginning with \"A Hall of Mirrors\" and following it up with \"Dog Soldiers\" and then finishing with my personal favorite \"A Flag for Sunrise\"  Stone will not disappoint you.  He is an incredibly gifted writer."}, {"review_sentiment": 5.0, "review_text": "This novel is more topical than ever in today's political enviroment . Substitute Fox News for WUSA , or how about viewing a two-bit alcoholic DJ like Reinhardt as a potential Glen Beck . Stone was a prophet!"}, {"review_sentiment": 3.0, "review_text": "\"A Hall of Mirrors\" was a book that Robert Stone lost his way.  Having read \"Damascus Gate\" and \"Dog Soldiers\", this book fell a little short. His book \"Bay of Souls\" was a stretch."}, {"review_sentiment": 3.0, "review_text": "Robert Stone is a writer I want to like more than I actually do.  He's certainly a bold stylist who, in this book and others, presents an unrelentingly bleak view of humanity that is hard to shrug off.  And he manages to also sneak in some sly humor and jaundiced observations about various social mores that offset the darkness of his prose.  Being a former resident of New Orleans, I did think this book was quite effective at evoking the city's character and grit in many passages.  Ultimately, though, I started to get bored with the plot well before it reached a conclusion.  I might well try another Stone book some day (also read Dog Soldiers some time ago) but he's not exactly at the top of my to-read list at the moment."}, {"review_sentiment": 4.0, "review_text": "stone's powerful first novel is a characteristic melange of right-wingers, political intrigue and paranoia, drugs, poverty and a deeply spiritual yearning. it is as relevant today as when it was written more than 30 years ago, a testament to stone's vision.what is most captivating is his dazzling writing, intense spiritual vision, powerful dialog and deep insights. the evocation of new orleans is accurate and immersive. as with future stone novels, the reader himself may feel like they are in a hall of mirrors as they try to puzzle it all out, but this is part of the challenge Stone throws out to his audience.one of the most powerful and important american writers of the last 50 years."}, {"review_sentiment": 5.0, "review_text": "This book is as wise and penetrating today as when it was written.  In this age of predatory capitalists aligned with the Christian right, Stone's corrupt evangelists and attorneys come alive again in New Orleans.  Amid this corruption, broken people try to live, love and survive.Stone's language is poetically compressed, and his range of imagination uncovers detail and image that lesser writers would never discover.  It is astonishing that this is a first novel.  It is truly a \"Great American Novel\" on par with anything Faulkner ever wrote.  If we did not live in an age of cultural lobotomy, he would certainly get the attention that he deserves.How often do we read something that leaves us changed?  Not often.  Read this book if you want to go home to the best part of yourself."}]}, "authors": ["Robert Stone"], "isbn": "0395860288", "longitude": -90.0701156, "periods": ["1900s"], "title": "A Hall of Mirrors", "word_cloud": "powerful come spin story backdrop think anti capture stink grime impoverished city phantasmagorical plot feature top right wing rabble rous civil right con artists drunk dreamer corrupt easily fester swamp racism paranoia corruption hatch right character humidity soak alcohol drench journey underbelly throes ugliest eras backlash civil right reach peak war begin unemployment failure race riot poverty pervade french parade tourist frivolity even temporary success meet complete cynicism lucky beneficiary aware fleet tough entertaining rebuttal wax nostalgic good old day bad experience far worse jambalaya human flotsam jetsam set first publish early part reflect time great social upheaval mix retrograde conservatism shyster religiosity naive liberal social justice idealism least third long many fairly tedious passage main character cynical drunk get job disk jockey radical right wing radio station exactly engage sympathy least engage mine sympathy widow legitimate gripe life foolishly take naive learn hard lesson life rest crew laconic pothead case radio station right winger crude stereotype hard take thing really like scene come marvelously try elicit connection poor black visit conduct home visit social service survey many others especially involve drag interesting relationship yet chew lot screen time interest plot thread radio station leave largely unexplored end major publicity stunt end race plaudit many subsequent novel receive probably regard warm up exercise better thing come tedious redeem social value person gift writer novel stone favorite close main character primarily extremely disillusioned people drug addict sociopath combination thing fundamentally dissatisfied live way describe alcohol drug trip disillusionment character make wonder perhaps seem obvious writer voice resonate style draw deeply theme assuredly choose gifted writer empathize definitely recommend novel perhaps begin follow finish personal favorite disappoint incredibly gift writer topical ever today political environment view alcoholic potential prophet lose way have fell little short stretch writer want actually certainly bold stylist others present unrelentingly bleak view humanity hard shrug manages also sneak sly humor jaundice observation various social more offset darkness prose former resident think quite effective evoke city character grit many passage ultimately start get bore plot well reached conclusion well day also time ago exactly top list moment stone powerful first characteristic melange political intrigue paranoia drug poverty deeply spiritual yearning relevant today write year ago testament stone captivate dazzle write intense spiritual vision powerful dialog deep insight evocation new orleans accurate immersive future stone novel try puzzle part challenge throw powerful important american writer last year wise penetrate today write age predatory capitalist align christian right corrupt evangelist attorney come alive corruption broken people try live love language poetically compressed range imagination uncovers detail image lesser writer never astonish first truly great american par anything ever write live age cultural lobotomy certainly attention often something leave change not often want home best part", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Rheinhardt, a disk jockey and failed musician, rolls into New Orleans looking for work and another chance in life. What he finds is a woman physically and psychically damaged by the men in her past and a job that entangles him in a right-wing political movement. \r\n\r\nPeopled with civil rights activists, fanatical Christians, corrupt politicians, and demented Hollywood stars, A Hall of Mirrors vividly depicts the dark side of America that erupted in the sixties. \r\n\r\nTo quote Wallace Stegner, \"Stone writes like a bird, like an angel, like a circus barker, like a con man, like someone so high on pot that he is scraping his shoes on the stars.\"", "asin": "0395860288", "rank": "297032", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51FQzSbSMiL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}