{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 29, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "The book conveys the enigma of Washington and would have been a thoroughly enjoyable read but for the appalling number of typos in the Kindle version.  They became such a distraction that I almost put the book down.  I see that others have made this criticism and wonder why it has not been remedied by now."}, {"review_sentiment": 5.0, "review_text": "Very Good"}, {"review_sentiment": 5.0, "review_text": "It’s a commonplace that what transpires “inside the Beltway” that rings Washington, DC, is at best a poor reflection of American views and values. Over the years, scholars, pollsters, and pundits have attempted to understand this contrast, but the mechanistic tools of science and the biases of political analysts fail to grasp the nuances of the way things get done in the nation’s capital. Reading fiction is a better route to understanding the peculiar character of Washington’s insular community. For example, the work of Thomas Mallon (Finale, Watergate) offers more insight into the scandal-plagued years of the Nixon and Reagan Administrations than anything else I’ve read. But the reigning master of American political fiction is Ward Just. Echo House, the eleventh of his eighteen novels, is a brilliant portrayal of three generations of Washington deal-makers.The real world inside the BeltwayEvery second year, the population of Capitol Hill changes a little, and every fourth often witnesses a dramatic shift in the upper reaches of the Administration. But the hundreds of individuals who account for these changes are a tiny fraction of the city’s population. Life goes on, essentially unchanged, for the hundreds of thousands of other citizens — not just the janitors, taxi drivers, housemaids, and others who constitute the city’s working class but also the bureaucrats, lawyers, journalists, lobbyists, spies, consultants, and assorted deal-makers who make government work. In Echo House, Ward Just drills down into the lives of three generations in a family of Washington power-brokers. The picture he paints is troubling even though it’s illuminating.Where real power liesPresidents habitually complain they have far less power than the public might think. In fact, scholars and political observers alike have explored the difficulty of bringing about significant change in American policy from the top — sometimes even just making what might seem to be straightforward decisions. Old-school political scientists argue that this is a result of the competition among the many special interests that converge on government. While this is certainly a factor, the power of the permanent bureaucracy and of the private citizens who wield influence from one Administration to the next may be even greater. These are the people who remain in place, regardless of which party or which President is “in power.” Echo House demonstrates the subtle ways the most powerful of these people operate behind the scenes and dictate the course of events.A saga of three generationsEcho House traces the history of the rich and powerful Behl family from the time just after World War I until close to the end of the twentieth century, when the novel was first published. Senator Adolph Behl is his party’s presumptive nominee for Vice President. Then the presidential candidate reneges on a promise and names someone else. A young boy at the time, the Senator’s son, Axel, takes it all in, resolving to aim for the White House himself. Axel, much like John F. Kennedy’s big brother, Joe, seems destined to achieve his ambition. But, like Joseph Kennedy, his plans are derailed during World War II. Serving as an OSS officer in Occupied France, the Jeep Axel is driving hits a land mine, horribly wounding him and leaving him in great pain for the rest of his life.Leaving aside the dream of winning the White House, Axel builds a power base through the intelligence community, becoming a confidential adviser of every president and becoming widely acknowledged through the capital as one of the most influential people in town. Axel’s son, Alec, a close observer of his father, takes up the mantle himself in due time. Eventually, he too arrives at the pinnacle of influence, portrayed on the cover of TIME Magazine as “The man to see in Washington.” Along the way we witness the turbulent Roosevelt years, the hard-fought battles under Harry Truman, the years of Dwight Eisenhower, Richard Nixon, and Joseph McCarthy, and all the presidents who follow. The tale is rich with detail and well-informed with insight about the seminal events of all those years. Politics in the nation’s capital looks much different from the perspective the author conveys.About the authorWard Just’s eighteen novels include some of the most remarkable political tales of the twentieth century. Echo House is one of those. Just published his first novel in 1970 following a career in journalism. His most recent book appeared in 2014."}, {"review_sentiment": 3.0, "review_text": "excellent vignettes, but I had to update myself each chapter as to what era I was in, and then, I didn't really like these people, nor do I know anyone like them. So, I have great images in my memory, but it was not so much fun to read."}, {"review_sentiment": 2.0, "review_text": "I think Just is a formidable author but this wasn't his best book for me."}, {"review_sentiment": 5.0, "review_text": "A great \"Washington\" novel.  Captures in particular the toll the city takes on relationships and psyches."}, {"review_sentiment": 4.0, "review_text": "Whoever proof-read this book should be fired.  If this were the first Kindle book I'd ordered from Amazon, it would have been the last. A good author deserved better treatment than this."}, {"review_sentiment": 4.0, "review_text": "Fascinating inside look at Washingtonians.My complaint is for the sloppy job of editing done by Kindle.  I have never seen so many typos and strange nonsense words in any publication.  It was extremely irritating."}, {"review_sentiment": 5.0, "review_text": "One of many Ward Just Masterpieces - 100 years of a Washington political family's highs and lows - Just never disappoints - Intelligent - Thought provoking - Great prose. Ward Just is an American Master."}, {"review_sentiment": 4.0, "review_text": "The book covers the span of the 20th century more or less, via an account of several generations of Democratic politicos.  The insights are worthwhile, and opened me up to considerations of hereditary power in this country that are unrelated to our typical politically polarized views.  The characters are quite well-drawn, but not terribly likable.  The ending is a bit abrupt."}]}, "authors": ["Ward Just"], "isbn": "0395901383", "longitude": -77.0366456, "periods": ["1900s"], "title": "Echo House", "word_cloud": "conveys enigma thoroughly enjoyable appal number typo version become distraction almost put see others make criticism wonder remedied very good commonplace transpire ring best poor reflection american view value year scholar pollster pundit attempt understand contrast mechanistic tool science bias political analyst fail grasp nuance way thing get do nation capital fiction better route understand peculiar character insular community example work offer insight year anything else reign master american political fiction eleventh eighteen novel brilliant portrayal generation real world second year population change little fourth often witness dramatic shift upper reach hundred individual account change tiny fraction city population go essentially unchanged hundred thousand citizen janitor taxi driver housemaid others constitute city work class also bureaucrats lawyer journalist lobbyist spy consultant assort make government work drill live generation family picture paint trouble even real power lies presidents habitually complain far le power public fact scholar political observer alike explore difficulty bring significant change american policy top sometimes even make straightforward decision political scientist argue result competition many special interest converge government certainly factor power permanent bureaucracy private citizen wield influence next even greater people remain place regardless party demonstrate subtle way powerful people operate scene dictate course saga generations echo trace history rich powerful family time close end twentieth century first publish party presumptive nominee then presidential candidate renege promise name someone else young boy time son take resolve much big brother seem destine achieve ambition plan derailed officer drive hit land mine horribly wound leave great pain rest aside dream win build power base intelligence community become confidential adviser president become widely acknowledge capital influential people town son close father take mantle due time arrive pinnacle influence portray cover man see way witness turbulent year battle year president follow tale rich detail insight seminal event year nation capital look much different perspective author author ward eighteen novel include remarkable political tale twentieth century publish first follow career journalism recent appear excellent vignette update chapter era really people know anyone great image memory much fun think just formidable author best great particular toll city take relationship psyche whoever fire first order last good author deserve better treatment fascinate inside look complaint sloppy job edit do never see many typo strange nonsense word publication extremely irritate many year political family high low never disappoint intelligent provoke prose cover span century account several generation democratic politicos insight worthwhile open consideration hereditary power country unrelated typical politically polarized view character quite terribly likable end bit abrupt", "genres": ["Fiction & Literature"], "summary": "Here is Just's masterpiece - an epic chronicle of three generations of Washington power brokers and the womenfolk who loved them (except when they didn't). The Washington Post described this book as \"a fascinating if ultimately painful fairy tale, complete with a family curse. The decline of the Behls represents the decline of Washington from the bright dawn of the American century into the gathering shadows of an alien new millennium.\"", "asin": "0395901383", "rank": "1034568", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/419rqNqX3cL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}