{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 90, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Absolutely stunning and enthralling work!  I had only finished one page before I stopped to check out what else this astoundingly skilled, yet unknown to me, author had written. I had to read the information three times before I could believe this was a debut novel, a first book.  Between the gritty realism softened by simply lovely prose, and a beguiling tale as well,  the author will be a force to be reckoned with in the literary world!"}, {"review_sentiment": 5.0, "review_text": "Excellent sad story, my book club loved it."}, {"review_sentiment": 3.0, "review_text": "Good read! Short book but character development was minor. Overall enjoyed it and was a good discussion in our book club."}, {"review_sentiment": 5.0, "review_text": "you should read this.  love a story based on fact."}, {"review_sentiment": 4.0, "review_text": "not a feel good book but a compelling story."}, {"review_sentiment": 5.0, "review_text": "Imaginatively written as told by a spirit. This novel makes us appreciate our chance to live our life freely of our own choosing."}, {"review_sentiment": 4.0, "review_text": "Strange & unexpected.  Left me wanting more."}, {"review_sentiment": 4.0, "review_text": "overall a decent read.  plot was a little erratic.  main thing I did not like was the author's pretentious style"}, {"review_sentiment": 5.0, "review_text": "This book is unlike anything I have ever read.  At first I wasn't sure if I wanted to read it but quickly got caught up in the story & couldn't put it down.  I am eagerly awaiting the next book from Courtney Collins!"}, {"review_sentiment": 4.0, "review_text": "Good read - good story."}]}, "authors": ["Courtney Collins"], "isbn": "0399167099", "longitude": 151.2164539, "periods": ["1900s", "Recent Releases"], "title": "The Untold", "word_cloud": "absolutely stun enthral work finish page stop else astoundingly skilled yet unknown author write information time debut first gritty realism soften simply lovely prose beguile tale well author force reckon literary world excellent sad story club love good character development minor enjoy good discussion club story base fact good compelling story imaginatively write tell spirit make appreciate chance live life freely choose unexpected wanting overall decent plot little erratic main thing like author pretentious style anything ever first sure want quickly get caught story eagerly await next good good story", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A stunning debut novel set in the Australian outback about a female horse thief, her bid for freedom, and the two men trying to capture her.\r\n\r\nIt is 1921. In a mountain-locked valley, Jessie is on the run.\r\n\r\nBorn wild and brave, by twenty-six she has already lived life as a circus rider, horse and cattle rustler, and convict. But on this fateful night she is just a woman wanting to survive though there is barely any life left in her.\r\n\r\nTwo men crash through the bushland, desperate to claim the reward on her head: one her lover, the other the law.\r\n \r\nBut as it has always been for Jessie, it is death, not a man, who is her closest pursuer and companion. And while all odds are stacked against her, there is one who will never give up on her—her own child, who awaits her.\r\n\r\n“This extraordinary novel—propelled by the dark, rich talents of a truly brilliant writer—dazzles, staggers and amazes.”  New York Times bestselling author of Eat, Pray, Love", "asin": "0399167099", "rank": "392972", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51uWp2jE1uL.jpg", "country": "Australia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}