{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": -27.4689682, "ratings": {"num_ratings": 3, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Though these words are spoken by a priest, they could have been spoken by any of the bored and guilt-ridden characters of this novel, all of whom are at loose ends, uncertain whether their lives have any meaning at all to anyone. Bernard Leverson, a music examiner, is bored with his wife, telling her, \"After twenty years of marriage, you feel as if you're the same sex.\" She, in turn, is having a tepid affair with a neighbor, engaging in \"the humdrum routine of deceiving their partners, not out of love but boredom.\"The Leversons' fourteen-year-old son, craving genuine feeling and communication, instead sees indifference and seeks excitement in shop-lifting and misbehavior. Nuns in the local convent and priests at the local church perform the routine requirements of their vocations, sometimes without genuine feelings of commitment. Other characters atone for \"sins\" committed long in the past, wasting their present lives in the fruitless search for personal absolution.Winner of the 1965 Miles Franklin Award for Best Australian Novel of the Year, The Slow Natives is Thea Astley at her most thoughtful and complex. In compressed language and sparkling dialogue, she explores the meaning of love in all its permutations, along with the \"sin\" and \"guilt\" so often associated with it. Unique and witty descriptions abound: A monsignor's soul, \"doily-neat, had scalloped edges of predictable pattern\"; two men lunching at an inn notice the dining room \"filled up with crustaceans--varnished hard-jawed mums and small-bit farmers coated with the same malty staleness\"; and one woman, annoyed at another, snaps, \"You know what they used to call [you] at school? Alma Martyr!\"As her characters interact and overlap, affecting each other's lives, though not necessarily inspiring their love, Astley evokes genuine feeling for them, allowing her readers to empathize with them. The humor for which she is so often lauded is subordinated here--she does not poke fun at these sad, often earnest, and very \"normal\" people. Revelations do come to them, often at a great price, and few readers will fail to be moved by the climactic ending. Mary Whipple"}, {"review_sentiment": 5.0, "review_text": "This book tracks the life of the Leverson family on three levels: the emotional, mental, and physical. As they carry on their everyday lives, the reader is drawn into the depth of their existence on all these levels through the creative, serious, humorous, and satirical writing style of the author. The reader is mesmerized by the numerous stories about the lives of this family during the integration, disintegration and resolution of various life problems that separate each member from the other. Eventually the family reunites due to a serious crisis which threatens one vulnerable family member, Keith.The reader is introduced to the lonely existence of Keith as he engages in attention-getting behaviors, such as petty theft, trying to force his dad to express strong emotions toward Keith -any emotional involvement would gratify Keith. Bernard is a mild-mannered easy going gentleman who teaches music to various levels of students. He tests the students proficiency to determine their skills, aptitude and abilities for more serious piano study. One of the most highly captivating stories within the book involved Bernard as he tested a pretty precocious female teenage student who used her awkening s#xual energy to her advantage. Amazingly, she was a highly talented pianist and Bernard was drawn to her energy but he kept it well within the bounds of a proper \"student and teacher\" relationship. However, his special attention to Eva did not go unnoticed by one of the nuns who taught Eva at the Catholic boarding school she attended. As it turned out, the nun, Sister Matthew, also studied the piano and was taking examinations with Bernard to gain her qualifications and proper credentials to teach piano ... Sister Matthew became jealous over a small incident that she noticed had passed between Bernard and Eva. Bernard was caught unprepared for the aftermath of this petty jealousy (of which he was unaware). He became the victim of an unfounded accusation, via an anonymous letter which alleged inappropriate behavior ... Meanwhile Iris was carrying on an affair with the male partner of a couple who was in their circle of friends. Through different means, Bernard learned of the affair ... and so did Keith their son. To Keith's consternation, Bernard did not show any emotion and let the situation continue ...Keith was testing his limits as a rebellious teenager. He grew up into young adulthood without any strong interests in life or a clear path or goal. He tried college, he worked at many jobs and ended up as a drifter and finally a surfer on the beach. The family had not heard from him for quite a while and Bernard and Iris accused each other of failing to raise him properly ... A phone call aroused both Bernard and Iris from bed. It made them finally realize what is most important to a family. Thea Astely possesses a very unique writing gift, the ability to weave complex emotions and deeply moving life experiences of many different characters into a seamless whole. As an author from Australia she uses her special knowledge and experience of her homeland to best advantage - introducing new readers to its diverse culture and untamed natural beauty.Erika Borsos (erikab93)"}, {"review_sentiment": 5.0, "review_text": "Though these words are spoken by a priest, they could have been spoken by any of the bored and guilt-ridden characters of this novel, all of whom are at loose ends, uncertain whether their lives have any meaning at all to anyone.  Bernard Leverson, a music examiner, is bored with his wife, telling her, \"After twenty years of marriage, you feel as if you're the same sex.\"  She, in turn, is having a tepid affair with a neighbor, engaging in \"the humdrum routine of deceiving their partners, not out of love but boredom.\"  The Leversons' fourteen-year-old son, craving genuine feeling and communication, instead sees indifference and seeks excitement in shop-lifting and misbehavior.  Nuns in the local convent and priests at the local church perform the routine requirements of their vocations, sometimes without genuine feelings of commitment.  Other characters atone for \"sins\" committed long in the past, wasting their present lives in the fruitless search for personal absolution.Winner of the 1965 Miles Franklin Award for Best Australian Novel of the Year, The Slow Natives is Thea Astley at her most thoughtful and complex.  In compressed language and sparkling dialogue, she explores the meaning of love in all its permutations, along with the \"sin\" and \"guilt\" so often associated with it.  Unique and witty descriptions abound: A monsignor's soul, \"doily-neat, had scalloped edges of predictable pattern\"; two men lunching at an inn notice the dining room \"filled up with crustaceans--varnished hard-jawed mums and small-bit farmers coated with the same malty staleness\"; and one woman, annoyed at another, snaps, \"You know what they used to call [you] at school?  Alma Martyr!\"As her characters interact and overlap, affecting each other's lives, though not necessarily inspiring their love, Astley evokes genuine feeling for them, allowing her readers to empathize with them.  The humor for which she is so often lauded is subordinated here--she does not poke fun at these sad, often earnest, and very \"normal\" people.  Revelations do come to them, often at a great price, and few readers will fail to be moved by the climactic ending.  Mary Whipple"}]}, "authors": ["Thea Astley"], "isbn": "0399138757", "longitude": 153.0234991, "periods": ["1900s"], "title": "Slow Natives", "word_cloud": "word speak priest bored character loose end uncertain life mean anyone music examiner bore wife telling year marriage feel sex turn tepid affair neighbor engage humdrum routine deceive partner love son crave genuine feel communication instead see indifference seek excitement misbehavior local convent priest local church perform routine requirement vocation sometimes genuine feeling commitment other character atone sin commit long past wasting present live fruitless search personal thoughtful complex compressed language sparkle dialogue explores mean love permutation sin guilt often associate witty description abound monsignor soul scallop edge predictable pattern men lunch inn notice din room fill crustacean varnish mum farmer coat malty staleness woman annoy snap know use call school character interact affect life necessarily inspire evokes genuine feel allow reader empathize humor often laud subordinated poke fun sad often earnest normal people come often great price reader fail move climactic end mary whipple track life family level emotional mental physical carry everyday live draw depth existence level creative serious humorous satirical writing style author mesmerize numerous story live family integration disintegration resolution various life problem separate member family reunites due serious crisis threaten vulnerable family member introduce lonely existence engage behavior petty theft try force dad express strong emotion emotional involvement easy go gentleman teach music various level student test student proficiency determine skill aptitude ability serious piano study highly captivate story involve test pretty precocious female teenage student use waken dual energy advantage highly talented pianist drawn energy keep well bound proper student teacher relationship however special attention go unnoticed nun taught board school attend turned nun also study piano take examination gain qualification credential teach piano become jealous small incident notice pass catch unprepared aftermath petty jealousy unaware become victim unfounded accusation anonymous letter allege inappropriate behavior meanwhile carry affair male partner couple circle friend different mean learn son consternation show emotion situation test limit rebellious teenager grow young adulthood strong interest life clear path goal try college work many job end drifter finally beach family hear quite accuse fail properly phone call arouse bed make finally realize important family possess unique write gift ability weave complex emotion deeply move life experience many different character seamless whole author use special knowledge experience homeland best advantage introduce new reader diverse culture untamed natural word speak priest bored character loose end uncertain life mean anyone music examiner bore wife telling year marriage feel sex turn tepid affair neighbor engage humdrum routine deceive partner love son crave genuine feel communication instead see indifference seek excitement misbehavior local convent priest local church perform routine requirement vocation sometimes genuine feeling commitment other character atone sin commit long past wasting present live fruitless search personal thoughtful complex compressed language sparkle dialogue explores mean love permutation sin guilt often associate witty description abound monsignor soul scallop edge predictable pattern men lunch inn notice din room fill crustacean varnish mum farmer coat malty staleness woman annoy snap know use call school character interact affect life necessarily inspire evokes genuine feel allow reader empathize humor often laud subordinated poke fun sad often earnest normal people come often great price reader fail move climactic end mary whipple", "genres": ["Fiction & Literature"], "summary": "The Slow Natives (1965) is a Miles Franklin Award-winning novel by Australian author Thea Astley, the first of her record number of four wins.\r\n\r\nTorn apart by conflict, the Leversons--music teacher Bernard, bored with his marriage and career; his unfaithful wife, Iris; and their rebellious teenage son, Keith--rediscover new meaning in their lives and relationships through tragedy.\r\n\r\nSet in sub-tropical Queensland, the novel examines the relationships between suburban Brisbanites including a priest, nuns and a couple and their teenage son.", "asin": "0399138757", "rank": "3170094", "city": "Brisbane", "image": "https://images-na.ssl-images-amazon.com/images/I/51-MoUIc1kL.jpg", "country": "Australia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}