{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 60.1674086, "ratings": {"num_ratings": 1, "rating": 1.0, "reviews": [{"review_sentiment": 1.0, "review_text": "HE DIED BEFORE FINISHING."}]}, "authors": ["James Thompson"], "isbn": "0399165509", "longitude": 24.9425683, "periods": ["2000s", "Recent Releases"], "title": "AB Helsinki Dead", "word_cloud": "", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 5/5 in the An Inspector Vaara Novel Series\r\n\r\nIn the stunning new thriller from the Edgar Award–nominated author, Inspector Kari Vaara has gained the top position in the Finnish police, and all the power it entails. . . .\r\n\r\nAs the new national police commissioner of Finland, Kari Vaara, along with his team Milo and Sweetness, now has the keys to the kingdom. With his vast collection of dirt, Kari purges the police ranks of the corrupt and undesirable, and he assigns the newly open job of commissioner of SUPO, Finland’s secret police, to Milo. Milo goes to work with the SUPO archives, having them scanned and organized for his analysis. As he digs deeper into the immense body of records, the evidence points to alarming conclusions. It’s a commonly held belief that there are no serial killers in Finland. Milo is about to prove that theory to be disturbingly wrong.\r\n\r\nMeanwhile, Kari is called to the scene of a bizarre and gruesome murder. A man is found hanging upside down from his left foot, his right leg bent at the knee and tied to the left. His hands are tied behind his back. There is no forensic evidence in the house. And the only clues at the crime scene include an odd assortment of goods: robes, a wand, a dull dagger, and a deck of tarot cards . . .", "asin": "0399165509", "rank": "7823700", "city": "Helsinki", "image": "https://images-na.ssl-images-amazon.com/images/I/51wp8tsig3L.jpg", "country": "Finland", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}