{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.2083537, "ratings": {"num_ratings": 189, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "An interesting look into the private life of Sigmund Freud and his family, albeit a mix of fact and literary fiction."}, {"review_sentiment": 3.0, "review_text": "Passional story telling of facts and suppositions related to Freud's love life; interesting build up of emotional stages and justifications  of characters going deeper into a contriversial relationship; cliche description of infidelity: ladolce vita with mistress vs platitude of wife/ burden of 6 kids family"}, {"review_sentiment": 2.0, "review_text": "A sad part of history."}, {"review_sentiment": 5.0, "review_text": "Once you are hooked on this book, you are hooked and cannot stop reading, very well written account of human behavior and how it affects all."}, {"review_sentiment": 4.0, "review_text": "Very interesting read!"}, {"review_sentiment": 2.0, "review_text": "Poorly written....not much meat to the story"}, {"review_sentiment": 4.0, "review_text": "We've come a long way, baby.  First part of book very distressing but found the complete story quite fascinating. This was a man that dictated much of psychological treatment for many people in need and took advantage of people without much care.Lots of historical as well as hysterical information provided and an authentic look at a period of history. Will be using this book as a book club read"}, {"review_sentiment": 2.0, "review_text": "I really wanted to love this book. I am a historical fiction junkie, and after hearing good things about this book, I had high hopes. It fell short for me though, for several reasons: the first being the writing. The author is constantly stating the obvious, leaving little to inference. The juvenile style of writing made me feel like I was reading a teen novel. Secondly, the climax (was there even one?) was underdeveloped. I was waiting and waiting for something exciting to happen, but it was dull the whole way through. I couldn't connect with the characters, especially the main character, Minna (the mistress). Overall, I would not recommend this book. There are 1000 better historical fiction novels."}, {"review_sentiment": 5.0, "review_text": "Fascinating reading. Don't know if all the incidents are factual, but the author's epilogue verified many. the book put a human personality on a character about whom we know more about his theories than about him."}, {"review_sentiment": 4.0, "review_text": "Loved the historical accuracies , even though this was fiction"}]}, "authors": ["Karen Mack", "Jennifer Kaufman"], "isbn": "0399163077", "longitude": 16.3725042, "periods": ["1800s", "Recent Releases"], "title": "Freud's Mistress", "word_cloud": "interesting look private life family mix fact literary fiction passional story tell fact supposition related love life interest build emotional stage justification character go deeper controversial relationship cliche description infidelity ladolce vita v platitude burden kid family sad part history once hook hooked stop reading well write account human behavior affect very interesting poorly write much meat story come long way baby part distress find complete story quite fascinate man dictate much psychological treatment many people need take advantage people much historical well hysterical information provide authentic look period history use club really want love historical fiction junkie hear good thing high hope fell short several reason first write author constantly state obvious leave little inference juvenile style write make feel read teen climax even underdevelop wait wait something excite happen dull whole way character especially main character better historical fiction novel fascinate read incident factual author epilogue verify many put human personality character know theory historical ac curacies even fiction", "genres": ["Fiction & Literature", "Romance", "Historical Fiction", "Women's Fiction"], "summary": "A thrilling story of seduction, betrayal, and loss, Freud s Mistress will titillate fans of Memoirs of a Geisha and The Other Boleyn Girl. Booklist \r\n\r\nIn fin-de-siecle Vienna, it was not easy for a woman to find fulfillment both intellectually and sexually. But many believe that Minna Bernays was able to find both with one man her brother-in-law, Sigmund Freud. \r\n\r\nAt once a portrait of two sisters the rebellious, independent Minna and her inhibited sister, Martha and of the compelling and controversial doctor who would be revered as one of the twentieth century s greatest thinkers, Freud s Mistress is a novel rich with passion and historical detail and a portrait of forbidden desire with a thought-provoking central question: How far are you willing to go to be happy? \r\n\r\n\"Absorbing and provocative . . . A great read . . . I've been recommending it to friends.\" Erica Jong", "asin": "0399163077", "rank": "550063", "city": "Vienna", "image": "https://images-na.ssl-images-amazon.com/images/I/51MVwQTvLtL.jpg", "country": "Austria", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}