{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 55.7507178, "ratings": {"num_ratings": 189, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Amazing perspective of history through the eyes of those who lived it, on a very, very personal level.  It's a rare glimpse, worth taking"}, {"review_sentiment": 5.0, "review_text": "Sad but true description of Soviet epoch"}, {"review_sentiment": 4.0, "review_text": "Russian love for their Motherland eloquently expressed."}, {"review_sentiment": 5.0, "review_text": "Take this book as it comes; don't ponder on the possibility of changing this book or making it better or making it more contemporary. It's a variety of stories from Russian people who lived, survived a major government collapse and rebuild. Intimate, personal stories about desperate lives during desperate times. Don't over analyze. Don't look for happy stories. This book brings you truth."}, {"review_sentiment": 5.0, "review_text": "Read it. Listen to it in the phenomenal, full-cast audiobook. One of the best explorations of the collective late Soviet, post-Soviet psyche and experience, told through the individual stories of a wide array of real life Soviet/ex-Soviet citizens. Brutal, tender, honest, heartbreaking and hopeful. Alexievich is extraordinary writer, who has absolutely earned her Nobel Prize all over again."}, {"review_sentiment": 2.0, "review_text": "Svetlana Alexievich's \"Secondhand Time: The Last of the Soviets\" left me unimpressed.  It was a long, discursive, repetitive, sometimes boring, transcription of talks with the last members of the Soviet generation in Russia.  It lacked any apparent effort at context and narrative framing by the author.  If a writer does nothing but regurgitate oral testimony, while it it may be informative and it may be unconventional, is it literature?  Not to me."}, {"review_sentiment": 5.0, "review_text": "Literally a lens into people's hearts and souls. History as literature."}, {"review_sentiment": 3.0, "review_text": "I agree with the 3 star review by Thomas Reiter. I would be careful about reading this book and if you want a good understanding of recent history of Russia, there are better books. What is clear from the history of communism and socialism is that total state control of economies and societies virtually always leads to dictatorship. 39 countries have tried this and all of them either became dictatorships or were to begin with. The 8 social democratic countries, on the other hand, are always rated objectively as the best places in the world to live. When a government makes private economic activity illegal, that requires a police state to enforce it. A social democracy has a cooperative structure, government, business, unions, cooperatives that share power and decisions and support democracy. Russia is a prime example of what happens when all the wrong things are done.Midwest Independent Research, educational websites. Dictatorships, mwir-dictatorships.blogspot. There is a book list on Russia here."}, {"review_sentiment": 5.0, "review_text": "Excellent writer. Eye opening look at the opinions of every day Russians."}, {"review_sentiment": 5.0, "review_text": "A fascinating oral history.  You meet wonderful people.  I marveled at the nostalgia for a time when there was no point in striving for economic success - rather like the peculiar freedom draftees felt from the imperative to achieve success during their military service.WhasW"}]}, "authors": ["Svetlana Alexievich"], "isbn": "0399588825", "longitude": 37.6176606, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Secondhand Time: The Last of the Soviets", "word_cloud": "amazing perspective history eye live personal level rare glimpse worth take true description epoch russian love eloquently express come ponder possibility change make better make contemporary variety stories russian people live survived major government collapse rebuild personal story desperate life desperate time do analyze happy story bring truth phenomenal audio book best exploration collective late soviet psyche experience tell individual story wide array real life citizen tender honest heartbreaking hopeful extraordinary writer absolutely earn leave unimpressed long discursive repetitive sometimes boring transcription talk member soviet generation russia lack apparent effort context narrative framing author writer nothing regurgitate oral testimony unconventional literature not literally lens people heart soul literature agree star review reading want good understanding recent history better clear history communism socialism total state control economy societies virtually always lead dictatorship country try become dictatorship begin social democratic country hand always rat objectively best place world live government make private economic activity illegal require police state enforce social democracy cooperative structure government business union cooperative share power decision support democracy prime example happen wrong thing educational website list russia excellent writer open look opinion day fascinating oral history meet wonderful people marvel nostalgia time point strive economic success rather peculiar freedom draftee felt imperative achieve success military", "genres": ["History", "Social & Cultural Studies", "Politics"], "summary": "When the Swedish Academy awarded Svetlana Alexievich the Nobel Prize, it cited her for inventing “a new kind of literary genre,” describing her work as “a history of emotions—a history of the soul.” Alexievich’s distinctive documentary style, combining extended individual monologues with a collage of voices, records the stories of ordinary women and men who are rarely given the opportunity to speak, whose experiences are often lost in the official histories of the nation.\r\n\r\nIn Secondhand Time, Alexievich chronicles the demise of communism. Everyday Russian citizens recount the past thirty years, showing us what life was like during the fall of the Soviet Union and what it’s like to live in the new Russia left in its wake. Through interviews spanning 1991 to 2012, Alexievich takes us behind the propaganda and contrived media accounts, giving us a panoramic portrait of contemporary Russia and Russians who still carry memories of oppression, terror, famine, massacres—but also of pride in their country, hope for the future, and a belief that everyone was working and fighting together to bring about a utopia. Here is an account of life in the aftermath of an idea so powerful it once dominated a third of the world.\r\n\r\nA magnificent tapestry of the sorrows and triumphs of the human spirit woven by a master, Secondhand Time tells the stories that together make up the true history of a nation. “Through the voices of those who confided in her,” The Nation writes, “Alexievich tells us about human nature, about our dreams, our choices, about good and evil—in a word, about ourselves.”\r\n\r\n“The nonfiction volume that has done the most to deepen the emotional understanding of Russia during and after the collapse of the Soviet Union of late is Svetlana Alexievich’s oral history Secondhand Time.” The New Yorker", "asin": "0399588825", "rank": "18706", "city": "Moscow", "image": "https://images-na.ssl-images-amazon.com/images/I/51hv0nVDMgL.jpg", "country": "Russia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}