{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 15237, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Although there are many different topics covered in this book the central theme is about friendship. Such a god book!"}, {"review_sentiment": 5.0, "review_text": "Loved that it was serious and comical at the same time.  So relatable to all moms with school aged children."}, {"review_sentiment": 5.0, "review_text": "Love this book! I watched the Tv series which was amazing so I had to read this. I loved it! It is a little different from the series and based in Australia so you have to get used to that but I would highly recommend, such an easy entertaining read!"}, {"review_sentiment": 5.0, "review_text": "Big Little Lies is one of the best mystery-ish book I have read in awhile. I really liked the small fragments of conversation at the bottom of each chapter. The books twists and turns make you not want to put it down. It is easy to read and therefore it is easy for you to immerse yourself in the setting Moriarty creates for the reader. The characters in the book are written so well that the comparison of the glamorous Celeste and Madeline compared to plain Jane. Although they are glamorous the author humanizes them by giving them problems that are real and relatable. Sometimes the names of the characters gets overwhelming when trying to remember who does what in this little town, but then there's little reminders to refresh you. I would recommend buying this for your favorite reader."}, {"review_sentiment": 5.0, "review_text": "This is one of the best books I have read in a long time. The characters, setting and plot kept me reading to the end. I thoroughly enjoyed the clever spritzing of humor throughout the book.  This was a fun, serious read.  I highly recommend Big Little Lies."}, {"review_sentiment": 5.0, "review_text": "Love!"}, {"review_sentiment": 5.0, "review_text": "This story drilled the facts of abuse deep into my brain. It also made Crystal clear how easily one can excuse certain behaviors because they think they will change because they loved them-  bullying certainly is abuse but can be excused too easily due to the person's age."}, {"review_sentiment": 5.0, "review_text": "I could completely  identify with one  character  in particular .  It was very hard to put this book  down. I found  myself  reading it  every spare moment I had."}, {"review_sentiment": 1.0, "review_text": "Count me in the minority who did not like this book.  I rarely stop reading a book mid-stream but after reaching the half way point I realized the topics make me uncomfortable.  Domestic violence, rape, mental cruelty, murder - these are not my idea of entertainment. I have read and enjoyed other books by Liane Moriarty but this one was deeply disturbing."}, {"review_sentiment": 4.0, "review_text": "Anyone with school age children can relate to a number of topics addressed within this story... the power of gossip, betrayal, secret lives, and a longing for acceptance."}]}, "authors": ["Liane Moriarty"], "isbn": "0425274861", "longitude": 151.2164539, "periods": ["2000s", "Recent Releases"], "title": "Big Little Lies", "word_cloud": "many different topic cover central theme friendship such god love serious comical time repeatable mom school age child watch series amaze love different series base get use highly easy entertain best awhile really like small fragment conversation bottom chapter twist turn make want put easy therefore easy immerse set create character write well comparison glamorous compare plain glamorous author humanize give problem real repeatable name character get overwhelming try town reminder refresh buying favorite best long time character set plot keep read end thoroughly enjoy clever spritz humor fun serious highly recommend story drill fact abuse deep brain also make clear easily excuse certain behavior think change love bully certainly abuse excuse easily due person age completely character particular hard put find read spare moment minority rarely stop read reach half way point realize topic make uncomfortable violence rape mental cruelty murder idea entertainment enjoy deeply disturb school age child relate number topic address story power gossip betrayal secret live long acceptance", "genres": ["Fiction & Literature", "Mystery & Suspense", "Women's Fiction"], "summary": "The #1 New York Times bestseller \r\n\r\nNow an HBO Series. The series is set in Monterey, but the book was set in Sydney, Australia. \r\n \r\nSometimes it’s the little lies that turn out to be the most lethal...A murder…a tragic accident…or just parents behaving badly? What’s indisputable is that someone is dead. But who did what? \r\n\r\nBig Little Lies follows three women, each at a crossroads:\r\n\r\nMadeline is a force to be reckoned with. She’s funny and biting, passionate, she remembers everything and forgives no one. Her ex-husband and his yogi new wife have moved into her beloved beachside community, and their daughter is in the same kindergarten class as Madeline’s youngest (how is this possible?). And to top it all off, Madeline’s teenage daughter seems to be choosing Madeline’s ex-husband over her. (How. Is. This. Possible?).\r\n\r\nCeleste is the kind of beautiful woman who makes the world stop and stare. While she may seem a bit flustered at times, who wouldn’t be, with those rambunctious twin boys? Now that the boys are starting school, Celeste and her husband look set to become the king and queen of the school parent body. But royalty often comes at a price, and Celeste is grappling with how much more she is willing to pay.\r\n\r\nNew to town, single mom Jane is so young that another mother mistakes her for the nanny. Jane is sad beyond her years and harbors secret doubts about her son. But why? While Madeline and Celeste soon take Jane under their wing, none of them realizes how the arrival of Jane and her inscrutable little boy will affect them all.\r\n\r\nBig Little Lies is a brilliant take on ex-husbands and second wives, mothers and daughters, schoolyard scandal, and the dangerous little lies we tell ourselves just to survive.\r\n\r\n“Ms. Moriarty’s long-parched fans have something new to dig into…Big Little Lies [may have] even more staying power than The Husband’s Secret.” The New York Times\r\n", "asin": "0425274861", "rank": "1178", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51raEVV%2BzrL.jpg", "country": "Australia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}