{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 207, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "ok"}, {"review_sentiment": 5.0, "review_text": "Wilson helps as we carry our history. Perhaps he illuminates how a few of us even calculate how to make it. Wilson creates a plausible, complex, and satisfying montage that connects the six decades at the fin de millennium through the lives and hatreds - and the loves - of a constellation clustered around Lisbon's finest. The ambiguity attached to justice around the edges makes it work."}, {"review_sentiment": 4.0, "review_text": "The past never dies. The impact of Nazi influences on current social realities might seem too thick for a mystery plot. However, Portuguese settings, German intrigue, a winsome detective all mix convincingly to create a solid entertaining read."}, {"review_sentiment": 4.0, "review_text": "Good story with flashbacks, enough violence and sex to keep you entertained, and wonderful justice that comes in unexpected ways"}, {"review_sentiment": 5.0, "review_text": "I am a big Robert Wilson fan. I am rereading a few of his books now that I have visited Lisbon and Savilla.I really enjoyed this book. Most North American's know so little about Spanish and Portuguese history.  It is a great read."}, {"review_sentiment": 2.0, "review_text": "Too much violence."}, {"review_sentiment": 4.0, "review_text": "Winner of the British Crime Writers’ Golden Dagger Award for 1999, “A Small Death in Lisbon”, involves two compelling, interwoven plot narratives which move back and forth in time. Inspector Jose Afonso Coehlo investigates the gruesome murder of a young woman in Lisbon, Portugal, 1998. In 1941, in Berlin, Germany, Oswald Lehrer, a high ranking Nazi, forcibly employs Klaus Felson, a German industrialist, to work for the Nazis in Portugal.Coehlo’s investigation leads to political intrigue, stolen wealth and powerful men who battle the morals of law and order in the complicated murder mystery full of unexpected twists.  The characters and the intertwining relationships are equally complex and detailed.  The style is terse though descriptive of characters, events, with historic scenes of Berlin and Portugal, and scenes of present day Lisbon.  The author doles out information in small but interesting doses."}, {"review_sentiment": 3.0, "review_text": "I was thoroughly confused while reading and after reading.  The locale changes were confusing enough let alone who was speaking when and where drove me into fits of annoyance.  The only thing that kept me reading was the headlong pace of the story.  Try this one at your own risk."}, {"review_sentiment": 5.0, "review_text": "I purchased this book in anticipation of a trip to Portugal. I did not get to it until I returned but found it cemented what I felt about the place and people. It portrays the citizenship as I experienced it and told a story which covered 50 years of history and many areas within the country. All in all, an enjoyable book with a. varied array of characters."}, {"review_sentiment": 5.0, "review_text": "Very interesting melding of modern crime drama with WWII history. Read it before going to visit Lisbon and did give some flavor of the city as well as some insight into Portuguese history in the 20th century."}]}, "authors": ["Robert C. Wilson"], "isbn": "0425184234", "longitude": 13.3888599, "periods": ["1900s"], "title": "A Small Death in Lisbon", "word_cloud": "ok help history perhaps illuminate even calculate make create plausible complex satisfying montage connects decade fin millennium life hatreds love constellation cluster finest ambiguity attach justice edge make work past never die impact influence current social reality thick mystery plot however portuguese setting german intrigue winsome detective mix convincingly solid entertaining good story flashback enough violence sex keep entertain wonderful justice come unexpected way big fan reread visit really enjoy most north american little spanish history great too much violence british involve compel interwoven plot narrative move back forth time investigate gruesome murder young woman high ranking forcibly employ german industrialist work investigation lead political intrigue steal wealth powerful men battle moral law order complicate murder mystery full unexpected twist character intertwine relationship equally complex detail style terse descriptive character event historic scene scene present day author doles information interesting dos thoroughly confuse read read locale change confuse enough let alone speak fit thing keep read headlong pace story risk purchase anticipation trip get return found cement felt place people portray citizenship experience tell story cover year history many area country enjoyable varied array character very interesting meld modern crime drama history go visit flavor city well insight history century", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII"], "summary": "A sex slaying in modern-day Lisbon. A secret in 1941 Berlin. The shocking connection makes this the most talked-about thriller in years.\r\n\r\nThis thriller follows centres on the unfolding of two stories – the investigation into the murder of a young girl in Lisbon and the tale of Klaus Felsen, a Nazi officer sent to Lisbon to gain supplies to support the war effort. The two stories seem seperate at first but over time begin to weave together in a fascinating, brutal unrelenting plot that earned it the prestigious Gold Dagger Award for the best mystery written in 1999.", "asin": "B008YFHVWI", "rank": "2546714", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51JcDWjXqsL.jpg", "country": "Germany", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}