{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 245, "rating": 3.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Good book"}, {"review_sentiment": 3.0, "review_text": "Not Gibson's best work, not by a long shot, and the fact that it follows Pattern Recognition, which is one of my favorite books makes it particularly galling.It feels like a retread of Count Zero: failed artist sent on a quest to uncover a piece of art. Of the three protagonists, Hollis and Tito are interesting, but I kept hoping Brown would kill Milgrim, the junkie, so I wouldn't have to read about him anymore. Flipping to his POV slowed the book significantly.In the end, the events of the book turn out to be a giant prank on the modern US intelligence apparatus orchestrated by Win Pollard (father of Cayce Pollard from the first book, though Gibson never comes out and says it)."}, {"review_sentiment": 5.0, "review_text": "Intelligence and color like this are so increasingly rare. Reading the final book in the trilogy already, and loving it."}, {"review_sentiment": 5.0, "review_text": "A tapestry of unique intriguing characters are woven together in this fascinating tale. Though Gibson is probably best known as a science-fiction writer this is a book that should appeal to those not particular fountains of the genre. And if you haven't read Gibson before you are in for quite a treat."}, {"review_sentiment": 3.0, "review_text": "Good interesting theme. Not as strong as footage work in the first one. Getting through the series fast. Thanks for the writing and excellent research work!"}, {"review_sentiment": 4.0, "review_text": "Backstage media-world intrigue, mystery and strong characters make this another good read. I love Gibson's world, of smart savvy people trying to find truth, and themselves."}, {"review_sentiment": 5.0, "review_text": "Gibson never disappoints. His transition from a \"theoretical future\" cyberpunk author to more of a real world, present day one didn't miss a beat."}, {"review_sentiment": 5.0, "review_text": "a bit different than earlier Gibson, but engaging nonetheless"}, {"review_sentiment": 5.0, "review_text": "Subtle and surprising, entertaining."}, {"review_sentiment": 5.0, "review_text": "Wonderfully atmospheric, intriguing, clever, and funny, with beautifully developed characters and a delightful web of ideas.  I was sad when it ended.  Thank goodness there's another one!"}]}, "authors": ["William Gibson"], "isbn": "0425226719", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Spook Country (Blue Ant)", "word_cloud": "good not best work long shot fact follow favorite make particularly feel retread fail artist sent quest uncover piece art protagonist interest keep hop junkie anymore flip slow end event turn giant prank modern intelligence apparatus orchestrate father first never come say color increasingly rare final trilogy already love tapestry unique intriguing character weave together fascinating tale probably best know writer appeal particular fountain genre quite treat good interest theme not strong footage work first get series fast write excellent research work intrigue mystery strong character make good love world smart savvy people try find truth never disappoint transition theoretical future cyberpunk author real world present day miss beat bit different earlier engage nonetheless surprising entertaining wonderfully atmospheric intrigue clever funny beautifully developed character delightful web idea sad end goodness one", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "What happens when old spies come out to play one last game?\r\n\r\nIn New York a young Cuban called Tito is passing iPods to a mysterious old man. Such activities do not go unnoticed, however, in these early days of the War on Terror and across the city an ex-military man named Brown is tracking Tito’s movements.\r\n\r\nMeanwhile in LA, journalist Hollis Henry is on the trail of Bobby Chombo, who appears to know too much about military systems for his own good. With Bobby missing and the trail cold, Hollis digs deeper and is drawn into the final moves of a chilling game played out by men with old scores to settle …\r\n\r\n\"A cool, sophisticated thriller.\" Financial Times \r\n", "asin": "0425226719", "rank": "441341", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41VpN0OQUoL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}