{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 60.1674086, "ratings": {"num_ratings": 59, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "Only four books and then he died with fifth almost completed. Thompson's Finland eternally-dark Finland was such a idea setting. Had all the making of a great series like Henning Mankell or Arnaldur Indridison even though of American birth married to a Finnish woman and teaching college there."}, {"review_sentiment": 2.0, "review_text": "Characters all over the place.  So soused they could not solve a mystery if they had to.  I am amazed I finished it."}, {"review_sentiment": 4.0, "review_text": "As good as his previous three in the series! Thompson blends action, suspense and a history of politics in Helsinki. Dark but but with touches of humor. I recommend the whole series."}, {"review_sentiment": 5.0, "review_text": "Wish there were more books in this series"}, {"review_sentiment": 3.0, "review_text": "ok"}, {"review_sentiment": 3.0, "review_text": "Very unbelievable to point of being laughable."}, {"review_sentiment": 4.0, "review_text": "Bogged down after the first three but still a good read. I hope there will be more in the series. Usually fast moving with lots of action and information for defense fans."}, {"review_sentiment": 5.0, "review_text": "It was a great book and a very nice author whom is deceased"}, {"review_sentiment": 5.0, "review_text": "I love every stunning book James Thompson writes.( Okay, I am an addict.)"}, {"review_sentiment": 4.0, "review_text": "Gorey but good."}]}, "authors": ["James Thompson"], "isbn": "0425264610", "longitude": 24.9425683, "periods": ["2000s", "Recent Releases"], "title": "Helsinki Blood (An Inspector Vaara Novel)", "word_cloud": "only die fifth almost complete idea setting have make great series even american birth marry finnish woman teach college character place so souse mystery amaze finish good previous series blend action suspense history politics touch humor recommend whole series wish series ok very unbelievable point laughable bogged first still good hope series fast move lot action information defense fan great nice author decease love stunning write addict good", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 4/5 in the An Inspector Vaara Novel Series\r\n\r\nAn Estonian woman begs Inspector Kari Vaara to find her daughter, Loviise, a young woman with Down syndrome who was promised work and a better life in Finland… and has since disappeared.\r\n\r\nOne more missing girl is a drop in the barrel for a police department that is understaffed and overburdened, but for Kari, the case is personal: it’s a chance for redemption, to help the victims his failed black-ops unit was intended to save, and to prove to his estranged wife, Kate, that he’s still the man he once was.\r\n\r\nHis search will lead him from the glittering world of Helsinki’s high-class clubs to the darkest circles of Finland’s underground trade in trafficked women and straight into the path of Loviise’s captors, who may be some of the most untouchable people in the country.", "asin": "0425264610", "rank": "572044", "city": "Helsinki", "image": "https://images-na.ssl-images-amazon.com/images/I/51FabYxR7sL.jpg", "country": "Finland", "story_arc": ["Tragedy", "Things only get worse"]}