{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 18597, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "One wants to read it till the end"}, {"review_sentiment": 5.0, "review_text": "Finished in a day. Couldn't put it down. I Definitely recommend this book, perfect book to keep you up way too late at night."}, {"review_sentiment": 5.0, "review_text": "This book is amazingly written with twists and turns, with characters that you can't wait to know. I became obsessed to see how it would turn out...and was totally surprised at every turn."}, {"review_sentiment": 5.0, "review_text": "She did iy again!  Liane played with my imagination, made me hate, made me love ,made me think in this story. Another classic. We just never know the path our lives will take. Wow!"}, {"review_sentiment": 5.0, "review_text": "Read in one sitting This book kept my attention and the twists and turns were amazing with such believable situations."}, {"review_sentiment": 5.0, "review_text": "Excellent book"}, {"review_sentiment": 5.0, "review_text": "Loved the book."}, {"review_sentiment": 5.0, "review_text": "Held my attention from the first page. Couldn’t wait to read every day. Very well written. The Husband’s Secret draws you in and keeps you there until the last word."}, {"review_sentiment": 3.0, "review_text": "It took a while to get into this book and I completed it only because it was part of our book club. Thank goodness for Kindle and the ability to look up characters! There were too many to keep track of."}, {"review_sentiment": 5.0, "review_text": "I loved how this book intertwined 3 stories into one."}]}, "authors": ["Liane Moriarty"], "isbn": "0425267725", "longitude": 151.2164539, "periods": ["2000s", "Recent Releases"], "title": "The Husband's Secret", "word_cloud": "want till end finish day put recommend perfect keep way late night amazingly write twist turn character become obsessed see totally surprised turn it play imagination make hate make make think story classic never know path life take wow sit kept attention twist turn amaze believable situation excellent love attention first page wait day very well write draw keep last word take get complete part club goodness ability look character many track love intertwined story", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "THE #1 NEW YORK TIMES BESTSELLER FROM THE AUTHOR OF BIG LITTLE LIES.\r\n\r\nMy darling Cecilia, if you’re reading this, then I’ve died...\r\n\r\nImagine that your husband wrote you a letter, to be opened after his death. Imagine, too, that the letter contains his deepest, darkest secret—something with the potential to destroy not just the life you built together, but the lives of others as well. Imagine, then, that you stumble across that letter while your husband is still very much alive...\r\n\r\nCecilia Fitzpatrick has achieved it all—she’s an incredibly successful businesswoman, a pillar of her small community, and a devoted wife and mother. Her life is as orderly and spotless as her home. But that letter is about to change everything, and not just for her: Rachel and Tess barely know Cecilia—or each other—but they too are about to feel the earth-shattering repercussions of her husband’s secret.\r\n\r\nAcclaimed author Liane Moriarty has written a gripping, thought-provoking novel about how well it is really possible to know our spouses—and, ultimately, ourselves.", "asin": "0425267725", "rank": "21681", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51khjRG1UXL.jpg", "country": "Australia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}