{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 35.6828378, "ratings": {"num_ratings": 179, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Great, great, great. Gibson, makes this visionary. Not sure how he does it. But a prescient vision with sudden changes punctuate the build up of two parallel  worlds..."}, {"review_sentiment": 4.0, "review_text": "The person who received the book as a gift enjoyed it!"}, {"review_sentiment": 4.0, "review_text": "William Gibson, true to form, has a talent for combining scary, often violent, scenarios with truly nice heros & heroines, who have more than average good luck."}, {"review_sentiment": 3.0, "review_text": "Solid writing with great ideas and some parallels to 2o17. Not as great as the initial Google glasses VR vision but very entertaining nonetheless."}, {"review_sentiment": 5.0, "review_text": "This is a unique and wonderful Cyber-punk novel. William Gibson knows how to jack into popular culture, and stream the reader inside the possibilities of tomorrows world like an expert hacker. Idoru is an amazing read."}, {"review_sentiment": 4.0, "review_text": "kept my interest.  Neat book. :)"}, {"review_sentiment": 5.0, "review_text": "Excellent description of what interactive data-rich virtual worlds could be and how a quantitative analyst could navigate them. Mostly a visual depiction, with good aural and textural layering. Book precedes contemporary smartphones and social media, yet in many ways leapfrogs them as the anachronisms they will surely become."}, {"review_sentiment": 3.0, "review_text": "It must be hard for an author to write in a genre they've already written the defining novel for, and while this novel doesn't quite match the heights of some of his earlier work, it's still a good cyber-punk read. It's quite a deceptive read, as the style feels quite light. The technology is mostly assumed as part of the world, and there's no great effort to explain or justify it. The story also has a weird, almost subdued beat.Those might sound like criticisms, but actually work in the book's favour. I didn't feel driven through the story, but languished through the plot. It also provides space to enjoy the writing itself, as well as the lives it portrays.It's relaxed approach doesn't always work, and in places it did feel that it was drifting along. The biggest issue with this is the ending, this felt unsatisfactory with some loose ends. More than that it seemed more like it just faded away.Overall I enjoyed it, but it lacked the depth and colour I appreciated from his earlier books."}, {"review_sentiment": 5.0, "review_text": "Hey guys get good game get great deals on the street from the move to the 55 the way it"}, {"review_sentiment": 2.0, "review_text": "Boring"}]}, "authors": ["William Gibson"], "isbn": "0425158640", "longitude": 139.7589667, "periods": ["2000s"], "title": "Idoru", "word_cloud": "great great make visionary not sure prescient vision sudden change punctuate parallel world person receive gift enjoyed true form talent combine scary often violent scenario truly nice hero heroine average good luck solid write great idea parallel not great initial glass vision entertain nonetheless unique wonderful know jack popular culture stream possibility tomorrows world expert hacker amazing kept interest neat excellent description interactive virtual world analyst visual depiction good aural textural layer precedes contemporary smartphones social medium yet many way leapfrog anachronism surely become author write genre already write define quite match height earlier work still good quite deceptive style feel quite light technology mostly assume part world great effort explain story also weird almost subdue criticism actually work favor feel driven story languish plot also provide space enjoy write well live relaxed approach always work place feel drift biggest issue end felt unsatisfactory loose end more seemed faded enjoy lack color appreciate earlier guy get good game great deal street move way bore", "genres": ["Fiction & Literature", "Mystery & Suspense", "Science Fiction"], "summary": "Book 2/3 in the Bridge Trilogy Series\r\n\r\n2lst century Tokyo, after the millennial quake. Neon rain. Light everywhere blowing under any door you might try to close. Where the New Buildings, the largest in the world, erect themselves unaided, their slow rippling movements like the contractions of a sea-creature.\r\n\r\nColin Laney is here looking for work. He is not, he is careful to point out, a voyeur. He is an intuitive fisher of patterns of information, the \"signature\" a particular individual creates simply by going about the business of living. But Laney knows how to sift for the interesting (read: dangerous) bits. Which makes him very useful--to certain people.\r\n\r\nChia McKenzie is here on a rescue mission. She's fourteen. Her idol is the singer Rez, of the band Lo/Rez. When the Seattle chapter of the Lo/Rez fan club decided that he might be in trouble, in Tokyo, they sent Chia to check it out.\r\n\r\nRei Toei is the beautiful, entirely virtual media star adored by all Japan. The idoru. And Rez has declared that he will marry her. This is the rumor that brought Chia to Tokyo. But the things that bother Rez are not the things that bother most people. Is something different here, in the very nature of reality? Or is it that something violently New is about to happen?\r\n\r\nIt's possible the idoru is as real as she wants or needs to be--or as real as Rez desires. When Colin Laney looks into her dark eyes, trying hard to think of her as no more than a hologram, he sees things he's never seen before. He sees how she might break a man's heart.\r\n\r\nAnd, whatever else may be true, the idoru and the powerful interests surrounding her are enough to put all their lives in danger.", "asin": "0425158640", "rank": "388155", "city": "Tokyo", "image": "https://images-na.ssl-images-amazon.com/images/I/41j7HmH0twL.jpg", "country": "Japan", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}