{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 131, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Exciting,thrilling and “revealing” didn’t know Kennedy was ready to give up Berlin and how general clay of “airlift fame” , came to save the city from being overrun. Very gutsy and telling story! Can ya tell I loved it? :)"}, {"review_sentiment": 5.0, "review_text": "A+A+"}, {"review_sentiment": 3.0, "review_text": "Awkwardly written. Much repetition. Not historical fiction but sort of tried. Makes some assumptions but presents as facts. Does paint Kennedy in a new light."}, {"review_sentiment": 5.0, "review_text": "I was too young to appreciate events that unfolded in Berlin in 1961 but I knew they were momentous.  This great book provides context to the many crises that arose here between East and West and the great tensions it generated.  It does not paint a flattering portrait of the young, inexperienced, and macho-obscessed JFK.  Fascinating story."}, {"review_sentiment": 5.0, "review_text": "Frederick Kempe's Berlin 1961: Kennedy, Khrushchev, and the Most Dangerous Place on Earth ably tells the story of the only time in the long and often-harrowing Cold War--aside, say, from the Soviet \"volunteer\" MiG pilots of the Korean War or the occasional shoot-down of American reconnaissance aircraft along the borders of the U.S.S.R.--that U.S. and Soviet military forces actually faced each other down directly. Of course, even then, however, at that iconic moment photographed across Checkpoint Charlie, Kempe reminds us that in a nod to \"plausible deniability,\" the Red Army's tanks had their national insignia painted over and their crews' uniforms replaced with black garb similarly without markings.Sandwiched between President Kennedy's humiliating Bay of Pigs fiasco in April 1961 and his triumph in the October 1962 Cuban Missile Crisis, the Berlin Crisis of 1961 is, I think, significantly less remembered. Europe, however, of course was the focus of U.S. Cold War policy and planning, from the Marshall Plan and the formation of the North Atlantic Treaty Alliance, through another forty years of standoff along the Iron Curtain, when any incursion by numerically superior Soviet forces would have required U.S. use of tactical nuclear weapons...which, indeed, even aside from civilian death and radioactive contamination in that highly populated region, could have led to general nuclear war.Kempe puts the 1961 Berlin Crisis into perspective with Kennedy's irresoluteness in Cuba just the year earlier, and yet he does not neglect to remind us either of the Berlin Blockade of 1948 and '49, which General Lucius Clay broke with his unprecedented airlift, or the Soviet repressions of rebellion in East Germany in 1953 or in Hungary in 1956. The world was a perilous place, and although Nikita Khrushchev may have been rather less brutal then Josef Stalin, the Eastern Bloc still was no haven of socialist peacenikism; Communism was on the march in the postwar and postcolonial world, and the increasing hemorrhage of refugees, especially those of the skilled and professional classes, from East Berlin into the Western sector, and thence into the thriving West Germany, was more than embarrassing--it was dangerous to the continuation of the repressive yet so-called German \"Democratic\" Republic.Indeed, Kempe notes that, contrary to the notion at the time that the Soviets pulled all the strings of their puppet, it was East German leader Walter Ulbricht who advocated the closure of the border with West Berlin and ultimate construction of the Berlin Wall, with Khrushchev finally agreeing after a fair bit of convincing. The final decision, naturally, was clinched by the Soviet leader's shrewd evaluation of Kennedy's weakness of resolve, as demonstrated by either failing to nix a Bay of Pigs invasion scheme that he should have known would not work or following up and actually using U.S. military force to win. Had Soviet tanks scrupled in East Germany in '53, after all, or in Hungary in '56?--no. Khrushchev thought he had sized up his mark correctly--a judgment Kempe shares--and if eventually the weak-willed West let its treaty rights to Berlin be narrowed and narrowed such that at last they might leave West Berlin altogether, well, then so much the better.The Western thought, though, was that if the United States would not guarantee the island of freedom that was West Berlin, as was its right and duty under the current four-power treaty, then neither would it hold the line when the Communists, first with niggling little economic and political nibbles and then perhaps even by military force, pushed at West Germany, then the Low Countries, then Italy, and maybe even nuclear-armed France and Britain, and so on. The Soviet thought, it was clear from previous and also contemporary behavior, was similar. Khrushchev's talk was big and bold and bluff, and no one wanted full-scale nuclear war over what was already mostly a fait accompli...but the West had to stand for something, did it not? For otherwise the West ultimately would fall.In his account Frederick Kempe covers the large and the small, the broadly known and the obscure, from big players like Kennedy and Khrushchev, Adenauer and Ulbricht, Macmillan and de Gaulle, and Rusk and Acheson, to the stories of East Berliners who did and did not escape, and Americans who faced down Soviet tanks and even slipped across to confirm the Cyrillic on the unmarked vehicles' controls. We will learn of Kennedy's request to retailor the traditional U.S. \"massive retaliation\" war plan for a possible limited preemptive strike against Soviet nuclear forces, of Bobby's always-oral \"back-channel\" discussions with a Soviet spy who had a direct line to Khrushchev, and, perhaps even more surprisingly, and of the President's first, rather private reaction, that, Western rights under the four-power treaty be damned, the unprecedented closure of the East-West border in Berlin was not really of much concern at all; this latter is particularly eye-opening and disheartening.Occasionally a mistake might slip through, as when Kempe claims that the 50-megaton Tsar Bomba that Khrushchev tests is only 10 times more powerful than the combination of Hiroshima and Nagasaki weapons rather than over 1000 times, or when he refers to fully loaded rounds of ammunition merely as bullets. None of these very few instances, however, truly detracts from the exciting and informative Berlin 1961, which shows how the Kennedy--and the nervous world at large--got from the indecisiveness and naivety and failure of early 1961 to the proud \"Ich bin ein Berliner\" speech of 1963."}, {"review_sentiment": 5.0, "review_text": "This was very interesting and well written. Wife said it was Excellent."}, {"review_sentiment": 3.0, "review_text": "The book is very very well written facinating thoroughly researched but totaly biased against Kennedy. People with views like kemp brought the US to Vietnam with their convictions and lack of caution"}, {"review_sentiment": 3.0, "review_text": "A good relating of the events leading up to the creation of the Berlin Wall, the iconic symbol of Communism in Europe. Most of us know about the Cuban Missile Crisis, but we tend to forget what went on in Berlin. The author may have missed a few facts here and there, but overall it's an excellent historical picture of the event and the time...and the four personalities involved: Kennedy, Khrushchev, Honecker and Adenauer. It's interesting to hear what went through Kennedy's mind when the wall went up, why he didn't just order a bunch of bulldozers to knock it down. Actually I'd give this a four star review, except that the audio narration (I listened to the audio book) was quite irritating. The narrator had a quirk of speech where he habitually dropped the ending consonant of many words. Hence \"Congress\" was pronounced \"Con-greh\", and such."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed this book on the Berlin crisis and Kennedy's response. It had excellent portraits of the various leaders and was well written."}, {"review_sentiment": 5.0, "review_text": "As a 7-year old in 1961 my heroes were Daniel Boone and Mickey Mantle, and, depending on what the Mick did the night before, not necessarily in that order. Only later did JFK take his place beside them. As I got older I learned that heroes are not born, they are made - by events and the times. While certainly a flawed human being, John Kennedy ultimately proved himself to be both a pragmatist and a hero. This book is a must-read for anyone who grew up worshipping the Mick but never really knew what had to be done by JFK so we could be around to read about it."}]}, "authors": ["Frederick Kempe"], "isbn": "0425245942", "longitude": 13.3888599, "periods": ["1900s"], "title": "Berlin 1961: Kennedy, Khrushchev, and the Most Dangerous Place on Earth", "word_cloud": "excite thrill reveal know ready give general clay airlift fame come save city overrun very gutsy tell story love awkwardly write much repetition not historical fiction sort try assumption present fact new light young appreciate event unfolded know momentous great provide context many crisis arise great tension generate flatter portrait young inexperienced story ably tell story time long aside say soviet volunteer pilot occasional american reconnaissance aircraft border soviet military force actually face directly course even however iconic moment photograph remind nod plausible deniability tank national insignia paint crew uniform replace black garb similarly humiliate fiasco triumph think significantly le remember however course focus policy plan formation forty year standoff incursion numerically superior soviet force require tactical nuclear weapon indeed even aside civilian death radioactive contamination highly populated region general nuclear put perspective irresoluteness year earlier yet neglect remind break unprecedented airlift soviet repression rebellion world perilous rather le brutal still socialist peacenikism postwar postcolonial world increase hemorrhage refugee especially skilled professional class sector thence thrive embarrass continuation repressive yet democratic note contrary notion time pull string puppet east german leader advocate closure border ultimate construction finally agree fair bit convince final decision naturally clinch soviet leader shrewd evaluation weakness resolve demonstrate fail nix invasion scheme know follow actually use military force win tank scruple think size mark correctly judgment share eventually let right narrow narrow last altogether well much think island freedom right duty current treaty line first niggle little economic political nibble perhaps even military force push maybe even think clear previous also contemporary behavior similar talk big bold bluff want nuclear war already mostly fiat accomplice stand something otherwise ultimately cover large small broadly know obscure big player story escape face soviet tank even slip confirm unmarked vehicle control learn request retailer traditional massive retaliation war plan possible limited preemptive strike soviet nuclear force discussion spy direct line perhaps even surprisingly first rather private reaction right treaty damn unprecedented closure border really much concern latter particularly claim test time powerful combination weapon rather time refers fully load round ammunition merely bullets none instance however truly detract exciting informative show nervous world large get indecisiveness naivety failure early proud bin an speech interesting well write say excellent well write fascinate thoroughly research total bias view kemp bring conviction lack caution good relating event lead creation iconic symbol know tend go author fact overall excellent historical picture event time personality involve interest hear go mind wall go order bunch bulldozer knock actually give star review audio narration listen audio quite irritate narrator quirk speech habitually drop end consonant many word pronounce really enjoy crisis response excellent portrait various leader well write old hero depend night necessarily order only later get older learn hero bear make event time certainly flaw human ultimately prove pragmatist hero anyone grow worship never really do", "genres": ["History"], "summary": "In June 1961, Nikita Khrushchev called Berlin \"the most dangerous place on earth.\" He knew what he was talking about.\r\n\r\nMuch has been written about the Cuban Missile Crisis a year later, but the Berlin Crisis of 1961 was more decisive in shaping the Cold War-and more perilous. It was in that hot summer that the Berlin Wall was constructed, which would divide the world for another twenty-eight years. Then two months later, and for the first time in history, American and Soviet fighting men and tanks stood arrayed against each other, only yards apart. One mistake, one nervous soldier, one overzealous commander-and the tripwire would be sprung for a war that could go nuclear in a heartbeat.\r\n\r\nOn one side was a young, untested U.S. president still reeling from the Bay of Pigs disaster and a humiliating summit meeting that left him grasping for ways to respond. It would add up to be one of the worst first-year foreign policy performances of any modern president. On the other side, a Soviet premier hemmed in by the Chinese, East Germans, and hardliners in his own government. With an all-important Party Congress approaching, he knew Berlin meant the difference not only for the Kremlin's hold on its empire-but for his own hold on the Kremlin.\r\n\r\nNeither man really understood the other, both tried cynically to manipulate events. And so, week by week, they crept closer to the brink.\r\n\r\nBased on a wealth of new documents and interviews, filled with fresh-sometimes startling-insights, written with immediacy and drama, Berlin 1961 is an extraordinary look at key events of the twentieth century, with powerful applications to these early years of the twenty-first.\r\n\r\nIncludes photographs", "asin": "0425245942", "rank": "264687", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51T9f87CD6L.jpg", "country": "Germany", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}