{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 55.7507178, "ratings": {"num_ratings": 431, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Good book"}, {"review_sentiment": 3.0, "review_text": "The build up is good, the ending weak, particularly as it builds so much on finding an email address. I didn't know until finishing that this is part of a series."}, {"review_sentiment": 5.0, "review_text": "Greatest marketing thriller novel ever!"}, {"review_sentiment": 3.0, "review_text": "Make no mistake: Gibson is a literary genius. His prose is original, multi-faceted, oblique, intelligent, poetic, and at times arrestingly brilliant.However, Gibson's innate talent for observation makes him lazy with story craft at times, and in Pattern Recognition he gets by with a plot that wouldn't have been published if it were written in ordinary language.There's much to enjoy here on the fine, micro level of description, with Gibson's sense for metaphor and syntactic novelty. On the macro, narrative level, though, the plot fails to entertain or even hold interest.Gibson is worth reading for his strikingly original way of seeing. If the story is any good, that's an added bonus. That isn't the case here."}, {"review_sentiment": 5.0, "review_text": "As usual, great story and excellent writing."}, {"review_sentiment": 4.0, "review_text": "Good Gibson stuff - I gave it a 4 instead of a 5 because the ending seemed too hastened - sort of as if the author was thinking \"OK, I'm done with this and I just want to wrap it up.\""}, {"review_sentiment": 5.0, "review_text": "An awesome read especially if you like Gibson or marketing and advertising."}, {"review_sentiment": 5.0, "review_text": "... Wait, no, maybe I'm wrong. How could this be better than Count Zero? Maybe not. Better than Neromancer? Could that be? So his work is really hard to rate or compare, but Pattern Recognition, in what seems to be a trilogy of sorts, is  stupendous and wonderful.Characters are deliciously drawn. The mystery unravels at a pace that is pitch perfect. The sadness and strange subtle shift of America after 9/11 is captured in a way that other authors haven't touched, which is interesting considering that the novel takes us from London to Tokyo, and Moscow, to Paris.I love this world. I can't wait to read the book or the books that are going to connect his most recent texts - those set in our present - back to those that are set in the near future, and the still far future of his earlier work.Maestro, thanks."}, {"review_sentiment": 5.0, "review_text": "good writer"}, {"review_sentiment": 5.0, "review_text": "I'm a fan of Mr. Gibson's works in all their varied forms and flavors. The Blue Ant stories are my favorites. I especially enjoy the concept of CPU's. I favor logoless apparel so this resonates with me.I hope you enjoy these stories as much as I do."}]}, "authors": ["William Gibson"], "isbn": "0425198685", "longitude": 37.6176606, "periods": ["2000s"], "title": "Pattern Recognition", "word_cloud": "good build good end weak particularly build much find email address know finish part series greatest marketing thriller ever mistake literary genius prose original oblique intelligent poetic time arrestingly innate talent observation make lazy story craft time get plot write ordinary much enjoy fine micro level description sense metaphor syntactic novelty macro narrative level plot fails entertain even hold worth read strikingly original way see story good add bonus case usual great story excellent write good stuff give instead end seem hastened sort author think ok do want wrap awesome especially marketing advertising maybe wrong better really hard rate compare seem trilogy sort stupendous deliciously draw mystery unravels pace pitch perfect sadness strange subtle shift capture way author touch interest consider take world go connect recent text set present back set future still far future earlier thanks good writer fan work vary form flavor stories favorites especially enjoy concept favor logo less apparel resonates hope story much", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Pattern Recognition is a novel by science fiction writer William Gibson published in 2003. Set in August and September 2002, the story follows Cayce Pollard, a 32-year-old marketing consultant who has a psychological sensitivity to corporate symbols. The action takes place in London, Tokyo, and Moscow as Cayce judges the effectiveness of a proposed corporate symbol and is hired to seek the creators of film clips anonymously posted to the internet.\r\n\r\nThe novel's central theme involves the examination of the human desire to detect patterns or meaning and the risks of finding patterns in meaningless data. Other themes include methods of interpretation of history, cultural familiarity with brand names, and tensions between art and commercialization. The September 11, 2001 attacks are used as a motif representing the transition to the new century. Critics identify influences in Pattern Recognition from Thomas Pynchon's postmodern detective story The Crying of Lot 49.\r\n\r\nPattern Recognition is Gibson's eighth novel and his first one to be set in the contemporary world. Like his previous work, it has been classified as a science fiction and postmodern novel, with the action unfolding along a thriller plot line. Critics approved of the writing but found the plot unoriginal and some of the language distracting. The book peaked at number four on the New York Times Best Seller list, was nominated for the 2003 British Science Fiction Association Award, and was shortlisted for the 2004 Arthur C. Clarke Award and Locus Awards.", "asin": "0425198685", "rank": "58735", "city": "Moscow", "image": "https://images-na.ssl-images-amazon.com/images/I/51opr090L7L.jpg", "country": "Russia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}