{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 60.1674086, "ratings": {"num_ratings": 59, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "I probably enjoyed the story more than most as I have been to Helsinki and could relate to the geography in the story."}, {"review_sentiment": 5.0, "review_text": "A cross between Ellroy and Connelly, Thompson has created a twisted police procedural set in a Helsinki midwinter with murders and scandals galore."}, {"review_sentiment": 5.0, "review_text": "Grimdark Finnish police procedural, this was my first Inspector Kari Vaara mystery, and I've ordered three more (including the first one).  There's plenty of off-screen sex, which, in a first person narrative, isn't very graphic.  The violence is fairly visceral, without much description, so it's mostly in the mind of the reader (in a first person narrative, it's at one remove, and without more than minimal detail, it's at two removes.  Renowned police detective Vaara has a politically sensitive murder to solve, and a suspect captured and ready to be convicted of it- if the husband of the victim has his way about it, and the political \"fix\" is in.  But the detective, ever ready to protect the innocent, thinks the evidence doesn't add up to the jailed man turturing and killing his girlfriend.  And why do the powers that be want a quick investigation and conviction?  Additional woes add to the Detective's interesting life- his wife is pregnant with what will be his first child, if all goes well, and his wife's American brother and sister arrive to visit their sister, and create as much chaos as only family can do!"}, {"review_sentiment": 5.0, "review_text": "Wish there were more books in this series"}, {"review_sentiment": 2.0, "review_text": "The story seems to lack any kind of moral center: If I were to judge Finland on what I read in its pages, I would believe the Finnish people are corrupt and cynical."}, {"review_sentiment": 4.0, "review_text": "Kari Vaara is a police detective in Finland. His partner is Milo, an unorthodox and extremely intelligent police officer - he is also a little bit scary. Vaara and Milo are assigned a murder where a woman was found murdered in her bed - bound and severely beaten. The boyfriend (sex partner) was lying next to her and awoke to find her dead. Did he do it? Or is he being framed?There is a subplot dealing with an official request from Germany and their request to extradite Finland's oldest WWll military survivor, a 90 year old decorated hero, Arhmad who is  under suspicion of direct involvement in the deaths of Jewish and Russian prisoners during the war. It seems that Arhmad was a good friend of Kari's grandfather - so he is doubly invested in learning what happened.Also, at the same time, Kari's wife is due to give birth any day... and her brother and sister come to Finland from the US to be with her as a support. Only doesn;t turn out quite that wayMuch going, lots of twist and turns - and I learned a lot about Finnish history during WWII"}, {"review_sentiment": 4.0, "review_text": "I'm a hard sell when it comes to action detective novels. This one was a pleasant surprise. I pulled it out of my massive unread box of books and I'm now looking for the rest of the series. This detective is gritty, real, and has an outlook that while not rosy is a real \"In your face\" look at life. He's been through hell and it shows.It starts out as a regular \"I didn't do it, someone knocked me out\" homicide and turns into a real whodunnit. All the while he's looking into whether his grandpa is a Holocaust Killer. Looking forward to the rest when they get here."}, {"review_sentiment": 4.0, "review_text": "Winter in Helsinki isn't for the faint of heart - neither is the investigation of murder. Thompson's protagonist finds himself painted into a corner by the killer and his political cronies as the clock counts down to the birth of his daughter and his wife's difficult relatives come to visit."}, {"review_sentiment": 5.0, "review_text": "James Thompson spins quite a story. Set in Finland, this is a fast paced, well written Nordic mystery. I enjoyed it immensely."}, {"review_sentiment": 5.0, "review_text": "Got lost in my reading and read this one twice. Enjoyed it both times. Constant excitement for the armchair agent."}]}, "authors": ["James Thompson"], "isbn": "042524539X", "longitude": 24.9425683, "periods": ["2000s", "Recent Releases"], "title": "Lucifer's Tears (Inspector Vaara Novels)", "word_cloud": "probably enjoy story geography story cross create twisted police procedural set midwinter murder scandal galore police procedural first mystery order include first plenty sex first person narrative graphic violence fairly visceral much description mostly first person narrative remove minimal detail remove renowned police detective politically sensitive murder solve suspect capture ready convict husband victim way political fix detective ever ready protect innocent think evidence add jail man nurture kill girlfriend power want quick investigation conviction woe add interesting wife pregnant first child go well wife american brother sister arrive visit sister create much chaos family wish series story seem lack kind moral center judge page finnish people corrupt cynical police detective partner unorthodox extremely intelligent police officer also little bit scary assign murder woman find murder bed bound severely beat boyfriend sex partner lie next awoke find dead subplot deal official request request extradite oldest military survivor year old decorate hero suspicion direct involvement death jewish russian prisoner war seem good friend grandfather doubly invest learning time wife due give birth day sister come support only quite way much go lot twist turn learn lot finnish history hard sell come action detective novel pleasant surprise pull massive unread box look rest series detective gritty real outlook rosy real face look life hell start regular someone knock homicide turn real whodunit look grandpa forward rest get faint heart investigation murder protagonist find paint corner political crony clock count birth daughter wife difficult relatives come visit spin quite story fast pace well write mystery enjoy immensely lose read twice time constant excitement armchair agent", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 2/5 in the An Inspector Vaara Novel Series\r\n\r\nInspector Kari Vaara has left the Arctic Circle and returned- reluctantly-to Helsinki, where headaches and sleeplessness plague him. But he must work through the pain. He has two cases on his plate: the brutal murder of a Russian businessman's wife, and-more secretively-an investigation into an elderly Finnish national hero who may have played a darker role in World War II than the public knows. Vaara's past has turned him into a haunted man. The questions he's asking now may turn him into a hunted man as well...", "asin": "042524539X", "rank": "1376529", "city": "Helsinki", "image": "https://images-na.ssl-images-amazon.com/images/I/51WacY93ChL.jpg", "country": "Finland", "story_arc": ["Tragedy", "Things only get worse"]}