{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 163, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "Gibson wrapped up his Bridge Trilogy (Virtual Light, Idoru, & All Tomorrow's Parties) with this book. I really liked the way Gibson blended the old characters with some new ones in this saga of the life and death of a post-earthquake SF Golden Gate bridge-based temporary autonomous zone (Google that term if you don't know what a TAZ is) and the people who live in it. Scifi, cybe-rmysticism, corporatism, antique watches, and the use and abuse of the internet are all  featured in this entertaining wrap up."}, {"review_sentiment": 4.0, "review_text": "This product logistics is very fast, I am very satisfied with it, the price is cheap, quality is very good for anyone.  This product lives up to its description.  They are much prettier than I expected.  These have proved to be reliable  Works great, no problems so far  Everyone needs these"}, {"review_sentiment": 5.0, "review_text": "I found that the cyber-punk world painted is not unoike the current arch of our world. The story is shaped so you fall in to the world of the story and need not to find reason."}, {"review_sentiment": 4.0, "review_text": "Not Gibson's strongest outing, but I like him a lot and this one kept my attention.  It's a nice sequel to the Bridge Series and wraps up some hanging character threads."}, {"review_sentiment": 5.0, "review_text": "Fantastic, thank you!"}, {"review_sentiment": 5.0, "review_text": "William Gibson creates such a vivid landscape in which we operate along with his characters.  It's always a future we can envision and the trip on which we're taken can be suspenseful, thrilling and satisfying.It's impossible to ignore anything he's written and I wouldn't recommend it...you may miss something vital."}, {"review_sentiment": 5.0, "review_text": "A fine wrap up to Gibson's Bridge Trilogy"}, {"review_sentiment": 5.0, "review_text": "Pure Gibson"}, {"review_sentiment": 2.0, "review_text": "Had some likeable characters but felt aimless. Made no real point. I'm a huge Gibson fan but I think this one of the inflection points in his career where he seems to have fired his editor and gone off the deep end as far as rambling messes. Read it to finish out the series but don't expect much, his newer work like The Peripheral is even worse."}, {"review_sentiment": 5.0, "review_text": "Classic Gibson, love it.  My favorite sci fi author."}]}, "authors": ["William Gibson"], "isbn": "0425190447", "longitude": -122.4192363, "periods": ["2000s"], "title": "All Tomorrow's Parties", "word_cloud": "wrap really like way blend old character new one saga life death temporary autonomous zone term know people live corporatism antique watch use internet feature entertaining wrap product logistics fast satisfy price cheap quality good anyone product live description much prettier expect prove reliable great problem far need find world paint unlike current arch world story shape fall world story need find reason not strongest out lot kept attention nice sequel wrap hang character thread thank create vivid landscape operate character always future envision trip take suspenseful thrill impossible ignore anything write something vital fine wrap likable character felt aimless make real point huge fan think inflection point career seem fire editor go deep end far ramble mess finish series expect much newer work even worse classic favorite sci phi author", "genres": ["Fiction & Literature", "Mystery & Suspense", "Science Fiction"], "summary": "Book 3/3 in the Bridge Trilogy Series\r\n\r\nThe flow of information is about to be disrupted…\r\n \r\nColin Laney, sensitive to patterns of information like no one else on earth, currently resides in a cardboard box in Tokyo. His body shakes with fever dreams, but his mind roams free as always, and he knows something is about to happen. Not in Tokyo; he will not see this thing himself. Something is about to happen in San Francisco…\r\n\r\n \r\n\r\nThe mists of San Francisco make it easy to hide, if hiding is what you want, and even at the best of times reality there seems to shift. A gray man moves elegantly through the mists, leaving bodies in his wake, so that a tide of absences alerts Laney to his presence. A boy named Silencio does not speak, but flies through webs of cyber-information in search of the one object that has seized his imagination. And Rei Toi, the Japanese Idoru, continues her study of all things human. She herself is not human, not quite, but she’s working on it. And in the mists of San Francisco, at this rare moment in history, who is to say what is or is not impossible…", "asin": "0425190447", "rank": "550966", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/412638N0RFL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}