{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 60.1674086, "ratings": {"num_ratings": 69, "rating": 3.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Extraordinary. Insightful and well constructed"}, {"review_sentiment": 5.0, "review_text": "Vaara's development as a character is intriguing, and like real life, is all the more so because of the inconsistencies in his behavior and attitudes. While Vaara is offended by other character's concerns over immigrant problems in Finland, which are quite real, he is willing to befriend a national hero who is guilty of war crimes and  Finland's contribution to the murder of Finland's Jewish population in WWII."}, {"review_sentiment": 4.0, "review_text": "Very violent and dark. More so than I likeThe characters are well written thoughKari Vaar is the main character. He is given lead on a new team - one that is supposed to not have to play by all of the rules. He wants to do good - to help people. It doesn;t exactly turn out that way"}, {"review_sentiment": 5.0, "review_text": "Wonderful series!  I loved it!  Rose Hanscom"}, {"review_sentiment": 3.0, "review_text": "Having worked in Helsinki, I enjoyed the environmental detail.  But overall, the writing style is a little choppy.  The story was good, but the violence was disconcerting to this reader.  It was hard for me to care about most of the characters.  I don't think I'll read another one."}, {"review_sentiment": 4.0, "review_text": "The hate we have experienced in the USA in the last few months also thrives in European countries as this book illustrates.  I love Finland as the land of my ancestors and always thought it was similar In values as we profess to have in Minnesota.  It's disillusioning for me to read about the hate."}, {"review_sentiment": 4.0, "review_text": "A gripping story. A little too much detail on surveillance and high tech weaponry to make the story real. Some characters seem real others exaggerated James Bond like stereotypes. The mix doesn't,quite fit. Some of the commentary on the rise of extremism and hate mongering might have been more compelling with a better plot and characters. Still a good read."}, {"review_sentiment": 1.0, "review_text": "Terrible.  Jim has really gone off the rails with this one, i.e. a totally rogue police force that is worse than any criminal activities in Finland.Unbelievable  tale; kept reading, hoping it would get somewhere but all it did was crash."}, {"review_sentiment": 4.0, "review_text": "very satisfied"}, {"review_sentiment": 5.0, "review_text": "This is an excellent noir character novel in the guise of a police procedural.  I haven't a clue as to whether the author gets modern Finland right, but as a study in a band of misfits operating as an off the books thug squad with badges the book rocks.  The pace is fast and the characters are so much fun that the linear dungeon crawl plot fades into the background.  There are no good guys but there are just so many shades of bad and twisted."}]}, "authors": ["James Thompson"], "isbn": "0425253449", "longitude": 24.9425683, "periods": ["2000s", "Recent Releases"], "title": "Helsinki White", "word_cloud": "extraordinary well construct development character intrigue real life inconsistency behavior attitude offend character concern immigrant problem quite real willing befriend national hero guilty war crime contribution murder population very violent dark more like the character well write main character give lead new team suppose play rule want good help people exactly turn way wonderful series love have work enjoy environmental detail overall writing style little choppy story good violence disconcert hard care character think one hate experience last month also thrive european country illustrate love land ancestor always think similar value profess disillusion hate gripping story little much detail surveillance high tech weaponry make story real character seem real others exaggerate stereotype mix quite fit commentary rise extremism hate mongering better plot character still good terrible really go rail totally rogue police force worse criminal activity tale keep read hop somewhere crash satisfied excellent nor character guise police procedural clue author get modern right study band misfit operate thug squad badge rock pace fast character much fun linear dungeon crawl plot fade good guy many shade bad twist", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 3/5 in the An Inspector Vaara Novel Series\r\n\r\nInspector Kari Vaara, recovering from brain surgery, is back to doing police work—under circumstances most cops only dream of. Reporting directly to the national chief of police, Kari and his partners Milo and Sulo have been granted secrecy and autonomy for their new black-ops unit, and plenty of cash to work with, including whatever they can steal from Helsinki’s mobsters.\r\n\r\nBut Kari's team is too good, and their actions have unintended consequences...The president of Finland wants the team on a new case: the vicious assassination of a prominent immigrants' rights activist. Against a backdrop of simmering hatred spreading across the country, Kari must solve a case that involves the kidnapping of a billionaire’s children, a Faustian bargain with a former French Legionnaire—and his own wife.\r\n\r\n“Thompson's style is on the dark end of the ‘Nordic Noir’ spectrum. The genre — with its stark and often violent police procedurals — has proved wildly successful…The marquee names have come from Sweden — think Stieg Larsson's Girl With The Dragon Tattoo, or Henning Mankell's Wallander series — but Norway's Jo Nesbo and Iceland's Arnaldur Indridason and Yrsa Sigurdardottir have also made their mark with international readers. Thompson stands out from that crowd by writing in English and telling Vaara's gritty narrative in the first person. ” The New York Times", "asin": "0425253449", "rank": "1273496", "city": "Helsinki", "image": "https://images-na.ssl-images-amazon.com/images/I/51dywp7knhL.jpg", "country": "Finland", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}