{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 563, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Tom Clancy and Scott Brick hit this one out of the park! I've read the novel. Watched the movie! Now! I have listened to this excellent novel in audiobook! It just keeps getting better!"}, {"review_sentiment": 5.0, "review_text": "I had skipped these Clancy books that had been made into movies. What a mistake. This was so much better than the film."}, {"review_sentiment": 5.0, "review_text": "Patriot Games was a really good read. It had a fast paced plot that never backed down. This story was written at a time where the IRA was really active and this made the book even more realistic. Tom Clancy did a wonderful job coordinating several well crafted characters though many plot twists. I like how Clancy treated the English people. It was clear that he ad a deep respect for the crown and this gave me a lot to think about. I have read this book twice now and have gotten new insights from it.  A definite recommended read."}, {"review_sentiment": 5.0, "review_text": "Excellent book!"}, {"review_sentiment": 5.0, "review_text": "I very much enjoyed this book and now I can listen to it"}, {"review_sentiment": 4.0, "review_text": "Ok, so, I am going to give this a 4-star, mainly coz I love military actions books... I think Jack Ryan, the character, did not impress me much on the action front. I guess that is to be expected since he is more of an intelligence analyst.. But somehow, I thought his involvement in some action sequences would have impressed me to give a 5 star.. That being said, I liked some of the other characters like Breckenridge and even Sean Miller for their ruthless attitudes..I had read \"Without Remorse\", and I liked its action sequences more since the hero actively participated in them.. But I did not see any connection, except that of Admiral Greer, between the first and second books of this series..Maybe , when I move on to the other books, I might see a connection..PS : I believe 'Jack Reacher' has tarnished all other action/military heroes for me !!! :D"}, {"review_sentiment": 1.0, "review_text": "I couldn't even finish it.  Boring storyline and stiff characters."}, {"review_sentiment": 5.0, "review_text": "One of Tom's best!!Great action at the end."}, {"review_sentiment": 5.0, "review_text": "Very good!"}, {"review_sentiment": 1.0, "review_text": "Sophomoric"}]}, "authors": ["Tom Clancy"], "isbn": "042526940X", "longitude": -0.12574, "periods": ["1900s"], "title": "Patriot Games", "word_cloud": "hit park watch movie now listen excellent audio book keep get better skip make movie mistake much better film really good fast pace plot never back story write time really active make even realistic wonderful job coordinate several well crafted character many plot twist like treat english people clear ad deep respect crown give lot think twice get new insight definite recommend excellent much enjoy listen ok go give mainly cox love military action think character impress much action front guess expect intelligence somehow think involvement action sequence say like character even ruthless like action sequence hero actively participate see connection first second move believe teacher tarnish hero even stiff character best action end very good sophomoric", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Introduced in The Hunt for Red October, Jack Ryan, the naval historian who freelances for the CIA, returns in this novel, in which Clancy demonstrates once again that he is a master of a genre he seems to have created the technico-military thriller. \r\n\r\nOn a visit with his wife and daughter in London, Ryan stumbles onto an attempt by a new Irish revolutionary group to kidnap the Prince and Princess of Wales and their eldest son. Using his Marine Corps training, Ryan saves the royals (which leads to several visits between the Ryans and the residents of Buckingham Palace), but Ryan becomes the target of the surviving terrorists. \r\n\r\nMany familiar elements of the Clancy style are evident here: a fascination with machines and systems and procedures; thin characters; idealization of the soldier's life (\"the discipline and the essential toughness that makes them different\"); sarcastic humor; and a discordant sentimentality about family life. \r\n\r\nClancy spins a marvelously tense yarn that will appeal to his legion of fans.", "asin": "042526940X", "rank": "32509", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51ScnEnNuaL.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}