{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "This book was required reading for English Literature in my first year in high school. This story stayed with me..... and over the years I would think about the characters. The impact of this book I can't really explain... maybe because it was because it gave a voice to my black ancestors that I have never heard in literature before. It\"s thought provoking and deep and provided a real feel of life outside of the Caribbean and to the literature of which we were previously exposed. A great novel!"}, {"review_sentiment": 4.0, "review_text": "\"The Narrow Path\" is the coming of age story of a young Ghanaian boy during 1920's colonial rule.  Selormey, via the main character Kofi, takes us on an educational and cultural journey as Kofu tries to navigate through childhood and adolescence under the rigid cultural and religious guidance of his father.  Kofi's story is told in the tradition of the African fable.  The novel is well paced with clear and concise prose.  The language is vernacularly accurate and easily absorbed by the reader.  I read the book prior to vacationing in Ghana.  I hoped to get primed for the cultural experience prior to my trip.  During my stay, I found that much of the tradition captured in the novel is still in practice today.  Excellent reading material for students and readers of all ages.  Enjoy!"}]}, "authors": ["Francis Selormey"], "isbn": "0435905805", "longitude": 0.0, "periods": ["1900s"], "title": "The Narrow Path", "word_cloud": "required reading english first year high school story stay year character impact really maybe give voice black ancestor never hear literature think provoke deep provide real feel life literature previously expose great come age story young boy colonial rule main character take educational cultural journey try navigate childhood adolescence rigid cultural religious guidance father story tell tradition well pace clear concise prose language vernacular accurate easily absorb prior vacation hop primed cultural experience prior trip stay find much tradition capture still practice today read material student reader age enjoy", "genres": ["Fiction & Literature"], "summary": "Kofi was born on the coast of Ghana during the 1920s, his grandfather a wealthy fisherman, his father a teacher. The story that he tells, nearly 40 years later, is of his early days at home and in school, brought up in a strict mission household and conflicting with his father.\r\n\r\n\"The Narrow Path\" is the coming of age story set during 1920's colonial rule. Selormey takes us on an educational and cultural journey as Kofi tries to navigate through childhood and adolescence under the rigid cultural and religious guidance of his father. Kofi's story is told in the tradition of the African fable.", "asin": "0435905805", "rank": "1826206", "city": "Ghana", "image": "https://images-na.ssl-images-amazon.com/images/I/41T56D7W8YL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}