{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 21, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "satisfied"}, {"review_sentiment": 4.0, "review_text": "This was a difficult read for me, but I am not as well-read as I would like to be. It's an eye opening book, and one shows what some problems are in the world. I would recommend it to anyone who wants to broaden their mind and learn about the world outside your own."}, {"review_sentiment": 4.0, "review_text": "It was definitely a good book and I'm sure anyone who enjoys seeing the underlying representation from various actions or people will love it. I got stuck often and had to reread lines multiple times so it kind of annoyed me."}, {"review_sentiment": 4.0, "review_text": "I did not know what to expect from this one. As it turns out, it's quite a good literary book, although its tone is poorly represented by its cover; picture instead a dark road strewn with litter, under a cloudy sky, lined by buildings in various stages of collapse, and you'll have a better idea of what to expect.This book is set in Ghana in the 1960s, and is about corruption. It follows its unnamed protagonist, a railroad clerk, who is one of the few who refuses to take bribes--which only angers everyone, from the people who see bribing officials as a normal part of doing business, to his family, who are upset that he isn't taking every opportunity to provide them with a better life. From that description you might think the book features some kind of crusader, but \"the man\" (as he's referred to throughout) doesn't quite seem to know why he does what he does. No lectures about ideals from him.At any rate, the book mostly follows the man through his daily life, and is heavy on the description; the writing is quite vivid in its imagery, though often repulsive. (I've never seen a book spend so much time in latrines or talking about excrement.) Physical decay serves as a metaphor for moral corruption throughout, to a point that might seem heavy-handed to some readers, but effectively creates a dark and oppressive atmosphere. Meanwhile, this is the sort of book that develops characters through minute details of their daily lives, so while we learn relatively little about them in a big-picture sense, they feel entirely real.I have not talked about plot, because this book is far to the literary end of the spectrum, with a heavy focus on themes and ideas. Fortunately, the writing is good enough to pull it off. I'm not surprised that many reviewers have encountered this one in university classes; what does surprise me is that it isn't taught more often."}, {"review_sentiment": 1.0, "review_text": "This novel no doubt has more repulsive and disgusting images per chapter than any other book I have read.  If it were not considered by some to be a \"classic\" I would never have finished it.  After awhile, curiosity pulled me forward through the story, wanting to learn just what were the redeeming literary qualities that have kept this novel alive in the public memory the more than forty years since it was published.  Alas, I did not find them.  Somewhere past the mid-point, Armah manages to write perceptively and convincingly of the mentality and mechanisms of corruption that afflict so many African nations, and of the envy of those who observe the rich and powerful.  The integrity of the principal character, \"the man,\" is also clear.  Unfortunately the occasional meritorious writing is encased in an envelope of repulsive filth and excessive concentration on bodily fluids and excrement.  If this is somehow meant, by reflection, to illuminate the purity and cleanliness of the integrity of the hero, I can only say that Armah exacts a high price from the reader if he expects him to push onward through the muck.  I finished this because I'm going to Ghana in a few months and thought I should be familiar with some of Ghana's best-known writers.  I'll hope to find some others.  I searched for this book at a local used-book store and found it on a sidewalk sale rack for fifty cents.  That's about what it's worth."}, {"review_sentiment": 4.0, "review_text": "This book was thoroughly engaging and the scenes described were as clear as I were looking at them with my own eyes. The plot is a little slow to develop, but the author made his point clearly and succintly during its climax. Definitely a recommended reading from a person who does not normally read fiction."}, {"review_sentiment": 5.0, "review_text": "This is it! I searched for this book around and finally found it. I read it in my high school literature class and my professor had to explain the 'big grammars' to us. I'm so happy I have a copy of this book. No need for a rush, and every page was well detailed. Ayi Kwei killed it."}, {"review_sentiment": 5.0, "review_text": "This is a great book. It's funny, and is very insightful into human nature. The author does a great job of taking us to the setting, and one feels as though one were there. Which is what great writers can do."}, {"review_sentiment": 4.0, "review_text": "This speaks volumes about how the West conquered Africa.  The prose is imperfect, but it is beautiful and the story is haunting long after the final page."}, {"review_sentiment": 3.0, "review_text": "Published in 1968, this was Armah's first novel. It depicted corruption and societal breakdown in a newly independent African nation, seen through the eyes of a citizen disillusioned by the materialism and decay he encountered, who found himself struggling to maintain his integrity.The book was based on the experience of Ghanaians in the late 1950s and 1960s under the administration of Kwame Nkrumah. The nation's first leader after independence, he mismanaged the economy and was overthrown two years before the novel's publication. The work's considered to be among the key novels that began to reflect criticism of newly established native African governments following the exhilaration of freedom from colonial rule.Regrettably, I found the first two-thirds of the book to be plodding and often obscure, and the action uninteresting. It took 60 pages, one-third of the novel, to get the main character from a bus to an office to his home, through conversations with a bus driver, a relative, his wife and a teacher. Initially, there was little description of the characters' thoughts other than through dialogue. New characters were introduced abruptly, with little clue as to who they were; for example, the woman named Manaan in Chapter 6. Sixty pages into the book, a nameless, first-person narrator began speaking for half a chapter before dropping out.Too many of these passages went something like this:\"Question bounces off unheeded as the naked man gets up off the bed, takes a pencil from the top of the bookcase near the bed and sticks it in to mark the page. He puts the book on the case and sits back down on the bed, pushing his back against the head and drawing up his knees.\"And 40 pages later, this:\"The naked man stood up on the bed and tried to reach over to the door and take down a pair of trousers hanging on a nail behind it, but at his touch the door swung left and away from him, and he had to jump down and go round to get the trousers. He slipped them on over his naked body and took down a T-shirt from another nail.\"Many of these passages called to mind the style of the French New Novelists: painstaking description of moment-by-moment action to create a certain atmosphere, combined with a deemphasis of character, background and plot. Maybe this style was considered suitable for conveying the atmosphere of powerlessness. Disliking the style, I found it tedious and hard to appreciate.Closer toward the book's end, more of the main character's thoughts began to be gradually introduced. The last third of the novel, describing an important dinner at the main character's home with a corrupt representative of the regime and the fateful aftermath, was written in a more realistic way and told a more dramatic story, where plot and character came more sharply into focus. The ending seemed appropriate and was far from optimistic.For me, the novel was most memorable for its descriptions of the indignities of the new country: enslaving admiration for those with material wealth, no matter how it was gained; the humiliation and envy of those who lacked it; a dead-end job and the virtual absence of hope or an opportunity to better oneself; corruption and the pressure to join in and trade integrity for scraps, for the sake of one's children. And the ultimate futility of it all, what the author called the \"horrible cycle of the powerless.\"The novel was also memorable for its variety of pungent images of filth, which served to communicate both the urban atmosphere and moral decay:\"Sounds arise and kill all smells as the bus pulls into the dormitory town. Past the big public lavatory the stench claws inward to the throat. Sometimes it is understandable that people spit so much, when all around decaying things push inward and mix all the body's juices with the taste of rot . . . . Hot smell of caked s--- split by afternoon's baking sun, now touched by still evaporating dew. The nostrils, incredibly, are joined in a way that is most horrifying direct to the throat itself and to the entrails right through to their end.\"Although I found much of the book's style uninteresting until the last third, by the end the writer had managed to convey a strong sense of what life was like, physically and psychologically, under a corrupt regime."}]}, "authors": ["Ayi Kwei Armah"], "isbn": "0435905406", "longitude": 0.0, "periods": ["1900s"], "title": "The Beautyful Ones Are Not Yet Born", "word_cloud": "satisfied difficult eye open show problem world anyone want broaden mind learn world definitely good sure anyone enjoy see underlie representation various action people love get stuck often reread line multiple time kind annoy know expect turn quite good literary tone poorly represent cover picture instead dark road strewn litter cloudy sky line building various stage collapse better idea set corruption follow unnamed protagonist railroad clerk refuse take bribe anger everyone people see bribe official normal part business family upset take opportunity provide better life description feature kind crusader man refer quite seem know lecture ideal rate mostly follow man daily life heavy description write quite vivid imagery often repulsive never see much time latrine talk excrement decay serve metaphor moral corruption point reader effectively create dark oppressive atmosphere meanwhile sort develop character minute detail daily life learn relatively little sense entirely talk plot far literary end spectrum heavy focus theme ideas fortunately write good enough pull surprise many reviewer encounter university class surprise taught often doubt repulsive disgusting image chapter consider classic never finish awhile curiosity pull forward story want learn redeem literary quality keep alive public memory forty year publish find somewhere past manage write perceptively convincingly mentality mechanism corruption afflict many african nation envy observe rich powerful integrity principal character man also clear occasional meritorious write encase envelope repulsive filth excessive concentration bodily fluids excrement somehow meant reflection illuminate purity cleanliness integrity hero say exacts high price expect push onward muck finish go month think familiar writer hope others search local store find sidewalk sale rack fifty cent worth thoroughly engage scene describe clear look eye plot little slow develop author make point clearly succinctly climax definitely recommended read person normally fiction search finally find high school literature class professor explain grammar happy copy need rush page well detailed kill great funny insightful human nature author great job take set feel great writer speak volume conquer prose imperfect beautiful story haunt long final page publish first depict corruption societal breakdown newly independent african nation see eye citizen disillusion materialism decay encounter find struggle maintain base experience late administration nation first leader independence mismanage economy overthrown year publication work consider key novel begin reflect criticism newly establish native african government follow exhilaration freedom colonial find first plod often obscure action uninteresting take page get main character bus office home conversation bus driver relative wife initially little description character thought dialogue character introduce abruptly little clue example woman name page nameless narrator begin speak half chapter drop many passage go something bounce unheeded naked man get bed take pencil top bookcase bed stick mark page put case sit back bed push back head drawing knee page later naked man stand bed tried reach door pair trouser hang nail touch door swung leave jump go round get trouser slip naked body take nail passage call mind style french painstaking description action create certain atmosphere combine emphasis character background plot style consider suitable convey atmosphere powerlessness style find tedious hard end main character thought begin gradually introduce last third describe important dinner main character home corrupt representative regime fateful aftermath write realistic way tell dramatic story plot character come sharply end seem appropriate far memorable description indignity new country enslave admiration material wealth matter gain humiliation envy lack job virtual absence hope opportunity better corruption pressure join trade integrity scrap sake child ultimate futility author call horrible cycle powerless also memorable variety pungent image filth serve communicate urban atmosphere moral decay arise kill smell bus pull dormitory town big public lavatory stench claw inward throat understandable people spit much decay thing push inward body juice taste rot smell cake split afternoon bake sun touch still evaporate nostril incredibly join way horrify direct throat entrails right end find much style uninteresting last third end writer manage convey strong sense life physically psychologically corrupt regime", "genres": ["Fiction & Literature"], "summary": "The unnamed protagonist, referred to as \"the man\", works at a railway station and is approached with a bribe; when he refuses, his wife is furious and he can't help feeling guilty despite his innocence. The novel expresses the frustration many citizens of the newly independent states in Africa felt after attaining political independence.\r\n\r\nMany African states like Ghana followed similar paths in which corruption and the greed of African elites became rampant. Corruption in turn filtered down to the rest of society. The action takes place between 1965's Passion Week and 25 February 1966 – the day after the overthrow of Kwame Nkrumah, Ghana’s first president.\r\n\r\nThe \"rot\" that characterized post-independent Ghana in the last years of Nkrumah is a dominant theme in the book.", "asin": "B0092IV712", "rank": "7851132", "city": "Ghana", "image": "https://images-na.ssl-images-amazon.com/images/I/41%2BoI10Ud7L.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}