{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 471, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "I have read this book three times in the past 30 yrs. great adventure, page turner, love story. Clavell is such story teller, Noble House is another great book. Enjoy"}, {"review_sentiment": 5.0, "review_text": "An impressive account presented as an historical fiction that excites, intrigues, romances and delivers a well-paced, epic adventure about the founding of Hong Kong.  Simply an amazing book, as are all Clavell's books in the Asian Saga."}, {"review_sentiment": 5.0, "review_text": "Fabulous, simply fabulous.  Clavell really knew how to craft a fine tale.  Well-developed characters, historical facts, timing, it's all here.  Writers today that are this good are very few and far between."}, {"review_sentiment": 5.0, "review_text": "Best historical novel ever."}, {"review_sentiment": 4.0, "review_text": "Excellent book that places the founding history of Hong Kong in its global geopolitical context. Some characters/roles stretch credulity: the Tai Pan's strength, the Russian diplomat's assignment in Alaska."}, {"review_sentiment": 5.0, "review_text": "I'm a Ken Follet fan and I was very impressed with Tai Pan. It's a superb script with very clever and envolveu characters. Difficult to stop reading, keeps you wondering what will happen next."}, {"review_sentiment": 4.0, "review_text": "Not quite as good as Shogun, but still a ripping good yarn!"}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 4.0, "review_text": "Struen \"the\" Tai-Pan in life. The deal maker, the orchestrator, the visionary, the man whom life surrounded. His all seeing perspective gave birth and sustenance to many exciting endeavors including Nobel House and the island of Hong Kong. What will become of Nobel House after he's gone? Who will lead, and will Hong Kong fall to the politicians or meet its death because of them? We shall see. On to book three."}, {"review_sentiment": 5.0, "review_text": "A fascinating view into an interesting period in history with an emphasis on the cultural differences between the Chinese and the Europeans in the 19th century, told within a story laden with complex characters and political ploys."}]}, "authors": ["James Clavell"], "isbn": "0440184622", "longitude": 114.1628131, "periods": ["1800s"], "title": "Tai-Pan", "word_cloud": "time past yr great adventure page turner story story teller great enjoy impressive account present historical fiction excite intrigue romance delivers epic adventure found amaze simply fabulous really know craft fine tale character historical fact time writer today good far historical ever excellent place found history global geopolitical context stretch credulity strength russian diplomat assignment fan impress superb script clever involve character stop read keep wonder happen next not quite good still rip good yarn great life deal maker orchestra tor visionary man life surround see perspective give birth sustenance many exciting endeavor include island become go lead fall politician meet death fascinating view interesting period history emphasis cultural difference chinese century tell story laden complex character political ploy", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "Book 2/5 in Asian Saga\r\n\r\nIt is the early 19th century, when European traders and adventurers first began to penetrate the forbidding Chinese mainland. And it is in this exciting time and exotic place that a giant of an Englishman, Dirk Straun, sets out to turn the desolate island of Hong Kong into an impregnable fortress of British power, and to make himself supreme ruler…Tai-Pan!\r\n\r\n“Grand entertainment...packed with action...gaudy and flanboyant with blood and sin, treachery and conspiracy, sex and murder...fresh and vigorous.” New York Times", "asin": "B00FTK5F8I", "rank": "1889824", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/51PeuRSxRRL.jpg", "country": "China", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}