{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 316, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "I love the series but this is not as enjoyable as the others. It may be my view is clouded by enjoying the others so much, Overall,, I would thoroughly recommend the series."}, {"review_sentiment": 5.0, "review_text": "Excellent novel well researched and made believable"}, {"review_sentiment": 5.0, "review_text": "Great book! Love reading about the strauns adventures! Looking forward to reading the next book whirl wind when it's available"}, {"review_sentiment": 5.0, "review_text": "Love the complexity of the many characters and how the story is always moving forward"}, {"review_sentiment": 5.0, "review_text": "An all time favorite"}, {"review_sentiment": 5.0, "review_text": "Excellent book series!"}, {"review_sentiment": 5.0, "review_text": "great continuity"}, {"review_sentiment": 5.0, "review_text": "Against the backdrop of 1960's Hong Kong, a finely woven tale of intrigue, power struggles, natural disasters, greed and passion. Throw in double and triple cross along with international espionage and Noble House becomes an unbeatable story."}, {"review_sentiment": 5.0, "review_text": "One of the many best novel by James Clavell.For a foreigner writing about Hong Kong back at those dates, not bad.I enjoy it as much as Shogun."}, {"review_sentiment": 5.0, "review_text": "I don't know why it has taken me this long to read Shogun, King Rat and now Noble House.  What a treasure they are. The plots, the characters, the writing; the intertwining events, all combine into a whole epic of mystery and intrigue. And so well told and integrated.  The Chinese syntax converted into English makes for some very descriptive and outright hilarious reading, especially in Noble House. Keep a notebook and pen handy so you don't lose track of who is who and who is  related to whom."}]}, "authors": ["James Clavell"], "isbn": "0440164842", "longitude": 114.1628131, "periods": ["1900s"], "title": "Noble House (James Clavell's Asian Saga)", "word_cloud": "love series enjoyable others cloud enjoy others much thoroughly series well research make believable reading strain adventure look forward read next whirl wind available complexity many character story always move forward time favorite excellent series great continuity backdrop finely woven tale intrigue power struggle natural disaster greed passion double triple cross international espionage become unbeatable story many best foreigner write back date enjoy much know take long treasure plot character write intertwine event combine whole epic mystery intrigue well told integrate chinese syntax convert make descriptive outright hilarious read especially notebook pen handy lose track relate", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "Politics"], "summary": "Book 5/6 in the Asian Saga Series\r\n\r\nThe setting is Hong Kong, 1963. The action spans scarcely more than a week, but these are days of high adventure: from kidnapping and murder to financial double-dealing and natural catastrophes–fire, flood, landslide. Yet they are days filled as well with all the mystery and romance of Hong Kong–the heart of Asia–rich in every trade…money, flesh, opium, power.\r\n\r\n\"The last time I was so taken with a spellbinding safari was when I read Gone With The Wind.\" Los Angeles Times.\r\n", "asin": "0440164842", "rank": "71193", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/51Dn426EpzL.jpg", "country": "China", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}