{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 44, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "GEORGE PELECANOS, writer for THE WIRE and THE DEUCE, is well-known for his colorful, Richard Price-lite books about crimes and misdemeanors in DC. KING SUCKERMAN follows the well-plod route of Elmore Leonard and Price with a tale about Marcus Clay, Vietnam Vet and record store owner, his Greek friend Dimitri and a vicious foursome from Miami, led by Wilton Cooper, whose sidekick is a slow-witted white county boy named Bobby Roy from North Carolina and a pair of DC brothers, who cross swords with Eddie Spags, a mafia wanna-be and pot dealer. All of this over the Bicentennial weekend. Marcus and Dimitri get in the middle and the book becomes a violent chase over the city while crowds pour into the mall for the celebration. Pelecanos has a great handle on characters and dialogue, with an encyclopedic knowledge of the soul, funk and rock scene in 1976 (this book will send you running to your Spotify). The book’s title refers to a black exploitation film opening that weekend that all the characters are down far, the story of a pimp that ends on a downer. Great dialogue and deep characterizations fuel Pelecanos’ street-smart scenes, with crosses, double crosses and triple crosses in abundance. Pelecanos keeps the heart in his characters while not skimping on the violence."}, {"review_sentiment": 5.0, "review_text": "Awesome books!"}, {"review_sentiment": 3.0, "review_text": "Mr. Pelicanos did a good, but not great job describing the wasted lives of those young men with so much potential. But it is not his best effort. I enjoyed reading the cultural references to the 1980s, including the movies and the music. The story line dragged at times, but that's probably the way things really happened back then.  I'm glad that I read the book and I look forward to reading the rest of the trilogy."}, {"review_sentiment": 3.0, "review_text": "I was disappointed. This was okay but not up to Pelecanos' standard."}, {"review_sentiment": 5.0, "review_text": "Is it a finely rendered portrait of '70s DC? A deeply emotional tale of crime and revenge? Or pulp trash? It's all these things. King Suckerman is one of those books that transcends its genre. It's entertaining, yes. But it also has big themes on its mind, like racism, violence and redemption. And it's written in a style that integrates music, basketball, and a deep knowledge of DC's streets and sidewalks. A great example of modern hard-boiled crime."}, {"review_sentiment": 4.0, "review_text": "Having subscribed to the Washington Post for almost 30 plus years, this novel is a Refresher course on the constant drug wars of the time with some of the oddest and memorable characters you will meet , in fiction that is and not in person. Good read."}, {"review_sentiment": 1.0, "review_text": "I read about 50 pages of this book and had absolutely no idea what the plot line was.  I tried one more time to read a few more pages, then gave up and deleted it from my Kindle.  The writing style left me cold."}, {"review_sentiment": 5.0, "review_text": "I started with \"Down By the River Where The Dead Men Go\", \"The Night Gardner\", \"What It Was\", and now \"King Suckerman\".  This book almost reads like a blackploitation film I say almost because unlike blaxploitation this actually shows a more human aspect instead of a bunch of stereotypes. I like the writing of Pelecanos because all his stories take place in DC specifically in my own back yard. His dialogue humorous yet memorable, character development stays with you long after you have finished, and that's a good thing seeing as how the characters make cameos in other books.  I highly suggest this book to anyone interested in serious crime fiction."}, {"review_sentiment": 5.0, "review_text": "Either the best, or one of the best Pelecanos books. I should have read it before the  8 of his books I consumed previously."}, {"review_sentiment": 5.0, "review_text": "Pelgranos is a great fabricator of fiction telling tall tales that are fun and enjoyable to read, especially if you are even somewhat familiar with Washington DC.  Once you finish the book and seek out more you will understand how the cast of characters came together.The 1968 riots in DC changed the community and the atmosphere of the city radically.  How that change effected different portions of the metro area is reflected in the stories."}]}, "authors": ["George P. Pelecanos"], "isbn": "0440225957", "longitude": -77.0366456, "periods": null, "title": "King Suckerman", "word_cloud": "writer colorful crime misdemeanor follow route tale record store owner friend vicious foursome lead sidekick white county boy name pair brother cross sword mafia pot dealer weekend middle becomes violent chase city crowd pour mall celebration great handle character dialogue encyclopedic knowledge soul funk rock scene send run title refers black exploitation film open weekend character far story pimp end downer dialogue deep characterization fuel scene cross double cross triple cross abundance keep heart character skimp violence pelican good great job describe waste life young men much potential best effort enjoy read cultural reference include movie music story line drag time probably way thing really happen glad look forward read rest trilogy disappoint okay standard be finely rendered portrait deeply emotional tale crime revenge pulp trash thing transcend genre entertain yes also big theme mind racism violence redemption write style integrates music basketball deep knowledge streets sidewalks great example modern crime have subscribe almost year course constant drug war time oddest memorable character meet fiction person page absolutely idea plot line try time page give delete writing style leave cold start down be almost read blackploitation film say almost blaxploitation actually show human aspect instead bunch stereotype like write story take place specifically back dialogue humorous yet memorable character development stay long finish good thing see character make cameo highly suggest anyone interested serious crime fiction best best consume previously great fabricator fiction tell tall tale fun enjoyable especially even somewhat familiar finish seek understand cast character come riot change community atmosphere city radically change effect different portion metro area reflect story", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Book 2/4 in the DC Quartet Series\r\n\r\nThe time is 1976.  Captain Beefheart's on the eight-track.  The hot new superfly flick King Suckerman is coming to neighborhood theaters.  And Washington, D.C., is a hotbed of drugs and racial tension--an easy place to turn a wrong corner and land in a whole lot of trouble.  \r\n\r\nThat's what happens to Marcus Clay and Dimitri Karras when they cross paths with an ex-con and his gang of natural born killers.  Walking into a drug deal gone south, Clay and Karras end up with a pile of money that isn't theirs...the sexy teenage girlfriend of the Italian dealer...and major trouble.  The ex-con is soon spilling blood to get to the cash.  The dealer is scheming to get his girl back.  And two knockaround guys named Clay and Karras are reaching a pivotal moment--the time to take a stand, go straight, and get justice.  Or maybe just sweet revenge.\r\n\r\nIn this sizzling thriller, George Pelecanos writes with a firecracker in his prose, shooting sparks on every page and earning his place among the stars of crime fiction", "asin": "0440225957", "rank": "771475", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51DDl9Xg6yL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}