{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 52, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Great story. Enjoyed listening while recovering from eye surgery"}, {"review_sentiment": 3.0, "review_text": "I wanted a better copy than the one I have, since paperbacks do tend to deteriorate, but this one is in worse condition than the one I've had on my shelf for 20 years."}, {"review_sentiment": 4.0, "review_text": "This is a \"quick-read\" detective story I read for my book club:  It was okay, but I wouldn't read other books by this author."}, {"review_sentiment": 3.0, "review_text": "ok read ,,, not as good as I remembered"}, {"review_sentiment": 5.0, "review_text": "Marcia Muller's first novel featuring private investigator Sharon McCone is a great place to start reading this series. A quick and engaging read."}, {"review_sentiment": 4.0, "review_text": "Good entertainment and fun for someone who grew up in San Francisco."}, {"review_sentiment": 4.0, "review_text": "Its ok for a fast read."}, {"review_sentiment": 5.0, "review_text": "Good mystery novel"}, {"review_sentiment": 3.0, "review_text": "The victim had a more developed character then the rest of them but otherwise it was a nice read"}, {"review_sentiment": 3.0, "review_text": "I really feel overcharged by this price of this book. It's a short book and it's seems more like it is written by a highschooler."}]}, "authors": ["Marcia Muller"], "isbn": "0445409029", "longitude": -122.4192363, "periods": ["1900s"], "title": "Edwin of the Iron Shoes", "word_cloud": "story listen recover eye surgery want better copy paperback tend worse condition shelf year detective story club ok good remember first feature private investigator great place start read series quick engaging good entertainment fun someone grow ok fast good mystery victim develop character rest otherwise nice really overcharged price short seem write highschooler", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "It's Sharon McCone's first case as staff investigator for All Souls Legal Cooperative. She knows nothing about antiques, yet she has an affection for Salem Street with its charming mix of antique and curio shops. Now elderly dealer Joan Albritton has been found dead, stabbed with an antique dagger. Her neighbors are shocked. Recurring vandalism has them frightened. Ferreting out the facts will take Sharon from the chaotic jumble of the junk dealers establishment to a museum where San Francisco's most elegant socialites gather.", "asin": "0445409029", "rank": "768857", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51Bfg8WDt3L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}