{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 31, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Fun first outing  of funny and odd Hong Kong-based cop procedure / comedy / thrillers. Some books following this are even better ..."}, {"review_sentiment": 5.0, "review_text": "I first encountered this series in 1986. I still l have that first paperback copy of Frogmouth on my shelf to this day. I have spent the intervening years haunting used bookstores trying to complete a Yelowthread collection with matching covers. It is harder than one would expect. Every couple years I would check the Kindle library for the series and be disappointed. I had finally resigned myself to accepting the excellent Yellowthread books as an obscurity that would never again see a wider audience, so imagine my shock when I checked this time. I am not prone to exuberant excitement, but Iiterally ran around the house waving my Kindle and whooping. Yes, whooping.So what is the fuss? The Yellowthread Street books walk a strange line. On the surface, they are police procedurals set in a fictional area of Hong Kong. But they are also incredibly funny. Not wacky comedy funny, but rather a wry, subtle humor. And this humor is balanced with deep sadness and melancholy. The stories get better and better as they go, with the later entries in the series perfecting this mix of humor and sadness. Characters grow over the course of the series, and though there is some continuity from book to book, each can easily stand on it's own.In short, I can't reccomend this series higher. It is fantastic stuff. The first book is by far the weakest, and it takes unti the third for the tone and structure to really hit it's stride. I really hope this new availability gets these stories in front of more eyes. And I hope those folks come to love Wiliam Marshall's Yellowthread books as much as I do."}, {"review_sentiment": 4.0, "review_text": "I really enjoyed the books in this series.  They remind me of a sort of mix of Barney Miller meets Hawaii Five-0."}, {"review_sentiment": 5.0, "review_text": "I received a free electronic copy of this novel from Netgalley, the estate of William Marshall, and Farrango Books in exchange for an honest review.  This book was originally published by Hamish Hamilton in 1975.This was an excellent police procedural, a very fast read and a laugh a minute, despite it's serious storyline.  Taking place in Hong Kong in the early 1970's, this author takes you there.  I will look for more reprints of his work by Farrango Books.  Thank you, for bringing him back to a new generation of readers."}, {"review_sentiment": 5.0, "review_text": "Great series. Couldn't get enough Yellowthread Street. Good service, too."}, {"review_sentiment": 4.0, "review_text": "A series opener from Australian born author William Marshall, Yellowthread Street was originally published back in 1975. Set in British controlled Hong Kong it was followed by 15 more books with the last To the End coming out in 1998, the year after the British Handover to the Chinese took place.At first I found Marshall's writing style quite confusing and had to re-read the first couple of pages several times to see whether I had missed something in respect of our opening crime scene. I soon settled into the book.It kind of reminded me of an episode of Hill Street Blues as we have more than one crime occurring and a team of officers dipping in and out of the narrative each following their own particular case.There are seven or eight police officers in the team at Yellowthread Street police station. In the course of the book we get to know them a bit better, understand their rivalries and get a slight feel for their lives outside the job with a couple of them.We have a double murder with an axe, a stake-out at a cinema which was previously held up by a US sailor when his ship last docked at the port, a report of a missing American tourist by his wife, the aforementioned missing American tourist getting drunk and out of control at a bar and finding himself arrested for attempted rape and a Mongolian extortionist removing fingers, hands and ears with a ceremonial Nepalese knife. Oh and one of his victims also steals a wheelchair from the hospital where she was treated. Plus the Chinese have turned the water supply off again.All in 128 pages - so it's non-stop busy.Enjoyable without being the best book ever and its definitely a series and a set of characters I'll be interested in returning to, which is probably just as well as I bought the first ten in the series blind.Plenty of humour in the narrative, especially in the scenes between the cinema owner and the detective working the ticket booth on the stakeout. He gets continually harangued for allowing customers to access dearer seats at cheaper prices. Little touches like that which add to the enjoyment of the book.Overall 4 from 5.William Marshall has penned another eight books outside this series.Read in October, 2016Paperback copy bought secondhand a couple of years ago.Page count - 128."}, {"review_sentiment": 5.0, "review_text": "Oldie but goodie. This is an odd and funny series of books about detectives in Hong Kong and the weird criminals they encounter.."}, {"review_sentiment": 4.0, "review_text": "I was given an ARC from the publisher through NetFalley in return for an honest review.  The book is one that I would never read on my own but I felt obligated to read it and was glad that I did.  It is well written, had a good story and characters, everything was well described and the book actually was pretty funny.  I am glad that I gave the book a chance and would really consider reading moree titles in the series on my own, I felt like I kind of became attached to the characters much like I do in series all the time.  There was a lot to say about the colorful story, it was fun and fast paved and not anything that I had expected it to be, and not being able to guess what was going to happen was really nice.  One reason that I felt hesitant to read this was that I know nothing of Hong Kong and Japan or the history, but this book really was well written and I learned quite a few things and was easily able to follow along.  It is not a cozy crafting or culinary mystery that I would usually read but that's ok, it was really good and I did like it, it was a nice change of pace.  It was not a boring police procedural story either.  The main characters are wonderul and the supporting characters are funny, vivid and colorful and yes, characters.  Maybe I should have rated this book 5 stars because overall I did really like the book, the writing was really good but I just couldn't seem to do it yet I still would read other books to follow in the series."}, {"review_sentiment": 5.0, "review_text": "I have to say the tension of wanting to know what was going to happen - if they'd capture this irrational lone killer - really gripped me - it was almost painful - I tried to read faster and faster. What a find this writer is - he is exciting and adept - skillful in extreme.. Feiffer, the main detective, is sympathetic and smart and funny; the crime and his figuring it out ingenious - in a time when we are faced with lone killers, this is very timely. Excellent"}, {"review_sentiment": 3.0, "review_text": "Originally published in the 1970s when Hong Kong was under British control and being politically correct wasn't yet on everyone's mind, Yellowthread Street holds up reasonably well forty years later. It's light entertainment that doesn't take itself too seriously.The basic premise is of an overnight shift at a Hong Kong police station located in one of the worst sections of town. Even given that, this shift is particularly busy. I don't see this so much as a police procedural (though it has some elements of it) as a witty, sometimes satirical take on a night when everything that could happen did happen.The novel itself is quick paced and action packed, with an occasional \"Keystone Cops\" feel to it. If you are looking for an irreverent, fast read with some serious undertones and a simple yet engaging plot, this might be for you.*Thanks to Netgalley/the publisher for providing this copy in exchange for an honest, unbiased review.*"}]}, "authors": ["William Leonard Marshall"], "isbn": "0445405481", "longitude": 114.1628131, "periods": ["1900s"], "title": "Yellow-Thread Street", "word_cloud": "first out funny odd cop procedure comedy thriller follow even better first encounter series still l first paperback copy shelf day spend intervene year haunt use bookstore try complete collection match cover harder couple year library series disappoint finally resign accept excellent obscurity never wider audience imagine shock check time prone exuberant excitement run house wave whoop fuss walk strange line surface police procedural set fictional area also incredibly funny not wacky comedy funny rather wry subtle humor humor balance deep sadness melancholy story get better better go later entry series perfect mix humor sadness grow course series continuity easily stand short series higher fantastic stuff first far weakest take unit third tone structure really hit stride really hope new availability get story front eye hope folk come love much really enjoy series remind sort mix meet receive free electronic copy estate exchange honest review originally publish excellent police procedural fast minute serious story line take place early author take look reprint work bring back new generation reader series enough service series opener australian bear author originally publish back control follow last come year british take first find write style quite confuse first couple page several time see miss something respect open crime scene soon settle kind remind episode crime occur team officer dip narrative follow particular police officer team police station course get know bit better understand rivalry get slight feel life job couple double murder ace cinema previously hold sailor ship last docked port report miss tourist wife aforementioned miss tourist get drunk control bar finding arrest attempted rape mongolian extortionist remove finger hand ears ceremonial knife victim also steal wheelchair hospital treat chinese turned water supply page best ever definitely series set character interest return probably well buy first ten series humor narrative especially scene cinema owner detective work ticket stakeout get continually harangue allow customer access dearer seat cheaper price little touch add enjoyment pen copy buy secondhand couple year count foodie odd funny series detective weird criminal give publisher return honest review never felt obligated glad well write good story character everything well describe actually pretty funny glad give chance really read more title series felt kind become attached character much series time lot say colorful story fun fast pave anything expect able guess go happen really nice reason felt hesitant know nothing history really well write learn quite thing easily able follow cozy craft culinary mystery usually really good nice change pace boring police procedural story main character wonderful support character funny vivid colorful yes character maybe rat star overall really write really good yet still series say tension wanting know go happen capture irrational lone killer really grip almost painful try faster faster find writer excite adept skillful main detective sympathetic smart funny crime figure ingenious time face lone killer timely excellent originally publish british control politically correct yet everyone mind hold reasonably well year later light entertainment basic premise overnight shift police station locate worst section town even give shift particularly busy see much police procedural element witty sometimes satirical night everything quick pace action pack occasional look irreverent fast serious undertone simple yet engage plot provide copy exchange honest unbiased review", "genres": ["Fiction & Literature", "Mystery & Suspense", "Humour"], "summary": "Book 1/3 in the A Yellow-Thread Street Mystery Series\r\n\r\nThe first in Marshall's unforgettable, classic series of police procedurals - suspenseful and hilarious in equal measure.\r\n\r\nYellowthread Street is the sort of place that breeds more crime than any cops can handle.\r\n\r\nAmong the gangsters and the goldsmiths of Hong Bay, Chief Inspector Feiffer and his police department had their hands full . . . tourist troubles, a US sailor turned stick-up artist, and the jealous Chinese who solved his marital difficulties with an axe.\r\n\r\nThen the Mongolian with a kukri brought an extra touch of terror to the district . . .\r\n\r\nYellowthread Street brings to vivid life a seamy world where people called Osaka Oniki the Disemboweller, Shotgun Sen and The Chopper feel at home, a world of surreal possibility recorded with unique humour and a poignant sense of humanity.\r\n\r\n“Marshall has the rare gift of juggling scary suspense and wild humor and making them both work.” Washington Post \r\n\r\n“As an inspired poet of the bizarre, [Marshall] orchestrates underlying insanity into an apocalyptic vision of the future.” New York Times ", "asin": "0445405481", "rank": "3548042", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/51nwVwbAGML.jpg", "country": "China", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}