{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 93, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "I've now read two of Robert Hicks' books and both are amazing. I've enjoyed them so much that I took a special trip to Franklin, TN. I highly recommend it."}, {"review_sentiment": 4.0, "review_text": "Not finished with it yet, but so far am enjoying it. A bit wordy, don't know a lot of the vocabulary, long passages, and not as great as The Widow of the South, but do think Hicks should write more."}, {"review_sentiment": 4.0, "review_text": "I had read Hicks's Widow of the South and liked it very much, thus I purchased this novel.  I am enjoying it, although not quite as much as the earlier one.  Still, an engrossing read."}, {"review_sentiment": 5.0, "review_text": "I love it"}, {"review_sentiment": 5.0, "review_text": "I didn't know what to expect of this book, but I ended up being completely obsessed. Very well written. Starting on the next book soon"}, {"review_sentiment": 5.0, "review_text": "It's great!"}, {"review_sentiment": 4.0, "review_text": "Enjoyed the book."}, {"review_sentiment": 4.0, "review_text": "A new turn at every corner.  Just when you think you think you have it figured out, there is a new traffic turn."}, {"review_sentiment": 4.0, "review_text": "I liked this book. Although my book club members gave it a thumbs down, I felt like I was actually in New Orleans while reading it. It's a little long on descriptions, but overall an interesting read."}, {"review_sentiment": 4.0, "review_text": "Slow start but good toward the end."}]}, "authors": ["Robert Hicks"], "isbn": "0446581658", "longitude": -90.0701156, "periods": ["1800s", "Recent Releases"], "title": "A Separate Country: A Story of Redemption in the Aftermath of the Civil War", "word_cloud": "amaze enjoy much take special trip highly recommend not finish yet far enjoy bit wordy know lot vocabulary long passage great think write hicks like much thus purchase enjoy quite much earlier still engross love know expect end completely obsessed very well write next soon great enjoyed new turn corner just think figure new traffic turn like club member give thumb felt actually read little long description overall interesting slow start good end", "genres": ["Biography", "Fiction & Literature", "Historical Fiction"], "summary": "Set in New Orleans in the years after the Civil War, A Separate Country is based on the incredible life of John Bell Hood, arguably one of the most controversial generals of the Confederate Army--and one of its most tragic figures. Robert E. Lee promoted him to major general after the Battle of Antietam. But the Civil War would mark him forever. \r\n\r\nAt Gettysburg, he lost the use of his left arm. At the Battle of Chickamauga, his right leg was amputated. Starting fresh after the war, he married Anna Marie Hennen and fathered 11 children with her, including three sets of twins. But fate had other plans. \r\n\r\nCrippled by his war wounds and defeat, ravaged by financial misfortune, Hood had one last foe to battle: Yellow Fever. A Separate Country is the heartrending story of a decent and good man who struggled with his inability to admit his failures-and the story of those who taught him to love, and to be loved, and transformed him.", "asin": "0446581658", "rank": "648676", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51-WkXd4E-L.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}