{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 352, "rating": 3.2, "reviews": [{"review_sentiment": 4.0, "review_text": "Its always interesting to read the compilation of Bushnells columns that inspired the seminal tv show of the late 90s on HBO. While there are certainly a variety of similarities this is grittier and a bit more honest and in your face than the tv show. Some of the characters made it onto the show but were vastly different in the original book. This gives a rather voyeuristic snapshot of a particular time and place in NYC that otherwise would have been forgotten."}, {"review_sentiment": 5.0, "review_text": "sex and the city fan"}, {"review_sentiment": 5.0, "review_text": "Candace Bushnell brings to life dating in the concrete jungle. Having lived in Manhattan through that exact period, I can attest that her expose is as accurate as it is entertaining.  It's worth reading even if you watched every season of the show."}, {"review_sentiment": 5.0, "review_text": "LOVE LOVE LOVE this book <3 came early too <3"}, {"review_sentiment": 3.0, "review_text": "I thought it would be more like the show. It felt like bits and pieces. Interesting read, though."}, {"review_sentiment": 5.0, "review_text": "I'm a die hard SATC fan, but this book is what the show is an adaptation of. Don't read it expecting to have everything the same. It's still a great read!"}, {"review_sentiment": 1.0, "review_text": "As a diehard fan of the HBO series inspired by this \"novel\" from Candace Bushnell, I was thoroughly unimpressed with the book and will even venture to say this is one of those rare instances where the show is far more superior than the book. How Darren Star and Michael Patrick King were able to inject such life into four complex characters, humor into a well-written script, and turn it into a hit show, I'll never know. Because it's very clear their sorcery didn't come from this subpar book."}, {"review_sentiment": 2.0, "review_text": "This book, in my opinion, was like talking to a girlfriend who talks about people you don't know and things that you really don't care about. Maybe that was the point? I'm not sure how this book got a show, but I am glad it did. I love the show."}, {"review_sentiment": 2.0, "review_text": "if you are expecting the TV series, you will be disappointed."}, {"review_sentiment": 2.0, "review_text": "Ages and ages and ages ago, I loved this book. It is still something I appreciate, on some level, even if my feelings have changed in the years. I certainly loved it all those years ago. Perhaps not as much as the hit HBO television series of the same name, but, it was still up there. Sex and the City was something of a stepping stone for a lot of women through the years and still, I think, holds true even in the years its been off the air. Certainly it's a pop culture phenomenon that still stays highly relevant in popular culture.I'm always going to appreciate it, and the show, for what they are and how they shaped some aspects of who I became as an adult. I applaud it on many levels but somehow, somewhere along the way, the novel and show have lost their sparkle to me. I don't think I'll feel inclined to reread the book again, in the future, which is strange given I still love the characters from both the novel and show, and have some sense of attachment towards them, but there you have it. It's not that it's a bad novel, it just feels like the older I get the more boring and unappealing it is to me.This isn't true when it comes to Bushnell's other, flawless works. But SATC is by far a weak length in her catalog. Maybe it's just dry, maybe it hasn't aged well, maybe the thoughts within it are something that I've simply lost interest in the older I become. I'm more inclined, on one hand, to think of it as the latter but it appears to have mixed reviews from a lot of readers, too.Regardless of reasoning, there's something about it that lets me down and only barely leaves a hum of interest behind.I think that it goes without saying that while this is Bushnell's most popular work to date, it is not her best by a long shot. Her writing is somewhat thought provoking and personal in a lot of ways, but her game has improved through the years be it the prequel series targeted at young adults: The Carrie Diaries or something else entirely. Sex and the City is equal parts dull and entertaining, likable and unlikable, and not for everyone. Fans of the series often express their distaste for the novel in comparison to HBO's adaptation which proves to be more developed given the changes in format.Still, it's a decent read for any woman at any stage in her life. I may not enjoy it as I once did, but it's still something that remains--and should remain--present in modern literature."}]}, "authors": ["Candace Bushnell"], "isbn": "0446673544", "longitude": 0.0, "periods": ["1900s"], "title": "Sex and the City", "word_cloud": "always interesting compilation column inspire seminal tv show late certainly variety similarity grittier bit honest face tv character make show vastly different original give rather voyeuristic particular time place otherwise fan bring life date concrete jungle live exact period attest expose accurate entertain worth read even watch season show come early think felt bit piece die hard fan show adaptation expect everything still great die hard fan series inspire thoroughly unimpressed even venture say rare instance show far superior able inject life complex character humor script turn hit show never know clear sorcery come sub par opinion talk girlfriend talk people know thing really point sure get show glad love show expect tv series disappoint age age age love still something appreciate level even feeling change year certainly love year ago perhaps much hit television series name still something step stone lot woman year still think hold true even year air certainly pop culture phenomenon still stay highly relevant popular always go appreciate show shape aspect become adult applaud many level somehow somewhere along way show lose sparkle think feel inclined reread future strange give still love character show sense attachment bad feel older get bore unappealing true come flawless work far weak length catalog dry maybe age well maybe thought something simply lose interest older become incline hand think latter appear mixed review lot reader reason something let barely leave hum interest think go say popular work date best long shot writing somewhat think provoke personal lot way game improve year prequel series target young adult something else entirely equal part dull entertain likable unlikable everyone series often express distaste comparison adaptation prove develop give change decent woman stage life still something remain remain present modern literature", "genres": ["Fiction & Literature"], "summary": "Enter a world where the sometimes shocking and often hilarious mating habits of the privileged are exposed by a true insider. In essays drawn from her witty and sometimes brutally candid column in the New York Observer, Candace Bushnell introduces us to the young and beautiful who travel in packs from parties to bars to clubs. \r\n\r\nMeet \"Carrie,\" the quintessential young writer looking for love in all the wrong places...\" Mr. Big,\" the business tycoon who drifts from one relationship to another...\"Samantha Jones,\" the fortyish, successful, \"testosterone woman\" who uses sex like a man...not to mention \"Psycho Moms,\" \"Bicycle Boys,\" \"International Crazy Girls,\" and the rest of the New Yorkers who have inspired one of the most watched TV series of our time. You've seen them on HBO, now read the book that started it all...", "asin": "0446673544", "rank": "221010", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51IWDK2nuNL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}