{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 1940, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Great read"}, {"review_sentiment": 5.0, "review_text": "Good"}, {"review_sentiment": 4.0, "review_text": "The bride and groom are murdered shortly after their wedding. Who is doing this and why? Four women join together to,solve the case - a police detective, a medical examiner, a reporter, and a district attorney - they form the Women’s Murder Club."}, {"review_sentiment": 5.0, "review_text": "This is a gruesome serial murder mystery. It is very suspenseful and has a very surprising ending. It has page turning qualities."}, {"review_sentiment": 4.0, "review_text": "More twist in this book than any other books that I have ever read. A Must finish bookGood read."}, {"review_sentiment": 5.0, "review_text": "I can’t seem to believe what I just read. If you start getting a good nights sleep  will not be in the picture you will be up reading. I just wanted more. Now I’m ready to start the next book but. MUST get my cleaning finished first o4 it’ll never get done. So hard to put her books away. Hopefully you’re going to enjoy as much as I have."}, {"review_sentiment": 5.0, "review_text": "This was an excellent novel. Hard to put down. The protagonists and her team of intelligent women are wonderfully written. Can't wait to read the next Women's Murder Club."}, {"review_sentiment": 5.0, "review_text": "Murder, power, control, love, hate, joy, sadness, intelligence, illness, friendship and trust. This book ran the gamut of emotions. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "Could. It put it down and now getting the next book in the series!!!  Awesome book!"}, {"review_sentiment": 5.0, "review_text": "This was absolutely the best book I’ve read in years. It took everything for me to put it down and walk away."}]}, "authors": ["James Patterson"], "isbn": "0446696617", "longitude": -122.4192363, "periods": ["2000s", "Recent Releases"], "title": "1st to Die (Women's Murder Club)", "word_cloud": "great good bride groom murder shortly wed woman together case police detective medical examiner reporter district attorney form gruesome serial mystery suspenseful surprising end page turn quality more twist ever finish book good seem believe start get good night sleep picture read want now ready start next clean finish first never do so hard go enjoy much excellent put protagonist team intelligent woman wonderfully write wait next power control love hate joy sadness intelligence illness friendship trust run gamut emotion recommend get next series absolutely best year take everything put walk away", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Imagine a killer who thinks, \"What is the worst thing anyone has ever done?\"--and then goes far beyond it. Now imagine four women --a police detective, an assistant DA, a reporter, and a medical examiner --who join forces as they sidestep their bosses to track down criminals. \r\n\r\nKnown as the Women's Murder Club, they are pursuing a murderer whose twisted imagination has stunned an entire city. Their chief suspect is a socially prominent writer, but the men in charge won't touch him. On the trail of the most terrifying and unexpected killer ever, they discover a shocking surprise that turns everything about the case upside down.", "asin": "B0056TN7TQ", "rank": "4072027", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51lQO2My%2BmL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}