{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 2051, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "A+A+A+A"}, {"review_sentiment": 2.0, "review_text": "I always enjoy the camel club.  This 3rd book was great and exciting as the 1st and 2nd book was."}, {"review_sentiment": 5.0, "review_text": "Keeps me speculating to the very end."}, {"review_sentiment": 5.0, "review_text": "enjoyed adventures of camel club."}, {"review_sentiment": 5.0, "review_text": "Exciting series! It was hard to put the book down."}, {"review_sentiment": 5.0, "review_text": "Thoroughly enjoyed this book. Lots of twists and turns in tbe plot.  I couldnt put it down and read it all the way through in one go"}, {"review_sentiment": 5.0, "review_text": "love it"}, {"review_sentiment": 5.0, "review_text": "Another good book by baldacci easy read with plenty of action.  Make sure to read series in order story is great"}, {"review_sentiment": 5.0, "review_text": "I love the Camel Club."}, {"review_sentiment": 5.0, "review_text": "Excellent read"}]}, "authors": ["David Baldacci"], "isbn": "0446615641", "longitude": -77.0366456, "periods": ["2000s"], "title": "Stone Cold (Camel Club Series)", "word_cloud": "always enjoy camel great exciting speculate end enjoy adventure camel excite series hard put thoroughly enjoy twist turn tb plot couldn't put way go love good baldacci easy plenty action sure series order story great love excellent", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 3/5 in the Camel Club Series\r\n\r\nOliver Stone, the leader of the mysterious group that calls itself the Camel Club, is both feared and respected by those who've crossed his path. Keeping a vigilant watch over our leaders in Washington D.C., the Camel Club has won over some allies, but it has also earned formidable enemies-including those in power who will do anything to prevent Stone and his friends from uncovering the hidden, secret work of the government.\r\n\r\nAnnabelle Conroy, an honorary member of the Camel Club, is also the greatest con artist of her generation. She has swindled forty million dollars from casino king Jerry Bagger, the man who murdered her mother. Now he's hot on her trail with only one goal in mind: Annabelle's death. But as Stone and the Camel Club circle the wagons to protect Annabelle, a new opponent, who makes Bagger's menace pale by comparison, suddenly arises.\r\n\r\nOne by one, men from Stone's shadowy past are turning up dead. Behind this slaughter stands one man: Harry Finn. To almost all who know him, Finn is a doting father and loving husband who uses his skills behind the scenes to keep our nation safe. But the other face of Harry Finn is that of an unstoppable killer who inevitably sets his lethal bull's-eye on Oliver Stone. And with Finn, Stone may well have met his match.\r\n\r\nAs Annabelle and the Camel Club fight for their lives, the twists and turns whipsaw, leading to a finale that is as explosive as it is shattering. And when buried secrets are at last violently resurrected, the members of the Camel Club left standing will be changed forever.\r\n\r\nWith unrelenting pacing, stunning reversals, and two of the most compelling characters in modern fiction, STONE COLD is David Baldacci writing at his breathtaking best.", "asin": "0446615641", "rank": "35045", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/41CrTWwygQL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}