{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 2314, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "A great start to an intriguing thriller series.  Well crafted. You can see why the author & character is popular."}, {"review_sentiment": 5.0, "review_text": "Thoroughly enjoyed the many mind games that were integral to the plot. A  novel of many twists and turns.  I Will definitely read this author again. A break from non fiction."}, {"review_sentiment": 4.0, "review_text": "Great book, good movie"}, {"review_sentiment": 5.0, "review_text": "The first of the Cross books, Patterson introduces the main character and causes you to want to learn more about this man.  What an interesting, diverse individual he created!I can't wait to see what he gets in to next."}, {"review_sentiment": 5.0, "review_text": "this book and series is the best there is. It is entertaining but includesz graphic content.love this and keep writingv james patterson and more alex cross"}, {"review_sentiment": 5.0, "review_text": "Good read, suspenseful"}, {"review_sentiment": 5.0, "review_text": "Its a great movie. I recommend"}, {"review_sentiment": 4.0, "review_text": "I really enjoyed this book. I like the books featuring Alex Cross. I want to read all the books in the series. I remember watching the movie by the same name. It was very good. This book has plenty of twists and turns that kept me wanting to read more. Onto the 2nd book"}, {"review_sentiment": 5.0, "review_text": "Great read - kept me interested all the way through"}, {"review_sentiment": 5.0, "review_text": "As promised, I went back and read this, the first Alex Cross novel.  Great action that kept me guessing for most of the book.  Thriller of an ending.  Can't wait for the next book"}]}, "authors": ["James Patterson"], "isbn": "0446364193", "longitude": -77.0366456, "periods": ["2000s"], "title": "Along Came A Spider", "word_cloud": "great start intrigue thriller series craft see author character popular thoroughly enjoy many mind game integral plot many twist turn definitely break non fiction good movie first introduces main character cause want learn man interesting diverse individual create get next series best entertain includes graphic writing james patterson alex cross good suspenseful great movie recommend really enjoy feature want series remember watch movie name good plenty twist turn want keep interested way promise go back first action keep guess end wait", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A missing little girl named Maggie Rose. A family of three brutally murdered in the projects of Washington, D.C. The thrill-killing of a beautiful elementary school teacher.\r\n\r\nA psychopathic serial kidnapper/murderer who calls himself the Son of Lindbergh. He is so terrifying that the FBI, the Secret Service, and the police cannot outsmart him - even after he's been captured.\r\n\r\nGary Soneji is a mild-mannered mathematics teacher at a Washington, D.C., private school for the children of the political and social elite. He's so popular that the kids all call him \"Mr. Chips.\" And he's very, very smart. Growing up, he always knew he was smarter than the rest of them - he knew that the Great Ones always fooled everybody. He kidnaps Maggie Rose, the golden-haired daughter of a famous movie actress, and her best friend, Shrimpie Goldberg, the son of the secretary of the treasury, right out from under the noses of their two Secret Service agents. But Gary Soneji is not surprised at his skill. He's done it before. Hundreds of times before.\r\n\r\nAlex Cross is a homicide detective with a Ph.D. in psychology. he looks like Muhammad Ali in his prime. Cross works and lives in the ghettos of D.C. He's a tough guy from a tough part of town who wears Harris Tweed jackets and likes to relax by banging out Gershwin tunes on his baby grand piano. He has two adorable kids of his own. They are his own special vulnerabilities.\r\n\r\nJezzie Flanaganis the first woman ever to hold the highly sensitive job as supervisor of the Secret Service in Washington. Blond, mysterious, seductive, she's got an outer shell that's as tough s it is beautiful. She rides her black BMW motorcycle at speeds of no less than 100 mph. What is she running from? What is her secret?\r\n\r\nAlex Cross and Jezzie Flanagan are about to have a forbidden love affair-at the worst possible time for both of them. Because Gary Soneji, who wants to commit the \"crime of the century,\" is playing at the top of his game. The latest of the unspeakable crimes happened in Alex Cross's precinct. They happened under the protection of Jezzie Flanagan's men. Now Soneji is at large again, still wreaking havoc.\r\n\r\nAlex Cross must face the ultimate test as a psychologist: how do you outmaneuver a brilliant psychopath? Especially one who appears to have a split personality - one who won't let the other half remember those horrific acts?\r\n\r\nSoneji has outsmarted the FBI, the Secret Service, and the police. Who will be his next victim?\r\n\r\nGary Soneji is every parent's worst nightmare. He has become Alex Cross's nightmare. And now, reader, he's about to become yours.", "asin": "0446364193", "rank": "11316", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/5121oHelHRL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}