{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 6, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "I really liked it. Héctor is such a cool and sometimes clumsy character. Very funny moments. A good description of the 80s Mexico city devastated by the earthquake."}, {"review_sentiment": 4.0, "review_text": "Spanish-born, Mexican-raised author Paco Ignacio Taibo II's philosophical, one-eyed gumshoe Héctor Belascoarán Shayne rises from the dead for another novel. Tranlsated from Spanish, \"Return to the Same City\" isn't about the physical Mexico City and Acapulco (although it helps to be familiar with their respective politics). Instead, \"Return to the Same City\" is about Shayne's reacquaint with himself - his life after his death in 1993's \"No Happy Ending\".His first case after some recuperation, Shayne (half-Irish, on his mother's side) investigates a woman's claim that her brother-in-law is involved in some shady business. Under multiple pseudonyms, the criminal makes deals with politicians, government agents, and drug dealers. With the help of an alcoholic American reporter, Shayne follows the mysterious man to Acapulco. What's really going on here? Who is this mysterious man? Even better: who is the client?Allusions to the hard-boiled fiction masters are scattered throughout Taibo's novel, especially that of Raymond Chandler. Shayne thinks to himself that \"Chandler forgot to prohibit detectives from getting metaphysical\". Well, that's plenty made up for in \"Return to the Same City\"; Shayne often waxes poetic on his rebirth and on returning to Mexico City.It's an engaging read, even if the previous novels about Shayne have not been read. It can stand on its own, and may work best this way since his resurrection is glossed over by both author and character."}, {"review_sentiment": 5.0, "review_text": "Surreal and funny, this book is full of atmosphere and presence.  Warning:  some things don't make perfect sense, but yet again they do.  You need to suspend judgment and accept things as they are."}, {"review_sentiment": 5.0, "review_text": "This book will make you laugh and cry . . . but if you are a conservative aging white male you won't appreciate PI Taibo II's extravagant sense of humour."}, {"review_sentiment": 1.0, "review_text": "Unfortunately, this doesn't live up to the admiring blurb on its cover from the author of \"Like Water for Chocolate\" which calls the author's work \"intelligent.\" The main character is a one-eyed  Mexican detective with some far-fetched quirks who thinks in Marxist  slogans. This would be fine, except the author has placed him in a  predictable Communist morality tale, where the bad guy is an evil  Cuban-American \"gusano\" with ties to the CIA, being pursued by an  alcoholic-but-heroic left-wing gringo reporter and our hero. It turns out  they are being guided and manipulated by the Castro-Cuban and Sandinista  secret police (one of the few realistic touches) to do their dirty work for  them. When he discovers this (somewhat after the reader) instead of giving  our hero second thoughts this delights him, since he sees it as joining  forces with fellow travelers in the global anti-imperialist struggle.  Basically, the whole thing is about as intelligent (with about as developed  a plot) as a Rius \"Marxism for Beginners\" comic book. It's a  waste of time unless (seriously) you're interested in Marxist literature  caricaturing itself."}, {"review_sentiment": 4.0, "review_text": "Paco Ignacio Taibo's existence-beleaguered private eye continues to roam the streets of Mexico City in search of good sense and moral behavior even after his apparent death. The P.I.'s name, Shayne, plays off the traditional P.I. -- represented by Brett Halliday's character Mike Shayne -- and the lone-outsider-as-hero -- represented by Jack Schaeffer's/Alan Ladd's cowboy Shane. With none of the boisterous control of the former and never quite attaining the quiet dignity of the latter, Taibo's Shayne feels the weight of his Mexico City -- one part Chaos Theory, one part Entropy, one part gritty-greedy-urban-monster -- as it bears down on its inhabitants, who look for fun and hope in every unlikely place. Shayne wants things to be simple and to make sense, but they rarely do in his world, no matter how hard he tries to make it so. World weary, witty, and marvelously funny, I'm glad Shayne came back from the dead. I hope we see more of his adventures in translation."}]}, "authors": ["Paco Ignacio Taibo II"], "isbn": "0446405205", "longitude": -99.1333416, "periods": ["1900s"], "title": "Return to the Same City", "word_cloud": "really like cool sometimes clumsy character funny moment good description devastate earthquake author philosophical gumshoe rise dead translated spanish physical help familiar respective politics instead reacquaint life death first case recuperation mother side investigate woman claim involve shady business multiple pseudonym criminal make deal politician government agent drug dealer help alcoholic american reporter follow mysterious man really go mysterious man even better client fiction master scatter especially think forget prohibit detective get metaphysical plenty make often wax poetic rebirth return engage even previous novel shane best way resurrection gloss author character surreal funny full atmosphere presence thing make perfect sense yet need suspend judgment thing make laugh cry conservative age white male extravagant sense humor unfortunately live admire blurb cover author call author work intelligent main character detective quirk think marxist slogan author place predictable communist morality tale bad guy evil guano tie pursue gringo reporter hero turn guide manipulated secret police realistic touch dirty work discovers somewhat instead give hero second thought delight see join force fellow traveler global struggle whole thing intelligent develop plot comic waste time seriously interested marxist literature caricature private eye continue roam street search good sense moral behavior even apparent death name play traditional represent character represent cowboy none boisterous control former never quite attain quiet dignity latter feel weight part part part bear inhabitant fun hope unlikely place want thing simple make sense rarely world matter hard try make weary witty marvelously funny glad come back dead hope adventure", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Hector Belascoaran Shayne is a gun-carrying argonaut of Mexico City, a man with a death wish waiting to come true. When a woman tells him a sob story about her sister's death at the hands of a handsome rumba dancer, Belascoaran agrees to take care of him. \r\n\r\nThe P.I.'s hunt leads him to the shores of Acapulco Bay where he discovers that his charismatic murderer leads a dangerous life involving CIA operatives and stolen archaeological treasures. But the deeper Belascoaran digs, the closer he comes to fulfilling his own dark desire, as his chase leads him to Tijuana for a confrontation with a killer.", "asin": "0446405205", "rank": "5026736", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51NFAWQJ4JL.jpg", "country": "Mexico", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}