{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 535, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "One of the best thrillers written by Ken Follett."}, {"review_sentiment": 5.0, "review_text": "After the second  World War the winning countries seriously stepped up intelligence collection on one another and emerging Middle Eastern growing powers as the World looked for a new power order. Triple is about this spying Spider-web  of spies that began at that time.  Only Ken Follett could keep all these characters straight for the reader and still  create a masterpiece with a real love story that is intertwined within the story ( not just s Bond girl); and a multidimensional hero. . Only Ken Follett could keep all this understandable for the average"}, {"review_sentiment": 4.0, "review_text": "Follet works his fiction magic against the tapestry of history. Lots of action, suspense and devotion. Not his best stuff but even his average is better than most authors best."}, {"review_sentiment": 5.0, "review_text": "excellent, action packed!!!"}, {"review_sentiment": 5.0, "review_text": "Typical Follett. Wonderful read."}, {"review_sentiment": 5.0, "review_text": "I really enjoy historical novels and this one is a great read."}, {"review_sentiment": 4.0, "review_text": "SECONG TIME I READ IT.STILL A GOOD READ."}, {"review_sentiment": 2.0, "review_text": "To many characters and a convoluted storyline. Don't put it  down for to many days or you'll never figure it out. He is capable of much better."}, {"review_sentiment": 1.0, "review_text": "This was hyped as a new book. It wasn't. It is a reprint of a book for that road many years ago. Very disappointing. I read the first 30 pages and recognize the plot immediately"}, {"review_sentiment": 5.0, "review_text": "Mr. Follett never disappoints. Learned another chunk of history and enjoyed every word of it.On to the next Follett story."}]}, "authors": ["Ken Follett"], "isbn": "0451476689", "longitude": 31.243666, "periods": ["1900s", "Recent Releases"], "title": "Triple", "word_cloud": "best thriller write second win country seriously step intelligence collection emerge grow power look new power order spy spy begin time only character straight still masterpiece real love story intertwine story girl multidimensional hero only understandable average work fiction magic tapestry history action suspense devotion not best stuff even average better author best excellent action pack typical really historical novel great second read good read many character convolute story line put many day never figure capable much better hype new reprint road many year ago very disappointing first page recognize plot immediately never disappoints learn chunk history enjoy word story", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "Action & Adventure"], "summary": "Triple is the story of the most successful espionage coup - and best-kept secret - of this century. This taut espionage thriller comes from master of the genre, Ken Follett.\r\n\r\nIt is 1968. Israeli intelligence has learned that Egypt, with Soviet help, will develop atomic bombs within months - an untimely end for the young nation unless a source of uranium for Israeli bombs can be had in complete secrecy. Impossible, of course, unless someone as improbable as the plan can be found to steal it.\r\n\r\nWorking alone, Israeli agent Nat Dickstein concocts an ingenious scenario for the biggest, and quietest, hijacking in history. Against him are the Russian KGB, Egyptian Intelligence and the Arab extremist Fedayeen. With him is a half-English, half-Arab young woman of uncertain allegiance, who discovers Dickstein's Achilles heel.\r\n\r\n\"A literally earth-shaking confrontation.\" The New York Times", "asin": "0451476689", "rank": "186413", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51L4w4yrY9L.jpg", "country": "Egypt", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}