{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 564, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "After the shock of the last chapter, I had to look up some of the technical terms.  Once I understood more clearly, it still required a long brisk walk to process it all.  And then I loved it.  As the book sums it up: \"The Holy Spirit has done its work. They had picked the right man\" (p.390 paper ed.). Again, an internet search of the technical terms is strongly recommended; it's not exactly what I first thought.  But ultimately it's a win-win for the Church and for the faithful. Especially after slogging through all that venal \"sausage being made\" in selecting a Pope.Although perhaps not entirely credible that someone in his position would do that, another high point was Cardinal Lomeli's marvelous extemporaneous homily on Paul's letter to the Ephesians (pp. 124-128) - which of course, was distorted and loudly criticized afterwards by one of the ingredients in \"the sausage\" (an overly-ambitious Cardinal).Amazingly (but I suppose Harris researched all this), the sequestered Cardinals were served their ample food & drink by women!  Even more incongruously, they were nuns of the Daughters of Charity of St. Vincent de Paul.  This ancient order had endured several martyrs over the centuries.  As Harris cuttingly notes: \"Its members had not given up their lives in order to become waitresses for cardinals.  Its charism was supposed to be service to the poor\" (p.264).I also doubted that the 75-year old Cardinal Lomeli could have functioned as well as he did on so little sleep and nourishment.  But although he cut a few corners, he certainly got to the bottom of things.Except for one \"slowish\" section, an absolutely fascinating read.  For me, 4-1/2 stars."}, {"review_sentiment": 5.0, "review_text": "were so well constructed. You felt you were there. Obviously it was well studied. It gave me hope for the future."}, {"review_sentiment": 1.0, "review_text": "A deceptive, manipulative book. The last 3 pages were a complete, gratuitous and blindsided shocker. The book led me along with great detail of the Vatican and the Conclave, scandal and pathos, keeping me on the edge of my seat from page to page. But I warn readers, the last 3 pages are not pleasant to any person who respects the Church. I was thoroughly enraged and completely disappointed that I let the author take me a long a very interested and engrossing story to the point where he laid the bombshell on me. It was a dirty literary trick to get a cheap shot at the dignity of the Church and the Papacy. I should have known better than to read a popular author writing fiction about the Church."}, {"review_sentiment": 5.0, "review_text": "A great read !"}, {"review_sentiment": 5.0, "review_text": "First read 1964 and have followed HarrisConclave is. A real page turner with surprise endingAwesome read it is"}, {"review_sentiment": 5.0, "review_text": "Gripping from start to end!"}, {"review_sentiment": 5.0, "review_text": "Having just visited the Vatican, this novel seemed so realistic. Congratulations, Mr. Harris. A superb read. Thoroughly enjoyed al the twists and turns especially the ending. Wow! What a ride! Thanks, Paul"}, {"review_sentiment": 3.0, "review_text": "Interesting story, but not thrilling enough."}, {"review_sentiment": 1.0, "review_text": "Boring. Oh so boring"}, {"review_sentiment": 5.0, "review_text": "vary interesting novel i am enjoying the reading of the various complexity that go on in a conclave and other institions"}]}, "authors": ["Robert Harris"], "isbn": "0451493443", "longitude": 12.4829321, "periods": ["2000s", "Recent Releases"], "title": "Conclave: A novel", "word_cloud": "shock last chapter look technical term understand clearly still require long brisk walk process love sum do work pick right man paper internet search technical term strongly recommend exactly first think ultimately faithful especially slog venal sausage make select perhaps entirely credible someone position high point marvelous extemporaneous homily letter pp course distort loudly criticize afterwards ingredient sausage suppose research sequestered serve ample food drink woman even incongruously nun ancient order endure several martyr century cuttingly note member give life order become waitress cardinal chrism suppose service poor also doubt old well little sleep nourishment cut corner certainly get bottom lowish section absolutely fascinate star well construct felt obviously well study give hope future deceptive manipulative last page complete gratuitous blindside shocker lead great detail scandal pathos keep edge seat page page warn reader last page pleasant person respect thoroughly enrage completely disappointed let author long interested engross story point lay dirty literary trick get cheap shot dignity know better popular author write fiction church great first follow real page turner surprise ending awesome grip start end have visit seem realistic superb enjoy al twist turn especially end ride interest story thrill enough bore boring vary interest enjoy read various complexity go conclave institution", "genres": ["Fiction & Literature", "Mystery & Suspense", "Politics"], "summary": "The best-selling author of Enigma and Fatherland turns to today's Vatican in a ripped-from-the-headlines novel, and gives us his most ambitious, page-turning thriller yet--where the power of God is nearly equaled by the ambition of men.\r\n\r\nThe pope is dead. Behind the locked doors of the Sistine Chapel, one hundred and eighteen cardinals from all over the globe will cast their votes in the world's most secretive election. They are holy men. But they have ambition. And they have rivals. Over the next seventy-two hours one of them will become the most powerful spiritual figure on Earth.\r\n\r\n“Harris has written a gripping, smart book. . . . This could become the Catholic version of The Satanic Verses.” The New York Times Book Review", "asin": "0451493443", "rank": "175441", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/513ql%2BgBAcL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}