{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 1666, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Gorgeous cover. Beautiful pages that look somewhat edged as if torn from aging. Wonderfully thick but easy to read. With lovely intro to Victor Hugo's classic."}, {"review_sentiment": 5.0, "review_text": "That Les Miserables is one of the two greatest novels of all time goes without saying, the other being Don Quixote.  Reading Les Mis might seem a challenge—the author expounds at length on topics as diverse as the Battle of Waterloo and the sewers of Paris.  But they always relate to, and carry the reader back to, the story of Jean Valjean; and, oh what a story.  Volumes have been written about this book, but it need only be said that Les Miserables is the foremost expression of grace and redemption ever penned.  These—grace and redemption—are Jean Valjean’s Bishop’s two candlesticks.  To invest your time in a read of this masterpiece is to absorb the meaning of love, mercy, and compassion."}, {"review_sentiment": 4.0, "review_text": "In his preface for Les Misérables, Victor Hugo wrote, “[So] long as misery and ignorance remain on earth, books like this cannot be useless.” The story is only one of a number of works written by Hugo, but it is arguably his most recognized. Published in 1862 and partly based on the events of the June Rebellion of 1832, Les Misérables is not only one of the longest books ever written but it is also considered one of the most important novels ever written.Though the novel has numerous subplots, the story is at heart a social commentary on the injustices faced by the vulnerable and poor. Les Mis was an artistic endeavor meant to spur the radical change that the French Revolution promised but failed to deliver. It was an attack on the class structures that allowed extreme poverty to exist and the politics that allowed undeserved power to perpetuate and corrupt. Hugo’s commentary is modern in its stance, postulating that wretched situations beget desperate, and at times reprehensible, actions.As in many of the nineteenth century classics, childhood is a raw, dangerous time in Les Mis, but Hugo also presents the idea that youth is a transformative force in society once they find something about which to be passionate. Family is presented as both a luxury and a burden, and it is more than blood that builds the bonds of family. Only the strong and tenacious survive in Hugo’s France, and appearances are often untrustworthy.Moralistic and sympathetic in tone, the novel is written from an omniscient third person perspective with authorial interjections. Hugo oft times steps in to instruct the reader on what to think of several of the characters. The author’s style is eloquent and observational, lyrical and vivid, and the realism of the tome is gripping as the hardships and ugliness of humanity are explored.Hugo’s novel is a brilliant social commentary and an epic character drama. The tale provides the reader with a stunning glimpse into the society, politics, and economy of nineteenth century France. A story of suffering and resilience, love and sacrifice, justice and abuse of power, Les Misérables is a lesson in compassion and mercy that continues to resonate.__________RecommendationHighly recommended for fans of monumental classics, novels heavy on social commentary, and the history of nineteenth century France"}, {"review_sentiment": 1.0, "review_text": "This book only includes 122 pages - not the 828 pages as listed. Only includes some excerpts and lines."}, {"review_sentiment": 3.0, "review_text": "Maybe it's the English translation but, Hugo is just a little too picky with details for me.He rambles on and on about the interior decoration of an Archbishops home and otherdetails that just drove me up the wall!"}, {"review_sentiment": 1.0, "review_text": "Watch out for this!  Amazon claims it is the MacAfee translations, when it is in fact the Hapgood translation."}, {"review_sentiment": 5.0, "review_text": "Classic."}, {"review_sentiment": 1.0, "review_text": "Soft cover book is only first 100 pages - It legitmately stops mid sentence halfway through volume 1.  Do not buy"}, {"review_sentiment": 3.0, "review_text": "I have heard many good things about this book and have yet to read it. The reason I am giving it three stars is because it is an abridged version of the book. I did not know this when I bought it. I wish the publisher had published the unabridged version. But other than that, the actual Macmillan book is very beautiful. Convenient for reading on the go, fits a right in your pocket or purse."}, {"review_sentiment": 5.0, "review_text": "Very nice printed version"}]}, "authors": ["Victor Hugo"], "isbn": "045141943X", "longitude": 2.3514992, "periods": ["1800s"], "title": "Les Miserables", "word_cloud": "gorgeous cover page look somewhat edged torn age thick easy lovely intro classic greatest novel time go say author expounds length topic diverse sewer always carry back story story write need say foremost expression grace redemption ever pen jean candlestick time masterpiece absorb meaning love mercy compassion preface write so long misery ignorance remain earth story number work write arguably recognize partly base event longest ever write also consider important novel ever numerous subplots story heart social commentary injustice face vulnerable poor artistic endeavor mean spur radical change french promise fail class structure allow extreme poverty exist politics allow undeserved power perpetuate corrupt commentary modern stance postulate wretched situation beget desperate time reprehensible many nineteenth century classic childhood raw dangerous time also present idea youth trans formative force society find something passionate present luxury burden blood build bond family only strong tenacious survive appearance often sympathetic tone write omniscient third person perspective authorial interjection oft time step instruct think several character author style eloquent observational lyrical vivid realism tome grip hardship ugliness humanity brilliant social commentary epic character drama tale provide stunning glimpse society politics economy nineteenth century story suffer resilience love sacrifice justice abuse power lesson compassion mercy continue recommend fan monumental classic novel heavy social commentary history nineteenth century include page page list only include excerpt line maybe english translation little picky detail ramble interior decoration home other details drive wall claim translation fact translation classic soft cover first page legitimately stop mid sentence halfway volume hear many good thing yet reason give star abridge version know buy wish publisher publish unabridged version actual beautiful reading go fit right pocket purse very nice print version", "genres": ["Fiction & Literature"], "summary": "ntroducing one of the most famous characters in literature, Jean Valjean—the noble peasant imprisoned for stealing a loaf of bread—Les Misérables ranks among the greatest novels of all time. In it, Victor Hugo takes readers deep into the Parisian underworld, immerses them in a battle between good and evil, and carries them to the barricades during the uprising of 1832 with a breathtaking realism that is unsurpassed in modern prose. Within his dramatic story are themes that capture the intellect and the emotions: crime and punishment, the relentless persecution of Valjean by Inspector Javert, the desperation of the prostitute Fantine, the amorality of the rogue Thénardier, and the universal desire to escape the prisons of our own minds. \r\n\r\nLes Misérables gave Victor Hugo a canvas upon which he portrayed his criticism of the French political and judicial systems, but the portrait that resulted is larger than life, epic in scope—an extravagant spectacle that dazzles the senses even as it touches the heart.", "asin": "045141943X", "rank": "8078", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51P01h3DZtL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}