{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 361, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "It's a nice story, but with a twist at the end."}, {"review_sentiment": 5.0, "review_text": "great product"}, {"review_sentiment": 5.0, "review_text": "Good read."}, {"review_sentiment": 5.0, "review_text": "Excellent play."}, {"review_sentiment": 5.0, "review_text": "Well written and absolutely astounding. It was my favorite play I've read this year so far in 2017."}, {"review_sentiment": 5.0, "review_text": "Arrived very quickly, my daughter needed it for school."}, {"review_sentiment": 5.0, "review_text": "all good"}, {"review_sentiment": 5.0, "review_text": "Great Item! Exactly as described."}, {"review_sentiment": 5.0, "review_text": "Classic!"}, {"review_sentiment": 5.0, "review_text": "A classic, must read. Enjoyed the book very much and will want to read it again."}]}, "authors": ["Tennessee Williams"], "isbn": "0451163168", "longitude": -90.0701156, "periods": ["1900s"], "title": "A Streetcar Named Desire (Signet)", "word_cloud": "nice story twist end great product good excellent play well write absolutely astound favorite play year far quickly daughter need school good describe classic classic much want", "genres": ["Drama"], "summary": "A Streetcar Named Desire is a 1947 play written by American playwright Tennessee Williams which received the Pulitzer Prize for Drama in 1948. \r\n\r\nA Streetcar Named Desire is one of the most remarkable plays of our time. It created an immortal woman in the character of Blanche DuBois, the haggard and fragile southern beauty whose pathetic last grasp at happiness is cruelly destroyed. It shot Marlon Brando to fame in the role of Stanley Kowalski, a sweat-shirted barbarian, the crudely sensual brother-in-law who precipitated Blanche's tragedy.\r\n\r\nA Streetcar Named Desire is often regarded as among the finest plays of the 20th century, and is generally considered to be Williams' greatest.\r\n\r\n", "asin": "0451163168", "rank": "591369", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51qFmUUtqnL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}