{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 28.6517178, "ratings": {}, "authors": ["Diksha Basu"], "isbn": "0451498917", "longitude": 77.2219388, "periods": ["2000s", "Recent Releases"], "title": "The Windfall", "word_cloud": "", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "A heartfelt comedy of manners, Diksha Basu’s debut novel unfolds the story of a family discovering what it means to “make it” in modern India.\r\n \r\nFor the past thirty years, Mr. and Mrs. Jha's lives have been defined by cramped spaces, cut corners, gossipy neighbors, and the small dramas of stolen yoga pants and stale marriages. They thought they'd settled comfortably into their golden years, pleased with their son’s acceptance into an American business school. But then Mr. Jha comes into an enormous and unexpected sum of money, and moves his wife from their housing complex in East Delhi to the super-rich side of town, where he becomes eager to fit in as a man of status: skinny ties, hired guards, shoe-polishing machines, and all.\r\n \r\nThe move sets off a chain of events that rock their neighbors, their marriage, and their son, who is struggling to keep a lid on his romantic dilemmas and slipping grades, and brings unintended consequences, ultimately forcing the Jha family to reckon with what really matters. Hilarious and wise, The Windfall illuminates with warmth and charm the precariousness of social status, the fragility of pride, and, above all, the human drive to build and share a home. Even the rich, it turns out, need to belong somewhere.\r\n\r\n\"The right sort of summer refreshment.” The New York Times ", "asin": "0451498917", "rank": "87489", "city": "Delhi", "image": "https://images-na.ssl-images-amazon.com/images/I/416D2xeaY1L.jpg", "country": "India", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}