{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 3, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Not what I was expecting. Witty social comedy with some zingers that still work today."}, {"review_sentiment": 4.0, "review_text": "Having to read it in 1964 I had my doubts. But a book club assignment is serious to me.Really enjoyed it! Had a modern feel, with the idea of person whose hubris changes his life. And that of his family and others.I would recommend it. Well written, so understandable it was a \"classic\" for some of us in school."}, {"review_sentiment": 5.0, "review_text": "A fine Victorian novel"}]}, "authors": ["William Dean Howells"], "isbn": "0451471458", "longitude": -71.0595678, "periods": ["1800s"], "title": "The Rise of Silas Lapham", "word_cloud": "not expect social comedy zinger still work today have doubt club assignment serious enjoy modern feel idea person hubris change life family write understandable classic school fine victorian", "genres": ["Fiction & Literature"], "summary": "The Rise of Silas Lapham was the first important novel to center on the American businessman and the first to treat its theme with a realism that foreshadowed the work of modern writers. \r\n\r\nIn his story of one of the millionaire industrialists who flourished in the post-Civil War years, William Dean Howells probes the moral and social conflicts that confront a self-made man trying to crash Boston’s old-guard aristocracy. Silas Lapham is a man of conscience who fully realizes his folly; but he is also an ambitious man who lets his aspirations lead him to risk both his fortune and his family’s happiness for status in a society that will never truly accept him.\r\n \r\n“His perceptions were sure, his integrity was absolute,” wrote Henry Seidel Canby of William Dean Howells, whom he credited as being “responsible for giving the American novel form.”", "asin": "0451471458", "rank": "628145", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/51Y6YcdnF3L.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}