{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 204, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Engaging book, particularly for us as we headed for Barcelona."}, {"review_sentiment": 4.0, "review_text": "Enjoyed for local color in advance of my first trip to Barcelona. Book drags in the final quarter, especially when the outcome is rather obvious.  But a good read for  cultural history and some geography."}, {"review_sentiment": 5.0, "review_text": "i love reading historical novels.  Mr. Falcones did his research and presented a moving story about one man's life in a very desperate time in history.  I learned more about the inquisition than ever before.  Also such moving and compassionate relationships between Arnau and those of different religious views.  Timely in today's world-can we ever learn from history?"}, {"review_sentiment": 4.0, "review_text": "Great story, Gets you from the start, but it is a little too long."}, {"review_sentiment": 3.0, "review_text": "Interesting story but too many details for me and too long.  Parts of it read like a boring history text book."}, {"review_sentiment": 5.0, "review_text": "Interesting combination of history and fiction."}, {"review_sentiment": 5.0, "review_text": "One of the best books I've read.  Great story that runs a couple of generations mixed with interesting historical facts about the 1300s in Catalonia.  Falcones is a superb storyteller."}, {"review_sentiment": 5.0, "review_text": "Read this is Spanish awhile back, but I love this book so much I wanted to reread in my native language (English). It's a great story set around the Born cathedral, really interesting."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "This was a thrilling and captivating novel portraying Barcelona in the medieval ages.  This is my 2nd novel by Ildefonso Falcones, and the author delivered the story and plot like no other.  A story of treachery, battle, destitution, sickness, death, love, betrayal, hardship; all life circumstances in an era filled with mystery and intrigue.  From the moment you read the first chapter to the end (600 pages); you will endure the life of a peasant, a baron, a nobleman or noblewoman, a prostitute, a warrior, a witch, a friar, an inquisitor and a king.  I cant wait to see the real structure of the Santa Maria and the Sea and to imagine in the year 1300 all of bastaixos carrying on their backs the stones needed to build her.  Long live Via Fora!!!  ,"}]}, "authors": ["Ildefonso Falcones"], "isbn": "0451225996", "longitude": 2.1774322, "periods": ["500-1400s"], "title": "Cathedral of the Sea: A Novel", "word_cloud": "engage particularly head local color advance first trip drag final quarter especially outcome rather obvious good cultural history geography read historical novel research present move story man life desperate time history learn inquisition ever also move compassionate relationship different religious view timely today ever learn history story start little long interest story many detail long part bore history text interest combination history fiction best story run couple generation mixed interesting historical fact superb storyteller read back love much want reread native language great story set really interest excellent thrill captivate portray medieval age author deliver story plot story treachery battle destitution sickness death love betrayal hardship life circumstance era fill mystery intrigue moment first chapter end page endure life peasant baron nobleman noblewoman prostitute warrior witch friar inquisitor king cant wait see real structure imagine year bastaixos carry back stone need build long live", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "The “riveting”(The Washington Post) #1 international bestseller—now in paperback in the U.S.\r\n\r\nIn the tradition of Ken Follett’s The Pillars of the Earth, here is a thrilling historical novel of friendship and revenge, plague and hope, love and war, set in the golden age of 14th-century Barcelona. Arnau Estanyol arrives in Barcelona and joins the powerful guild of stone-workers building the magnificent cathedral of Santa Maria del Mar, while his adoptive brother Joan studies to become a priest. As Arnau prospers, he secretly falls in love with a forbidden woman. When he is betrayed and hauled before the Inquisitor, he finds himself face-to-face with his own brother. Will he lose his life just as his beloved cathedral is finally completed, or will his brother spare him?", "asin": "0451225996", "rank": "118053", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/5126%2BY9mN4L.jpg", "country": "Spain", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}