{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 6092, "rating": 4.5, "reviews": [{"review_sentiment": 3.0, "review_text": "The pages are yellowed as if the book has been sitting in the back of an old book store forgotten for quite some time. Time has forgotten this book.The quality of the book itself was questionable. But the quality of what the book contained however is not. The story is immeasurable. However the story itself is timeless. As days go by and Presidents come and go. Each day we see \"Big Brother\" take a little big more \"thought control\" and that is something that Orwell so masterfully broadcast in this novel of his. Amazing piece of literature to be sure. Do not look for a happy ending. There is not one. But look for what what can be done in our life to keep from what \"could be\"."}, {"review_sentiment": 5.0, "review_text": "Must read for all people everywhere!  Very topical and relevant to now.  Def a classic.  Don't delay read right now."}, {"review_sentiment": 5.0, "review_text": "I saw the movie, and have been dying to read the book, but this is a must read for anyone obsessed with making things “cleaner” “safer” etc. the book itself is based on Winston, a man who is a newspaper editor, and he has to censor out everything that history has reported. He goes on to write his own book to oppose the party through his own thoughts and ideas, these are my favorite parts of the book:1. Even idiocy is seen as intelligence2. The poor would learn to become literate, think for themselves and would eventually take over thus, creating a hierarchical society3. “I hate purity, I hate goodness, I wish everyone were corrupt to the bones as we are!”4. How dare we look at anything that horrifies us!5. War is peace, freedom is slavery, ignorance is strength!"}, {"review_sentiment": 5.0, "review_text": "fantastic. must read"}, {"review_sentiment": 4.0, "review_text": "Allows you to delve into socialistic ideals and gives you an idea of how life would be if our rights as a people are infringed."}, {"review_sentiment": 3.0, "review_text": "I took me a long time to read it and I believe there are parts I didn’t understand, I didn’t see it as a story it was more like a description of a state as imagined by the writer the events were not thrilling nor interesting but the idea is amazing"}, {"review_sentiment": 4.0, "review_text": "Unbelievable how back at the time of Orwell, he could have predicted the world we live in now. Controlled by our politicians and financial institutions and at the mercy of capitalism and social media!"}, {"review_sentiment": 5.0, "review_text": "great book, one of my favorite books that i've bought off  of here."}, {"review_sentiment": 5.0, "review_text": "A billion times better than \"Brave New World\"."}, {"review_sentiment": 5.0, "review_text": "Scary to re-read this almost forty years later and find our political climate way too similar to Orwell's tale."}]}, "authors": ["George Orwell"], "isbn": "0451524934", "longitude": -0.12574, "periods": ["1900s"], "title": "1984", "word_cloud": "page yellow sit back old store forget quite time forgotten quality questionable quality contain however story immeasurable however story timeless day go come day see big take little big think control something masterfully broadcast piece literature sure happy end do life keep must people everywhere very topical relevant classic right saw movie die anyone obsess make thing cleaner safer base man newspaper editor censor everything history report go write oppose party thought idea favorite part even idiocy see poor literate think eventually thus create hierarchical hate purity hate goodness wish everyone corrupt bone dare look anything horrify peace freedom slavery ignorance strength fantastic delve socialistic ideal give idea life right people infringe take long time believe part understand see story description state imagine writer event thrill interesting idea amazing unbelievable back time world live politician financial institution mercy capitalism social medium great favorite buy time better scary almost forty year later find political climate way similar tale", "genres": ["Fiction & Literature"], "summary": "Written in 1948, 1984 was George Orwell’s chilling prophecy about the future. And while 1984 has come and gone, Orwell’s narrative is timelier than ever. 1984 presents a startling and haunting vision of the world, so powerful that it is completely convincing from start to finish. No one can deny the power of this novel, its hold on the imaginations of multiple generations of readers, or the resiliency of its admonitions—a legacy that seems only to grow with the passage of time.", "asin": "0451524934", "rank": "346", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/31l24hBKHaL.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}