{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 289, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "book was perfect  great service"}, {"review_sentiment": 3.0, "review_text": "Print small so reading is a little tough and slow - but part of that is just me."}, {"review_sentiment": 5.0, "review_text": "Having travelled through Italy this book brought home to me the incredible history behind the architecture and art."}, {"review_sentiment": 5.0, "review_text": "Took this book on my trip to Italy. It was the perfect choice.  Written extremely well.  History, art, Romance, lots of back story!Dovetailed beautifully with being in Rome and Florence!  Highly recommend it when going to Italy!!"}, {"review_sentiment": 3.0, "review_text": "With the size of the shipping box I’m surprised that this new book arrived a bit beat up."}, {"review_sentiment": 5.0, "review_text": "The book is long but very good and HIGHLY recommended if you are going to travel to Italy and visit the many beautiful art museums. This book speaks from the heart and mind of an artist. Art is not just something pretty but it expresses emotion, feeling, and life. Otherwise it is just decoration. The title of the book is fitting and perfect because it describes the emotions Michelangelo goes through in becoming an artist and a maestro. It is also a great work of history to get an inside perspective of the Medici family and the power and corruption of the papacy. The last 75 pages or so slowed down a bit and were a bit boring but Michelangelo lived to 90 and Irving needed to rap it up after being so detailed in the earlier parts of Michelangelo's life."}, {"review_sentiment": 3.0, "review_text": "Book is in excellent condition. Thank you"}, {"review_sentiment": 5.0, "review_text": "The book came recommended and when the brick arrived (758 pages!), I wondered if I'd get through it. The writing seemed flat and the young Michelangelo just barely arousing curiosity but...something sparked as my reading progressed and, not unlike the mystic white marble that Michelangelo revered, the tremendous work of Irving Stone came to reveal itself after many turning of the pages. This book is similar to a work of art, and while not perfect (like iron stains in good marble), soulfully satisfying in the end. Michelangelo was a lover of beauty, whether it came in male or female form, sculpting and painting them as God had created them. Stone masterfully recreated Michelangelo's imaginative thinking process and \"crusty\" dialogue, absorbing the trials and tribulations of an artist during the tumultuous times of pontificates playing musical chairs, and whose capricious demands challenged Michelangelo's integrity and self-worth. \"Man passes, only works of art are immortal.\" Stone has chiseled a fully realized Michelangelo for me and I look forward to seeing for myself, some the celestial works he left behind when I depart for Rome next week."}, {"review_sentiment": 5.0, "review_text": "Beautiful!"}, {"review_sentiment": 2.0, "review_text": "I tried - I really tried....I made it through the first 300 pages and it just didn't hook me. Learned some interesting things about Michelangelo, but I'm waving the white flag."}]}, "authors": ["Irving Stone"], "isbn": "0451171357", "longitude": 12.4829321, "periods": ["1500s"], "title": "The Agony and the Ecstasy: A Biographical Novel of Michelangelo", "word_cloud": "perfect great service small reading little tough slow part have travel bring home incredible history architecture art took trip perfect choice extremely well art lot back story beautifully go size shipping box surprise new arrived bit beat long good recommend go travel visit many beautiful art museum speak heart mind artist something pretty express emotion feel life decoration title fit perfect describes emotion go become artist maestro also great work history perspective family power corruption papacy last page slow bit bit boring live need rap detail earlier part life excellent condition come recommended brick arrive page wonder get writing seem flat young barely arouse curiosity something spark reading progress mystic white marble revere tremendous work come reveal many turn page similar work art perfect iron stain good marble soulfully satisfy end lover beauty come male female form sculpt painting create masterfully recreate imaginative thinking process crusty dialogue absorb trial tribulation artist tumultuous time pontificate play musical chair capricious demand challenge integrity pass work art immortal chisel fully realize look forward see celestial work leave depart next week beautiful try really try make first page hook learn interesting thing wave white flag", "genres": ["Biography", "Art & Architecture", "History"], "summary": "Irving Stone’s classic biographical novel of Michaelangelo—in which both the artist and the man are brought to life in full. \r\n\r\nA masterpiece in its own right, this novel offers a compelling portrait of Michelangelo’s dangerous, impassioned loves, and the God-driven fury from which he wrested the greatest art the world has ever known.", "asin": "0451171357", "rank": "24915", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51bIUkE2SWL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}