{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2097, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Item was delivered when expected and without damage."}, {"review_sentiment": 3.0, "review_text": "I do??? !!!! Understand.Hmm.I am glad I read this novel at this point in my life. I guess, I was born and raised to be a Peter Keating until I found a Roark Howard in my mind, stubborn and unflinching, while writing Yin-Yang series. I will not go back to being Peter Keating. No matter what.That said, the first night scene between Roark and Dominique was distasteful. How could a writer of Rand's caliber go wrong with basics?Two, the answer is not black OR white. The answer lies in seeing the black in white and the white in black.It's not dependence vs. independence, it's to know WHERE to be dependent and WHEN to be independent."}, {"review_sentiment": 5.0, "review_text": "Along with Atlas Shrugged, two of the most straight forward, honest, objective stories embracing in a prophetic manner, the reality we are facing in our own generation.  Anyone not seeing Ayn’s insight and clearly accurate story parallels to our own generation and the very authentic, real possibilities presented misses the point of Ms. Rands mastery.  It’s time people realized the truth and Ayn says it very clearly. Amazing read... long, wordy at times, but appropriately so and worth the time to read. Engaging, can’t put down reading."}, {"review_sentiment": 4.0, "review_text": "Good read!"}, {"review_sentiment": 5.0, "review_text": "very thought provoking. Open your eyes people this is going on right now."}, {"review_sentiment": 5.0, "review_text": "And wanted to read it again.  She is a great author.  Her work gives your mind alot of thought. Its not a easy read.  It is very different than the authors today which is what makes this a great read.  You have to think and you see how it relates to the 2000 years. The book was wrote in the 30,s. You want to read something wit alot of substance  read the fountainhead.  I want to see the movie starring Gary cooper and patrica Neil."}, {"review_sentiment": 5.0, "review_text": "Though I did not love all 750 pages, I absolutely recommend this book and felt it expanded me in meanginful ways and was brilliantly conceived and written. At times the masochistic nature of the characters and storyline felt so intense that it scared me on an existential level. However, there is love and brilliant insight at the core of it; true,unbridled love in the nakedness of self-acceptance, fearlessness, personal responsibility,  and happiness.  It's an astonishing book. (And the romance is intense!) Forget about Rand's later political movement and how extremists have used that negatively, and just enjoy the sheer intelligence and creativity of this read!"}, {"review_sentiment": 5.0, "review_text": "Roark's success is based on his adherence to rational principles.  Wynand's downfall is based on his adherence to pragmatism in an irrational world.  Toohey's success is predicated on the un-reason that dominates the collectivist world; like the Emperor's New Clothes, one accepts the imbecilic under threat that rejection of it will lead to rejection of oneself.  Rand is often criticized as a writer for her protagonists' impossibly lengthy and philosophical speeches.  Although I am somewhat sympathetic to that, I have encountered some people who really do things like that; mostly religionists who can't help themselves from puking up all their faith-based propaganda in the hopes that the flurry of ideas will somehow cow another person into acceptance.  Also, whenever I have tried to have a philosophical dialogue with people, they soon glaze over and recognize that their only way out is to offer irrational objections until you pin them down to - they simply use emotions as bases for their beliefs.  So I cut my conversations short."}, {"review_sentiment": 5.0, "review_text": "My new favorite book"}, {"review_sentiment": 4.0, "review_text": "Howard Roark is an architect who does not comply with the norm. For this, society criticizes him and tries to destroy his career. Impervious to all, he marches to the beat of his own drum and rises to the top. He becomes the fountainhead of achievement.The Fountainhead is a fascinating look at how a collective mindset can ruin the individual. It is the individual who achieves and creates. Attempting to stifle the individual results in failure to advance as a society. Society will remain in the quagmire of mediocrity.Ayn Rand does a brilliant job in creating a cast of characters that contrasts with Mr. Roark and illustrates the problems of society. Peter Keating, Roark's architect rival, represents mediocrity. Elsworth Toohey, who instantly sees Mr. Roark as a threat, represents socialism. As is typical with Ayn Rand, many of the character's speeches are lengthy commentaries that reflect her philosophy. In reality, most characters would not speak that way. It is however, interesting to have a glimpse as to what is going on in the author's mind.The love story between Howard Roark and Dominique Francon is unusual. These are two generally not likable people. Even the event that begins their relationship is what most would consider morally wrong. It doesn't seem to be personality that brings these two together. It's more about an attainment of an ideal.The Fountainhead is a classic read that also serves as a philosophical and political commentary. Those who have read, Atlas Shrugged, will find similarities in this book.  While it takes a while to feel engaged in the story, once the pieces begin to fall together, it becomes interesting. Recommended for those who enjoy novels with a political/philosophical slant."}]}, "authors": ["Ayn Rand"], "isbn": "0451191153", "longitude": 0.0, "periods": ["1900s"], "title": "The Fountainhead", "word_cloud": "item deliver expect damage glad point life guess bear raise find mind stubborn unflinching write series go back matter say first night scene distasteful go wrong basic answer black white answer lie see black white white dependence independence know dependent independent shrug straight forward honest objective story embrace prophetic manner reality face generation see insight clearly accurate story parallel generation authentic real possibility present miss point time people realize truth say clearly long wordy time appropriately worth time put read good thought provoke open eye people go right want great author work give mind a lot think easy different author today make great think relates year write want something wit a lot substance want see movie star cooper patrica love page absolutely recommend felt expand meaningful way brilliantly conceive write time masochistic nature character story line felt intense scar existential level however love brilliant insight core true unbridled love nakedness fearlessness personal responsibility happiness astonish romance intense later political movement extremist use negatively enjoy sheer intelligence creativity success base adherence rational principle downfall base adherence pragmatism irrational world success predicate dominates collectivist world accept imbecilic threat rejection lead rejection often criticize writer protagonist impossibly lengthy philosophical speech somewhat sympathetic encounter people really thing mostly coreligionists puke propaganda hope flurry idea somehow cow person acceptance also try philosophical dialogue people soon glaze way offer irrational objection pin simply use emotion base beliefs so cut conversation new favorite architect comply norm society criticizes try destroy career march beat drum rise become fascinate look collective mindset ruin individual individual achieve creates attempt stifle individual result failure advance society remain quagmire brilliant job create cast character contrast illustrate problem society architect rival represent mediocrity instantly see threat represent socialism typical many character speech lengthy commentary reflect philosophy reality character way however interest glimpse go author story unusual generally likable people even event begin relationship morally wrong seem personality brings together attainment classic also serve philosophical political commentary find similarity take feel engage story piece begin together become interesting enjoy novel slant", "genres": ["Fiction & Literature"], "summary": "When The Fountainhead was first published, Ayn Rand's daringly original literary vision and her groundbreaking philosophy, Objectivism, won immediate worldwide interest and acclaim. \r\n\r\nThis instant classic is the story of an intransigent young architect, his violent battle against conventional standards, and his explosive love affair with a beautiful woman who struggles to defeat him. \r\n\r\nThis edition contains a special afterword by Rand’s literary executor, Leonard Peikoff, which includes excerpts from Ayn Rand’s own notes on the making of The Fountainhead. As fresh today as it was then, here is a novel about a hero—and about those who try to destroy him.", "asin": "0451191153", "rank": "5405", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51KeSPTXXoL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}