{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 32.0804808, "ratings": {"num_ratings": 180, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Dovaleh Greenstein is 57 years old and a standup comic. And he steps on stage to give a performance of a lifetime, at a club in a small industrial-type town in Israel. It will be a performance no one expects, especially not the man Dovaleh has invited, almost begged to attend, a man he hasn’t seen in more than 40 years, when they were both young teens.He takes the stage. He tells jokes. He tells stories. He insults the audience. He insults individual members of the audience. He goes off on wild tangents. If you’re in the audience, you might think your entertainment has been hijacked. If you’re the reader of “A Horse Walks into a Bar” by David Grossman (translated from the Hebrew by Jessica Cohen), you wonder if you’re going to be able to stand the comedy and the anger and the almost-manic monologues that seem to go on and on.But, like the audience, you hang in there, the audience perhaps because it likes to be insulted, as long as it’s funny and entertaining (look, this guy even makes jokes about the Holocaust). The reader plods ahead, knowing that this novel won the 2017 Man Booker International Award and there must be a reason or reasons why it did, and knowing that Grossman has published a wide array of acclaimed fiction and non-fiction works.Members of the audience begin to leave. Some stay. Some readers may quit. But if you continue, you begin to understand what is happening in this story, and what a truly extraordinary story it is. It’s going to smack you upside the head.The pivotal player is not the man on the stage. No, that role belongs to the man invited to attend, Avishai Lazar, a retired judge. Still grieving the loss of his wife, he can’t quite believe he agreed to come. Several times he almost walks out. After all, he barely knew Dovaleh. And the last time he had seen him was when they were 13 and attending an Israeli Army camp for young people. Dovaleh had had to leave early, and no one, including Avishai, knew why. And that will become the point on which the story hinges.You might, like I did, spend the first 40 to 50 pages telling yourself there must be something better to read, that you don’t really see where this story is going, and you’re getting put off by the constant stream of anger and insults, no matter how many jokes are mixed in. But then something happens, there is a shift that begins subtly and then builds, and you discover you’re captivated. Because it happens on stage, Grossman has written what is strikingly like a play, a play that gradually becomes mesmerizing.“A Horse Walks into a Bar” will unlike anything you’ve read before. And if you persist, you will understand why it won the Man Booker award."}, {"review_sentiment": 5.0, "review_text": "A brilliant Goldsmith digs down deep into the human psyche to describe the challenges of being human, and the complexity of living in Israel. Fully drawn characters, intimate relationships, humor, and heartbreaking reflection. Masterful usage of storytelling viewed through the eyes of a retired judge about a stand-up comic revealing his soul, tragically, for probably the final time."}, {"review_sentiment": 5.0, "review_text": "This is a riveting quick read. It’s a little like watching NASCAR or downhill skiing. You know you watch it for the inevitable crashes. You don’t know where it’s going, but you can’t look away. Really worth reading."}, {"review_sentiment": 1.0, "review_text": "i am not able to purchase this book in my kindle. it is always showing not available in the  store. i had to buy the hard copy for this."}, {"review_sentiment": 5.0, "review_text": "Not a fun read but this book assaults and seduces in turn.  David Grossman’s Dovelah walks on his hands and on every page I marveled at how the author pulled me into this dreary nightclub in Netanya, Israel.  It took me a while to figure out why Netanya and not Jerusalem or Tel Aviv and my best guess is that Netanya is both everywhere and nowhere.If you read this book imagine who you are in the audience.  Are you the Judge or the Dwarf or will you walk out before Dov finishes his act.This book depressed me, inspired me and for sure made me laugh out loud.  There was this parrot..... you’ll have to read the book for the punch line and the humanity in this 194 page tour de force performance."}, {"review_sentiment": 1.0, "review_text": "Not at all interesting. Poorly written"}, {"review_sentiment": 4.0, "review_text": "If there were a Twilight Zone episode of a washed up comic doing a routine about the day in his childhood of a family tragedy I think it would look like this. Not often a book this discomfiting can also make you laugh out loud."}, {"review_sentiment": 5.0, "review_text": "Fascinating take on interpersonal relations and back stories of how the main character traced his history while doing standup.It's not per se, a funny book - but well written and worth the time to explore a different way to tell a story of one man's history."}, {"review_sentiment": 1.0, "review_text": "Nott so bad"}, {"review_sentiment": 2.0, "review_text": "Never had any idea where the story was going to go and hung in there until the end, which was nothing.  It was an interesting writing style in search of a story."}]}, "authors": ["David Grossman"], "isbn": "0451493974", "longitude": 34.7805274, "periods": ["2000s", "Recent Releases"], "title": "A Horse Walks into a Bar", "word_cloud": "year old stand up comic step stage give performance lifetime club small town performance expect especially man invite almost beg attend man see year young take stage tell joke tell story insult audience insult individual member audience go wild tangent audience entertainment hijack translate go able stand comedy anger monologue seem go audience hang audience perhaps like insult long funny entertain look guy even make joke plod ahead know reason reason know publish wide array acclaim fiction audience begin leave stay reader begin understand happen story truly extraordinary story go smack upside pivotal player man stage role belong man invite attend retire judge still grieve loss wife quite believe agree come time almost barely know last time see attend israeli camp young people leave early include knew point story spend first page tell something better really story go get put constant stream anger insult matter many joke mixed something happen shift begin subtly build discover captivate happen stage write strikingly play play gradually become anything persist understand award brilliant dig deep human psyche describe challenge human complexity living draw character intimate relationship humor heartbreaking reflection usage storytelling view eye retire judge comic revealing soul tragically probably final time rivet little watch downhill ski know inevitable crash know go worth reading able purchase always show available store hard copy not fun assault seduces turn hand page marvel author pull dreary nightclub take figure best guess everywhere imagine audience walk finish depress inspired sure make laugh loud parrot punch line humanity page tour force performance not interest poorly write episode wash comic routine day childhood family tragedy think not often discomfit also make laugh loud fascinate interpersonal relation back story main character trace history se funny well write worth time explore different way tell story man history bad never idea story go hung end nothing interest write style search story", "genres": ["Fiction & Literature", "Humour"], "summary": "**WINNER OF THE 2017 MAN BOOKER INTERNATIONAL PRIZE**\r\n\r\nThe award-winning and internationally acclaimed author of the To the End of the Land now gives us a searing short novel about the life of a stand-up comic, as revealed in the course of one evening’s performance. In the dance between comic and audience, with barbs flying back and forth, a deeper story begins to take shape—one that will alter the lives of many of those in attendance.\r\n\r\nIn a little dive in a small Israeli city, Dov Greenstein, a comedian a bit past his prime, is doing a night of stand-up. In the audience is a district court justice, Avishai Lazar, whom Dov knew as a boy, along with a few others who remember Dov as an awkward, scrawny kid who walked on his hands to confound the neighborhood bullies. Gradually, as it teeters between hilarity and hysteria, Dov’s patter becomes a kind of memoir, taking us back into the terrors of his childhood: we meet his beautiful flower of a mother, a Holocaust survivor in need of constant monitoring, and his punishing father, a striver who had little understanding of his creative son. Finally, recalling his week at a military camp for youth—where Lazar witnessed what would become the central event of Dov’s childhood—Dov describes the indescribable while Lazar wrestles with his own part in the comedian’s story of loss and survival. Continuing his investigations into how people confront life’s capricious battering, and how art may blossom from it, Grossman delivers a stunning performance in this memorable one-night engagement (jokes in questionable taste included).\r\n\r\n“David Grossman has attempted an ambitious high-wire act of a novel, and he’s pulled it off spectacularly. A Horse Walks into a Bar shines a spotlight on the effects of grief, without any hint of sentimentality. The central character is challenging and flawed, but completely compelling. We were bowled over by Grossman’s willingness to take emotional as well as stylistic risks: every sentence counts, every word matters in this supreme example of the writer’s craft.” Man Booker International Prize, 2017", "asin": "0451493974", "rank": "24353", "city": "Tel Aviv", "image": "https://images-na.ssl-images-amazon.com/images/I/61lbRC%2ByXcL.jpg", "country": "Israel", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}