{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 11, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "amazing descriptions"}, {"review_sentiment": 5.0, "review_text": "According to my mother most of the stories written in this book are true.  My sister read it first and when she started to tell my mother about the stories - my mother was able to finish them without reading the book.  She was acquainted with the family. The book is wonderful."}, {"review_sentiment": 5.0, "review_text": "Rosario, in is one of the greatest authors I have ever read. This book along with House on the Lagoon, although fiction connected me with the history of Puerto Rico. Whether good or bad I felt like I was there."}, {"review_sentiment": 5.0, "review_text": "This is a book I never would have believed to be fiction unless it told me.  The characters feel real.  There are a lot of people to keep track of and sometimes it goes back and forth in time but there is a useful family tree in the front of the book that I kept referring to.I got a feel for Costa Rica past and present and I enjoyed the stories of the different characters.  I am going to have some of my students read it and I highly recommend it!"}, {"review_sentiment": 5.0, "review_text": "I stumbled on Ms Ferre's work and quickly became addicted to it. The intimations of Puerto Rican history here are subtle and artistically wrought. Comparisons to Garcia Marquez are unfair but probably inevitable.  She's not in that league, neither in imagination nor narrative gifts. But  she's still one heck of a storyteller and her characters are wonderfully  evoked. Unputdownable, especially if you know a bit about Puerto Rico and  its history."}, {"review_sentiment": 4.0, "review_text": "Eccentric Neighborhoods is a family story written in a magical and poetic fashion.  A love story , a family history as well a history of Puerto Rico unfolds for the reader."}, {"review_sentiment": 4.0, "review_text": "The stories told by the narrator, Elvira, about several generations of her family, make you wish she had more aunts, uncles, grandparents, and parents for us to meet. The author has a slightly quirky way of introducing the  reader to each of Elvira's colorful ancestors and of telling what  ultimately is Elvira's story. This is not a novel, per se, but a collection  of short, connected stories that, when all told, form a complete picture."}, {"review_sentiment": 3.0, "review_text": "It almost feels that is not fair/ not the same to read this book if you are Puertorican and/or are if you are familiar with Rosario Ferre's real-life family history. I am both and that's why I am confused about how  I feel about this book. I love Garcia Lorca; therefore, I was inmediately  drawn to her writing style and to the magical realism touches throughout  the book. However, towards the middle, the storyline became more of a  catharsis (autobiography?) and less about the themes of role of strong  women, social impact of economic trends, etc..I can't help the feeling that  this novel was written for an English-speaking audience, specifically  American, and  that Ms. Ferre was throwing a tantrum towards the end.  Excellent writing; it is where she is taking the book/story that seems to  be somewhat confusing....."}, {"review_sentiment": 3.0, "review_text": "It almost feels that is not fair/ not the same to read this book if you are Puertorican and/or are if you are familiar with Rosario Ferre's real-life family history. I am both and that's why I am confused about how  I feel about this book. I love Garcia Lorca; therefore, I was inmediately  drawn to her writing style and to the magical realism touches throughout  the book. However, towards the middle, the storyline became more of a  catharsis (autobiography?) and less about the themes of role of strong  women, social impact of economic trends, etc..I can't help the feeling that  this novel was written for an English-speaking audience, specifically  American, and  that Ms. Ferre was throwing a tantrum towards the end.  Excellent writing; it is where she is taking the book/story that seems to  be somewhat confusing....."}, {"review_sentiment": 5.0, "review_text": "Rosario Ferre is an excellent story-weaver.  She takes us on a magic carpet ride to the land of plantation owners and Puerto Rican socialités.  Her story contains a lot of similarities between real life and fiction,  and probably takes most of her experiences as the daughter of the then Governor of Puerto Rico, Luis A. Ferré, to weave her story; which makes it even more delightful.  I would love to read an autobiographical book from her."}]}, "authors": ["Rosario Ferre"], "isbn": "0452280648", "longitude": 0.0, "periods": ["1900s"], "title": "Eccentric Neighborhoods", "word_cloud": "amazing description accord mother story write true sister first start tell mother story mother able finish read acquaint family wonderful greatest author ever along fiction connect history good bad felt never fiction tell character feel real lot people keep track sometimes go back forth time useful family tree front keep refer get feel present enjoy story different character go student highly recommend stumble work quickly become addict intimation puerto rican history subtle artistically wrought unfair probably inevitable league imagination narrative gift still heck storyteller character wonderfully evoke unputdownable especially know bit puerto history family story write magical poetic fashion love story family history well history unfolds story tell narrator several generation family make wish aunt uncle grandparent parent meet author slightly quirky way introduce colorful ancestor tell ultimately story collection short connect story tell form complete picture almost feel familiar family history confuse feel love therefore immediately draw write style magical realism touch however towards middle story line become catharsis autobiography le theme role strong woman social impact economic trend feel write audience specifically american throw tantrum towards end write take seem somewhat confusing almost feel familiar family history confuse feel love therefore immediately draw write style magical realism touch however towards middle story line become catharsis autobiography le theme role strong woman social impact economic trend feel write audience specifically american throw tantrum towards end write take seem somewhat confusing excellent take magic carpet ride land plantation owner rican socialites story contains lot similarity real life fiction probably take experience daughter weave story make even delightful autobiographical", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A “colorful family saga” set against the dramatic historical backdrop of twentieth-century Puerto Rico, from an author nominated for the National Book Award (Kirkus Reviews).\r\n\r\nElvira Vernet narrates Eccentric Neighborhoods as she attempts to solve the mystery of who her parents truly are. Her mother, the beautiful and aristocratic Clarissa Rivas de Santillana, was born into a rarefied world of privilege, one of five daughters on the family’s sugar plantation. Elvira’s father, Aurelio Vernet, and his three brothers and two sisters were raised by Santiago, a Cuban immigrant who ruled his family with an iron hand. As Puerto Rico struggles for independence—and Aurelio takes his place among the powerful political gentry—a legacy of violence, infidelity, faith, and sacrifice is born.\r\n\r\nSet against the backdrop of a country coming of age, Eccentric Neighborhoods is a lush, transcendent novel, a family saga about mothers and daughters, husbands and wives, parents and children. In this magnificent follow-up to The House on the Lagoon, Rosario Ferré delivers a work of historical fiction influenced by magical realism and infused with forgiveness and love.", "asin": "0452280648", "rank": "1650051", "city": "Puerto Rico", "image": "https://images-na.ssl-images-amazon.com/images/I/51TRBDN6BRL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}