{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 108, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "This is the story of Hawaii told from a native. I gained a different perspective of the part our government played by reading this novel."}, {"review_sentiment": 5.0, "review_text": "Very good read!"}, {"review_sentiment": 5.0, "review_text": "Loved this book.  Bought to read while on vacation in Hawaii.  Didn't realize what a pain in the butt haoies are to the wonderful people of Hawaii.  Left Maui much more respectful.  Ordered Davenport's Song of the Exile because I loved this book so much.  Surprisingly.she incorporated some of the characters from this book.  But over-all her second book was not the sweeping saga that I expected.  Will be re-reading Shark Dialogues soon because there is so much poetry in the writing, I'm sure I missed a lot of it as I raced through this book to see what would happen next."}, {"review_sentiment": 4.0, "review_text": "I gave it a 4 star because it kept my interest and I didn't want to put down. I recommend this story of family histories lies deception and devotion."}, {"review_sentiment": 5.0, "review_text": "Great Novel, Super Value."}, {"review_sentiment": 5.0, "review_text": "I LOVE THIS BOOK.  It is very well-written and is probably one of the best books on Hawaii that shows so much heart.  Having lived in Hawaii for four years and loving every moment of my time there, I am heartbroken to know even more about the rape of the islands by whites.  I have read all of Davenport's books, and highly recommend them to anyone interested in that wonderful state."}, {"review_sentiment": 3.0, "review_text": "The history of Hawaii is well worth the read of the first part of the book and it is sprinkled throughout the rest of the story. I thought it was a good story that should have been half as long. She needed to let up a bit on the the constant longing for Pono to love them, what her secret, was, and Pono's aloofness. It is the Hawaiian version of Clan of the Cave Bear."}, {"review_sentiment": 5.0, "review_text": "I had read this book as a teenager and it stayed in my mind: Strong women who take to the sea to heal when things get tough. Reading it again 20 years later and it is still one of the best books i have ever read - and I read a lot :)"}, {"review_sentiment": 5.0, "review_text": "Such a great book.  I couldn't put it down.  The history of Hawaii, the magic of the culture made this book sing."}, {"review_sentiment": 5.0, "review_text": "Fantastic story of strong women and their haunting influence on their daughters.  Multiple levels:  history of Hawaii, Japanese influence and drug culture there, US pineapple industry affects, Polynesian culture, and history of Maliki and the leper colony and the effects leprosy had on families. Davenport's writing is an experience of being a surfer riding poetic waves as they build and come thundering in onto the shore."}]}, "authors": ["Kiana Davenport"], "isbn": "0452274583", "longitude": -157.8556764, "periods": ["1800s"], "title": "Shark Dialogues", "word_cloud": "story tell native gain different perspective part government play reading very good love vacation pain butt hanky wonderful people much respectful love much incorporate character second sweeping saga expect soon much write sure miss lot race see next give star keep interest want put recommend story family history lie deception devotion love book probably best hawaii show much heart have live year love moment time heartbroken even island white highly recommend anyone interested wonderful state history well first part sprinkle rest story think good story half long need let bit constant longing love secret aloofness hawaiian version teenager stayed mind strong woman take sea heal thing get tough year later still best ever lot such great history magic culture make sing fantastic story strong woman haunt influence daughter multiple level history japanese influence drug culture pineapple industry affect polynesian culture history leper colony effect leprosy family write experience surfer rid poetic wave build come thundering shore", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "“Compares with Toni Morrison.”—Glamour\r\n \r\nBeginning with the fateful meeting of a nineteenth-century Yankee sailor and the runaway daughter of a Tahitian chief, and sweeping over a century and a half of passionate, turbulent Hawaiian history, Shark Dialogues takes its place as the first novel to do justice to the rich heritage and cruel conflicts of the beautiful and beleaguered islands and their people. \r\n\r\nSurreal, provocative, erotic, magical, meaningful, and supremely wise, it is a tale of islanders and invaders, of victors and victims, of queens and whores, of lepers and healers. And at its center are Pono, the magnificent pure-blooded matriarch and seer, and her four mixed-blood granddaughters seeking to come to terms with the contradictions of their ancestries and the hungers of their hearts. \r\n\r\nTheir loves, their hates, the bonds joining them, and the furies possessing them are interwoven with ancient legends and lore of the islands whose past offers their salvation and whose future is their fate. \r\n\r\nKiana Davenport has written a major contribution to the literature of the Pacific Rim—a great reading experience both brilliantly contemporary in its form and timeless in its illumination.\r\n \r\n“A giant, image-fevered, luxuriant saga of a Hawaiian family… powerful, memorable, intoxicating.”—Kirkus Reviews", "asin": "0452274583", "rank": "215679", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZjfjiPY3L.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}