{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 219, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "The story kept me intrigued and the description of the tapestries has me desperate to research them. I loved learning about the weaving and process of how they were made. Great read."}, {"review_sentiment": 4.0, "review_text": "good read"}, {"review_sentiment": 5.0, "review_text": "Love the Parnell of characters with the work. Keep me wanting to read more at the end. Glad that author completed the end with the of characters."}, {"review_sentiment": 2.0, "review_text": "I really enjoyed Tracy Chevalier's novel Girl with a Pearl Earring. Read it multiple times. So I purchased this hoping I would like it as well. While I did still really like the high quality writing style and technique of the author, I was very disappointed by the plot and characters in this book. They were not at all what I wanted to be reading about. (No spoilers!) Some of the characters I outright hated and the remainder I merely disliked. It may just be a personal preference, but I do want there to be at least one sympathetic character in a novel. The storyline I found very boring. Nothing really happened that was particularly intriguing or exciting. Maybe I didn't care what happened to these characters, or maybe I just didn't care about these events? I don't know, but either way, I didn't care."}, {"review_sentiment": 3.0, "review_text": "I have always been fascinated by tapestries, and I loved The Girl with a Pearl Earring, so I was very excited to read this book.  However, the wonderful story is spoiled by the coarse writing style and some very unpleasant characters.Now, I have nothing against unpleasant characters.  There have to be a few now and then.  But these characters are so very unpleasant, and so crudely portrayed. The character Nicholas is particularly odious, and his frequent unicorn metaphors become tedious very quickly.The novel is rich in historical detail, and the plot is cleverly intertwined with the weaving of the tapestries.  The story could have been quite wonderful if it had been written in a more appealing style."}, {"review_sentiment": 3.0, "review_text": "k"}, {"review_sentiment": 4.0, "review_text": "Tracy Chevalier writes really good books that take you right into the period she is describing.  I'll read anything she writes."}, {"review_sentiment": 4.0, "review_text": "INVITING"}, {"review_sentiment": 5.0, "review_text": "Love all she writes."}, {"review_sentiment": 1.0, "review_text": "This was my least favorite of all Tracy Chevalier's books. Although I found it interesting to learn about the weaving of ancient tapestries, the actual story itself grew rather tedious."}]}, "authors": ["Tracy Chevalier"], "isbn": "0452285453", "longitude": 2.3514992, "periods": ["Recent Releases", "500-1400s"], "title": "The Lady and the Unicorn", "word_cloud": "story keep intrigued description tapestry desperate research love learn weave process make good character work want end author complete end character really enjoy multiple time so purchase hop well still really like high quality write style technique author disappoint plot character want read spoiler character outright hat remainder merely dislike personal preference want least sympathetic character story line find bore really happen particularly intriguing excite maybe care happened character maybe care event know way care always fascinate tapestry love excite however wonderful story spoil coarse writing style unpleasant nothing unpleasant character character unpleasant crudely portray character particularly odious frequent metaphor become tedious rich historical detail plot cleverly intertwine weave tapestry story wonderful write appeal style k write really good right period describe anything writes inviting writes least favorite find interest learn weave ancient tapestry actual story grow rather tedious", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Bewitching art experts and enthusiasts alike for centuries, the Lady and the Unicorn tapestries hang today in the Cluny Museum in Paris.\r\n\r\nIn each, an elegant lady and a unicorn stand or sit on an island of grass surrounded by a rich background of animals and flowers. Little is known about them except that they were woven toward the end of the fifteenth century and bear the coat of arms of a wealthy family from Lyons.\r\n\r\nTracy Chevalier takes readers back to the tapestries’ creation, giving life to the men who designed and made them, as well as the wives, daughters, and servants who exercised subtle (and not so subtle) influences over their men. Like the many different strands of wool and silk that were woven together into one cloth, the lives and fates of these people entwine in complex patterns, crisscrossing as they seek desires sensual and spiritual, temporal and eternal.\r\n\r\nAn extraordinary story exquisitely told, Tracy Chevalier’s The Lady and the Unicorn weaves history and fiction into a beautiful, timeless, and intriguing literary tapestry that rivals in grace and grandeur the masterpiece that inspired it.", "asin": "B00BG7IH4W", "rank": 0, "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/514BrDp5bBL.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}