{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 14, "rating": 2.7, "reviews": [{"review_sentiment": 1.0, "review_text": "By the time I finished this book I was wondering why I was reading it. After the \"end\", I wished I hadn't read it. I love to read, but this is one of the worst books I've ever read."}, {"review_sentiment": 2.0, "review_text": "I agree with Penelope...lots of built up suspense (partly due to his repetitive style) with no satisfactory conclusion!! I can't stop thinking about this novel, but mainly because I feel so let down by the ending. I'm off now to try a Graham Greene novel as suggested by Penelope :}"}, {"review_sentiment": 1.0, "review_text": "I've never read any of Brian Moore's work previously and honestly plan not to read him again.  This book left me hanging in suspense and unsatisfied eventually.  The ending was a huge disappointment, Marie's dilemma extremely repetitive and qutie honestly I just didn't get it.  Perhaps not being a Catholic made this novel a muddled mass of seemingly unrelated incidents to me.  I did not understand the accident and near-death of Marie's husband in relationship to her visions.  It left me cold and wanting to return to what I consider better works."}, {"review_sentiment": 3.0, "review_text": "I had read this when it came out originally, since a book review had set up the main plot--which since it is mentioned on this site in summary, it will not be a spoiler now--what if Mary appeared to you and you said, basically, forget it? Fantastic idea, and not a bad book. Moore occupies the space between popular and literary novelist, and this book shows his skill and his shortcomings. The former qualities outweigh the latter. But you gain little sense of people in this work, with oddly some of the minor characters like Sister Anne, Herb Luddington, or at times Father Niles. The supporting cast generally seems, however, there to only advance the maddeningly circular direction of this book.As a related aside, I have seen the very convent that Moore borrows for his novel. The convent's set off memorably on the inland side of the highway from Big Sur as it nears Carmel, yet the drama of its riparian location and nearby Point Lobos is felt here only sporadically. The sensation of place that needs to be so powerful as to haunt Marie and entice ourselves comes fitfully and intermittently. Instead, we get lots of information about who ordered what from the lodge's waitress or rectory housekeeper or attending nun. These details add little to the novel, and they detract attention from the more disturbing undertow that sweeps Marie along. That is what matters in the story, and this is why we're reading it. Not to find out which characters had what for breakfast.Luckily, after over 20 years I had forgotten the details that convey what pace or suspense the novel needs to build in order to convince us. Rereading it, I wondered how Moore would carry the ending off, and he delays enough information to keep you curious until he reveals all the details of what Mary said, how she said it, and when. Marie's predicament's kept up to the last line of the novel rather skillfully. Still, the cumulative impact of the novel adds up to less than a sum of the parts: \"unbelieving adultress\" is how the visionary-protagonist describes herself. Certainly promising material. However, after the initial apparition to Marie's related, the rest of the novel's more concerned with filtering her reactions to the apparition through those she suspects are shadowing her--both seen and unseen messengers of God's will.A deity neither all-loving or all-merciful, apparently. As in other modern visionary accounts, the divine visits upon the seer a vengeful presence that--and Moore does not raise what would have been a more appropriate context given 20c Marian visions--often threatens doom upon those who do not heed warnings from above. Moore sidesteps any durable connection between what Marie recalls and what others claim they see, and this lack of interest by the omniscient narrator saps the novel's latter half of much potential energy. She's not a very sympathetic character, and while this is appropriate for how the novel progresses, it does leave the reader with nobody else to identify much with.The whole apocalyptic-vs.-restorative nature of the message Marie reports barely registers. Surely this aspect, given Marie's evident unease, would spark more reactions than the Monsignor's rather sophisticated one. Not that I disagree with this cleric's advice to Marie. It's just that she needed more counter-arguments to heighten the impact of her message and its predicted ramifications. [For two other non-fiction studies since then (both written in the aftermath of the Medjugorge apparitions which began in 1985; intriguingly those claimed of \"moving statues\" in Moore's native Ireland began also just a couple of years after this novel appeared) see Randall Sullivan's The Miracle Detective and Sandra Zimdars-Swartz' academic but accessible Encountering Mary. For some reason, the same error repeats in Sullivan and Moore: spelling the Mexican site of Guadalupe by the French island's name of Guadaloupe.]Still, this is a thoughtful, if rather quickly written (so it seems to me in the massive amount of mundane detail and plot points entered into but not fully explored), theological thriller. Not that it's scary in the obvious sense or half-baked like certain more currently famed novels on Catholic skulduggery. It does get under your skin if you let it, despite its flaws. The central theme's so inherently interesting that it allows you as a reader to cut the novel some slack. So, in spite of an uneven pace and too many underdeveloped scenes \"Cold Heaven\" manages to remain rather plausible in its main character's arc. A feat to be discounted in our determinedly secularized yet stubbornly irrational era!"}, {"review_sentiment": 4.0, "review_text": "Gripping, absorbing -- Marie Davenport is chosen to witness a revelation of the Virgin Mary, but she refuses to testify and carry out the Virgin's request.God is described here as an alien Being, whose purposes are inscrutable and not necessarily benign. The scenes in which the Virgin appears to Marie are positively scary; nevertheless Marie has the power to resist the divine will, even though the price of this resistance is very high. For the first time I considered the possibilty of preferring a prosaic, mundane life to one of metaphysical revelation.On the downside, this book was not always coherent and left too many questions unanswered."}, {"review_sentiment": 4.0, "review_text": "This is a failed novel, but a pretty good book.  It doesn't really have a plot, but is instead a story designed to illustrate how perceptions shape individual realities.A woman and her husband vacationing in the south of France have their trip cut short by his fatal accident  -  well, sort of.  Seems he just won't stay put in the morgue.  She thinks it has something to do with a vision of the Virgin Mary she once had  -  even though she long ago renounced her Catholicism.  He implies (though never outright states) that he understands why he isn't dead, and doesn't want to be discovered until he has \"recovered\" from his rigor mortis-ish condition, for fear that he will be regarded as a freak.  A nearby convent gets involved in the wife's reluctant vision quest, which she avoids because she doesn't want to attract publicity to her hiding husband or her own affair with another man.The story is almost a black comedy as written by Dean Koontz.  (In fact, Koontz has used variations of these plotlines in his books, namely Strangers, Shadowfires, and Mr. Murder, to name a few.)  Nothing is clearly answered or resolved by the end of the story, though there are strong implications made in a number of different directions as to why the bizarre phenomena are occurring.  In essence, the reader fills in his own blanks and virtually writes the story of his choice according to whose perceptions he agrees with.  It's almost a Rorschach blot for belief systems.It's also quite a good read.  It will definitely not be to everyone's tastes.  If you're looking for a comprehensive, standard novel, you'll be horribly disappointed.  If you simply want to spend a while walking the line of Faith, examining it from every different angle and psychologically exploring the different human mechanisms of belief, you'll be endlessly fascinated."}, {"review_sentiment": 1.0, "review_text": "I've never been more disappointed in a book.  I actually thought I had missing pages because the ending was practically nonexistent!  There were so many missed connections.  The potential was there, but, sadly, Mr. Moore obviously lacked the skill to finish what he started.  I agree with the reviewer who said it was repetitive.  Not being familiar with the works of Graham Greene, I cannot compare him to Brian Moore.  There is no mystery or suspense to give away because absolutely nothing happens!  Don't waste your time."}, {"review_sentiment": 3.0, "review_text": "I can't understand what all the fuss is about Brian Moore.  Am I reading the wrong novels?  The book jacket says he was Graham Greene's favorite  living author.  Graham Greene is my favorite author, but I don't care for  Brian Moore.  The story idea is so interesting, as was The Magician's Wife.  Vactioning in Europe, a woman's husband is fatally injured in a boating  accident, but his body is missing from the morgue.  She returns to find his  things missing from their hotel.  I don't won't to spoil any mystery, so I  won't say what happens from there, only that she is struggling with visions  she doesn't want to believe are from God.  Such an interesting idea.  However, so much is repetitive.  She goes through the same struggles over  and over again, never learning any lesson or benefiting from her  experiences.  She complains--a lot.  I didn't find the ending satisfactory  at all.  I kept reading, dying to find out if she would have some  miraculous discovery, but in the end it was as empty as The Magician's  Wife.  If you want suspense and moral inquiry (as this book jacket  promises) read Graham Greene instead:  The End of the Affair, The Heart of  the Matter, or A Burnt-out Case."}, {"review_sentiment": 5.0, "review_text": "Moore asks, how we would we react, today, to a religious vision?  I'd run like hell, and so does the heroine.  All of Moore's books are fascinating, but I think this is his best.  And the ending is perfect.  (By the way, the  movie was dreadful.)"}, {"review_sentiment": 5.0, "review_text": "Brian Moore was Graham Greene's favorite living novelist and this book gives a reader several reasons why Greene was a fan of Moore.  Only a major emergency could have drawn me from the book after the first chapter.  But Moore is more than an engaging mystery writer.  As in all his  novels, Moore's main characters struggle with belief and doubt and the  knowledge of sin.  He offers no easy answers, but he provides a rich meal  for any reader anxious for both nourishment and pleasure."}]}, "authors": ["Brian Moore"], "isbn": "0452278678", "longitude": 0.0, "periods": ["1900s"], "title": "Cold Heaven", "word_cloud": "time finish wonder read end wish love worst ever agree lot build suspense partly due repetitive style satisfactory conclusion think mainly feel let end try suggest never work previously honestly plan leave hang suspense unsatisfied eventually end huge disappointment dilemma extremely repetitive quite honestly get perhaps make muddled mass seemingly unrelated incident understand accident husband relationship vision leave want return consider better work come originally review set main plot mention site summary spoiler appear say basically forget idea bad occupies space popular literary novelist show skill shortcomings former quality outweigh latter gain little sense people work oddly minor character time support cast generally seem however advance maddeningly circular direction relate aside see convent borrow convent set memorably inland side highway near yet drama riparian location nearby felt sporadically sensation place need powerful haunt entice come fitfully intermittently instead lot information order lodge waitress rectory housekeeper attend nun detail add little detract attention disturb undertow sweep matter story read not character year forget detail convey pace suspense need build order convince reread wonder end delay enough information curious reveals detail say say predicament keep last line rather skillfully still cumulative impact add le sum part unbelieving adulteress describe certainly promising material however initial apparition relate rest concern filter reaction apparition suspect shadow see unseen messenger deity neither apparently modern visionary account divine visit seer vengeful presence raise give marian vision often threaten doom heed warning sidestep durable connection recall others claim lack interest omniscient narrator sap latter half much potential energy sympathetic character appropriate progress leave nobody else identify much whole nature message report barely register surely aspect give evident unease reaction rather sophisticate not disagree cleric advice need heighten impact message predict ramification study write aftermath apparition begin intriguingly claim move statue native begin also couple year appear see academic accessible reason error repeat spell site island name still thoughtful rather quickly write seem massive amount mundane detail plot point enter fully explore theological thriller not scary obvious sense certain currently famed novel skulduggery get skin let central theme inherently interest allows cut slack spite uneven pace many underdeveloped scene manage remain rather plausible main character arc feat discount determinedly secularize yet stubbornly irrational era grip absorb choose witness revelation refuse carry describe alien purpose inscrutable necessarily benign scene appear positively scary nevertheless power resist divine even price resistance high first time consider possibility prefer prosaic mundane life metaphysical downside always coherent leave many question unanswered fail pretty good really plot instead story design illustrate perception shape individual woman husband vacation south trip cut short fatal accident well sort morgue think something vision even long ago renounce imply never outright state understands dead want discover recovered rigor condition fear regard freak nearby convent get involve wife reluctant vision quest avoids want attract publicity hide husband affair story almost black comedy write fact use variation plot lines namely name clearly answer resolved end story strong implication make number different direction bizarre phenomenon occur essence fill blank virtually write story choice accord perception agree almost blot belief also quite good definitely everyone taste look comprehensive standard horribly disappointed simply want spend walk line examine different angle psychologically explore different human mechanism belief endlessly fascinate never disappoint actually think miss page end practically nonexistent many miss connection potential sadly obviously lack skill finish start agree reviewer say repetitive not familiar work compare brian mystery suspense absolutely nothing happens do waste time fuss read wrong novel jacket say favorite living author favorite author care brian story idea interest magician woman husband fatally injured boat accident body miss morgue return find thing miss hotel mystery happens struggle vision want believe such interesting idea however much repetitive go struggle never learn lesson benefiting experience complain lot find end satisfactory keep read die find discovery end empty magician want suspense moral inquiry jacket promise instead end moore asks today religious vision run hell heroine fascinating think best end perfect way movie dreadful favorite living novelist give several reason fan only major emergency first chapter engaging mystery writer novel main character struggle belief doubt knowledge sin offer easy answer provide rich meal anxious nourishment pleasure", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "When an appalling boating accident off the coast of Nice allegedly kills Dr. Alex Davenport, his attractive young wife Marie finds herself in the ironic position of widow of a husband she had been planning to leave for another man. But Alex's body suddenly disappears from the morgue, and his plane ticket and passport are missing. So begins a mystery of hypnotic fascination, involving elements of the bizarre and the supernatural.\r\n\r\n“Eerily suspenseful, compelling and brilliant.” The Independent", "asin": "0452278678", "rank": "1328649", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51ho-rT%2B5mL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}