{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 42, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "The book rightfully carries status as an early entry into Young Adult multicultural literature.  However, I agree with an earlier reviewer that the first part is more engaging as a study of family and culture, and the second part is compelling only if you are enthralled by a literal blow-by-blow of boxing."}, {"review_sentiment": 5.0, "review_text": "Inspirational"}, {"review_sentiment": 5.0, "review_text": "guess what gus lee and diane elliott are my aunt and uncle my last name is elliott he has writen lots of books"}, {"review_sentiment": 5.0, "review_text": "great book but slow at parts"}, {"review_sentiment": 5.0, "review_text": "I'm 48 and am an avid reader.  I read this maybe 5 years ago and still recommend it to others:  my friends, my 12 year old, my mom, my husband.  It's that good - appealing to many readers of different perspectives and ages.  I believe it is semi-autobiographical.  A story of a tough childhood as an immigrant kid with problems at home.  Lots of insight, plus an interesting perspective on San Francisco, too.  I think you'll be glad you read it."}, {"review_sentiment": 1.0, "review_text": "Being Asian American and having grown up in the same supposed arena Gus Lee described, the whole book smells of cheap fakery. Poor WW2 fighter pilot turned poor white collar banker father who marries abusive white devil woman who lounges about all day doing nothing? A poor banker living in Chinatown? I mean really ;how likely was that? Try Poor blue collar laborer married to immigrant monolingual sweatshop worker who works from 9 to 9 everyday. That's more real. Little Chinese boy finds redemption in the ring? Smells like Rocky story rip off . Sorry Gus, you can fool most  people ,but for us who actually grew up in Chinatown in that era this is one big smelly fake."}, {"review_sentiment": 4.0, "review_text": "A teacher I had in high school recommended this book to me but i didn't get around to buying and reading it till years later.... i absolutely loved it. the story is unique, heartfelt, well told and realistic. i lend this book to anyone who will take it."}, {"review_sentiment": 2.0, "review_text": "I was so taken at first by this memoir-fiction, by the author's account of the mother he passionately loved who died too soon, by all of the rich Chinese history covered early in the book.  The first hundred or so pages are graceful, amusing, sublimely engaging, and then, the boy narrator, Kai Ting, who keeps getting beaten up by street bullies in the Panhandle area of San Francisco where he lives, is signed up by his father for boxing lessons at the YMCA.  And here is where a promising tale loses is potential complexity and depth in a narrow focus.  By then, given author Gus Lee's near-relentless obsession with the bloody outcome of bullies and boxing, I feared this would become a tale about life in the ring for a young kid, which, in essence, it does.  Kai's charming uncle makes a brief appearance, only to be appalled by learning of the boy's fate being turned to one of the most barbaric sports known to man.  The uncle wants the boy to be a scholar and a poet, to bring pride to his family.  We never see him again.  Kai at least learns to take on a bully older than himself in a fight so bloody, so prolonged and so improbable in its numerous developments, that I hardly believe it could ever have happened.  Nor is it easy to believe in the character of the nasty sadistic Irish-American woman whom Kai's father weds after his wife dies. This particular Mommy Monster woman is so brutal to Kai (while the passive father just sits by and takes it), that by today's laws she would likely be locked up behind bars for egregious child abuse.  A wonderful writing talent wasted, just like the young life of Kai. At the end, we are left in limbo -- will he, as is suggested, finally take on his wicked step mother in physical fashion?  Will he follow his uncle and turn to higher education?  Unless you are a boxing fanatic, I can't recommend this frustratingly flawed book.ShowbizDavid"}, {"review_sentiment": 5.0, "review_text": "Book came in perfect condition for a used item, I was really surprised.  Delivered on time and on schedule."}, {"review_sentiment": 5.0, "review_text": "The semi-autobiographical novel, China Boy, set in the predominantly Black Panhandle area of San Francisco, California, is the story of seven-year-old Kai Ting, the only son of a high born Mandarin family. After the tragic death of Kai's mother when he is six, Kai is ill-treated by his white stepmother, who is determined to erase everything Chinese from the Ting home, and by the neighborhood bullies, who are physically violent toward Kai. After Kai is supported by Toussaint and Mama La Rue who teach Kai about friendship, by Uncle Shim who teaches Kai about noble Chinese traditions and by a group of retired boxers at the YMCA who teach Kai to defend himself, he is able to confront the neighborhood bullies and stand up to his stepmother. Lee's novel renders the vibrancy of the Asian-American immigrant experience through a thoroughly appealing protagonist and rich supporting characters."}]}, "authors": ["Gus Lee"], "isbn": "0452271584", "longitude": -122.4192363, "periods": ["1900s"], "title": "China Boy", "word_cloud": "rightfully carry status early entry multicultural literature however agree earlier reviewer first part engage study family culture second part compel enthralled literal boxing inspirational guess go lee diane elliott aunt uncle last name elliott write lot great slow part avid maybe year ago still others friend year old mom husband good appeal many reader different perspective age believe story tough childhood immigrant kid problem home insight interesting perspective think glad be asian grown suppose arena describe whole smell cheap faker fighter pilot turn poor white collar banker father marries abusive white devil woman lounge day nothing poor banker live mean really likely blue collar laborer marry immigrant monolingual sweatshop worker work everyday real little chinese find redemption ring story rip fool people actually grow era big smelly fake teacher high school recommend get buy reading year later absolutely love story unique heartfelt well tell realistic lend anyone take first author account mother passionately love die soon rich chinese history cover early first hundred page graceful amuse sublimely engage narrator keep get beaten street bully area live sign father box lesson promising tale lose potential complexity depth narrow focus give author obsession bloody outcome bully box fear tale life ring young kid essence charm uncle make brief appearance appal learn fate turn barbaric sport know man uncle want scholar poet bring pride family never see least learns take bully older fight bloody prolong improbable numerous development hardly ever happen easy believe character nasty sadistic woman father wed wife die particular woman brutal passive father sit take today law likely lock bar egregious child wonderful writing talent waste young life end leave limbo suggest finally wicked step mother physical fashion uncle turn higher education box fanatic frustratingly flaw come perfect condition use item really surprise time schedule set predominantly area story son high bear family tragic death mother white stepmother determine erase everything home neighborhood bully physically violent support teach friendship teach noble chinese tradition group retire boxer teach defend able confront neighborhood bully stand stepmother render vibrancy immigrant experience thoroughly appeal protagonist rich support character", "genres": ["Fiction & Literature"], "summary": "Kai Ting is the only American-born son of an aristocratic Mandarin family that fled China in the wake of Mao’s revolution. Growing up in San Francisco’s ghetto, Kai is caught between two worlds—embracing neither the Chinese nor the American way of life. After his mother’s death, Kai is suddenly plunged into American culture by his new stepmother, a Philadelphia society woman who tries to erase every vestige of China from the household. Warm, funny, and deeply moving, China Boy is a brilliantly rendered novel of family relationships, culture shock, and the perils of growing up in an America of sharp differences and shared humanity.\r\n\r\n“What a knockout. An incredibly rich and new voice or American literature… China Boy grabs the reader’s heart and won’t let go… A wonder of a story.” Amy Tan", "asin": "0452271584", "rank": "290578", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51JoNlkSfdL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}