{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 32, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Good"}, {"review_sentiment": 4.0, "review_text": "Almost fifty years after its publication, Armies of the Night needs no summary. For that you can easily consult Web sources and get a take on its juxtaposition to similar literature of the time period. Nor need I comment much on the author's penchant for referring to himself in the third person. I merely thought it was about time I read some Mailer, and because this tome was recommended to me by friends, I selected Armies. It so clearly limns the times in which I lived as a youth who, except for a certain dumb luck, was spared the agony of being called to serve in the Vietnam War.Instead, I offer, as usual, what I believe is perhaps the book in a nugget, what the novel is all about—a passage from the chapter, “Why Are We in Vietnam?”:“Mailer had been going on for years about the diseases of America, its oncoming totalitarianism, its oppressiveness, its smog—he had written so much about the disease he had grown bored with his own voice, weary of his own petulance; the war in Vietnam offered therefore the grim pleasure of confirming his ideas. The disease he had written about existed now in open air: so he pushed further in his thoughts—the paradox of this obscene unjust war is that it provided him new energy—even as it provided new energy to the American soldiers who were fighting it.“He came at last to the saddest conclusion of them all for it went beyond the war in Vietnam. He had come to decide that the center of America might be insane. The country had been living with a controlled, even fiercely controlled, schizophrenia which had been deepening with the years. Perhaps the point had now been passed. Any man or woman who was devoutly Christian and worked for the American Corporation, had been caught in an unseen vise whose pressure could split their mind from their soul. For the center of Christianity was a mystery, a son of God, and the center of the corporation was a detestation of mystery, a worship of technology. Nothing was more intrinsically opposed to technology than the bleeding heart of Christ. The average American, striving to do his duty, drove further every day into working for Christ, and drove equally further each day in the opposite direction—into working for the absolute computer of the corporation” (188).“Christians had been able to keep some kind of sanity for centuries while countenancing love against honor, desire versus duty, even charity opposed in the same heart to the lust for power—that was difficult to balance but not impossible. The love of the Mystery of Christ, however, and the love of no Mystery whatsoever, had brought the country to a state of suppressed schizophrenia so deep that the foul brutalities of the war in Vietnam were the only temporary cure possible for the condition—since the expression of brutality offers a definite if temporary relief to the schizophrenic” (188).Wow! (No emoji needed.)"}, {"review_sentiment": 5.0, "review_text": "fast ship. read now"}, {"review_sentiment": 4.0, "review_text": "Norman Mailer’s bifurcated chronicle of the 1967 March on the Pentagon, The Armies of the Night (1968) is an interesting combination of self-revelation and history. The first, much longer part documents Mailer’s activities in the several days before, during and after the March (some of which he spent in jail). This is delivered in third person narrative and isn’t shy about presenting its subject in less than flattering light, from Mailer’s drunken rambling speech before a gathering the evening before the March to his intention to get his arrest over with in time to return to New York for a party he very much wants to attend.Of particular interest are also Mailer’s ruminations about the War in Vietnam and what he understands are the beliefs of the two opposing sides in this country supporting and opposing it. Though against the war himself, he grants the other side some valid points.Other celebrities crop up in the narrative, from poet Robert Lowell and agit-rock band The Fugs to noted war opposers Rev. William Sloan Coffin and Noam Chomsky. Definitely worth reading if you are interested in this period of U.S. history."}, {"review_sentiment": 3.0, "review_text": "As a boomer, ya gotta love it. While we may not have all checked in, we were all there in spirit. Thanks, as Bob Hope would say, for the memories, Norman!"}, {"review_sentiment": 5.0, "review_text": "Pretty good, hard to wrap at first"}, {"review_sentiment": 5.0, "review_text": "Book came in great shape- well pleased with this awesome classic!"}, {"review_sentiment": 5.0, "review_text": "Great price."}, {"review_sentiment": 5.0, "review_text": "Classic Mailer. But i find that, after lo so many years, his style doesn't hold up that well. It is taking me a long time to read this. His endless digressions, which I probably thought were far out at the time, now seem boring and repetitious."}, {"review_sentiment": 2.0, "review_text": "ok"}]}, "authors": ["Norman Mailer"], "isbn": "0452272793", "longitude": -77.0366456, "periods": ["1900s"], "title": "The Armies of the Night: History as a Novel, the Novel as History", "word_cloud": "good almost fifty year publication need summary easily consult source get juxtaposition similar literature time period need comment much author penchant refer third person merely think time tome recommend friend select clearly limn time live youth certain dumb luck spar agony call serve offer usual believe perhaps nugget passage chapter be go year diseases oncoming totalitarianism oppressiveness write much disease grow bored voice weary petulance war offer therefore grim pleasure confirm idea disease write exist open air push paradox obscene unjust war provide new provided new energy american soldier fight come last saddest conclusion go war come decide center country living control even fiercely control schizophrenia deepen year perhaps pass man woman devoutly work american catch unseen vise pressure soul center mystery son center corporation detestation mystery worship technology intrinsically oppose technology bleed heart average american strive duty drive day work drive equally day opposite work absolute computer corporation able kind sanity century countenance honor desire duty even charity oppose heart lust difficult balance impossible love however love whatsoever bring country state suppress schizophrenia deep foul brutality war temporary cure possible expression brutality offer definite temporary relief schizophrenic emoji need fast ship bifurcate chronicle interest combination first much longer part document activity several day spend jail deliver third person narrative shy present subject le flattering light drunken ramble speech gathering even intention arrest time party much want particular interest also rumination understand belief oppose side country support oppose war grant side valid celebrity crop narrative poet note war opposes read interested period boomer ya get ta love spirit memory pretty good hard wrap first come great well pleased awesome classic price classic find lo many year style hold well take long time endless digression probably think far time seem bore repetitious ok", "genres": ["History"], "summary": "Winner of the Pulitzer Prize and the National Book Award\r\n\r\nThis classic of \"new journalism\" daringly combines reportage with a novelistic style.\r\n\r\nArmies of the Night centers on the March on the Pentagon, the most famous anti-Vietnam War rally in Washington DC, and the characters that occupy this opposition—the intellectuals, students, African Americans, liberals, and marching women. Mailer, a novelist-as-character, sculpts this impressionably fragile world of the Left versus Authority and Peace versus War, prodding at the Vietnam generation’s deepest anxieties.\r\n \r\nIn the same way Truman Capote's In Cold Blood introduced the \"non-fiction novel,\" Armies of the Night renders this form, with turns historical and fictional.\r\n\r\n“Just as brilliant a personal testimony as Whitman's diary of the Civil War, Specimen Days, and Whitman's great essay on the crisis of the Republic during the Gilded Age, Democratic Vistas. I believe that it is a work of personal and political reportage that brings to the inner and developing crisis of the United States at this moment admirable sensibilities, candid intelligence, the most moving concern for America itself. Mailer's intuition in this book is that the times demand a new form. He has found it.” Alfred Kazin, The New York Times", "asin": "0452272793", "rank": "132770", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51Jvfp6bCnL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}