{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 148, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "An incredibly mesmerizing book!  Do you want to know how brutal this war was?  Do you want to know the good and the bad from the point of view of a Viet Cong family?  Do you want to see the travesty of what war does to a young child selling her body or dating American soldiers?  How about a revisit years later after living in the USA and exploring the differences in the family based upon where they live and the government they live under?This book is so good on so many levels and I could not recommend it higher to learn, although I acknowledge at times it is a little slow.  But what a story it tells!  I would also note there is a movie based upon this book that I hope to see to complete my knowledge on this war from the perspective of the Vietnamese.Buy this book to learn of why the USA should not fight limited wars.  Bring our troops home!"}, {"review_sentiment": 1.0, "review_text": "This is not the full book. It's an abridged version of the first three chapters. WHY"}, {"review_sentiment": 5.0, "review_text": "To the Vietnam Veteran Li Ly Hayslip gives priceless insight into the mind of the enemy we fought and the villagers we tried to help. Being  a Viet Cong spy and villager herself Ms Hayslip reveals the mindset of a people we could not hope to understand even if we served ten tours. Taught from birth the ideals of the importance of Mother Earth, ancestral accomplishments and sacrifices and village life and tradition, coupled with over one hundred years of oppression perpetrated by colonial masters, the Vietnamese people could do none else but support those who promised cultural freedom and self governance. As a Vietnam War Veteran my struggles with many issues have been reconciled by this frank account of what it was really all about. Thank You, Ms Hayslip.Sgt. Dale V. GriggsVietnam, 1969-1972"}, {"review_sentiment": 5.0, "review_text": "The book is well written, introspective and gentle in its characterization of Yankees, village people, family members and soldiers, despite their bad behavior.  Le Ly Hayslip lived in the South, near DaNang, but her family included brothers who fought for both the North and the South.  Her village was divided in its loyalties and there was inevitable spying and reporting on each other.Le Ly portrays her village social harmony before the war and how it disappeared during the conflict.  She describes her parents' behavior and reaction to the extreme danger and turmoil of the times.  She describes her village in loving terms without being overly sentimental.  There are many scenes of high adventure as she tries to navigate safely within a powder-keg environment.  There are other scenes with parents, siblings, friends that seek to make sense out of the senseless, choices when no good ones are available.She discusses the behavior of American GIs, including her involvement with them.  The reader can begin to understand the predicament of young Vietnamese women and their social entrapment.  The case studies of several American soldiers is not flattering, but their behavior is portrayed in a straight-forward manner and it is allowed to speak for itself.When Heaven and Earth Changed Places explains a very complicated situation and underlying reasons that American soldiers couldn't recognize the enemy and their methods couldn't match the commitment of the North Vietnamese.  It shows how technological advantage and superior gun powder can't overcome one's love of home and the need to defend it.Le Ly fled to the States and then returned to reunite with her family twenty years later.  Her mother is still alive and her siblings rise to the occasion in  unpredictable ways.  But there's a kind of completion, a unity of spirit, despite the loss of tradition, ancestors, the father and the mutuality of village life.  This book neither resolves nor concludes, but it gives hope we can survive, and even thrive, when we proceed with our best intentions."}, {"review_sentiment": 5.0, "review_text": "Forty years after the Vietnam War ended, this is still, current, fresh and vibrant. It makes it clear why wars of occupation are futile endeavors."}, {"review_sentiment": 5.0, "review_text": "As a Vietnam infantry veteran, this book has been of great value to me by helping me to better understand the nature of that war and the people of Vietnam. I now have a better understanding of our enemy at the time. I would highly recommend it to any veteran of that unfortunate conflict."}, {"review_sentiment": 5.0, "review_text": "An amazing book.  I visited Vietnam a few years ago and it was very interesting to read a book written by someone that lived there in the war.  Very touching."}, {"review_sentiment": 4.0, "review_text": "Vietnam war era novels such as this should be mandatory reading for high school and college students. Our millennials need to understand war is not all black and white. Hayslip effectively conveyed wars' gray zone."}, {"review_sentiment": 5.0, "review_text": "This book should be mandatory reading for Junior high school students here in the states."}, {"review_sentiment": 5.0, "review_text": "Outstanding!!"}]}, "authors": ["Le Ly Hayslip"], "isbn": "0452271681", "longitude": 0.0, "periods": ["1900s"], "title": "When Heaven and Earth Changed Places", "word_cloud": "incredibly mesmerize brutal war good bad point view family travesty war young child sell body date american soldier revisit year later live explore difference family base live government good many level higher learn acknowledge time little slow story tell also movie base hope complete war perspective learn fight limit war troop home full abridge version first chapter why give priceless insight mind enemy fight villager try help spy villager reveal mindset people understand even serve ten tour birth ideal importance ancestral accomplishment sacrifice village life tradition couple year oppression perpetrate colonial master vietnamese people else support promise cultural freedom self governance struggle many issue reconcile frank account really well write introspective gentle characterization yankees village people family member soldier bad behavior live family include brother fight village divide loyalty inevitable spy report portrays village social harmony war disappear conflict describe parent behavior reaction extreme danger turmoil time describe village loving term overly sentimental many scene high adventure try navigate safely environment scenes parent sibling friend seek make sense senseless choice good one discus behavior american include involvement begin understand predicament young vietnamese woman social entrapment case study several american soldier flatter behavior portrayed manner allow speak explain complicate situation underlie reason american soldier enemy method commitment show technological advantage superior gun powder love home need defend flee state return reunite family year later mother still alive sibling rise occasion unpredictable way kind completion unity spirit loss tradition ancestor father mutuality village life resolve concludes give hope survive even thrive proceed best intention year end still current fresh vibrant make clear war occupation futile endeavor infantry veteran great value help better understand nature war people better understand enemy time highly veteran unfortunate conflict amazing visit year ago interest write someone live war very touch war era novel mandatory read high school college student millennial need understand war black white effectively convey war gray zone mandatory reading high school student state outstanding", "genres": ["Memoir"], "summary": "It is said that in war heaven and earth change places not once, but many times. When Heaven and Earth Changed Places is the haunting memoir of a girl on the verge of womanhood in a world turned upside down. The youngest of six children in a close-knit Buddhist family, Le Ly Hayslip was twelve years old when U.S. helicopters langed in Ky La, her tiny village in central Vietnam. As the government and Viet Cong troops fought in and around Ky La, both sides recruited children as spies and saboteurs. Le Ly was one of those children.\r\n\r\nBefore the age of sixteen, Le Ly had suffered near-starvation, imprisonment, torture, rape, and the deaths of beloved family members—but miraculously held fast to her faith in humanity. And almost twenty years after her escape to America, she was drawn inexorably back to the devastated country and family she left behind. Scenes of this joyous reunion are interwoven with the brutal war years, offering a poignant picture of Vietnam, then and now, and of a courageous woman who experienced the true horror of the Vietnam War—and survived to tell her unforgettable story.\r\n\r\n\"Touching and illuminating . . . lucid, lyrical . . . a searing and human account.\" New York Times", "asin": "0452271681", "rank": "109451", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51fb2s8K9lL.jpg", "country": "Hanoi", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}