{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 109, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Gret. Please translate the last book."}, {"review_sentiment": 4.0, "review_text": "It was ok"}, {"review_sentiment": 5.0, "review_text": "Great anti hero, great history, great secondary characters set in Madrid with swords , literature and art"}, {"review_sentiment": 5.0, "review_text": "A good read about a time in history with which I'm not familiar."}, {"review_sentiment": 4.0, "review_text": "Nice historical fiction adventure novel that take place around the 16 century. An spaniard mercenary live."}, {"review_sentiment": 5.0, "review_text": "wonderful writing"}, {"review_sentiment": 5.0, "review_text": "Exciting and easy to read"}, {"review_sentiment": 4.0, "review_text": "Set in 17th century Spain this is the tale of a swash buckling soldier and expert swordsman who is down on his luck and takes jobs of sometimes questionable honor. Alatriste has some trusted friends including a poet who is also an expert with sword fighting and is a favorite poet of the king, which royal favor saves his life from time to time. The tale is narrated by a thirteen year old boy who is under the care of Alatriste and who greatly admires him and even has the chance to save Alatriste’s life, more than once. King Philip IV, courtiers, mysterious noblemen from England, the Inquisition, and many dangerous men inhabit this world. I look forward to the second book in the series."}, {"review_sentiment": 4.0, "review_text": "Perez-Reverte is  the master of the historic novel, a genre that demonstrates his detailed knowledge of historical periods. The two novels I have read by him so far allude to, or use as the setting, late 17th-early 18th century Europe. The central location is Madrid, but the spokes extend to all the regions in Europe that had a relationship with Spain at that time.  In this series, the protagonist features in adventures that showcase his swashbuckling activities and personality. There are several occasions to weave in a historically based story, fictionalization for drama, but clearly an excuse for Perez-Reverte to show off his detailed knowledge of history, social dynamics, church politics, cultural events and art. Very entertaining as well, and, thankfully beautifully written. A pleasure to read."}, {"review_sentiment": 5.0, "review_text": "Alatriste is the beginning of a great saga by Perez Reverte. Highly recommended for those looking for an adventure novel with real historical value behind. The novel is based on manuscripts found a few years ago written by Alatriste's right hand over 400 years ago and perfected in a novel format by Perez Reverte"}]}, "authors": ["Arturo Perez-Reverte"], "isbn": "0452287111", "longitude": -3.7035825, "periods": ["1600s"], "title": "Captain Alatriste", "word_cloud": "last anti hero great history great secondary character set sword literature art good time history familiar historical fiction adventure place century spaniard mercenary live wonderful writing excite easy set century tale swash buckle soldier expert swordsman luck take job sometimes questionable honor trust friend include poet also expert sword fight favorite poet king royal favor save life time time tale narrate thirteen year old boy care greatly admire even chance save life courtier mysterious nobleman many dangerous men inhabit world look forward second series master historic genre demonstrate detailed knowledge historical period novel far allude use setting late century central location spoke extend region relationship time series protagonist feature adventure showcase swashbuckling activity personality several occasion weave historically base story fictionalization drama clearly excuse detailed knowledge history social dynamic church politics cultural event art entertain well thankfully beautifully write pleasure begin great saga recommend look adventure real historical value base manuscript find year ago write right hand year ago perfect format", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The novels of Arturo Pérez-Reverte have captivated readers around the world and earned him a reputation as “the master of the intellectual thriller” (Chicago Tribune). His books have been published in fifty countries. Now, beginning with Captain Alatriste, comes Pérez-Reverte’s most stunning creation to date: a riveting series featuring the adventures of an iconic hero.\r\n\r\nCaptain Alatriste is the story of a fictional seventeenth-century Spanish soldier who lives as a swordsman-for-hire in Madrid. Needing gold to pay off his debts, Alatriste and another hired blade are paid to ambush two travelers, stage a robbery, and give the travelers a fright. “No blood,” they are told.\r\n\r\nThen a mysterious stranger enters to clarify the job: he increases the pay, and tells Alatriste that, instead, he must murder the two travelers. When the attack unfolds, Alatriste realizes that these aren’t ordinary travelers, and what happens next is only the first in a riveting series of twists and turns, with implications that will reverberate throughout the courts of Europe.", "asin": "0452287111", "rank": "355271", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/416CYB6HP1L.jpg", "country": "Spain", "story_arc": ["Tragedy", "Things only get worse"]}