{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 43, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "I had a hard time getting into this book, but kept reading. Totally worth it, characters, places, events come alive and transports you to another place."}, {"review_sentiment": 5.0, "review_text": "I am partial to Latin American writers. This is the first novel I have read by a Puerto Rican writer. A little different, but very enjoyable.  I will certainly read her other novels and stories. I am sorry she is no longer with us."}, {"review_sentiment": 4.0, "review_text": "This family saga is a terrific introduction to Puerto Rican history and culture. It follows many generations of a single family, and we learn about politics, economics, prejudice, social mobility and women's issues.However, I didn't finish it, and this was (I think) due to reading it in Kindle format. I found it hard to keep track of all the characters through the generations. There was a family tree at the beginning of the book, but it was too small to read on the Kindle. Plus, I couldn't keep going back and forth to the front because of being on a Kindle. (It would have been way easier to flip to the front of a physical book.)  So I never did find out what happened to all of the very vivid characters. Boo."}, {"review_sentiment": 5.0, "review_text": "Product as described. Fast shipping"}, {"review_sentiment": 5.0, "review_text": "A complex novel of family life and politics in Puerto Rico."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this story but at times it was hard to follow the story line as to who belonged to each family.  I was half way through the book before I realized there was a story in the story"}, {"review_sentiment": 5.0, "review_text": "I attended high school with Rosario in Boston area and was thrilled to read her well written book. Through it I learned much about Puerto Rican history and culture, an interest of mine."}, {"review_sentiment": 3.0, "review_text": "Didn't hold my interest. Too much reminiscing."}, {"review_sentiment": 4.0, "review_text": "A very interesting story about familial relationships.  I thoroughly enjoyed it!"}, {"review_sentiment": 1.0, "review_text": "The House on the lagoon came off as trying to be the Puerto Rican 100 Years of Solitude.  It fails."}]}, "authors": ["Rosario Ferre"], "isbn": "0452277078", "longitude": 0.0, "periods": ["1900s"], "title": "The House on the Lagoon", "word_cloud": "hard time get keep read worth character place event come alive transport place partial latin american writer first puerto rican writer little different enjoyable certainly story sorry longer family saga terrific introduction history culture follow many generation single family learn politics economics prejudice social mobility woman finish think due read format find hard keep track character generation family tree begin small go back forth front way easier flip front physical never find happened vivid character boo product describe shipping complex family life politics enjoy story time hard follow story line belong family half way realize story story attend high school area thrill well write learn much puerto rican history culture interest mine interest too much reminiscing interesting story familial relationship thoroughly enjoy come try rican fail", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Finalist for the National Book Award: A breathtaking saga from Puerto Rico’s greatest literary voice\r\n\r\nThis riveting, multigenerational epic tells the story of two families and the history of Puerto Rico through the eyes of Isabel Monfort and her husband, Quintín Mendizabal. Isabel attempts to immortalize their now-united families—and, by extension, their homeland—in a book. The tale that unfolds in her writing has layers upon layers, exploring the nature of love, marriage, family, and Puerto Rico itself.\r\n\r\nWeaving the intimate with the expansive on a teeming stage, Ferré crafts a revealing self-portrait of a man and a woman, two fiercely independent people searching for meaning and identity. As Isabel declares: “Nothing is true, nothing is false, everything is the color of the glass you’re looking through.”\r\n\r\nA book about freeing oneself from societal and cultural constraints, The House on the Lagoon also grapples with bigger issues of life, death, poverty, and racism. Mythological in its breadth and scope, this is a masterwork from an extraordinary storyteller.", "asin": "0452277078", "rank": "690133", "city": "Puerto Rico", "image": "https://images-na.ssl-images-amazon.com/images/I/510EwvRF%2B4L.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}