{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 43.316845, "ratings": {"num_ratings": 19, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Asne Seierstad was a freelance journalist in Moscow when the first Chechen war broke out.  Acting under a poorly-understood compulsion to find out what was really going on there, she sweet-talked her way onto a military transport plane and ended up in Grozny.  She spent several months during the first war, and again during the second war, slipping around Chechnya, often disguised as a Chechen woman in order to avoid attention and get into places foreigners were forbidden to enter, so she could interview people touched by the conflict.  Hosted by Hadijat, a woman running an unofficial orphanage in Grozny, she focuses heavily on the stories of women and children, but also speaks with others, including a couple of encounters with Ramzan Kadyrov, Chechnya's infamous president.  The result is a fascinating book in which interviews and Seierstad's personal experiences are woven into a more or less coherent narrative.Seierstad's own story is riveting: she makes no claims to heroism, but she is obviously a tough and determined reporter, who doesn't hesitate to visit taboo families, such as the relatives of resistance fighters and even participants in the Dubrovka siege, or to ask Kadyrov probing questions, which he sidesteps with stunning barrages of word salad.  The picture she paints of Chechnya's current leader is grim: while she is slightly more sympathetic than, say, Politkovskaya, mentioning how he sits there doodling flowers with faces and looking sheepish when she asks tough questions, the ultimate impression is of someone utterly unsuited to uphold the dignity of office he represents, and who can't even sit still and speak in complete, coherent sentences, let alone tell the truth.  The allegations of misconduct against Kadyrov are graver than those aimed at the US's own Donald Trump, but in character, they seem worrisomely similar.  But enough about that.A fluent Russian speaker and originally well-disposed towards Russia and Russians, Seierstad finds herself becoming increasingly appalled by the excesses inflicted by her adopted country on this tiny nation.  At the same time, Chechnya and the Chechens are hardly angels themselves: Seierstad recounts horrifying stories of abuse, in which husbands attack their wives, men rape their children, brothers kill their sisters, and Chechens commit dreadful crimes against other Chechens.  Giving Chechens more control, in the form of the Kadyrovtsy, has had nasty side effects: under the guise of returning to their Chechen roots, the government has instigated widespread oppression of women, and people suspected of Wahhabism are grabbed off the street, tortured, and sometimes disappeared.  All it takes is for a man to wear his hair slightly too long at the back for him to be whisked away, perhaps never to return; women have it even harder in some ways, since they are now forced to wear headscarves and dress modestly, but dressing TOO modestly and covering up TOO much of their hair can be taken as a sign of Wahhabism.  The book came out ten years ago, but if anything it seems that the situation in Chechnya has only gotten more dire, something the book foreshadows: it ends, not with a happy story of rehabilitated orphans, but on a warning note: Hadijat's orphanage is in danger of being shut down, and some of her children are totally out of control, enraging and endangering the others as they act out as a result of the trauma they have suffered.One thing all of the disparate writers I've read on this and other wars agree about is that war reveals whatever a person's true character is, showing both their strengths and their weaknesses.  Reading this book, I was struck by how true this seems not just for individuals, but for nations.  Seierstad's book uncovers some of the pathologies at the heart of both Russia and Chechnya (are they one nation or two?  Both, it seems).  Caught up in a sick, co-dependent relationship, both nations have retreated into nationalism and attempts to preserve their heritage in the face of external attack.  Unfortunately, the parts of their heritage they are trying to preserve are often the very things they should be most eager to throw away.  Seierstad chronicles the rising xenophobia of Russian young men, who horrify their grandparents, survivors of WWII, by tattooing swastikas on their bodies, and records how young Chechen men retreat from their problems by attacking women--sometimes verbally, sometimes physically--and torturing dogs.  Sometimes nations respond to a terrible self-inflicted trauma by learning from it as they attempt to rise from the ashes: think Germany after WWII, or Rwanda after the massacres of the 1990s.  The Chechen wars could have had the same effect on Russia and Chechnya, but they have not.  Perhaps they were not traumatic enough (easy to believe for Russia; harder for Chechnya), or perhaps both nations have enough grievances against the other to avoid looking their own flaws square in the face, preferring instead to point fingers and lay blame everywhere but where it lies.  What will happen in the future is anyone's guess, but \"The Angel of Grozny\" does not give much hope for improvement any time soon, and neither do events since the book was published.\"The Angel of Grozny\" is not a light read, but it is informative and compelling.  Highly recommended for anyone interested in Chechnya, the Chechen wars, or post-Soviet Russia, or if you're just looking for a book by and about women affected by war."}, {"review_sentiment": 5.0, "review_text": "Brave reporting in the most dangerous place on earth"}, {"review_sentiment": 4.0, "review_text": "This review is from: The Angel of Grozny: Inside Chechnya (Kindle Edition)An excellent look at the tragedy that is Chechnya, as the author moves through the country, meeting families with missing sons, traumatized children being cared for by the eponymous 'angel', and even the president himself.The trouble between Russia and this republic dates back into ancient times: Tolstoy served here, fighting local rebels. More recently the hatred felt by the Chechens for Russia was fanned by the policy of moving whole villages of Chechens to live in the wilds of Kazakhstan. And as one reads of the destruction, the brutal killings and beatings by Putin's men, one feels utter sympathy for Chechnya.And yet the author presents a balanced picture: the Russian soldiers, young conscripts straight out of school, killed or horrifically maimed by Chechen landmines. Perceived 'special treatment' of Chechen migrants to Moscow - infuriating the Russians.And the issue of Islamic fundamentalism, which was starting to figure in the Chechens' reason for making war on their neighbor....Does Putin have reason for his iron control over the republic?Not a book with any answers, but extremely informative and readable."}, {"review_sentiment": 5.0, "review_text": "My wife had this glued to her hands until it was finished! Apparently an insightful tale that will make you look at life in a different light."}, {"review_sentiment": 5.0, "review_text": "The book was easy to read and was difficult to put down.  I loved it but it was difficult to hear the stories.  It hurt so much to hear what people had to go through in their lives.  Thank you so much"}, {"review_sentiment": 5.0, "review_text": "I stumbled across this book of a forgotten chapter of recent history by accident and could not put it down!  The author has a wonderful eye for relating the simple, yet complex nature of ordinary people living in desparate conditions. From the first to the last chapter you are caught up in the lives of people you feel have become so real to you - and you leave the book wanting to know more.  An excellent tale from a gifted story teller!"}, {"review_sentiment": 5.0, "review_text": "As always with whatever I order from Amazon, the book arrived very quickly.  It was new and in excellent shape.  The content of this book is, however, sad and tragic, but I would recommend this book for anyone to read and see how the horrors of war affect the innocent children who suffer the most."}, {"review_sentiment": 5.0, "review_text": "This writer doesn't hold anything back - She isn't interested in the palatable version of historical events, but personalizes and makes clear the impact of political acts on individual people.  She reminds me of Seymour Hersh..."}, {"review_sentiment": 3.0, "review_text": "Very interesting read.  Was fascinated by the early chapters where Seierstad writes of how she entered a war zone and then how she subsequently snuck into the country undetected to provide detailed accounts from various perspectives to shed light on the complexity of Russian/Chechnyan relations/history.My favorite passages related to:1.  The process that got her to Chechnya during the 1st Russian/Chechnyan War2.  The process of how she snuck into Chechnya thru Ossetia during the 2nd Russian/Chechnyan War3.  Her interview with a Chechnyan who fought for Stalin in the front lines against the Nazis and his experience returning from war only to be told he no longer had a home in Chechnya because his people were deemed Nazi Sympathizers.4.  The confusion of children torn and born in the middle of a war.  The passage on a young man's bitter hatred of Russians because his family were killed by them and how, in his confusion felt Hitler was a hero because he killed Russians.5.  Accounts of Chechnyan life during the relocation by Stalln.6.  The interview with Ramzan Padryov, current Putin-backed leader of ChechnyaThere are certain aspects of the book that I found less interesting such as the writer's poetic overly descriptive passages that made her points unclear (e.g. being overly descriptive of how people were dressed and or weather conditions such as the passage on the icy banks of Moscow).  It was distracting and slowed the momentum of the passages that were gripping.Although there is a bias towards the Chechyan viewpoint, I appreciated Seierstad's attempts at counterbalancing her story with the Russian viewpoint such as the soldier Nikolai who was badly injured from a mine explosion and points of view of Russian bully's who were convicted of hate crimes by bureaucratic court system that appeared to exercise no common sense.I think she poetically expressed the juxtaposition of Russian/Chechnyan relations from her anecdote while on a train to Moscow and having a discussion with Russian mathematicians: \"Had I become too negative?\"There were silly little interesting tidbits that I enjoyed reading such as a World War 2 soldier's recollection of how horses were good swimmers and how the Roman calender was altered because of addition of July (to comemorate Julius Caesar) and August(to comemorate Augustus Caesar) which explains why October really means \"eight month.\"One aspect of the book I found disappointing was of her lack of effort when she managed to have a one-on-one interview with current leader of Chechnya, Ramzan Kadyrov opting instead to use her time to insult him and his role as the current leader of Chechnya.  It would have been a more fascinating interview to understand his views of Chechnya prior to the 1st and 2nd Russian-Chechnyan Wars and the basis of understanding how two strongly divided foes (Russia/Chechnya) were able to form some kind of reconciliation given the bitter history.One thing that is captured quite well in this book is that of how the Russian Chechnyan Wars have lead to a whole lot of unnecessary suffering."}, {"review_sentiment": 4.0, "review_text": "Journalist Asne Seierstad always one for a challenge takes us inside Chechnya and talks to the residents of one of the Russian Federations most volatile republics that has been absolutely gutted by two wars between The Russians and Chechen/Islamic insurgents in the mid 1990's and early 2000's. It is one thing to read the cold grey of newspaper statistics from a war zone...x people killed, y people injured, but it is quite another to sit in the living room and listen to the story of a mother whose lost her entire family to the war either because of the insurgency or Russian forces.That's what I liked most about this book, Seierstad has really managed to put a human face on decades of war. These people took great personal risk in sharing their stories and in sharing their stories provided a more nuanced and heartbreaking portrait of the costs of war. The quick and engaging prose makes the 340 pages of the book just fly by as the reader becomes deeply engrossed in the individual stories that are laid before them. At times, raw and uncompromising, while at other points brimming with compassion, The Angel of Grozny is highly recommended reading for anyone looking to move beyond the grim statistics of the Russian-Chechen conflict."}]}, "authors": ["Asne Seierstad"], "isbn": "0465019498", "longitude": 45.698967, "periods": ["1900s", "2000s", "Recent Releases"], "title": "The Angel of Grozny: Orphans of a Forgotten War", "word_cloud": "freelance journalist first break compulsion find really go way military transport plane end spend several month first second slip often disguise woman order avoid attention place foreigner forbid enter interview people touch conflict woman run unofficial orphanage focus heavily story woman child also speak others include couple encounter infamous president result fascinate interview personal experience woven le coherent story rivet make claim heroism obviously tough determine reporter hesitate visit taboo family relatives resistance fighter even participant siege ask probe question sidestep stun barrage word salad picture paint current leader grim slightly sympathetic say mention sits doodle flower face look sheepish asks tough question ultimate impression someone utterly unsuited uphold dignity office represent even still speak complete coherent sentence alone allegation misconduct graver aim character seem worrisome similar enough fluent speaker originally towards find become increasingly appalled excess inflict adopted country tiny nation time hardly angels recount horrify story husband attack wife men rape child brother kill sister commit dreadful crime give control form nasty side effect guise return root government instigate widespread oppression woman people suspect grab street torture sometimes disappear take man wear hair slightly long back whisk perhaps never return woman even harder way force headscarf dress modestly dress modestly cover much hair take sign come year ago anything seem situation get dire something foreshadows end happy story rehabilitate warn note orphanage danger shut child totally control enrage endanger others act result trauma thing disparate writer war agree reveals person true character show strength weakness read strike true seem individual nation uncovers pathologist heart nation seem sick relationship nation retreat nationalism attempt preserve heritage face external attack part heritage try preserve often thing eager chronicle rise xenophobia russian young men grandparent survivor tattoo swastika body record young men retreat problem attack woman sometimes verbally sometimes physically torture dog nation respond terrible trauma learn attempt rise ash think massacre war effect perhaps traumatic enough easy believe harder perhaps nation enough grievance avoid look flaw square face prefer instead point finger lay blame everywhere lie future anyone guess much hope improvement time soon event publish light informative compelling recommend anyone interested war look woman affect report dangerous place earth review excellent look tragedy author move country meeting family miss son traumatize child care eponymous even president trouble republic date back ancient time serve fight local rebel more recently hatred felt fan policy move whole village live wild read destruction brutal killing beating men feel utter sympathy yet author present balance picture russian soldier young conscript straight school kill horrifically maim landmines treatment migrant infuriate issue fundamentalism start figure reason make neighbor reason iron control republic not answer extremely informative readable wife glue hand finish apparently insightful tale make look life different light easy difficult put love difficult hear story hurt much hear people go live much stumble chapter recent history accident author wonderful eye relate simple yet complex nature ordinary people live desperate condition first last chapter catch life people feel become real leave wanting know excellent tale gift story teller always order arrive quickly new excellent shape content however sad tragic anyone see horror affect innocent child suffer writer hold anything back interest palatable version historical event personalizes make clear impact political act individual people remind hers very interesting fascinate early chapter write enter zone subsequently snick country undetected provide detailed account various perspective shed light complexity favorite passage relate process get process snick thru interview fight front line experience return tell longer home people deem confusion child tear bear middle passage young man bitter hatred family kill confusion felt hero kill account life relocation interview current leader certain aspect find le interesting writer poetic overly descriptive passage make point unclear overly descriptive people dress weather condition passage icy bank distract slow momentum passage bias towards viewpoint appreciate attempt counterbalance story russian viewpoint soldier badly injure mine explosion point view russian bully convict hate crime bureaucratic court system appear exercise common think poetically express juxtaposition relation anecdote train discussion mathematician have become negative silly little interesting tidbit enjoy read soldier recollection horse good swimmer calendar alter addition commemorate commemorate explain really mean month aspect find disappointing lack effort manage interview current leader opt instead use time insult role current leader fascinate interview understand view prior basis understand strongly divide foe able form kind reconciliation give bitter thing capture quite well russian lead whole lot unnecessary suffering always challenge take talk resident russian volatile republic absolutely gutted war insurgent mid early thing cold grey newspaper statistic x people kill people injured quite sit living room listen story mother lost entire family insurgency like really manage put human face decade people take great personal risk share story share story provide nuanced heartbreaking portrait cost quick engaging prose make page fly becomes deeply engrossed individual story lay time raw uncompromising point brim compassion highly recommend read anyone look move grim statistic conflict", "genres": ["History"], "summary": "In the early hours of New Year’s 1994, Russian troops invaded the Republic of Chechnya, plunging the country into a prolonged and bloody conflict that continues to this day. A foreign correspondent in Moscow at the time, Åsne Seierstad traveled regularly to Chechnya to report on the war, describing its affects on those trying to live their daily lives amidst violence.\r\n\r\nIn the following decade, Seierstad became an internationally renowned reporter and author, traveling to the Balkans, Afghanistan, Iraq, and other war-torn regions. But she never lost sight of this conflict that had initially inspired her career. Over the course of a decade, she watched as Russia ruthlessly suppressed an Islamic rebellion in two bloody wars and as Chechnya evolved into one of the flashpoints in a world now focused on the threat of international terrorism.\r\n\r\nIn 2006, Seierstad finally returned to Chechnya, traveling in secret and under the constant threat of danger. In a broken and devastated society she lived with orphans, the wounded, the lost. And she lived with the children of Grozny, those who will shape the country’s future. She asks the question: What happens to a child who grows up surrounded by war and accustomed to violence?\r\n\r\nA compelling, intimate, and often heartbreaking portrait of Chechnya today, The Angel of Grozny is a vivid account of a land’s violent history and its ongoing battle for freedom.", "asin": "0465019498", "rank": "953850", "city": "Grozny", "image": "https://images-na.ssl-images-amazon.com/images/I/51Kb48NZdkL.jpg", "country": "Russia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}