{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 21, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I read this while I spent several weeks in the Galapagos last month--this book provided a really firm foundation for my time there all told in an informative, entertaining way. I highly recommend this book to anyone with even a passing interest in the past, present, and future of these remarkable islands."}, {"review_sentiment": 2.0, "review_text": "This could be an interesting book if you know nothing about the Galapagos, but this was the 4th of 5 books that I read in preparation for my first trip to those islands and there was little new here for me."}, {"review_sentiment": 4.0, "review_text": "The book provides a good mix of historical data and up to date information."}, {"review_sentiment": 4.0, "review_text": "I read this book when we were in the Galápagos Islands and finished right after we finished our trip, the book is a great read, has lots of detailed information."}, {"review_sentiment": 5.0, "review_text": "A great little read if you are traveling to the Galapagos or have done so. Also alarming to think about how much the human footprint impacts the world. Fascinating information about Darwin & other scientists' discoveries as well."}, {"review_sentiment": 5.0, "review_text": "Everything went great!"}, {"review_sentiment": 4.0, "review_text": "Detailed, nitty-gritty  descriptions that came to life as I toured the islands. Well-written and never dull. Made my trip much more enjoyable.V.Reter"}, {"review_sentiment": 4.0, "review_text": "Great introduction to a set of islands where geologic and biologic evolution are both laid out in front of you. Our family trip there was more interesting having read this book before hand."}, {"review_sentiment": 5.0, "review_text": "Loved it!  Going to Galapogos Islands in Fall and now even more psyched than before!!!!"}, {"review_sentiment": 4.0, "review_text": "This book is one of those that are so delightful to own and to read.  It is a tactile pleasure for the true bibliophile, one of those rare breed who love the feel of a book as much as the words within.  The cover illustrations immediately draw the reader to the pages and are reminiscent of John James Audubon's best work.  The deckled edges, heavy paper, and cream tone make it feel like a gift book.  If you're thinking of purchasing, definitely buy the print version because the physical components are as important as the ideas.The ideas, though, are quite fascinating, if you're into Darwin.  I had been reading a lot of Darwin and happened upon this book.  I wanted to read more of his theories without having to delve into his original works, parts of which I've read and found a bit boring.  This book did provide a bit more excitement, but it won't make you grit your teeth with thrills.  It is, instead, a fascinating and gentle historical read about natural selection as seen upon the Galapagos Islands.  I do not claim to be a naturalist and could only name about 15 birds by sight if I were hard-pressed.  However, the text and explanations were fascinating to me and I think even a casual reader of natural history would find something in this book to love."}]}, "authors": ["Henry Nicholls"], "isbn": "0465035973", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "The Galápagos: A Natural History", "word_cloud": "spend several week last month provide really firm foundation time tell informative entertaining way highly recommend anyone even pass interest present future remarkable island nothing preparation first trip island little new provide good mix historical data date information finish right finish trip great lot detail information great little travel do also alarm much human footprint impact world fascinate information scientist discovery well everything go great detailed description come life tour island never dull trip much great introduction set island geologic biologic evolution lay front family trip interesting hand love go even psyched delightful tactile pleasure true bibliophile rare breed feel much word cover illustration immediately draw page reminiscent best work deckle edge heavy paper cream tone make feel gift think purchasing definitely print version physical component important idea quite fascinate read lot happen want theory delve original work part find bit boring provide bit excitement grit teeth thrill instead fascinate gentle historical selection see claim naturalist bird sight however text explanation fascinate think even casual something", "genres": ["History", "Travel Writing", "Science & Nature"], "summary": "Charles Darwin called it “a little world within itself.” Sailors referred to it as “Las Encantadas”— the enchanted islands. Lying in the eastern Pacific Ocean, straddling the equator off the west coast of South America, the Galápagos is the most pristine archipelago to be found anywhere in the tropics. It is so remote, so untouched, that the act of wading ashore can make you feel like you are the first to do so.\r\n\r\nYet the Galápagos is far more than a wild paradise on earth—it is one of the most important sites in the history of science. Home to over 4,000 species native to its shores, around 40 percent of them endemic, the islands have often been called a “laboratory of evolution.” The finches collected on the Galápagos inspired Darwin's revolutionary theory of natural selection.\r\n\r\nIn The Galápagos, science writer Henry Nicholls offers a lively natural and human history of the archipelago, charting its course from deserted wilderness to biological testing ground and global ecotourism hot spot. Describing the island chain's fiery geological origins as well as our species' long history of interaction with the islands, he draws vivid portraits of the life forms found in the Galápagos, capturing its awe-inspiring landscapes, understated flora, and stunning wildlife. Nicholls also reveals the immense challenges facing the islands, which must continually balance conservation and ever-encroaching development.\r\n\r\nBeautifully weaving together natural history, evolutionary theory, and his own experience on the islands, Nicholls shows that the story of the Galápagos is not merely an isolated concern, but reflects the future of our species' relationship with nature—and the fate of our planet.\r\n\r\n“With pink iguanas and blue-footed boobies (not to mention red-footed ones that like to hide toy plastic bassoons and other jetsam in their hilltop nests), the islands are a carnival of amazing beings that somehow thrive in a place that has reminded visitors (from a 15th-century Spanish bishop to Herman Melville) of a slag heap or the gates of hell. Henry Nicholls introduces and celebrates these wonders and more in seven short chapters covering the geology, ocean life, seabirds, plants, invertebrates, land birds and reptiles of the archipelago. Three more explore the human impact and the hope that Nicholls and others have for the islands' future.” The Guardian ", "asin": "0465035973", "rank": "236407", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/51tBaGdVwbL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}