{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 13, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "A fantastic book with just the right balance between hard facts and more anecdotal stories from the city's past. A must-read for all Berlin fans."}, {"review_sentiment": 4.0, "review_text": "Framed by the two unifications of Germany in 1871 and 1990, Large writes an excellent history of Berlin. Berlin's history can be divided into concrete historical eras that mirror the events of Germany. Bismarckian Berlin. Wilhelmine Berlin. Weimar Berlin. Nazi Berlin. And then the era of two Berlins during the era of a divided Germany, when only the East German state had Berlin as its capital.Before 1871, Germany had been decentralized and many cities across the various German states were centers of art and politics. Then centralization occurred under Berlin. However, the defeat and destruction of the city during WWII saw decentralization once again become the norm in the post WWII period. Today's Berlin is nowhere near as important to modern Germany as it was to Germany between the late nineteenth century and the end of WWII.Beginning with the unification of Berlin that expanded the metropolis to the third largest city of the world at the time (behind only New York and London), Large starts the story in the latter half of the nineteenth century when Berlin was a relative backwater in Germany. But centralization and population growth transformed the city. Bismarckian and Wilhelmian Berlin are the high points of Berlin. A stable economy and political scene allowed the city to thrive. But with the end of WWII, the downfall truly began. Though one could state it began earlier with the end of WWI.The decline began first with Weimar Berlin, one of the cultural golden periods of the world. But it was beset by political and economic problems that ultimately doomed it and the state of Germany. Then the 12 years of Nazi Berlin which saw Berlin at the center of a huge empire but then destroyed. And it fell into ruin..And not just ruin. But division as well. The city was divided into four sectors and then two sectors. What we now call West Berlin and East Berlin. And the ignominy of it all, - West Berlin was not even the capital anymore. A tiny town far to the West, Bonn, was the capital of West Germany. But East Germany kept their side of Berlin as its capital so at least Berlin was the capital of a Germany.The story continues during the Cold War period with all the famous events - Berlin Airlift, Building of the Wall, Tearing Down the Wall, Unification, and a close vote that led to Berlin becoming the capital again.Large does a great job of writing political, social, cultural, and economic history. This is not a dry, dusty tome. This is a lively biography of a city central to the twentieth-century. Though when it comes to architecture, perhaps the author could revisit some of his sentences such as this one  when discussing the Gedächtniskirche (Kaiser Wilhelm Memorial Church) - \"Comparing it as it looks today with photographs from before the war, one can only conclude that this building was improved by the bombing\". Yeah, that kind of criticism makes one wonder about the author. Still, this is definitely a book one wants to read to understand the importance of Berlin and its importance to the history of the world since the late 19th century."}, {"review_sentiment": 2.0, "review_text": "I was hoping for a few personal stories to pull the history together. I found the writing pretty dry. It went into way too much detail on the arts and architecture. I just read a book on Amsterdam which was more engaging. I would not recommend the book."}, {"review_sentiment": 4.0, "review_text": "I have mixed feelings about the book Berlin. The first half is rather disappointing. There are other books that describe Weimar Berlin better; he devotes too much time to describing the national politics before WWI, and I found a book about Berlin without a single map annoying. The quality of the photographs, in general, is disappointing. In addition, the book has no bibliography, perhaps because it would have made a very large book too unwieldy. But once Hitler appears, the book soars. Throughout, Large has a remarkable ability to describe events precisely and coherently. His descriptions of the chaos on Nov. 9 1918, the Kapp Putsch, and numerous other events are perhaps the best and most succinct I've read. He also has marvelous turns of phrases; for example, \"The sightings (of Hitler) continued for decades and with a frequency that rivaled those of the Virgin Mary and Elvis Presley.\" Definitely not 5; at times, 3. I gave it 4."}, {"review_sentiment": 4.0, "review_text": "A good history of this great city.  My only dislike was the author's negative criticism of the post war architecture of Berlin. I just don't agree. A personal difference of opinion only."}, {"review_sentiment": 5.0, "review_text": "The book, Berlin, is a very well written and researched book an an easy and very interesting read.  a must read for any person interested in European history and german history in particular."}, {"review_sentiment": 5.0, "review_text": "A wonderful panorama of Berlin's life, spanning the late 19th to the 21st centuries. Mr. Geyer's review notwithstanding, several friends born and raised in Berlin have asked to borrow the book after reading parts of it, they were so taken by it; that to me gives it all the legitimacy it needs."}, {"review_sentiment": 5.0, "review_text": "Disclosure: I'm only about 200 pages into this book, but I can't recommend it enough. Berlin may easily be the most historically fascinating place on earth, and in David Clay Large's book characters like von Bismarck and Kaiser Wilhelm II come to life with vivid detail. I simply have not been able to put it down. It's even more exciting if you read it after having visited Berlin, as I had the I had the opportunity to do--then the story truly acquires a sense of dimension. Funny, colloquial, sarcastic and even slightly gossipy, this is history writing at its most entertaining."}, {"review_sentiment": 4.0, "review_text": "Urban history of European capitals has become a popular thing to write about it and Large does not disappoint. This tracks Berlins troubled history from the early days, through Prussia, German dominance, reforms by Hitler to the modern day with the renovations of Alexander square.  Like most of these books if you have never visited the city it will not hold the same allure. For those who have been to Berlin this is well worth reading and getting a sense of the city.  It is clearly written and does not get bogged down on details. It is through enough without making it a year by year update of the changes.  It covers the social and political aspects as well. Overall if you want to know about how Berlin developed this is the only book for you."}, {"review_sentiment": 5.0, "review_text": "Though at first the size of the book seems to be huge, Large infused every page of this wonderful novel with sensory rich descriptions that helped the reader feel what life in Berlin was like during the city's many different stages.  Clearly an expert in this field, Large provides amusing and interesting details about famous landmarks, areas, and figures throughout the cities turbulant history.  Having read the book only weeks before my planned trip to the German capital, I now look at the book as an indepth tour guide of the city.  I got goosebumps sometimes even seeing a street sign named after an important figure in the city's history who after reading the book, I was able to recall the impact this person had on creating the atmosphere of the vibrant city of modern Berlin, now one of my very favorite in all the world."}]}, "authors": ["David Clay Large"], "isbn": "046502632X", "longitude": 13.3888599, "periods": ["1800s", "1900s"], "title": "Berlin", "word_cloud": "fantastic right balance hard fact anecdotal story city fan frame unification write excellent history history divide concrete historical era mirror event era era divide german state decentralize many city various german state center art politics then centralization occur however defeat destruction city saw decentralization norm post period nowhere near important modern late nineteenth century end unification expand metropolis third largest city world time start story latter half nineteenth century relative backwater centralization population growth transform city high point stable economy political scene allow city thrive end downfall truly begin one state begin earlier end decline begin first cultural golden period world political economic problem ultimately doom state then year saw center huge empire destroyed fell ruin division well city divide sector sector call ignominy even capital anymore tiny town far capital keep side capital least capital story continue period famous event close vote lead become capital great job write political social cultural economic history dry dusty tome lively biography city central come architecture perhaps author sentence discuss look today photograph war conclude building improve bomb kind criticism make wonder author still definitely want understand importance importance history world late century hop personal story pull history together find write pretty dry go way much detail art architecture amsterdam engage mix feeling first half rather disappointing describe better devote much time describe national politics wwi find single map annoy quality photograph general disappointing addition bibliography perhaps large unwieldy appear soar remarkable ability describe event precisely coherently description chaos numerous event perhaps best succinct also marvelous turn phrase example sighting continue decade frequency rival time give good history great city dislike author negative criticism post war architecture agree personal difference opinion well write research easy interesting person interested european history german history particular wonderful panorama life span late century review notwithstanding several friend bear raise ask borrow reading part take give legitimacy need disclosure page enough easily historically fascinating place earth character con come life detail simply able put even excite visit opportunity story truly acquire sense dimension colloquial sarcastic even slightly gossipy history write entertain urban history european capital become popular thing large disappoint track berlins troubled history early day prussia german dominance reform modern day renovation square never visit city hold allure well read get sense city clearly write bogged detail enough make year year update change cover social political aspect well want know develop first size seem huge infuse page wonderful sensory rich description help life city many different stage expert field provide amuse interest detail famous landmark area figure city turbulent history week plan trip german capital look in depth tour guide city get goosebump sometimes even see street sign name important figure city history read able recall impact person create atmosphere vibrant city modern favorite world", "genres": ["History", "WWII", "Politics", "WWI"], "summary": "In the political history of the past century, no city has played a more prominent-though often disastrous-role than Berlin. At the same time, Berlin has also been a dynamic center of artistic and intellectual innovation. If Paris was the \"Capital of the Nineteenth Century,\" Berlin was to become the signature city for the next hundred years.\r\n\r\nOnce a symbol of modernity, in the Thirties it became associated with injustice and the abuse of power. After 1945, it became the iconic City of the Cold War. Since the fall of the Wall, Berlin has again come to represent humanity's aspirations for a new beginning, tempered by caution deriving from the traumas of the recent past.\r\n\r\nDavid Clay Large's definitive history of Berlin is framed by the two German unifications of 1871 and 1990. Between these two events several themes run like a thread through the city's history: a persistent inferiority complex; a distrust among many ordinary Germans, and the national leadership of the \"unloved city's\" electric atmosphere, fast tempo, and tradition of unruliness; its status as a magnet for immigrants, artists, intellectuals, and the young; the opening up of social, economic, and ethnic divisions as sharp as the one created by the Wall.", "asin": "046502632X", "rank": "1083653", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51i8Q%2Bj5jWL.jpg", "country": "Germany", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}