{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 374, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Learning from the past is what we should all do and this provides a perspective that allows me to better understand what is going on today throughout the world."}, {"review_sentiment": 5.0, "review_text": "A thoroughly researched and well written book.  It covers a lot of ground in its 400 pages with good accounts of the various military engagements, including from the Ottoman point of view.  A  slightly  longer book, with  more about some of the political backgound to events in the region during the First World War might have been even more interesting, but this is not a criticism.  Rogan is admirably concise."}, {"review_sentiment": 5.0, "review_text": "Narrative history at its best.  As fun to read as the subject matter is heart rendering."}, {"review_sentiment": 5.0, "review_text": "I don't know why I bought a book on such an arcane matter, but it really good.  Sheds insight on the world today also..Try it."}, {"review_sentiment": 5.0, "review_text": "Outstanding historical treatment of an era, and place, unknown to most Americans. Very professional, but reads almost like a novel. I learned from every chapter. One of the most fascinating aspects of WWI."}, {"review_sentiment": 4.0, "review_text": "Good research, but too sympathetic toward Turks from the onset at Gallipoli (\"...the average Ottoman soldiers were incredibly tenacious and disciplined under even the most extreme conditions.\" p. 128). Only six generic maps in the beginning of the book, without forces involved, positions and movements. Just writings and writing including two Balkan wars. A despicable genocide of up to 1.5 million Armenians by Turks was not  condemned enough by Mr. Rogan. However, the author mentioned and cited from the book by G. Balakian: Armenian Golgotha presenting also the Armenian point of view.  The Turks still deny the facts of genocide committed and will not acknowledge their responsibility. There are no maps indicating fights against British and French throughout Mesopotamia, battles for Gaza including first two losses by Britain and, finally the win in the third, decisive battle, where the Ottomans run away from British and Anzac cavalry. The  famous role of T. E. Lawrence helping Faysal of Arabia  was documented as well as the liberation of Jerusalem by Gen. Allenby, battles and losses to Russia in Anatolia under Gen. Yudenitch;  all these battles need charts for clarifications! The Turkish provinces in eastern Anatolia were a gateway to Persia and Central Asia, where Russia and Britain  were hooked in an intense rivalry for predominant that came to be known as the GREAT GAME! ( p. 35).  Researching the book by P. Hopkirk \"the Great Game\", found a reference to the Fall of Ottomans, and decided to study this book as well.The Ottoman Empire was fortunate to come out of the Peace treaty after the war with more territory than deserved!"}, {"review_sentiment": 5.0, "review_text": "one of the best books about the ottomans"}, {"review_sentiment": 5.0, "review_text": "A must read.  Lots of history that's relavent"}, {"review_sentiment": 5.0, "review_text": "Well written and extremely informative."}, {"review_sentiment": 3.0, "review_text": "A fairly good history but the narrative tended to be a little tedious. Glad I read it."}]}, "authors": ["Eugene Rogan"], "isbn": "046502307X", "longitude": 28.9651646, "periods": ["1900s", "Recent Releases"], "title": "The Fall of the Ottomans: The Great War in the Middle East", "word_cloud": "learn past provide perspective allows better understand go today world thoroughly research well write cover lot ground page good account various military engagement include point view slightly longer political background event region even interest criticism admirably concise narrative history best fun subject matter heart render know buy arcane matter really good insight world today outstanding historical treatment era place unknown professional read almost learn chapter fascinating aspect wwi good research sympathetic onset average soldier incredibly tenacious discipline even extreme condition only generic map begin force involve position movement writing write include war despicable genocide condemn enough however author mention cite balakian present also armenian point view still deny fact genocide commit acknowledge responsibility map indicate fight british french battle include first loss finally win third decisive battle away british cavalry famous role help document well liberation battle loss battle need chart turkish province eastern gateway hook intense rivalry predominant come know find reference decide study fortunate territory deserve best ottoman history relevant well write extremely informative fairly good history narrative tend little tedious", "genres": ["History", "Politics", "WWI"], "summary": "In 1914 the Ottoman Empire was depleted of men and resources after years of war against Balkan nationalist and Italian forces. But in the aftermath of the assassination in Sarajevo, the powers of Europe were sliding inexorably toward war, and not even the Middle East could escape the vast and enduring consequences of one of the most destructive conflicts in human history. The Great War spelled the end of the Ottomans, unleashing powerful forces that would forever change the face of the Middle East.\r\n\r\nIn The Fall of the Ottomans, award-winning historian Eugene Rogan brings the First World War and its immediate aftermath in the Middle East to vivid life, uncovering the often ignored story of the region’s crucial role in the conflict. Bolstered by German money, arms, and military advisors, the Ottomans took on the Russian, British, and French forces, and tried to provoke Jihad against the Allies in their Muslim colonies. Unlike the static killing fields of the Western Front, the war in the Middle East was fast-moving and unpredictable, with the Turks inflicting decisive defeats on the Entente in Gallipoli, Mesopotamia, and Gaza before the tide of battle turned in the Allies’ favor. The great cities of Baghdad, Jerusalem, and, finally, Damascus fell to invading armies before the Ottomans agreed to an armistice in 1918.\r\n\r\nThe postwar settlement led to the partition of Ottoman lands between the victorious powers and laid the groundwork for the ongoing conflicts that continue to plague the modern Arab world. A sweeping narrative of battles and political intrigue from Gallipoli to Arabia, The Fall of the Ottomans is essential reading for anyone seeking to understand the Great War and the making of the modern Middle East.\r\n\r\n“Rogan offers an intricately worked but very readable account of a theocracy’s demise.” New York Times Editors' Choice", "asin": "046502307X", "rank": "53749", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51zDSrALTHL.jpg", "country": "Turkey", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}