{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 34, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent book! Well written with great (true) story line. Probes and accurately portrays Cuban personalities and culture. Read this book shortly after visiting Cuba and his deprecation was spot-on."}, {"review_sentiment": 5.0, "review_text": "Good information"}, {"review_sentiment": 5.0, "review_text": "Great!"}, {"review_sentiment": 4.0, "review_text": "Most interesting  book on Cuba so long after the revolution destroys a lot of canard with facts and data as well as personal contacts.  I just got back from first visit to Cuba and rigid is spot on."}, {"review_sentiment": 5.0, "review_text": "Superb story teller! Just back from Cuba! Nothing has changed since the book was written! More private restaurants and lodging!"}, {"review_sentiment": 4.0, "review_text": "A very good portrait of Cuban life in the Special Period."}, {"review_sentiment": 5.0, "review_text": "A good look at life in Cuba off the beaten path."}, {"review_sentiment": 5.0, "review_text": "It's been a long time since I've been so continuously engrossed throughout a book.  Perhaps because I've been a student of Russian culture for over 50 years I was especially attuned to what Miller had to put up with to travel around in a totalitarian state and get people to tell him the truth.  And the jokes were of the same tenor as Russian jokes!  Unlike some of the negative reviewers I considered Miller's style unobtrusively polished, a little like Paul Theroux.  Many other works on Cuba and Latin America were cited in the text and the book functions as an unofficial bibliography, motivating one to do further reading.  I intend to seek out the other books written by this author."}, {"review_sentiment": 3.0, "review_text": "This book was ok. It gave a nice glimpse of life inside Cuba in the 1990s and some interesting insights into Cuban culture. It wasn't really written in a compelling style and was sort of a pastiche of a travelogue. I came away not really caring much about any of the characters or the author himself."}, {"review_sentiment": 4.0, "review_text": "Thought provoking look at Cuba, the good, the bad and the ugly."}]}, "authors": ["Tom Miller"], "isbn": "0465005039", "longitude": -82.3658671, "periods": ["2000s"], "title": "Trading with the Enemy: A Yankee Travels Through Castro's Cuba", "word_cloud": "write great true story line accurately portray personality culture shortly visit deprecation good information great most interesting long revolution destroy lot canard fact data well personal contact get back first visit rigid spot story teller back change write private restaurant lodge good portrait life good look life beat path long time continuously engross perhaps student russian culture year especially attune put totalitarian state get people tell truth joke tenor russian joke negative reviewer consider style unobtrusively polish little work cite text function unofficial bibliography motivate reading intend seek write author ok give nice glimpse life interest insight culture really write compelling style sort pastiche travelogue come away really care much character author provoke look good bad ugly", "genres": ["Travel Writing", "Politics"], "summary": "“Havana knew me by my shoes,” begins Tom Miller’s lively and entertaining account of his sojourn for more than eight months traveling through Cuba, mixing with its literati and black marketers, its cane cutters and cigar rollers. Granted unprecedented access to travel throughout the country, the author presents us with a rare insight into one of the world’s only Communist countries. Its best-known personalities and ordinary citizens talk to him about the U.S. embargo and tell their favorite Fidel jokes as they stand in line for bread at the Socialism or Death Bakery. Miller provides a running commentary on Cuba’s food shortages, exotic sensuality, and baseball addiction as he follows the scents of Graham Greene, José Marti, Ernest Hemingway, and the Mambo Kings. The result of this informed and adventurous journey is a vibrant, rhythmic portrait of a land and people too long shielded from American eyes.", "asin": "0465005039", "rank": "432501", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51hRMuOKuDL.jpg", "country": "Cuba", "story_arc": ["Tragedy", "Things only get worse"]}