{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 11, "rating": 3.5, "reviews": [{"review_sentiment": 3.0, "review_text": "I appreciated learning about the history of the biological exploration of the Galapagos. I was saddened to hear about the great environmental destruction of the islands. I found the differing visions of the islands by Melville and Darwin fascinating. I am grateful I read this book. But-It seems to advertise itself for a good deal more. I expected from the subtitle a look at the interplay between religion and God, as expressed in the Galapagos. I expected from the jacket an intricate discussion of the endemic evolution of the islands. While these items were present, they were limited, and Larson spends a greater part of the book going over intricate details of who is supporting the island and who is not. Frankly, it becomes boring.So I recommend the book for skimming, but sadly can not recommend more."}, {"review_sentiment": 5.0, "review_text": "I found not only interesting the book but also very well organize and clearly written."}, {"review_sentiment": 3.0, "review_text": "The subtitle is slightly misleading: God and Science on the Galapogos. The subtitle was probably created to cater to the interest in religion vs. science but that topic was explored very little. It was more just the history of the Galapagos. If you're really interested in the history of that archipelago, then this book is exactly what you want. But for me, I really don't care about every person that ever went to visit that island.There are a few things I did take from the book. Currently, scientists are trying desperately to save the Galapagos' from humanity and preserve its uniqueness. The irony of it, is that the ecology-loving scientists are the ones that once encouraged the tourism of the islands that have lead to supposed ecological disaster there. They had some vision of a utopia where people would learn how precious the earth is and work to conserve it, but instead Ecuadorians have siezed the island for economic pipedreams, the residents not caring to preserve every species there to their expense."}, {"review_sentiment": 1.0, "review_text": "If you're looking for a book about the voyage of the Beagle and the development of Darwin's theories, this book is likely to disappoint. Written in an academic tone and with no sense of narrative, it's hard to believe the author won a Pulitzer Prize (different book). However, if you want to learn about buccaneers and the Galapagos Islands you will find more of the following: \"At the time, buccaneers held a shifting status somewhere between adventurers and thieves.\""}, {"review_sentiment": 4.0, "review_text": "Must reading for any Galapagos traveler or historian of science.  Starting with a contrast of Melville's description of Galapagos as a hell and Darwin's own explorations, Larson traces the history of the idea of evolution, both scientifically and on popular thought.  By focusing on the Galapagos, Larson provides a readable account of both how studies in the Galapagos shaped evolutionary thought (From Darwin to Lack to the Grants) but also how the social climate of the day, influenced the explorers, for example how the exuberance of Teddy Roosevelt, affected explorers of the day, or how Harvard zoologist Louis Agassiz influenced the California collecting spree.Larson also reflects on the effects of civilization on the Galapagos, from turtle collecting, to the World War II airstrip at Baltra, to current tensions between protection, locals, and harvest.  Science has not always been on the side of protection, for example, \"Save them for science\" became the cry (at the turn of the last century), even if it meant capturing or killing the last on in the wild.  The drawings and photographs complement the text, and include such treats as a photo of Louis Agassiz, sketches from Darwin, and a photo of 250 tortoise specimens in the California Academy of Sciences.  I would also recommend Weiner's \"The Beak of the Finch\", and Darwin's \"The Voyage of the Beagle\" has a chapter on the Galapagos.  Incidentally, the title of the book is probably derived from Darwin's own description of the Galapagos' volcanic hills and craters \"From their regular form, they gave the country a workshop appearance\"."}, {"review_sentiment": 4.0, "review_text": "The history of a science can teach you much about the process of science and scientific thinking.  Evolution marks the beginning of modern biological thought, and the Galapagos Islands played a major role in the development of evolutionary ideas.  Edward Larson shows us how the archipelago was differently perceived by so many people from Melville and Darwin in the mid-1800s to later visitors up until the present day.  While it would probably be confusing to learn about evolutionary theories from this book, Larson brings to light how some of those theories developed with respect to findings from the Galapagos.  By doing this, one shares in the same act of discovery that has so enchanted the various researchers who have come to the islands.  All the while, it is a wonderful read, and I highly recommend it those interested in a fascinating narrative about the history of evolution."}, {"review_sentiment": 5.0, "review_text": "Edward J. Larson's superbly presented Evolution's Workshop considers the Galapagos Islands, its history, and the nature of pre-evolutionary science on the islands. The history of top researchers' studies on the islands and their contribution to major scientific advancements makes for a specific type of history which goes beyond the usual examination of Darwinian theory alone."}, {"review_sentiment": 5.0, "review_text": "If you have never read an account that made sense of Darwin's discovery of evolution as the only plausible explanation of what he found at the Galapagos islands, this is your book.  The basic outlook with which he contended was Biblical literalism in a place we do not expect to find it.  After all, did Sir Francis Bacon not establish the criterion of empiricism in science?  In one crucial area, that of correctly naming all of nature's beings, he expected man to be able to name them all correctly, even as it had been in the Garden of Eden.  Surprisingly, in England, the 18th and much of the 19th century continued his bias, which arises from a familiar blind spot for much of the English-speaking world, the Puritan Revolution.According to Bacon, man would also recover his Eden-based knowledge of the use of every plant and animal, could he but name them all.  Since the Galapagos have no obviously useful animals, such as any quadruped mammals, the islands were considered not only worthless but almost evil.  It took some intervening factors, such as whaling in the area, to open it up.Probably, as Larson suggests, the thinking that went into his theoretical structure for \"Origin of Species\" overwhelmed any more detailed derivation of his theory from his Galapagos data, an accident of history that has always added difficulty.  Larson's ability to cover the gaps is the best I've seen. He also accepts the influence of Malthus on Darwin's formulation of the \"how\" of evolution in his theory's early development."}, {"review_sentiment": 5.0, "review_text": "Mr. Larson has written one of the most interesting books about evolution and the Galapagos that it has been my happy experience to read.  Although I have had the good fortune to visit the Galapagos and observe the animals and plants there, I had many missing segments in my understanding of how scientific thinking got from Charles Darwin to the work of the Grants that is so well displayed in The Beak of the Finch.  This volume creates a nice overview for anyone who wants to know more about how our current understanding of evolution occurred or how any important new paradigm develops.Most people would not have noticed what Darwin did when he visited the Galapagos in 1835 on The Beagle.  To make that point, Mr. Larson opens with many quotes from Melville's visit in 1841.  Melville hated the place.  \"But the special curse . . . is that change never comes.\"  Brief visitors often missed the dynamism of the environment because they only made brief stays.  Having been there in both the dry and the rainy seasons, I can assure you that the islands are totally different in those two times of the year.  And no two rainy seasons are all that similar.I was especially fascinated to see how much the economic usefulness of the islands affected how they were perceived.  These are mostly desert islands with little fresh water in the dry season, and few are going there primarily to farm.The book has several threads.  One looks at how perceptions of the islands have changed.  Now, most would agree that they are a world treasure.  Poor people from Ecuador are most eager to move there and develop their lives economically from fishing and serving the rapidly increasing numbers of eco-tourists.Another considers the impact that visits by man has had on the islands.  Extinction has been more man-made than environment-made in the last 166 years.  This has both been caused by farming, adding new species, and overusing the fragile resources there.A third dimension looks at the future of eco-tourism, and sees this as both a great risk and a potential saving grace from suffering the \"tragedy of the commons.\"A fourth dimension is how research methods have changed to allow us to better understand evolution.  As the Grants and others have shown, evolution occurs much more rapidly than Darwin ever imagined from the fossil records.  Part of this is due to interspecies breeding that was not appreciated until recently.  Also, environmental stress can cause sudden shifts in populations to favor the new conditions.  The Grants' work with Darwin's finches (ironically, Darwin was more interested in mockingbirds) shows that you can get evolution away from a beak standard and back again in just a few years on an island as the food supply changes.I came away especially impressed by the need to do longitudinal studies, to have accurate samples and measurement, and to have careful evaluation of the data.  Many errors cropped up in the thinking of both those who opposed the theory of evolution and those who developed it due to errors in one or more of these areas.The book is filled with a lot of subtle, dry humor.  When you see juxtaposed views and experiences (which is quite often), assume that you are being invited to have a good laugh.  The comparisons of Darwin and Melville in the beginning set that up for you.  Keep looking for this humor through to the observations about sexual selection operating with the fashion models in the end.Even if you can never visit the Galapagos, you should realize that there is an important message that they contain for us all:  Life can evolve in more peaceful and colorful ways even in a hostile environment.  The birds and animals there do not run from you.  The cacti do not have stickers to hurt you.  The sexual colorings of males are truly amazing.How can we create and live in environments on earth that will make the best home for all life?"}, {"review_sentiment": 5.0, "review_text": "When you think of the Galapagos Islands, you think of Darwin, his finches, and the Theory of Evolution.  That is, of course, as it should be; evolution is the overarching explanation of biology and although its evidence is all over, it is spectacularly shown in these equatorial and isolated islands.  The islands' connection to Darwin is a great story, but it is not the whole story of the Galapagos.  A successful attempt to tell the whole story is _Evolution's Workshop: God and Science on The Galapagos Islands_ (Basic Books) by Edward J. Larson.  If you are interested in evolution, or if you are going to join the growing numbers of tourists who are heading to the islands, this is a vital book.Darwin, visiting the islands as the naturalist on the _HMS Beagle_ in 1835, confirmed what his predecessors had seen: \"The country was compared to what we might image the cultivated parts of the Infernal regions to be.\"  That was the classic view of the Galapagos, which Darwin would rewrite.  He wrote in his private notes as he voyaged home, \"The zoology of the Archipelagoes will be well worth examining; for such facts would undermine the stability of species.\"  When he was reading Malthus on population and resources three years later, he hit on the mechanism by which speciation could occur.Larson tells the stories of the collectors who brought the specimens for academics to study, and how the specimens at first confirmed evolution, and then gave details about its mechanisms.  He shows how the philosophy of science has been changed by regarding the islands, were there is death, waste, and indifference.  Nonetheless, some biologists (most famously Agassiz) have seen nothing but confirmation of Genesis.Larson's entertaining and comprehensive book winds up with a summary of how the Galapagos fit into our current world.  The islands are prized as jewels of science, but for decades, popularization in books, film, and television have made them targets for eco-tourists or just tourists.  It can be shown that the increased tourism has had benefits to the species precariously placed on their little rocks, but the cost of bringing more of the inevitable outside rats, seeds, and insects may be high.  Already there are those who go to the Galapagos just for surfing tournaments, and insist on a nightlife, so Larson is not completely optimistic about how well preservation can survive.  He gives an amusing symbol of ambiguity towards the book's end, a supermodel posed for the 1998 swimsuit issue of _Sports Illustrated_, whose depicted bare leg had the superimposed text \"Charles Darwin's observations of animals here laid the foundation for his theory of evolution.\"  Larson jokes, \"Sexual selection apparently played a feature role in this version of the theory.\""}]}, "authors": ["Edward J. Larson"], "isbn": "0465038115", "longitude": 0.0, "periods": ["1800s"], "title": "Evolution's Workshop", "word_cloud": "appreciate learn history biological exploration sadden hear great environmental destruction island find differ vision island fascinate grateful seem advertise good deal expect subtitle look interplay religion express expect jacket intricate discussion endemic evolution island item present limit spends greater part go intricate detail support island become recommend skim sadly find interest also well clearly write subtitle slightly misleading subtitle probably create cater interest religion science topic explore little history really interested history archipelago exactly want really person ever go thing take currently scientist try desperately humanity preserve irony scientist one encourage tourism island lead suppose ecological disaster vision utopia people precious earth work conserve instead seize island economic pipe dreams resident care preserve specie expense look voyage development theory likely disappoint academic tone sense narrative hard believe author different however want learn buccaneer find follow time buccaneer hold shift status somewhere adventurers thief read traveler historian science start contrast description hell exploration trace history idea evolution scientifically popular think focus provide readable account study shape evolutionary thought also social climate day influence explorer example exuberance affect explorer day zoologist influence collect also reflect effect civilization turtle collect airstrip current tension protection local harvest always side protection example science become cry turn last century even mean capture kill last wild drawing photograph complement text include treat photo sketch photo tortoise specimens also chapter title probably derive description volcanic hill crater regular form give country appearance history science teach much process science scientific thinking evolution mark begin modern biological thought play major role development evolutionary idea show archipelago differently perceive many people later visitor present day probably confuse learn evolutionary theory bring light theory develop respect finding galapagos share act discovery enchant various researcher come island wonderful highly recommend interested fascinating narrative history evolution superbly present consider history nature science islands history top researcher study islands contribution major scientific advancement make specific type history go usual examination theory alone never account make sense discovery evolution plausible explanation find islands basic outlook contend liberalism place expect find criterion empiricism science crucial area correctly naming nature being expect man able name correctly even much century continue bias arises familiar spot much world man also knowledge use plant animal obviously useful animal quadruped mammal island consider worthless almost take intervene factor whale area open suggest think go theoretical structure overwhelm detailed derivation theory data accident history always add difficulty ability cover gap best see also accept influence formulation evolution theory early development write interesting evolution happy experience good fortune visit observe animal plant many miss segment understand scientific thinking get work well display volume create nice anyone want know current understanding evolution occur important new paradigm people visit point open many quote visit hat place special curse change never come brief visitor often miss dynamism environment make brief stay have dry rainy season assure island totally different time year rainy season especially fascinate much economic usefulness island affect perceived mostly desert island little fresh water dry season go primarily several thread look perception island change now world treasure people eager move develop live economically fishing serve rapidly increase number considers impact visit man islands last year cause farm add new specie overuse fragile resource third dimension look future see great risk potential save grace suffer tragedy common fourth dimension research method change allow better understand evolution others show evolution occur much rapidly ever imagine fossil record due inter species breed appreciate recently also environmental stress cause sudden shift population favor new condition work finches ironically interested mockingbird show get evolution away beak standard back year island food supply come away especially impressed need longitudinal study accurate sample measurement careful evaluation data many error crop think opposed theory evolution develop due error fill lot subtle dry humor see juxtapose view experience quite often assume invite good comparison begin set look humor observation sexual selection operate fashion model never visit important message contain evolve peaceful colorful way even hostile environment bird animal run cactus sticker hurt sexual coloring male truly create live environment earth make best home life think think finch course evolution overarch explanation biology evidence spectacularly show equatorial isolated islands island connection great story whole story successful attempt tell whole story interested evolution go join grow number tourist head island vital visit island naturalist confirm predecessor see country compare image cultivate part region classic view write private note voyage home zoology well examine fact stability specie read population resource year later hit mechanism speciation story collector bring specimen academic study specimen first confirm evolution give detail mechanism show philosophy science change regard island death waste indifference biologists famously see nothing confirmation entertain comprehensive wind summary fit current world island prize jewel science decade popularization film television make target tourists show increase tourism benefit species precariously place little rock cost bring inevitable outside rat seed insect surf tournament insist nightlife completely optimistic well preservation survive give amuse symbol ambiguity towards end supermodel pose swimsuit issue depict bare leg superimpose text observation animal lay foundation theory evolution joke sexual selection apparently play feature role version theory", "genres": ["History", "Science & Nature"], "summary": "More than any other place on Earth, the Galápagos Islands are the workshop of evolution. Isolated and desolate, they were largely overlooked by early explorers until Charles Darwin arrived there in the 1830's. It was Darwin who recognized that Galápagos' isolation and desolation were advantages: the paucity of species and lack of outside influences made the workings of natural selection crystal clear.\r\n\r\nSince then, every important advance and controversy in evolutionary thinking has had its reflection on the Galápagos. In every sense-intellectually, institutionally, and culturally-the history of science on these islands is a history of the way evolutionary science was done for the past 150 years.\r\n\r\nEvolution's Workshop tells the story of Darwin's explorations there; the fabulous Gilded Age expeditions, run from rich men's gigantic yachts, that featured rough-and-ready science during the day and black-tie dinners every night; the struggle for control of research on the Galápagos; the current efforts by \"creation scientists\" to use the Galápagos to undercut evolutionary teaching; and many other compelling stories.", "asin": "0465038115", "rank": "855273", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/51zjPdR-d%2BL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}