{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 25, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Informative and entertaining history that I wasn't aware of."}, {"review_sentiment": 5.0, "review_text": "A really fun book. This is actually humorous if it weren't so sad, and yet, yeah, it is still funny. A group of misfits, wannabe mercenaries and right wing extremists decide they are going to take over a tiny Caribbean island. (No, don't get all upset about me calling these guys \"right wing extremists.\" They were mostly culled from North American KKK and neo-Nazi groups. That's pretty extreme.)These guys were pretty dumb, sharing their plan with a numerous groups and individuals, including a mafia capo, a journalist, and some Las Vegas hotshots. Somehow they managed to keep it going until finally the authorities got on to them, and none too soon at that.The plan had the approval of an ex-prime minister of the small island and Rastafarian \"dreads\" (no fans of the KKK.)This is well-written and fast-paced. The misadventures of the folks involved in this are really the stuff of fiction, and yet the book goes to the source of the conspiracy for their recall of the planned coup. These guys are actually pretty interesting as individuals, and the author Bell goes behind the scenes for a look at the characters before and after the conspiracy."}, {"review_sentiment": 3.0, "review_text": "Men. Another Prime book that I read while on the treadmill, it really wasn't extremely captivating. I motored through it but it wasn't the mob fueled coup d'etat the summary would lead you to believe. Go at your own risk. More of a true crime novel."}, {"review_sentiment": 5.0, "review_text": "Great value delivered early"}, {"review_sentiment": 5.0, "review_text": "Well done explanation of a weird plot to take over Dominica by a bunch of nazi/KKK theives and con men."}, {"review_sentiment": 4.0, "review_text": "This is an interesting bite of history and something I knew very little about. I usually like to read about subjects that have taken a broader bow on the world stage, and most of the characters here are certainly bit players in a fairly minor incident, but the book did begin to open my eyes to some of the Caribbean political and international relations concerns that I had no previous knowledge about. It also put the US Invasion of Grenada in a different light than I had previously understood it.I think it would have been a better book if it had been organized differently. I would have suggested introducing the various characters involved in the plot toward the beginning of the book and then when action occurred it might have been easier to understand who was who. Nonetheless a very interesting read and for me, exposure to a kind of international intrigue that I had little idea existed."}, {"review_sentiment": 4.0, "review_text": "Intrresting, author must have taken the time to find the documentation and then study it to put this book together in a part of the world that does not have the facilties to keep these historical documents. There is several fact duplications in the book bit done well"}, {"review_sentiment": 5.0, "review_text": "I happened upon this book when I was browsing the internet.  I had not heard of this coup attempt and wanted to learn more.  The book is well-researched and well-written.The characters are reminiscent of those in Fargo.  I would recommend the book to anyone interested in modern history or a good read.  I am surprised the book was not a best seller."}, {"review_sentiment": 5.0, "review_text": "A worthwhile book for the time to it took to read and learn what ego and ignorance can come up with!"}, {"review_sentiment": 5.0, "review_text": "Wild story that is almost impossible to believe is true: Nazis, Canadian White Supremacists, Dreads, Communism, this book has it all.True story of a group of wannabe mercenaries that decide to take over Dominica and turn it into a place for their casinos, banking, drug making, etc.It's just a great fun read and that it hasn't been made into a movie tells you everything you need to know about why Hollywood is failing."}]}, "authors": ["Stewart Bell"], "isbn": "0470153822", "longitude": -90.0701156, "periods": ["1900s", "Recent Releases"], "title": "Bayou of Pigs: The True Story of an Audacious Plot to Turn a Tropical Island into a Criminal Paradise", "word_cloud": "informative entertain history aware really fun actually humorous sad yet yeah still group misfits wannabe mercenary right wing extremist decide go tiny get upset call guy right wing extremist mostly cull north american group pretty extreme guy pretty dumb share plan numerous group individual include mafia capo journalist hotshots manage go finally authority get none soon plan approval minister small dread fan misadventure folk involve really stuff fiction yet go source conspiracy recall plan coup guy actually pretty interesting individual author go scene look character conspiracy men treadmill really extremely captivate motor mob fuel coup summary risk crime value deliver early well do explanation weird bunch thief con men interesting bite history something know little usually like subject take broader bow world stage character certainly bite player fairly minor incident begin open eye political international relation concern previous knowledge also put different light previously understand think organize differently suggest introduce various character involve begin action occur understand interesting exposure kind international intrigue little idea exist interest author take time documentation study put together part world faculties historical document several fact duplication bite do well happen browse internet hear coup attempt want character reminiscent anyone interested modern history good surprise best seller worthwhile time take learn ego ignorance come almost impossible believe supremacists group wannabe mercenary decide place casino bank drug make great fun make movie tell everything need know fail", "genres": ["History", "True Crime"], "summary": "The story of how a criminal Shangri-La almost happened\r\n\r\nIn 1981, a small but heavily armed force of misfits from the United States and Canada set off on an unlikely mission: to invade the impoverished Caribbean island of Dominica, overthrow its government in a coup d'etat, and install a new bought-off prime minister. For two years, the gangleaders recruited manpower, wooed investors, forged links with the mob, stockpiled weapons, and planned their assault. They called it Operation Red Dog. They were going to make millions. All that stood in their way were two federal agents from Louisiana on the biggest case of their lives. Bayou of Pigs tells a remarkable story of foreign military intervention, revolutionary politics, greed, treachery, stupidity, deceit, and one of the most outlandish crimes ever attempted: the theft of a nation.", "asin": "0470153822", "rank": "1858881", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51YqukWASlL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}