{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 2154, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Fifty years later and I re-read this book.  I had to read this in high school, but I wasn't mature or studious enough to understand the significance, even though my grandparents were all immigrants.  The world of slaughterhouses hasn't changed much in the past 100 years, poverty, and children working to support their family.  Both of my parents had to quit school to support their families or starve. You knnw the old expression \"what goes around, comes around?\"  Those days look like they are coming around again."}, {"review_sentiment": 1.0, "review_text": "Only got to chapter 7.  Too depressing, disgusting and cruel- to the people and the animals. Not sure how this got on my wishlist. I just knew (without knowing) that something bad was going to happen to this sweet, innocent family. Could not continue, was giving me a sickening feeling."}, {"review_sentiment": 5.0, "review_text": "I got this book because i was forced to read it in school and didn't really remember it. I thought I would read a page and probably be done with it. But to my great surprise, I found it an amazing story from the horse's mouth. (Joke)  Anyway it you've never read it or even read a long time ago, it is well worth the read or re-read!"}, {"review_sentiment": 5.0, "review_text": "Good book with a shocking ending. Vould not wait to finish it. If you like cyber novels, you will love this one."}, {"review_sentiment": 1.0, "review_text": "Very small print. Not for children to read themselves. Not easy for grandmothers either. Should be noted somewhere in the description."}, {"review_sentiment": 5.0, "review_text": "Another great history book for  history buff.  The product was excellent and brand new."}, {"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 5.0, "review_text": "great paperback, nice printing"}, {"review_sentiment": 5.0, "review_text": "Very thought provoking!"}, {"review_sentiment": 5.0, "review_text": "BLACK BEAUTY.A inspiring book.this book told me how i should treat horses.also there is a great plot some places good some bad some owners good some bad.some good companios whi are sold or seperated or killed.and alot of adventures.a great taste of Old England and has literally changed my lifr"}]}, "authors": ["Upton Sinclair"], "isbn": "0486419231", "longitude": -87.6244212, "periods": ["1900s"], "title": "The Jungle", "word_cloud": "year later high school mature studious enough understand significance even grandparent immigrants world slaughterhouses change much year poverty child work support family parent quit school support family starve know old expression go around come day look come around only get chapter depress disgust people animal not sure get wish list know know something bad go happen sweet innocent family continue give sicken feeling get forced school really think probably do great surprise find amaze story horse mouth never even long time ago well worth good shock end wait finish cuber novel love very small print not child not easy grandmother note somewhere description great history history product excellent brand new great great paperback nice printing very thought provoking inspire told treat great plot place good bad owner good good companion whee sell separated a lot great taste literally change life", "genres": ["Fiction & Literature"], "summary": "An ardent activist, champion of political reform, novelist, and progressive journalist, Upton Sinclair is perhaps best known today for The Jungle — his devastating exposé of the meat-packing industry. \r\n\r\nA protest novel he privately published in 1906, the book was a shocking revelation of intolerable labor practices and unsanitary working conditions in the Chicago stockyards. It quickly became a bestseller, arousing public sentiment and resulting in such federal legislation as the Pure Food and Drug Act.\r\n\r\nThe brutally grim story of a Slavic family who emigrates to America, The Jungle tells of their rapid and inexorable descent into numbing poverty, moral degradation, and social and economic despair. Vulnerable and isolated, the family of Jurgis Rudkus struggles — unsuccessfully — to survive in an urban jungle.\r\n\r\nA powerful view of turn-of-the-century poverty, graft, and corruption, this fiercely realistic American classic is still required reading in many history and literature classes. It will continue to haunt readers long after they've finished the last page.", "asin": "0486419231", "rank": "8984", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51a%2B1QusHHL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}