{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 606, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent."}, {"review_sentiment": 5.0, "review_text": "I had never read an Edith Wharton novel.  She was able to make me feel that I knew what New York society was like in that time period.  I can't imagine having the talent to dream up so many details and conversations (which were a bit overwhelming at times).  It always held my attention, and the ending was perfect."}, {"review_sentiment": 3.0, "review_text": "The book is fine, but the e-book format is horrible - the words are pasted together, distracts from reading."}, {"review_sentiment": 4.0, "review_text": "Loved reading this.  The mannersand mores to the time were fun to read about and the story moved along for a fun read."}, {"review_sentiment": 5.0, "review_text": "Joanne Woodward is the perfect narrator (not just because she was the narrator in the film version). It's a beautiful rendition and perfectly suited to Wharton's prose."}, {"review_sentiment": 4.0, "review_text": "classic"}, {"review_sentiment": 1.0, "review_text": "Never finished it. Very boring."}, {"review_sentiment": 5.0, "review_text": "A masterpiece!"}, {"review_sentiment": 5.0, "review_text": "An outstanding book. A vivid description of 19th century NY society. A tragic story of Newland Archer"}, {"review_sentiment": 5.0, "review_text": "wonderful! Edith Wharton was given a Pulitzer for this novel."}]}, "authors": ["Edith Wharton"], "isbn": "0486298035", "longitude": 0.0, "periods": ["1900s"], "title": "The Age of Innocence", "word_cloud": "excellent never able make feel know society time period talent dream many detail conversation bit overwhelming time always hold attention end perfect fine format horrible word paste together distracts read love read manner sand more time fun story move fun perfect narrator narrator film version beautiful rendition perfectly suit prose classic never finish very boring masterpiece outstanding a vivid description century society tragic story wonderful give", "genres": ["Fiction & Literature"], "summary": "Edith Wharton (1862–1937) wrote carefully structured fiction that probed the psychological and social elements guiding the behavior of her characters. Her portrayals of upper-class New Yorkers were unrivaled. The Age of Innocence, for which Wharton won the Pulitzer Prize in 1920, is one of her most memorable novels.\r\n\r\nAt the heart of the story are three people whose entangled lives are deeply affected by the tyrannical and rigid requirements of high society. Newland Archer, a restrained young attorney, is engaged to the lovely May Welland but falls in love with May's beautiful and unconventional cousin, Countess Ellen Olenska. Despite his fear of a dull marriage to May, Archer goes through with the ceremony — persuaded by his own sense of honor, family, and societal pressures. He continues to see Ellen after the marriage, but his dreams of living a passionate life ultimately cease.\r\n\r\nThe novel's lucid and penetrating prose style, vivid characterization, and its rendering of the social history of an era have long made it a favorite with readers and critics alike.", "asin": "0486298035", "rank": "98508", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51-pvNep7bL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}