{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 235, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "have only just begun reading but so far it's a very satisfying read"}, {"review_sentiment": 5.0, "review_text": "Mann helped to add some eloquence to by life and desires.  Perhaps I understand myself better now and need not punish myself unduly for just for desires.  It's so nice to have a book that I can see myself in."}, {"review_sentiment": 5.0, "review_text": "Thomas Mann is rightly regarded as a master among writers.  In \"Death in Venice\" he explores a dying man's obsession with a beautiful youth at a beach hotel on the Lido Isle of Venice in prose so rich in descriptive imagery as to become poetry."}, {"review_sentiment": 5.0, "review_text": "great buy"}, {"review_sentiment": 2.0, "review_text": "Thomas Mann’s novella about an accomplished author and his efforts to deal with midlife writer’s block has a few noteworthy observations about art and life and the author uses symbolism and Greek mythology effectively, but this work is hindered by a weak plot and awkward translations.  One example of Mann’s thought-provoking observations involves the influence of the artist and concludes that “the trust the public places in us is highly ridiculous, education of the young through art something that should be forbidden. Because how can someone be a good teacher when he has an inborn drive towards the abyss?” My father, a highly respected high school and college teacher of art and art history disproves this conclusion.  In any case, if the novel contained more of these assertions, I might understand how it has attained a certain level of literary prominence, but there are three elements of this book that are difficult to understand:1. The protagonist’s infatuation and obsession with young Tadziu defies comprehension even though the author devotes most of the book to this endeavor.2. It is also difficult to understand how a novel about an esteemed author, which contains many reflections on his life and his art, contains only three brief sentences about his family.  There are not very many concise sentences in this novella, but the sentences about his family are three of them.3. From the perspective of this reviewer, it is incomprehensible that this author won the 1929 Nobel Prize in Literature."}, {"review_sentiment": 4.0, "review_text": "feel very good . good . she says it is very beautiful , fast shipping. It's a sharp and a very nice Chef product."}, {"review_sentiment": 5.0, "review_text": "I recently reread this for the first time in 40 years . . . . not all books I've revisit shout out that I had great taste in literature as an undergrad. Death in Venice is just so brilliant, I was left wondering what I could have understood so many years ago. Mann's language (at least as translated here) is among the best of any writer. The narrative is not what the novel is really about; rather like a great poet, Mann leads the reader through the back alleys that we've visited looking for what we imagined we need. Brilliant work."}, {"review_sentiment": 5.0, "review_text": "I loved it"}, {"review_sentiment": 2.0, "review_text": "I gave up after about a third of it"}, {"review_sentiment": 5.0, "review_text": "Like"}]}, "authors": ["Thomas Mann"], "isbn": "0486287149", "longitude": 12.3345898, "periods": ["1900s"], "title": "Death in Venice", "word_cloud": "begin read far satisfy help eloquence life desire perhaps understand better need punish unduly desire nice see rightly regard master writer explore die man obsession beautiful youth beach hotel prose rich descriptive imagery become poetry great buy novella accomplish author effort midlife writer block noteworthy observation art life author use symbolism mythology effectively work hinder weak plot translation example observations involve influence artist conclude trust public place highly ridiculous education young art something forbidden someone good teacher inborn drive towards aby father highly respect high school college art art history disprove conclusion case contain assertion attained certain level literary prominence element difficult protagonist infatuation obsession young defies comprehension even author devote also difficult understand esteem author contains many reflection life art contain brief sentence family many concise sentence novella sentence family perspective reviewer incomprehensible author good good say beautiful fast ship sharp nice product recently reread first time year revisit shout great taste literature undergrad brilliant leave wonder many year ago language least translate best writer narrative really rather great poet lead back alley visit look imagined need work love give third", "genres": ["Fiction & Literature", "LGBT"], "summary": "One of the most famous literary works of the 20th century, the novella \"Death in Venice\" embodies themes that preoccupied Thomas Mann (1875–1955) in much of his work; the duality of art and life, the presence of death and disintegration in the midst of existence, the connection between love and suffering, and the conflict between the artist and his inner self. \r\n\r\nMann's handling of these concerns in this story of a middle-aged German writer, torn by his passion for a Polish youth met on holiday in Venice, resulted in a work of great psychological intensity and tragic power. It is presented here in an excellent new translation with extensive commentary on many facets of the story.", "asin": "0486287149", "rank": "63743", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/61fgui8dDHL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}