{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 14, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "good reference"}, {"review_sentiment": 4.0, "review_text": "Great read if you are traveling to the Islands, otherwise a bit out of date."}, {"review_sentiment": 3.0, "review_text": "I am a Professor of biochemistry with a lifelong interest in evolution. In four weeks my wife and I head for a Galapagos trip so some reading was in order. I had already read the Origin of Species years ago so I began with Darwin's autobiography then the Voyage of the Beagle, Floreana by Margaret Wittmer and this Beebe book. Currently I am reading Peter Grant and Rosemary Grant's 40 Years of Evolution about the finches on Daphne Major (named Major by Beebe). This covers a spectrum of times and writing styles each with unique perspectives. Darwin is essential as the original scientific observer though he only visited four of the islands (Chatham or San Cristobal, Charles or Floreana, Albemarle or Isabela and James or Santiago) and mixed his specimens from the first two until he spoke with the Vice-Governor of the Islands Mr. Lawson about the tortoises. Mr Lawson said he could tell from which island any tortoise had been brought. This turned out to be an important remark not immediately recognized as such. Darwin allotted one chapter of twenty one to the Galapagos in The Voyage of the Beagle. Much of his writing concerned the geology of the places he visited. My chief reward from reading his Voyage account was his voice as an individual that came across in his writing.Floreana is the first person history of Margaret Wittmer, who came with her husband Heinz and her 13 year old stepson to settle on Floreana (Charles) in 1932. They were just dropped off on the beach at Post Office bay with their crates of supplies. There were only two other people living on the island Dr. Karl Friedrich Ritter and his lover Dore Strauch. Dr. Ritter was a vegetarian dentist who moved to the Island motivated by his personal philosophy to live a life unaffected by civilization. Both he and Dore had all their teeth removed before coming and they had one pair of dentures between them for emergencies as needed. Margaret and her husband lived a farming lifestyle and built a compound not unlike a Robinson Crusoe story, while interacting in some difficult ways with Ritter and Dore. The arrival of a third gun-toting woman (The Baronness) and her multiple lovers created chaos for a time, but she disappeared after a while. Her goal was to make a hotel for millionaires (Hacienda Paradiso) that did not ever get far. A movie has been made about this little group \"The Galapagos Affair: Satan Came to Eden,\" based on Dore Strauch's book. Lots of drama, maybe murder. Margaret Wittmer lived the whole of the rest of her life on the island from age 28 to 94 having two children with not much help. The Floreana story brings human reality to the islands. Hopes, ambitions, dangers, birth, death and perseverance all in the place that Darwin walked in 1835.The Galapagos are fairly small. Each island has very few beaches suitable for landing so the people who come and go over centuries make their footsteps in the same places and drink from the same wells. In fact the search for water is a universal problem that all who visited there had. Beebe's steam yacht Noma needed to refill with 40,000 gallons of fresh water in the dry season. They steamed around to three or four places to find water with no luck. Eventually they did find a small source that was not accessible for their boat so they used 150 feet of hose and a funnel to pour water down the hose to a waiting lifeboat. They almost swamped the lifeboat with 4000 gallons of water and ferried it out to the boat. At this point the Captain said enough and they headed back to Panama to resupply since they were in danger of running out of coal also.Beebe's book is written to satisfy his audience (mainly his funding audience). He worked in the 20s at the New York Zoo. There were no NSF grants to fund expeditions, so patrons must be found. Patrons with steam yachts and deep pockets and they must be satisfied with results. His writing style is along the lines of Marlin Perkins' Wild Kingdom. He depicts his exploits as exciting, involving personal risk and courage. The opening chapter in the Panama Canal is prime Indiana Jones screenwriting to impress the reader. Beebe goes out at night with guide wearing headlamps and wading through swampy riverbanks in hunt of the rare and elusive water opossum. In the process he and his assistant nearly step on and end up shooting a five foot long bushmaster snake that Beebe ties around his waist to take back. This is a poisonous pit viper. Michael Douglas killed one in the movie \"Romancing the Stone\" (Wikipedia).Once the Noma reaches the Galapagos there is less drama, but still first person accounts of struggling with nature, getting the clothes torn off by thorns, numerous descriptions of large sharks in the waters where they had to go to the collect desired specimens. There is certainly color in describing the yacht. All sorts of equipment are piled in the saloon that used to be used for rich socialites to cruise the seas in luxury. In fact, Beebe says one of these elegant rooms converted to science labs etc. was his bedroom on the trip.It is easy for me to criticize from the distance of 94 years, but I have to say I read Beebe's bio in Wikipedia and It is most impressive. Hew traveled around the world on another expedition to study pheasants. This resulted in a four volume book on the pheasants of the world that was considered on of the best scientific monographs of the century. He won many awards for this. He wrote a total of 24 books, including a second expedition to the Galapagos (The Arcturus Adventure, currently sitting on my coffee table). Maybe he is most remembered for his bathysphere dives, setting depth records and naming four species (without collecting the type specimen of course).  These species have not been seen since and they are in question as real species. But what do we really know about 3000 ft down off the coast of Bermuda?The World's End book is dated and the style is designed to sell. Not unlike similar books like \"Under a Lucky Star\" by Roy Chapman Andrews that tell the tale of expeditions to the Gobi Desert by another superstar museum curator. I cannot fault him for finding a successful formula to inspire new generous patrons. Along the way may interesting observations are given and the natural history of the islands is charmingly depicted. Ruth Rose, the historian on the trip gives a wonderful chapter called Man and the Galapagos covering the first possible human visit by the king of the Incas to pirates, whalers, penal colonies and scientific expeditions. Appendix B is a truly deep bibliography on the Galapagos from 1592 to 1922. Ruth Rose contributed to other Beebe books like the Arcturus Expedition.I give the book a modest rating, but it is not a waste of your time. There are some nuggets to uncover. I am planning to read the Arcturus Adventure and maybe Beneath Tropic Seas (about helmet diving in Port-au-Prince, Haiti). Then of course there is Half Mile Down (if I can only find a copy)David Nelson"}, {"review_sentiment": 4.0, "review_text": "A very interesting book."}, {"review_sentiment": 5.0, "review_text": "Beebe's quaint style and subtle humor made what was at times a very technical book quite enjoyable.  I learned so much about these fascinating islands and can't wait to see them for myself!"}, {"review_sentiment": 5.0, "review_text": "I read this book while engaged in my second trip to the Galapagos Islands, skipping among the chapters to match our own itinerary. I particularly enjoyed Beebe's keen observations of the behavior of individual animals, especially that of the various birds. I also liked his writing style and enthusiasm, which some readers disparage as too \"popular\" for an account of a scientific expedition. I detected no evidence for the view that he exaggerates; on the contrary, he often includes counts and other detailed specifics of what he is describing and never claims that these are universally applicable. Selected quotes from earlier writings add much interest. His idea of the islands' geological origins, probably the prevailing hypothesis at the time, is now considered obsolete. Not surprising, considering that the book was published in 1924, almost a century ago. Our scientific understanding has changed, and some conditions on the islands have changed as well. Read in that context, this book provides a fascinating perspective."}, {"review_sentiment": 5.0, "review_text": "great, great, great."}, {"review_sentiment": 5.0, "review_text": "Great book especially if going to the Galapagos. Written a  long time ago but still relevant and educational. Well written."}, {"review_sentiment": 5.0, "review_text": "The original edition (1924) has superb photos and hand drawn illustrations. These are of poor quality in the modern paperback. I had the paperback on the boat in the Galapagos and now have the original to peruse at home safe from seawater. A classic tale of enthusiastic scientists on a luxury yacht studying not only the animals but also history, plants and insects of the Galapagos in 1923. An inspirational book."}, {"review_sentiment": 5.0, "review_text": "It gives an informative history of the Galapagos which isn't available from most tour books.  Well-written and enjoyable to read."}]}, "authors": ["William Beebe"], "isbn": "0486256421", "longitude": 0.0, "periods": ["1900s"], "title": "Galapagos: World's End", "word_cloud": "good reference travel otherwise bit date biochemistry lifelong interest evolution week wife head trip read order already year ago begin autobiography read finches name cover spectrum time write style unique perspective essential original scientific observer visited island mix specimen first speak tortoises say tortoise brought turn important remark immediately recognize allot chapter twenty writing concerned geology place visit chief reward reading account voice individual come first person history come husband year old stepson drop bay crate supply people live island lover vegetarian dentist move motivate personal philosophy live life unaffected civilization teeth remove come pair dentures emergency need husband live farming lifestyle build compound story interact difficult way doe arrival third woman multiple lover create chaos time disappear goal make hotel millionaire ever get far movie make little group base strauss drama maybe murder live whole rest life island age child much help story bring human reality islands ambition danger birth death perseverance place walk fairly small island beach suitable land people come go century make footstep place drink well fact search water universal problem visit steam yacht need refill gallon fresh water dry season steam place find water luck find small source accessible boat use foot hose funnel pour water hose wait lifeboat almost swamp lifeboat gallon water ferry boat point say enough head resupply danger run coal write satisfy audience mainly fund audience work grant fund expedition patron steam yacht deep pocket satisfy result write style line depict exploit excite involve personal risk courage opening chapter prime screenwriting impress go night guide wear headlamp wad swampy riverbank hunt rare elusive water opossum process assistant nearly step shoot foot long bushmaster tie waist poisonous pit kill movie reach le drama still first person account struggle nature get clothes torn thorn numerous description large shark water go collect desire specimen certainly color describe sort equipment pile saloon use use rich socialite cruise sea luxury fact say elegant room convert science lab etc bedroom easy criticize distance year say impressive travel world expedition study pheasant result volume pheasant world consider best scientific monograph century many award write total include second expedition currently sit coffee table maybe remember bathysphere dive set depth record name specie collect type specimen course specie see question real specie really ft coast date style design sell not similar tale expedition superstar museum curator fault find successful formula inspire new generous patron way observation give natural history island charmingly depict historian trip give wonderful chapter call cover first possible human visit king pirate whaler penal colony scientific expedition truly deep bibliography contribute give modest rating waste time nugget uncover plan maybe helmet dive then course find copy interesting quaint style subtle humor make time technical quite enjoyable learn much fascinate island engage second trip skip chapter match itinerary particularly enjoy keen observation behavior individual animal especially various bird also like write style enthusiasm reader disparage popular account scientific expedition detect evidence view exaggerate contrary often include count detailed specific describe never claim universally applicable select quote earlier writing add much interest idea islands geological origin probably prevail hypothesis time consider obsolete not surprising consider publish almost century scientific understanding change condition island change well context provide fascinating perspective great great great especially go long time still relevant educational write original edition superb photo hand drawn illustration poor quality modern paperback paperback boat original peruse home safe seawater classic tale enthusiastic scientist luxury yacht study animal also history plant insects inspirational give informative history available tour enjoyable", "genres": ["History", "Travel Writing", "Science & Nature"], "summary": "The Galápagos Islands are famed for their remarkable wildlife, including land and marine iguanas, land tortoises, four-eyed fish, and flightless cormorants and albatross.\r\n\r\nIn 1835, Charles Darwin observed variations among the islands' species that inspired him to formulate the theory of natural selection.\r\n\r\nEighty-eight years later, in 1923, a scientific expedition sponsored by the New York Zoological Society followed in Darwin's wake. Led by renowned biologist and explorer William Beebe, the scientists visited the the islands to study and obtain specimens of indigenous plants and animals. This is Beebe's personal account of that fascinating expedition.\r\n\r\nCombining rare literary skill with careful research, Beebe produced an exceptionally readable volume, replete with youthful enthusiasm, a romantic's awe before the mysteries of nature, and a scientist's passion for accurate description. He recounts the expedition's enormously productive results, including specimens of 60 species previously unknown to science, and an unparalleled accumulation of data that stimulated many scientific papers and new avenues of naturalistic inquiry.\r\n\r\nBeebe's account is enhanced with more than 100 splendid illustrations, selected from hundreds of paintings, drawings, and photographs by expedition members. A classic of popular science, it is scientifically rigorous as well as exciting and accessible.\r\n\r\n\"Galápagos is a glorious book. It is high romance, exact science, fascinating history, wild adventure.\" The Nation", "asin": "0486256421", "rank": "427008", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/41dprLx9%2BRL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}