{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 21, "rating": 3.1, "reviews": [{"review_sentiment": 1.0, "review_text": "This book made absolute no sense to me. I could not see a beginning or end that gave me any sense for the life of Picasso. Unless you might be interested into a stream of thought, you will not get this book. I was extremely disappointed as it was assigned by our docent book club."}, {"review_sentiment": 5.0, "review_text": "A+++++++"}, {"review_sentiment": 2.0, "review_text": "Dead bug inside"}, {"review_sentiment": 1.0, "review_text": "Stein's writing does not speak to me."}, {"review_sentiment": 5.0, "review_text": "So, the singular view of an artist not of anybody else, alone in the studio will never be duplicated, copied or understood and is the truest lasting image."}, {"review_sentiment": 1.0, "review_text": "I am writing to say that I placed a digital order. The ebook was not delivered to my tablet and I can not find a way to contact anyone at Amazon!"}, {"review_sentiment": 5.0, "review_text": "It's a magnificent report on the life and works of a \"first class genius\", till the end of the '30s. An unforgettable classic in history of contemporary art. To be read together with Stein's \"Autobiography of Alice B. Toklas\"."}, {"review_sentiment": 3.0, "review_text": "It's not as good as i thought it would be in regards to Picasso's history but insightful for the Hypocrisy of Gertrude Stein; nonetheless it was a good read for Fans of Gertrude Stein. the reason i say the Hypocrisy because she acted as a friend to some and used her influence to further many Artist and sabotaged others based on her circle of influence. i goes thats a good lesson for any Artist out there."}, {"review_sentiment": 3.0, "review_text": "I wish the information were in more detail......That may change as I read further....Gertrude was a most interesting person and her tourbillon get- to-gathers were sometimes tops."}, {"review_sentiment": 1.0, "review_text": "I read this to the end just to be certain it was truly as awful as it seemed. Stein's writing here seems to be stream of conscience.Most of it is multiple run-on sentences without punctuation that you'd have to reread just to be certain the problem is the writing and not you as a reader. I enthusiastically threw this into the garbage once I got to the end of it. An absolute waste of time and money!"}]}, "authors": ["Gertrude Stein"], "isbn": "0486247155", "longitude": 2.3514992, "periods": ["1900s"], "title": "Picasso", "word_cloud": "make absolute sense begin give sense life interested stream think extremely disappoint assigned docent club dead bug write speak so singular view artist anybody else alone studio never duplicate copied understood truest lasting image write say place digital order book deliver tablet find way contact anyone magnificent report life work first class genius till unforgettable classic history contemporary art together good thought history insightful nonetheless good fan gertrude reason say act friend use influence many sabotage others base circle influence go thatch good lesson artist wish information detail interest person tourbillon sometimes top end certain truly awful seem write seem stream multiple sentence punctuation reread certain problem write enthusiastically throw garbage get end absolute waste time money", "genres": ["Memoir", "Essay", "Art & Architecture"], "summary": "For more than a generation, Gertrude Stein's Paris home at 27 rue de Fleurus was the center of a glittering coterie of artists and writers, one of whom was Pablo Picasso. In this intimate and revealing memoir, Stein tells us much about the great man (and herself) and offers many insights into the life and art of the 20th century's greatest painter.\r\n\r\nMixing biological fact with artistic and aesthetic comments, she limns a unique portrait of Picasso as a founder of Cubism, an intimate of Appollinaire, Max Jacob, Braque, Derain, and others, and a genius driven by a ceaseless quest to convey his vision of the 20th century. We learn, for example, of the importance of his native Spain in shaping Picasso's approach to art; of the influence of calligraphy and African sculpture; of his profound struggle to remain true to his own vision; of the overriding need to empty himself of the forms and ideas that welled up within him.\r\n\r\nStein's close relationship with Picasso furnishes her with a unique vantage point in composing this perceptive and provocative reminiscence. It will delight any admirer of Picasso or Gertrude Stein; it is indispensable to an understanding of modern art.", "asin": "0486247155", "rank": "496578", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51HrGUtEooL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}