{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 5205, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book"}, {"review_sentiment": 5.0, "review_text": "I love this book! I recommend it to everyone to read"}, {"review_sentiment": 5.0, "review_text": "Book came in perfect condtion. I am very pleased :)"}, {"review_sentiment": 2.0, "review_text": "Spoiler alert everyone dies and everyone lies. If you don’t know what happens, it can get interesting in the 2nd act."}, {"review_sentiment": 5.0, "review_text": "Arrived quickly and in great condition. This play is probably my favorite my Shakespeare. It is so relevant during the time we live in today."}, {"review_sentiment": 5.0, "review_text": "I am only twelve and even I got captured by the books beauty. It is delicate yet powerful and gorgeous beyond compare."}, {"review_sentiment": 4.0, "review_text": "A fascinating exploration of race, jealousy, insecurity and malice wrapped up in an inexorable march towards certain doom, where the only mystery is how it will happen and who will suffer what.  This play raises surprisingly modern, of the moment issues well worth considering in full with fellow readers whose judgement and analysis can help one grapple with one's own interpretation of this masterpiece."}, {"review_sentiment": 5.0, "review_text": "It is a much easier read with the help of the annotations. Will not make through the book without them."}, {"review_sentiment": 5.0, "review_text": ":)"}, {"review_sentiment": 5.0, "review_text": "Not only well introduced, but accompanied by substantial explanations, this Folger Library issue is a valuable and inexpensive choice. I could only wish the editors had included a reference to John McPhee's essay \"From Birnam Wood to Dunsinane\" in his collection \"Pieces of the Frame\"."}]}, "authors": ["William Shakespeare"], "isbn": "0486284921", "longitude": 12.3345898, "periods": ["1500s"], "title": "The Merchant of Venice", "word_cloud": "great love recommend everyone come perfect condition please alert everyone die everyone lie know happen interesting act quickly great condition play probably favorite relevant time live today twelve even get capture beauty delicate yet powerful gorgeous compare fascinating exploration race jealousy insecurity malice wrap inexorable march towards certain doom mystery suffer play raise surprisingly modern moment issue well consider full fellow reader judgment analysis help grapple interpretation masterpiece much easier help annotation make not well introduce accompany substantial explanation issue valuable inexpensive choice editor include reference essay collection piece", "genres": ["Drama"], "summary": "The Merchant of Venice is an intriguing drama of love, greed, and revenge. At its heart, the play contrasts the characters of the maddened and vengeful Shylock, a Venetian moneylender, with the gracious, level-headed Portia, a wealthy young woman besieged by suitors. At the play's climax, Shylock insists on the enforcement of a binding contract that will cost the life of the merchant Antonio — inciting Portia to mount a memorable defense.\r\n\r\nIn this richly plotted drama, Shylock, whom Shakespeare endowed with all of the depth and vitality of his greatest characters, is not alone in his villainy. In scene after scene, a large cast of ambitious and scheming characters demonstrates that honesty is a quality often strained where matters of love and money are concerned.\r\n\r\nThe gravity and suspense of the play's central plot, together with its romance, have made The Merchant of Venice a favorite of audiences, and one of the most studied and performed of Shakespeare's plays. ", "asin": "0486284921", "rank": "227060", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51ydWsvoLiL.jpg", "country": "Italy", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}