{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 2141, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 5.0, "review_text": "I never thought I would enjoy this classic; however after reading “Mr. Dicken’s and His Carol” I was inspired to read A Christmas Carol. I was pleasantly surprised. This book had a sense of adventure and was a reminder to me that everything we do in life leaves footprints. Our choices of today impact the the future. When given the choice, always choose to do everything in love."}, {"review_sentiment": 4.0, "review_text": "Such a classic tale. It's fun reading in the old English prose.Enjoyed the story very much. My second Dickens book."}, {"review_sentiment": 5.0, "review_text": "I read this book every year. It's a  classic and I love the sentiment. I try to remind everyone I can to give it a read this time of year."}, {"review_sentiment": 5.0, "review_text": "Good."}, {"review_sentiment": 5.0, "review_text": "Excellent."}, {"review_sentiment": 4.0, "review_text": "Dickens seems to understand and write about life, seen through the eyes of death better than most people. Put a proper perspective on Christmas and read this book every year before your holiday festivities."}, {"review_sentiment": 5.0, "review_text": "Beautiful."}, {"review_sentiment": 4.0, "review_text": "Dickens has an imaginative way with words, but Tim Currys narration of this piece was what stood out to me."}, {"review_sentiment": 5.0, "review_text": "I truly enjoyed this story."}]}, "authors": ["Charles Dickens"], "isbn": "0486268659", "longitude": -0.12574, "periods": ["1800s"], "title": "A Christmas Carol", "word_cloud": "great never think classic however read inspire pleasantly surprise sense adventure reminder everything life leave footprint choice today impact future give choice always choose everything love such classic tale fun read old story much second year classic love sentiment try everyone give time year good excellent dickens seem understand write life see eye death better people perspective year holiday festivity beautiful dickens imaginative way word narration piece stand truly enjoy story", "genres": ["Fiction & Literature"], "summary": "In October 1843, Charles Dickens ― heavily in debt and obligated to his publisher ― began work on a book to help supplement his family's meager income. That volume, A Christmas Carol, has long since become one of the most beloved stories in the English language. As much a part of the holiday season as holly, mistletoe, and evergreen wreaths, this perennial favorite continues to delight new readers and rekindle thoughts of charity and goodwill.\r\n\r\nWith its characters exhibiting many qualities ― as well as failures ― often ascribed to Dickens himself, the imaginative and entertaining tale relates Ebenezer Scrooge's eerie encounters with a series of spectral visitors. Journeying with them through Christmases past, present, and future, he is ultimately transformed from an arrogant, obstinate, and insensitive miser to a generous, warmhearted, and caring human being. \r\n\r\nWritten by one of England's greatest and most popular novelists, A Christmas Carol has come to epitomize the true meaning of Christmas.", "asin": "0486268659", "rank": "550", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51AIadKZ-6L.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}