{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 627, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "My impressions of The Turn of the Screw (only):Having read this many years ago, I decided to revisit it and found it just as trying a read as I remembered; although it has its rewards for the tenacious reader.As a self-confessed Grammar Nazi, I was surprised to find James' governess use the term \"literally\" more than once in what I believe is an incorrect manner (she says she \"literally slept at her post\" when she had not really fallen asleep.) I thought the misuse of this word was modern, as when someone says they \"literally lost their mind\" when they mean figuratively.There are also some obscure words (\"asseverate\") to add to your vocabulary. The edition I read (Wordsworth Classics that also contained The Aspen Papers) has notes in the back to explain references that were probably understood by readers in 1898.P.S. Although it contains a major spoiler, check out the satiric You Tube video in which Hitler rails against his staff as he asseverates his interpretation of the story."}, {"review_sentiment": 4.0, "review_text": "when the book arrived the pages felt so delicate almost as if the pages were about to fall out, but the story is great so it makes up for it (:"}, {"review_sentiment": 2.0, "review_text": "It was boring, but it was short and thought it would get better.  It had a very anti-climactic ending and an ending that left unanswered questions."}, {"review_sentiment": 1.0, "review_text": "I could do a review if I had the book to read it's in the lost and found somewhere."}, {"review_sentiment": 5.0, "review_text": "After watching the old movie \"The Heiress\" I read the book. I usually have read the book before seeing a movie. Anyway, the book is a good read and I enjoyed it."}, {"review_sentiment": 5.0, "review_text": "Boy am I glad I live in the 21 st centuryNever ever let a man control your destinyCatherine had such amazing will"}, {"review_sentiment": 2.0, "review_text": "I wanted to enjoy it. I just didn't. It was hard to follow. Not scary. And the ending was stupid. I wouldn't recommend."}, {"review_sentiment": 3.0, "review_text": "Did not hold my interest at all. I read this because it was a classic. Highly disappointed."}, {"review_sentiment": 1.0, "review_text": "This is a reasonable price products and structure is better than I thought, well enough to be as a gift to give to friends.  Works great! Really high quality and excellent value  Positively enchanting. Very highly recommended!  Good design in a pretty box.  Quality and efficiency are very good appearance  What a great buy"}, {"review_sentiment": 1.0, "review_text": "This is not a complete copy of the work. Instead it is a summary of the work itself. Important details are missing. Do not buy this copy."}]}, "authors": ["Henry James"], "isbn": "0486404315", "longitude": 0.0, "periods": ["1800s"], "title": "Washington Square", "word_cloud": "impression many year decide revisit find try remember reward tenacious surprise governess use term literally believe incorrect manner say literally slept post really fall asleep think misuse word modern someone say literally lose mind mean also obscure word asseverate add edition wordsworth classic also contain note back explain reference probably understand reader contains major spoiler check satiric tube video rail staff asseverate interpretation story arrive page felt delicate almost page fall story great make bore short thought better end end leave unanswered question lose find somewhere watch old movie usually see movie anyway good enjoy glad live st century never ever man destiny catherine amazing want enjoy hard follow not scary end stupid interest classic highly disappointed reasonable price product structure better think well enough gift friend great really high quality excellent value positively enchant highly recommend design pretty box efficiency good appearance great buy complete copy work instead summary work detail miss copy", "genres": ["Fiction & Literature"], "summary": "Set in New York City in the 1840s, this celebrated novel tells the story of Catherine Sloper, the docile and affectionate daughter of a well-to-do physician, who appears destined for a lifetime of spinsterhood with only the companionship of her sardonic father and fatuous aunt.\r\n\r\nWhen a flurry of attention from an attractive suitor causes the plain and unremarkable Catherine to fall deeply in love, the stage is set for a struggle of opposing wills between Catherine and her adored father. Dismayed by his prospective son-in-law's shallowness and lack of prospects, and strongly suspecting him of fortune-hunting, Dr. Sloper threatens Catherine with disinheritance and forces her into a choice between father and lover. As the tale unfolds, James explores, with acute psychological penetration and masterly storytelling skill, the moral consequences of the callous exploitation of trust and the ruthless manipulation of a tender heart.\r\n\r\nWhile this memorable story plays itself out in the vanished world of nineteenth-century New York, its underlying themes and moral concerns are timeless and universal. Students and other lovers of great literature will appreciate this inexpensive edition of one of the great American novels.", "asin": "0486404315", "rank": "568798", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51Al3zhmdAL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}