{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 43.7698712, "ratings": {"num_ratings": 38, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "The book was exactly as described, and in perfect condition."}, {"review_sentiment": 5.0, "review_text": "The book was exactly as described and definitely in English xD Also not expensive at all!! I will definitely buy my books from here again ♡"}, {"review_sentiment": 5.0, "review_text": "Wonderful book and it came so fast."}, {"review_sentiment": 5.0, "review_text": "I love this translation. An inspiring read for students of history and art. Another essential book for art students interested in Medieval art."}, {"review_sentiment": 5.0, "review_text": "Interesting history."}, {"review_sentiment": 5.0, "review_text": "Amazing book!"}, {"review_sentiment": 5.0, "review_text": "I absolutely love this little book. So charming. Lovely to connect with an author from the Renaissance."}, {"review_sentiment": 4.0, "review_text": "Very interesting insights into how art processes got to where they are. A bit hard to read with all the footnotes and archaic language and sentence structure, but worth the effort. A book for the more scholarly student of art or someone who just likes to know why."}, {"review_sentiment": 5.0, "review_text": "I bought this book for my wife who loves art and she enjoyed it and highly recommends it."}, {"review_sentiment": 5.0, "review_text": "If your an artist or art lover you'll enjoy reading how artists made brushes, paints and enhanced their craft many centuries ago."}]}, "authors": ["Cennino d'Andrea Cennini", "Jr. Daniel V. Thompson"], "isbn": "048620054X", "longitude": 11.2555757, "periods": ["500-1400s"], "title": "The Craftsman's Handbook:", "word_cloud": "exactly describe perfect condition exactly describe definitely english also expensive definitely buy wonderful come fast love translation inspiring student history art essential art student interested art interest history amaze absolutely love little so charm lovely connect author very interesting insight art process get bit hard footnote archaic language sentence structure worth effort scholarly student art someone like know buy wife love art enjoy highly recommends artist art lover enjoy read artist make brush paint enhance craft many century", "genres": ["Art & Architecture", "History", "Renaissance"], "summary": "This is D. V. Thompson's definitive English translation of Il Libro dell'Arte, an intriguing guide to methods of painting, written in fifteenth-century Florence. Embodying the secrets and techniques of the great masters, it served as an art student's introduction to the ways of his craft.\r\n\r\nAnyone who has ever looked at a medieval painting and marveled at the brilliance of color and quality of surface that have endured for 500 years should find this fascinating reading. It describes such lost arts as gilding stone, making mosaics of crushed eggshell, fashioning saints' diadems, coloring parchment, making goat glue, and regulating your life in the interests of decorum — which meant shunning women, the greatest cause of unsteady hands in artists. You are told how to make green drapery, black for monks' robes, trees and plants, oils, beards in fresco, and the proper proportions of a man's body. (\"I will not tell you about the irrational animals because you will never discover any system of proportion in them.\") So practical are the details that readers might be tempted to experiment with the methods given here for their own amusement and curiosity.\r\n\r\nToday artists are no longer interested in specific directions on keeping miniver tails from becoming moth-eaten. The Craftsman's Handbook, in which these are ordinary parts of the artist's work, appears quaint and naïve to us. And that is much of its charm. But when we remember the magnificent mosaics, paintings, and frescoes these methods produced, the book takes on an even greater value as a touchstone to another age.", "asin": "048620054X", "rank": "99908", "city": "Florence", "image": "https://images-na.ssl-images-amazon.com/images/I/61bQyOWAADL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}