{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 26, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I was so happy to find this book in print. It was a favorite of mine when I was a child. I got it out of the library several times. It is full of backwoods lore and rough camping instruction presented in story form. Who knew that you don't want to burn elm in a cookfire inside your tee-pee because it throws lots of sparks? Has instructions for building the tee-pee, too. I loved re-reading it as an adult but it is probably targeted to late elementary-school-aged and middle-school-aged children."}, {"review_sentiment": 5.0, "review_text": "The book is different than my normal reading. However, I  did enjoy it immensely. Excellent read for a 12  to 15 year old boy."}, {"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 5.0, "review_text": "I read this book as an adolescent and find it as rewarding to read again now as I found it then. Seton had a wonderful knowledge of woodcraft, natural history and Indian culture even if it was limited by early 20th century values."}, {"review_sentiment": 5.0, "review_text": "Great book fun and informative !!!"}, {"review_sentiment": 5.0, "review_text": "This is one of my favorite childhood books that I want to read again."}, {"review_sentiment": 5.0, "review_text": "My first copy of this book belonged to my Grandfather. He was born March 19, 1900 and bought the book when he was about 14. I was born in 1948 and the first time I read this book was when I was about eight or nine. I learned a lot about woodcraft and basic survival from this book and I have used this knowledge throughout my life. I bought this book so I could have it available to read to my two grandsons (present ages two and three) as soon as they can process the stories and practice the crafts. This is one of the finest books ever written for any youth with a love of the outdoors."}, {"review_sentiment": 5.0, "review_text": "ETS put together the most beautiful literature ever and this is the best of his work. Magical. I first read this book 58 years ago when I was nine and have re-read it many times. Give to your kid and then take him/her to the woods. Better than any electronic device anywhere."}, {"review_sentiment": 5.0, "review_text": "This is a lovely boy's coming of age type tale but appeals to girls (I've loved it since my own girlhood).  It is packed with woodcraft and even some Indian lore.  This was a first edition copy that has all of the original drawings - some later versions don't have these illustrations and they are a key part of the charm of this book.  My grandfather read this to my dad as a boy. My dad read it to my brother and me when we were kids.  I started reading it to my son this summer (we need to get back to it - other things intervened and, as mine is an antique copy as well, it went back into a covered book shelf).  I purchased this copy for my brother to share with my niece.  It was in pretty nice shape for an over 100 year old book and I was thrilled to find a first edition with all the wonderful drawings!  I was always told by my dad that this was a precursor to the first Boy Scout Handbook (that Seton and Baden-Powell were friends).  I know that, though my understanding in reading it as an adult is different from when I was a chid (I have a keener appreciation of the unpleasant home life the protagonist experienced early on, and more of an understanding of the history of the time and appreciate new insights when reading it anew), I still love the wood lore, and drawings and the tale itself.  As a girl I practiced walking placing my toes carefully as the Indians did, to walk silently, and have, ever since my childhood reading of this, checked the mud banks to see what critters have left their \"calling cards\".  It is \"dated\", in as much as a modern child may need some explanation of outmoded forms of transportation and household appliances or practices, and may seem very harsh at times (it was) in treatment of children but would be a good one to read with a child and discuss.  There is a strong sense of justice/injustice in the protagonist and he learns much from the various situations he faces and evaluates how he wished he'd handled them differently.  I think there's good room for discussion.  It is a little slow to start but grows more interesting as the protagonist (Yan) leaves the city and starts to live out his wood crafting (making a teepee, learning to hunt/trap, study flora and fauna).  It has had a lasting influence on me and I hope my son and niece can enjoy it as I have."}, {"review_sentiment": 3.0, "review_text": "Yeah...Lots of historical info and writing here by a man who was very instrumental in the Boy Scouts. I picked this up for the pen/ink renderings of the time when this book came out...Those too hold a fascination in part as the process of printing of the book back in early 1900's. This is tucked away in my library with other books regarding archery also...not one to keep at the bedside to read before I turn in."}]}, "authors": ["Ernest Thompson Seton"], "isbn": "0486209857", "longitude": -79.387207, "periods": ["1900s"], "title": "Two Little Savages", "word_cloud": "happy find print favorite mine child get library several time full backwoods lore rough camp instruction present story form know want burn elm cook fire throw lot spark instruction building love adult probably target late child different normal reading however enjoy immensely excellent year old boy great adolescent rewarding find wonderful knowledge woodcraft natural history indian culture even limit early century value fun informative favorite childhood want first copy belong bear buy bear first time learn lot woodcraft basic survival use knowledge life buy available grandson present age soon process story practice craft finest ever write youth love outdoors put together beautiful literature ever best work first year ago many time give kid take wood electronic device anywhere lovely boy come age type tale appeal girls love girlhood pack woodcraft even indian lore first edition copy original drawing later version illustration key part charm grandfather dad dad brother kid start read son summer need back thing intervene mine antique copy well go back cover shelf purchase copy brother share pretty nice shape year old thrill find first edition wonderful drawing always tell dad precursor first friends know understanding read adult different kid keener appreciation unpleasant home life protagonist experience early understanding history time appreciate new insight read anew still wood lore drawing tale girl practice walk placing toe carefully walk silently ever childhood reading check mud bank see critter leave call card date much modern child explanation outmode form transportation household appliance practice harsh time treatment child child discus strong sense protagonist learn much various situation face evaluates wish handle differently think good room discussion slow start grow interesting protagonist leave city start live wood craft make tepee learning study flora fauna last influence hope son niece enjoy historical info write man instrumental pick rendering time come hold fascination part process print back early tuck library regard archery also keep bedside turn", "genres": ["Fiction & Literature", "Young Adult"], "summary": "This is one of the great classics of nature and boyhood by one of America's foremost nature experts. It presents a vast range of woodlore in the most palatable of forms, a genuinely delightful story. It will provide many hours of good reading for any child who likes the out-of-doors, and will teach him or her many interesting facts of nature, as well as a number of practical skills. It will be sure to awaken an interest in the outdoor world in any youngster who has not yet discovered the fascination of nature.\r\n\r\nThe story concerns two farm boys who build a teepee in the woods and persuade the grownups to let them live in it for a month. During that time they learn to prepare their own food, build a fire without matches, use an axe expertly, make a bed out of boughs; they learn how to \"smudge\" mosquitoes, how to get clear water from a muddy pond, how to build a dam, how to know the stars, how to find their way when they get lost; how to tell the direction of the wind, blaze a trail, distinguish animal tracks, protect themselves from wild animals; how to use Indian signals, make moccasins, bows and arrows, Indian drums and war bonnets; how to know the trees and plants, and how to make dyes from plants and herbs. They learn all about the habits of various birds and animals, how they get their food, who their enemies are and how they protect themselves from them.\r\n\r\nMost of this information is not generally available in books, and could be gained otherwise only by years of life and experience in suitable surroundings. Yet Mr. Thompson Seton explains it so vividly and fully, with so many clear, marginal illustrations through the book, that the reader will finish \"Two Little Savages\" with an enviable knowledge of trees, plants, wild-life, woodlore, Indian crafts and arts, and survival information for the wilds. All of this is presented through a lively narrative that has as its heroes two real boys, typically curious about everything in the world around them, eager to outdo each other in every kind of endeavor. The exciting adventures that befall them during their stay in the woods are just the sort of thing that will keep a young reader enthralled and will stimulate his or her imagination at every turn.", "asin": "0486209857", "rank": "434815", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/5130eCLBPhL.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}