{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 21.161829, "ratings": {"num_ratings": 49, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Interesting book"}, {"review_sentiment": 4.0, "review_text": "A thin book, just a little over 200 pages.  However, it is packed with information on the various deities of Aztec and Mayan Religion."}, {"review_sentiment": 5.0, "review_text": "Wow! What a spectacular book. This book is a must if your interested in the mythology of the Aztecs, Mayans or other Mesoamericancivilizations. It is profusely illustrated with black & white line drawings and photographs and  is written in an easy to understand text that covers just about everything you could possibly ever want to know. I have learned a great deal from perusing this book and you will, too.This certainly is a book to add to you library."}, {"review_sentiment": 5.0, "review_text": "This is a great book for anyone wanting to understand the Mayan culture. It has many great illustrations as well as understandable descriptions. You don't have to be a student or professor to be able to understand the writing!It was also delivered on time and the book was in wonderful condition!"}, {"review_sentiment": 5.0, "review_text": "still reading it but I am learning a great deal"}, {"review_sentiment": 5.0, "review_text": "Beautiful book - I love it!"}, {"review_sentiment": 5.0, "review_text": "Excellent book"}, {"review_sentiment": 5.0, "review_text": "Beautiful, well written well researched and well illustrated book on major Meso-American pre-Contact deities and paradigms. I recommend a copy of 'Burning Water\" or \"A Scattering of Jades\" for some Aztec poetry."}, {"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 5.0, "review_text": "A very clear book which helps me to be familiar with Maya culture easily. :)"}]}, "authors": ["Mary Ellen Miller", "Karl Taube"], "isbn": "0500279284", "longitude": -86.82505, "periods": ["Pre Common Era"], "title": "An Illustrated Dictionary of the Gods and Symbols of Ancient Mexico and the Maya", "word_cloud": "interest thin little page however pack information various deity aztec spectacular interested mythology profusely black white line drawing photograph write easy understand text cover everything possibly ever want know learn great deal peruse certainly add library great anyone want understand mayan culture many great illustration well understandable description student professor able understand write also deliver time wonderful condition still read learn great deal love excellent well write well research well major deity paradigms recommend copy poetry great clear help familiar culture easily", "genres": ["History", "Ancient Civilizations"], "summary": "The myths and beliefs of the great pre-Columbian civilizations of Mesoamerica have baffled and fascinated outsiders ever since the Spanish Conquest. Yet, until now, no single-volume introduction has existed to act as a guide to this labyrinthine symbolic world.\r\n\r\nThe Gods and Symbols of Ancient Mexico and the Maya is the first-ever English-language dictionary of Mesoamerican mythology and religion. Nearly 300 entries, from accession to yoke, describe the main gods and symbols of the Olmecs, Zapotecs, Maya, Teotihuacanos, Mixtecs, Toltecs, and Aztecs. Topics range from jaguar and jester gods to reptile eye and rubber, from creation accounts and sacred places to ritual practices such as bloodletting, confession, dance, and pilgrimage. In addition, two introductory essays provide succinct accounts of Mesoamerican history and religion, while a substantial bibliographical survey directs the reader to original sources and recent discussions. Dictionary entries are illustrated with photographs and specially commissioned line drawings. Mary Miller and Karl Taube draw on their research in the fast-changing field of Maya studies, and on the latest Mexican discoveries, to produce an authoritative work that will serve as a standard reference for students, scholars, and travelers. Photographs and illustrations throughout", "asin": "0500279284", "rank": "98119", "city": "Cancun", "image": "https://images-na.ssl-images-amazon.com/images/I/51SmuYn6R0L.jpg", "country": "Mexico", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}