{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 13, "rating": 4.4, "reviews": [{"review_sentiment": 1.0, "review_text": "The photos were all good quality but the theme of the book made me depressed. Lots of poverty and sad pictures. I wanted more of the famous sites and less pigeons."}, {"review_sentiment": 5.0, "review_text": "More than a book of photographs. It's social commentary that speaks to the spirit of the city in the 50's and 60's. Great book."}, {"review_sentiment": 5.0, "review_text": "An excellent book of an era bygone!  Highly recommended"}, {"review_sentiment": 5.0, "review_text": "Cover has an incredible picture"}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 5.0, "review_text": "Ara Guler - simply the best photographer of \"old\" Istanbul - this book captures a city long since changed.  Highly recommended."}, {"review_sentiment": 5.0, "review_text": "A venerable, much celebrated Turkish photographer, Ara Guler is to Istanbul what Henri Cartier-Bresson was to Paris. His older photos in particular, from the 1950's and 60's capture a long gone Istanbul in its decay, pollution and poverty amid its ancient splendor and with its population intimately portrayed going about their business, young and old, poor and rich. It is a classic for those who care about the subject. Orhan Pamuk's introduction is in keeping with his prior writings, again, for those who care."}, {"review_sentiment": 5.0, "review_text": "moody, evocative photos of a mysterious city."}, {"review_sentiment": 5.0, "review_text": "This book takes me back to my first visit to Istanbul in 1972. I've been all over the world, and the old Istanbul was one of the most totally \"Atmospheric\" cities I've ever been to."}, {"review_sentiment": 5.0, "review_text": "Guler, though perhaps not well known in the US, deserves in my opinion to be ranked with Cartier-Bresson and, in an earlier time, Atget. He is one of those rare photographers whose perception unifies a strong sense of city as place, a feel for architecture and pattern, and a loving sensitivity to people, their body language and, especially, their faces. To browse through this well-printed book is to experience Istanbul at a unique point in history in the company of a sensitive and perceptive friend.If you read and enjoyed Orhan Pamuk's \"Istanbul\" but wished the photos had been larger, this book is the answer. If you enjoy seeing black and white photography capture the spirit of a place, here is a wonderful example."}]}, "authors": ["Orhan Pamuk", "Ara Guler"], "isbn": "0500543860", "longitude": 28.9651646, "periods": ["1900s"], "title": "Ara Guler's Istanbul: 40 Years of Photographs", "word_cloud": "photo good quality theme make depressed poverty sad picture want famous site le pigeon more social commentary speaks spirit city excellent era bygone recommend incredible picture great simply best photographer old capture city long change recommend venerable much celebrate turkish photographer older photo particular capture long go decay pollution poverty ancient splendor population intimately portray go business young old poor rich classic care subject introduction keep prior writing care moody evocative photo mysterious city take back first visit world old totally atmospheric city ever perhaps well know deserve opinion rank earlier time rare photographer perception unify strong sense city place feel architecture pattern love sensitivity people body language especially face experience unique point history company sensitive perceptive enjoy wish photo larger answer enjoy see black white photography capture spirit place wonderful example", "genres": ["Art & Architecture", "History"], "summary": "This book is a vivid photographic record of daily life in Istanbul from the 1940s to the 1980s. Captured through the unerring lens of the award winning Ara Guler, the Eye of Istanbul, it reflects the city's melancholy aesthetic as it oscillates between tradition and modernity. Gulers remarkable duotone photographs are accompanied by evocative commentaries from Orhan Pamuk, another leading figure in Turkish culture. Both writer and photographer each held in their youth the ambition of becoming a painter. Here, each in his own way paints a brushless picture of his hometown and captures, through image and word, its very soul.", "asin": "0500543860", "rank": "392555", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51uR1aPTouL.jpg", "country": "Turkey", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}