{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 53, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "Not what I expected. A strange collection of places and things in SF."}, {"review_sentiment": 1.0, "review_text": "I had to read this for a class, and it was hard for me to follow.  Some of my fellow students really loved it, while others of us just couldn't get into it.  I think you will either totally love this book or ...not...  I think it helps if you live or have lived in San Francisco.  Then the places mean more to you."}, {"review_sentiment": 5.0, "review_text": "Nice book!"}, {"review_sentiment": 4.0, "review_text": "for my grandsons fMILY"}, {"review_sentiment": 5.0, "review_text": "Anyone who loves the city needs to have one!"}, {"review_sentiment": 5.0, "review_text": "The format of this book is great! It reveals elements of San Francisco that I would not have learned about without Rebecca Solnit's in depth research and refreshing attitude."}, {"review_sentiment": 5.0, "review_text": "Quite a book and I didn't expect it to be so detailed."}, {"review_sentiment": 5.0, "review_text": "I read everything by Solnit that I can.  I've planned my last two trips to SF using her book as a way to find parts of the city I knew nothing about.  Thanks to RS, we took a trip up to the Lava Beds and learned much about the longer and deeper history of this part of California."}, {"review_sentiment": 4.0, "review_text": "I love the maps of special parts of San Francisco made for long walks through the city according to one's urban curiosity."}, {"review_sentiment": 5.0, "review_text": "Given as a gift to folks moving to SF"}]}, "authors": ["Rebecca Solnit"], "isbn": "0520262506", "longitude": -122.4192363, "periods": ["1800s", "1900s", "2000s", "Recent Releases"], "title": "Infinite City: A San Francisco Atlas", "word_cloud": "not expect strange collection place thing class hard follow fellow student really love others think totally love think help live live then place mean nice grandson fmily anyone love city need format great reveal element learn depth research refresh attitude quite expect detailed everything plan last trip use way find part city know nothing take trip learn much longer deeper history part love map special part make long walk city accord urban curiosity give gift folk move", "genres": ["History", "Urbanism"], "summary": "What makes a place? Infinite City, Rebecca Solnit’s brilliant reinvention of the traditional atlas, searches out the answer by examining the many layers of meaning in one place, the San Francisco Bay Area. Aided by artists, writers, cartographers, and twenty-two gorgeous color maps, each of which illuminates the city and its surroundings as experienced by different inhabitants, Solnit takes us on a tour that will forever change the way we think about place. \r\n\r\nShe explores the area thematically—connecting, for example, Eadweard Muybridge’s foundation of motion-picture technology with Alfred Hitchcock’s filming of Vertigo. Across an urban grid of just seven by seven miles, she finds seemingly unlimited landmarks and treasures—butterfly habitats, queer sites, murders, World War II shipyards, blues clubs, Zen Buddhist centers. \r\n\r\nShe roams the political terrain, both progressive and conservative, and details the cultural geographies of the Mission District, the culture wars of the Fillmore, the South of Market world being devoured by redevelopment, and much, much more. \r\n\r\nBreathtakingly original, this atlas of the imagination invites us to search out the layers of San Francisco that carry meaning for us—or to discover our own infinite city, be it Cleveland, Toulouse, or Shanghai.\r\n\r\nCONTRIBUTORS:\r\n\r\nCartographers: Ben Pease and Shizue Seigel\r\n\r\nDesigner: Lia Tjandra\r\n\r\n“Inventive and affectionate.” New York Times ", "asin": "0520262506", "rank": "45266", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/41Muq7rbTML.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}