{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 9, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I haven't had the brainspace to read a book fully, in an engaged way, for years. Something about this title and cover spoke to me - his writing is crisp & deep, and within a few pages, I'd seen elegant insights of the type I haven't seen for years - proper, deeply thought-out, satisfying writing.  It depends where you are in your life and what you need - I happen to adore the quiter, more private sides of LA that feel odd and undiscovered - but this book gave me a lot."}, {"review_sentiment": 4.0, "review_text": "Very quick read full of provocations. It was not about what i thought it was going to be about... something more akin to Cool Gray something about San Francisco and the walks the author took in each of the 49 square miles."}, {"review_sentiment": 3.0, "review_text": "This book is long, sprawling and disorganized, not unlike its subject.  There are isolated glimmers of interest, again similar in ways to Los Angeles."}, {"review_sentiment": 5.0, "review_text": "This is as the best piece of writing about Los Angeles I've read since Joan Didion. It works as a reflection on a city and as a companion to anyone who likes - not so much the hiking that is so fashionable - but real side-walk trekking."}, {"review_sentiment": 5.0, "review_text": "This is a fantastic read, a must for any Angeleno. I work at a bookstore in Los Angeles and made it my staff pick!"}, {"review_sentiment": 5.0, "review_text": "Thank you, for quick shipment! Very interesting book, great read."}, {"review_sentiment": 4.0, "review_text": "I liked this book.This book is basically a rumination of one transplant from NY to LA who has lived there for, what I'm guessing, is about 10-20 years. He is someone that used to take public transportation, walk a lot, and he was trying to apply the same mindset and walking options in LA. I can totally relate. I spent some time in LA myself, although a whole lot more recently, and I too was taking public transportation and walking in a car city, and I felt that he was really on point about many things. You really have a different, more direct interaction with the CITY when you're walking then when you're driving. I agree that the city has this mish mosh of OLD and NEW together at the same time, of PUBLIC and PRIVATE together at the same time, and REAL and FAKE at the same time, Indoor/ outdoor space at the same time, etc., the list goes on. Those are EXACTLY some of the same things I noticed in LA that other cities, like NY don't really have. And I love how those opposite worlds collide, I agree with the author, they make the city WHAT it is and make it great.He used a lot of movies, music, and cultural references in his writing, all of which I felt were very relevant. He also used a LOT of quotes, esp early on in the book, and I thought those were kind of annoying and didn't really connect well. I thought that he repeated himself a lot, which I wasn't totally against, but a little more diversity in his example and thoughts would have been nice. Although I suppose if you ARE ruminating, you DO repeat a lot and analyze the SAME thing from MANY ANGLES which is exactly what he did here. I enjoyed learning a lot of the facts about the city I didn't know. Like I didn't know LACMA didn't originally have an entrance on Wilshire. Having lived so close to there and passing it every day, that blows my mind. Also didn't know a lot of the history of the city, which I was happy to learn about.Overall, I liked this book. Warning to the new reader - it reads more like a highly analytical, diary with history and media thrown in then a guide book to LA and famous places. And I LIKED THIS TOO, I know all about the famous touristy places, been there done that. But it's the more LOCAL aspect that I enjoyed. As he described the streets he walked I could relate because I remember walking them too, and seeing those neighborhoods as well. It's all about the LOCAL aspect. The everyday. The growth of a city. And the continuing interchange between old and new. It was really nice to see his perspective."}, {"review_sentiment": 5.0, "review_text": "If you would like to learn about L.A.'s past, present and future, read Sidewalking. It is a smart, short personal take by a former New Yorker who truly knows Los Angeles and literally walks you through it."}, {"review_sentiment": 5.0, "review_text": "What a beauty this book is! A meditation about walking the sidewalks of a city known for drivers and highways and traffic jams. And more so, a meditation about slowing down to notice our relationship with where we live, how our identities and memories are interwoven with the physical space we share with others. Sidewalking feels in some ways like a companion piece to Joan Didion's Slouching Towards Bethlehem. Essays that give you a complex look at California and beg you to engage more in the world."}]}, "authors": ["David L. Ulin"], "isbn": "0520273729", "longitude": -118.244476, "periods": ["2000s", "Recent Releases"], "title": "Sidewalking: Coming to Terms with Los Angeles", "word_cloud": "brain space fully engage way year something title cover speak write crisp deep page see elegant insight type see year deeply satisfy write depend life need happen adore quite private side feel odd undiscovered give lot very quick full provocation think go something akin something walk author take square mile long sprawl disorganize subject isolated glimmer interest similar way best piece write work reflection city companion anyone like much hike fashionable real trekking fantastic work bookstore make staff pick quick shipment very interesting great like basically rumination transplant live guess year someone use public transportation walk lot try apply mindset walking option totally relate spend time whole lot recently take public transportation walk car city felt really many thing really different direct interaction walk drive agree city mush mosh together time together time time outdoor space time list go thing notice city really love opposite world collide agree author make city make used lot movie music cultural reference write felt relevant also use quote esp early think kind annoy really connect well think repeat lot totally little diversity example thought suppose ruminate repeat lot analyze thing exactly enjoy learn lot fact city know know originally entrance live close passing day blow mind also know lot history city happy learn like warn new read highly analytical diary history medium throw guide famous place like know famous touristy place do aspect enjoy described street walk remember walk see neighborhood well aspect everyday growth city continue interchange old new really nice see perspective past present future side walking smart short personal former truly know literally walk beauty meditation walk sidewalk city know driver highway traffic jam meditation slow notice relationship live identity memory interwoven physical space share others side walking feel way companion piece complex look beg engage world", "genres": ["Essay", "Art & Architecture", "Travel Writing", "Urbanism"], "summary": "In Sidewalking, David L. Ulin offers a compelling inquiry into the evolving landscape of Los Angeles. Part personal narrative, part investigation of the city as both idea and environment, Sidewalking is many things: a discussion of Los Angeles as urban space, a history of the city’s built environment, a meditation on the author’s relationship to the city, and a rumination on the art of urban walking. \r\n\r\nExploring Los Angeles through the soles of his feet, Ulin gets at the experience of its street life, drawing from urban theory, pop culture, and literature. For readers interested in the culture of Los Angeles, this book offers a pointed look beneath the surface in order to see, and engage with, the city on its own terms.\r\n\r\n\"The moments of true beauty in this shortest of books are precisely when Ulin reminds us that the everyday texture of Los Angeles . . . already functions like a quantum field out of which distant influences, disorienting urban rebirths and half-remembered cinematic cameos are constantly emerging. It is a city of 'seismic existentialism, ' he wonderfully suggests, whose ground is shaken not just by earthquakes but by the seemingly endless eruption of alternative urban forms, often successfully breaking through.\" Los Angeles Times\"", "asin": "0520273729", "rank": "443671", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51mrtERs%2BqL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}