{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 15, "rating": 4.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Good read"}, {"review_sentiment": 5.0, "review_text": "Thanks!"}, {"review_sentiment": 5.0, "review_text": "Los Angeles is very beautiful! Fell in love with LA ^)"}, {"review_sentiment": 5.0, "review_text": "A classic that every Angeleno should own - so sad that so much has disappeared"}, {"review_sentiment": 5.0, "review_text": "Although I've never been to Los Angeles, I conceived a great affection for the city by reading this book. Banham was a wonderful writer, a man utterly without European prejudices regarding the United States and southern California. To better understand the city and its modes of life, he learned to drive. He grasped that Los Angeles depends on mobility, rather than central organization. The illustrations are wonderful--one in particular, the magnificent interior of the Bradbury building of 1893 I found inspiring. A very beautiful book that belongs in every library."}, {"review_sentiment": 5.0, "review_text": "Great!"}, {"review_sentiment": 4.0, "review_text": "I had to buy this book for school and Amazon had a great price.  The ideas the author presents are interesting and his writing style is definitely interesting.  I definitely recommend it for people who live in LA."}, {"review_sentiment": 5.0, "review_text": "I translated this book into Portuguese and it made me fall in love with a city I've never seen. A perfect example of place-reading and architectural analysis, written in an engaging (and a little wild) style. Hasn't lost anything after forty years."}, {"review_sentiment": 5.0, "review_text": "the item was good, the book was in perfect condition, it was new.I got it after 2 days as it was suppose to be!!!very happy about it!!!!"}, {"review_sentiment": 5.0, "review_text": "A wonderful introduction to the roots of L.A. and how it came to be what it was in the arly 70's, and amazingly still relevant for the 21st century."}]}, "authors": ["Reyner Banham"], "isbn": "0520260155", "longitude": -118.244476, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Los Angeles: The Architecture of Four Ecologies", "word_cloud": "good thanks beautiful love classic sad much disappear never conceive great affection city reading wonderful writer man utterly european prejudice regard southern better city mode life learn drive grasp depend mobility rather central organization illustration wonderful particular magnificent interior building find inspire beautiful belongs library great buy school great price idea author present interest write style definitely interesting definitely recommend people live translate make love city never see perfect example architectural analysis write engage little wild style have lose anything forty year item good perfect condition get day happy wonderful introduction root come early amazingly still relevant century", "genres": ["Art & Architecture", "Urbanism"], "summary": "Reyner Banham examined the built environment of Los Angeles in a way no architectural historian before him had done, looking with fresh eyes at its manifestations of popular taste and industrial ingenuity, as well as its more traditional modes of residential and commercial building. \r\n\r\nHis construct of \"four ecologies\" examined the ways Angelenos relate to the beach, the freeways, the flatlands, and the foothills. Banham delighted in this mobile city and identified it as an exemplar of the posturban future. In a spectacular new foreword, architect and scholar Joe Day explores how the structure of Los Angeles, the concept of \"ecology,\" and the relevance of Banham's ideas have changed over the past thirty-five years.\r\n\r\n\"Banham wrote like a blissed-out lover, surrendering to his feelings of derangement and wonder while keeping his eyes wide-open.\" Los Angeles Times", "asin": "0520260155", "rank": "95694", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/411Cd1W4SVL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}