{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 4, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "The writings of Twain, of course, are great.  But the editor's notes give context and depth to the articles which are very helpful for the modern reader.  All of the information in the book can be found on various web sites, but the collection is delightful in its original paper format.  Clemens proves himself to be quite a knave, and the book paints an interesting portrait of this phase of his life."}, {"review_sentiment": 5.0, "review_text": "This book contains the newspaper writings of Mark Twain. If you love Twain's novels, you will be delighted with his newspaper writings. He just couldn't write a straight news story for nothing. Every story is peppered with his uncanny wit and satirical humor. Great fun for Twain buffs!"}, {"review_sentiment": 5.0, "review_text": "For the Twain lover who has gone through the canon of established works, this is a gold-mine (A real one, not just \"a hole in the ground with a liar standing over it.\")  The compiler sorted through the records of the San Francisco Call newspaper for which Samuel Clemens worked for a short time in his career.  Using internal stylistic cues, he has culled the unattributed articles of the ones specific to Mark Twain.  He undoubtedly hit the nail on the head in every selection he has made.  For little vignettes of hilarity posing as news, this cannot be beat!!  Mark Twain oozes from every article in this volume to the great satisfaction of his readers who are left hungry for a little bit more.  Enjoy!"}, {"review_sentiment": 5.0, "review_text": "Clemens of the Call: Mark Twain in San Francisco represents a prolific four months of Twain's early writing career.\"Samuel Clemens reported the city news for the San Francisco Daily Morning Call during approximately four months in 1864.  This book examines the relationship between the reporter and his paper,...The pieces reprinted here frequently are interesting for their style and for what they tell us of the author's attitudes and experience.  Also they are a record of events in San Francisco during the summer and early fall prior to President Lincoln's reelection.  They made good reading then, and by and large they still do today.  When a writer as creative as Clemens takes a city like San Francisco for his daily beat, is it surprising that the sparkle remains even a century (and nearly a half!) later?\" (From the Preface to this book.)Clemens of the Call contains nearly 200 pieces appropriately attributed to Twain.  As a reporter of local items for the Call, Twain covers The Streets of San Francisco, San Francisco's Chinese, The Theatres, Etc., Crime and The Police Court, and serves as Critic and Political Reporter.Twain, as reporter, covers the most San Franciscan of all occurances--Earthquakes, and even the absence of earthquakes...\"The earthquakes are getting so irregular.  When a community get used to a thing, they suffer when they have to go without it...we know of nothing that will answer as a substitute for one of those convulsions--to an unmarried man.\"In many of Twain's pieces we see Twain's satire and use of accepted stereotypes, \"employed at that time as much for comic purposes as for the expression of social criticism or of a sense of compassion for the wronged.\" (quote from the author's text)Twain's writing is never dull, and never without insight.This collection is rich!"}]}, "authors": ["Samuel Langhorne Clemens"], "isbn": "0520013859", "longitude": -122.4192363, "periods": ["1800s"], "title": "Clemens of the Call: Mark Twain in San Francisco", "word_cloud": "writing course great editor note give context depth article helpful modern information find various web site collection delightful original paper format prove quite knave paint interest portrait phase life contain newspaper writing love novel delight newspaper writing straight news story nothing story pepper uncanny wit satirical humor fun buff lover go canon establish work real hole ground liar stand compiler sort record newspaper work short time career internal stylistic cue cull unattributed article one specific undoubtedly hit nail head selection make little vignette hilarity pose news beat ooze article volume great satisfaction reader leave hungry little bit represent prolific month early writing career report city news approximately month examine relationship reporter paper piece reprint frequently interesting style tell author attitude experience also record event summer early fall prior reelection make good reading large still today writer creative take city daily beat surprising sparkle remain even century nearly half later contain nearly piece appropriately attribute reporter local item cover serve reporter cover occurrence even absence earthquakes earthquake get irregular community get use thing suffer go know nothing answer substitute convulsion unmarried man many piece see satire use accept stereotype employ time much comic purpose expression social criticism sense compassion wrong quote author text writing never dull never collection rich", "genres": ["Essay", "History", "Journalism"], "summary": "Clemens of the Call: Mark Twain in San Francisco represents a prolific four months of Twain's early writing career. \"Samuel Clemens reported the city news for the San Francisco Daily Morning Call during approximately four months in 1864. This book examines the relationship between the reporter and his paper,...The pieces reprinted here frequently are interesting for their style and for what they tell us of the author's attitudes and experience. Also they are a record of events in San Francisco during the summer and early fall prior to President Lincoln's reelection. They made good reading then, and by and large they still do today. When a writer as creative as Clemens takes a city like San Francisco for his daily beat, is it surprising that the sparkle remains even a century (and nearly a half!) later?\" \r\n\r\nClemens of the Call contains nearly 200 pieces appropriately attributed to Twain. As a reporter of local items for the Call, Twain covers The Streets of San Francisco, San Francisco's Chinese, The Theatres, Etc., Crime and The Police Court, and serves as Critic and Political Reporter. Twain, as reporter, covers the most San Franciscan of all occurances--Earthquakes, and even the absence of earthquakes... \"The earthquakes are getting so irregular. When a community get used to a thing, they suffer when they have to go without it...we know of nothing that will answer as a substitute for one of those convulsions--to an unmarried man.\" \r\n\r\nIn many of Twain's pieces we see Twain's satire and use of accepted stereotypes, \"employed at that time as much for comic purposes as for the expression of social criticism or of a sense of compassion for the wronged.\" Twain's writing is never dull, and never without insight. This collection is rich!", "asin": "0520013859", "rank": "3030511", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/41V3ZUCsNiL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}