{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 48, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a beautiful book! Very happy with my purchase"}, {"review_sentiment": 5.0, "review_text": "Outstanding book with amazing maps!"}, {"review_sentiment": 5.0, "review_text": "The  graphics depicting the distributions around New Orleans, i.e. population centers and flood water depths are worth the price of the book alone.  The flood water distribution graphic is what sold me on the book.  It told the entire story of the Katrina in one picture.  In this case 1 picture is worth a Milliion words.  You can see at a glance what happened where and how the phrase \"the sliver by the river\" came to be."}, {"review_sentiment": 5.0, "review_text": "The book was in great condition. Thank you."}, {"review_sentiment": 5.0, "review_text": "Marvelous in every way. I lived in New Orleans for twelve years, but left before Katrina. Before returning \"home\" to the city, I read these essays and studied these maps. When I got there, I was well-prepared for the changes. Captures the spirit of the city after Katrina, the complex changes, and the things that have stayed the same."}, {"review_sentiment": 5.0, "review_text": "A beautiful work of art with a lot of information for those who love the crescent city."}, {"review_sentiment": 5.0, "review_text": "great book for those interested in NOLA history"}, {"review_sentiment": 5.0, "review_text": "wonderful book!"}, {"review_sentiment": 5.0, "review_text": "Amazing Read, so informational, could not put it down"}, {"review_sentiment": 2.0, "review_text": "Great writing, but I could not get past the horrible graphic design. It made the book too hard to read. Looks to be the first project for this art director. They should choose another profession."}]}, "authors": ["Rebecca Solnit", "Rebecca Snedeker"], "isbn": "0520274040", "longitude": -90.0701156, "periods": ["2000s", "Recent Releases"], "title": "Unfathomable City: A New Orleans Atlas", "word_cloud": "beautiful happy purchase outstanding amazing map graphic depict distribution population center flood water depth worth price alone flood water distribution graphic sell tell entire story picture case picture worth word see glance happen phrase sliver river come great condition marvelous way live twelve year leave return home city essay study map get change spirit city complex change thing stay beautiful work art lot information crescent city great interested history wonderful amaze informational writing past horrible graphic design make hard first project art director choose profession", "genres": ["Essay", "History", "Urbanism"], "summary": "Like the bestselling Infinite City: A San Francisco Atlas, this book is a brilliant reinvention of the traditional atlas, one that provides a vivid, complex look at the multi-faceted nature of New Orleans, a city replete with contradictions. More than twenty essays assemble a chorus of vibrant voices, including geographers, scholars of sugar and bananas, the city's remarkable musicians, prison activists, environmentalists, Arab and Native voices, and local experts, as well as the coauthors’ compelling contributions. \r\n\r\nFeaturing 22 full-color two-page-spread maps, Unfathomable City plumbs the depths of this major tourist destination, pivotal scene of American history and culture and, most recently, site of monumental disasters such as Hurricane Katrina and the BP oil spill.\r\n\r\nThe innovative maps’ precision and specificity shift our notions of the Mississippi, the Caribbean, Mardi Gras, jazz, soils and trees, generational roots, and many other subjects, and expand our ideas of how any city is imagined and experienced. Together with the inspired texts, they show New Orleans as both an imperiled city—by erosion, crime, corruption, and sea level rise—and an ageless city that lives in music as a form of cultural resistance. \r\n\r\nCompact, lively, and completely original, Unfathomable City takes readers on a tour that will forever change the way they think about place.", "asin": "0520274040", "rank": "66185", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/41hIh-pjswL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}