{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 5, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "This is a highly entertaining, very readable book.  It reads as \"Sociology-Extra-Light\".  It is very like listening to ones very cranky uncle rant, if ones uncle were Gore Vidal or Christopher Buckley and had a couple of PhD's in subjects vaguely related to the psychology of tourism.What is the point the authors are trying to make?  They seem to want us all to stay home.  Well...that's pretty rich coming from a guy from Ohio (Davis) and one from Surrey (Marvin).I don't disagree that tourism turns beautiful places into nightmares; clearly, it is going to be the ruination of Venice.  It is just sad and wasteful and, probably, unstoppable.Good for the University of California Press for publishing this book, and how delightful the authors must be when they get going after a bottle of wine.  But, before they are done with the disquisition, I see myself pleading a headache and sloping away to more cheerful company.Does this book really help?  Even Gore Vidal and my Uncle Mort are best taken in more temperate doses."}, {"review_sentiment": 5.0, "review_text": "This is an easy read, and a surprisingly thoughtful, careful, and broadly informative book. It dives deeply into the endless, diverse difficulties of modern life in Venice, but with excellent historical context. Its history of Carnival, and its revival, for example, is the best I've read. It's blemished by two or three uninteresting pages of symbolic/semiotic analysis, but these minor problems are vastly overwhelmed by impressive reporting, review and research on important issues of the day."}, {"review_sentiment": 4.0, "review_text": "If the City of Venice (Italy) ever decides to build a model of Las Vegas, will the model include a little replica of Las Vegas' Venetian Hotel, itself a model of Venice?  It's the kind of question I might address to the authors of Venice: The Tourist Maze, this entertaining and rewarding account of what may be the most touristed city in the history of the planet.You might suppose there is nothing new in a critique of Venetian tourism.  Venice first licensed tour guides in 1219 (and right there is a factoid I did not know until I read this book).  Any number of others have left accounts of tourism in Venice, and quite a few have left accounts of accounts.Davis and Marvin do a creditable job of trying not to replow old ground.  There's almost no mention of Mary McCarthy, Jan Morris, Viscount Norwich, and other visitors who have done so much to inform and entertain.  There's only a bit of Henry James; almost none of Proust and only a glancing reference to that most famous of all sex tourists, Thomas Mann's Gustav von Aschenbach.  Instead, they give their primary attention to tourism as an activity, from the standpoint alike of the provider and the consumer.  You might almost call it an account of \"the enterprise of tourism,\" except this makes it sound,  misleadingly, like yet one more business book.There is a whiff of the lamp about the presentation, although it never gets overpowering: the chapter on the gondola is called \"the floating signifier,\" which is, I guess, the kind of joke you are bound to get when academics try to have fun.  They say they \"take advantage\" of a notion of one \"Appadurai\" (who?), although he never makes it to the bibliography.  A more obvious progenitor is Dean MacCannell, whose \"The Tourist\" is one of those rare books to make fancy theory both interesting and plausible.  A still better source, though surely unintended, would be the trdition o;f the mystery novel, where the hard-boiled detective sees the great city from the underside (indeed I am a little surprised that they don't say a word about Donna Leon, the Arthur Conan Doyle of the Venetian murder mystery).But forget about the theory: some of their best stuff is the nuts-and-boats practical.  There is an admirable sketch-history of the gondola and its monster offspring, the vaporetto.  And I particularly liked their discussion of the economics of the \"artisan.\"  They explain that Murano glass \"works\" because the craft is showy and dramatic, but that Burano lace-making does not \"work,\" because the craft is not showy, and because real Burano lace is prohibitively expensive.  Papier-mache masks work especially well, because the price is right, and the technology is accessible to any schoolchild.  By the way it appears that those fancy designer masks (confession: I have one on the living room wall) are no part of the tradition of Venice: masks at the /carnevale/ were for the most part mass-produced.The climax comes, inevitably in a discussion of the other Venice, the Venetian Hotel at Las Vegas (but why can't I find it in the index?).  They provide an entertaining account, appropriately fascinated and appalled, of the  Venetian as the private obsession of Steve Adleson who has lavished on it (so they say) the sum of $1.5 billion.  They seem not to have noticed that from a business standpoint, the Venetian seems to have been a rousing success.  If tourists still flock to the real Venice, they seem to descend at a comparable rate on our little Venice in the desert."}, {"review_sentiment": 5.0, "review_text": "As an inveterate traveler, I usually find that books about places I have visited leave me sorry I read them - travel guides are often so filled with tourist hype or stereotypical portrayals or out-dated analysis. But, this is not a travel guide: it is a thoughful and well-researched critique of Venice as both a tourist city and a (struggling to remain) actual city.Over the years I have related to Venice in three ways:  a member of the day-trip brigade (with two children in tow); a more serious tourist making a five day stay of it; a long-term (six month) resident in one of its working class neighborhoods.  From all of those perspectives, this book speaks to my experiences.But, more than a souvenir of my times there (see the excellent discussion of the role of souvenirs in a tourist city), this work has opened my mind to other ways to see my beloved city.  I now see the city and its people with new eyes, for the authors' critical eyes and ideas challenged me to experience Venice once again anew.If, as I would claim, I love Venezia, then I would also want to engage my heart and soul in the challenge they pose for the future of the city: not the worries about \"sinking into the sea\" but the worries about becoming \"lost in the tourists.\"And did you know that tourists have been coming here for over 500 years (yes, fellow Americans, that is before any tourists invaded North America), and that tacky souvenirs have been available for at least 300 years?  Lots more to know as well as ponder in this work."}, {"review_sentiment": 5.0, "review_text": "A must for the regular visitor of Venice. Davis and Marvin show clearly how the historical center and the outskirts (!) are sacrifized to the needs of mass-tourism. They describe  how the the city is transformed sytematically into a historical theme-park in which the remaining locals have only a stage-role. And 'resistance is useless': the inhabitants are able to slow, not to stop the process.The book predicts an ominous future of this cultural heritage site. Food for thought."}]}, "authors": ["Robert C. Davis", "Garry Marvin"], "isbn": "0520241207", "longitude": 12.3345898, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "1500s"], "title": "Venice, the Tourist Maze: A Cultural Critique of the World's Most Touristed City", "word_cloud": "highly entertain readable read listen one cranky uncle rant one uncle couple subject vaguely related psychology point author try make seem want home pretty rich come guy disagree tourism turn beautiful place nightmares clearly go ruination sad wasteful probably publish delightful author go bottle wine do disquisition see plead headache slop away cheerful really even best take temperate dos easy surprisingly thoughtful careful broadly informative dive deeply endless diverse difficulty modern life excellent historical context history revival example best blemish uninteresting page analysis minor problem vastly overwhelm impressive reporting review research important issue day ever decide build model include little replica model kind question author entertain reward account history nothing new venetian tourism first license tour guide right factoid know any number others leave account tourism quite leave account creditable job try re plow old ground almost mention visitors do much inform entertain bit almost none glance reference famous sex tourist instead give primary attention tourism activity standpoint alike provider consumer almost account enterprise tourism make sound misleadingly yet business whiff lamp presentation never get overpower chapter gondola call float signifies guess kind joke bound get academic try fun say take advantage notion never make bibliography obvious progenitor rare make fancy theory interest plausible still better source surely unintended f mystery detective see great indeed little surprised say word murder mystery forget theory best stuff practical admirable gondola monster offspring vaporetto particularly like discussion economics explain glass work craft showy dramatic work craft showy real lace prohibitively expensive mask work especially well price right technology accessible schoolchild way appear fancy designer mask confession living room wall part tradition mask part climax come inevitably discussion find index provide entertain account appropriately fascinate appalled venetian private obsession lavish say sum seem noticed business standpoint seem rouse success tourist still flock real seem descend comparable rate little desert inveterate traveler usually find place visit leave sorry travel guide often fill hype stereotypical portrayal analysis travel guide thoughtful struggle remain actual year relate way member brigade child tow serious make day month resident work class neighborhood perspective speaks souvenir time see excellent discussion role souvenir work open mind way see beloved see people new eye author critical eye idea challenge experience love also engage heart soul challenge pose future worry sink sea worry become lose tourist know tourist come year yes fellow tourist invade tacky souvenir available least year know well ponder work regular visitor show clearly historical center outskirt sacrifice need describe transform systematically historical remain local useless inhabitant able slow stop predict ominous future heritage site think", "genres": ["History", "Social & Cultural Studies"], "summary": "\"The tourist Venice is Venice,\" Mary McCarthy once observed—a sentiment very much in line with what most of the fourteen million tourists who visit the city each year experience, but at the same time a painful reality for the 65,000 Venetians who actually live there. \r\n\r\nVenice is viewed from a new perspective in this engaging book, which offers a heady, one-city tour of tourism itself. Conducting readers from the beginnings of Venetian tourism in the late Middle Ages to its emergence as a form of mass entertainment in our time, the authors explore what happens when today's \"industrial tourism\" collides with an ancient and ever-more-fragile culture. \r\n\r\nGiving equal consideration to those who tour Venice and those who live there, their book affords rare insight into just what it is that the touring and the toured see, experience, and elicit from each other.", "asin": "0520241207", "rank": "1581844", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51ovRJ6V9IL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}