{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 52.2319237, "ratings": {"num_ratings": 94, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "The investigative research that the author did to uncover his family's secret Holocaust history is absolutely astonishing.  It is a fascinating and engrossing literary journey to the darkness of an inglorious era and the story of survivors who brought to fruition the International Crime Tribunal.  All kudos to Mr Sands for this epic tale."}, {"review_sentiment": 4.0, "review_text": "Good book.well written and constructed.the author has done a great job in research.this book was highly recommended and I agree"}, {"review_sentiment": 5.0, "review_text": "This is an excellent work based upon Professor Sands' own family connection to Lemberg.  The author provides much personal information about Ralph Lemkin and Hersch Lauterpach, chronicling their early history and their respective contributions to international criminal law.  Professor Sands provides a lively and informative account that should interest practitioners and lay persons alike."}, {"review_sentiment": 5.0, "review_text": "Extraordinary book combining the origins of crimes against humanity and genocide with the author's family history and written in gripping style. Moreover, the author poses important questions about morality and about human rights, juxtaposing  individual rights against group interests and presenting this as a major clash of the 20th century and our current one."}, {"review_sentiment": 5.0, "review_text": "Phillipe is  wonderful historian, author and lawyer. The movie is extraordinary- it changed my life- A Nazi History/What Our Fathers Did. This book closes all the loopholes- fantastic!"}, {"review_sentiment": 5.0, "review_text": "One of the best books I ever read. Complex material told so effortlessly and personally that it was a pleasure to read.  A very moving memoire while also being a history, travelogue and a mystery.  Could not put this book down!"}, {"review_sentiment": 5.0, "review_text": "Impressive and comprehensive,amazing reseach ."}, {"review_sentiment": 5.0, "review_text": "Brilliant book which tackled a difficult subject in an objective and sensitive way.  An extraordinary achievement.  If you only read one book this summer, it should be this one."}, {"review_sentiment": 4.0, "review_text": "Exceptionally well researched.  It describes and analyses the inhumanity (perhaps that depravity cannot be called \"inhumanity\" since humans perpetrated it) of some humans against some others.  It raises the question whether, in the darkest corners of our minds, we all may really believe that some humans have a greater right than some others, to exist on this planet.  It also shows how the Germans are dealing with their past.Lu Rudel"}, {"review_sentiment": 5.0, "review_text": "Extraordinary Incredibly well researchedOpens more windows on an era we've read a lot about"}]}, "authors": ["Philippe Sands"], "isbn": "0525433724", "longitude": 21.0067265, "periods": ["1900s", "Recent Releases"], "title": "East West Street: On the Origins of \"Genocide\" and \"Crimes Against Humanity", "word_cloud": "investigative research author family secret history absolutely astonish fascinate engross literary journey darkness inglorious era story survivor bring fruition kudos epic tale good write author do great job highly recommend agree excellent work base family connection author provide much personal information chronicle early history respective contribution international criminal law provide lively informative account interest practitioner lay person alike extraordinary combining crime genocide author family history write gripping style moreover author pose important question morality human right juxtapose individual right group interest present major clash century current wonderful historian author lawyer movie change father close fantastic best ever material tell effortlessly personally move memoir also history travelogue mystery put impressive comprehensive amazing research tackle difficult subject objective sensitive way extraordinary achievement summer exceptionally well describes analyse inhumanity perhaps depravity call inhumanity human perpetrate human others raise question darkest corner mind really human greater right others exist planet also show deal extraordinary incredibly well researched opens window era lot", "genres": ["History", "Politics"], "summary": "Winner of the 2016 Baillie Gifford Prize for Nonfiction\r\n\r\nA profound and profoundly important book—a moving personal detective story, an uncovering of secret pasts, and a book that explores the creation and development of world-changing legal concepts that came about as a result of the unprecedented atrocities of Hitler’s Third Reich.\r\n\r\nEast West Street looks at the personal and intellectual evolution of the two men who simultaneously originated the ideas of “genocide” and “crimes against humanity,” both of whom, not knowing the other, studied at the same university with the same professors, in a city little known today that was a major cultural center of Europe, “the little Paris of Ukraine,” a city variously called Lemberg, Lwów, Lvov, or Lviv. It is also a spellbinding family memoir, as the author traces the mysterious story of his grandfather, as he maneuvered through Europe in the face of Nazi atrocities.\r\n\r\nEast West Street is a book that changes the way we look at the world, at our understanding of history and how civilization has tried to cope with mass murder.\r\n\r\n“Sands proceeds in the manner of certain historians . . . he also works in the manner of the author of thrillers. . . . In Sands’s history, as in all great novels, we encounter characters who, though seemingly secondary, are essential to the plot . . . And all the while Sands works in the way of artists like Filippo Lippi, who painted himself into the corner of his ‘Coronation of the Virgin’ and ‘The Funeral of Saint Stephen.’ . . . The result is a narrative, to my knowledge unprecedented. . . . We have in Sands’s East West Street a machine of power and beauty that should not be ignored by anyone in the United States or elsewhere who would believe that there are irreparable crimes whose adjudication should not stop at the border. . . . Barack Obama and his successors would be well advised to move to the top of their reading lists this account of the birth, amid the darkest conceivable shadows, of an unprecedented body of rights-based law, whose application has scarcely begun.” The New York Times", "asin": "0525433724", "rank": "33743", "city": "Warsaw", "image": "https://images-na.ssl-images-amazon.com/images/I/51RtQSYHWNL.jpg", "country": "Poland", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}