{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 59.9132694, "ratings": {"num_ratings": 76, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Very good and suspenseful"}, {"review_sentiment": 4.0, "review_text": "Character motivation and side issues, like public education and nursing home care, drive the novel more plot or nuanced characters."}, {"review_sentiment": 4.0, "review_text": "Good suspense. Decent pace. Good description of scenery. Keeps you guessing. About kids so could be disturbing for some people."}, {"review_sentiment": 1.0, "review_text": "formulaic cheap knock off of better Scandanavian mysteries.Characters are cliched and stock police types."}, {"review_sentiment": 5.0, "review_text": "very involving.  looking for more Bjork  and Munch and Mia."}, {"review_sentiment": 4.0, "review_text": "Read later"}, {"review_sentiment": 4.0, "review_text": "So many characters that I got confused a few times but it's definitely a page turner."}, {"review_sentiment": 4.0, "review_text": "A good page-turner with characters that are utterly damaged but still likable. I tend to grade hard. There is a lot going on in the book and I found it engaging.Maybe the end tied up neatly a bit too quickly to have taken so long to develop. And yes, at times one lead character's dependency on drugs and alcohol stretches credibility with the reader. Other than that though I enjoyed the book."}, {"review_sentiment": 5.0, "review_text": "I’M TRAVELING ALONE is an edgy, suspenseful, and thrilling crime novel that shows what good noir can truly be. In all honesty, there isn’t one aspect of this novel that I didn’t love. While reading, I devoured the pages as if I were on the hunt for the killer myself.With complex and deeply flawed characters, the author pulls the reader through their reactions to the crime as well as their interactions with each other. This dark and twisty story pulls together all the pieces of the mystery in a way that will keep you on the edge of your seat until the very end. Then once you are finished, you will be wanting more."}, {"review_sentiment": 3.0, "review_text": "An interesting Scandinavian thriller with religious overtones -- not terribly original but satisfying read"}]}, "authors": ["Samuel Bjork"], "isbn": "0525428968", "longitude": 10.7391112, "periods": ["2000s", "Recent Releases"], "title": "I'm Traveling Alone", "word_cloud": "very good suspenseful motivation side issue public education nursing home care drive plot nuanced character good suspense pace description scenery guess kid disturb people formulaic cheap knock better scandinavian cliched stock police type involve look read later so many character get confused time definitely page turner good character utterly damage still likable tend grade hard lot go find end tie neatly bit quickly take long develop yes time lead character dependency drug alcohol stretch credibility other enjoy m edgy suspenseful thrilling crime show good nor truly honesty aspect love read devour page hunt killer complex deeply flaw character author pull reaction crime well interaction dark twisty story pull together piece mystery way edge seat end then finish want interesting scandinavian thriller religious overtone terribly original satisfying", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "International bestseller Samuel Bjork makes his US debut, a chilling and fast-paced thriller in which two detectives must hunt down a vengeful killer--and uncover the secret that ties each of them to the crime\r\n\r\nA six-year-old girl is found in the countryside, hanging lifeless from a tree and dressed in strange doll's clothes. Around her neck is a sign that says \"I'm traveling alone.\"\r\n\r\nA special homicide unit re-opens with veteran police investigator Holger Munch at the helm. Holger's first step is to persuade the brilliant but haunted investigator Mia Kruger, who has been living on an isolated island, overcome by memories of her past. When Mia views a photograph of the crime scene and spots the number \"1\" carved into the dead girl's fingernail, she knows this is only the beginning. Could this killer have something to do with a missing child, abducted six years ago and never found, or with the reclusive religious community hidden in the nearby woods?\r\n\r\nMia returns to duty to track down a revenge-driven and ruthlessly intelligent killer. But when Munch's own six-year-old granddaughter goes missing, Mia realizes that the killer's sinister game is personal, and I'm Traveling Alone races to an explosive--and shocking--conclusion.\r\n\r\n“Samuel Bjork’s formidable I’M TRAVELING ALONE is despatched with real élan . . . Mia’s confrontation with both her own demons and a very human one is mesmerising fare.” The Independent", "asin": "0525428968", "rank": "310715", "city": "Oslo", "image": "https://images-na.ssl-images-amazon.com/images/I/418Tfpm0%2BYL.jpg", "country": "Norway", "story_arc": ["Tragedy", "Things only get worse"]}