{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 602, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Love it."}, {"review_sentiment": 5.0, "review_text": "If you don't know this story, it is well told here. Much of it was new to me and Egan manages toget a long and complicated life nicely organized and it seemed the longer the telling the more tragic itbecame. But Curtis's work prevails and it is still difficult to imagine his innate scholarship. The booktells it best because you get to see what Curtis saw disappearing."}, {"review_sentiment": 3.0, "review_text": "A very detailed book that perhaps got a little long for me.  I plowed through it and am glad I read this historical novel."}, {"review_sentiment": 5.0, "review_text": "Excellent.  I much enjoyed this book - as I do all of Timothy Egan's books.  He's a marvelous writer and understands the West better than most.  Highly recommended."}, {"review_sentiment": 5.0, "review_text": "great book"}, {"review_sentiment": 5.0, "review_text": "Wonderful read! Well researched by someone who is very passionate about the subject matter. I would love to see Mr. Egan's view of the Shadow Catcher's experiences and work brought to life in film. What Mr. Curtis was trying to do needs to be brought out to a broader audience in a dramatic versus a documentary way . If done correctly the Mr. Egan's representation could have a significant impact on the conventional understanding of the life of the Native Communities which Mr. Curtis was trying to represent."}, {"review_sentiment": 5.0, "review_text": "Timothy Egan has captured the essence of a remarkable man with an compelling narrative.  This book, which could be understood as history, biography or anthropology, reads like a novel.  Edward Curtis, as represented by Egan, was a man of integrity who insisted on letting Native Americans speak for themselves.  He did this through his relationships with his subjects, his photos and his accompanying materials (written textand primitive musical recordings.)"}, {"review_sentiment": 5.0, "review_text": "It’s terribly difficult after finishing the 6th in a series of Timothy Egan’s books to declare a favorite. Yet,  Egan’s  Short Nights of the Shadow Catcher: The Epic Life and Immortal Photographs of Edward Curtis – is -well – it broke my heart.The life and times of “fanatical” (self described) artists like Edward Curtis are rarely full of fulfilling, float you on air happiness.  Yet, his life had many interactions and endorsements by the day’s rich and famous (Teddy Roosevelt and J. Pierpont Morgan (to name two - not that this makes any difference in terms of Curtis's immortal contributions).A man who attempted to capture the remnants of an ever encroaching genocide of the remaining inhabitants of the western tribes of Native Americans is a noble story. And noble is the way Egan tells it. Yet, it leaves you (the trajectory of Curtis’s life) unfulfilled…as the life stories of so many artists do.How Egan finds these tales and has the uncanny ability to weave story in and around the real-life characters he portrays – is – well – a mysterious literary talent that I’m unsure if even he could describe it adequately. The book, story, prose, research and Egan’s writing just make you salivate for the next page.This is an unequivocal FIVE STAR work (which I don’t attribute to most literature I read). It is a treasure – just as the life of Edward Curtis and his enduring work was/is. I am really glad I read this book. You will be too.I am now on to my 7th Egan book in the past three weeks (which I NEVER do); The Immortal Irishman: The Irish Revolutionary Who Became An American Hero (2016).You simply CANNOT understand the American West without Reading Timothy Egan…PERIOD."}, {"review_sentiment": 5.0, "review_text": "Great story of a dream that took a life to accomplish. Suggestion: go to your local library and look for his photo journals.The photos are amazing and knowing the story behind many of them depicted in the book will mean so much more.A must read for anyone interested in Native American History."}, {"review_sentiment": 5.0, "review_text": "The best book on the subject"}]}, "authors": ["Timothy Egan"], "isbn": "0544102762", "longitude": -122.3300624, "periods": ["1900s", "Recent Releases"], "title": "Short Nights of the Shadow Catcher: The Epic Life and Immortal Photographs of Edward Curtis", "word_cloud": "know story well told much new manage long complicate nicely organize seem longer tell tragic it became work prevails still difficult imagine innate scholarship book tells best get see saw disappear detailed perhaps get little long plow glad historical excellent much enjoy marvelous writer understand better recommend great research someone passionate subject matter experience work bring film try need bring broader audience dramatic versus documentary way do correctly representation significant impact conventional understanding try represent capture essence remarkable man compel narrative history biography anthropology read represent man integrity insist let native speak relationships subject accompany material write text and primitive musical recording terribly difficult finish series declare favorite break time fanatical self describe artist rarely full fulfilling float air happiness many interaction endorsement day rich famous name make difference term contribution man attempt capture remnant ever encroach genocide remain inhabitant western tribe native noble story noble way tell leave trajectory story many artist find tale uncanny ability weave story character portray well mysterious literary talent unsure even adequately story prose research write salivate next unequivocal work attribute literature treasure endure work really glad evan past week never american simply understand story dream take accomplish local library look photo photo amaze know story many depict mean much anyone interested native american history best subject", "genres": ["Biography", "Photography"], "summary": "Edward Curtis was charismatic, handsome, a passionate mountaineer, and a famous portrait photographer, the Annie Leibovitz of his time. He moved in rarefied circles, a friend to presidents, vaudeville stars, leading thinkers. But when he was thirty-two years old, in 1900, he gave it all up to pursue his Great Idea: to capture on film the continent’s original inhabitants before the old ways disappeared.\r\n\r\nCurtis spent the next three decades documenting the stories and rituals of more than eighty North American tribes. It took tremendous perseverance — ten years alone to persuade the Hopi to allow him to observe their Snake Dance ceremony. And the undertaking changed him profoundly, from detached observer to outraged advocate. Curtis would amass more than 40,000 photographs and 10,000 audio recordings, and he is credited with making the first narrative documentary film. In the process, the charming rogue with the grade school education created the most definitive archive of the American Indian.\r\n\r\n“A vivid exploration of one man's lifelong obsession with an idea . . . Egan’s spirited biography might just bring [Curtis] the recognition that eluded him in life.” Washington Post \r\n\r\n“A darn good yarn. Egan is a muscular storyteller and his book is a rollicking page-turner with a colorfully drawn hero.” San Francisco Chronicle", "asin": "0544102762", "rank": "25694", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/51W3s1bhnaL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}