{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 43, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "Thomas Foley is the Cold War, UK bureaucrat version of The Man Without Qualities. Minus the usual soul unrest typical for Viennaise characters. Sent to manage the Britannia inn at the EXPO 1958 in Brussels, the first after the end of the WWII, he is faced with a completely new reality and challenges, compared to his usual life back home: with a 9 to 5 job, a wife and a small daughter, an uneventful routine-based existence typical for almost 90% of the world population.Expo 58 is something different, and as someone who worked herself to such a grandiose event, and keep a small track of literary representations of international exhibitions, I reckon that this is an interesting source of inspiration, well described in the book. For a limited amount of time, people from all over the world are gathering to work and know each other, more or less intimately. At the end of the show, everyone is back to the home reality, and this is how world goes round.Against his will and without any warning, Foley is caught into a hilarious net typical for that time of the Cold War. There are two spies looking exactly as spies and talking as someone might expect spies are talking, at least if you had enough James Bond bibliography. But there are also people that might look completely different than their appearance display: like the KGB spy versus the attractive American counterpart. Foley's role, which even working at a public institution in a country involved in the Cold War diplomacy and daily invisible war, he is greatly unaware of the geopolitical challenges, is not even to report - as every space around him seems to be bugged - is of low level, to flirt with a girl. One of those 'patriotic calls' simple citizens, otherwise completely un- and a-historical, might be called to do in special situations, like many of the events branded so during the fierce Cold War years.What I've found really entincing intellectually in this book is the subtle second plan game between reality and appearances, text and subtext and context, about how we remember and read facts versus how the naked facts really are. Once you discover this layer of interpretation, the book is getting a completely different perspective and value.My only annoyance with the book was the obsessive use of 'old man' by more than one character. Regardless the original meaning aimed by the author, if any, it doesn't bring in my opinion anything good or hilarious to the story."}, {"review_sentiment": 5.0, "review_text": "Thoroughly enjoyed this book. Arrived on time and is of good quality. Worth the money."}, {"review_sentiment": 4.0, "review_text": "A very good read, reminiscent of a Graham Greene novel."}, {"review_sentiment": 4.0, "review_text": "Coe has written several books I entirely love (The Winshaw Legacy and The Rotter's Club), so I picked up his latest the moment I saw it. What I didn't realize until I read the afterward is that the protagonist is a character briefly mentioned in one of his novels I haven't read (The Rain Before It Falls). I enjoyed this one on its own merits, but it's possible those who've read that other book would get even another layer from this.Thomas Foley is a new father working an undistinguished job writing and copyediting pamphlets for the British government. To his surprise, he is recruited to participate in the British pavilion at the 1958 World Expo in Brussels, but not as a writer. Instead, he is tasked with overseeing the faux pub that will serve as the central social gathering spot for the British section. Foley is a keen observer of world events and harbors the sense that Britain is a little isolated and behind the times, and thus grabs the chance to get out and see the modern world. The fact that he can ditch his wife and wailing kid for a few months doesn't hurt either...What follows is deft blend of comic spy caper, as Foley gets tasked by two mysterious MI6 types with some special duties while at the Expo, and domestic drama, as he gets attracted to a Belgian hostess and drifts from his wife back home. It's a perfectly contained book, not long or self-important, but highly enjoyable. Through Foley, the reader gets a real sense of Europe starting to blossom in the wake of World War II, and the emergence of modern world."}, {"review_sentiment": 1.0, "review_text": "A boring story about an unlikable character."}, {"review_sentiment": 1.0, "review_text": "I managed to struggle through 100 pages of this feeble effort which centers on a young English civil servant sent to a fair to promote international relations that was held in Brussel in 1958.His task is to supervise a “typical” English pub at the British stand and the reason he is chosen is because his father used to be a pub landlord (although he knows nothing about running a pub himself) and his mother was born in Belgium (although he has never been there).I imagine this is meant to be a cue for laughter and we readers are supposed to expect a delicious joke like William Boot, the nature notes writer in Waugh's “Scoop”, unwittingly becoming a war correspondent or Wormold, the vacuum cleaner salesman in Greene's “Our Man in Havana”, becoming a spy.The character is followed by two spies and he falls for a Belgian girl although he has a wife and baby waiting for him back home in dear old England. It reads like an outline for a sitcom.You'll get an idea of how excruciating it is from some examples of the dialogue: “Rum sort of cove”, “I'm ready for a gasper myself” and “Tickety boo”.How piffle like this gets published amazes me."}, {"review_sentiment": 4.0, "review_text": "Unexpected encing but you feel they did the right thing."}, {"review_sentiment": 3.0, "review_text": "I enjoyed reading this except for the last chapter.  He should have ended with Thomas musing about his life choices.  Just stop reading there.  But I wondered about this character.  He seems so unethical in his treatment of his family and the women in the novel. He seems to lack any moral compass or depths of human feelings.  That is odd for Coe.  His previous novels all had a decidedly ethical slant."}, {"review_sentiment": 4.0, "review_text": "Just so so, tad bit slow."}, {"review_sentiment": 5.0, "review_text": "Interesting insights into events of 1958 from a European perspective.  Very fact based."}]}, "authors": ["Jonathan Coe"], "isbn": "054434376X", "longitude": -0.12574, "periods": ["1900s", "Recent Releases"], "title": "Expo 58", "word_cloud": "bureaucrat version man usual soul unrest typical viennese character manage inn first end face completely new reality challenge compare usual life back home job wife small daughter uneventful existence typical almost world something different someone work grandiose event small track literary representation international exhibition reckon interest source inspiration well describe limited amount time people world gather work know le intimately end show everyone back home reality world go warn catch hilarious net typical time spy look exactly spy talk someone spy talk least enough bibliography also people completely different appearance display spy versus attractive american counterpart role even work public institution country involve diplomacy daily invisible war greatly unaware geopolitical challenge even report space around seem bug low level flirt girl call simple citizen otherwise completely special situation many event brand fierce find really entice intellectually subtle second plan game reality appearance text subtext context remember fact versus naked fact really once discover layer interpretation get completely different perspective annoyance obsessive use man character original meaning aim author bring opinion anything good hilarious story thoroughly enjoy time good quality money good reminiscent write several entirely love pick latest moment saw realize afterward protagonist character briefly mention novel rain enjoy merit possible even layer new father work undistinguished job write copy editing pamphlet british government recruited participate british pavilion writer instead task oversee faux pub serve central social gathering spot british section keen observer world event harbor sense little isolate time thus grab chance get modern world fact wife wail kid month hurt follow deft blend comic spy caper get task mysterious type special duty domestic drama get attracted belgian hostess drift wife back home perfectly contain long highly enjoyable get real sense start blossom wake emergence modern world boring story unlikable character manage struggle page feeble effort center young civil servant send fair promote international relation hold task supervise typical pub british stand reason chosen father use pub landlord know nothing run pub mother born never imagine meant cue laughter reader suppose expect delicious joke nature note writer unwittingly become war correspondent vacuum cleaner salesman become character follow spy fall belgian girl wife baby wait back home dear old read outline get idea excruciate example dialogue sort cove ready gasped boo piffle get publish amazes unexpected fence feel right thing enjoy read last chapter end muse life choice reading wonder character seem unethical treatment family woman seem lack moral compass depth human feeling odd previous novel decidedly ethical slant just tad bit slow interest insight event european perspective fact base", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A comic spy caper and international love story, set in Europe in the middle of the last century, Expo 58 is the latest sublime creation by Jonathan Coe, hailed by Nick Hornby as “probably the best English novelist of his generation.”\r\n\r\nHandsome, unassuming Thomas Foley is an employee at the Central Office of Information whose particular biography (Belgian mother, pub-owning father) makes him just the man to oversee the “authentic British pub” that will be erected at the 1958 Brussels World’s Fair. It’s the first major expo after World War II, meant to signify unity, but there’s inevitable intrigue involving the U.S. and Soviet delegations. In the shadow of an immense, imposingly modern structure called the Atomium, the married Foley becomes both agent and pawn—when he’s not falling head over heels for Anneke, his Belgian hostess.\r\n\r\nFunny, fast-paced, and genuinely moving, Expo 58 is both a perfect evocation of a moment in history and the welcome return of one of today’s finest novelists.\r\n\r\n“Expo 58, like Our Man in Havana and all the best comic novels, reminds us that comedy is not the sugar that makes the medicine go down. Comedy is the medicine—medicine that exists not to cure you but to make you realize, once the medicine wears off, how sick you really are.” New York Times ", "asin": "054434376X", "rank": "1169551", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51NARSXPt3L.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}