{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 162, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Really enjoyed the book! There was alot when reading The Sun Also Rises that seemed to be left out. This is the bittersweet reality of the trip, what happened to the friends after, who Lady [Twysden] really slept with, what really went on behind Hem's stories. Blume did a really good job of telling."}, {"review_sentiment": 5.0, "review_text": "Very funny and entertaining :)"}, {"review_sentiment": 4.0, "review_text": "A fascinating look behind the scenes of Hemingway's time in Paris, and his work leading up to & including his classic debut novel.  I listened to this as an audiobook and found it riveting. While I've always heard that Hemingway was a bit of an unpleasant person in real life, the extent of his personality flaws as outlined in this book are frankly stunning. Yet this doesn't detract from Hemingway's work, and the well-told story and supporting details only help to illuminate his famous novel - and in many ways make it a richer and more meaningful read (even if it's in ways that Hemingway himself might not have appreciated).Highly recommended for fans of Hemingway's work in general, or in particular for fans of The Sun Also Rises or A Moveable Feast (his own memoirs of his time in Paris, and perhaps his best work)."}, {"review_sentiment": 5.0, "review_text": "A great book, which laid out some here to fore -- at least to me-- unknown facts. I recommend it."}, {"review_sentiment": 2.0, "review_text": "Boring."}, {"review_sentiment": 3.0, "review_text": "I'd love to tell you more about this book which is one of seven I have not yet received"}, {"review_sentiment": 5.0, "review_text": "Narration was spot on, for non fiction material. It was very interesting learning the creation of The Sun Also Rises. I don't know how the author came about all this information and I'm sure literary license was applied but I enjoyed it very much. It did take me several stops and starts, other books I'd been waiting for were published but it was straight forward, so easy to follow."}, {"review_sentiment": 4.0, "review_text": "A great take on a well-known and fascinating story with some added (fictional) spice."}, {"review_sentiment": 5.0, "review_text": "Awful title even if it is a quote but after reading The Sun Also Rises and Paula McLain's The Paris Wife, this was exactly what I needed for balance.  Blume's writing does not follow Hemingway's \"ice berg\" approach leaving much to your imagination.  She answers your questions, at least most of them and if you don't know more about what Hemingway thought, you certainly know a lot about what all his friends wrote about him and he them.  Much scholarship went into this book but it's anything but plodding.  After all when \"everybody behaves badly\", you don't have to go far to laugh out loud at the absurdity of youth, even talented youth."}, {"review_sentiment": 5.0, "review_text": "I've read many books concerning Hemingway and I have to say that this is a real treasure, especially if you are looking for \"THE SUN ALSO RISES \" years. The author goes into great detail about this book, the characters, and the time of his life in which he wrote it. The thing I liked best was the ending, it discussed what happened to all of the people he wrote about! 😀 I actually ended up renting the movie!"}]}, "authors": ["Lesley M. M. Blume"], "isbn": "0544276000", "longitude": 2.3514992, "periods": ["1900s", "Recent Releases"], "title": "Everybody Behaves Badly: The True Story Behind Hemingway's Masterpiece The Sun Also Rises", "word_cloud": "really enjoy a lot read seem left bittersweet reality trip happen friend really sleep really go story really good job tell very funny entertaining fascinating look scene time work lead include classic debut listen audio book find rivet always hear bit unpleasant person real life extent personality flaw outline frankly stun detract work support detail help famous many way make richer meaningful even way recommended fan work general particular fan memoir time perhaps best work great laid fore least unknown fact recommend bore love yet receive spot non fiction material interest learn creation know author come information sure literary license apply enjoy much several stop start wait publish straight forward easy follow great take fascinate add fictional spice awful title even quote read exactly need balance write follow ice berg approach leave much imagination answer question least know think certainly know lot friend write much scholarship go anything plodding badly go far laugh loud absurdity youth even talented youth many concern say real treasure especially look year author go great detail character time life write thing like best end discuss happened people write actually end rent movie", "genres": ["Fiction & Literature"], "summary": "The making of Ernest Hemingway's The Sun Also Rises, the outsize personalities who inspired it, and the vast changes it wrought on the literary world\r\n\r\nIn the summer of 1925, Ernest Hemingway and a clique of raucous companions traveled to Pamplona, Spain, for the town’s infamous running of the bulls. Then, over the next six weeks, he channeled that trip’s maelstrom of drunken brawls, sexual rivalry, midnight betrayals, and midday hangovers into his groundbreaking novel The Sun Also Rises. This revolutionary work redefined modern literature as much as it did his peers, who would forever after be called the Lost Generation. But the full story of Hemingway’s legendary rise has remained untold until now.\r\n\r\nLesley Blume resurrects the explosive, restless landscape of 1920s Paris and Spain and reveals how Hemingway helped create his own legend. He made himself into a death-courting, bull-fighting aficionado; a hard-drinking, short-fused literary genius; and an expatriate bon vivant. Blume’s vivid account reveals the inner circle of the Lost Generation as we have never seen it before, and shows how it still influences what we read and how we think about youth, sex, love, and excess.", "asin": "0544276000", "rank": "124422", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/513yMCTTbXL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}