{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2583, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "It’s called a novel, but it reads like a collection of war stories and essays about being an American soldier in the Vietnam War. That’s not a criticism. In fact, it’s part of the brilliance of this book. If it were thoroughly plotted, it might not feel so authentic. As war is disjointed, so is O’Brien’s book. Some of the chapters are tiny and some are lengthy. Some read more like essays than fiction, and others are clearly fictitious.When I say that “some are clearly fictitious,” there’s always a doubt that it might just be a true story--because war is just that absurd. An example that springs to mind is one of the most engaging pieces in the work. It’s called “Sweetheart of Song Tra Bong,” and it’s about a wholesome, young girlfriend to one of the soldiers who [improbably] comes to live in the camp. The girl acclimates to the war, and soon she is going out on patrol--not with the ordinary infantry soldiers, but during the night with the Green Berets. Perhaps the moral is that some people are made for war, and it’s never who you’d suspect. As I describe it, the premise may sound ridiculous, but the way O’Brien presents it as a story told by a Rat Kiley--a fellow infantryman known to exaggerate—it feels as though there is something very true, no matter how fictitious the story might be. Before one reads “Sweetheart of Song Tra Bong” one has been primed by a chapter entitled “How to Tell a True War Story,” which tells one that truth and falsehood aren’t so clear in the bizarre world of war.There are a couple chapters outside the period during which O’Brien (the character, who may or may not be the same as the author) is actively in an infantry unit. One early chapter describes his near attempt at draft dodging, and another talks of his time stationed at the rear after being injured. Both of these chapters offer an interesting twist in the scheme of the book overall. We find O’Brien to be a fairly typical infantry soldier, and it seems hard to reconcile this with his floating in a canoe and narrowly deciding not to make a swim for the Canadian shoreline.  However, what is odder still is realizing how distraught he is to be pulled out of his unit, particularly when he realizes that he has become an outsider and the [then rookie] medic who botched his treatment is now in the in-group. This is one of the many unusual aspects of combatant psychology that comes into play in the book, along with O’Brien’s description of how devastating it was to kill.There are 21 chapters to the book. As I said, they run a gamut, but at all times keep one reading. It’s the shortest of the Vietnam novels I’ve read—I think. When I think of works like “Matterhorn” and “The 13th Valley,” there seems to be something hard to convey concisely about the Vietnam War, but O’Brien nails it with his unconventional novel. O’Brien also uses repetition masterfully. This can be seen in the title chapter “The Things They Carried,” which describes the many things carried by an infantry soldier—both the physical items they carried on patrol and the psychological and emotional things they carried after the war.  It’s a risky approach that pays off well.I’d recommend this book for anyone—at least anyone who can stomach war stories."}, {"review_sentiment": 5.0, "review_text": "One of my favorite books. Doesn’t glorify war. Shows it for what it is and shows the effects that spending time fighting will have over you. Everyone is different, but Tim O’Brien reveals stories from varied personalities.Such a good read."}, {"review_sentiment": 5.0, "review_text": "Tim O'Brien is one of our greatest living war authors, in my opinion. He is the essential story teller of the Vietnam war. He does more than just relate events and characters, he creates a mythos that transcends the events and helps illustrate humanities' survival in the face of barbarity, and also the dark depths that reside in the human animal. A must read!"}, {"review_sentiment": 3.0, "review_text": "I was eager to read this after seeing the author on Ken Burns' The Vietnam War series. The impact of the series may have raised my expectations for this book. I enjoyed it, but it wasn't the great read I was hoping for."}, {"review_sentiment": 5.0, "review_text": "an easy Vietnam read"}, {"review_sentiment": 5.0, "review_text": "good story, well written, talks about struggles and how to cope in an impossible conflict ordered by an inept government."}, {"review_sentiment": 5.0, "review_text": "A very gritty, but truthful account of the Vietnam war for reading about being a medic in 'Nam from one medic to another."}, {"review_sentiment": 5.0, "review_text": "I read this book for a book club and had a hard time with the first story--enumerating literally the \"things they carried\" but immediately became so impressed with this book: for me, it captured the experience of being in Vietnam. It was vivid and profound. I find, months later, that it still impacts me. No one can know how it feels unless they lived the experience, but this exceptional book conveys the experience so well."}, {"review_sentiment": 5.0, "review_text": "As a veteran of Operation Enduring Freedom, I connected with a lot of what Tim O'Brien had to say in this excellent book but most interesting were the differences between the war I experienced in Afghanistan and the one he and my father both experienced in the jungles of Vietnam. I found his message about the relativity of truth in story-telling interesting though not one I buy into. This is an excellent book for readers of all interests."}, {"review_sentiment": 5.0, "review_text": "Downloaded for my daughter's summer reading project, ( it was on the school issued list ) and ended up reading it myself. Being a Vietnam era veteran, I personally knew a few guys that lived in county. This story is a true to life account and a must read to understand the pure hell these \"kids\" lived through. I thank them, each and ever one for their sacrifices."}]}, "authors": ["Tim O'Brien"], "isbn": "0544309766", "longitude": 0.0, "periods": ["1900s"], "title": "The Things They Carried", "word_cloud": "call read collection war story essay criticism fact part brilliance thoroughly plot authentic war disjoint chapter tiny lengthy like essay fiction others clearly say clearly fictitious always doubt true story war example spring mind engage piece work call wholesome young girlfriend soldier improbably come live camp girl acclimate war soon go patrol ordinary infantry soldier night perhaps moral people make war never suspect describe premise ridiculous way present story tell fellow infantryman know feel something true matter fictitious story read prim chapter entitle tell truth falsehood clear bizarre world couple chapter outside period character actively infantry unit early chapter describes attempt draft dodge talk time station rear injured chapter offer interesting twist scheme overall find o fairly typical infantry soldier seem hard reconcile float canoe narrowly decide swim canadian shoreline however odder still realize distraught pull unit particularly realize become outsider rookie medic botch treatment many unusual aspect combatant psychology come description devastate chapter say run gamut time read shortest novel think think work seem something hard convey concisely nail unconventional also use repetition masterfully see title chapter describes many infantry physical item patrol psychological emotional war risky approach pay recommend least anyone stomach war story favorite war show effect spend time fight different reveals story vary good greatest live war author opinion essential story teller war relate event character creates myths transcend event help illustrate humanity survival face barbarity also dark depth human animal eager see author series impact series expectation enjoy great hop easy good story well write talk struggle cope impossible conflict order inept government gritty truthful account war read medic medic club hard time first story enumerate literally immediately become impressed captured experience vivid profound find month later still impact one know feel lived experience exceptional conveys experience well veteran connect lot say excellent interesting difference war experience father experience jungle find message relativity truth interest buy excellent reader interest download daughter summer reading project school issued list end read era veteran personally know guy live county story true life account pure hell kid live thank ever sacrifice", "genres": ["Memoir"], "summary": "A classic work of American literature that has not stopped changing minds and lives since it burst onto the literary scene, The Things They Carried is a ground-breaking meditation on war, memory, imagination, and the redemptive power of storytelling.  \r\n  \r\nThe Things They Carried depicts the men of Alpha Company: Jimmy Cross, Henry Dobbins, Rat Kiley, Mitchell Sanders, Norman Bowker, Kiowa, and the character Tim O’Brien, who has survived his tour in Vietnam to become a father and writer at the age of forty-three. \r\n  \r\nTaught everywhere—from high school classrooms to graduate seminars in creative writing—it has become required reading for any American and continues to challenge readers in their perceptions of fact and fiction, war and peace, courage and fear and longing.\r\n\r\nThe Things They Carried won France's prestigious Prix du Meilleur Livre Etranger and the Chicago Tribune Heartland Prize; it was also a finalist for the Pulitzer Prize and the National Book Critics Circle Award.", "asin": "0618706410", "rank": "1557", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51f1X0WUPqL.jpg", "country": "Hanoi", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}