{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 46.4846583, "ratings": {"num_ratings": 35, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "It is a succinct and clearly written book.  The writer handled the numerous characters well.  Otherwise, it would have been cofusing. Bascomb has great talent for putting all his research together into a gripping, enjoyable read.I have read Bascomb' s other books.  Take my word for it,  he will not disappoint you."}, {"review_sentiment": 5.0, "review_text": "Start here to understand the revolution."}, {"review_sentiment": 4.0, "review_text": "Beautifully written. Fully desciptive and engaging."}, {"review_sentiment": 4.0, "review_text": "ARRIVED.  GOOD SHAPE"}, {"review_sentiment": 3.0, "review_text": "Good historical account of an event that most Americans do not know about and would be shocked to think something like this could happen"}, {"review_sentiment": 5.0, "review_text": "This is a great book by Bascomb that is succinct and written clearly, making for an engaging, fast-paced novel. Bascomb has great talent for putting all his research together into a gripping, enjoyable read. Also read Hunting Eichmann!"}, {"review_sentiment": 3.0, "review_text": "I knew about this and more info was fine. But it just seemed to get very long. Fine but that is all."}, {"review_sentiment": 5.0, "review_text": "Years ago, I watched the film Battleship Potemkin a silent film of great influence in the Soviet Union and with film historians.  So when I found this book (in CD version), I was excited to read of the true events for that fascinating period.The author of this book most certainly did not disappoint.  His research was thorough and objective.  Consistent with many other accounts of Czarist Russia, one can understand the fervent desire of a subjugated people and Czar Nicholas whose cruelty was only matched by his administrative incompetence.  Note: in a rather disgusting action, the Russian Orthodox Church gave a holy status to Nicholas sometime after the fall of the Soviet Union.Along with a detailed characterization of the times and the developing revolution, the author leads us into the lives of the significant participants of the mutiny.  Unlike what was portrayed in the film, the mutiny was a long time in preparation, although, it did occur sooner than desired.  For obvious reasons of his character and his place as a leader in the mutiny, the author focuses much attention on the sailor Matyushenko.  He was a tragic figure in many ways whose goals for the mutiny transcended the simple humiliation of the Tsar or the freeing of the sailors from the common barbarity of the enforced naval life.  This was a person with a gift for oratory who hoped to free the nation.  In the end, his dream ended without his realizing the downfall of the monarchy.The author makes note of his doubt that any of the sailors would have been pleased with the Soviet system that followed the monarchy, which seemed to do nothing more than move out one oppressive system for another.  I certainly agree.  My only difficulties with the book were not the fault of the author or of its structure.  I am not familiar from my culture with east European names and it was hard for me to keep track of the various names and this became a handicap.  This was especially so since this was an audio version of the text and I couldn't look up names.  Btw, the audio reading was excellent and well-paced.  The tracks were in about 5 minute intervals which allowed for easy stopping and finding of my place or the occasional rewinding."}, {"review_sentiment": 5.0, "review_text": "I purchased this book used at a terrific price.  It came in a resaonable amount of time and packaged well.The story is well written and re-tells a very little known or forgotten part of Russian history.The only problem with the book is that whoever proof read it did not do a very good job."}, {"review_sentiment": 4.0, "review_text": "The author does a solid job of what actually happened when sailors mutinied on this Russian battleship.  The initial revolt was when sailors did not like the stinking meat the purser bought, and refused to eat it.  The captain insisted, and this caused him to be shot and tossed overboard.  The city of Odessa was also revolting, due to the poor governance of the city by the corrupt city officials.  When the battleship pulled into port, both the mutiny and the rebellion caused deep concern in St. Petersburg.  Nicholas II came off as a tyrant, demanding the hangings of rebellious sailors.  The Potemkin then sailed around the Black Sea causing consternation with Russian, Bulgarian, Romanian, and Turkish officials.  The sailors eventually docked in Romania, where they opened the sea cocks and fled into exile.Bascomb does a solid job of detailing the mutiny and its causes.  One got the feel of the day to day struggle by the sailors, and why the mutiny took place.A good solid read."}]}, "authors": ["Neal Bascomb"], "isbn": "0547053525", "longitude": 30.732564, "periods": ["1900s", "Recent Releases"], "title": "Red Mutiny: Eleven Fateful Days on the Battleship Potemkin", "word_cloud": "succinct clearly write writer handle numerous character well otherwise focus great talent put research together grip enjoyable word disappoint understand revolution beautifully write descriptive engaging arrived good shape good historical account event know something great succinct write clearly make engage great talent put research together grip enjoyable also hunt know info fine seem long year ago watch film silent film great influence film historian find version excite true event fascinate author certainly disappoint research objective many account czarist understand fervent desire subjugate people cruelty match administrative incompetence rather disgust action russian give holy status sometime fall detailed characterization time develop revolution author lead live significant participant mutiny portray film mutiny long time preparation occur sooner desire obvious reason character place leader mutiny author focus much attention sailor tragic figure many way goal mutiny transcended simple humiliation freeing sailor common barbarity enforce naval life person gift oratory hop free nation end dream end realize downfall author make note doubt sailor please soviet system follow monarchy seem nothing move oppressive system certainly agree difficulty fault author structure familiar culture east european name hard keep track various name become handicap especially audio version text name audio reading excellent track minute interval allow easy stop find place occasional rewinding purchase use terrific price come reasonable amount time package story well write little know forgotten part problem whoever proof good job author solid job actually happen sailor mutiny russian initial revolt sailor stink meat purser buy refused eat captain insist cause shot toss city also revolt due poor governance city corrupt city official pull port mutiny rebellion cause deep concern come tyrant demanding hanging rebellious sailor sail cause consternation russian official sailor eventually dock open sea cock flee solid job detail mutiny cause get feel day day struggle sailor mutiny take good solid", "genres": ["History"], "summary": "The true story of the deadliest naval mutiny in history\r\n\r\nIn 1905, after being served rancid meat, more than seven hundred Russian sailors mutinied against their officers aboard what was then one of the most powerful battleships in the world. Theirs was a life barely worth living -- a life of hard labor and bitter oppression, an existence, in its hopelessness and injustice, not unlike that of most of the working class in Russia at the time. Certainly their rebellion came as no surprise. Still, against any reasonable odds of success, the sailors-turned-revolutionaries, led by the charismatic firebrand Matyushenko, risked their lives to take control of the ship and fly the red flag of revolution. What followed was a violent port-to-port chase that spanned eleven harrowing days and came to symbolize the Russian revolution itself.\r\n\r\nA pulse-quickening story that alternates between the opulent court of Nicholas II and the razor’s-edge tension aboard the Potemkin, Red Mutiny is a tale threaded with terrific adventure, epic naval battles, heroic sacrifices, treachery, bloodlust, and a rallying cry of freedom that would steer the course of the twentieth century. It is also a fine work of scholarship that draws for the first time on the Soviet archives to shed new light on this seminal event in Russian and naval history.\r\n\r\nFor readers of Tom Clancy's Hunt for Red October and Nathaniel Philbrick's In the Heart of the Sea, Neal Bascomb's gripping adventure at sea is the story of courage, the power of ideas, and the fragile nature of alliance.", "asin": "0547053525", "rank": "514013", "city": "Odessa", "image": "https://images-na.ssl-images-amazon.com/images/I/418KMSLRbWL.jpg", "country": "Ukraine", "story_arc": ["Tragedy", "Things only get worse"]}