{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 35, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "Didn't hold my interest."}, {"review_sentiment": 4.0, "review_text": "I'd missed this, somehow - enjoyable, but I like Auchincloss very much, so that's predictable, I guess."}, {"review_sentiment": 5.0, "review_text": "Excellent edition with no markings and clean pages"}, {"review_sentiment": 5.0, "review_text": "This book told us so much about Mr Auchincloss personally and many details of his formative years. For those like myself who have read most of his books it was like reading a last letter from an old friend who died. You want to cling to it because you know it is the last"}, {"review_sentiment": 2.0, "review_text": "Mildly interesting. Louis Auchincloss claims little interest in class or snobbery, yet is preoccupied by both.  No one escapes definition through lineage. A slog, little humor, and snobbery..as in sans nobilis."}, {"review_sentiment": 3.0, "review_text": "The grammar was perfect, as was the sentence structure, but ultimately the book was boring. There were no insights into the man, or \"old New York\", which is a shame. It could have been a great book. He touched on some interesting topics: architecture, protocol, etc. but never went further with them. Alas."}, {"review_sentiment": 5.0, "review_text": "A brief, charming, honest, honorable book on a life seriously lived.  Auchincloss obviously prepared this book as a final gift to his readers, and it is a considerate gift."}, {"review_sentiment": 2.0, "review_text": "I don't know what I expected, but I did not particularly care for this book.  I found the author an unsympathetic figure and his views on society dated and distasteful. I guess the title \"A Voice From Old New York\" should have been my first clue.  If you are terribly interested in New York's old families, you might enjoy this book."}, {"review_sentiment": 2.0, "review_text": "Many memoirs being written today are so unashamedly self-serving; emotionally needy or greedy for attention, that it was refreshing to find one written by a man who states that his record of his youth WON'T be a record of his \"terrors and complaints.\"Yet on the other hand ... life and its joys or sorrows, written (or is it, experienced?) at a *distance* - a distance which Mr. Auchincloss seems to have cultivated - seems to me to have jelled him, and his writing (at least in this memoir) into something less than human.Maybe \"less than human\" is too harsh.  I don't *hate* this memoir.  I don't dislike Mr. Auchincloss (somehow it seems too familiar to call him Louis).  And I liked learning about his (pretty much vanished) social class, life and times, as far as the reader does learn about these matters.  But it's like he's channeled Edith Wharton before she had her relationship with Morton Fullerton, or Henry James doing - well, whatever it was that Henry James did when he wasn't writing.  Except that Mr. Auchincloss doesn't seem to have been so much sexually frustrated in his youth as - neutered, or maybe muffled, would be the better word?  Mr. Auchincloss is like a Newland Archer who never met Ellen Olenska. He was buttoned up at birth, BY his birthright as \"old New York,\" and he never unbuttoned.And I don't mean just sexually.  One wonders if he ever laughed heartily at something utterly foolish.  Or got rip-roaring, happily drunk and sang a song at the top of lungs.  Or panted over a Playboy centerfold.  Or heard his firstborn child's cry and cried himself.He gives us bits and pieces of disturbing information:  As a child, he stole things for a period of time, until he was caught.  He destroyed a playhouse that was treasured by the parents of the dead girl who owned it (why, he can't, or won't, say).  He had a fear of nakedness.  He was bullied, actually quite severely, at Groton.  His sister and his father both suffered, to the point of withdrawal from their family, from depression.  But what's even more disturbing is that none of these incidents are explored for context - why did they occur?  What effect did they really have?  They are brought up, out, and then - ignored.  But they still exist, like vomit staining the tennis court.Money: in Mr. Auchincloss's case always plenty of it, gave a protective veneer from reality; from trials, errors and contests, and it seems to be the root of Mr. Auchincloss's un-lived existence.  Of course, many would respond that no doubt Mr. Auchincloss DID enjoy his life, actually quite a lot - and that he had lively, comic, fearful and even disgusting experiences, some of which he talks about here, and talks about in an interesting way.  But it's all so *observed*.  It's all tidy, or at least, all tidied-up.  There's no, how can I say this - emotional expression about what he's experiencing, or rather, what he's allowing himself to tell us, in these measured teaspoons.  In the long run, and in a memoir of a life, this is just as bad as going overboard with emotion.It might be asking too much of someone who came from such a rarified, stratified, veneered quadrangle of a class of people to live his life and/or write about himself in ways that would be utterly foreign to him ... it's like asking Copland to create music  like Mozart's.  I'm admittedly from an entirely different strata of society from this gentleman, but while I often wish I had the money he seems always to have taken for granted, I don't wish I had his life.  It's not enough to love Shakespeare and Racine, Wharton and James.  It's not enough to have the ability to write sentences that are calibrated in perfectly grammatical cadence.  Don't the writers I mentioned also say to the reader:  Hey! Wake up! You better reach out and take life and live it, in order to write about it meaningfully, and lastingly!  Didn't Mr. Auchincloss get that memo?  Otherwise, you end up being voted a Living Landmark by the New York Landmarks Conservancy, and you take pride in that.Oh, and as for \"glimpses of Jacqueline Onassis\" that the cover blurb promises this memoir will provide?  It's one brief glimpse, about her broken engagement to a New Yorker who may well have been a man very much like Louis Auchincloss.  Jackie, for all your trauma, what a lucky escape you had."}, {"review_sentiment": 3.0, "review_text": "a voice from old new york a memoir of my youth by Louis Auchinclosssummary of his life, mostly in ny but in newport, RI and to Jackie O, along the maine coast at Mount Desert Island is the place i found that I liked the best."}]}, "authors": ["Louis Auchincloss"], "isbn": "0547341539", "longitude": 0.0, "periods": ["1900s"], "title": "A Voice from Old New York: A Memoir of My Youth", "word_cloud": "interest miss somehow enjoyable like auchincloss much predictable guess excellent edition marking clean page tell much personally many detail formative year read last letter friend die want cling last mildly interesting claim little interest class snobbery yet preoccupy one escape definition lineage slog little humor sans nobilis grammar perfect sentence structure ultimately bore insight man shame great touch interest topic architecture protocol never go brief charming honest honorable life seriously live obviously prepare final gift reader considerate gift know expect particularly care find author unsympathetic figure view society date distasteful guess title first clue terribly interested family many memoir write today unashamedly emotionally needy greedy attention refresh find write man state record record terror complaint hand life joy sorrow write experienced distance seem cultivate seem jelled write least something le le human harsh dislike somehow seem familiar call like learn pretty much vanish social class life time far learn matter channel relationship well whatever write seem much sexually frustrate neutered maybe muffle word never meet button birth birthright never mean sexually wonder ever laugh heartily something utterly foolish get happily drunk sang song top lung pant centerfold hear firstborn child cry cry give bit piece disturb information child stole thing period time catch destroy playhouse treasure parent dead girl own fear bully actually quite severely sister father suffer point withdrawal family depression even disturb none incident explore context effect really bring ignore still exist vomit stain tennis case always plenty give protective veneer reality trial error contest seem root existence course many doubt life actually quite lot lively comic fearful even disgust experience talk talk interesting way tidy least say emotional expression experience rather allow measured teaspoon long run life bad go overboard ask much someone come ratify stratify veneered quadrangle class people live life write way utterly foreign ask create music admittedly entirely different stratum society gentleman often wish money seem always take grant wish life enough love enough ability write sentence calibrate perfectly grammatical cadence writer mention also say better take life live order meaningfully lastingly memo end vote pride glimpse cover blurb promise brief glimpse break engagement well man much trauma lucky escape york life mostly ny newport maine coast place find like best", "genres": ["Memoir"], "summary": "At the time of his death, Louis Auchincloss—enemy of bores, self-pity, and gossip less than fresh—had just finished taking on a subject he had long avoided: himself. His memoir confirms that, despite the spark of his fiction, Auchincloss himself was the most entertaining character he has created. \r\n\r\nNo traitor to his class but occasionally its critic, he returns us to his Society which was, he maintains, less interesting than its members admitted. You may differ as he unfurls his life with dignity, summoning his family (particularly his father who suffered from depression and forgave him for hating sports) and intimates. Brooke Astor and her circle are here, along with glimpses of Jacqueline Onassis. Most memorable, though, is his way with those outside the salon: the cranky maid; the maiden aunt, perpetually out of place; the less-than-well-born boy who threw himself from a window over a woman and a man. \r\n\r\nHere is Auchincloss, an American master, being Auchincloss, a rare eye, a generous and lively spirit to the end.", "asin": "0547341539", "rank": "376898", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51oqnnGz-cL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}