{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 2545, "rating": 3.5, "reviews": [{"review_sentiment": 3.0, "review_text": "What a strange journey. Typically opaque, as per PKD's signature, yet unfortunately devoid of any flutter of narrative urgency. Characters are scattered, gathered and then dispersed for no logical reason. One can't help but think that PKD intends to reflect on the burden and fluidity of time in relation to history. But his voice comes across as overly preachy, which is unlike PKD at all. A fascinating book of ideas, surely. For a more coherent and potent narrative work, please refer to Amazon's underrated TV adaptation."}, {"review_sentiment": 5.0, "review_text": "Book came in good condition. As for the contents, I wasn't a huge fan of the story. But it was still interesting to me. Anyone who has an interest in science fiction, history, and politics - this book would be great for you!"}, {"review_sentiment": 3.0, "review_text": "To see Wegener, a blue eyed blond, tell an \"Aryan\" that he's Jewish but had a nose job and changed the color of his skin and eyes is beyond ridiculous. My brother-in-law is Jewish, he has blue eyes, blond hair, fair skin, he looks like a Nazi propaganda poster. So I can't believe Dick believes that Jews look a certain way. If they did, why did Hitler make them wear a Jewish star? With black people, brown Hispanics, Asians, you don't have to make them wear anything, you know what the are the minute you see them."}, {"review_sentiment": 5.0, "review_text": "Great quality... My daughter loves it."}, {"review_sentiment": 3.0, "review_text": "Philip K. Dick’s books make better movies and TV shows than they do as books. It’s an interesting premise that isn’t completed well"}, {"review_sentiment": 4.0, "review_text": "It was an interesting read but for the first time I have to say the TV show (or movie) is better than the book!"}, {"review_sentiment": 4.0, "review_text": "This was my first venture into the PKD universe and I have to say that I thoroughly enjoyed this book. The book describes an alternate history in which the Axis Powers are victorious over the Allies in World War II and Nazi Germany and Imperial Japan are the dominant world superpowers. It was definitely ahead of its time when first published in 1962 and won the 1963 Hugo Award for Best Novel.The book is set in a 1962 divided United States, with Japan controlling the western states and Nazi Germany the east. Dick uses multiple loosely connected characters and intertwined subplots to explore racism, authoritarianism and disillusionment, resulting in a classic “what-if scenario” novel; we meet a subservient antiques dealer, a jewish craftsman, his judo instructor wife who has walked out on him and an ethical Japanese civil servant. Many of the principle characters read a novel within the novel, \"The Grasshopper Lies Heavy\", which describes an opposite alternate history in which the Allies do in fact win the war, but with a different final outcome to actual history; the victorious British Empire becomes more racist and ends up in a cold war with the US. In addition, the characters make critical decisions by consulting the \"I Ching\", an ancient divination text which professes to guide believers along the right path.This book raises a lot of questions and unless you’re a follower of the \"I Ching\", will leave you looking for answers; but if you enjoy a good story with a philosophical theme, then read this book."}, {"review_sentiment": 4.0, "review_text": "The object of this is beyond me.  Sorry, a deep writing must also have a deep reader. I have not done so. I'll read it again right away. Please forgive.  I need a few other books. Is there a reader's group where I  can discuss it with others?  Getting back to it,  BYE.  LED Bolton  Please respond!"}, {"review_sentiment": 3.0, "review_text": "While in theory this is a great story, the writing, and in particular the characters are not well developed. I actually ended up preferring the TV show, as they did a much better job of making realistic characters."}, {"review_sentiment": 5.0, "review_text": "Same concept as shoe but different actual story line in this work. I liked it but it begs for a sequel"}]}, "authors": ["Philip K. Dick"], "isbn": "0547572484", "longitude": -122.4192363, "periods": ["1900s"], "title": "The Man in the High Castle", "word_cloud": "strange journey opaque signature yet unfortunately devoid flutter narrative urgency scatter gather dispersed logical reason intend reflect burden fluidity time relation history voice come overly preachy fascinate idea surely coherent potent narrative work please underrated tv adaptation come good condition content huge fan story still interest interest science fiction history politics great blue eye blond tell nose job change color skin eye ridiculous blue eye blond hair fair skin look nazi propaganda poster believe look certain way make wear jewish star black people make wear anything know minute see quality daughter love make better movie tv show interesting premise complete well interest first time say tv show movie better first venture universe say thoroughly enjoy describes alternate history victorious dominant world superpower definitely ahead time first publish set divide control western state east use multiple loosely connected character intertwine subplots explore racism authoritarianism disillusionment result classic scenario meet subservient antique dealer jewish craftsman judo instructor wife walk ethical japanese civil servant many principle character describe opposite alternate history fact win war different final outcome actual history victorious british becomes racist end cold war addition character make critical decision consult chung ancient divination text profess guide believer along right raise lot question follower chung leave look answer enjoy good story philosophical theme object deep writing also do right away forgive need be group discuss others get back respond theory great story write particular character well develop actually end prefer tv show much better job make realistic character concept shoe different actual story line work like begs sequel", "genres": ["Fiction & Literature", "Mystery & Suspense", "Science Fiction"], "summary": "“The single most resonant and carefully imagined book of Dick’s career.” New York Times\r\n \r\nIt’s America in 1962. Slavery is legal once again. The few Jews who still survive hide under assumed names. In San Francisco, the I Ching is as common as the Yellow Pages. All because some twenty years earlier the United States lost a war—and is now occupied by Nazi Germany and Japan.\r\n \r\nThis harrowing, Hugo Award–winning novel is the work that established Philip K. Dick as an innovator in science fiction while breaking the barrier between science fiction and the serious novel of ideas. In it Dick offers a haunting vision of history as a nightmare from which it may just be possible to wake.\r\n \r\nDick's Hugo Award-winning 1962 alternative history considers the question of what would have happened if the Allied Powers had lost WWII. Some 20 years after that loss, the United States and much of the world has now been split between Japan and Germany, the major hegemonic states. But the tension between these two powers is mounting, and this stress is playing out in the western U.S. \r\n", "asin": "0547572484", "rank": "4310", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/41EONpW2m9L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}