{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 339, "rating": 3.3, "reviews": [{"review_sentiment": 5.0, "review_text": "This review contains a bit about the current state of free speech and our willingness to accept every voice in the argument, rarely considering the motivation of said voices. If there are political views expressed in this review, they are informed by The Prague Cemetery, Umberto Eco's novel treatment of the development of perhaps the most evil piece of fiction ever concocted.The Prague Cemetery by Umberto Eco is the perfect type of book to read with ready access to the internet. In fact, I can't imagine reading this book without the instantaneous aid of online research facilities. Using online resources, the reader can begin delving into deeper source material to discover that this twisted tale of political intrigue and espionage is based on historical facts. Perhaps knowing that fact up front, will keep some readers going through the long slog of the three part narrative.The original editions of the antisemitic work referenced throughout The Prague Cemetery, were indeed written by the characters mentioned here. I don't know enough of the history to say where truth ends and fiction begins, but that blurring of the historical in the novel is part of what makes Umberto Eco's writing such an excellent introduction into his semiotics and philosophy.Presciently, Eco stated before his death that social media was being misused and he saw it as a growing concern. The fact that demagogues now have an open platform to share their views, somehow makes the fact that Henry Ford paid to have half-a-million copies of the worst type of hate literature printed, pale in significance. The book Ford had printed, and its history as a 19th century sensationalist phenomenon, led directly to the \"final solution\". That is the book at the very core of this novel. A forgery protected by \"free speech\" and often quoted by Hitler in \"Mein Kampf\".Where are we headed today?“Social media gives legions of idiots the right to speak when they once only spoke at a bar after a glass of wine, without harming the community. Then they were quickly silenced, but now they have the same right to speak as a Nobel Prize winner. It’s the invasion of the idiots.” - Umberto EcoDisinformation once promoted in print by an antisemitic American industrialist, can now be spread much more widely and effectively. At the dawning of the age of the internet troll Eco produced this novel on the anti-intellectual roots of 20th century antisemitism. Can it do anything to stop the tsunami of fear and hate mongering online today? We now live in the era of the unabashed, unrepentant troll, who feels no compunction to seek the truth, nor desire to let thinking interfere with his world view. And if we, the readers of Umberto Eco, complain that the views expressed by the trolls are nothing more than the warmed over remnants of 19th century charlatans, we are accused of attacking \"free speech\" along with the 21st century freedom to hate on a grand scale.How will we teach the coming generations any truth, when it appears that their ideas and views of the world are being misshapen daily by those willing to mix a specific dose of hatred with a calculated misspoken half truth, or as it is more simply referred to: lies. We can no longer call out our politicians as liars. For some reason, now, when people misquote facts, embellish lies with greater lies and sell it all -- to a public gleefully willing to buy it at exorbitant rates -- those who oppose the shilling hucksterism of populist demagogues are accused as socialists, communists, or worst of all: intellectuals. This is eerily similar to the world described in The Prague Cemetery.Intellectuals faced with a crisis of believability where science, facts and historical data are concerned, are forced to confront a world safe in its own truthiness. All of these themes are presented in this novel that could be describing our own future, by uncovering our very real past. Accepting the views of the hucksters and throwing the expeditious criminals into jail has real consequences for a society. If we choose to disentangle ourselves from the hard truths that bind us together, we may find that we have set sail adrift on a current of half truths that can only lead to tragedy.The fact that the ultimate goal of the actual work being written here in Eco's novel, is considered by almost every author as secondary to the will for political power, money and greed certainly doesn't portend well for a society built on internet hate-bait, anger-click, yellow churnalism that seeks to maximize revenue, casually disregarding the facts. The problem is: Truthiness has never set anyone free."}, {"review_sentiment": 4.0, "review_text": "The Prague Cemetery made me google all the characters, the conflicts of the time and even the streets where they lived and fought. I appreciate an historical fiction that compels me to verify it's validity. Along the way, I learn about this period of time.Eco entwines a mystery into this 19th century Euro history with a fictional character(s) who disintegrates through the story.The book could have been shorter but for some absurdly long rantings where I had to jump over pages of it. Overall, it was worth the read because I got a clearer understanding of the time and how it relates to what I see happening today."}, {"review_sentiment": 5.0, "review_text": "I know it the scholarly thing to give it a rave review, but I found myself laboring to finish it at times. As a fan of Evo's work, I was expecting something that did not require such an effort to stay with."}, {"review_sentiment": 5.0, "review_text": "Excellent book!"}, {"review_sentiment": 5.0, "review_text": "A book I will read again"}, {"review_sentiment": 5.0, "review_text": "Eco is an acquired taste, but not for the faint of heart nor the faint of mind.His fundamental premise that reality constructed can be as dangerous as unconstructed reality gives one pause.It is one of his major themes.  The troubling part of this book is that it is based, more so than his other fictional works, on verifiable historical facts.John T. Kuehn, Ph.D.Past Major General Willaim Stofft Chair for Historical ResearchThe US Army Command and General Staff College"}, {"review_sentiment": 2.0, "review_text": "The writing style of this book is excellent and pulls you right in. Eco is definitely a master of holding one's suspense in a novel. But I found Eco generally unsuccessful at getting inside the mind of a conspiracy theorist. Eco's politics are fairly bland and he doesn't seem privy to the type of worldview that would allow you to really step inside the protagonist's shoes. All in all, the book is worth a look for the first 30 pages or so, but I found it unconvincing and lost interest partway through."}, {"review_sentiment": 5.0, "review_text": "Thank you"}, {"review_sentiment": 1.0, "review_text": "Given the reknown and accolades, I owed it to myself to give Umberto Eco a read.  Perhaps this was not a good first choice (I will try another), but I found _The Prague Cemetery_ to be confusing, tedious and a struggle to stay interested.  I rarely quit reading a book mid-way through, but I did so in this case.The book is a series of diary entries, the identity of the protagonist is difficult to determine: he either suffers from multiple personality disorder or is merely having a laugh at our expense - it was never clear to me (even after reading the first 120 pages).  To complicate matters further, Eco jumps around in time, adding a whole other level of confusion and mystery to who our narrator is and what he's on about.In spite of my struggles and ultimate failure to finish the book, it is clearly apparent that Eco is a gifted writer.  The voice(s) of Simonini are witty - funny, even, as he is abrasive, cantankerous, deeply mysogynisitc and prejudiced against all manner of people from the French to the Freemasons to Jesuitis - yet in spite of these repugnant character traits, he is not without some redeeming features.  This is no easy feat for a writer to pull off, and Eco does so masterfully.I am disappointed in my choice, but will absolutely give Eco another chance.  It seems, sadly, that _The Prague Cemetery_ was just not a good choice for an introduction to Eco's writing."}, {"review_sentiment": 4.0, "review_text": "I know it the scholarly thing to give it a rave review, but I found myself laboring to finish it at times. As a fan of Evo's work, I was expecting something that did not require such an effort to stay with."}]}, "authors": ["Umberto Eco"], "isbn": "0547577532", "longitude": 2.3514992, "periods": ["1800s", "Recent Releases"], "title": "The Prague Cemetery", "word_cloud": "review contain bit current state free speech willingness voice argument rarely consider motivation say voice political view express review inform treatment development perhaps evil piece fiction ever perfect type ready access internet fact read instantaneous aid online research facility online resource begin delve deeper source material discover twisted tale political intrigue espionage base historical fact perhaps know fact front keep reader go long slog part original edition antisemitic work reference indeed write character mention know enough history say truth end fiction begin blur historical part make write excellent introduction semiotics state death social medium misuse saw grow concern fact demagogues open platform share view somehow make fact pay copy worst type hate literature print pale significance print history century sensationalist phenomenon lead directly final solution core forgery protect free speech often quote head today medium give legion idiot right speak spoke bar glass wine harm community then quickly silence right speak winner invasion promote print antisemitic american industrialist spread much widely effectively dawn age internet troll produce root century antisemitism anything stop tsunami fear hate monger online today live era unabashed unrepentant troll feel compunction seek truth desire let think interfere world view reader complain view express troll nothing warm remnant century charlatan accuse attack free speech century freedom hate grand teach come generation truth appear idea view world misshapen daily willing mix specific dose hatred calculated misspoken half truth simply refer lie longer politician liar reason people misquote fact embellish lie greater lie sell public gleefully willing buy exorbitant rate oppose shill hucksterism populist demagogue accuse socialist communist worst intellectual eerily similar world describe face crisis believability science fact historical data concern force confront world safe truthiness theme present future uncover real accept view huckster throw expeditious criminal jail real consequence society choose hard truth bind together set sail adrift current half truth lead fact ultimate goal actual work write consider almost author secondary political power money greed certainly portend well society build internet yellow journalism seek revenue casually disregard facts problem never set anyone free make google character conflict time even street live fought appreciate historical fiction compels verify validity way learn period entwines mystery century history fictional character disintegrates absurdly long ranting jump page worth get clearer understanding time relate see happen today know scholarly thing give rave review find labor finish time fan work expect something require effort stay excellent acquire taste faint heart faint fundamental premise reality construct dangerous unreconstructed reality give major theme trouble part base fictional work verifiable historical writing style excellent pull right definitely master hold suspense find generally unsuccessful get mind conspiracy theorist politics fairly bland seem privy type worldview really inside protagonist shoe worth look first page find unconvincing lose interest partway thank give renown accolade owe give perhaps good first choice try find confuse tedious struggle stay interested rarely quit reading series diary entry identity protagonist difficult determine suffers multiple personality disorder merely laugh expense never clear even read first page matter jump time add whole level confusion mystery narrator spite struggle ultimate failure clearly apparent gift writer voice witty funny even abrasive cantankerous deeply mysogynisitc prejudice manner people french yet spite repugnant character trait redeem feature easy feat writer pull disappointed choice absolutely give chance seem sadly good choice introduction writing know scholarly thing give rave review find labor finish time fan work expect something require effort stay", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "“Vintage Eco . . . the book is a triumph.” – New York Review of Books\r\n\r\nNineteenth-century Europe—from Turin to Prague to Paris—abounds with the ghastly and the mysterious. Jesuits plot against Freemasons. Italian republicans strangle priests with their own intestines. French criminals plan bombings by day and celebrate Black Masses at night. Every nation has its own secret service, perpetrating forgeries, plots, and massacres. Conspiracies rule history. From the unification of Italy to the Paris Commune to the Dreyfus Affair to The Protocols of the Elders of Zion, Europe is in tumult and everyone needs a scapegoat. But what if, behind all of these conspiracies, both real and imagined, lay one lone man? \r\n\r\n“Choreographed by a truth that is itself so strange a novelist need hardly expand on it to produce a wondrous tale . . . Eco is to be applauded for bringing this stranger-than-fiction truth vividly to life.”  The New York Times\r\n\r\n\"I find this book fascinating, perhaps the best Eco has written in years.\" Huffington Post\r\n", "asin": "0547577532", "rank": "496773", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41y-tNcGRHL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}