{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 226, "rating": 4.5, "reviews": [{"review_sentiment": 2.0, "review_text": "This is probably an excellent book, but it was too violent for me to read, stopped after the first or second chapter. It is a reminder that Franco was worse or as bad as Hitler."}, {"review_sentiment": 5.0, "review_text": "Hochschild is an incredibly talented historical writer. He has a way of taking historical documents and weaving them into gripping, engaging stories. His book on the Spanish Civil War is engaging and thought provoking. I couldn't put it down."}, {"review_sentiment": 5.0, "review_text": "While being quite \"factual\", Spain in our Hearts reads like a novel. A wonderful book that I will read again. I just hope that the present situation in Catalonia is not the beginnings of another civil war for Spain."}, {"review_sentiment": 4.0, "review_text": "Spain in Our Hearts is the story of a forgotten civil war in Spain. It is a forgotten civil war because it was eclipsed by the brutality and violence of World War II. The principal characters of the story are the groups of Americans who fought on both the Nationalist and Republican sides over the future of Spain, even as the American government either appeared indifferent to the war in Spain or struggled to formulate a policy that was coherent due to the complications of World War II. But still people died fighting a war in the shadows of a larger conflict.Hochschild really brings the human side of the conflict home as the reader is able to feel the loved ones, friends, and fellow soldiers who were lost. It really gives a reader the extra jolt that says “this conflict should’ve mattered more.” I would suggest that if it had been just a few years later it might have but the geopolitical context wasn’t there for it to matter.With a unique blend of human intrigue and geopolitical frustrations, Spain in Our Hearts is a moving and highly readable account of that other war of the 1930s and 40s."}, {"review_sentiment": 5.0, "review_text": "Very well written and hard hitting.  It is a story that everyone should read as dictators like the murderous Franco can be stopped early on before something horrific, like the Spanish Civil War, happens."}, {"review_sentiment": 4.0, "review_text": "Fascinating book and full of important history!"}, {"review_sentiment": 4.0, "review_text": "I love readings with global facts."}, {"review_sentiment": 5.0, "review_text": "Spain in our Hearts: Americans in the Spanish Civil War, 1936-1839, by Adam Hochschild.One seasoned reviewer of this book called it very hard to read because of the painful memories brought up, knowing well the agony of Spain, and what it led to. This is precisely why I feel it needs to be read. Adam Hochschild is a masterful writer, able to convey in vivid, dramatic terms, the achingly human aspects of this and every war. For readers who know something about the Spanish Civil War, perhaps broad outlines, this book will present the details, the Americans who, for various reasons, went to Spain and entered into the war alongside native Spaniards. All were willing to put their ideals into action, willing in many cases to die for them. American readers will see their own novelist Ernest Hemingway in a way that even his own books do not quite present. They will see John Dos Passos as a volunteer who cast his lot with the freedom fighters. And they will become acquainted with other, less well-known to the general public, but Americans who went to Spain and performed heroic deeds. Among the three thousand Americans who fought in this war, Hochschild selects some dozen volunteers to follow, some to heartbreaking ends. This war between fascism and democracy is vitally important today as we come to a time in our lives when the global perspective is critical in our own struggles with democracy. Hochschild has given us a powerful document to increase our understanding of this important chapter in history."}, {"review_sentiment": 5.0, "review_text": "Growing up I was never really taught about the Spanish Civil War. What I learned fits into one sentence: \"Franco defeated the republicans and became a dictator\".  This book is so well written and fills such a big gap in what most people know about the wars of the 20th century. This book is a must!"}, {"review_sentiment": 2.0, "review_text": "I have not purchased the book but I am entitled still, I thinck, to give my well founded opinion on the Spanish Civil War. My uncle José, my father's younger brother, died at 21 defending Belchite from the anarchists, socialists and communists of the International Brigades. He was a volunteer as was also an Argentinian  fellow volunteer who died with him in September 5, 1937.  With so much propaganda for so many years, most peopple are not aware that in Spain,from February to July 1936, after a fraudulent general elections, the Popular Front Government  headed by Largo Caballero was ready to make the country, with help of Stalin and others, a totalitarian Soviet Republic.Those who rised against the Popular Front raised for their individual freedoms as well as for their religious liberty and for the integrity of their country. In 1939, one million two hundred thousand men, well commanded by Franco, defeated one million seven hundred thousand, commanded communists and fellow travelers. Thre konowlegeable historians such the French historians who authoredf \"The Black Book of Communism\" estimate in about one and a half million the victims after the war if it had been won by the Popular Front, ten times more than the actual victims in 1939-42. I hope the author of this book would have not desired that to occur."}]}, "authors": ["Adam Hochschild"], "isbn": "0547973187", "longitude": 2.1774322, "periods": ["1900s"], "title": "Spain in Our Hearts: Americans in the Spanish Civil War, 1936-1939", "word_cloud": "probably excellent violent stop first second chapter reminder worse bad incredibly talented historical writer way take historical document weave grip engage story engage think provoke quite factual read wonderful hope present situation beginnings war story forget war forget war eclipse brutality violence principal character story group fought side future even american government either appear indifferent war struggle formulate policy coherent due complication still people die fight war shadow larger really bring human side conflict home able feel love one friend fellow soldier lose really give extra jolt say conflict matter year later context unique blend human intrigue geopolitical frustration heart move highly readable account war very well write hard hit story everyone dictator murderous stop early something horrific happens fascinate full important history love reading global fact season reviewer call hard painful memory bring know well agony lead precisely feel need masterful writer able convey vivid dramatic term achingly human aspect war reader know something perhaps broad outline present detail various reason go enter war alongside native willing put ideal action willing many case die american reader see novelist way even quite present see volunteer cast lot freedom fighter acquainted le general public go perform heroic deed thousand fought war select dozen volunteer follow heartbreaking end war fascism democracy vitally important today come time life global perspective critical struggle democracy give powerful document increase understand important chapter history grow never really taught learn fit sentence defeat become dictator well write fill big gap people know war century purchase entitle still think give well found opinion uncle father younger brother die defend anarchist socialists communist volunteer also argentinian fellow volunteer die much propaganda many year people aware fraudulent general election head ready make country help others totalitarian sire raise individual freedom well religious liberty integrity country thousand men well command defeat thousand command communist fellow traveler knowledgeable historian french historian author estimate half victim war ten time actual victim hope author occur", "genres": ["History", "Social & Cultural Studies", "WWII", "Politics", "Spanish Civil War"], "summary": "From the acclaimed, best-selling author Adam Hochschild, a sweeping history of the Spanish Civil War, told through a dozen characters, including Ernest Hemingway and George Orwell: a tale of idealism, heartbreaking suffering, and a noble cause that failed\r\n\r\nFor three crucial years in the 1930s, the Spanish Civil War dominated headlines in America and around the world, as volunteers flooded to Spain to help its democratic government fight off a fascist uprising led by Francisco Franco and aided by Hitler and Mussolini. Today we're accustomed to remembering the war through Hemingway’s For Whom the Bell Tolls and Robert Capa’s photographs. But Adam Hochschild has discovered some less familiar yet far more compelling characters who reveal the full tragedy and importance of the war: a fiery nineteen-year-old Kentucky woman who went to wartime Spain on her honeymoon, a Swarthmore College senior who was the first American casualty in the battle for Madrid, a pair of fiercely partisan, rivalrous New York Times reporters who covered the war from opposites sides, and a swashbuckling Texas oilman with Nazi sympathies who sold Franco almost all his oil — at reduced prices, and on credit. \r\n  \r\nIt was in many ways the opening battle of World War II, and we still have much to learn from it. Spain in Our Hearts is Adam Hochschild at his very best.", "asin": "0547973187", "rank": "99710", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51hEV5ez5ZL.jpg", "country": "Spain", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}