{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 229, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "I liked how it explored different characteristics that even I as a woman can improve on. As I read the beginning of the book I kept seeing myself in Cassie. Especially after being in a long dating relationship of four years. I felt a bit lost. As Cassie changed I felt like I was taking those steps with her. I became more confident in myself, more fearless, more outgoing! I am doing things now that I never would've done about a month ago."}, {"review_sentiment": 4.0, "review_text": "Good read"}, {"review_sentiment": 4.0, "review_text": "Giving this a \"good\" for what it offers to readers who'll identify strongly with the heroine, and be honestly intrigued by her forward motion in things sexual and things self-esteem. Also rated \"good\" as apposed to the two stars i'd give that gray shaded, more contrived, poorly written inspiration for this trilogy.  My personal rating is \"it's okay,\" since I found her plotline - and the erotic experiences - too predictable."}, {"review_sentiment": 5.0, "review_text": "I read this book in one afternoon. I could not put it down!  Never underestimate the power of a woman!"}, {"review_sentiment": 5.0, "review_text": "Love this book!  Can anyone tell me if there is a real life S.E.C.R.E.T?? 😉"}, {"review_sentiment": 2.0, "review_text": "It was okay"}, {"review_sentiment": 4.0, "review_text": "it was good"}, {"review_sentiment": 4.0, "review_text": "My neighbor passed this book along to me a couple of weeks ago and I finally started reading it and finished in a day. I liked it! I cannot wait to get the 2nd and 3rd books! This book has a lot of qualities that I look for in a book. I love the description of scenarios so that I can really picture them in my head. I liked the sarcasm and big personality of the characters...Cassie was a wonderful character. This book has me wishing S.E.C.R.E.T was real. I would definitely do something like this. I love how Cassie grew to love herself and be comfortable/confident in her own skin...which is what I need to learn how to do for myself. Great job to the author!"}, {"review_sentiment": 5.0, "review_text": "Wish there was more in this series as i just loved the storyline  n the way it all tied in together, it still could of been taken so much further, in many other angles n storylines. But very well written, i just loved it! Well done! 😊"}, {"review_sentiment": 5.0, "review_text": "Was very empowering for women that aren't confident with their bodies, the idea behind the organisation was great in helping these women to reach their potential n not necessarily just in a sexual way.It wasn't all just sex sex sex, it was nice to read an everyday storyline to go along with it.I thought it was great n can't wait to read the next book in the series 😊"}]}, "authors": ["L. MARI ADELINE"], "isbn": "0552169390", "longitude": -90.0701156, "periods": ["2000s", "Recent Releases"], "title": "S.E.C.R.E.T.", "word_cloud": "like explored different characteristic even woman begin keep see long date relationship year felt bit lose change felt take step become confident fearless outgo thing never do month good give good offer reader identify strongly heroine honestly intrigue forward motion thing sexual thing also rat good appose star give gray shade contrive poorly write inspiration trilogy personal rating okay find plot line erotic experience predictable afternoon underestimate power woman anyone real life good neighbor pass couple week ago finally start read finish day like wait lot qualities look love description scenario really picture head like sarcasm big personality character wonderful character wish real definitely something love grow skin need learn job author wish series love story line n way tie together still take much many angle n story lines well write love do empower woman confident body idea organization great help woman reach potential n necessarily sexual sex sex sex nice everyday story line go along thought great n next series", "genres": ["Fiction & Literature", "Erotica"], "summary": "Book 1/3 in the Secret Trilogy Series\r\n\r\nNo judgments. No limits. No shame.\r\n \r\nCassie Robichaud’s life is filled with regret and loneliness after the death of her husband. She waits tables at the rundown Café Rose in New Orleans, and every night she heads home to her solitary one-bedroom apartment. But when she discovers a notebook left behind by a mysterious woman at the café, Cassie’s world is forever changed. \r\n\r\nThe notebook’s stunningly explicit confessions shock and fascinate Cassie, and eventually lead her to S∙E∙C∙R∙E∙T, an underground society dedicated to helping women realize their wildest, most intimate sexual fantasies. Cassie soon immerses herself in an electrifying journey through a series of ten rapturous fantasies with gorgeous men who awaken and satisfy her like never before. \r\n\r\nAs she is set free from her inhibitions, she discovers a new confidence that transforms her, giving her the courage to live passionately. Equal parts enticing, liberating and emotionally powerful, S∙E∙C∙R∙E∙T is a world where fantasy becomes reality.", "asin": "0552169390", "rank": "2752793", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51REHVXMqhL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}