{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 27, "rating": 3.8, "reviews": [{"review_sentiment": 2.0, "review_text": "Having thoroughly enjoyed previous books by Ben Elton, this one disappointed me. As I read on, it was perversion upon perversion, upon perversion...with  quite a lot of violence included. For some reason I kept on reading, trying to find the murderer....but I can't say I enjoyed it...There was also quite a bit of self-hatred...I ended up feeling disgusted with myself for reading the darned bok."}, {"review_sentiment": 4.0, "review_text": "As any thriller book, this one as well is hard to let go, so you essentially read it in a single flow. At it would be a great 5 star book, if it wasn't for (1) somewhat predictable ending, by means of getting to identify who the main villain is, and (2) you expect nothing but a top quality from Ben Elton. It does however address one of the main problems in the modern society today, which we should be all more aware of, and take into consideration in  any aspects of our lives. At the end, it is a valuable read."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "Great work by Ben Elton as always. So good that I bought the kindle version despite having the paperback"}, {"review_sentiment": 4.0, "review_text": "Easy enjoyable holiday read. The usual successful Elton formula!"}, {"review_sentiment": 5.0, "review_text": "Only Ben Elton can take such a far flung concept and make it so dam plausible that you know somewhere down the line we will find out he was writing fiction. He immerses himself into his characters so indulgently that it feels as if the author surrenders  himself completely for their existence. A great imagination inspiring read with an un-guessable finale."}, {"review_sentiment": 5.0, "review_text": "great read like all of Ben Elton's books."}, {"review_sentiment": 4.0, "review_text": "A good \"holiday read\" beats a movie in so many ways.  A movie usually lasts a mere 2 hours, while a novel routinely quadruples the duration of pleasure.  A movie requires a fixed position in a fixed place, whereas a novel can be enjoyed in any and almost all locations with little or no technology support. Even the best movie CGI can't match vibrancy and emotional power of the imagination at work.  The novel is a exercise for developing the imagination.  The modern high impact movie generally succeeds in being literally stunning. It is often only after the movie, that we get to digest, speculate, review and use our imagination to pick holes in the universe that we passively experienced.  But most importantly, the movie usually only infers consciousness through the skills of the actors.  The dreaded voiceover is almost universally acknowledged as a last resort of a failing screenwriter.  On the other hand, the novel is usually built on the streams of consciousness of its participants.  Our perspective is bent and twisted by being inside their heads, often disagreeing with their narrative, and yet being powerless to influence their fate.  This, above all, is what makes the novel superior to film - emotionally, morally and intellectually.Ben Elton is no Graeme Greene, but even his completely predictable movie style serial killer plot is so much more powerful than the movie of the book (that is yet to be made) could ever be.  We enjoy Newson's witty self-depreciating commentary, even more than his bizarre and unbelievable indiscretions.Unfortunately, Elton bullies the novel completely out of shape to force his theme to the centre focus again and again. Elton shows no sympathy for his characters as they get slaughtered to keep the action moving.  The disgusting denouement is dramatic but also uncomfortably comic.A great \"holiday read\", but one that leaves a sense of dissatisfaction not dissimilar to that felt after a B grade movie."}, {"review_sentiment": 4.0, "review_text": "Be prepared for the gritty language, but I so enjoy how Elton satirizes the things we read, view, take-in - he's number one for me as a social commentator with a satiric twist."}, {"review_sentiment": 5.0, "review_text": "I love Ben Elton and this book proved to be no exception!  A highly enjoyable read - particularly for those with a predilection for 80s music!"}]}, "authors": ["Ben Elton"], "isbn": "0552771236", "longitude": -0.12574, "periods": ["2000s"], "title": "Past Mortem", "word_cloud": "have thoroughly enjoy previous disappoint perversion perversion perversion quite lot violence include reason keep read try find murderer enjoy also quite bit end feel disgusted reading darn bk thriller well hard let essentially single flow great somewhat predictable end mean get identify main villain expect nothing top quality however address main problem modern society today aware consideration aspect live end valuable excellent work always so good buy version paperback enjoyable holiday usual successful formula only far flung concept make dam plausible know somewhere line find write fiction immerse character indulgently feel author surrender completely existence great imagination inspire finale great good holiday beat movie many way movie usually last mere hour routinely quadruple duration pleasure movie require fix position fix place whereas enjoy almost location little technology support even best movie vibrancy emotional power imagination work exercise develop imagination modern high impact movie generally succeed literally stun often movie digest speculate review use imagination pick hole universe passively experienced importantly movie usually infer consciousness skill actors dreaded voice over almost universally acknowledge last resort fail screenwriter hand usually build stream consciousness participant perspective bent twist inside head often disagree narrative yet powerless influence fate make superior film emotionally morally even completely predictable movie style serial killer plot much powerful movie yet make ever enjoy witty commentary even bizarre unbelievable bully completely shape force theme center focus show sympathy character get slaughter action move disgust denouement dramatic also uncomfortably great holiday leave sense dissatisfaction dissimilar felt grade movie prepare gritty language enjoy satirize thing view number social commentator satiric twist love prove exception highly enjoyable particularly predilection music", "genres": ["Fiction & Literature", "Mystery & Suspense", "Humour"], "summary": "In romantic desperation, mild-mannered detective Edward Newson logged on to the \"Friends Reunited\" website searching for the girlfriends of his youth. As his old class begins to reassemble in cyberspace, the years slip away and old feuds and passions burn hot once more. A school reunion is planned, and as history begins to repeat itself, the past crashes headlong into the present. \r\n\r\nPast Mortem is both a heart-stopping thriller and a killer comic romance.", "asin": "0552771236", "rank": "1202925", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51rPj1tArML.jpg", "country": "England", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}