{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 42, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Ben Elton is my absolutely favourite writer.First casualty is one of his OK ones"}, {"review_sentiment": 4.0, "review_text": "Intriguing about principals very well written"}, {"review_sentiment": 5.0, "review_text": "Loved this book, it is an exceptional rendition of the First World War. One feels like they have followed the soldiers into the trenches. It is frighteningly realistic. Great book"}, {"review_sentiment": 4.0, "review_text": "Great story."}, {"review_sentiment": 2.0, "review_text": "Disappointing re-hash of Blackadder Goes Forth"}, {"review_sentiment": 4.0, "review_text": "An interesting mix of fact and fiction. I didn't guess who the killer was."}, {"review_sentiment": 5.0, "review_text": "Combines humour amongst tragedy with a hard to put-down intriguing story line.  A very true to life story about human endurance and courage.  A wonderful read."}, {"review_sentiment": 5.0, "review_text": "I found the book compelling and quite surprising."}, {"review_sentiment": 5.0, "review_text": "Fascinating characters facing moral dilemmas with the back drop of World War one. Very vivid images and a good detective story that keeps you coming back for more. Couldn't wait for bedtime so I could get back to the reading!"}, {"review_sentiment": 5.0, "review_text": "Great work by Ben Elton as always. So good that I bought the kindle version despite having the paperback"}]}, "authors": ["Ben Elton"], "isbn": "0552771309", "longitude": -0.12574, "periods": ["1900s", "Recent Releases"], "title": "The First Casualty", "word_cloud": "absolutely favorite one intrigue principal well write love exceptional rendition feel follow soldier trench frighteningly realistic story disappoint interesting mix fact fiction guess killer combine humor among st tragedy hard intrigue story line true life story human endurance courage wonderful find compel quite surprising fascinate character face moral dilemma back drop vivid image good detective story keep come back wait bedtime reading work always so good buy version paperback", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWI"], "summary": "In Flanders in June 1917, a British officer and celebrated poet is shot dead, killed not by German fire, but while recuperating from shell shock well behind the lines. A young English soldier is arrested and, although he protests his innocence, charged with his murder. Douglas Konig, formerly a detective with the London police, soon discovers that both the evidence and the witnesses he needs are quite literally disappearing into the mud that surrounds him.", "asin": "0552771309", "rank": "720898", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/514HxNV8aeL.jpg", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}