{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 2000, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Love it!"}, {"review_sentiment": 4.0, "review_text": "This is such an ingenious idea to incorporate all of Sir Arthur Conan Doyle's short shorties into one condensed book is amazing. Much easier than having to find each individual story. Very helping for English classes in college!"}, {"review_sentiment": 5.0, "review_text": "Bought this after listening to the audiobook on audible! This collection has it all and if you haven't read it or listened to it, then I highly recommend you do so!!"}, {"review_sentiment": 5.0, "review_text": "Sir Arthur Conan Doyle brings to life his greatest creation, the famed Detective Sherlock Holmes. These classic stories are well written and fun to read. Victorian England is a fascinating setting as the reader is transported back to this more formal and reticent time. The mystery is always entertaining and the action and suspense will still resonate with readers today. Read and enjoy."}, {"review_sentiment": 4.0, "review_text": "I thoroughly enjoyed reading the entire collection of Sherlock Holmes. It's easy to understand how so many people thought this fictional character was a real person.  The intellect of Holmes and his faithful companion Watson take the reader on some very interesting and exciting adventures."}, {"review_sentiment": 5.0, "review_text": "After the TV show Sherlock I was eager to jump into Doyle's work. This is a perfect way to do it. He was a master storyteller. You'll also recognize a lot of plot lines that were used in the show. Good stuff."}, {"review_sentiment": 5.0, "review_text": "This book was as described."}, {"review_sentiment": 5.0, "review_text": "Its not bad"}, {"review_sentiment": 2.0, "review_text": "The font is really small which results in a wall of text. Maybe that works for some people, but it's too much for me. For 8.5x11 I'd expect a bigger font. Also, claiming it's illustrated is kind of a stretch in my opinion since the illustrations are nothing special."}, {"review_sentiment": 5.0, "review_text": "It took two volumes and nearly 1,800 to hold ALL of Arthur Conan Doyle's \"Sherlock Holmes\" stories and the four novels -- they had to print it in two volumes but here it is, and at a very good price.  So many readers find themselves enamored of the Holmes/Watson/Moriarty saga that they want to read everything A.C. Doyle wrote about them, so it makes sense to go for this package."}]}, "authors": ["Sir Arthur Conan Doyle"], "isbn": "0553212419", "longitude": -0.12574, "periods": ["1800s"], "title": "Sherlock Holmes: The Complete Novels and Stories", "word_cloud": "ingenious idea incorporate short shorties condense amaze much easier find individual story help english class college listen audio book audible collection listen highly recommend bring life greatest creation famed classic well write fun victorian fascinate set transport formal reticent time mystery always entertaining action suspense still reader today enjoy thoroughly enjoy read entire collection easy understand many people think fictional character real person intellect faithful companion interesting exciting adventure tv show eager jump work perfect way master storyteller also recognize lot plot line use show good stuff describe bad font really small result wall text work people much expect bigger font also claim illustrate kind stretch opinion illustration nothing special take volume nearly hold print volume good price so many reader find enamored saga want everything write make sense package", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Since his first appearance in Beeton’s Christmas Annual in 1887, Sir Arthur Conan Doyle’s Sherlock Holmes has been one of the most beloved fictional characters ever created. Now, in two paperback volumes, Bantam presents all fifty-six short stories and four novels featuring Conan Doyle’s classic hero--a truly complete collection of Sherlock Holmes’s adventures in crime!\r\n\r\nVolume I includes the early novel A Study in Scarlet, which introduced the eccentric genius of Sherlock Holmes to the world. This baffling murder mystery, with the cryptic word Rache written in blood, first brought Holmes together with Dr. John Watson. Next, The Sign of Four presents Holmes’s famous “seven percent solution” and the strange puzzle of Mary Morstan in the quintessential locked-room mystery. \r\n\r\nAlso included are Holmes’s feats of extraordinary detection in such famous cases as the chilling “ The Adventure of the Speckled Band,” the baffling riddle of “The Musgrave Ritual,” and the ingeniously plotted “The Five Orange Pips,” tales that bring to life a Victorian England of horse-drawn cabs, fogs, and the famous lodgings at 221B Baker Street, where Sherlock Holmes earned his undisputed reputation as the greatest fictional detective of all time.", "asin": "B01BITMSNS", "rank": 0, "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51yeio4vrTL.jpg", "country": "England", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}