{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 48, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Okay, my 20-something-year-old son lives in Hong Kong so I'm biased right from the start, but I'll have to say, I was immediately hooked on the story of Martin's innocent curiosity as he rambled his way through the streets of Hong Kong under British rule.  The locals he met; the foods he tasted; the independence he exerted all on his own make for one engaging story...one I didn't want to have come to an end.  It would make a great movie."}, {"review_sentiment": 5.0, "review_text": "Bought this book while living in China and visiting Hong Kong regularly.  The book brings Hong Kong alive - sights, smells, sounds - all easy to visualise.  Amazing account of his experiences.  One of my very favourites!"}, {"review_sentiment": 5.0, "review_text": "Brilliant book, interesting and an excellent read"}, {"review_sentiment": 5.0, "review_text": "Really took me back home to Hong Kong, I have been gone for 35 years but this book made it seem like it was yesterday I left Kai Tak Airport!!"}, {"review_sentiment": 5.0, "review_text": "An amazing read for anyone who has visited Hong Kong or lived there at any time, but even if you haven't, he paints pictures with words that will transport you there.  You will feel and smell everything he describes.If you have any interest in anything British or Chinese, this is the book for you.  You will always remember it."}, {"review_sentiment": 4.0, "review_text": "I really enjoyed this book, a very good read."}, {"review_sentiment": 5.0, "review_text": "I am just finishing the book for a third time. I love it. Beautifully written memoir. It is hard to believe an eight year-old boy was allowed to wander the streets, squatters camps, dangerous walled city where opium was the norm ( he had been forbidden to go there) etc. He learned the language, immersed himself fully into the Chinese culture learning to speak Cantonese fluently. His parents marital problems are a part of the memoir as they were a part of his awareness. I think, as one reviewer put it, \"bashing\" too strong a sentiment to be used when he tells in passing of the abuse the father heaped on him and the mother;it was his reality. I can't recommend this book enough. My copy, bought in the States is called \" Golden Boy.\""}, {"review_sentiment": 5.0, "review_text": "An excellent book for those whom experienced their life in Hong Kong during the 50's, 60's and 70's as an expatriate.There was so much which I can relate to in Martin Booths book, bringing  pangs of nostalgia."}, {"review_sentiment": 5.0, "review_text": "Great easy read and if you live or lived in HK, great to relate to the places and experiences."}, {"review_sentiment": 3.0, "review_text": "A fantastic remembrance of an exotic childhood in Hong Kong. I enjoyed hearing about the complex characters that this young boy befriended."}]}, "authors": ["Martin Booth"], "isbn": "0553816721", "longitude": 114.1628131, "periods": ["1900s"], "title": "Gweilo: Memories of a Hong Kong Childhood", "word_cloud": "son live bias right start say immediately hook story innocent curiosity ramble way street british rule local meet food taste independence exert make engage story want come end great movie live visit regularly brings alive sight smell sound easy visualize account experience favorite interesting excellent really take home go year make seem yesterday leave amazing anyone visit live time even paint picture word transport feel smell everything interest anything british always really enjoy good finish third time love beautifully write memoir hard believe boy allow wander street squatter camp dangerous wall city opium norm forbidden go learn language immerse fully chinese culture learn speak fluently parent marital problem part memoir part awareness think reviewer put bash strong sentiment use tell pass father heap mother reality enough copy buy call excellent experience life much relate bring pang nostalgia easy live live great relate place experience fantastic remembrance exotic enjoy hear complex character young boy befriend", "genres": ["Memoir"], "summary": "Evocative, funny and full of life, this is a beautifully observed childhood memoir of growing up in colonial Hong Kong in the 1950s.\r\n\r\nAs an inquisitive seven-year-old, Martin Booth found himself with the whole of Hong Kong at his feet when his father was posted there in the early 1950s. Unrestricted by parental control, he had free access to hidden corners of the colony normally closed to a Gweilo, a “pale fellow” like him. Befriending rickshaw coolies and local stallholders, he learned Cantonese, sampled delicacies such as boiled water beetles and one-hundred-year-old eggs, and participated in colourful festivals. He even entered the forbidden Kowloon Walled City, wandered into the secret lair of the Triads and visited an opium den. Along the way he encountered a colourful array of people, from the plink plonk man with his dancing monkey to Nagasaki Jim, a drunken child molester, and the Queen of Kowloon, the crazed tramp who may have been a member of the Romanov family.\r\n\r\nShadowed by the unhappiness of his warring parents, a broad-minded mother who, like her son, was keen to embrace all things Chinese, and a bigoted father who was enraged by his family’s interest in “going native,” Martin Booth’s compelling memoir is a journey into Chinese culture and an extinct colonial way of life that glows with infectious curiosity and humour.\r\n\r\n“[Gweilo] stands as one of the most original and engaging memoirs of recent years, all the more telling because it is so personal, witty and true. Booth has delivered a pre-coming-of-age book that ranks with the best of the breed.” The Times", "asin": "0553816721", "rank": "237094", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/510MuCNYF-L.jpg", "country": "China", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}