{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 655, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "I like the inexpensive price.  I like that it is not on WiFi so it cannot be hacked. The night vision is very clear.  It was easy to hook up.  The signal did disconnect one time but it was easy to reconnect again. I dislike - The screen is like a second sun.  It is SO bright at night.  I have it on Eco-Mode just so I can sleep (the screen goes black until it registers audio).  But then there's a blinking green LED light to let you know the monitor is on, and that too is extremely bright.  I also dislike how flimsy the parent monitor is.  With the cord plugged in, the parent unit becomes unbalanced and tips over easily.Overall, I recommend it for anyone looking for an inexpensive video monitor.  There are probably better ones out there, but not for the price or ease of use."}, {"review_sentiment": 5.0, "review_text": "this monitor is perfect, small and compact, very good sound and even measures the temp in the room. I am using for my kids that are 8-11 yrs. and we can communicate this way due to our bedrooms being so far apart."}, {"review_sentiment": 5.0, "review_text": "Love this! So many great settings! It acts like a really expensive monitor. Only thing is it feels like it's cheeply made, so I would be gentle with it."}, {"review_sentiment": 3.0, "review_text": "\"You get what you pay for\" comes to mind. I've had this monitor for 4 months now. I had a Motorola video monitor before; the price and high reviews pulled me to this monitor for baby #3 (still using the Motorola is other kid's room).  Plus - Battery life is so far really great. Negatives - the receiver makes a weird \"popping\" sound sporatically. Also, the color at night looks like it's constantly trying to adjust in night mode, so the screen is constantly getting darker/lighter. Last, lots of interference in our house (not really sure from what - the Motorola works fine). Overall, the monitor works, but these negatives are really annoying. I'd buy a different brand if I had a do-over."}, {"review_sentiment": 5.0, "review_text": "I have read everything from Tom Robbins, in anyone asked me to pick my best... it would be Jitterbug Perfume!"}, {"review_sentiment": 2.0, "review_text": "Picture much smaller than I anticipated"}, {"review_sentiment": 5.0, "review_text": "This is my favorite Tom Robbins novel, and one of my favorite novels by any author. Extremely funny and entertaining, but it also comes with a heavy dose of philosophical heavy lifting. Read it, you won't regret it"}, {"review_sentiment": 5.0, "review_text": "Works great and may have saved my Grandmother’s life. My mother noticed she wasn’t answering and looked to be in distress and caught a stroke very quickly to alert 911. Without the video and audio working so well with this unit she would have assumed she was sleeping. Works the way it should and is easy to set up."}, {"review_sentiment": 5.0, "review_text": "Gift - the \"new Mom\" was thrilled...has many features"}, {"review_sentiment": 5.0, "review_text": "Love this had to buy a second one for nana’s"}]}, "authors": ["Tom Robbins"], "isbn": "0553348981", "longitude": 2.3514992, "periods": ["1900s"], "title": "Jitterbug Perfume", "word_cloud": "like inexpensive price hack night vision clear easy hook signal time easy reconnect dislike screen second sun bright night sleep screen go black register audio blink green light let extremely bright also dislike flimsy parent monitor cord plug parent unit become unbalanced tip recommend anyone look inexpensive video monitor probably better one price ease use monitor perfect small compact good sound even measure temp room use kid yr communicate way due bedroom far apart many great setting act really expensive monitor only thing feel cheaply make get come mind monitor month video monitor price high review pull monitor baby still use kid room life far really great negative make weird pop sound sporadically also color night look constantly try adjust night mode screen constantly get last lot interference house really sure work fine monitor work negative really annoy buy different brand everything anyone ask pick best picture much smaller anticipate favorite favorite novel author extremely funny entertain also come heavy dose philosophical heavy lift great life mother notice answering look distress caught stroke quickly video audio work well unit sleep way easy set new thrill many feature buy second naan", "genres": ["Fiction & Literature"], "summary": "Jitterbug Perfume is an epic.\r\n\r\nWhich is to say, it begins in the forests of ancient Bohemia and doesn’t conclude until nine o’clock tonight (Paris time).\r\n\r\nIt is a saga, as well. A saga must have a hero, and the hero of this one is a janitor with a missing bottle. The bottle is blue, very, very old, and embossed with the image of a goat-horned god. \r\n\r\nIf the liquid in the bottle actually is the secret essence of the universe, as some folks seem to think, it had better be discovered soon because it is leaking and there is only a drop or two left.\r\n\r\n\"Jitterbug Perfume has a large and  exotic cast of characters, all of whom are interested  in immortality and/or perfume... Go see for  yourself; you'll have a good time.\" Washington Post ", "asin": "0553348981", "rank": "21804", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51Y3BC0VscL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}