{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 231, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Radio com details."}, {"review_sentiment": 3.0, "review_text": "Pro:  good insight into the young men who fought in VietnamCon:  if you are looking for a 300 page book stretched to 577 pages, this is for you."}, {"review_sentiment": 4.0, "review_text": "Well written novel (based on the author's personal experiences) that although deviates into the character's personalities a bit much at times, will hold your interest throughout. The personalities of the characters are what ultimately draw you into the story and its ultimate finale. I read this after a former vet talked about it on one of the vet forums as being indicative of his experiences in Vietnam, while the Ken Burns miniseries was being debated online...this is definitely a Vet's view of the war, but apparently that of a thinking vet.as much history and personal views of the war are discussed amongst his characters.."}, {"review_sentiment": 5.0, "review_text": "First, I was never there. But it still took me a good 20 years before I could read a book or watch a movie about the war. None of them said much to me or seemed to ring true until I found The 13th Valley. For movies it was Hamburger Hill, for books it was The 13th Valley."}, {"review_sentiment": 5.0, "review_text": "Love this book, have read it three times."}, {"review_sentiment": 5.0, "review_text": "Served 67-68 4thID Central Highlands. PLT Ldr and Company Commander and MP Captain. Served 70-71 SF A Detachment CH.  Book very realistic about daily life and mission accomplishment in a line outfit. Dirty dangerous and terrifying. Lying political leaders who even today are trying to start it all over again. We just don't learn. And it's because we like itGod help us and our grandchildren we will throw in the Cauldrons of 🔥 Fire.  The Budman 😎🏁🏖️"}, {"review_sentiment": 5.0, "review_text": "The 13th Valley is an exquisitely detailed description of several American infantrymen in Vietnam. Del Vecchio, who served during the war, captures haunting details of the combat that the infantry experienced. Further, he also delves deeply into the psyche of these men creating a rich narrative. The book is long. But, then, Del Vecchio has a compelling tale to tell."}, {"review_sentiment": 5.0, "review_text": "The most accurate, incisive look at the Vietnam War through the eyes of the grunts - the boonierats. It proves the lies of the Left were just that: lies. Welcome home, well done and thank you."}, {"review_sentiment": 5.0, "review_text": "The best Viet Nam book I have ever read."}, {"review_sentiment": 4.0, "review_text": "Great writing about the operational aspects of small unit combat. Most of the book is very insightful and provocative with respect to combat and the emotions it provokes in men. There a some strange philosophical and sexual digressions that detract from the narrative flow.  Overall it is a good book. Not Capito or Webb, but close."}]}, "authors": ["John M. Del Vecchio"], "isbn": "0553050222", "longitude": 0.0, "periods": ["1900s"], "title": "The 13th Valley", "word_cloud": "com detail pro good insight young men fight look page stretch page well write base author personal experience deviate character personality bit much time hold interest personality character ultimately draw story ultimate finale former vet talk vet forum indicative experience miniseries debate online definitely war apparently think much history personal view war discuss among st first never still take good year movie war say much seem ring true find movie time served realistic daily life mission accomplishment line outfit dangerous terrify lie political leader even today try start learn it god help throw fire exquisitely detail description several american infantryman serve war capture haunt detail combat infantry experience also delve deeply psyche men create rich narrative long compel tale tell accurate incisive look eye grunt prove lie lie home well do thank best diet ever write operational aspect small unit combat most insightful provocative respect combat emotion provoke men strange philosophical sexual digression detract narrative flow good not close", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A work that has served as a literary cornerstone for the Vietnam generation, The 13th Valley follows the strange and terrifying Vietnam combat experiences of James Chelini, a telephone-systems installer who finds himself an infantryman in territory controlled by the North Vietnamese Army. Spiraling deeper and deeper into a world of conflict and darkness, this harrowing account of Chelini's plunge and immersion into jungle warfare traces his evolution from a semipacifist to an all-out warmonger.\r\n\r\nThe seminal novel on the Vietnam experience, The 13th Valley is a classic that illuminates the war in Southeast Asia like no other book.\r\n\r\n“Powerful . . . There have been a number of excellent books about Vietnam . . . but none has managed to communicate in such detail the day-to-day pain, discomfort, frustration and exhilaration of the American military experience in Vietnam as well . . . Del Vecchio has made the jungle real and terrifying.” The New York Times", "asin": "0553050222", "rank": "386755", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/411qiLYczLL.jpg", "country": "Hanoi", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}