{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.5202471, "ratings": {"num_ratings": 57, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "One of the small handful of books that represent truly great American novels. It's up there with Faulkner's As I Dying, and Nathanael West's Miss Lonelyhearts."}, {"review_sentiment": 3.0, "review_text": "A war schocked vietnam vet trying to cope with his ptd as a police officer.Characters are well fleshed out but the story line could be better, imo.A solid 3 stars."}, {"review_sentiment": 5.0, "review_text": "As true as Joe Wambaugh, but with the PPB feel. It would be nice to talk to Kent Anderson. We've certainly had may of the same experiences."}, {"review_sentiment": 5.0, "review_text": "One of the few books that really gets what being a street cop is like."}, {"review_sentiment": 4.0, "review_text": "A novel but very believable story of police work in the 70's. I came back from Nam myself in 69 ' and joined a large city police department so I can testify that this author has also led a similar life. It's not like current policing.... no cameras and not as many lawyers back in those days."}, {"review_sentiment": 5.0, "review_text": "This book shattered the oft-preached advice to writers to \"show not tell\". That was one of the first things I noticed. The author often tells the reader what his main character feels and thinks and it works brilliantly. He doesn't gush on and on about it, just states the information where necessary. This is a brilliant book, unflinchingly dark, gritty as black sand, and unsettling. Very well written. Characters that get inside your head with their human flaws, agonies, rare kindnesses, pettiness, and sometimes outright dangerous traits. I couldn't put the book down even though it's not a happy tale. I can't say I enjoyed this book, but I can say I'm glad I read it. Five stars for originality, brutal honesty, and a writing style that keeps your eyes glued to the page. It kept me on edge, sometimes dreading what I'd find on the next page. I won't spoil the ending, but I'll say I found it deeply satisfying.I usually only award 5 stars to epic works, like trilogies, but I think this book deserves the rating."}, {"review_sentiment": 5.0, "review_text": "I first read this book back in the late 90s and immediately thereafter bought the companion novel, \"Sympathy for the Devil\" (I highly recommend reading both).  Hanson is one of those characters that should be recognized as one of the most vivid, and poignant, literary depictions of a man teetering on the edge.  I find myself thinking about Hanson all the time, even though he's just a creation of Kent Anderson's talent and imagination.Sadly, there are a lot of people that will not \"get\" this book.  It would be a waste of time, for instance, to give this book to someone that is deeply committed to \"social justice\", whatever the hell that is.  This is a book for people that have been out in the real world and seen how savage things can get for human beings (and dogs, can't forget the dogs.  As Hanson puts it, \"It's a hard world out there, for dogs too.\"I'm writing this review on the morning of July 8th, 2016.  I had started re-reading Night Dogs about two days ago, while working a part-time job (I'm a retired Air Force helicopter pilot, been out about 4 years now).  I woke up this morning and saw the news about the sniper ambush at the Black Lives Matter protest in Dallas.  11 cops shot, 5 dead as of now.  All of those people that have been calling for mass resistance and violence against police officers are now hedging and back-pedaling, claiming they can't be held responsible for the outrage they've worked day and night to stir up.  I can only laugh bitterly and wonder what Hanson, a cop just trying to survive in this fallen world, would think of it all.This is a hard book but an important book, to paraphrase James Crumley's review of \"Night Dogs\".  If you wish to view this world with clear eyes, seeing both the good and the bad, and even the ugly, you must read this book, maybe more than once.  I only wish I could give it more than 5 stars."}, {"review_sentiment": 5.0, "review_text": "Another gift for my husband."}, {"review_sentiment": 5.0, "review_text": "Excellent book by an author who has served as a police officer. The book brings the reality of the situations faced by law enforcement and the emotions that these individual face as a fact of working life."}, {"review_sentiment": 4.0, "review_text": "I have mixed reactions to Anderson's _Nigh Dogs_.  The author is a former Portland cop, so many of the details of the story ring true - the variety of calls, the stressors of the job, the interaction between cops  and other cops and between cops and the community.  The setting of the story - the summer of 1975, the tensions and frustrations of Vietnam still fresh in everyone's mind, the post-civil rights era just beginning with all the frustration and disappointment that brought, the \"malaise\" of the Ford and Carter years.  These were all shown brilliantly and certainly gave the book the gritty texture and dark sense of what is ultimately, a snapshot of life as a beat cop.As a resident of North Portland (the now gentrified, once \"inner-city\"), I recognized many of the places described - in fact, I live just down the street from one of the calls made in the book.  The description of the neighborhood and its residents - even 40 years ago - is a little exaggerated.  This troubled me.  I realize that poetic license is taken, but the relations between my neighbors (and former neighbors, as it is hardly the majority African-American neighborhood it once was) with the cops and with each other was never as combative (or as dangerous) as shown here.  Likewise, the \"night dogs\" which are an undercurrent to the story (and perhaps a metaphor for the larger themes of the book) is fiction.  Even recognizing this,it still detracted somewhat from my enjoyment of the book.Those unfamiliar with Portland (either of the past or now) will undoubtedly feel the same way I do.  That aside, Anderson has written an unnerving story that harkens back to a time when America was at war with itself and provides what I can only assume is a only narrowly exaggerated perspective of what life as a beat cop is like - and what the personal costs of the job are on a person."}]}, "authors": ["Kent Anderson"], "isbn": "0553578774", "longitude": -122.6741949, "periods": ["1900s"], "title": "Night Dogs", "word_cloud": "small handful represent truly great american novel die war shock vietnam vet try cope pt police well flesh story line solid star true talk certainly really get street cop believable story police work come back join large city police department testify author also lead similar life current police camera many lawyer back day shattered advice writer show tell first thing notice author often tell main character feel think work brilliantly state information necessary brilliant unflinchingly dark gritty black sand unsettle very well write inside head human flaw agony rare kindnesses pettiness sometimes outright dangerous trait even happy tale enjoy say glad star originality brutal honesty writing style keep eye glue page keep edge sometimes dread find next page end say find deeply usually award star epic work trilogy think deserves rating first back late immediately thereafter buy companion highly recommend read character recognize vivid poignant literary depiction man teeter edge find think time even creation talent lot people get time instance someone deeply commit social justice hell people real world see savage thing get human being put hard world write review morning start day ago work job retire helicopter pilot year wake morning saw news sniper ambush live protest cop shoot dead people call mass resistance violence police officer hedge claim hold responsible outrage work day stir laugh bitterly wonder cop try survive fall world hard important paraphrase review wish view world clear eye see good bad even ugly maybe wish star gift husband excellent author serve police officer brings reality situation face law enforcement emotion individual face fact work life mix reaction author former cop many detail story ring true variety call stressor job interaction cop cop cop community setting story summer tension frustration still fresh everyone mind right era begin frustration disappointment bring malaise year show brilliantly certainly give gritty texture dark sense ultimately snapshot life beat resident gentrified recognize many place describe fact live street call make description neighborhood resident even year ago little exaggerated troubled realize poetic license take relation neighbor former neighbor hardly majority neighborhood cop never combative dangerous show undercurrent story perhaps metaphor larger theme fiction even recognize still detract somewhat enjoyment unfamiliar past undoubtedly feel way aside write unnerving story hankers time war provide assume narrowly exaggerated perspective life beat cop personal cost job person", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Former police officer Kent Anderson, author of the memorable Vietnam War novel Sympathy for the Devil, returns with a powerful new novel about a Vietnam-vet cop who still carries the war inside himself. Searing and brutally honest, Night Dogs plunges us into the free-fire zones of our cities, where the legendary thin blue line is breaking down.\r\n\r\nThe North Precinct of Portland, Oregon, is home to two kinds of cops: sergeants and lieutenants who've screwed up somewhere else, and patrolmen who thrive on the action on the Avenue. Officer Hanson is the second kind, a veteran who has traded his Bronze Star for a badge. War is what Hanson knows, and in this battle for Portland's meanest streets, he's fighting not so much for the law as for his own code of justice.\r\n\r\nHanson is a man who seems to fear nothing--except his own memories.  And it is his past that could destroy him now:  An enemy in the department is determined to bring him down by digging into his war record and resurrecting the darkest agonies of that nightmare time.  And Hanson himself risks everything--his career, his equilibrium, even his life--when the only other survivor of his Special Forces unit comes back into his life. Doc Dawson is a drug dealer and a killer...but he's the one man Hanson can trust.\r\n\r\nNight Dogs is an extraordinary work from a powerful and authentic voice in American fiction. Recoiling from the violence that Hanson deals with every day, the violence that is in Hanson, readers will also understand the compassion that drives him.  A novel remarkable for its razor-sharp characterizations and dialogue, its freshness of observation, Night Dogs--and Hanson--will remain etched in the memory for a long time to come.", "asin": "0553578774", "rank": "550586", "city": "Portland", "image": "https://images-na.ssl-images-amazon.com/images/I/41KJifyIWRL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}