{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 50, "rating": 4.1, "reviews": [{"review_sentiment": 1.0, "review_text": "I am a Rick Riordan fan, but was so disappointed in this book. I thought the content and the language used offensive. I will continue to get his books, but will be more careful with my choices in the future."}, {"review_sentiment": 3.0, "review_text": "HVent finished it yet !!"}, {"review_sentiment": 4.0, "review_text": "Dark and puzzling, but very compelling. Hard to put down. An ending that is a real surprise. The underwater scenes were lush."}, {"review_sentiment": 5.0, "review_text": "This is the first Tres Navarre book I've read.  Wow!  I can't believe this nice young man could write such scary stories.  I've been in all the places in Austin except the parts that took place in the diving area.  After reading this, I plan to turn in my dive card and not go near the water!"}, {"review_sentiment": 4.0, "review_text": "This book is fun for anyone who has spent time in Austin and San Antonio. I'm afraid, however, much of the scene settings and subtle asides would be lost on anyone who hasn't tipped their ice tea to Bevo. (Clyde, MA '90)"}, {"review_sentiment": 5.0, "review_text": "Well-paced and a good story. Plot well thought out with a twist at the end. Worth the time spent reading it"}, {"review_sentiment": 3.0, "review_text": "Not a fan of first person but otherwise this was written by someone who knows a lot about cop work, Texas, scuba diving, Tai Chi and confusing serial killers."}, {"review_sentiment": 4.0, "review_text": "I really enjoyed this book.  I've read most of the young adult fiction by this author but it's my first adult novel by him.  Tree is a very likable character. I love his sarcasm. I look forward to reading another Navarre mystery."}, {"review_sentiment": 4.0, "review_text": "Entertaining and  quick easy read."}, {"review_sentiment": 2.0, "review_text": "I'm not sure this book could be any slower if it tried. Quite the yawner."}]}, "authors": ["Rick Riordan"], "isbn": "0553579940", "longitude": -97.7436995, "periods": ["1900s"], "title": "The Devil Went Down to Austin", "word_cloud": "fan disappoint think content language use offensive continue careful choice future finish yet puzzle compel put end real surprise underwater scene lush first res wow nice young man scary story place part take place dive area read plan turn dive card go water fun anyone spent time afraid however much scene setting subtle aside anyone tipped ice tea good story well think twist end time spend read not fan first person otherwise write someone know lot cop work scuba dive confuse serial killer really enjoy young adult fiction author first adult likable character love sarcasm look forward read mystery entertain quick easy sure tried yawner", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Rick Riordan, triple-crown winner of the Edgar, Anthony, and Shamus Awards, brings his fast-talking, hard-living, Texas-hip P.I. Tres Navarre to the heart of the Lone Star State—Austin—to unravel a case so dark, twisted, and deadly, it can only involve family....\r\n\r\nTres Navarre, the P.I. with a Ph.D. in literature, heads to Austin for a laid-back summer teaching gig. But he’s in store for a whole lot more. His big brother Garrett--computer whiz, Jimmy Buffett fanatic, and all-around eccentric—is hoping to retire a multimillionaire by the fall. He’s bet his career and the Navarre family ranch to do it. \r\n\r\nThen Garrett’s oldest friend and business partner is murdered—and Garrett is the only suspect. As Tres delves into Garrett’s bizarre world to find the truth behind the murder, he comes face to face with the damaged relationships, violent lives, and billion-dollar schemes of a high-tech world gone haywire. Connecting them all is beautiful Lake Travis and the shocking secret that lies within its depths. Now, as Tres struggles with his own troubled family past and to clear his brother’ s name, he finds himself stalked by a cold-blooded killer—one who could spell the death of both Navarres.", "asin": "0553579940", "rank": "1053502", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51EE1QmYQML.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}