{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 365, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "An amazingly fun and entertaining read!"}, {"review_sentiment": 1.0, "review_text": "I was required to read this otherwise I would have put it down almost immediately. Story is truly bizarre, akward, meandering and unpleasant. The writing style is very difficult to acclimate to. I'm sure there was a point but darned if I could find it."}, {"review_sentiment": 5.0, "review_text": "If you've ever thought about visiting Seattle or just want to know where all the red beards went this is the book for you!Loved it is a definite must read."}, {"review_sentiment": 5.0, "review_text": "A must in any collector."}, {"review_sentiment": 5.0, "review_text": "Still Life with Woodpecker is such a wonderful story with thought provoking dialogue that makes yourself ask, How does one make love stay?"}, {"review_sentiment": 1.0, "review_text": "I have ADHD, and contrary to what a lot of people,  even we have trouble with-lets face it, horrible read.I like a story, i don't like a bunch of verbose adjectives being thrown around in a bag and then being removed from said bag and thrown into print.The book was recommended by my best friend, I'm now reevaluating our friendship, is someone who would recommend this abysmal book a person i need in my life?"}, {"review_sentiment": 5.0, "review_text": "This has been my favorite book since high school. I strongly recommend this title and author!"}, {"review_sentiment": 5.0, "review_text": "I love this book. I can read it over and over and always find something I miss. The quotes are amazing and from sentence one it's captivating. Funny, snarky, dark, entertaining. If you haven't read it, you should."}, {"review_sentiment": 5.0, "review_text": "Creative, mind-expanding, colorful, and twisted in the best sense of the word. All-time favorite."}, {"review_sentiment": 5.0, "review_text": "thanks for the quick shipment. As described; very pleased"}]}, "authors": ["Tom Robbins"], "isbn": "0553348973", "longitude": -122.3300624, "periods": ["1900s"], "title": "Still Life with Woodpecker", "word_cloud": "amazingly fun entertain require otherwise almost immediately truly bizarre award meander unpleasant writing style difficult acclimate sure point darn ever think visit want know red beard go definite wonderful story think provoke dialogue make make love stay add contrary lot people even trouble face horrible story bunch verbose adjective throw bag remove say bag thrown recommend best friend reevaluate friendship someone abysmal person need favorite high school strongly recommend title author love always find something miss quote amaze sentence captivating snarky dark entertain creative colorful twist best sense word favorite thanks quick shipment described please", "genres": ["Fiction & Literature"], "summary": "Still Life with Woodpecker is sort of a love story that takes place inside a pack of Camel cigarettes.\r\n\r\nIt reveals the purpose of the moon, explains the difference between criminals and outlaws, examines the conflict between social activism and romantic individualism, and paints a portrait of contemporary society that includes powerful Arabs, exiled royalty, and pregnant cheerleaders. It also deals with the problem of redheads.", "asin": "0553348973", "rank": "29743", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/51jHYrUtpkL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}