{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 166, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "I live near where this all took place.. the Skagit flats of Washington state...  a very fun read... highly recommended..."}, {"review_sentiment": 2.0, "review_text": "Far too much flowery descriptions of everything, distracts from story line."}, {"review_sentiment": 4.0, "review_text": "this is my 5th or 6th tom robbins novel and the 3 ring circus he mc's does nothing short than dazzle and amaze just before he sends in his metaphoric clown car. great book. still as big of fan as ever."}, {"review_sentiment": 5.0, "review_text": "Reread it to see how I liked it 50 years later.  Thought it pretentious at first, but then he got into some fine rants, worthy of Facebook today."}, {"review_sentiment": 5.0, "review_text": "Great read."}, {"review_sentiment": 5.0, "review_text": "A gift.  If you've read it, you know. If you haven't, well you're in for a wild ride.  Plucky Purcell in the basement of the Vatican."}, {"review_sentiment": 5.0, "review_text": "This was a gift.  I read it 50 years ago."}, {"review_sentiment": 5.0, "review_text": "This was my favorite book years ago and remains the same."}, {"review_sentiment": 5.0, "review_text": "A book that allows you to laugh and grin. Being happy over being right. Given yourself up to the moment completely."}, {"review_sentiment": 5.0, "review_text": "I read this book in my college days (1970s) and loved it then.  It's still a great book!  Tom Robbins has a unique writing style and is more than clever with words."}]}, "authors": ["Tom Robbins"], "isbn": "0553349481", "longitude": -122.3300624, "periods": ["1900s"], "title": "Another Roadside Attraction", "word_cloud": "live take flat state fun highly recommend far much flowery description everything distracts story line tom ribbons ring mc nothing short dazzle amaze send metaphoric clown car great still big fan ever see like year later pretentious first get fine rant worthy today great gift know well wild ride basement gift year ago favorite year ago remain allow laugh grin happy right moment completely college day love still great unique write style clever word", "genres": ["Fiction & Literature", "Mystery & Suspense", "Humour", "Fantasy"], "summary": "What if the Second Coming didn’t quite come off as advertised? What if “the Corpse” on display in that funky roadside zoo is really who they say it is—what does that portend for the future f western civilization? And what if a young clairvoyant named Amanda reestablishes the flea circus as popular entertainment and fertility worship as the principal religious form of our high-tech age? \r\n\r\nAnother Roadside Attraction answers those questions and a lot more. It tell us, for example, what the sixties were truly all about, not by reporting on the psychedelic decade but by recreating it, from the inside out. In the process, this stunningly original seriocomic thriller is fully capable of simultaneously eating a literary hot dog and eroding the borders of the mind.\r\n\r\n\"Written with a style and humor that haven't been seen since Mark Twain . . . it is a prize.\" Los Angeles Times", "asin": "0553349481", "rank": "68176", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/412paAFQZ0L.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}