{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 125, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "Ok"}, {"review_sentiment": 5.0, "review_text": "I don't think I could ever give a William Gibson tale anything less than five stars."}, {"review_sentiment": 5.0, "review_text": "Brilliant prose and vernacular. I enjoyed every page and would commend it to anyone, whether sci fi, mystery, or just as literature."}, {"review_sentiment": 5.0, "review_text": "One of my favorite bookss and favorite authors.  Re-read it every year or two."}, {"review_sentiment": 4.0, "review_text": "A lot of fun ideas, and the writing is poetic as ever. Feels a bit like a mini-Neuromancer. Doesn't have the scope of that old classic though."}, {"review_sentiment": 3.0, "review_text": "Having been a young adult in the 90's it was an interesting read given that I lived through what William Gibson was using as his basis for writing.  In the 90's everyone was always waiting for \"the big one\" in California which would either lead to it falling in the ocean or as in this book the rebuilding of what's left.  I think people still make jokes about it but for some reason we seemed to have been obsessed with it in the 90's.  Pollution and ozone along with rising skin cancer rates as well as AIDS and the cure were all major environmental concerns.  Autism wasn't on the radar and as such there is no mention of this population in the book.  Were it written today it would probably be as major an issue as AIDS was.  His book pretty much projects his vision of the fall out of those episodes mixed with the inevitable increase in technology as well as the dissolution of a middle class.  Oh yeah and the rise of reality tv.  The internet and future technologies associated with it were still in its infancy in the 90's and pretty much Star Trek tech was what everyone thought of when considering advancements.  That is how I remember it anyway.  He was spot on when predicting the abuse of personal information and technology.  And although we haven't gotten automated to the point of a police state mixed with private security protecting our personal safety, his description of drones (less the weaponry but I'm sure its coming) towards the end to me was pretty accurate considering as far as I knew there was nothing like that in the 90's.  But I could be wrong.  He accurately predicted a hacking group like \"Anonymous\" that given the infancy of the internet in 1993 was pretty impressive.  This is what I liked about the book.  Now on to the problems with it.  I don't know if the overly metaphorical high level vocabulary in the first chapter was done to project the mindset of the character, which is my guess given the rest of the book isn't quite as \"flowery\", but I found it difficult to shlum through it and almost stopped reading before I could get to chapter 2.  I don't mind looking up words and increasing my own vocabulary, but the verbiage and descriptions of the scenes around him were so esoteric that I found it difficult to imagine the setting and in doing so couldn't relate with the character at all, but then again maybe that was the point.  In which case the author did a good job.  The rest of the story wasn't predictable per say, but did lean a lot on stereotypes when constructing the main characters and their predicaments.  This is book 1 of a 3 book narrative so I do have 2 more books to go, but quite frankly I probably won't be reading them unless my kid gets assigned it for school, which is why I read this one.  The end just wasn't inspiring enough for me to immediately download the next book.  Maybe had I read it when it came out I would be more interested in his version of the future, but I'm already living in the future that he was predicting and well there just isn't anything new in his writing that makes me want to read more.  On the whole it basically follows the novel formula.  Boy meets girl, boy saves girl, girl and boy become attracted.  Casualties will occur on the side to make it more interesting.  Possible death, psychotic point man and near impossible escapes with a few curve balls thrown in will ensue.  The social commentary on the side made through the eyes of a Japanese anthropologist in regards to the development of a community complete with their own stores and restaurants of the poverty stricken people living on whats left of the Golden Gate Bridge mixed with his own personal feelings surrounding the death of a man whose blood carried a cure for Aids was about the only thing that was not \"formulae\".  The \"religion\" being developed around said man complete with rituals held at funerals on the Golden Gate was also interesting and a lot of time was spent on making that character into a modern \"Jesus\" complete with his own murder by of course Christian extremist.  In identifying the character as a modern Jesus, however,  the writer shows his bias towards religion in general.  The problem being is that the character being deified didn't do anything but happen to have a mutated strain of AIDS in his blood that was used to create a vaccine, for which he was paid handsomely.  There is no moral or spiritual teachings involved with the character at all.  He was just a normal guy that happened to have in his blood what everyone needed to be cured of AIDS.  So I get that the writer was trying to basically say anyone or anything can become a religion with followers given the right climate mainly a dystopian society with extremely rich people living gluttonous lifestyles while everyone else wallows in the sewers with the leftovers.  But that is a very shallow view of religions in general.  Sure if you toss the moral/spiritual base you are left with a collective of the insane lead by a greed driven charismatic narcissus whose followers will either kill or indoctrinate you.  Since the book was released in the same year that David Koresh and the Branch Davidians along with their eventual demise was headlining every news outlet, I can't help but wonder if his views of religion and its formation, along with the traditions and ceremonies that surround it weren't influenced by this event.  An extremist view can be seen in his description of a Christian cult that one of the characters grew up in and is influenced by.  No other religion is mentioned in this book and pretty much all Christians are resigned to be cult like extremist.  As mentioned before a group of Christian extremist even murder the new \"Jesus.\"  But there is a difference between spiritual growth in religion vs the abuse of the human psychy and this is not evident in the writing. He lumps them all in as one without recognizing that a moral and spiritual base is really what started the Christian movement and the traditions ect were what was developed to exploit it.  Ironically it is this abuse of traditions and lack of a moral and spiritual base that had taken over Judaism  that Jesus warned about most.  In that manner I thought his premise on the formation of Christianity and its followers or of any religion was a bit ignorant and biased but I know a lot of people that would readily agree with him.  I'm just not one of them."}, {"review_sentiment": 5.0, "review_text": "great book!"}, {"review_sentiment": 3.0, "review_text": "I like all the details in this book and originality. But, man it was hard to follow, I got so lost I had to start over."}, {"review_sentiment": 5.0, "review_text": "Fantastic"}, {"review_sentiment": 3.0, "review_text": "Gibson always writes stimulating books, and this one creates an interesting near future condition. But this one never really seemed to get rolling or become that\"can't put it down\" read."}]}, "authors": ["William Gibson"], "isbn": "0553566067", "longitude": -122.4192363, "periods": ["2000s"], "title": "Virtual Light", "word_cloud": "ok think ever tale anything le star prose vernacular enjoy page anyone sci phi mystery literature favorite book favorite author year lot fun idea write poetic ever bit old classic have young adult interest give live use basis writing everyone always wait big either fall ocean rebuilding leave think people still make joke reason seem obsessed ozone rise skin cancer rate well cure major environmental concern radar mention population write today probably major issue pretty much project vision fall episode mixed inevitable increase technology well dissolution middle class yeah rise reality tv internet future technology associate still pretty much everyone think consider advancement remember anyway spot predict personal information technology gotten automate point police state mixed private security protect personal safety description drone le weaponry sure come towards end pretty accurate consider far know nothing accurately predict hack group give infancy internet pretty impressive like now problem know overly metaphorical high level vocabulary first chapter do project mindset character guess give rest quite flowery find difficult slum almost stop read chapter mind look word increase vocabulary verbiage description scenes esoteric find difficult imagine setting character maybe point case author good job rest story predictable say lean lot stereotype construct main character predicament narrative go quite frankly probably read kid get assigned school end inspire enough immediately download next come interested version future already live future predict well anything new write make want whole basically follow formula meet girl boy save girl girl boy become attracted occur side make interest death psychotic point man impossible escape curve ball thrown ensue social commentary side make eye japanese anthropologist regard development community complete store restaurant poverty stricken people live whats leave mixed personal feeling surround death man blood carry cure thing formula religion develop say man complete ritual hold funeral also interest lot time spend make character modern complete murder course christian extremist identify character modern however writer show bias towards religion general problem character deify anything happen mutate strain blood use create vaccine pay handsomely moral spiritual teaching involve character normal guy happen blood everyone need cured get writer try basically say anyone anything become religion follower give right climate mainly dystonia society extremely rich people live gluttonous lifestyle everyone else wallow sewer leftover shallow view religion general base leave collective insane lead greed driven charismatic narcissus follower indoctrinate release year eventual demise headline news outlet view religion formation tradition ceremony surround influenced event extremist view see description cult character grow influenced religion mention pretty much resign cult like extremist mention group extremist even murder new difference spiritual growth religion v human psych evident write lump recognize moral spiritual base really start christian movement tradition etc develop tradition lack moral spiritual base take warn manner think premise formation follower religion bit ignorant bias know lot people readily great like detail originality man hard follow get lose start fantastic always write stimulate create interest future condition never really seemed get roll become", "genres": ["Fiction & Literature", "Mystery & Suspense", "Science Fiction"], "summary": "Book 1/3 in the Bridge Trilogy Series\r\n\r\n2005: Welcome to NoCal and SoCal, the uneasy  sister-states of what used to be California. Here the  millenium has come and gone, leaving in its wake  only stunned survivors. In Los Angeles, Berry  Rydell is a former armed-response rentacop now working  for a bounty hunter. Chevette Washington is a  bicycle messenger turned pickpocket who impulsively  snatches a pair of innocent-looking sunglasses. But  these are no ordinary shades. What you can see  through these high-tech specs can make you rich--or  get you killed. Now Berry and Chevette are on the  run, zeroing in on the digitalized heart of  DatAmerica, where pure information is the greatest high.  And a mind can be a terrible thing to crash...", "asin": "0553566067", "rank": "334731", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/418CoctgQzL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}