{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 410, "rating": 4.6, "reviews": [{"review_sentiment": 2.0, "review_text": "This book was thoroughly unpleasant to read. War is awful, but that doesn't mean it's descriptions need to be. This book is hundreds of pages of bland, awkward, disjointed prose, that glorifies and condemns the horrors and heroism, respectively, in the Vietnam war. The writing is painfully mediocre right up to the last few chapters, where it redeems itself a little. The only chapter worth reading is chapter 31, so if you ignore my advice and get this book, but find yourself disliking it as much as I did, skip to 31 and move on with your life."}, {"review_sentiment": 5.0, "review_text": "Excellent read"}, {"review_sentiment": 5.0, "review_text": "This is a powerful Vietnam statement.  It has something for everyone, whether you were for “it” or against “it”. The author, a Vietnam vet, gives an interesting twist to the typical war novel.  His characters are very real and at the same time a cross section of faces and personalities of servicemen whether at a time of war or at peace.  Sensitive “snowflakes” will be shocked by the raw descriptions of war in its grunginess but in the end, and the author truly ends the novel with a flourish, servicemen come across simply as human beings caught up in uncontrollable situations that bring the best and worst out of each one.  For those of us who served in the “Vietnam” era, it is a startling realization that those of us who for one reason or another did not go to ‘Nam were very fortunate indeed. To those who did, I salute you!"}, {"review_sentiment": 5.0, "review_text": "I read this book twice when it came out years ago. I was amazed at how great the story was and by howwell it had been written. It still is one of the best books I've ever read. Its not about General, strategy orpolitics. Its about a platoon of men stuck in the jungle."}, {"review_sentiment": 5.0, "review_text": "Great book, felt like I was there. No happy ending though, as was the Vietnam war, read at your own risk."}, {"review_sentiment": 5.0, "review_text": "Whether Marine soldier or some airmen and even some sailors, this book will relight old memories, some uniden and undesired, some piquant and even bittersweet yet always true - which is really the great essence of any good fictional settings that millions can actually share and not just vicariously as those more timid soulsare forced to do"}, {"review_sentiment": 5.0, "review_text": "Hands down the best work of fiction on the Vietnam war.  I have reread this novel several times since it first came out.  I don't understand why it's never been made into a movie, although Hollywood would probably screw it up.  James Webbis awesome!"}, {"review_sentiment": 5.0, "review_text": "Best book on Viet Nam I've ever read....."}, {"review_sentiment": 4.0, "review_text": "It's a novel but it's believable."}, {"review_sentiment": 5.0, "review_text": "An Unforgettable book with masterful evocationsof contemporary warfare."}]}, "authors": ["James Webb"], "isbn": "0553583859", "longitude": 0.0, "periods": ["1900s"], "title": "Fields of Fire", "word_cloud": "thoroughly unpleasant awful mean description need hundred page bland awkward disjoint prose glorifies condemn horror heroism respectively war write painfully mediocre right last chapter redeem little chapter read chapter ignore advice get disliking much skip move life excellent powerful statement something everyone author vet give interesting twist typical war character real time cross section face personality serviceman time war peace snowflake shock raw description war grunginess end author truly end flourish serviceman come simply human being catch uncontrollable situation bring best worst serve era startle realization reason go fortunate indeed twice come year amaze great story how well write still best ever strategy or politics platoon men stick jungle felt no happy end war risk soldier airman even sailor relight old memory uni den undesired piquant even bittersweet yet always true really great essence good fictional setting million actually share vicariously timid souls are force hand best work fiction war reread several time first come understand never make movie probably awesome ever believable unforgettable masterful evocations of contemporary warfare", "genres": ["Fiction & Literature"], "summary": "They each had their reasons for being a soldier.\r\n\r\nThey each had their illusions. Goodrich came from Harvard. Snake got the tattoo — Death Before Dishonor — before he got the uniform. And Hodges was haunted by the ghosts of family heroes.\r\n\r\nThey were three young men from different worlds plunged into a white-hot, murderous realm of jungle warfare as it was fought by one Marine platoon in the An Hoa Basin, 1969. They had no way of knowing what awaited them. Nothing could have prepared them for the madness to come. And in the heat and horror of battle they took on new identities, took on each other, and were each reborn in fields of fire....\r\n\r\nFields of Fire is James Webb’s classic, searing novel of the Vietnam War, a novel of poetic power, razor-sharp observation, and agonizing human truths seen through the prism of nonstop combat. Weaving together a cast of vivid characters, Fields of Fire captures the journey of unformed men through a man-made hell — until each man finds his fate.", "asin": "0553583859", "rank": "23258", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51yyclCPhSL.jpg", "country": "Hanoi", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}