{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 2249, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "Fifty year-old Jean Perdu owns a river barge that has been docked on the Seine in Paris for 20 years. On this barge, \"the length of three truck trailers\", he has created a book shop. But not just any book shop, it is the Literary Apothecary.In his bookshop, he divides his books, not by subject matter, but by effect. So if he feels a customer needs a book to overcome tragedy, he has a special set of books to recommend. Not only that, if he feels a book is wrong for you, he may refuse to sell it to you!Unfortunately, Perdu has not been able to heal himself. Or, more correctly, he hasn't tried. For 20 years he hasn't tried. This is the story of how unstoppable agents of change, in the shape of quirky characters indeed, eventually bring him back to life. Real, demanding and exhilarating life.I enjoyed \"The Little Paris Bookshop\" and even teared up a bit at one point. It can be a bit twee and there are times where it dragged or was repetitive. But there is some nice writing and interesting characters: \"He was rather fond of Madame Gulliver. She seized life with both hands. More of it than she probably needed.\"Nina George ends the book with some Provence-style recipes (for that's where Perdu ends his tale) as well as a short interview, discussing the book.In case you are interested, you can visit a real book barge in Paris. It's called the Water and Dreams book barge (in English), and they are happy to recommend a book for you.Happy Reader"}, {"review_sentiment": 1.0, "review_text": "I felt bad for putting this book down, but at page 331, I couldn't handle it anymore. There are an obscene amount of meaningless metaphors on each page and nothing happens with the plot.In addition to the lack of pace and plot, the translation is off. The main character, a grown man in his fifties, talks about torrid sex then describes spooning as «you press your small bottom against my warm tummy.» So is Mr. Perdu a fifty year old who likes torrid sex or a kindergarten teacher explaining how we make babies? Why didn't the translator at least say 'belly'?"}, {"review_sentiment": 2.0, "review_text": "I listened to this audiobook because Steeve West is one of my favorite narrators.  However, he couldn't save this waste of time."}, {"review_sentiment": 4.0, "review_text": "A lovely love story.  Plus books and pirates (kind of) and loss and hope and lots of warm buttery croissants."}, {"review_sentiment": 4.0, "review_text": "An interesting, offbeat story about a Parisian book seller and his lost love.  This book makes you feel like you took a trip to France.  Nina George's description of Paris and the French countryside was lovely.  I enjoyed the story though it dragged at times.  However, I do recommend it."}, {"review_sentiment": 3.0, "review_text": "A little too much angst that goes on a little too long; lots of vivid and enjoyable descriptions of a river voyage through the French countryside. Twenty years is more than enough time to heal the wounds of lost love, and thus M. Perdu ( subtle?!) does not elicit the sort of sympathy the author hopes to invoke. The unlikely companionship of a few eccentric along the way populate the journey and provide some entertaining moments. The novel is a pleasant dalliance that asks very little from the reader."}, {"review_sentiment": 3.0, "review_text": "Meh"}, {"review_sentiment": 5.0, "review_text": "The Little Paris Bookshop introduces us to Monsieur Perdu, a man with a barge full of books and a heart full of pain. Floating on the Seine he prescribes books to those going through the woes of life. He doesn't think of himself as a bookseller, he's a literary apothecary, and he has an innate sense when it comes to matching someone with the book that it will take to mend their soul.It isn't until Perdu pulls up anchor and sets sail for the south of France that he begins to come to terms with his past, meeting unlikely characters along the way. Will this journey teach him how to live again?The Little Paris Bookshop is a quick read. It only takes one afternoon to leaf through this touching tale and it will leave you satisfied, with a refreshed sense of life's many chapters.You can find more of my reviews on my blog and Instagram account. Just look for Lina Loves Lit."}, {"review_sentiment": 2.0, "review_text": "Had a hard time getting into this book. I kept hoping it would get better, but found it rather boring. I guess if you like reading names of places in France that you might be familiar with, you might think differently."}, {"review_sentiment": 3.0, "review_text": "My book club selected this for our November read.  It wasn't one that I would have selected for myself; but that's the beauty of a book club!There were portions that I enjoyed, but I became frustrated with the main character (Jean) and his 20 year inability to move beyond his lost love.  Sigh.  I felt like I was re-reading the same portions again and again (because this was repeated and repeated and repeated).  I was looking for his breakthrough moment far sooner than it actually came."}]}, "authors": ["Nina George"], "isbn": "0553418793", "longitude": 2.3514992, "periods": ["2000s", "Recent Releases"], "title": "The Little Paris Bookshop", "word_cloud": "fifty own river barge dock year barge length truck trailer create shop shop divide subject matter effect feel customer need overcome tragedy special set recommend not feel wrong unfortunately able heal correctly try year try story unstoppable agent change shape quirky character indeed eventually life demand exhilarate enjoy even tear bit point bite twee time drag repetitive nice write interesting character rather fond seize life hand more probably need end recipe end tale well short interview discuss case interested visit real barge call barge happy recommend reader felt bad put page anymore obscene amount meaningless metaphor page nothing happen addition lack pace plot translation main character grow man fifties talk torrid sex describes spoon press small bottom warm fifty year old like torrid sex teacher explain make baby translator least say listen audio book favorite narrator however waste time lovely love story pirate kind loss hope lot warm buttery croissant interesting offbeat story seller lose make feel take trip description countryside lovely enjoy story dragged time however recommend much angst go long lot vivid enjoyable description river voyage french countryside year enough time wound lose love thus subtle elicit sort sympathy author hope invoke unlikely companionship eccentric way populate journey entertain moment pleasant dalliance ask meh introduce man barge full heart full pain float prescribes go woe life think literary apothecary innate sense come match someone mend pull anchor set sail south begin term meeting unlikely character way journey live quick take afternoon leaf touch tale leave satisfy refreshed sense life many find review blog account look love hard time get keep hop better found rather bore guess read name place familiar differently club select select beauty club portion enjoy become frustrated main character year inability move lose love felt portion repeat repeat repeat look moment far sooner actually come", "genres": ["Fiction & Literature", "Mystery & Suspense", "Romance"], "summary": "Monsieur Perdu can prescribe the perfect book for a broken heart. But can he fix his own?\r\n \r\nMonsieur Perdu calls himself a literary apothecary. From his floating bookstore in a barge on the Seine, he prescribes novels for the hardships of life. Using his intuitive feel for the exact book a reader needs, Perdu mends broken hearts and souls. The only person he can&#039;t seem to heal through literature is himself; he&#039;s still haunted by heartbreak after his great love disappeared. She left him with only a letter, which he has never opened.\r\n\r\nAfter Perdu is finally tempted to read the letter, he hauls anchor and departs on a mission to the south of France, hoping to make peace with his loss and discover the end of the story. Joined by a bestselling but blocked author and a lovelorn Italian chef, Perdu travels along the country’s rivers, dispensing his wisdom and his books, showing that the literary world can take the human soul on a journey to heal itself.\r\n\r\nInternationally bestselling and filled with warmth and adventure, The Little Paris Bookshop is a love letter to books, meant for anyone who believes in the power of stories to shape people&#039;s lives.\r\n", "asin": "0553418793", "rank": "5356", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51ARgTQV8rL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}