{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 39.6772236, "ratings": {"num_ratings": 8, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Another wonderful Jan Morris travel/real adventure story.I have read many of her books, currently reading Trieste. I recommend all of them.  F.G.Sanford M.D."}, {"review_sentiment": 4.0, "review_text": "Excellent account, thoughtfully written of the events leading up to the successful ascent, and the ingenuity of those involved without the technology of later years, especially relaying the news all the way to London the arrive in time for the Coronation and without rival newspapers suspecting anything of the success."}, {"review_sentiment": 5.0, "review_text": "Highly recommend this book, for anyone interested in the Everest history.Jan Morris has crafted, with her skill as a talented story teller, the first successful assent of Everest from the journalist point of view.Sent by the Times of London to get the exclusive story of the climb it weaves within the narrative of the quest , how Jan Morris was able to get the classic newspaper scoop on the historic climb to the summit, as her competitors tried in everyday possible way to hinder her.Wonderful."}, {"review_sentiment": 5.0, "review_text": "\"Coronation Everest\" is not only a fine historical record of the first ascent of Everest but also a gripping account of the youthful James Morris' success as \"The Times\" correspondent in winning acceptance by Hunt and his team and thus getting the inside running in the race to get the story back to London in time for the coronation of Elizabeth II. It is an extended piece of fine writing and superb story-telling."}, {"review_sentiment": 5.0, "review_text": "You have to hand it to the Brits: there were elements of almost mystical grace about the way they lost, or shall we say misplaced, their Empire.On dune and headland sank indeed the fire. But in its fading glow there were elements of decency and heroism, including Britain's lonely fight against Nazi Germany, survivors in the South Atlantic in 1982 singing \"look on the bright side of life\",  and here, the conquest of Everest by a bunch of amateurs and jolly Sherpas, the latter being drunk most of the time on Strange Brew indeed.Chronicled by a bloke who later became a lass who carried the message to Garcia with Tom Brownian pluck, who played up, played up, and played the game so that a chit of a girl could add a jewel to her crown, in a land no longer British.Having stumbled around mountains myself courtesy of the patient tutelage of Outward Bound, another British invention, I can relate to a non-mountaineer slogging up into the thin cold air. And rather than sentimentalising mountain vistas when they are seen up close and personal, Morris makes it clear that these places are alternately glorious, unearthly in their beauty, and demon-haunted, and terrible in their menace.The worst aspect of mountaineering for the tyro is, as Morris shows, the descent when everything has been done, but instead of basking in your accomplishment, you have to slog down, and gravity becomes your mortal enemy, driving weary bones into each other and mocking a descent that turns into another fall of man:From what height thou see'est, into what pit fall'nSentimentalists in the American wilderness wonder at the bad temper of pioneers who name such picture postcard views, Devil's Leap, Hell's Rockyard, Lucifer's Barstool and Jornado del Muerte. They need only walk the walk on the talking rocks that mock you in the sun, or on Morris' ice falls turning into vile mush to realize that we have to earn our ticket to the Sublime.Morris describes in this re-issued book, published long ago right after the great events, a gone world. Today, on Everest, every prospect pleases (well, many do) but only man is vile, and can pass people dying in the Yuppie way. That wouldn't have occured to the men he describes.The solution to the transmission problems alone is worth the price of the book: like the book The Victorian Internet, this book shows that before the Internet, the urge to connect time and space was real and people were willing to do what was necessary to get the message to Garcia.It is nobler to think that the Empire ended at \"Coronation Everest\", the decent bits, anyway. The Empire of time-serving colonial pukka sahibs and their impossible wives ended at Suez. The Empire of ideals, of Bertrand Russell, of hymn singing when the ship went down, of genuinely decent people doing their best, that ended on top of the world the week before the Coronation."}, {"review_sentiment": 5.0, "review_text": "Although the outcome is known, there is much to be gained from reading this book.Apart from the specific history of the climb which 'conquered' Everest (a much-used but dubious claim about one of the great feats of human endeavour, and one not used by those involved), I was particularly interested in several aspects:* The description of the expedition took place, the mechanics of it from someone outside the actual expedition;* The non-mountaineer's view of mountain-climbing and experiences in the Khumbu ice-fall and Western Cwm especially. This was the experience many an armchair-Everesteer would wish for themselves, I am sure;* The journalist's view of the people involved - all the other accounts I have read have been written from the point of view of being 'insiders' in the ecpedition - Hunt, Hillary, Tenzing, for example* The mechanics of how Morris set up 'exclusive' media coverage from the mountain! It is amazing to think that it was a mere 50 years ago that messages were taking 8 days to reach London, when nowadays we hear live radio broadcasts of people dying in snowstorms, have immediate Internet access to expedition journals etc.Thoroughly recommended for anyone with any interest at all in the subject."}, {"review_sentiment": 5.0, "review_text": "This slim volume details the trip of London Times journalist Jan Morris with the 1953 British Everest Expedition.  It provides interesting and unique first-hand accounts of Hillary, Tenzing, and other expedition personnel, as well as beautifully written descriptions of the landscape and persons encountered on the expedition.  It is written in the style of its day - English \"Public School\" in tone - and reflects a love and command of the English language all too lacking in today's expedition accounts.The account flows easily and draws the reader along with the expedition.  Despite knowing the outcome, the reader is kept interested by the tone and language, and by the behind-the-scenes looks at how this mammoth effort came together, and its ultimate effect on those on the mountain and those back home in England.  For example, as the book opens on the eve of Elizabeth II's Coronation, we see Field Marshal Montgomery reading the Time's account of Hillary and Tenzing's triumph as he waits in robes to process in the Coronation parade.  Small asides such as this give the book its unique flavor, and make it an interesting and invaluable addition to the armchair (or actual) mountaineer's collection"}, {"review_sentiment": 5.0, "review_text": "This is a wonderfully written book of the events surrounding the historic  Everest expedition of 1953 which saw Edmund Hillary and Tenzing Norgay  summit Mount Everest. It was written by  special correspondent for The  London Times, James Morris, who accompanied the expedition and first broke  the news to the world of the successful summit. The news fortuitously  reached England on the eve of Queen Elizabeth's the II coronation of June  2, 1953, and was the cause for much nationalistic pride. Hence, the name of  the book.The book is reflective of the time in which it was written and  evokes a feeling of an era long gone. Therein lies its charm. Nostalgia  buffs will love it, as will those readers looking to consume anything about  Everest. It will not disappoint, though the book is not about the climb to  the summit in the strictest sense. The book chronicles in great detail the  author's journey to Everest, as well as his personal experiences and  observations while at Everest, waiting to break the story of the end result  of the historic climb to the summit. It also chronicles the cloak and  dagger methodology which he employed in order maintain exclusivity for The  London Times.It should be noted in the interest of clarity and to avoid  confusion, that times do indeed change. The author, James Morris, underwent  a gender change subsequent to the original 1958 publication of this book.  When the book was released again, however, the publisher did so under the  name which the author had since adopted, Jan Morris. James or Jan, the  author is a hell of a writer, and the book is well worth reading."}]}, "authors": ["Jan Morris"], "isbn": "0571219446", "longitude": -95.4247001, "periods": ["1900s"], "title": "Coronation Everest", "word_cloud": "wonderful adventure many currently read recommend excellent account thoughtfully write event lead successful ascent ingenuity involve technology later year especially relay news way arrive time rival newspaper suspect anything success recommend anyone interested craft skill talented story teller first successful assent journalist point get exclusive story climb weave narrative quest able get classic newspaper scoop historic climb summit competitor try everyday possible way hinder fine historical record first ascent also grip account youthful success correspondent win acceptance team thus get run race get story back time extend piece fine writing superb hand brits element almost mystical grace way lose misplace dune headland sink indeed fire fade glow element decency heroism include lonely fight survivor sing look bright side life conquest bunch amateur jolly latter drunk time bloke later become lass carried message pluck play play played game chit girl jewel crown land longer stumble mountain courtesy patient tutelage british invention relate slog thin cold air rather sentimentalize mountain vista see close personal make clear place alternately glorious unearthly beauty terrible worst aspect mountaineer tyro show descent everything do instead bask accomplishment slog gravity become mortal enemy drive weary bone mock descent turn fall man height thou pit american wilderness wonder bad temper pioneer name picture postcard view need walk talk rock mock sun ice fall turn vile mush realize earn ticket describes publish long ago right great event go world today prospect please well many man vile pas people die way men solution transmission problem alone worth price victorian show urge connect time space real people willing necessary get message nobler think end decent bits anyway colonial pukka sahib impossible wife end ideal hymn sing ship go genuinely decent people best end top world week outcome know much gain reading specific history climb dubious claim great feat human endeavor use involved particularly interested several aspects description expedition take place mechanic someone actual expedition view experience especially experience many sure journalist view people involve account write point view expedition tense mechanic set medium coverage mountain amaze year ago message take day reach nowadays hear live radio broadcast people die snowstorm immediate access expedition journal recommend anyone interest subject slim volume detail trip journalist british expedition provide interesting unique account hillary expedition personnel well beautifully write description landscape person encounter expedition write style day tone reflect love command language lack today expedition account flow easily draw expedition know outcome keep interested tone language look mammoth effort come together ultimate effect mountain back home example open eve see reading account triumph wait rob process parade asides give unique flavor make interest invaluable addition armchair actual mountaineer collection wonderfully write event surround historic expedition saw summit write special correspondent accompany expedition first break news world successful summit news fortuitously reach eve cause much nationalistic pride name reflective time write evokes feel era long go lie charm buff love reader look consume anything disappoint climb summit strictest sense chronicle great detail author journey well personal experience observation wait break story end result historic climb summit also chronicle cloak dagger methodology employ order maintain exclusivity note interest clarity avoid confusion time indeed change author underwent gender change subsequent original publication release however publisher name author adopt author hell writer well read", "genres": ["History", "Travel Writing", "Sport"], "summary": "Coronation Everest offers a breathtakingly intimate evocation of the most famous of all mountaineering exploits - and of perhaps the last great old-fashioned Fleet Street scoop.\r\n\r\n\"Exquisite, powerful . . . I can think of no better way of commemorating British exploration's culminating triumph.\" Simon Winchester\r\n\r\n'It was Morris who broke the news that a British-led expedition had conquered Mount Everest the day before the Queen's coronation in 1953 . . . Allied to physical courage in getting down the mountain and a dogged resourcefulness in getting the news home, Morris scooped the world and was launched on one of the most remarkable literary careers in the second half of the twentieth century.' The Guardian\r\n\r\nJan Morris's collection of travel writing and reportage spans over five decades and includes such titles as Venice, Coronation Everest, Hong Kong, Spain, Manhattan '45, A Writer's World and the Pax Britannica Trilogy. Hav, her novel, was shortlisted for the Booker Prize and the Arthur C. Clarke Award.", "asin": "0571219446", "rank": "1627421", "city": "Mount Everest", "image": "https://images-na.ssl-images-amazon.com/images/I/51luNlX8tIL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}