{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": -12.0621065, "ratings": {"num_ratings": 49, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Think this is my favorite Vargas Llosa book after Feast of the Goat."}, {"review_sentiment": 5.0, "review_text": "There is no better writer in modern literature than Mario Vargas Llosa because he introduces you to the history of Peru and other South American countries and entertains at the same time. His books are easy to read, the language flows."}, {"review_sentiment": 5.0, "review_text": "The main idea of reading this book is to think, that's why a lot of people don't understand the meaning behind every character's way of acting, it's really complex, but shows how reality is. Some of them represent corruption, strength, the fear of abuse, how these kids adapted in order to survive in that school is the most impressive part of the book. That's why I give 5 stars."}, {"review_sentiment": 4.0, "review_text": "This is a multi-layered tale centered around a group of trouble-making boys in a Peruvian military academy for teenagers. They rebel against their superiors, their past lives, their families and sometimes each other. Although it has a very thin plot for such a long book (a crime sets the story in motion in the first half of the book, and a mystery/thriller emerges in the second half), it is still an immersive reading experience with a cumulative power.That power comes largely from the lengthy sections that delve deeply into the lives, thoughts and personalities of the major characters. Pages of unbroken text go by with no pauses or paragraphs, as you follow the rushing stream of consciousness that runs through their minds. In these passages current, contemporary events alternate with recollections of the past and time jumps abruptly from present to past and back again. These interwoven narratives describe the circumstances that led these boys to the oppressive, regimented, belligerent world of the military school, and how the experiences, culture and traditions of the academy change them.They are young boys, so the psychologies examined in great depth are those of personalities still being formed. And the actions portrayed are often the impulsive and unguarded acts of affection and violence that one expects from adolescents. What makes the book most rewarding is the rich and patient accumulation of detail. You believe in the truth and accuracy of this realist world, and in the daily events (mundane and extraordinary) of these young lives. Whether it's the very specific geography of Lima, the rough frictions of life in close quarters at this restrictive boarding school, or the more expansive scenes of life, longing, romance and misery outside the walls of the academy.... all these voluminous details are thoroughly believable and the compassion for each character, good or bad, is genuine.One note: at a talk I heard the author say that the English translation is good but for one element. In the original version, each boy has a very particular Spanish idiom or dialect that makes each voice distinctive and unique. In the English translation, this does not come through, and as a result each boy's inner voice tends to sound somewhat the same. Since none of these interior monologues are titled by name of the character (as they are, for example, in Philipp Meyer's \"The Son\"), it is sometimes difficult to discern whose thoughts or story you are reading as these passages, laced throughout the book, occur. Perhaps a future translation will introduce clear English idioms that give each character a more distinctive voice on the page. But even in this version this first novel by the future Nobel winner is an impressive debut, and the beginning of a large body of deservedly-renowned work."}, {"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 3.0, "review_text": "A bit disappointed - the plot only unravels (a little bit) towards the end. Unsure how he could have won the Nobel Peace Prize for his books."}, {"review_sentiment": 2.0, "review_text": "A confusing and ugly book."}, {"review_sentiment": 3.0, "review_text": "Very earthy,to the point and entertaining to the end.  Not as good though as his best 'The discreet Hero'."}, {"review_sentiment": 5.0, "review_text": "I'm a huge Llosa fan, though I've only read a of his books so far. If you've read his books and enjoyed them, I think you'll have a similar experience here and you will appreciate seeing what his earliest novel's writing was like. Good read, but you have to dedicate time to read for longer stretches, because there are a number of characters and the chapters are told from a variety of perspectives. Better read while not on the run"}, {"review_sentiment": 1.0, "review_text": "I bought it because he won the Nobel Prize.  The selection criteria of the Nobel committee are beyond my comprehension."}]}, "authors": ["Mario Vargas Llosa"], "isbn": "0571173209", "longitude": -77.0365256, "periods": ["1900s"], "title": "The Time of the Hero", "word_cloud": "favorite better writer modern literature introduce history american country entertain easy language flow main idea read lot people understand mean character way act really complex show reality represent corruption strength fear abuse kid adapt order survive school impressive part give star tale center group boys peruvian military academy teenager rebel superior past life family sometimes thin plot long crime set story motion first half emerges second half still immersive reading experience cumulative power come largely lengthy section delve deeply live thought personality major character unbroken text go pause paragraph follow rush stream consciousness run mind passage current contemporary event alternate recollection past jump abruptly present past back interwoven narrative describe circumstance lead boy oppressive regiment belligerent world military school experience culture tradition academy change young boy psychology examine great depth personality still form action portray often impulsive unguarded act affection violence expect adolescents make reward rich patient accumulation detail believe truth accuracy realist world daily event mundane extraordinary young live specific geography rough friction life close quarter restrictive board school expansive scene life long romance misery wall academy voluminous detail thoroughly believable compassion character good bad note talk hear author say english translation good element original version particular spanish idiom dialect make voice distinctive unique translation come result boy inner voice tends sound somewhat none interior monologue title name character example sometimes difficult discern thought story reading passage lace occur perhaps future translation introduce clear idiom give character distinctive voice page even version first future winner impressive debut begin large body work excellent bit disappointed plot unravels little bit towards end unsure confusing ugly very earthy point entertain end not good best discreet huge fan far enjoy think similar experience appreciate see earliest write dedicate longer stretch number character chapter tell variety perspective better buy selection criterion committee comprehension", "genres": ["Fiction & Literature"], "summary": "The action of The Time of the Hero, Nobel Prize-winning author Mario Vargas Llosa's first novel, takes place at the Leoncio Prado Military Academy in Lima, Peru. \r\n\r\nThere, four angry cadets who have formed an inner circle in an attempt to ward off the boredom and stifling confinement of the military academy set off a chain of events that starts with a theft and leads to murder and suicide. \r\n\r\nThe Time of the Hero presents, with great accuracy and power, the cadets' nightmare life: brutal initiation rights, poker in the latrines, drinking contests; and, above all else, the strange military code which, whether broken or followed, can only destroy.\r\n\r\nWhen The Time of the Hero was first published in Peru in 1962, it was considered so scandalous that a thousand copies were burned in an official ceremony at the Leoncio Prado Military Academy. That same year, the book received the Biblioteca Breve Prize, an award given to the best work of fiction in the Spanish language.", "asin": "0571173209", "rank": "499293", "city": "Lima", "image": "https://images-na.ssl-images-amazon.com/images/I/51I9nRzG3WL.jpg", "country": "Peru", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}