{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 4, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "you should read this is you have ever been hung up on the wrong guy..."}, {"review_sentiment": 4.0, "review_text": "I waited for this ebook a long time. It didn't disappoint. I loved The man who loved children an Australian classic, and this other offering is really good. Christina Stead was a great writer."}, {"review_sentiment": 1.0, "review_text": "I just could ot get into this book.  Very frustrating characters and a pitiful slow storyline.  I do not advise spending any cash for this."}, {"review_sentiment": 5.0, "review_text": "When I was a young woman, I read this novel at the urging of a lecture from my university. I'm glad I did. For Love Alone is a story that many young woman should be able to relate to. Theresa Hawkins is feisty, strong willed and believes that she loves the cruel and calculating Jonathon Crowe, despite his obvious indifference. It is only through the interference of James Quick, Theresa's employer that she learns of love and her power as a woman.For Love Alone is a wonderful story of a young woman's journey to maturity by the author of \"The Man Who Loved Children\"."}]}, "authors": ["Christina Stead"], "isbn": "0571256139", "longitude": 151.2164539, "periods": ["1900s"], "title": "For Love Alone", "word_cloud": "ever hung wrong guy wait book long time disappoint love man love child australian classic offering really good great writer very frustrating character pitiful slow story line advise spend cash young woman urge lecture university glad story many young woman able relate feisty strong willed believe love cruel calculate obvious indifference interference employer learn power wonderful story young woman journey maturity author man love", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "High-minded, independent, imaginative, Teresa Hawkins knows only one commandment 'Thou shalt love'. Emotionally starved by her ramshackle family, Teresa searches for fulfilment outside her stultifying life as a working girl in a large city. \r\n\r\nObsessed with love and sex she pins her affection on the first possible object, the egotistical Jonathan Crow, a poverty-stricken tutor who coaches her in Latin. Teresa preserves this love in the face of his indifference, contempt and ill-usage, imprisoned by her belief that 'to love is to give for ever without stint, and not to ask for the slightest thing'. \r\n\r\nIt is only through another man - her ebullient and warm-hearted employer James Quick - that Teresa comes to understand her power as a woman, and emerges from obsession to a real consciousness of sexuality and love. \r\n\r\nSet in Sydney and London, For Love Alone, first published in 1945, is one of Christina Stead's finest novels.", "asin": "0571256139", "rank": "4824661", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51ycXAfrXlL.jpg", "country": "Australia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}