{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 8, "rating": 2.9, "reviews": [{"review_sentiment": 2.0, "review_text": "Not up to Kureishi's usual tight prose and thoughtful insights. It read more like a Joanna Trollope or Maeve Binchy.I've enjoyed so many of his books in the past, this one is disappointingly weak."}, {"review_sentiment": 3.0, "review_text": "Hanif Kureishi is a talented author capable of writing amazing, unforgettable novels (\"Intimacy\") but with \"Gabriel's Gift\", Kureishi treads familiar ground and ultimately creates a novel that does not do more than entertain.  Gabriel's parents are separated, his aging rock star dad holing up in a dingy dump trying to scrape together cash while his mom struggles as a waitress and begins dipping her toes in the dating pool.  Gabriel ditches school to spend days with his dad, visiting old rock stars as his dad tries to work every angle he knows to get some money.  His mom hires a Russian nanny to watch Gabriel, Gabriel discovers he has a talent for art, and some eccentric but predictable characters pop up and influence the action.  Unfortunately, that is about it.  The book is pretty straightforward, with dialogue driving the action and little commentary or philosophizing by Kureishi.  The writing is strong but the story- lacking originality and scope- does not do it justice.  \"Gabriel's Gift\" was an enjoyable read but I am not sure I will remember it months from now."}, {"review_sentiment": 4.0, "review_text": "The protagonist of Hanif Kureishi's delightful novel is Gabriel, a fifteen-year-old London schoolboy trying to come to terms with a new life, after the equilibrium of his family home has been shattered bt the ousting of his father.Fending for himself, as well as providing emotional support to his confused (and confusing) parents, Gabriel is forced to grow up quickly. The only support he can draw upon is from his remembered twin brother, Archie, and from his own 'gift', which is accompanied by sensations that urge him inti areas of life requiring the utmost courage and faith. A chance visit to seventies rock star Lester Jones crystallizes the turbulent emotions inside Gabriel, and helps him to recognize and engage with his gift.--- from book's back cover"}, {"review_sentiment": 3.0, "review_text": "It is difficult to tell why Hanif Kureishi did not come up with anything new but decided to replay the themes of his most successful novel The Buddha of Suburbia. However, he did when he shouldn't have. This is a nice novel but there is so little inside that you may pass it by and never miss it. If you don't know Kureish yet - get Buddha. Gabriel's a mistake."}, {"review_sentiment": 4.0, "review_text": "Since the mid-80s when Kureishi started to write I have been a close follower of his fiction work and screenplays. His main characters in his books whether in the Black Album, The Buddha of Suburbia and My Beautiful Laundrette are always at the crossroads. His characters live and mostly survive in a world accentuated by racial and sexual politics and loss and rediscovery of identity. Gabriel's Gift is a milestone in this career, more subtle in humour, more introspective yet lives up to an author's fame as a writer who knows how to use language.Gabriel's relationship with his Dad and his description of people who are lost in the meanders of the post-60s world is touching and powerful. Especially the first chapter of the book should be a standard text in literature and writing classes."}, {"review_sentiment": 2.0, "review_text": "Words. Words are the key of the great literature. Words are in fact, the thing which makes art, however you look upon it. And there is no artistic masterpiece without words (at least when it comes down to literature).This novel is almost completely written in dialogue. It's the dialogue between Gabriel and Rex, Gabriel and his mother, and Gabriel and every other character in book. But, there is nothing in this book beside that dialogue.It's an endless parade of talking, words without emotion in them, whithout and sense of fear, exasperation, passion, just plain old worlds, full of clichés, which are supposed to make a statement about the outside world, and about the mothern ways of living in contradictio with old (60's, 70's) way of live. They try to be critique of media, of famous people, and poshy ladies in rich outfits. But they are not.This kind of story was told many times before, each period has it's own, \"manifesto\" so to say, and many times it was better said by the authors who had more talent than Kureishi.When I completed this book, I felt nothing. Just emptiness, which cannot fill the void inside of me that need to be fed...wiih words.This book represent in what has realism in literature evolved during the 90's, and whatever is that called now, the fact stays: It wasn't succesful evolutionary proces.I give this book 2 stars only for the idealistic traces of dark romantism of a lost child in a big town full of bad people. And only for that..."}, {"review_sentiment": 4.0, "review_text": "Society is still as dark and deceptive as ever but Gabriel, Kureishi's most recent teenage protagonist, has the gift to dispel its gloom.  Gabriel's ill-suited parents have finally separated, he is bored, left to his own devices and well on his way to becoming a drug addict.  But, instead of following all the easy paths to becoming a failure, he decides to take his parents' problems into his own hands.  Although the story is unrealistically idealistic, it carries with it an unmistakable aura of hope, in the modern shape of fame.  Fame is the gift and the fairy that can deliver anybody in style from all the difficulties of twentieth-first-century living.  Once more Kureishi injects his characteristic comedy and light-heartedness into a serious subject without too much irreverence and with a little more hope.  As a modern fairy-tale, 'Gabriel's Gift' is able to offer a nice dream with just enough kick in the backside to keep it real."}, {"review_sentiment": 3.0, "review_text": "Hanif Kureishi's fiction is one of my minor addictions. I love his irreverent wit and the mastery of his dialogue. He is a truly gifted observer and listener. Kureishi is an interesting author because he vacillates between the self-assurance of the satirical writer and the vulnerability that is part of being human. He used to rage against the very people by whom he wanted to be loved - as if they could never love him enough. In this sense, \"Intimacy\" is his most instructive and illuminating book.Gabriel's Gift is, in some ways, a re-run of his first novel, \"The Buddha of Suburbia\", this time with a happy end for the characters. Kureishi seems to have mellowed a lot since his earlier writings, but this change has not yet translated into a new style of writing or into new ideas. Gabriel's Gift is a book that gave me the sense of the author wanting to explore his roots as an artist in order to get somewhere, but he did not quite know where (which, of course, is not the hallmark of a great novel). But then again, Hanif Kureishi is always in search of himself. It is one of his strengths. Sometimes he delivers great writing along the way, at other times he does not."}]}, "authors": ["Hanif Kureishi"], "isbn": "0571209297", "longitude": -0.12574, "periods": ["1900s"], "title": "Gabriel's Gift", "word_cloud": "not usual tight prose thoughtful insight enjoy many disappointingly weak talented author capable write amaze unforgettable novel tread familiar ground ultimately create entertain parent separate age rock star dad hole dingy dump try scrape together cash mom struggle waitress begin dip toe date pool ditch school spend day dad visit old rock star dad try work angle know money mom hire russian nanny watch discover talent art eccentric predictable character pop influence action unfortunately pretty straightforward dialogue drive action little commentary philosophizing writing strong lacking originality justice enjoyable sure remember month protagonist delightful schoolboy try come term new life equilibrium family home shatter tb oust well provide emotional support confuse confuse parent force grow quickly support draw remember twin brother accompany sensation urge inch area life require utmost courage faith chance visit seventy rock star crystallize turbulent emotion help engage back cover difficult come anything new decide replay theme successful however nice little inside never know yet mistake start write close follower fiction work screenplays main character always crossroads character live mostly survive world accentuate racial sexual politics loss rediscovery identity milestone career humor introspective yet live author fame writer know use relationship description people lose meander world touch powerful first chapter standard text literature writing class word key great literature fact thing make art however look artistic masterpiece word least come literature almost completely write dialogue dialogue mother character nothing beside endless parade talk word emotion sense fear exasperation passion plain old world full cliche suppose statement world mother way live contradiction old way live try critique medium famous people posh lady rich outfit kind story tell many time period manifesto say many time better say author talent complete felt nothing emptiness fill void inside need feed wish represent realism literature evolve call fact stay successful evolutionary give star idealistic trace dark romantism lose child big town full bad people still dark deceptive ever recent teenage protagonist dispel gloom parent finally separate bored leave device well way become drug addict instead follow easy path become failure decides take parent problem hand story unrealistically idealistic carry unmistakable aura hope modern shape fame fairy deliver anybody style difficulty live once inject characteristic comedy serious subject much irreverence little hope modern able offer nice dream enough kick backside real fiction minor addiction love irreverent wit mastery dialogue truly gift observer listener interest author vacillates satirical writer vulnerability part human use rage people want love never enough sense instructive illuminating way first time happy end character seem mellow lot earlier writing change yet translate new style write new idea give sense author want explore root artist order get somewhere quite know course hallmark great always search strength delivers great write along way time", "genres": ["Fiction & Literature", "Humour"], "summary": "Gabriel's father, a washed-up rock musician, has been chucked out of the house. His mother works nights in a pub and sleeps days. Navigating his way through the shattered world of his parents' generation, Gabriel dreams of being an artist. He finds solace and guidance through a mysterious connection to his deceased twin brother, Archie, and his own knack for producing real objects simply by drawing them. \r\n\r\nA chance visit with mega-millionaire rock star Lester Jones, his father's former band mate, provides Gabriel with the means to heal the rift within his family. Kureishi portrays Gabriel's naïve hope and artistic aspirations with the same insight and searing honesty that he brought to the Indian-Anglo experience in The Buddha of Suburbia and to infidelity in Intimacy. \r\n\r\nGabriel's Gift is a humorous and tender meditation on failure, redemption, the nature of talent, the power of imagination -- and a generation that never wanted to grow up, seen through the eyes of their children.", "asin": "0571209297", "rank": "10958076", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41UJBfjaocL.jpg", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}