{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 25, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "It's equal parts Pynchon and Bukowski.  It's not as good as any novel by David Foster Wallace or John Andrew Frederick.  It's by turns poetic and sordid.  It's been called masterly--by those who consider Vollman a master.  It's far more accessible than any of V's so-called historical novels; in fact, it's a kind of a history of an SF (oh how people from \"The City\" hate that term--just like anybody in his right mind hates the term \"Cali\"; I know:  I lived there for a long time!) long long gone by.  San Francisco now?  Compared to the period or epoch or whatever Vollman's limning?  Candyland.  I don't know why Vollman's name isn't more often bandied about as one of America's great novelists.  I think he's like a beautiful but very very tall woman:  intimidating.  Surely he himself, given the mucky muck here, is as much of a superperv and deep romantic as is his stand-in/narrator.  I LOVED that he occasionally referenced George Eliot and Dostoievski and that the dysfunctional sleuth-and-moneyman-and-matron family was a family of READERS (they discuss the books they're reading).  I liked this book quite a bit; you don't have to pore over it the way you might have to approach the aforementioned classics.  It's a beach read!  (A beach like Normandy, circa 1944)."}, {"review_sentiment": 5.0, "review_text": "almost thru here (w/ the book). the kind of novel you dream abt - i have abt 50 pages left and i dream of longer, extended endings carrying the thing past where vollmann leaves it. my first intro to his writing (europe central next). parts will bore you to tears, but they are good tears. the writing is great but infuriating (how many times have you screamed when faulkner used 'myriad' once again? vollmann gets into sections where you have to look up a word that he then repeats over and over and...you get the idea). still, a better book than most of the things i/ve been told are 'important' in the last 40 years. gonna spend more time w/ this author..."}, {"review_sentiment": 4.0, "review_text": "After I reviewed the gloomy obsessions of love or lust in the companion piece for this novel, in the briefer \"Whores for Gloria\" set in the Tenderloin and \"The Butterfly Stories: A Novel\" in Thailand, this sustained immersion into, as of the early '90s, the not-quite-tamed streets where Vollmann lived and wandered takes its time as it drew me in. Whereas the two earlier novels followed a misfit narrator into the lairs and bars where women plied their trade and sought to secure his affection, for this 2000 noirish tale, we get a gumshoe protagonist and sly antagonist who are brothers, to square off.Yes, Cain and Abel, good and evil, are early on referenced via the Gnostics. Vollmann sets up well in its early stages the predicament of another forlorn woman whom the main character longs to comfort and keep, but cannot. Whereas Jimmy (he gets a cameo here, and so does the author as a \"moon-faced\" journalist) for Gloria and the \"journalist\" for Vanna in \"Butterfly\" found their fevered quests dragging them deep, Tyler (Hank to his louche lawyer brother, John) loses his brother's wife, Korean-American Irene, to death. Her plight, like that of other bereft men and women Vollmann tends to listen to and dramatize (such as John's mistress Celia), lingers. We miss her. Accepting his depictions of these beaten down folks, we side with Hank, Celia, and Irene. These, to me, proved more engaging than the tales of grimy johns.Into this seedy situation, Tyler's sent by one Brady (a cartoonish conveyance of greed and prejudice, reminding me of the White Power + Light villains in \"You Bright and Risen Angels\") to seek out the Queen of the Whores; his brother is also hired by the same tycoon, so the two stare each other down. John is a wonderfully boorish greed-is-good type, akin to the photographer in \"Butterfly\"; against him, Vollmann uses the familiar for him perspective of the bullied boy turned hesitant man as Tyler.Not only San Francisco's fog and vistas but Sacramento's railyards and dust gain attention, too. There's a pleasure in viewing California through Vollmann's eyes, and after the urban clang and urine smell evoked in the Tenderloin, the Tyler brothers' overlooked hometown (now Vollmann's) gains probably one of its first depictions by a major novelist. He avoids cliché about the Golden State, as one who while born there grew up as a child of a professor in Indiana and New England, so his p-o-v is deepened by his travels and his experiences before he came back to explore Californian byways.There's powerful moments, often in scenes that may not push the plot along much, but which reveal characteristic observations of the author filtered through his put-upon protagonists and those they seek out for support. In a bridal registry at Macy's on Union Square, Irene and John's brother Hank go to pick out bone china. The oddness of that itself stands for their relationships, and Vollmann enhances this tilt by a matter-of-fact observation about how the acquisition of goods such as porcelain gravy dishes but who cannot enjoy them, no less than any product, dispirits those who value value. John seems to stand in that category; Hank resists this classification; Irene and sensitive souls give in.Vignettes also help enrich characters such as Beatrice, a Mixteca whom we follow in Mexico before coming to San Francisco establish her survival skills as she is reduced to earn a living by prostitution. The Queen whom she and others circle about gains a predictably (given also Vollmann's knack for insect and biological analogies) hive-like domination, and after she is introduced a fifth of the long way in, the novel invites some allegorical interpretations. It also enters disturbing considerations, true to the nature of Vollmann's moral calculus in \"Rising Up and Rising Down\", of Dan Smooth's sexuality when judged illegal or immoral, and book X offers a similar sidestep into the injustice of bail, as the author observes in Sacramento. This section could have graced RURD particularly well.After the bail interlude, we return to the Queen and her minions; Tyler gets sucked into her web, and this section, while less inventive as what preceded it, brings a \"false Irene\" among those under sway. Two-thirds into the novel, John too finds himself lured to the Tenderloin, as Brady's Boys, a vigilante faction purporting to want to clean up the streets, seeks to take down the Queen and her royal coterie.Vollmann peeps in, via an aside about his agent's complaints about the manuscript, and in section 476 he provides a clever elaboration of a theme which, by canonical and apocryphal Scriptural colophons he inserts throughout. The Mark of Cain on Tyler and others under the Queen's sway proves their membership in the Canaanites, whose practices the Hebrews and their moral heirs the Christians and in this case, Jonas Brady's capitalists, seek to eliminate as immoral, if only to boost their profits from a strange even by Vollmann standards Feminine Circus in Las Vegas, staffed by freakish sex workers. Some of this set-up never gets fully explained, but its veiled mystery suffices to set up odd scenes.Near the end, as Henry \"Hank\" Tyler sentences himself to destitution, selling off first gun, then car, but toting a bible, he roams not the Tenderloin but Coffee Camp near Sacramento's vast railyards. Vollmann's experience riding the rails heightens his scenes set among the migrants and misfits. Tyler's travels take him to Miami, Seattle, and Slab City, where Vollmann explored this desert sprawl later in \"Imperial\" (also reviewed by me). This last tenth of the book accelerates as Tyler's increasingly unhinged quest finds him battling Jesus, if at a remove, and searching for the Queen, Irene, and his lost sense of belonging.In one of his typically revealing endnotes, Vollmann comments that his editor at Viking, Paul Slovak, advised him to trim the book by a third. He refused, but he took a third cut in royalties. This dogged commitment to ensuring his works, big as they can be, remain faithful to his vision may annoy some with less patience for some of the chatter between the whores and some of the habitual roaming Tyler engages in, but in parts on the vagaries of bail, the chapter on Geary Boulevard and Street's sudden run-in one-way at the Tenderloin, or the Buddhist and Christian-Canaanite allusions, a patient reader will forgive some of the excess. Not to mention fine metaphors--my favorite compares a blackening banana to a \"scrambled tiger.\" Amid yellow hills and fog, this novel pairs off brothers contending for the attentions not only of Irene, but for many women who endure a world that diminishes in its pity."}, {"review_sentiment": 5.0, "review_text": "A Vollmann that had slipped under my radar until recently. Don't miss any of his work, the guy's a master."}, {"review_sentiment": 1.0, "review_text": "We left the book in San Francisco in the hotel room. Potentially the next visitorswould be interested in this local history.  We found the prose to be less than stellarand the topic could have been presented differently."}, {"review_sentiment": 5.0, "review_text": "I've discovered after loaning this book to numerous people, that it will either be read in one dog-like gulp, or be forever shelved after the first 200 pages. Reading Vollmann is a bit like eating an hallucinogenic fungus, in that you have to keep it down for a while to get the full effect. Many don't have the stomach.But should you succeed in getting it all into the bloodstream...boy. Hold on tight and don't bother screaming.Knowledge can not be differentiated into GOOD and BAD. Vollmann's wisdom is derived from his ability to learn about EVERYTHING, and illustrated by his ability to cultivate beauty from horror in prose so rich and engaging and smothering one could drown in his words while madly laughing. I don't need to offer yet another description of what this book is about, as everyone knows it's about suicide on many levels, and drugs and whores and hopeless love with all its poisoned teeth. And if you can take it, you will be a wiser person for it. Just don't plan on being any happier."}, {"review_sentiment": 3.0, "review_text": "the city is san francisco.  henry tyler is one more down on his luck detective.  maybe his luck is changing when he gets a job working for jonas brady.  jonas brady wants tyler to find the mythic queen of the whores.  henry tyler has a brother, john. john tyler works for the firm of rapp and singer.  a plum falls in john's lap when he lands the jonas brady account. jonas brady is about to open an extravaganza in las vegas, the feminine circus.  john is married to a korean american, irene. john's brother is in love with irene. the mother of john and henry lives in sacramento.  she's dying. henry doesn't visit his mother as often as john.  john resents his brother's disregard of their mother.  henry is taking too long to find the queen of whores, so brady fires him. henry befriends the prostitutes of the tenderloin and the mission district of san francisco, skid row areas, and joins the royal family of abused street prostitutes under the protection of the queen of whores, until his life spirals further down -- more like pilgrim's progress than dante's divine comedy, as henry searches for missing persons and for, kind of, the meaning the life. meanwhile, brady launches a campaign to capture the queen of whores as if he were hunting king kong.after reading hundreds of pages of repeated descriptions of  metaphors of the night sky, stinking whores fighting, cussing, doing drugs, spitting and urinating in mouths, puking and street walking, i  wanted the story to be done. then came las vegas.  and as nasty and sordid as life on  san francisco's skid row was, feminine circus was as demeaning and horrific as anything ever created in fiction. and then back to the streets of san francisco. the moral of the story:  there are situations for women worse than street prostitution; therefore, what, leave prostitution alone?and yet, as a reader, i'm willing to accept vollman's world of the wretched, the ones in body and the ones in spirit, if only he did not lose his way so often, more often than the endless wanderings of henry tyler, the canaanite, one more bearer of the mark of cain. how many times can all of the streets of san francisco be traversed?  and does every detail of the landscape on a cross country trip need to be mentioned?  and those author intrusions, which aren't exactly nods toward john fowles' the magus and the french lieutenant's woman -- vollmann as vollmann intrudes because he can't stop writing.  I used to wonder if I would had found  norman mailer's novels, the deer park and barbary shore, enjoyable, had both books been longer. vollman has answered my question by including huge chunks of passages in the tone of those mailer novels.  the answer is no, longer is not better.  vollmann's editor suggested cuts to this novel, and vollmann chose instead to take a cut in royalties (pun, I hope, not intended).  so goes integrity.there's wonderful stuff in this book.  but the story fails to resonate, too much description gets in the way. had i read the royal family in my early 20s when i was just getting started reading this literary stuff, i might had devoured vollmann's pottage of words as a feast, and believed in my heart i held in my hands a masterpiece.  these days, finishing it all was an accomplishment."}, {"review_sentiment": 5.0, "review_text": "Even as an avid reader, I was a little intimidated by the sheer heft of this book, but I found myself devouring it as fast as I would a 150-page novella! The writing was so beautiful, simultaneously poetic and gritty, and the worlds Vollmann paints for us - surreal underground landscapes of hookers, hobos and criminals - are at turns realistically rendered and hallucinatory. Despite its length, this is one I can see myself reading over and over."}, {"review_sentiment": 5.0, "review_text": "Where to begin with this post-modern bible of Canaan? What a beautifully ugly opera of San Francisco's Tenderloin; paean to society's wretched refuse! Yet another majestic, narcissisticly groveling novel is unleashed upon decent society by William Vollmann - this particular volume reveling in its own destitute spirit. With lines like, \"A piece of my soul I'll sell you, by all means; like other prostitutes I've been amputating meaty hunks of myself for all comers ever since the Vice Squad shut Eden down\" (754) how can you go wrong? Come follow Henry Tyler as he runs from Jesus . . . and \"Brady's Boys\", the vigilante do-gooder thugs using his name in vane.Loaded boxcars of similes and metaphors that only Vollmann - under the influence of the Comte de Lautreamont - could concoct (neon signs shine like \"stars\", books open their \"thighs\", \"octopus minded\" wives grapple husbands, \"I Ching ideograms\" can be deciphered in the grating of Chinatown windows . . . ) specter through the shadowy night-scapes of the Royal Family; meanwhile, readers crouching like bats in hidden tree-perches of library-ensconced safety are vicariously aroused by the lightening-charged atmosphere of danger where magnificent train-wrecks of love and hate lurk behind each new chapter heading.  Yes, turn the page!Admittedly long and occasionally tedious in its relentlessness, as are most of Vollmann's epic novels, at times I wondered how & why I kept reading despite the total sensory assault of being barraged by broken sentences tracing the stumblings of broken people whose addictions and predilections for hate and filth are dumped on the reader's mushroom head page after page afer page as though . . . I was one of them! Was it literary S&M; from which I could not extract myself? Had I turned into a mushroom; a writhing (book) worm perhaps?Reading a book is certainly no substitute for actually observing and experiencing people, places or events yourself (which Vollmann obviously has) but The Royal Family is indeed magical in bridging this chasm. It precipitated several coffee-induced bouts of paranoid page turning through ungodly hours of the night, chased by first-thing in the morning fixes of mercifully short chapters strung out on the page like lines of coke; the come-down temporarily stayed by random, unconscious paragraph glances until . . . yet another craving strikes!  The sun descends, and you somehow find yourself on a bar-stool next to Vollmann tossing down a couple-few drinks, and you converse with your new-found \"family\".What more can I say? Any book that does this to you - makes an event out of reading, consuming chunks of your life, twisting the world around you into strange, impending car-crash scenes you never noticed before but cannot now look away - must be locked up and secreted away at once!No, I can't really advise reading about whores, pedophiles, pimps, crack-addicts, the homeless, jobless, and other pathetic losers groveling in their own degradation, gloating under the mark of Cain, and spying from dark alleys for the black virgin, the mystical, mother and Queen of them all - last seen on the streets of San Francisco - because that would be proselytizing, and Bill wouldn't appreciate that. Since I'm not sure if it was more pleasure or pain I felt while plodding through this lotus-topped muck I'll only say that you'll need to condescend to these poisoned pages on your own in order to discover how you feel about it yourself; otherwise my encouragement would be disingenuous. The unearthed Gnostic scriptures, like The Royal Family, are filled with discarded, unacceptable luminescence like a lantern in the darkness, which had to be hidden away in Egyptian caves so that the fearful fathers of \"God's official word\" could control His word. The royal family runs from these vigs (vigilantes) and their Israelite hoards of righteousness that swoop upon the infidels and Canaanites to cleanse, purify, and repackage their sad sexuality for the \"Feminine Circus\" in where-else . . . but Vegas baby!Henry Tyler, private detective and obsessed lover of his brother's wife seeks his Gnostic Queen, submitting to the evil forces of harsh prostitutes like Domino and Chocolate and Strawberry. We follow him from one familiar landmark to another, as we take Vollmann's self-guided tour of San Francisco as it stood in 1997 (his asides on \"Bail Bonds\" and \"Geary Street\", as well as now outdated descriptions of Union Square, are just a few gemstones embedded in the pavement we walk upon). To judge Tyler or Vollmann and this book as sordid and disgusting would be a mistake, but no different from the mistake those early church fathers made at the Niocene Council when outlawing certain \"heresies\". Do you, I wonder, have the gumption to discover Love amidst all this Sin? It will take a certain amount of self-effacement to purify your heart, to sharpen your vision so as to navigate the thick fogs of San Francisco.After escaping the city and hoboing cross-country, riding the rods and rails from the Salton Sea to Seattle, Sacramento to Miami, what's left of Henry Tyler tirelessly continues his endless quest for the \"Queen\". He knows that he's afraid of Jesus. He seeks love, but because he \"loves without doctrine\" he wonders whether Jesus can do the same? The real question is: Can those who proclaim Jesus as their own do the same? At this point in the novel, some 754 pages (and several months in my case) you too will stink like Henry (that is, if you've had the gall and fortitude to get this far).  How you come away from this \"sordid niche\" - survivor or victim - may not be up to you at all; no, it will be up to your QUEEN, in whose crown \"The Royal Family\" ever-glisten like refracting daggers of spirit-penetrating light.  On your knees, open your mouth for your sacramental dose! Submit and worship at her beloved Tenderloin altar, the \"Wonderbar\"."}, {"review_sentiment": 5.0, "review_text": "The first fifty pages of \"The Royal Family\" reads like the opening of a Dashiell Hammett novel (the seedy ambience of \"The Glass Key\" specifically comes to mind). Henry Tyler, a down-and-out private investigator, has been hired by a shadowy patron to find the \"Queen,\" the self-appointed sovereign who oversees and protects the street prostitutes who haunt the Tenderloin's crack hotels and dark alleys. Even the last line of the first \"book\" (of which there are 36) has the feel of a noir thriller. Tyler attempts to pick the lock leading into the parking garage where the Queen is rumored to be hiding: \"The lock opened on the fifth bounce. He stepped into the opening light.\"In spite of this nifty, almost melodramatic hook, Vollmann has something else in mind instead of yet another piece of detective fiction. In addition to Hammett, influences extend to other San Francisco-area writers, first to the gritty realism of Frank Norris (as Tyler, like Vandover and McTeague before him, plunges into the underworld, taking most readers where they've never dreamed of going) and then to the desolate vitalism of John Steinbeck (when Tyler flees the Bay Area and mingles with the train-hopping hobos of the Central Valley and beyond). Along the way, the prose invites comparisons to Hubert Selby, John Rechy, and--yes--Thomas Pynchon. And I'm not even sure to which American literary tradition one might assign the book's vaguely supernatural elements.While Vollmann has a dedicated \"cult\" following (and, although this is my first sampling, I'm nearly ready to add my name to the registry), there are two things that will probably keep his novels from garnering the wider audience they deserve. The first is their length--and this is especially true with \"The Royal Family.\" Between sketches of the various destitute streetwalkers and drug-addled pretenders, he throws in just about everything: from a journalistic reflection on the mechanisms of the bail bond industry to a brutal satire on the commercial fantasias of Las Vegas. This isn't simply a novel, it's a Commitment. Still, I agree with Vollmann's decision to resist his editor's insistence to cut the book--the sections I admired or enjoyed will be different from the ones another reader will prefer. Better a smorgasbord than Lean Cuisine.Yet the aspect of Vollmann's fiction that will probably keep him from ever getting an NEA grant is his willingness to explore and even to empathize with the most odious of characters. (And I don't mean to include in this caste the various prostitutes, since, if anything, the author--without glorifying the life--paints a sympathetic picture.) Among all the lowlifes to choose from here--and there are plenty--the creature that will give me nightmares for years to come is Dan Smooth, a pedophile who is exploited by the local authorities for his \"professional\" expertise yet harassed by the feds for their revulsion to his self-confessed illness. Smooth's fantasies are uncomfortably explicit, and--even as the reader is repelled by the experience--we can admire Vollmann's heroic willingness to enter such a mind and bring him, unexpurgated, to the page. But be warned: this book isn't for the weak of stomach--or the morally righteous.What impresses me most about \"The Royal Family,\" however, is that Vollmann maintains an enviable consistency of timbre and vigor through 800 densely typeset pages. There's rarely a dull moment, and there's hardly a misstep. I can't say I enjoyed the excursion--although filled with wit and even occasional laughs, this book is too bleak and sordid to be \"enjoyed\"--but I was certainly fascinated by the depictions of \"the life\" and dazzled by the brilliance of the prose."}]}, "authors": ["William T. Vollmann"], "isbn": "0573614946", "longitude": -122.4192363, "periods": ["2000s"], "title": "The Royal Family", "word_cloud": "equal part good turn poetic sordid call masterly consider master far accessible historical novel fact kind history oh people hate term anybody right mind hate term know live long time long long go period epoch limn know name often bandy great novelist think beautiful tall woman intimidate surely give mucky muck much super perv deep romantic occasionally reference dysfunctional read like quite bit pore way aforementioned classic beach beach circa almost thru kind dream bat bat page leave dream longer extend ending carry thing vollmann leaf first intro write europe central next part tear good tear write great infuriate many time scream faulkner use vollmann get section look word repeat get idea still better thing tell last year hon time author review gloomy obsession love lust companion piece briefer whore set sustain immersion early street live wandered take time draw earlier novel follow misfit narrator lairs bar woman ply trade sought secure affection nourish tale get gumshoe protagonist sly antagonist brother square good evil early reference set well early stage predicament forlorn woman main character longs comfort keep get cameo author journalist journalist find fevered quest drag deep louche lawyer brother lose wife death plight bereft men woman tend listen dramatize mistress linger miss accept depiction beat folk side prove engage tale grimy seedy situation send cartoonist conveyance greed prejudice remind villains seek brother also hire tycoon stare wonderfully boorish type akin photographer use familiar perspective bully boy turn hesitant man fog vista railcards dust gain attention pleasure view eye urban clang urine smell evoke brother overlook hometown gain probably first depiction major novelist avoid cliche born grow child professor deepen travel experience come back explore californian powerful moment often scene plot much reveal characteristic observation author filter protagonist seek support bridal registry brother go pick bone china oddness stand relationship enhances tilt observation acquisition good porcelain gravy dish enjoy le product dispirit value value seem stand category resist classification sensitive soul give also help enrich character follow come survival skill reduce earn living prostitution others circle gain predictably give also knack insect biological analogy domination introduce fifth long way invite allegorical interpretation also enter disturbing consideration true nature moral calculus rise rise sexuality judge illegal immoral offer similar sidestep injustice bail author observe section particularly bail interlude return minion get suck web section le inventive preceded brings false sway find lure vigilante faction purporting want clean street seek peep aside agent complaint manuscript section provide clever elaboration theme canonical apocryphal colophon insert others sway prove membership practice moral heir case capitalists seek eliminate immoral boost profit strange even standard staff freakish sex worker never get fully explain veiled mystery suffices set odd end sentence destitution sell first gun car tot bible roams vast railcards experience rid rail heightens scene set migrant misfit travel take explore desert sprawl later also review last tenth accelerate increasingly unhinge quest find battle search lose sense typically reveal end notes comment editor viking advise trim third refuse take third cut royalty dog commitment ensure work big remain faithful vision le patience chatter whore habitual roam engage part vagary bail chapter sudden allusion patient forgive excess not mention fine metaphor favorite compare blacken banana scramble tiger yellow hill fog pair brother contend attention many woman endure world diminishes pity slip radar recently work guy master leave hotel room next visitors would interested local history find prose le stellar and topic differently discover loan numerous people gulp forever shelve first page read bit eat hallucinogenic fungus get full effect get bloodstream boy tight bother differentiate good wisdom derive ability learn everything illustrate ability cultivate beauty horror prose rich engage smother word madly laugh need offer yet description everyone know suicide many level drug whore hopeless love poison teeth wiser person plan happier city san francisco henry luck detective maybe luck change get job work jonas brady jonas brady want tyler mythic queen whore henry tyler brother john john tyler work firm rap singer plum fall john lap land jonas brady account jonas brady open extravaganza lei vegas feminine circus john married korean american irene john brother irene mother john henry live sacramento die henry visit mother often john john resents brother disregard mother henry take long find queen whore brady fire henry befriends prostitute tenderloin mission district san francisco skid row area join abuse street prostitute protection queen whore life spiral pilgrim progress dante divine comedy henry search miss person kind mean life meanwhile brady launch campaign capture queen whore hunt king reading hundred page repeat description metaphor night sky stink whore fight cuss drug spit urinating mouth puke street walk want story do come lei nasty sordid life san francisco skid row feminine circus demean horrific anything ever create fiction back streets san francisco moral story situation woman worse street prostitution therefore leave prostitution alone yet willing vollman world wretched one body one spirit lose way often often endless wandering henry tyler canaanite bearer mark cain many time street san francisco traverse detail landscape cross country trip need mention author intrusion exactly nod john fowled magus french lieutenant woman vollmann vollmann intrudes writing use wonder norman mailer novel deer park barbary shore enjoyable longer vollman answer question include huge chunk passage tone mailer novel answer longer better vollmann editor suggest cut vollmann chose instead take cut royalty pun hope intend go wonderful stuff story fail much description get way early get start read literary stuff vollmann pottage word feast believed heart hold hand masterpiece day finish accomplishment even little intimidate sheer heft find devour fast writing beautiful simultaneously poetic gritty world paint surreal underground landscape hooker hobos criminal turn realistically render hallucinatory length see read begin bible beautifully ugly opera paean society wretched refuse yet majestic narcissistic grovel unleashed decent society particular volume revel destitute spirit line piece soul sell mean prostitute amputate meaty hunk comer ever shut wrong follow run vigilante thug use name boxcar similes metaphor influence neon sign shine star open thigh octopus mind wife grapple husband chung ideogram decipher grate window specter shadowy reader crouch bat hide safety vicariously arouse atmosphere danger magnificent love hate lurk new chapter head turn page admittedly long occasionally tedious relentlessness epic novel time wonder keep read total sensory assault barrage broken sentence trace stumbling broken people addiction predilection hate filth dump mushroom head page page afer page literary turn mushroom writhe worm perhaps certainly substitute actually observing experience people place event obviously indeed magical bridging chasm precipitate several bout paranoid page turn ungodly hour night chase morning fix mercifully short chapter string page line coke temporarily stay random unconscious paragraph glance yet craving strike sun descend somehow find next toss drink converse say any make event read consume chunk life twist world strange impend scene never notice lock secrete away really reading whore pedophiles pimp homeless jobless pathetic loser grovel degradation gloat mark spy dark alley black virgin mystical mother last see street sure pleasure pain felt plod muck say need condescend poison page order discover feel otherwise encouragement unearthed scripture fill discard unacceptable luminescence lantern darkness hide away egyptian cave fearful father official word word run vies vigilante hoard righteousness swoop infidel cleanse purify repackage sad sexuality baby private detective obsess lover brother wife seek submit evil force harsh prostitute follow familiar landmark take tour stand aside well outdated description gemstone embed pavement walk sordid disgust different mistake early church father make outlaw certain heresy do gumption discover midst certain amount heart sharpen vision navigate thick fog escape city hoboing rid rod rail leave tirelessly continue endless quest know afraid seek love love doctrine wonder real question proclaim point page several month case stink gall fortitude get far away sordid niche survivor victim crown refract dagger light knee open mouth sacramental dose worship beloved altar first fifty page read open seedy ambiance specifically come mind private investigator hire shadowy patron find queen sovereign oversee protects street prostitute haunt crack hotel dark alley even last line first nor thriller attempt pick lock lead park garage rumor hide lock open fifth bounce step open light spite nifty almost melodramatic hook something else mind instead yet piece detective fiction addition influence extend writer first gritty realism plunge underworld take reader never dream go desolate vital ism flee mingle hobo way prose invite comparison even sure american literary tradition vaguely supernatural dedicate cult follow first sample nearly ready name registry thing probably keep novel garner wider audience first length especially true sketch various destitute streetwalker pretender throw everything journalistic reflection mechanism bail bond industry brutal satire commercial fantasia simply still agree decision resist editor insistence cut section admire enjoy different one prefer smorgasbord aspect fiction probably ever get grant willingness explore even empathize odious character mean include caste various prostitute anything author glorify life paint sympathetic picture lowlife choose plenty creature give nightmare year come exploit local authority professional expertise yet harass fed revulsion illness fantasy uncomfortably explicit even repel experience admire heroic willingness enter mind bring unexpurgated page warn weak stomach morally impress however maintain enviable consistency timbre vigor densely typeset page rarely dull moment hardly misstep enjoy excursion fill wit even occasional laugh bleak sordid enjoyed certainly fascinate depiction life dazzle brilliance prose", "genres": ["Fiction & Literature", "Erotica"], "summary": "A magnificent new novel from a writer whose books, \"tower over the work of his contemporaries by virtue of their enormous range, huge ambition, stylistic daring, wide learning, audacious innovation, and sardonic wit.\" (The Washington Post)\r\n\r\nIn The Royal Family, William T. Vollmann uses the story of two brothers to construct a haunting series of parallels between the lives of the dispossessed and the anxious middle class. Henry Tyler is a failing private detective in San Francisco. When the love of his life, Irene--who happens to be married to his brother John, an ambitious contract lawyer--commits suicide, he clings despairingly to her ghost. Struggling to turn his grief into something precious, Henry enters into a new life of nightmare beauty and degradation as he attempts to track down the legendary Queen of the Prostitutes.\r\n\r\nCrafted out of language by turns eloquent, humorous, sensual, and obscene, and full of vividly rendered depictions of low-life bars, office politics, and hobo camps, here are Vollmann's familiar but ever surprising characters--the seekers, the vigilantes, the hypocrites, the street prostitutes. He has woven their stories into a vivid and unforgettable novel about the eerie paradoxes of possession and loss.", "asin": "0573614946", "rank": "649754", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51xEa02rC%2BL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}