{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 30, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "The Lonely Londoners evokes a range of responses.  What seems at the start to be an amusing book soon proves to be a short, powerful read that challenges, educates and puts its readers through the emotional wringer at times.  For all the bold swagger of the first wave of (mainly) young men from the West Indies who sought their fortune in London and other UK cities in the early 1950s, life was tough, the weather foul and their reception by locals uncertain to say the least.  But they survived, with a style and charm all of their own, plus a colourful patois that tries very hard to camoflauge the rougher realities they also had to endure.  Sam Selvon's  mastery lies in the way his collected stories weave in on themselves, enlightening the reader as to what lies behind the brave faces shown to newcomers."}, {"review_sentiment": 1.0, "review_text": "The book is missing a large number of pages."}, {"review_sentiment": 5.0, "review_text": "Nice"}, {"review_sentiment": 4.0, "review_text": "good read"}, {"review_sentiment": 5.0, "review_text": "Had to buy this book for a class.  I loved it though after discussing the vernacular used I remember still liking certain scenes and its making me want to go back to London while also appreciating the migration story and seeing parallels close to home."}, {"review_sentiment": 5.0, "review_text": "GREAT BUY! QUICK SHIPPER!"}, {"review_sentiment": 2.0, "review_text": "I was very disappointed with the book. It was like a disjointed mess."}, {"review_sentiment": 5.0, "review_text": "Almost  true to life experiences of West Indian immigrants in England around the 1950's.  My parents  expressed similar events so this book is not so far from the truth.  Interesting read."}, {"review_sentiment": 5.0, "review_text": "i loved it.  Its not a long book. great window into the culture of immigrants then."}, {"review_sentiment": 4.0, "review_text": "I got this book for class but I ended up adding it to my personal collection. Very good work, I recommend for anyone looking to get a feel of life in the UK for Caribbean immigrants."}]}, "authors": ["Samuel Selvon"], "isbn": "0582642647", "longitude": -0.12574, "periods": ["1900s"], "title": "The Lonely Londoners", "word_cloud": "evoke range response seem start amuse soon prove short powerful challenge educate put reader emotional wringer time bold swagger first wave mainly young men seek fortune city early life tough weather foul reception local uncertain say least survive style charm colorful patois try hard camouflage rougher reality also endure mastery lie way collected story weave enlighten lie brave face show newcomer miss large number page nice good buy class love discuss vernacular use remember still like certain scene make want back also appreciate migration story see parallel close home great disappoint disjoint mess almost true life experience indian immigrant parent express similar event far truth interest love long great window culture immigrant get class end add personal collection very good work recommend anyone look feel life immigrant", "genres": ["Fiction & Literature"], "summary": "Both devastating and funny, The Lonely Londoners is an unforgettable account of immigrant experience - and one of the great twentieth-century London novels. \r\n\r\nAt Waterloo Station, hopeful new arrivals from the West Indies step off the boat train, ready to start afresh in 1950s London. There, homesick Moses Aloetta, who has already lived in the city for years, meets Henry 'Sir Galahad' Oliver and shows him the ropes.\r\n\r\n In this strange, cold and foggy city where the natives can be less than friendly at the sight of a black face, has Galahad met his Waterloo? But the irrepressible newcomer cannot be cast down. He and all the other lonely new Londoners - from shiftless Cap to Tolroy, whose family has descended on him from Jamaica - must try to create a new life for themselves. \r\n\r\nAs pessimistic 'old veteran' Moses watches their attempts, they gradually learn to survive and come to love the heady excitements of London.\r\n\r\n", "asin": "B0092IW18U", "rank": "2839118", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41mClxP%2BCAL.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}