{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 39, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Unlike any memoir or romance you've ever read, this has been called a \"prose poem,\" but I would call it sheer poetry.  Every line is cadenced, every paragraph holds a memorable metaphor and image.  Written in the early 1940's while Smart was in the throes of passionate obsession, it is hot without being salacious.  It doesn't have the overt sexuality of Anaïs Nin, but is nonetheless just as erotic.  Smart fell in love with the poet George Barker in the most intimate fashion -- through the written word.  By reading a volume of his poetry.  Although they never married (he already had a wife), they went on to have four children together, but this was written just after the birth of her first daughter.  This edition also contains The Assumption of Rogues and Rascals, written in 1978, which contains vignettes of what it was like living in England post World War II, but that doesn't carry the heat of Grand Central.  It also contains a very informative introduction by Brigid Brophy."}, {"review_sentiment": 4.0, "review_text": "This book is not for everybody.  It's poetic prose, so it is, yes, purple.  But I see that as it should be.  Overall a good read if you like love stories."}, {"review_sentiment": 5.0, "review_text": "Deep, clever. This work masters the connection between the beauty of the language and the complexity of feelings."}, {"review_sentiment": 5.0, "review_text": "So beautiful. Just so beautiful."}, {"review_sentiment": 5.0, "review_text": "Wonderful"}, {"review_sentiment": 5.0, "review_text": "This book was sent in good condition, I enjoyed reading this book."}, {"review_sentiment": 5.0, "review_text": "It was a gift to a friend and she loved it!"}, {"review_sentiment": 5.0, "review_text": "Great!"}, {"review_sentiment": 4.0, "review_text": "I have to confess that I read this book because I was reading a book about The Smiths and this was listed as one of Morrissey's favourite/most influential books. Now that I've read it I can see the connection. There are actually lines from this books which got used as lyrics in some Smiths songs.The book stands on its on merits however. The writing is beautiful and poetic. The emotions are real and raw although not always admirable. The narrative loosely follows the author's affair with a married man, her crippling love for him regardless of all common sense and social taboos. She disgraces herself in the eyes of her family and society. She gives birth to illegitimate children by her lover while he forsakes his own wife and lawful children.To call this love intense would be a massive understatement. To call it rational or sensible would be just plain wrong. To deny it is beautiful would be blind."}, {"review_sentiment": 4.0, "review_text": "Ms Smart writes poetic prose, and you have to like this genre to enjoy the book.  I loved it, but did feel frustrated at times that she simply wasn't giving her readers any real details about her life-long affair with poet George Barker."}]}, "authors": ["Elizabeth Smart"], "isbn": "0586090398", "longitude": 0.0, "periods": ["1900s"], "title": "By Grand Central Station I Sat Down and Wept", "word_cloud": "memoir romance ever call prose poem sheer poetry line cadenced paragraph hold memorable metaphor image early throe passionate obsession hot salacious overt sexuality nonetheless erotic fell poet intimate fashion write word read volume poetry never marry already wife go child together write birth first daughter edition also contain write contain vignette living post carry heat also contain informative introduction everybody poetic prose yes purple see overall good love story deep clever work master connection beauty language complexity feeling so beautiful beautiful wonderful send good condition enjoy read gift friend love great confess read list influential now see connection actually line get used lyric stand merit however write beautiful poetic emotion real raw always admirable narrative loosely follow author affair marry man cripple love regardless common sense social taboo disgrace eye family society give birth illegitimate child forsakes wife lawful call love intense understatement rational sensible wrong beautiful write poetic prose genre enjoy love feel frustrate time simply give reader real detail affair poet", "genres": ["Fiction & Literature"], "summary": "Elizabeth Smart’s passionate fictional account of her intense love-affair with the poet George Barker, described by Angela Carter as ‘Like MADAME BOVARY blasted by lightning … A masterpiece’.\r\n\r\nOne day, while browsing in a London bookshop, Elizabeth Smart chanced upon a slim volume of poetry by George Barker – and fell passionately in love with him through the printed word. Eventually they communicated directly and, as a result of Barker’s impecunious circumstances, Elizabeth Smart flew both him and his wife from Japan, where he was teaching, to join her in the United States. Thus began one of the most extraordinary, intense and ultimately tragic love affairs of our time. They never married but Elizabeth bore George Barker four children and their relationship provided the impassioned inspiration for one of the most moving and immediate chronicles of a love affair ever written – ‘By Grand Central Station I Sat Down and Wept’.\r\n\r\nOriginally published in 1945, this remarkable book is now widely identified as a classic work of poetic prose which, seven decades later, has retained all of its searing poignancy, beauty and power of impact.", "asin": "0586090398", "rank": "1348038", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51CV8u5-J3L.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}