{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -37.8142176, "ratings": {"num_ratings": 5, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "From a tea shop bookie establishment to one of the most powerful men in Australia. This most interesting chronicle is ficti on yet inspired by an actual person who later sued the writer, but lost in court."}, {"review_sentiment": 5.0, "review_text": "A gripping story of a kid from the wrong side of the tracks who makes the big time and becomes one of the most powerful people in Australia.In the spirit of the film \"Citizen Kane\", it showed the grotesqueness of the life of a powerful man while he was still alive by being fiction that never said who it was based on. Even though everyone knew. It was very courageous at the time.Power, corruption, illegal gambling, media barons, corrupt church figures (not too much), political influence, big money.Kind of Australia's version of 'The Godfather' but not quite so criminal and more about one man than a family - and set a bit earlier."}, {"review_sentiment": 4.0, "review_text": "Never mind that Hardy was an unreconstructed Commo; this is a great, great-big book, a scandalous roman-a-clef based on a Collingwood Mafioso, John Wren and his rise (and rise).  Blessed with no literary touches but a lot of narrative drive, the book has become, in its unpretentious way, a landmark of Australian literature.  Hardy had to overcome a myriad hurdles to get his work published and only then did his troubles really begin, in the form of various reprisals, including an almost ruinous trial for criminal libel."}, {"review_sentiment": 4.0, "review_text": "This is a book that was loosely based on the life of John Wren. In the book Wren is known as West and other names and locations are rather superficially disguised. For instance most of the action takes place in a suburb of Melbourne called Collingwood, which is rendered as Carrinbush in the novel. Wren had a colourful life becoming wealthy by running an illegal gaming operation around the turn of the century. He gained immense wealth and later moved into more legitimate business. He became close to senior church figures in the Catholic Church and the Australian Labour Party.Hardy the author of this book was a long term member of the Australian Communist Party. His book is a strange mixture of story telling plus an attempt to paint the political affairs of Australia as corrupted by influence and money. Despite his somewhat doctrinal and schematic approach the richness of the material on which the novel is based makes it a fascinating read. It is strongest when Wren was a younger man portraying his rise to power and the sort of society that Australia was around the turn of the century. One senses a strong sympathy for the younger Wren as a working class boy who defied his background and society to claim his place in the sun.The book is not only interesting as a novel but was part of Australia's history. After it was published Wren's wife took a famous libel action against Hardy which failed. As a result the book achieved folk law status and was made into a mini series."}, {"review_sentiment": 5.0, "review_text": "This is one of the most powerful novels to have come out of Australia. With very little attempt at disguise, it tells the story of an Australian mobster who ruled a network of criminal activity for several decades before  the Second World War. It is a brutal story and one that somehow touches on  an aspect of Australian history which is hardly ever expressed in print.  European Australia has always been a hard land. With communities originally  based on convict labour, it seems as though a certain amount of violence  came to be taken almost for granted. In a country that long had an  oversupply of men, it is perhaps not so surprising that they spent much of  their time trying to dominate both the land, its original inhabitants and  each other. A sometimes brutal Army Corps looked after convicts for the  first fifty years or so. Later, law enforcement was taken over by a police  force which has often had to face charges of similar brutality and  deep-rooted corruption, up to the present day. Aussie politics has always  had a particularly nasty underbelly, and it seems as though social  conditions were ripe in the 1920s for the rise of just such a personage as  is depicted here.Frank Hardy had to fight (the mob) hard to get this  novel published and once he had succeeded, he had to go to court to defend  it against a defamation order. The book's main character, even though he  tried hard in later life to attain a position of legitimacy, always found  himself caught up in the web of underworld intrigue that he had created.  Even so, it is probably true to say that most ordinary people didn't want  to know about the activities imputed to a man who was, superficially, a  pillar of the community. So Hardy was right to expose the ruthless nature  of the beast underlying the ostensibly honest sports promoter and family  man. And perhaps all Australia, or those who remember this particular  episode (and its ongoing media life through film and television) did well  to note what sort of man lay behind the mask.Australia has taken a long  time to come out of this period of its history, when personal might could  be displayed almost with impunity, even in public affairs. This book,  perhaps neglected today, serves to remind us of the imposing structure of  organised crime that Australia has had to grow up with. In addition, it is  a fine literary achievement and worthy of being read on that basis alone."}]}, "authors": ["Frank Hardy"], "isbn": "0586043144", "longitude": 144.9631608, "periods": ["1900s"], "title": "Power Without Glory", "word_cloud": "tea shop bookie establishment powerful men interesting chronicle fiction yet inspire actual person later sue writer lose court gripping story kid wrong side track make big time become powerful people spirit film show grotesqueness life powerful man still alive fiction never say base even everyone know courageous corruption illegal gamble medium baron corrupt church figure much political influence big version quite criminal man family set bit earlier never mind unreconstructed great scandalous base rise rise bless literary touch lot narrative drive become unpretentious way landmark australian literature myriad hurdle get work publish trouble really form various reprisal include almost ruinous trial criminal libel loosely base life known name location rather superficially disguise instance action take place suburb call render colorful life become wealthy run illegal gaming operation turn century gain immense wealth later move legitimate business become close senior church figure author long term member strange mixture story tell attempt paint political affair corrupt influence money doctrinal schematic approach richness material base make fascinate strongest younger man portray rise sort society turn century sense strong sympathy younger work class boy defy background society claim place interest part history publish wife take famous libel action fail result achieve folk law status make mini series powerful novel come little attempt disguise tell story australian mobster rule network criminal activity several decade second brutal story somehow touch aspect australian history hardly ever express print european always hard land community originally base convict labor seem certain amount violence come take almost grant country long oversupply men perhaps surprising spent much time try dominate land original inhabitant sometimes brutal look convict first fifty year later law enforcement take police force often face charge similar brutality corruption present day politics always particularly nasty underbelly seem social condition ripe rise personage depict fight mob hard get publish succeed court defend defamation order main character even try hard later life position legitimacy always find caught web underworld intrigue create even probably true say ordinary people want know activity impute man superficially pillar community right expose ruthless nature beast underlie ostensibly honest sport promoter family man perhaps particular episode ongoing medium life film television well note sort man lay take long time come period history personal almost impunity even public affair perhaps neglect today serve remind imposing structure organize crime grow addition fine literary achievement worthy basis alone", "genres": ["Fiction & Literature", "Politics"], "summary": "The novel is a fictionalised version of the life of Melbourne businessman and Australian Labor Party power-broker, John Wren. It is largely set in the fictitious Melbourne suburb of Carringbush, which is based on the actual suburbs of Abbotsford and Collingwood. In the novel, West is involved in criminal activities and political machinations, particularly related to gambling.\r\n\r\nThe book includes many characters based on other important social and political figures in Victoria and Australia.\r\n\r\nThe barely-disguised inspiration for the \"West\" character is made clear by the fact that West, like Wren, has a brother called \"Arthur\" who spent time in jail for aiding and abetting a crime of rape. (Wren's other brother, Joseph, also appears in the novel.) Wren's wife Ellen (née Mahon) appears as \"Nellie\", and there is mention in the novel of his children: his violinist daughter Margaret, his son John Jr., and another daughter, who becomes a Communist, resembles Wren's radical daughter Mary, who was an active member of the communist front organisation the Movement Against War and Fascism.\r\n\r\nThe novel is partly set during World War I, and the debate about conscription is a major issue in the novel. John West is a fierce patriot who supports conscription, and his sometimes fiery arguments with the Irish-Catholic Archbishop of Melbourne, who opposes conscription on the grounds that to send men to aid England was contrary to his, and Ireland's, historical enmity with that country.", "asin": "0586043144", "rank": "2749860", "city": "Melbourne", "image": "https://images-na.ssl-images-amazon.com/images/I/51T-QKKkNML.jpg", "country": "Australia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}