{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 14, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "A nicely written book which expresses many of the challenges of the country but also the strange feeling you get living there."}, {"review_sentiment": 4.0, "review_text": "A dry book. But priceless, because it make me understant a litle a large, totally unknown Country."}, {"review_sentiment": 4.0, "review_text": "This is an entertaining, highly readable memoir of the author's time in Kazakhstan as an associate professor of law.  The book contains memorable details about daily life and culture in a little-known nation, in the throes of transformation from former Soviet Republic to independent nation.Because the book is framed more as a memoir than as a history, the scope leaves something to be desired.  Rosten frequently omits dates, so it is hard to get historically oriented.  We are treated to scenes showing the impact of political turmoil as the country adopts a new currency, has an uminpressive national election and constitutional referendum, and moves toward autocracy.  But because the author is so focused on his own experience, the national political issues may be obscured or lost.None of the foregoing really undermines the book on its own terms: it is not meant to be a scholarly work, or a history, or a political treatise.  Enjoy it as an armchair adventurer, and it is perfectly satisfying."}, {"review_sentiment": 2.0, "review_text": "I found this book to be a shallow view into present day Kazakhstan, with small insight into the region as a whole.  The book does little to shed light on the cultural history and core of Kazakhstani society.  An easy read, but not especially enlightening.  \"The Lost Heart of Asia\" is a better bet for an incredible overview of the regions ebbs and flows and the cultural nuances which influence Central Asia, which is a more helpful view.  Also consider \"The Silent Steppe\" for a modern history of the country."}, {"review_sentiment": 5.0, "review_text": "We adopted 2 children from Kaz and spent 6 weeks 'in country' and this book put me back in Kazakhstan.  Great writing, beautiful insights.His political commentary is poorly researched and very 'immature' but don't let that distract you from a truly good book, I cherished every page.  If you are interested in Kaz, this is a great bookjohnPS I'm hoping he reads this review and writes a second, more researched book, which begins where the first book ends."}, {"review_sentiment": 3.0, "review_text": "Ever since the dissolution of the Soviet Union, I've had an interest in Central Asia and the Caucuses. In 1994, two good friends were in Kazakhstan working on privatization, and I've read the more readily available books on the area, such as Eastern Approaches and all the excellent Hopkirk volumes. Rosten's self-published diary of his time in Kazakhstan as a Fullbright scholar in 1993 is a moderately informative account of the large nation's baby steps as a modern nation. With a background as a lawyer and business school training, Rosten is well qualified to tell this tale of a country trying to sort out a legal system, elections, and a functioning economy. However, his fluency in Russian is what really allows him to mix with people at different levels of society and get the flavor of the place. For the most part, his diary is typical of books by Westerners spending a year or two abroad: the problems of finding a place to live, breakdowns in municipal services like garbage collection, hot water, heat, etc., arbitrary taxi fares, strange foods, the prevalence of vodka, transportation problems, and so forth.His coverage of the emerging nation is a little more in-depth, as the country struggles to arrange reasonable elections and constitution. All of which is intertwined with the ever-present thorny \"nationalities\" question, which boils down to whether ethnic Russians will get a fair shake in a Kazakh nation. This is a pretty contentious issue of course, since the Kazakh population was nearly halved under Stalin's rule, and a program of Russian settlement was set up (much as China has done in its far Western provinces and Tibet over the last thirty years). Probably the best bits in the book are the details about the first election and the problems with it, although its outcome is depressingly familiar stuff, with the ex-communist bosses all still in power. Indeed, Kazakhstan's autocrat, Nazarbayev is ever-present in the narrative, but Rosten doesn't offer nearly as much criticism of his as one might expect. Strong-men like Nazarbayev have little to offer other than vague assurances of stability, and the world seems to shrug in disinterest when the elections are rigged or he announces constitutional changes that give him total control over the country. Add endemic corruption to the mix and it's hardly any wonder that repressed and frustrated people eventually turn to political Islam or other external outlets to try and effect change. Indeed, other than commenting on how disorienting it must be for people Rosten doesn't really comment much at all on the drive to privatize and potential effects of encouraging rampant capitalism. Of course, the result has been a tiny corrupt elite skimming the cream, and a great deal of problems at the lower end of society. Joma Nazpary's book (which I have not read) \"Post-Soviet Chaos: Violence and Dispossession in Kazakhstan \" examines this in some detail via fieldwork and interviews.In any event, Rosten's book has a great number of weaknesses. First and foremost is the diary format. I certainly enjoy the personal perspective, which tends to be much more readable than straight dry history or reportage. A good example is Tom Bissell's narrative of Uzbekistan, Chasing the Sea, which weaves personal experience with a good cribbed history lesson. However, Rosten's account is so choppy that it becomes a real nuisance to read as he jumps willy-nilly from topic to topic. It also means that certain topics are covered in multiple places, and a great deal of information and anecdotes are repeated, some three times over! A good editor could have chucked the diary format and arranged a more flowing narrative that covered each piece in turn and greater depth. For example, it would have been nice to learn a little more about the large Korean population. Or why it is exactly that the Jewish population hasn't fled en masse. More disturbingly, although I am no expert by any means on the region or culture, I did come across a very obvious factual error towards the end which made me question Rosten's accuracy about other things. On page 228 he writes \"Nauryz is a traditional Moslem holiday celebrating the New Year.... It is celebrated on March 22. \" The Muslim New Year is called \"Al-Hijra\" and because Islam uses a lunar calendar, it falls on completely different days in each of the Gregorian calendar years. \"Nauryz\" (more commonly Nowruz) marks the Persian New Year, falls on the vernal equinox (usually March 21 or 22) and is based in the Zoroastrian religion.The actual prose leaves a great deal to be desired as well. In some places he gets into a groove and writes fluidly and easily, and in others it is very very choppy and wooden. Strings of sentences, each containing a single fact. Again, an editor could have easily cleaned this up and made it a much better read. Attempts at humor generally fall flat, and never does one get a true sense of the emotional confusion and frustration that many of the people he talks to must have felt. On an aesthetic level, the self-publishing format means that there is a notable deficiency in the supplementary material. There is no map (these tend to be very expensive), which is a huge flaw for a book about an unfamiliar country. And although the book has lots of photos, the quality of the reproduction is exceedingly low--worse than a typical newspaper (this is a function of the print-on-demand technology used to print the book).Ultimately, the book isn't awful, it just isn't that great. Much of what is recounted is pretty typical travelers tales type stuff, and one is going to get a very basic introduction to the country and people. It's true, there isn't a great deal out there on modern Kazakhstan, but most readers will be better served by the 2nd edition of Martha Brill Olcott's \"The Kazakhs\", which includes a fifty pages on independence and the next few years. Her subsequent book \"Kazakhstan: Unfulfilled Promise\" gets into recent years in rather more detail than most will want, and the subtitle gives on the gist of it. This is not a book I'd recommend to anyone except those who feel the need to read every word published on the region."}, {"review_sentiment": 5.0, "review_text": "It's a rare kind of book: it provides a spatial picture of everyday life and political history of a huge country rising up for its independence, but is written mainly in short, wise stories, sometime as anecdotes. This is not a disadvantage, if we remember that a lot of classic historical works were written in this fashion - the personal view and personal feelings of the author on the events and political leaders, which fall outside any political science methodology.As somebody with Soviet life experience (childhood, youth), partly in Kazakhstan, I was interested in the foreign view and thoughts on Eurasia's biggest country, Kazakhstan. After all, there aren't that many books written by journalists about this country. (I am not sure whether historians or ethnographers wrote anything more than studies of their own narrow specific problems. General views that better fit foreigners who visit Kazakhstan or want to learn about this country.)In short, I found in it a lot of good stories on the recent life, written with humor and occasional philosophical smiles.I left the USSR about 20 years ago and visited only twice. I think I can safely say that Rosten, with his very good command of Russian and his good friends, managed to avoid many of the literary traps that strangers often fall into, when touring the former USSR environment. The reader can trust the authenticity of every small detail he mentioned in this book, and the whole book in the entirety of its atmosphere, discussion and philosophy."}, {"review_sentiment": 5.0, "review_text": "Keith Rosten traveled to be a Fulbright lecturer in Kazakhstan. This former Soviet republic holds an important place in history--crossroads of the Silk Road in Central Asia, it is a mixing pot of the Far East and the easternmost reaches of Europe. The people are Asiatic and Turkic, far different than the Russians who moved in during the Soviet era. The time covered in this memoir is the early 90's, when Kazakhstan made the painful transition from Soviet republic to a nation on its own (though associated in the Russian circle.) The turmoil of ethnic conflict, monetary upheavals are well documented here.But what I really appreciated was the more personal observation about daily life. Rosten travels around Kazakhstan and reports the customs of the people in personal detail--this is the best part of the book. How much vodka to order for a party (surprise; 1 bottle per every 2 adults. Women will drink champagne...maybe.) He tries to avoid getting into drinking matches, sipping the edge of his glass and we imagine him watering the potted plants secretly now and then. The cold weather, the markets, the local cuisine (horse is on the menu) and the juxtaposition of statues of Lenin surrounded by ceremonial yurts. It's a wonderful journey and Rosten tells it simply and well. This is not only a book about recent historical events, it's a personal book--his time as a guest in a foreign land. I loved it and if you are an armchair traveler, you will want to pick this up and read it."}, {"review_sentiment": 4.0, "review_text": "Kazakhstan, now that's a name that few Americans knew until after the former Soviet Union ceased to exist.  Quickly, the nation became of international importance due to having its own nuclear bombs.  For most, that was the brief and complete story of Kazakhstan.American attorney Keith Rosten uses his knowledge of Russian and Kazakhstan's history, and his journal from living in Kazakhstan during the early 1990s to provide an intriguing story of how one nation founded its government, sought to keep the peace between its primary ethnic populations (majority Kazakhs and minority Russians) and groped towards a future with more prosperity.  He also updates events since then to provide a further perspective.I don't know of any alternative resource for this country during this period that's available in English.  Although Kazakhstan is a big place, it doesn't have very many people.Like many such books, there are many references to the weak economic conditions during the period, the leftover problems of the Soviet years and the new problems of independence.The best part of the book, for me, came in Mr. Rosten's many interviews with political leaders who described their thoughts and problems during the process of forming the government and creating electoral processes.  Democracy didn't really take in Kazakhstan, and you find out why it's not as easy as it sounds to move in that direction.One of the nice surprises in the book can be found in the reproductions of photographs from those years.  They bring the book to life.  Without those photographs, this would have been a three-star book.  But do realize that the reproduction isn't very good.  Almost every image looks like a copy of a newspaper photograph.I thought the book had many weaknesses.  First, I would have preferred a nonfiction book format, rather than the often-redundant journal entries.  Second, it would have been more powerful coming from the perspective of people in Kazakhstan rather than from Mr. Rosten's viewpoint.  Third, a book about events in the early 1990s would have been a lot more interesting if it had been published soon thereafter.  Fourth, the book could have used maps and reference materials about Kazakhstan to help the reader follow along.But I'm glad I read the book.  I doubt if I'll ever go to Kazakhstan (and certainly not in the winter), and Mr. Rosten made me a little more knowledgeable about the people there.I admire him, by the way, for being willing to go to such a faraway land and to teach under trying conditions."}, {"review_sentiment": 5.0, "review_text": "Ahhh, Kazakhstan! What a country, eh? Everyone is familiar with this far away spot, this one time member of the Soviet Union that has since become an independent country after the fall of Russian style communism, right? Probably not. Kazakhstan is an obscure, out of the way nation on the other side of the world, which virtually assures that nine out of ten American schoolchildren couldn't find it on a map if their lives depended on it. Heck, nine out of ten American adults couldn't locate this Asiatic nation if their lives depended on it. Only state department wonks, Soviet research specialists, and oil executives probably know much about Kazakhstan. Oh, and Keith Rosten too. He's a lawyer who spent time in this former Soviet Republic on a Fulbright scholarship back in the early 1990s. His duties included teaching courses on American law at a university. His duties also included surviving the day-to-day challenges of living in a former Soviet Republic desperately grasping at that nebulous concept called democracy. \"Once in Kazakhstan: The Snow Leopard Emerges\" is Rosten's account of his numerous adventures written in the form of a daily journal.According to Rosten, Kazakhstan is a country struggling to form a coherent identity. Arguably the greatest factor in shaping a vision of itself is its problems with the ethnic makeup of the nation. Throughout the book, the author returns repeatedly to the problems faced by Kazakhstan's Russian, German, Jewish, and Kazakh populations. The imposition of Soviet communism seriously depleted the native population when the endearing Uncle Joe Stalin presided over a kulak style extermination program aimed at turning a nomadic people into a sedentary, rural based group of cheery proletariats. Who cares if a few million wretches died in the pursuit of such a noble dream? Uncle Joe had a vision, a vision that largely succeeded in fundamentally altering the lifestyles of the Kazakh people. Here's to seeing Uncle Joe and his ilk festering in the deepest pits of Hades for all time. But in the process of changing Kazakhstan, thousands upon thousands of ethnic Russians invaded the country to take all the cushy party jobs and generally feed like a plague upon the naïve waifs who lived there. Now that the Soviet Union has faded into memory, the country struggles to define the role of those Russians still living within its borders. Thousands have left, as have Germans living in the region for centuries. Jews as well have largely left for Israel.The problem of building a democracy from the ground up, aside from ethnic insecurities, is a daunting task. Rosten details the process in a largely sober manner tinged with traces of humor. Any nation aspiring to the highest ideals of democracy must have a firm educational footing, yet the author notes how his students are far from inspired scholars. Academics earn next to nothing, even at the university level, so the emphasis on education tends to slip quite often. Students take a huge load of courses but do little real work in any of them. Drinking is a prime factor in laxity on campus, and it's also an important facet of life in Kazakhstan at large. Rosten explains repeatedly his efforts to escape the offers of various liquors, often with little success. Another factor in establishing a firm footing in the democratic tradition revolves around a stable monetary system--or at least a monetary system a nation can call its own. During the author's stay in the country, Kazakhstan attempted to institute its own currency, called the tenge, in order to replace the Russian and Soviet era rubles used by the citizenry. Chaos quickly ensued as the value of money bounced back and forth like a yo-yo. I won't even get into the quagmire that is an election in Kazakhstan. It makes our 2000 race look tame by comparison.Most of the book deals with Rosten's daily experiences in Almaty (once called Alma Alta), the capital of the country. When one acquires lodgings in this city, one soon learns to lower one's expectations. Especially if that person is an American used to American buildings and amenities. Plumbing is a problem in Almaty, especially hot water. As for roaches, well, Rosten tells us these icky pests soon became second nature when staying in apartments and hotels. If you're expecting to clean your clothing with the latest washers and dryers from Sears, forget about it. You wash by hand in the sink or use odd little machines that don't work well. Planning on heading down to the local supermarket for your weekly grocery order? Nope. Kazakhstan has a marketplace where people go to buy food on a daily basis. They also buy goods from little kiosks that sprout up on streets throughout the city. Then there is the problem of getting around the city. A person can walk, but not at night. High crime rates in Almaty during the early 1990s promised dire fates to those stupid enough to go out for a stroll once the sun went down. Driving presents a host of holy horrors.I'm making Rosten's experiences in Kazakhstan sound like a nightmare, but the author is the first to admit that he came away with a great love for the people he met there. They have problems in nearly every aspect of their lives, but they also possess a tenacity that saw them through the horrors of communism. The book concludes with the author noting several changes he witnessed on return trips to the country, some good and some bad. As for the book itself, \"Once in Kazakhstan\" is a wonderful example of travelogue literature in both the positive and the negative: positive because such books give the reader an intimate look at a foreign culture not readily available from newspapers or other sources, and negative because we rarely see anything beyond what Rosten sees. Nonetheless, this is a great book about a great nation."}]}, "authors": ["Keith Rosten"], "isbn": "0595327826", "longitude": 0.0, "periods": ["1900s"], "title": "Once in Kazakhstan: The Snow Leopard Emerges", "word_cloud": "nicely write express many challenge country also strange feel get living dry priceless make understand lite large totally unknown country entertaining highly readable memoir author time associate professor law contains memorable detail daily life culture nation throes transformation former independent frame memoir history scope leave something desire frequently omit date hard get historically orient treat scene show impact political turmoil country adopt new currency unimpressive national election constitutional referendum move autocracy author focus experience national political issue forego really undermines term mean scholarly work history political treatise armchair adventurer perfectly satisfy find shallow view present day small insight region whole little shed light cultural history core society easy especially enlighten better bet incredible overview region ebb flow cultural nuance influence helpful view also consider modern history country adopt child spend week country put write beautiful political commentary poorly research distract truly good cherish page interested great bookjohnps hop read writes second research begin first end ever dissolution interest good friend work privatization readily available area excellent volume diary time scholar moderately informative account large nation baby step modern nation background lawyer business school training well qualify tell tale country try sort legal system election function economy however fluency really allow mix people different level society get flavor place part diary typical westerner spend year abroad problem find place live breakdown municipal service garbage collection hot water heat arbitrary taxi fare strange food prevalence vodka transportation problem coverage emerge nation little country struggle arrange reasonable election constitution intertwine thorny nationality question ethnic get fair nation pretty contentious issue course population nearly halve rule program russian settlement set much do far western province last thirty year probably best bit detail first election problem outcome depressingly familiar stuff boss still power indeed autocrat narrative offer nearly much criticism little offer vague assurance stability world seem shrug disinterest election rig announces constitutional change give total control country endemic corruption mix hardly wonder repress frustrated people eventually political external outlet try effect change indeed comment disorient people really much drive privatize potential effect encourage rampant capitalism course result tiny corrupt elite skim cream great deal problem lower end society examine detail fieldwork event great number weakness foremost diary format certainly enjoy personal perspective tends much readable straight dry history reportage good example narrative weave personal experience good cribbed history lesson however account choppy becomes real nuisance jump topic topic also mean certain topic cover multiple place great deal information anecdote repeat time good editor diary format arrange flow narrative cover piece turn greater depth example learn little large korean population exactly jewish population flee more disturbingly expert mean region culture come obvious factual error towards end make question accuracy thing page writes traditional holiday celebrate year celebrate call use calendar fall completely different day calendar year commonly mark fall vernal equinox usually base zoroastrian actual prose leave great deal desire well place get groove writes fluidly easily others choppy wooden string sentence contain single fact editor easily make much better humor generally fall flat never get true sense emotional confusion frustration many people talk aesthetic level format mean notable deficiency supplementary material map tend expensive huge flaw unfamiliar country lot photos quality reproduction exceedingly low worse typical newspaper function technology use print awful great much recount pretty typical traveler tale type stuff go basic introduction country people true great deal modern reader better serve edition include fifty page independence next year subsequent get recent year rather detail want subtitle give gist recommend anyone feel need word publish region rare kind provide spatial picture everyday life political history huge country rise independence write mainly short wise story sometime anecdotes disadvantage lot classic historical work write fashion personal view personal feeling author event political leader outside political science somebody soviet life experience childhood youth partly interested foreign view thought biggest country many write journalist country sure historian ethnographer write anything study narrow specific problem general view better fit foreigner visit want learn country short find lot good story recent life write humor occasional philosophical leave year ago visit twice think safely say good command good friend manage avoid many literary trap stranger often fall tour former environment trust authenticity small detail mention whole entirety atmosphere discussion philosophy travel lecturer former republic hold important place history crossroad mix pot easternmost reach people far different move soviet time cover memoir early make painful transition republic nation associated russian circle turmoil ethnic conflict monetary upheaval well document really appreciate personal observation daily life travel report custom people personal detail best part much vodka order party surprise bottle adult drink champagne maybe try get drink match sip edge glass imagine watering pot plant secretly cold weather market local cuisine horse menu juxtaposition statue surround ceremonial yurt wonderful journey tell simply well recent historical event personal time guest foreign land love armchair traveler want pick name know former cease exist nation become international importance due nuclear bomb brief complete story attorney use knowledge russian history journal living early provide intrigue story nation found government seek peace primary ethnic population majority minority grope towards future prosperity also update event provide know alternative resource country period available big place many many many reference weak economic condition period problem soviet year new problem best part come many interview political leader describe thought problem process forming government create electoral process really easy sound move nice surprise find reproduction photograph year bring life photograph reproduction good image look copy newspaper think many weakness nonfiction format rather journal entry powerful come perspective people rather viewpoint event early interest publish soon thereafter use map reference material help glad doubt ever go certainly winter make little knowledgeable people admire way willing faraway land try condition country eh familiar far away time member become independent country fall russian style communism right obscure way nation side world virtually assure ten american schoolchildren map life depend ten american adult nation live depend only state department wonk research specialist oil executive probably know much lawyer spend time former scholarship back early duty include teach course american law university duty also include survive challenge live former desperately grasp nebulous concept call democracy account numerous adventure write form daily country struggle form coherent identity arguably greatest factor shape vision problem ethnic makeup nation author return repeatedly problem face russian populations imposition soviet communism seriously deplete native population endear preside kulak style extermination program aim turn nomadic people sedentary rural base group cheery proletariat care wretch die pursuit noble dream vision vision largely succeed fundamentally alter lifestyle people here see ilk fester deepest pit time process change thousand thousand ethnic invaded country cushy party job generally fee plague nave waif live now fade memory country struggle define role still live border leave live region century well largely leave problem build democracy ground aside ethnic insecurity daunt task detail process largely sober manner ting trace humor nation aspire highest ideal democracy educational footing yet author note student far inspired scholar earn nothing even university level emphasis education tend slip quite often student take huge load course little real work prime factor laxity campus also important facet life large explain repeatedly effort escape offer various liquor often little success factor establish firm foot democratic tradition revolve around stable monetary system least monetary system nation call author stay country attempt institute currency call tense order russian era ruble use citizenry quickly ensue value money bounce back forth even quagmire election make race look tame deal daily experience call capital country acquire lodging city soon learn lower expectation especially person american use american building amenity plumb problem especially hot water roach well tell icky pest soon become second nature stay apartment hotel expect clean clothing latest washer dryer wash hand sink use odd little machine work well head local supermarket weekly grocery order marketplace people go food daily basis also buy good little kiosk sprout street city then problem get around city person walk night crime rate almaty early promise dire fat stupid enough go stroll sun go drive present host holy make experience sound nightmare author first admit come away great love people meet problem nearly aspect live also posse tenacity saw horror communism concludes author note several change witness return trip country good bad wonderful example travelogue literature positive negative positive give intimate look foreign culture readily available newspaper source negative rarely see anything see nonetheless great great nation", "genres": ["Essay", "History", "Travel Writing"], "summary": "Soon after the disintegration of the Soviet Union, Keith Rosten leaves the United States to be a Fulbright Lecturer in newly-independentKazakhstan. \r\n\r\nIn Once in Kazakhstan, Rosten draws a sometimes humorous portrait of a critical period in the emergenceof this Central Asian country, interweaving the challenges and exhilaration of living in Kazakhstan with the historical backdrop of a nation grappling with its independence. \r\n\r\nFrom horse heads in the Central Market, to guns on the ski slopes, and to the first-ever parliamentary elections, Rosten takesyou on a whirlwind tour of the country. He vividly recounts the change in currency from the Soviet ruble to the tenge and travelswith a candidate for parliament to a rural village near Semipalatinsk.\r\n\r\nUsing his knowledge of local language and customs, Rostenprovides access to native sources on the history, politics, traditions, and spirit of Kazakhstan. Complete with photographs of thepeople, places, and monuments of the country, Once in Kazakhstanis an invaluable resource for anyone who is interested in learningmore about, or traveling to, the fascinating landscape of this emerging nation.", "asin": "0595327826", "rank": "1222330", "city": "Kazakhstan", "image": "https://images-na.ssl-images-amazon.com/images/I/51i5CMcbdsL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}