{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 50.8465573, "ratings": {"num_ratings": 660, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "The recent colonial history of what is now known as Zaire is eloquently told. Most compellingly, it is an extraordinarily sad tale of suffering inflicted on many of those unfortunate enough to call this part of the world home, motivated by colonial greed.As sad as that is, that in itself hardly makes this episode unique in colonial history. Although colonial exploitation that results in widespread native suffering and millions of death certainly requires the participation of a vast array of actors, what is perhaps the most incredible part of this particular story is the fact that all of it began as the result of the deliberate actions and deceptions of a single individual, King Leopold II of Belgium, and not from the Belgian government’s desire to become a colonial power during the “Scramble for Africa” that occurred in the late 19th and early 20th centuries. Indeed, public sentiment in Belgium at that time was that it was too small a country to aspire to colonial status.This is also the tale of some dedicated people who were observant, questioning, and caring, and who, often at significant personal risk, took action when they saw something wrong. They struggled for years to make the world take enough notice to move to action. Although they finally succeeded in making things somewhat better, the end of this tale was not completely satisfying (which is as far as I’ll go to avoid any spoilers).Heroes include E.D. Morel, Irish patriot Roger Casement, George Washington Williams (a lawyer, journalist, minister and historian), Reverend William H. Sheppard (a Presbyterian missionary), and Hezekiah Andrew Shanu (a Nigerian clerk and translator). I was particularly struck by the idea that Williams, Sheppard, and Shanu, who were all black men and who were physically present in the Congo to observe atrocities first-hand, each took a brave and especially great personal risk to report on it while they were still there. As the book points out, while the death of a white was taken very seriously in the Congo, a black death would be one among millions, and might go completely unnoticed, let alone reported on.Even after reading this, it is hard to believe that a single individual, even the king of a minor country, could pull off this heist, in essence turning most of central Africa into a personal fiefdom and managing to have ZERO accountability to anyone, even in his own nation, for the way in which it was managed. The king and those in his employ extracted millions from the sale of Congo ivory and rubber through the forced labor of its indigenous population. During his life, the king actively strove to keep these profits secret, while setting up sham organizations to help him portray himself as an anti-slavery humanitarian. He even had “his” country issue bonds so he could skim off millions in profits for his own personal fortune, all the while accountable to no one. Although the immorality of this is unquestionable (to say the least), it wasn’t even illegal thanks to the king’s cleverness.Later, when British and American minsters tried to pressure Belgium into taking over the colony from the king’s private hands, it turned out that Belgium had no legal authority over the king in any matters related to the Congo. The king would not relinquish control unless the government would pay him an outrageous sum for it. The entire story is astounding, and even after reading it, it is hard to believe that one person could pull it off.Beyond its value as history and as a fascinating tale, it is sad to report that in many ways, human behavior has not changed much in the last 100+ years. There are a number of disturbing parallels with the kinds of behavior seen in many public figures today. Just to list a few interesting parallels:- It is not hard to name one or two modern political figures who claim, as King Leopold consistently did, that their actions are “legal” while ignoring any considerations of the morality of their actions.- Chester Arthur, who for some time was considered perhaps the worst US president, is quoted as saying \"I may be president of the United States, but my private life is nobody's damned business.\" Arthur’s highest job before becoming VP was Collector of Customs Revenue for the Port of New York, and he had to leave THAT job amid corruption and mismanagement charges. He became president only because Garfield was assassinated early in his term.- The bland reports of journalists who visited the Congo are described on page 185. The largely uncritical press tended to celebrate accomplishments like the opening of the Congo railway, not reporting on (or noticing?) the toll in African lives this exacted, and celebrated the king’s regime.- E.D. Morel, one of the crusaders that attempted to move the world to action, sounds a lot like the pre-Internet version of Wikileaks in the way that he printed large amounts of confidential information from the Congo administration that revealed the scale of the abuses.- In a rather sad coda, after the Belgian government takeover of 1908, a new method of forcing people to work was introduced that drew much less protest from missionaries and humanitarians: taxes. The lesson for modern times can hardly be clearer.- A short aside near the end of the story explains the move from colonialism to independence. That short tale catalogs yet another assassination of a foreign leader who proved too independent for the “vested interests”. In other words, physical colonialism replaced by economic colonialism.Although the text is not footnoted, a large number of footnotes, followed by a list of sources, are contained in an appendix, and point directly back to specific content in the book itself. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "Textbook. That's it."}, {"review_sentiment": 5.0, "review_text": "Eye-opening, to say the least."}, {"review_sentiment": 5.0, "review_text": "Fantastic book which gives an understanding of why things are the way they are in Africa today and where most of problems are rooted from. I enjoyed reading it."}, {"review_sentiment": 4.0, "review_text": "Its a great book. I think everyone should read this to get to know this horrifying history that is left out."}, {"review_sentiment": 5.0, "review_text": "The Book arrived early and as advertised."}, {"review_sentiment": 4.0, "review_text": "A very interesting historical account of a quite shameful period of Belgian colonialism"}, {"review_sentiment": 5.0, "review_text": "This work took some work to get through.  That's not a slight against the writer's skill.  Hochschild does a great job here but his subject matter is extremely dark and depressing.  This is certainly a case of the real life story being far more horrifying than the fictional story of Heart of Darkness which draws heavily on the same history."}, {"review_sentiment": 5.0, "review_text": "This book was eye-opening. It really brings to light the tragedy that is the Congo and the source of the issues. I would definitely recommend the book to anyone who is interested in African history and current affairs."}, {"review_sentiment": 5.0, "review_text": "I knew that, among African colonies, the Belgian colonies suffered the most. But I had no idea of the magnitude. Or of America's post-colonial adventures.This is a well written, easy to read book which meticulously details the history of this horrific period. It will forever change your understanding of the Congo, and of much of colonialism in Africa.Highly recommended."}]}, "authors": ["Adam Hochschild"], "isbn": "0618001905", "longitude": 4.351697, "periods": ["1800s", "1900s"], "title": "King Leopold's Ghost: A Story of Greed, Terror, and Heroism in Colonial Africa", "word_cloud": "recent history know eloquently tell most compellingly extraordinarily sad tale suffer inflict many unfortunate enough call part world home motivate sad hardly make episode unique history exploitation result widespread native suffering million death certainly require participation vast array actor perhaps incredible part particular fact begin result deliberate action deception single individual belgian government desire become power occur late early century indeed public sentiment time small country aspire also tale dedicated people observant question care often significant personal risk take action saw something wrong struggle year make world enough notice action finally succeed make thing somewhat better tale completely satisfy far go avoid spoiler include patriot lawyer journalist minister historian clerk translator particularly strike idea black men physically present observe atrocity take brave especially great personal risk report still point death white take seriously black death million completely unnoticed alone report read hard believe single individual even minor country heist essence turn central personal fiefdom manage accountability anyone even nation way manage employ extract million sale ivory rubber force labor indigenous population life actively profit secret set sham organization help humanitarian even country issue bond million profit personal fortune accountable immorality unquestionable say least even illegal thanks british american minster try pressure take colony private hand turn legal authority matter relate control government outrageous entire astound even read hard person value history fascinate tale sad report many way human behavior change much last year number disturb parallel kind behavior see many public figure today list interest parallel hard name modern political figure claim consistently action legal ignore consideration morality time consider perhaps worst president quote say president private life nobody damn business highest job become leave job corruption mismanagement charge become president assassinate early bland report journalist visit describe largely uncritical press tend celebrate accomplishment open railway report notice toll african life exact celebrated crusader attempt move world action sound lot version way print large amount confidential information administration reveal scale rather sad coda belgian government takeover new method force people work introduce drew much le protest missionary humanitarians tax lesson modern time hardly short aside end explain colonialism independence short tale catalog yet assassination foreign leader prove independent vested interest word physical colonialism replace economic text footnote large number footnote follow list source contain appendix point directly back specific content recommend textbook least fantastic give understanding thing way today problem root enjoy read great think everyone get know horrify history leave arrive early advertise interesting historical account quite shameful period belgian colonialism work take work get slight writer skill great job subject matter extremely dark depress certainly case real life far horrify fictional draw heavily history really bring light tragedy source issue definitely anyone interested african history current affair know african colony belgian colony suffer idea magnitude well write easy meticulously detail history horrific period forever change understand much colonialism recommend", "genres": ["History"], "summary": "In the 1880s, as the European powers were carving up Africa, King Leopold Ii of Belgium seized for himself the vast and mostly unexplored territory surrounding the Congo River. Carrying out a genocidal plundering of the Congo, he looted its rubber, brutalized its people, and ultimately slashed its population by ten million--all the while shrewdly cultivating his reputation as a great humanitarian. Heroic efforts to expose these crimes eventually led to the first great human rights movement of the twentieth century, in which everyone from Mark Twain to the Archbishop of Canterbury participated. \r\n\r\nKing Leopold's Ghost is the haunting account of a megalomaniac of monstrous proportions, a man as cunning, charming, and cruel as any of the great Shakespearean villains. It is also the deeply moving portrait of those who fought Leopold: a brave handful of missionaries, travelers, and young idealists who went to Africa for work or adventure and unexpectedly found themselves witnesses to a holocaust. \r\n\r\nAdam Hochschild brings this largely untold story alive with the wit and skill of a Barbara Tuchman. Like her, he knows that history often provides a far richer cast of characters than any novelist could invent. Chief among them is Edmund Morel, a young British shipping agent who went on to lead the international crusade against Leopold. \r\n\r\nAnother hero of this tale, the Irish patriot Roger Casement, ended his life on a London gallows. Two courageous black Americans, George Washington Williams and William Sheppard, risked much to bring evidence of the Congo atrocities to the outside world. Sailing into the middle of the story was a young Congo River steamboat officer named Joseph Conrad. And looming above them all, the duplicitous billionaire King Leopold Ii. \r\n\r\nWith great power and compassion, King Leopold's Ghost will brand the tragedy of the Congo--too long forgotten--onto the conscience of the West.", "asin": "0618001905", "rank": "16264", "city": "Brussels", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZGKdOt3tL.jpg", "country": "Belgium", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}