{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 30, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Well researched and a compelling read."}, {"review_sentiment": 5.0, "review_text": "Excellent sketch of a subculture , characters, contemporary society"}, {"review_sentiment": 2.0, "review_text": "Very poorly written and translated.Readers who like to know more about bullfighting will not learn anything with the exception that the main figure is a mediocre and overrated bullfighter.No surprise that some of the greatest Bullfighters protested his election to the Bullfight Hall of fame, something which almost never happens."}, {"review_sentiment": 4.0, "review_text": "The one thing you can say about Edward Lewine is that he's no Ernest Hemingway, and thank God for that. While Hemingway's plus point was that he liked bullfighting, the over-puffed bull merchant was too opinionated and full of himself to see the error of his judgements. And, of course we all know he couldn't write. Lewine takes a much more middle-of-the-road approach, which while lacking poetry does have balance (even though he's only following one guy) and plenty of solid information. Like Hemingway, he believes that bullfighting is all about 'death in the afternoon,' on which I have to disagree. Bullfighting is about beauty and emotion; the death of the bull is meant to be about the same. It's hard for many to understand, especially for those on their moral high horses, but bullfighting can be gut-wrenchingly emotional. Lewine doesn't necessarily ignore this, but he doesn't always highlight it, although, as he points out, you have to be lucky to see it on a frequent basis. But it's a good, thorough and informative book and probably merits 4.5 stars. I find it hard to believe that he fails to talk much about superstars such as El Cordobes and Espartaco (both get passing mentions) and books such as 'Or I'll Dress You In Morning' (El Cordobes' biography, arguably the definitive bullfighter's story) or the anthropogically based 'Bullfight' by Dr. Garry Marvin. The writing style is passable but not inspiring, but it's a solid effort at enlightening the unenlightened."}, {"review_sentiment": 5.0, "review_text": "I will not deny that I was always a little on the bias side regarding the modern state of bullfighting and the old. I grew up hypnotized by the lives of certain bullfighters such as Joselito, Belmonte, Manolete, etc. For some reason I had established in my mind that the past of bullfighting was the only one that counted, that modern bullfighting lacked the intensity that the past had delivered. Tragedy has always been one of the aspects of bullfighting that mystified me. There is just too much heart and soul in the lives of these very rare to find breed of individuals. The struggle to be counted among the best alone is a monumental task. Stories from striking poverty to riches, achieved by facing a deadly and powerful adversary, which is the fighting bull. Some breeders reputations for sending to the ring bulls that took the life of many great bullfighters.There is undoubtedly that side to the corrida. Where the matador would be gored, mostly in areas that are mortal, and the amazing courage displayed even in the last moments, such as Manolete inquiring in his last lucid moments if he had done a good job. Those who admire and follow the bullfights can not help but to be drawn into the art and drama involved. What about the gypsy heritage established by many recognized great bullfighters of the past? Joselito being a shinning example of what is a bullfighter.Enter Death and the Sun: A Matador's Season in the Heart of Spain. What a book this turned out to be. Mr. Edward Lewine turns out, has nothing to envy (not that he would, I am sure) Ernest Hemingway's books on the subject. He is so fluent and passionate that it is a delight reading his account of what it is to follow a distinguished matador, one that comes from a family of very distinguished matadors, which Ordoñes was one. How smooth and interesting his tale, and how sadly mistaken I was when I assumed that modern bullfighting had lost its shine. The fact of the matter is, that even today, the fine tradition of this art is as vibrant and intense as any other era. Learned this lesson because of the fine work of this writer, and can he write, Señoras y Señores! He most certainly can, elegantly and concisely, not a page skipped or left unturned, savoring dialogue and insider's view of this very private and exclusive world of the Torero. Needless to say, I was thrilled and must confess, became a fan of the matador described in these pages in the process. Takes plain courage, plain guts to face a season in the spanish circuit. Not a lightly undertaking, and with all the added knowledge of the writer, past and present, the season becomes also the reader's, for it does not take long to find one self immersed in the challenging days of a Matador's Season.Brilliant writer, a credit to the art of bullfighting, funny one moment, immensely sad the next, this is indeed the work of a consummate and skillful writer that knows his topic inside out. Ole! 5 Shinning Stars!"}, {"review_sentiment": 5.0, "review_text": "Amazing piece of work. The author had unbelievable access to the world of bullfighting in Spain through one of Spain's top bullfighters, Fran. He was able to tag along with Fran's crew and get great insight into the whole world of bullfighting.It is hard to believe this is his first book as it's almost perfect in every sense. From capturing the feel of a bullfight no matter the venue from Madrid and Sevilla to the smaller countryside rings. We also get loads of info and background on the sport and the famous matadors of years past.He also has the best take on Hemingway's writing on bullfighting and reveals how Papa is perceived in Spain itself."}, {"review_sentiment": 5.0, "review_text": "Fascinating, moving, beautifully written book. Even for a vegetarian Englishwoman who feels bad about swatting a fly. It doesn't matter what you feel about bullfighting; the book doesn't make you decide, you just get caught up in the human and artistic aspects of it all. Essential reading for any true hispanophile."}, {"review_sentiment": 5.0, "review_text": "Having attended a couple of corridas in Spain and done some reading on it, this book is without question the best work on the current state of the \"sport/art\" of bullfighting.  For one thing it follows a modern day matador and his entourage for the whole season -- far more extensively, I might add, than Hemingway's The Dangerous Summer. (The author even gives the reader the opinions of the Spanish about Hemingway and his fascination for bullfighting.) The author traveled with them for most of the season, experiencing the ups and downs of the toreros, banderilleros, picadors, etc.  The book is copyrighted in 2005, and covers the 2003 or 2004 bullfighting season, so it is very current.  One thing I was not aware of before I read it was that there is an active bullfighting scene in southern France with quite a number of arenas.  The book even has an appendix entitled \"How to see them\" in which it tells you how to buy seats, what seats are best and why, and so on.  The book is not a candy coated work on the subject -- the author makes it very clear it is a brutal, cruel activity.  But he also gives the mindset and understanding of why it appeals to so many Spaniards and others.  If you want a very thorough, very interesting, very current book on the subject, this is it!"}, {"review_sentiment": 5.0, "review_text": "Death and the Sun: A Matador's Season in the Heart of Spain by Edward Lewine.2005. 272 pages.The topic of this book is controversial, bullfighting. Many people abhor it and others are simply fascinated or love it. This book will not convince you to change your position from either camp, but then again it was not meant to. This books purpose is to serve as an introduction into the sport/art of the bullfight.The author lays it all out for the reader to make their own informed choices. The path way to entry is through the experience of a single matador. The matador chosen is not a bottom rung matador and he is not a top rung matador he is your average working matador. The choice is a good one and it is literary inspired as the matador is a fourth generation bullfighter whose ancestors were influential in inspiring Hemingway to write of the bullring and thus introduce the sport to a wider American audience.The author does an excellent job of teaching the reader about the bulls, their breeding, the types, the evolution of the bull and the mythology behind the bull. The author does a masterful job of breaking down a day at the bullring into its many parts which make up the whole. Most of this knowledge is unknown on those who are not in cultural tune with the culture of the bulls. This knowledge makes it easier to understand what you are seeing and why. It does open the art of the bullfight and allows the viewer in.The author also allows us to see behind the scenes into the lives and struggles of a matador and his crew. The difficulty and flavor of every city and its crowds. The author is a journalist and as such he presents the information objectively even though he is embedded with the matador and his crew. But the writing is well constructed and flows well from topic to topic making this a very easy and good read. It is hard to read bullfight aficionados or purists as they tend towards using only the Spanish terms which can confuse an English speaking reader. The author here presents the terms and defines them but routinely uses the more familiar, if not perhaps as precise, English terminology. What you lose in nuance you gain from entry. I read this book in two sitting being drawn into the text and the imagery of the written word. Though a travelogue in many ways it reads like a well written page-turner of a novel. Storytelling remained a priority.Bullfighting is perhaps the only sport/art in which the individual is not judged on how well they move but rather on how well they stand. It is our only real link back to the ancient Roman world where man was pitted against beast. It is in some ways even more ingrained in the pre-historic world where man hunted and matched wits with beasts for food and survival. There is something of poetry in this primeval dance. Should the bullfight be legislated out of existence the bulls may delight but it would be a serious long festering sore, as if from a goring itself, on the cultures in which it is commonly practiced.Yes, I have been to the bullring. Yes, I enjoyed it immensely. I enjoyed it for reasons that are very difficult to put into words. I have tried but how can you describe the tension and the smells? How can you describe something that touches and pricks deep in your soul? The poets have tried with love for eons and yet they come up short."}, {"review_sentiment": 5.0, "review_text": "DEATH AND THE SUN is a book that all 'aficionados of las corridas de toros' will enjoy.  The author travels with Fernando Rivera Ordonez throughout a 'corrida season', April through October, in Spain.  It is a book comparable to THE ORCHID THIEF in that it is not a book just about Rivera Ordonez, but about the 'mundo taurino' in Spain, as well as Spain itself.  The problem with many books about 'el mundo taurino' is the quality of the writing.  Mr. Levine knows language and how to use it....it is beautifully written...explanatory, passionate, interesting, and honest.  To say it simply, my friends and I could not put the book down once we started it."}]}, "authors": ["Edward Lewine"], "isbn": "061826325X", "longitude": -3.7035825, "periods": ["2000s", "Recent Releases"], "title": "Death and the Sun: A Matador's Season in the Heart of Spain", "word_cloud": "well research compelling excellent sketch subculture character contemporary society very poorly write know bullfighting learn anything exception main figure mediocre overrate surprise greatest bullfighter protest election fame something almost never happen thing say thank point like bullfighting bull merchant opinionated full see error judgment course know take much approach lack poetry balance even follow guy plenty solid information believe bullfighting afternoon disagree bullfighting beauty emotion bull mean hard many understand especially moral high horse bullfighting emotional necessarily ignore always highlight point lucky see frequent basis good informative probably merit star find hard believe fail talk much superstar passing mention dress morning biography arguably definitive bullfighter story anthropologically base writing style passable inspire solid effort enlightening unenlightened deny always little bias side regard modern state bullfighting old grow hypnotize life certain bullfighter etc reason establish mind bullfighting counted modern bullfighting lack intensity delivered always aspects bullfighting mystify much soul live rare find breed individual struggle count best alone monumental task story strike poverty rich achieve face deadly powerful adversary fighting bull breeder reputation send ring bull take life many great undoubtedly side corridor matador mostly area mortal amazing courage display even last moment inquire last lucid moment do good job admire follow bullfight help art drama involve gypsy heritage establish many recognize great bullfighter shin example turn turn nothing envy sure subject fluent passionate delight read account distinguish matador come family distinguish matador smooth interesting tale sadly mistake assume modern bullfighting lose shine fact matter even today fine tradition art vibrant intense era learn lesson fine work writer write certainly elegantly concisely page skip leave upturned savor dialogue insider view private exclusive world say thrill become fan matador describe page process plain courage plain gut face spanish circuit not lightly undertake add knowledge writer present become also take long find self immerse challenging day writer credit art bullfighting funny moment immensely sad next indeed work consummate skillful writer know topic amaze piece work author unbelievable access world bullfighting top bullfighter fran able tag crew great insight whole world hard believe first almost perfect sense capture feel bullfight matter venue smaller countryside ring also get load info sport famous matador year also best write bullfighting reveals perceive fascinate move beautifully write even vegetarian feel bad swat fly matter bullfighting decide caught human artistic aspect essential reading true hispanophile have attend couple corridor do reading question best work current state bullfighting thing follow modern day matador entourage whole far extensively author even give opinion spanish fascination bullfighting author travel experience ups down toreros banderillero picador etc copyrighted cover bullfighting current thing aware active bullfighting scene southern quite number even appendix entitle see tell seat seat best candy coat work subject author make clear brutal cruel activity also give mindset understanding appeal many others want interesting current subject topic controversial bullfighting many people abhor others simply fascinate love convince change position camp mean purpose serve introduction author lay make informed choice path way entry experience single matador matador choose bottom rung matador top rung matador average working matador choice good literary inspire matador fourth generation bullfighter ancestor influential inspire write bullring thus sport wider american author excellent job teach bull breed type evolution bull mythology bull author masterful job break day bullring many part make whole knowledge unknown cultural tune culture bull knowledge make easier understand see open art bullfight allow viewer author also allow see scene life struggle matador crew difficulty flavor city crowd author journalist present information objectively even embed matador crew write well construct flow well topic make easy good hard bullfight aficionado purist tend towards use spanish term confuse english speak author present term defines routinely use familiar perhaps precise terminology lose nuance gain entry sit draw text imagery write word travelogue many way read well write remain perhaps individual judge well rather well real link back ancient world man pit way even ingrain world man hunt matched wit beast food survival something poetry primeval dance bullfight legislate existence bull serious long fester sore gore culture commonly bullring enjoy immensely enjoy reason difficult put word try describe tension smell describe something touch prick deep soul poet try love eon yet come short leis enjoy author travel comparable taurino well problem many undo taurino quality write know language use beautifully write explanatory passionate interest honest simply friend start", "genres": ["Travel Writing"], "summary": "A brilliant observer in the tradition of Adam Gopnik and Paul Theroux, Edward Lewine reveals a Spain few outsiders have seen. There's nothing more Spanish than bullfighting, and nothing less like its stereotype. For matadors and aficionados, it is not a blood sport but an art, an ancient subculture steeped in ritual, machismo, and the feverish attentions of fans and the press.\r\n\r\nLewine explains Spain and the art of the bulls by spending a bullfighting season traveling Spanish highways with the celebrated matador Francisco Rivera Ordónez, following Fran, as he's known, through every region and social stratum. Fran's great-grandfather was a famous bullfighter and the inspiration for Hemingway's matador in The Sun Also Rises. Fran's father was also a star matador, until a bull took his life shortly before Fran's eleventh birthday.\r\n\r\nFran is blessed and haunted by his family history. Formerly a top performer himself, Fran's reputation has slipped, and as the season opens he feels intense pressure to live up to his legacy amid tabloid scrutiny in the wake of his separation from his wife, a duchess. But Fran perseveres through an eventful season of early triumph, serious injury, and an unlikely return to glory.", "asin": "061826325X", "rank": "2443269", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51%2BYs-LLwGL.jpg", "country": "Spain", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}