{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 21, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "The first 70 pages are wonderful.  Then it drags a bit.  Around page 150 it gets really good.  Then a boring part.  The ups and downs continue but overall this is a decent book."}, {"review_sentiment": 5.0, "review_text": "I love this book! So human in scale, so much heart, real characters whose lives engage you. Contrary to what another reader reported, I did not find myself impatient with the detailed descriptions; I absolutely revel in Byers’ writing, caught up in its world. His prose is evocative, never showy; elegantly simple and always just right. He uses familiar words in a fresh way, new pairings. I often had to stop and marvel over a particularly stunning passage. Byers’ ear for dialogue is acute, with all his characters, but especially when two teenagers are talking.The through-line of “Long for This World” is the story of a geneticist who discovers a cure for a deadly childhood disease. The book is also about that geneticist, Henry Moss, and his family:  his wife Ilse, from Austria, his daughter Sandra, who is a high school basketball player, and his son Darren, who is 14, the age at which kids with this disease typically succumb.This story is also about the author’s hometown, Seattle, circa 1999, in the throes of wretched excess, thanks to a dot.com bubble. Everyone’s flush with new money.  MacMansions are cropping up everywhere. People are buying the house next door so they can tear it down for a better view of the lake or mountains.This book was pure pleasure from start to finish."}, {"review_sentiment": 2.0, "review_text": "Not a book I would recommend.  I found myself impatient with the detailed descriptions of rooms and spaces, which for me, added little to the story. Other than William's character, and the clandestine relationship he had with Darren, I felt like I was simply moving through life, day after day, with characters who I didn't find very interesting.  The central plot was thought provoking, as an ethical dilemma, though not particularly original."}, {"review_sentiment": 1.0, "review_text": "A medical researcher finds a potential cure for an inevitably fatal disease that kills young people in the prime of their lives. Does he go through the proper experimental channels, thereby dooming several young people under his care, or does he ignore those channels, thereby possibly saving several lives? Hardly a new ethical problem, as I'm sure more than one researcher - AIDS researchers, for example - have faced this problem. In the book at hand, the author treats the problem novelistically, but his writer's skills are not up to the task. The characters are uninteresting, what one writer once called \"ideas with legs\". It's a long book, over 400 pages, and I gave up after 200. The idea merits the attention of a talented short-story writer and this writer is reputed to be just that. But as a novel, it's a failure."}, {"review_sentiment": 3.0, "review_text": "A doctor discovers a possible cure for a rare disease, then administers it to a favorite patient without waiting for approval. He feels justified because the patient is dying anyway, but also figures he'll get rich if the cure works. So begins the basic story in this book. While not especially original, it might be crafted into a solid short novel of 150 to 200 pages. Trouble is, this book goes on about 3 times as long. The many digressions on the experiences of the doctor's relatives, neighbors, etc. add little or nothing to the central story. Few of the digressions are very interesting in and of themselves. I can see this as a good book for people in the medical and related fields, but even they might want to skip many sections."}, {"review_sentiment": 5.0, "review_text": "I came across this book through one of the Seattle area purchase-circles. Its a complex story in a simple setting - the story of a family each with their own wants and needs, and a larger story of life through the father's patients, or research subjects."}, {"review_sentiment": 4.0, "review_text": "Although the plot of this book can be summarized in a sentence, during the 400+ pages of it you learn nearly encyclopedic knowledge about each of the characters -- their motivations, their histories, their hopes and desires.  You get to spend at least a chapter inside each character's head, and the author does a great job of bringing the characters to life.The Seattle setting is completely accurate, including lots of little out-of-the-way spots only a native knows.  Apparently the author's father works at the University of Washington hospital, which explains it.I was a little disappointed by the way the plot was SO realistic -- no dramatic denouement, no resolution to several characters' turmoils, no good guys or bad guys... this was refreshing in a way but, novelistically, curiously unsatisfying.  Well worth a read anyway."}, {"review_sentiment": 4.0, "review_text": "I was a bit disappointed in the book because it was billed as 'medical-ethical thriller', but was much more a quiet look at an American family.  That is not a problem of course, just what I expected.  It is a book of quiet grace.  The characters are all fleshed out and almost like people we know.  They have real concerns, real ideas, real problems.  The story has it's ups and downs, as in real life...it does not have huge, shattering plots twists--again, that is just right for the novel.  If you are looking for a sweet, sad, and ultimately hopeful potrait of America at the turn of the century, this your book."}, {"review_sentiment": 4.0, "review_text": "What a wonderful book! The characters are very well done. I chose this book because I suffer from a chronic disease (and hope for a cure), but then I enjoyed Ilse's immigrant points of view, having met my US husband in Europe myself (I'm from Germany).However, I would have expected better research of Ilse's background: Ilse's mother gives her marks when Ilse leaves for Paris - but the currency of Austria used to be the Schilling, not the Deutsche Mark (now it's the Euro). When Ilse speaks German, it sounds like straight out of a dictionary - no grammar knowledge whatsoever. And so on and on...Byers knows how to write and does it very well, so maybe he just needs an assistant for the research part. Despite its shortcomings, I loved the book and will recommend it."}, {"review_sentiment": 3.0, "review_text": "LONG FOR THIS WORLD sets up a quite believable situation where a medical researcher is suddenly handed a cure for Hickman's Syndrome (Hutchinson-Gilford Progeria Syndrome) and given a possible chance to save a beloved patient.  The setting and medical details are incredibly accurate and the characters are believable.  Maybe they are a bit too realistic, though, for fiction.  The trials and tribulations of two teenage characters are full of the angst and trivial details too common in teenagers.  If not for the teenage boy's clandestine friendship with his father's Hickman patient, it would have been boring.  The fact that he never confessed this friendship or their midnight adventure was a let down.  The adult characters, too, have their own priorities.  The ending is as satisfying as it can be given the realism of the story.  This book was filled with good information about a little understood disease and the interactions between doctor and patient, patient and teenage son, and doctor and parents of the patient are good.  I'd recommend the book for that.  Children who actually suffer from progeria (mercifully few) should not read this book."}]}, "authors": ["Michael Byers"], "isbn": "0618446486", "longitude": -122.3300624, "periods": ["2000s"], "title": "Long for This World: A Novel", "word_cloud": "first page wonderful then drag bit page get really good then bore part ups down continue overall decent love so human scale much heart real character life engage contrary report find impatient detailed description absolutely revel byers write caught world prose evocative never showy elegantly simple always right use familiar word fresh way new pairing often stop marvel particularly stunning passage byers ear dialogue acute character especially teenager story geneticist discovers cure deadly childhood disease also geneticist family wife daughter high school basketball player son age kid disease typically story also author hometown circa throe wretched excess thanks bubble flush new money mac mansions crop everywhere people buying house next door tear better view lake pure pleasure start not find impatient detailed description room space add little story other character clandestine relationship felt simply move life day day character find interest central plot think provoke ethical dilemma particularly original medical researcher find potential cure inevitably fatal disease kill young people prime life proper experimental channel thereby doom several young people care ignore channel thereby possibly save several life hardly new ethical problem sure researcher researcher example face problem hand author treat problem novelistically writer skill task character uninteresting writer call idea legs page give idea merit attention talented writer writer repute failure doctor discover possible cure rare disease administers favorite patient wait approval feel justified patient die anyway also figure rich cure work so begin basic story especially original craft solid short page go time many digression experience doctor relatives neighbor little nothing central story few digression interest see good people medical related field even skip many section come area complex story simple set story family want need larger story life father patient research subject plot summarize sentence page learn nearly encyclopedic knowledge character motivation history hop desire get least chapter character head author great job bring character set completely accurate include lot little spot native know apparently author father work hospital explain little disappointed way plot realistic dramatic denouement resolution several character turmoil good guy bad guy refresh way novelistically curiously unsatisfying anyway bite disappointed bill thriller much quiet look american family problem course expect quiet grace character flesh almost people know real concern real idea real problem story ups down real life huge shatter plot twist right look sweet sad ultimately hopeful portrait turn century wonderful character well do choose suffer chronic disease hope cure enjoy immigrant point view meet expect better research background mother give mark leave currency use schilling speak german sound straight dictionary grammar knowledge whatsoever know write well maybe need assistant research part shortcoming love recommend set quite believable situation medical researcher suddenly hand cure give possible chance save beloved patient set medical detail incredibly accurate character believable maybe bit realistic fiction trial tribulation teenage character full angst trivial detail common teenager teenage clandestine friendship father patient fact never confess friendship midnight adventure let adult character priorities end satisfy give realism story fill good information little understood disease interaction doctor patient patient teenage son doctor parent patient good recommend actually suffer progeria mercifully", "genres": ["Fiction & Literature"], "summary": "This wise and richly symphonic first novel by the award-winning author of The Coast of Good Intentions is a thoroughly contemporary family drama that hinges on a riveting medical dilemma. \r\n\r\nDr. Henry Moss, a dedicated geneticist, happens upon a possible cure for a disease that causes rapid aging and early death in children. His discovery may hold the key to eternal youth, but exploiting it is an ethical minefield. Henry must make a painful choice: he can save the life of a critically ill boy he has grown to love — at the cost of his career — or he can sell his discovery for a fortune to match the wealth of his dot-com-rich Seattle neighbors. \r\n\r\nFor help Henry turns to his close-knit family, and in their intimately detailed lives a story blossoms of unforgettable characters grappling with their own demons. Henry\"s wryly intelligent wife, Ilse, longs to rediscover some passion as she faces middle age and languishes in a dead-end job. Their daughter, a high school basketball star, suffers setbacks and the pangs of early love, while their sweet, hapless son drifts into adolescence. \r\n\r\nThese utterly real characters inhabit a story that, in Elizabeth Berg\"s words, \"will move you to tears and make you laugh out loud. It will also probably make you lie in bed at night and think about things that should be thought about: medical ethics, the moral choices of everyday life, the meaning of friendship and love and compassion, the need for connection.\"", "asin": "0618446486", "rank": "1790749", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/51tMHAFelwL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}