{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 102, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "What a fantastic book! My 8-year-old has listened to the first three audio books so many times (and is now reading the fourth) that I decided I should give the book a whirl. I was not disappointed. Theodosia is such an amazing main character, and the story was super fun. I can't wait to read the other books!"}, {"review_sentiment": 5.0, "review_text": "My dd's new favorite book."}, {"review_sentiment": 4.0, "review_text": "good story.  I'm sending it on to our granddaughter."}, {"review_sentiment": 5.0, "review_text": "Theodosia's character pulls you into her story from the very beginning. She is thinking every moment which keeps you, the reader, thinking every moment as well. Loved the twists and turns and the mysterious puzzles. With a touch of magic, this book has something for everyone. A great read!"}, {"review_sentiment": 5.0, "review_text": "THEODOSIA  is full of curiosity and spunky. For fans of ancient Egypt ,the adventurous Theo reminds us of the wonders of ancient times, and of the time period of the adventure. What fun reading! ABSOLUTELY recommend this series!"}, {"review_sentiment": 5.0, "review_text": "This is a great series. I couldn't put it down!"}, {"review_sentiment": 5.0, "review_text": "Very enjoyable read with twists that will entertain the young and old alike. It is refreshing to read a book that weaves the ancient occult into a more modern setting. The story is more believable as the magic is delicately woven into the capabilities of young Theodosia that could easily be explained away as intuition. In the end, a book that did not disappoint."}, {"review_sentiment": 5.0, "review_text": "Recommended for young and not-so-young readers alike. Theodosia is a wonderful protagonist and I can't wait to read more of her adventures."}, {"review_sentiment": 4.0, "review_text": "This book instantly grabbed my imagination, and soon before I knew it, I had read the whole book! I recommend this for anyone who likes Egypt and fantasy . If you like adventure books this book definitely for you ."}, {"review_sentiment": 5.0, "review_text": "Great and low cost.  Does the job."}]}, "authors": ["R. L. LaFevers"], "isbn": "0618999760", "longitude": 31.243666, "periods": ["2000s", "Recent Releases", "Pre Common Era"], "title": "Theodosia and the Serpents of Chaos", "word_cloud": "fantastic listen first audio many time read fourth decide give whirl disappoint amaze main character story super fun dd new favorite good story send granddaughter character pull story begin think moment keep think moment well twist turn mysterious puzzle touch magic something everyone great full curiosity spunky fan ancient adventurous remind wonder ancient time time period adventure fun read recommend series great series very enjoyable twist entertain young old refresh weave ancient occult modern set story believable magic delicately woven capability young easily intuition end disappoint recommend young reader alike wonderful protagonist adventure instantly grab imagination soon know whole recommend anyone like fantasy adventure definitely low cost job", "genres": ["Fiction & Literature", "Historical Fiction", "Ancient Civilizations", "Fantasy", "Children's Books"], "summary": "Book 1/4 in The Theodosia Series\r\n\r\nTheodosia Throckmorton has her hands full at the Museum of Legends and Antiquities in London. Her father may be head curator, but it is Theo—and only Theo—who is able to see all the black magic and ancient curses that still cling to the artifacts in the museum.\r\n\r\nWhen Theo’s mother returns from her latest archaeological dig bearing the Heart of Egypt—a legendary amulet belonging to an ancient tomb—Theo learns that it comes inscribed with a curse so black and vile that it threatens to crumble the British Empire from within and start a war too terrible to imagine. Intent on returning the malevolent artifact to its rightful place, Theo devises a daring plan to put things right. But even with the help of her younger brother, a wily street urchin, and the secret society known as the Brotherhood of the Chosen Keepers, it won’t be easy . . . she quickly finds herself pursued down dark alleys, across an ocean, through the bustling crowds of Cairo, and straight into the heart of an ancient mystery. Theo will have to call upon everything she’s ever learned in order to prevent the rising chaos from destroying her country—and herself!", "asin": "0618999760", "rank": "97720", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51IUI0PlvyL.jpg", "country": "Egypt", "story_arc": ["Tragedy", "Things only get worse"]}