{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 99, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "I strongly disliked this book. It chronicles a middle-aged mainlander's career as the manager of a lower-status Honolulu hotel and is written in as a series of artificially short, episodic \"just so\" stories. The only characters who were not made intentionally repulsive were pretentious and annoying. Locals were described as stupid and mute so often by characters that it was hard for the reader to draw any other conclusion.  My admiration for this author’s other works compelled me to finish this book. I wanted it to end sooner."}, {"review_sentiment": 1.0, "review_text": "Unreadable due to atrocious pidgin.  I’ve lived in Hawai‘i for 15 years and even I can’t understand it."}, {"review_sentiment": 5.0, "review_text": "Paul Theroux at is caustic best. The narrator is a disenchanted writer who is the manager of a vintage hotel in Waikiki with topless hula contests and bleary- eyed clientele in the Paradise Lost bar. A semi- retired hooker who is the mother of the “young, fresh” Hawaiian he marries lives on the third floor. The owner of the hotel is a self-indulgent blowhard given to sadistic tricks on his relatives who happens to be a millionaire. The cast of outrageous characters goes on with sad pinch lines at the end of each of their bizarre tales. But, somehow it all seems believable. I couldn’t stop reading about these locals who hate mainlanders who decide to stay on the “green island.” Theroux lives in Hawai’i and had a lot of fun with the pidgin that locals speak and some of their attitudes. I was sorry when it ended and I had to get back to less entertaining debacles and ridiculous circumstances.P.S. I am a big fan of Happy Isles of Oceania and Fresh Air Fiend by the same author.I am the author of Wai-nani: A Voice from Old Hawai'i"}, {"review_sentiment": 5.0, "review_text": "I love Paul Theroux's books, puts me to sleep in less than twenty minutes. Highly recommend- great reading."}, {"review_sentiment": 2.0, "review_text": "Dreary and depressing."}, {"review_sentiment": 5.0, "review_text": "I must have read this over 15 years ago and still remember characters and lines of dialogue.Each chapter is, in a way, a short story involving one or more of the main characters. It's funny as hell in parts, dark and depressing in others, and just good storytelling in others - quite a feat of writing on the part of Paul Theroux."}, {"review_sentiment": 4.0, "review_text": "Easy read"}, {"review_sentiment": 5.0, "review_text": "I was not sure what to expect with this novel but I really enjoyed the storytelling from the prospective of the hotel manager.  The characters were great fun and Hotel Honolulu was an entertaining read."}, {"review_sentiment": 5.0, "review_text": "Lovely story telling book!"}, {"review_sentiment": 3.0, "review_text": "Got tired of the increasingly sexual overtones as the book continued. Initially, very funny."}]}, "authors": ["Paul Theroux"], "isbn": "0618219153", "longitude": -157.8556764, "periods": ["1900s"], "title": "Hotel Honolulu: A Novel", "word_cloud": "strongly dislike chronicle main lander career manager write series artificially short episodic stories character make intentionally repulsive pretentious annoy local describe stupid mute often character hard draw conclusion admiration author work compel finish want end sooner unreadable due atrocious pidgin live year even understand caustic best narrator disenchant writer manager vintage topless hula contest eye clientele bar retire hooker mother young fresh hawaiian marries live third floor owner blowhard give sadistic trick relatives happens millionaire cast outrageous character go sad pinch line end bizarre tale somehow seem believable stop read local hate mainland decide stay green live lot fun pidgin local speak attitude sorry end get back le entertaining debacle ridiculous big fan happy author love put sleep le twenty minute highly great reading dreary depressing year ago still character line chapter way short story involve main character funny hell part dark depress others good storytelling others quite feat write part easy sure expect really enjoy storytelling prospective manager character great fun entertain lovely story tell tire increasingly sexual overtone continue", "genres": ["Fiction & Literature", "Mystery & Suspense", "Satire"], "summary": "In this wickedly satiric romp, Paul Theroux captures the essence of Hawaii as it has never been depicted. The novel's narrator, a down-on-his-luck writer, escapes to Waikiki and soon finds himself the manager of the Hotel Honolulu, a low-rent establishment a few blocks off the beach. Honeymooners, vacationers, wanderers, mythomaniacs, soldiers, and families all check in to the hotel. Like the Canterbury pilgrims, every guest has come in search of something -- sun, love, happiness, objects of unnameable longing -- and everyone has a story. \r\n\r\nBy turns hilarious, ribald, tender, and tragic, HOTEL HONOLULU offers a unique glimpse of the psychological landscape of an American paradise.", "asin": "0618219153", "rank": "375008", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51q4XNnCIoL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}