{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 1226, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Poor Gogol. First he is deprived of a real name because his grandmother's letter gets lost in the mail, then he is forced to go through life with his \"good name\" or use name given by his father until the letter arrives. Unfortunately, the letter never arrives, and the grandmother dies. The boy is forced to move through life without a real name. As the first American son of a Bengali family, he straddles two worlds, never fully at home in either one. His periodic months-long visits to Calcutta with his family serve to unbalance him even more. No matter how much he tries, he cannot ground himself either in American or Bengali culture.Lahiri is a master of exploring the experience of being torn between two worlds, at home in neither."}, {"review_sentiment": 5.0, "review_text": "I love her simplicity of language and how it provides such a rich experience in my mind. Though the main character is the constant, the surrounding stories of his family are fulfilling in their own right. There’s a heartbreaking tenderness to her work that is beautiful."}, {"review_sentiment": 4.0, "review_text": "This book's wonderful writing drew me in from the very first page, as a young woman goes into labor. The story flowed, the characters were well drawn, and the plot (for the most part) held together and made sense. However, the main character's (Gogol/Nikhil) actions often made no sense to me, especially his (and his sister's) complete turnaround after his father died. I also wondered why there was a \"throwaway\" marriage in the book."}, {"review_sentiment": 5.0, "review_text": "Loved the book."}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 4.0, "review_text": "A beautiful story told in simple language, filled with nostalgia and sad realities of immigrants."}, {"review_sentiment": 5.0, "review_text": "A wonderfully written novel which holds the reader from start to finish.  In fact, it was sad to come to the end of it and have nothing more to read about its lead character Gogol who was so endearing and sympathetic.  The dialogue is simply perfect."}, {"review_sentiment": 5.0, "review_text": "Again I am captivated by the writings of Jhumpa Lahiri.  Having read Interpreter of Maladies, I was rewarded by once again selecting this novel.There is nothing like historical fiction and/or stories incorporating other cultures, traditions and mindsets.Ms. Lahiri has the gift of interpreting a fine story along with all.The Namesake, one Gogol Ganguli, son of Bengali immigrants, Ashima and Ashroke, spends his life attempting to reinvent himself, his name and heritage in order to...what?Gogol and all the characters are relatable, understood and add to the complexity we all have in our close and extended relationships.I cared, absorbed, and was enlightened with culture and new insights."}, {"review_sentiment": 4.0, "review_text": "The Namesake -- Jhumpa LahiriPROS: Beautifully written, with vivid depictions of characters and settings that feel true and authentic. A timeless, classic story of identity, family, and self-discovery.CONS: The last third of the book drags a little and didn't sustain my attention the way the rest of the book did. The ending was poignant but a little dull. I had expected (and hoped for) more.Overall: This is my first Jhumpa Lahiri read, so I can't compare it to Interpreter of Maladies or any of her other works. I appreciate Lahiri's ability to make her characters \"come to life\" on the page, to recreate specific time periods, settings, and kinds of people with such skill that you sometimes forget you're reading fiction. This was an enjoyable read, though the first 2/3 of the book was better, in my opinion, than the end. I kept waiting for the plot to intensify a little, but the story plodded on as it had throughout, if anything becoming less intense as it progressed. Nevertheless, this is a fine novel, a worthy retelling of a classic human story, well written and, for the most part, engaging. Not an amazing book, but a good one."}, {"review_sentiment": 5.0, "review_text": "great book.love this author"}]}, "authors": ["Jhumpa Lahiri"], "isbn": "0618485228", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Namesake: A Novel", "word_cloud": "deprive real name grandmother letter get lose mail force go life good name use name give father letter arrive unfortunately letter never arrive grandmother die boy force move life real name first american son family straddle world never fully home periodic visit family serve unbalance even matter much try ground american master explore experience torn world home neither love simplicity language provide rich experience mind main character constant surround story family fulfil right heartbreaking tenderness work beautiful wonderful writing draw first page young woman go labor story flow character well draw plot part hold together make sense however main character action often make sense especially sister complete turnaround father die also wonder throwaway marriage love great beautiful story tell simple language fill nostalgia sad reality immigrant wonderfully write hold start finish fact sad come end nothing lead character endear sympathetic dialogue simply perfect again captivate writing reward select nothing historical fiction story incorporate culture tradition gift interpret fine story son immigrant spend life attempt reinvent name heritage order character repeatable understood add complexity close extend cared absorbed enlighten culture new insight write vivid depiction character setting feel true authentic timeless classic story identity family last third drag little sustain attention way rest end poignant little dull expect hop first work appreciate lahiri ability make character life page specific time period setting kind people skill sometimes read fiction enjoyable first better opinion end keep wait plot little story plod anything become le intense progress fine worthy retell classic human story well write part engage not amaze good great author", "genres": ["Fiction & Literature"], "summary": "Jhumpa Lahiri&#039;s Interpreter of Maladies established this young writer as one the most brilliant of her generation. Her stories are one of the very few debut works -- and only a handful of collections -- to have won the Pulitzer Prize for fiction. \r\n\r\nAmong the many other awards and honors it received were the New Yorker Debut of the Year award, the PEN/Hemingway Award, and the highest critical praise for its grace, acuity, and compassion in detailing lives transported from India to America. \r\n\r\nIn The Namesake, Lahiri enriches the themes that made her collection an international bestseller: the immigrant experience, the clash of cultures, the conflicts of assimilation, and, most poignantly, the tangled ties between generations. Here again Lahiri displays her deft touch for the perfect detail -- the fleeting moment, the turn of phrase -- that opens whole worlds of emotion. ", "asin": "0618485228", "rank": "10742", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51Q2RYbNslL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}