{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 337, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "As in the past, Paul Theroux changes the way I look at another area of the world.  The best travel writer, period.  And need I say, no fluff pieces from PT."}, {"review_sentiment": 5.0, "review_text": "I dread the day I run out of new Paul Theroux books to read. Dark Star Safari did not disappoint! His style of writing, which includes the good, the bad and the ugly, makes you feel like you were on the trip with him. His journey across Africa definitely included all three. I enjoyed reading about his conversations with locals which add immensely to the experience. When I heard recently of Nadine Gordimer's death, I knew about her because of Paul's visit with her. His books are always an adventure, and I rate this one among his best."}, {"review_sentiment": 4.0, "review_text": "A thoroughly interesting read highlighting the incompetence/corruption of all who are running the various countries the author traveled through. The people deserve better."}, {"review_sentiment": 2.0, "review_text": "the author is to full of himself"}, {"review_sentiment": 2.0, "review_text": "There is less of a story and more of a travel diary. Found it too difficult to stay engaged."}, {"review_sentiment": 4.0, "review_text": "I admire the author who took this most taxing trip at the age of sixty from Cairo to Cape Town in early 2001Vivid descriptions of places and people I will never experience with controversial and unfortunately repetitive opinions about aid workers and put downs of tourists, probably most of his readersI tend to believe him about aid workers because I've met a few back home living very well and resent him about tourists because I am one, plus he ends his book going on a five trophy safari himself so hypocrisy is not a fault he avoidsHowever accurate his depiction of aid workers in their brand new range rovers is, it is hard to believe they are the cause of African poverty and corruption and he ends with a glowing description of South Africa that would more logically lead you to conclude that blacks are the problem and they should have kept whites in charge"}, {"review_sentiment": 1.0, "review_text": "BOOK WAS RECEIVED --- THANKS!"}, {"review_sentiment": 3.0, "review_text": "Great author--lots of good history, lots of fascinating anecdotes of the challenges of travel...though as other reviewers mentioned, a bit self-absorbed and elitist. Seemed to show a genuine sense of desire to help alleviate poverty--yet how? No easy answers. Just plopping down money is not effective.The irony and hypocrisy: Author talked with young, single, female, Christian missionary on train in Mozambique. Author presented the caricature of ignorant Christian who is not able to answer difficult questions of the Bible. Author used obscure passages in Leviticus to show how ludicrous Bible belief was. Massive misrepresentation of church history, and biblical interpretation. Simplistic reductions and superficial biblical readings. Author stated this missionary “…was determined to bully Africans into abandoning their ancient pantheism…” (p. 433). The hypocrisy was delightful!--After Theroux had berated, cajoled, mocked, and bullied her for seeming hours. (To one of author's \"Bible problems,\" that of the rabbit chewing the cud, if he did even a little of research, would find, like (non-Christian) A.J. Jacobs found...Rabbits and chewing cud (Lev. 11.6). (Skeptics love this). But original: Rabbits re-eats its food. Rabbits excrete pellets and then eats pellets. (Jacobs, The Year of Living Biblically, 59)). Later Theroux called missionary an “easy target” for thieves (after admitting to him that she was robbed). Again, the irony! She was an easy target for such an elitist, Western male with all the answers. Then, Author: because of her stubbornness, there was “no light that I could shed” (p. 431)—oh the omniscient American author with all the answers! Who must impatiently deal with all the ignorant masses—if only they could arrive at the \"truth\" as he! Susanna… “who believed herself to be in sole possession of the truth…” p. 435. The irony and hypocrisy never stops! In one sense simply delightful. In another sense, off-the-charts ridiculous. Other than all that—great book! Great author."}, {"review_sentiment": 5.0, "review_text": "Love Africa. love Theroux. Interesting perspective on aid programs. Fascinating descriptions on the contrast of urban vs Bush experiences. Great"}, {"review_sentiment": 5.0, "review_text": "I started reading this book while on Safari in Kenya and not the upscale type of Safari the author chastises the reader about. His description and encyclopedic knowledge of the history and background of the places he visits and moves through gave me a much broader understanding of the continent and struggles of the indigenous people. And yet you feel as though the author is just scratching the surface which makes you want to know more.I enjoy travelogues and I look forward to reading more Paul Theroux."}]}, "authors": ["Paul Theroux"], "isbn": "0618446877", "longitude": 31.243666, "periods": ["2000s"], "title": "Dark Star Safari: Overland from Cairo to Capetown", "word_cloud": "past change way look area world best travel writer period need say fluff piece dread day run new style write include good bad ugly make feel trip journey definitely include enjoy read conversation local add immensely experience hear recently death know visit always adventure rate best thoroughly interesting highlight run various country author travel people deserve better author full le story travel diary difficult stay engage admire author take tax trip age sixty early description place people never experience controversial unfortunately repetitive opinion aid worker put tourist probably readers i believe aid worker meet back home living well resent tourist end go trophy safari hypocrisy fault avoids however accurate depiction aid worker brand new range rover hard believe cause poverty corruption end glow description logically conclude black problem keep white charge author lot good history lot fascinate anecdote challenge travel reviewer mention bit elitist show genuine sense desire help poverty yet easy answer just plop money irony hypocrisy talk young single female missionary train present caricature ignorant able answer difficult question bible use obscure passage show ludicrous bible belief misrepresentation church history biblical interpretation reduction superficial biblical reading state missionary determine bully abandon ancient hypocrisy delightful berate cajole mocked bully seem hour author problem rabbit chew cud even little research find chew cud love original food pellet eat pellet call missionary easy target thief admit robbed irony easy target elitist western male answer then stubbornness light omniscient american author answer impatiently ignorant truth believe sole possession irony hypocrisy never stop sense simply delightful sense ridiculous other author love perspective aid program fascinate description contrast urban experience start read upscale type author chastise description encyclopedic knowledge history background place visit move give much broader understanding continent struggle indigenous people yet author scratch surface make want know enjoy travelogue look forward read", "genres": ["Travel Writing"], "summary": "In Dark Star Safari the wittily observant and endearingly irascible Paul Theroux takes readers the length of Africa by rattletrap bus, dugout canoe, cattle truck, armed convoy, ferry, and train. In the course of his epic and enlightening journey, he endures danger, delay, and dismaying circumstances.\r\n\r\nGauging the state of affairs, he talks to Africans, aid workers, missionaries, and tourists. What results is an insightful meditation on the history, politics, and beauty of Africa and its people, and \"a vivid portrayal of the secret sweetness, the hidden vitality, and the long-patient hope that lies just beneath the surface\" (Rocky Mountain News). In a new postscript, Theroux recounts the dramatic events of a return to Africa to visit Zimbabwe.\r\n\r\n\"Few recent books provide such a litany of Africa's ills, even as they make one fall in love with the continent.\" The Washington Post", "asin": "0618446877", "rank": "107579", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51wqKje-SrL.jpg", "country": "Egypt", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}