{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 55.7507178, "ratings": {"num_ratings": 6470, "rating": 4.7, "reviews": [{"review_sentiment": 3.0, "review_text": "I found the book a slow starter. With the introduction of the young girl in the story the character development seemed to blossom."}, {"review_sentiment": 5.0, "review_text": "Wow. This book is impossible to put down, from its treatment of Russian history and culture vis à vis the world, to Russian literature, with a novel plot overlaid on it, tying it altogether. Turn of the 20th Century to the 1950’s. It will keep you up past midnight... Or savor it. Both work well.My 90 year old mother recommended it to me!"}, {"review_sentiment": 5.0, "review_text": "A stroll thru the most unexpected of lives. Like all of ours, with its share of surprises and disappointments. But here accepted and handled with such grace.And there is such grace in the words of this story and the craft of its author. I am sad to leave it"}, {"review_sentiment": 5.0, "review_text": "One of the most interesting books I've read in a long time! Very long, but I didn't want it to end! Fascinating characters take us on a up close and personal journey through early twentieth century Russia (USSR) all within the confines of an elegant Moscow hotel. Highly recommended!"}, {"review_sentiment": 2.0, "review_text": "Give me more plot! I made it through 300+ pages, but felt like I wasted my week at the beach trying to like it."}, {"review_sentiment": 5.0, "review_text": "One of the better books I have read in a long time... I did not want the book to end. and I started reading it again finding many new valuable \"nuggets\"  which I had missed the first time.  I often find myself saying.....  \"what would the Count do in this situation?.\""}, {"review_sentiment": 5.0, "review_text": "What a pleasure to slowly delight in excellent writing!"}, {"review_sentiment": 5.0, "review_text": "After a long period of not finding a book worth reading I was thrilled to finally find one that I hated to put down and could barely wait to return to. The characters were so well described as to make you want them in your life, the story was enthralling and the writing was gorgeous. This is not some low class book for the masses but a book for the connoisseur of fine writing. Any educated person could enjoy it but the more you are familiar with literature the more you will enjoy it and all of its many nuances. I highly recommend it."}, {"review_sentiment": 5.0, "review_text": "A lyrical story. Characters stay with you long after you finish the book.I recommend it to anyone who loves Russian literature."}, {"review_sentiment": 5.0, "review_text": "This novel is historical, political, humorous, mysterious, and downright entertaining. What a wonderful character study of a person's life during confinement, and how their circumstances affect others in the world."}]}, "authors": ["Amor Towles"], "isbn": "0670026190", "longitude": 37.6176606, "periods": ["1900s", "Recent Releases"], "title": "A Gentleman in Moscow", "word_cloud": "find slow starter introduction young girl story character development seem blossom impossible put treatment russian history culture world russian literature plot tie altogether keep past midnight savor work year old mother recommend stroll thru unexpected life share surprise disappointment accept handled grace word story craft author sad leave interesting long time long want end fascinate character take close personal journey early twentieth century confines elegant hotel recommend plot make page felt waste week beach try better long time want end start read find many new valuable nugget miss first time often find say situation pleasure slowly delight excellent writing long period find worth reading thrill finally hat put barely character well described make want life story enthral write gorgeous low class mass connoisseur fine write educate person familiar literature enjoy many nuance highly recommend lyrical story character stay long finish recommend anyone love russian literature historical political humorous mysterious downright entertain wonderful character study person life confinement circumstance affect others world", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "A New York Times bestseller\r\n\r\nHe can’t leave his hotel. You won’t want to.\r\n \r\nFrom the New York Times bestselling author of Rules of Civility—a transporting novel about a man who is ordered to spend the rest of his life inside a luxury hotel \r\n\r\nIn 1922, Count Alexander Rostov is deemed an unrepentant aristocrat by a Bolshevik tribunal, and is sentenced to house arrest in the Metropol, a grand hotel across the street from the Kremlin. Rostov, an indomitable man of erudition and wit, has never worked a day in his life, and must now live in an attic room while some of the most tumultuous decades in Russian history are unfolding outside the hotel’s doors. Unexpectedly, his reduced circumstances provide him entry into a much larger world of emotional discovery.\r\n\r\nBrimming with humor, a glittering cast of characters, and one beautifully rendered scene after another, this singular novel casts a spell as it relates the count’s endeavor to gain a deeper understanding of what it means to be a man of purpose.\r\n\r\n“And the intrigue! … [A Gentleman in Moscow] is laced with sparkling threads (they will tie up) and tokens (they will matter): special keys, secret compartments, gold coins, vials of coveted liquid, old-fashioned pistols, duels and scars, hidden assignations (discreet and smoky), stolen passports, a ruby necklace, mysterious letters on elegant hotel stationery… a luscious stage set, backdrop for a downright Casablanca-like drama.” The San Francisco Chronicle", "asin": "0670026190", "rank": "185", "city": "Moscow", "image": "https://images-na.ssl-images-amazon.com/images/I/51YCzUi5OJL.jpg", "country": "Russia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}