{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 11, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "The Secretary of State of the United States under Grover Cleveland described the forcible takeover of Hawaii by American sugar merchants as \"a selfish and dishonorable scheme of a lot of adventurers...taking these islands by force and fraud.\" I had read James Michener's \"Hawaii\" - the best of his monumental dynastic fictions -  which quotes these words, and  I thought I understood the impact.  But Michener, despite his plain reporting of the takeover, could not hide his underlying belief that the end had justified the means, and that Hawaii benefited from the takeover, despite its ignoble motives and methods.In \"The Floating City: A Novel of 19th Century Hawaii\", Pamela Ball delivers in full what Michener only gave lip service to, writing about the destruction of the Hawaiian monarchy from the point of view of an inhabitant of Honolulu during the crucial period. Ms. Ball begins with a corpse floating down a river into Honolulu Harbor, and then widens her view to show a city full of fear and rumor. The police are under control of  the American usurpers, who  wield rifles while pillaging and vandalizing the royal palace.  Royalists try vainly to rally with only machetes to oppose the rifles. The deposed Queen Liliuokalani, vilified in the American-controlled press,  fights  to preserve her dignity while stripped of all privilege, possessions, and outside contact.  In the midst of the uncertainty the invisible underclass of fortune-tellers, card sharps, and opium peddlers jockeys for self-preservation and opportunities to profit.  The narrative is told from the point of view of one of these, a Norwegian woman with a shady past, only recently immigrated to Hawaii.Through the narrative,  short vignettes of Hawaiian legend, tradition, and history  highlight the centuries-long traditions of the monarchy in contrast to the self-righteousness and greed of the interlopers.  As a novel, this book is a gem, beautifully written, and revelatory of the way a community in upheaval vibrates between the struggles to live and the threat of breakdown,.  It is an intensely personal examination of one of the least admirable episodes in American history, and at the same time it is a universal picture of greed and power in action, illuminating today's headlines with equal clarity."}, {"review_sentiment": 3.0, "review_text": "But it ends abruptly and you're left hanging wondering what happened to all the characters. Guess she needs to write a sequel. Didn't realize it was the Americans who were the villans in Hawaii's story."}, {"review_sentiment": 5.0, "review_text": "The Floating City is one of the few books that the six original members of my book group all loved.  We have mentioned it to new members as one of our all time favorites and have recommended that they read it.  Some books we have read over the last nine years don't stick with me at all, but this I remember.  While I cannot recall the actual plot, I do remember some of the imagery and I know I loved reading the book.  This and Cutting for Stone, A Single Pebble, and Moth Smoke (all different) are books that have stayed with us all."}, {"review_sentiment": 5.0, "review_text": "Pamela Ball's tale of intrigue and exploitation is especially relevant as our country enters a new phase of imperialism. We should be reminded of the cost that others have had to pay for our own arrogance. But The Floating City is more than a tale of one country dominating another. It is a beautifully written love story as well. Ball's writing is among the best you'll read anywhere. This is a great book."}, {"review_sentiment": 4.0, "review_text": "Pamela Ball is a new writer to me; I picked up her \"Floating City\" in anticipation of my upcoming first trip to Hawaii.  The novel is set in Honolulu at the time of the U.S.'s forcible takeover of the islands and of Queen Liliuokalani's imprisonment.  It follows a mysterious Norwegian woman who calls herself Eva Hansen (although we know she has stolen this name from someone), a woman who makes her living as a fortune-teller, a haole living among native Hawaiians.  Hansen discovers the body of a murdered native man washed up on shore, and thus becomes entangled in an intrigue involving the takeover of Hawaiian politics and land by wealthy and corrupt Americans.Ball does a superb job conveying 19th-century Honolulu, a strange mix of cultures, missionaries, opium, violence, Hawaaian culture in the throes of radical change, taboos, disease.....all in all it has a kind of gritty lurking-evil Wild-West feel, rather like an episode of \"Deadwood.\"  The intrigue is secondary to the atmosphere she creates; the result is very stylish and literary rather than genre-driven.  There is an overall theme of identity and confusion: how do we know who we really are?  Eva Hansen isn't really named Eva; the dead man isn't who he seems; Hawaii herself is deeper and more complex than the first glance suggests.I like discovering writers previously unfamiliar to me, and expect that I will pick up more books by Ball even when my Hawaii trip is long past. PS - Hollywood, this would make a great movie....lots of exotic atmosphere and an interesting plot.  Put in Cate Blanchett as Eva and you've got a winner."}, {"review_sentiment": 3.0, "review_text": "The Floating City does a wonderful job of bringing Hawaii in the 1890s to life. Ball's descriptions are so wonderful you can almost smell them. Her writing is lovely and carries the reader along not wanting to stop. But what the books fails at is completing the story. There are far too many unanswered questions - not the least of which is how a woman from Norway (and not a very well schooled one at that) is managing to communicate with the Hawaiians and haoles. There's no explanation for why our heroine, Eva, suddenly decides to play detective despite everything telling her to run. Many of the books I read often leave me feeling that a good editor should have trimmed some of the story, this is the first in which I wish more had been added."}, {"review_sentiment": 4.0, "review_text": "Interspersed between the chapters of Floating City, are short historical vignettes, documenting the events that destroyed Hawaiian society in its original tribal innocence and system of government.. Near the end of the novel, the historical events merge into actual time with the story line. Ultimately, Hawaii's self-governance is destroyed by the consummate greed of her conquerors, a fertile territory to poach and plunder, until Hawaii is finally attached to the U.S. as a state.As the main characters are introduced, they are defined by the perceptions of Eva Hanson, a haole, native for caucasian, with reputed psychic abilities. However, Eva's unusual talents exist in the form of psychic intuitions, often experienced as a hyper-awareness of imminent personal danger. Because of her race, Eva's attempts to remain in the background of events are virtually impossible, and she remains disconcertingly visible to government officials. Nothing, and no one, is what it seems, and Eva is constantly reminded of the delicacy of her position. This heightened awareness of the unexpected persists, coloring all the events with a certain air of unreality.1890's Hawaii is a country caught in the accelerating turmoil of political upheaval, the characters churning through this historical evolution that will determine the future of their culture, from innocence to corruption, greed and decay. With haunting familiarity, an ancestral way of life is cannibalized by an amoral society whose value system is defined by acquisition of much for the few, particularly the rapacious European/American investors. History continually repeats itself; today the locusts have moved on to the next part of the world with natural resources vulnerable to exploitation, leaving the residue for the survivors to reconstruct."}, {"review_sentiment": 4.0, "review_text": "It's 1895 and Royalist rebellion threatens in Hawaii. When a well-dressed Hawaiian man washes up dead on the beach at Honolulu, disrupting the women's morning fishing, Eva Hanson - the only white woman - is drafted to report the news to the police. Eva, on her own and far from her native Norway, living as a fortuneteller under the stolen name of a dead woman, agrees reluctantly and only because her roommate, Lehua, saw her slip a jade necklace off the dead man and into her pocket.But the body is missing when Eva returns with the police and her worst fears are realized when the police - accompanied by a white political type - come knocking the next day, asking about her connection to the dead man. Upstairs a Royalist rebel hides, given shelter by Lehua. Though frightened and angry, Eva resists the police questions, shelters the fugitive. She is being drawn in despite herself.Though her hard life has made her cynical, Hawaii seemed to offer a new start. \"There was an orphanage for Hawaiian girls across the street, and old whalers next door with a pet rooster. There was the Widow, locally famous for outliving all her husbands and winning the orchid show every year for the last twenty-two years, and a shamisen player who made enough racket to drive away the living as well as the dead. There was Lehua, who was half our of her mind with grief and opium, and for the first time in her life, Eva fit right in.\"But it is two years since the white mans' overthrowing of the monarchy and the country is in turmoil. \"Everyone points to someone else as the cause of the country's woes. Sailors blame the missionaries, the missionaries blame the opium dealers, sugar cane planters blame the rulings of the legislature, and the legislators blame the end of the American Civil War; which poured Southern sugar back into the market. The prostitutes blame the foreigners for bringing the kiss of death, and everyone else blames the Chinese.\"Outside the palace of the deposed queen (Eva is hoping the queen will hire her palm reading services and make her reputation) Eva is caught up in a rally turned riot and rescued by a Scot - McClelland, a man of talents and secrets. \"A man that quiet was someone to be wary of.\" And \"A man as smooth with a lie as she was. It was disconcerting to recognize your traits in someone else.\" But Eva is not wary and love sweeps her up, though its path is rocky. And the authorities seem inexplicably determined to pin the still-missing dead man on her.Ball, (\"Lava\") who was born and raised on Oahu, immerses her characters in the atmosphere of Hawaii, capturing the tropical lushness and poverty, the devastation of foreign diseases, the anger of the dispossessed and disenfranchised Hawaiians, the greed of Western sugar barons and the cold rigidity of the missionaries. Her characters are damaged, but ardent, full of hope in the midst of hopelessness. A fine novel from an award winning writer."}, {"review_sentiment": 5.0, "review_text": "What a wonderful read this sweet book is.  At only 262 pages, it flies by quickly.  Short chapters tell the story efficiently.  I love books that transport me to a different time with different challenges.  It appears that Ball has done a good deal of research on the cultural and political history of Hawaii in the late 1800s.  The book is punctuated with a page at the end of each chapter that reads almost like a short history lesson on what was happening to the Queen as the story progresses.The tale of Liv Norseng is one that also deals with the historical status of women as well as of the native Hawaiians.  We learn how she flees Norway, travels around the world by boat, and assumes the identity of Eva Hanson.  She certainly seems to have the sense of independence of the modern woman.  The events seem reasonable for this period of time.  Relating the fate of lepers in the islands, opium, the status of the Chinese, art and the political intrigue makes this a replete story that stays with you.  The love interest with McClelland spices up the tale appropriately.This is a many-sided story.  The characters are well drawn and realistically portrayed.  Pamela Ball tells the tale with a straightforward yet picturesque literary style.  One can appreciate this book as a romance, a history, a political intrigue or a cultural snapshot.  It captured my imagination!  Enjoy!"}, {"review_sentiment": 5.0, "review_text": "Hawaii in 1895 has been recently taken over by whites with the help of a U.S. gunship and a contingent of marines. Eve Hanson, a recent immigrant from Norway, is caught up in the accompanying rebellion of the native Hawaiians against their oppressors, chiefly as the result of her discovering the body of a murdered man.  The story, itself, is less important than the graphically described Honolulu of that turbulent period--the prostitutes, the drunken sailors, the leper catchers, the opium dens, the tambourine shaking evangelicals and the arrogant Americans who stole Hawaii from its inhabitants."}]}, "authors": ["Pamela Ball"], "isbn": "0670894729", "longitude": -157.8556764, "periods": ["1900s"], "title": "The Floating City", "word_cloud": "describe forcible takeover sugar merchant selfish dishonorable scheme lot adventurer take island force fraud best monumental dynastic fiction quote word think understood impact plain reporting takeover underlie belief end justify mean benefit takeover ignoble motif deliver full give lip service write destruction hawaiian monarchy point view inhabitant crucial period begin river widen view show full fear rumor police control american usurper wield rifle pillage vandalize royal palace royalist try vainly rally machetes oppose rifle deposed vilify press fight preserve dignity strip privilege possession contact midst uncertainty invisible underclass card sharp opium peddler jockey opportunity profit narrative tell point view norwegian woman shady past recently immigrate narrative short vignette hawaiian legend tradition history highlight tradition contrast greed interloper gem beautifully write regulatory way community upheaval vibrates struggle live threat intensely personal examination least admirable episode american history time universal picture greed power action illuminate today headline equal clarity end abruptly leave hang wondering happen character need write sequel villein story original member group love mention new member time favorites recommend last year stick remember recall actual plot remember imagery know love read different stay tale intrigue exploitation especially relevant country enter new phase imperialism remind cost others pay arrogance tale country dominate beautifully write love story well write best anywhere great new writer pick anticipation upcoming first trip set time forcible takeover island imprisonment follow mysterious norwegian woman call steal name someone woman make live hale living native discovers body murder native man wash shore thus become entangled intrigue involve takeover hawaiian politics land wealthy corrupt superb job convey strange mix culture missionary opium violence hawaiian culture throe radical change taboo disease kind gritty feel rather episode intrigue secondary atmosphere create result stylish literary rather overall theme identity confusion know really really name dead man seem deeper complex first glance discover writer previously expect pick even trip long past great movie exotic atmosphere interest plot get winner wonderful job bring life description wonderful almost smell writing lovely carry want stop fail complete story far many unanswered question least woman well school manage communicate hale explanation heroine suddenly decide detective everything tell run many often leave feel good editor trim story first wish add intersperse chapter short historical vignette document event destroyed hawaiian society original tribal innocence system end historical event actual time story line ultimately destroy consummate greed conqueror fertile territory poach plunder finally attach main character introduce defined perception hale native caucasian repute psychic ability however unusual talent exist form psychic intuition often experience imminent personal danger race attempt remain background event virtually impossible remains disconcertingly visible government official nothing seem constantly remind delicacy position heighten awareness unexpected persists color event certain air country catch accelerate turmoil political upheaval character churn historical evolution determine future culture innocence corruption greed decay haunt familiarity ancestral way life cannibalize amoral society value system define acquisition much particularly rapacious investor continually repeat today locusts move next part world natural resource vulnerable exploitation leave residue survivor reconstruct rebellion threatens hawaiian man wash dead beach disrupt woman morning fishing white woman draft report news police far native live fortuneteller steal name dead woman agree reluctantly roommate saw slip jade necklace dead man body miss return police worst fear realize police accompany white political type come knock next day ask connection dead man rebel hide give shelter frighten angry resists police question shelter fugitive draw hard life make cynical seem offer new start orphanage hawaiian girl street old whaler door pet rooster locally famous outlive husband win orchid show year last year shamisen player make enough racket drive away live well dead half mind grief opium first time life fit right year white man overthrow monarchy country turmoil point someone else cause country woes sailor blame missionary missionary blame opium dealer sugar cane planter blame ruling legislature legislator blame end pour sugar back market prostitute blame foreigner bring kiss death everyone else blame chinese palace depose queen hop queen hire palm reading service make reputation catch rally turn riot rescue man talent secrets man quiet someone wary man smooth lie disconcert trait someone else wary love sweep path rocky authority seem inexplicably determine pin dead man bear raise immerse character atmosphere capture tropical lushness poverty devastation foreign disease anger dispossess disenfranchised greed western sugar baron cold rigidity missionary character damage ardent full hope midst hopelessness fine award win writer wonderful sweet page fly quickly chapter tell story efficiently love transport different time different challenge appear do good deal research cultural political history late punctuated page end chapter read almost short history lesson happen story tale one also deal historical status woman well native learn flees travel world boat assume identity certainly seem sense independence modern woman event seem reasonable period time relate fate leper islands opium status chinese art political intrigue make replete story stay love interest spice tale story character well draw realistically portray tell tale straightforward yet picturesque literary style appreciate romance history political intrigue cultural snapshot capture imagination enjoy recently take white help contingent marine recent immigrant catch accompany rebellion native oppressor chiefly result discover body murder man story le important graphically describe turbulent period prostitute drunken sailor catcher opium den tambourine shake evangelicals arrogant stole inhabitant", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "On a sultry Honolulu morning, a body washes up on a beach. For Eva Hanson, the only haole (Caucasian) among the group of women fishing who discover it, this becomes her kuleana, her obligation to report it to the police. But this body, not meant to be found, is missing when the police arrive. With no family and few friends, Eva, a European living under a stolen name on the fringes of society, becomes an easy target. Now a suspect in the missing man's death, Eva meets McClelland, a Scotsman with a past as mysterious as hers. Against her own instincts, she begins to fall in love. But McClelland has troubles of his own. And Eva cannot escape the growing maelstrom of political and social upheaval as conflicting cultures vie for control of the island: Royalists still loyal to the overthrown queen; politicians in favor of annexation to the United States; missionaries looking to spread Christianity; and Hawaiians hoping to salvage what they can of their homeland, once a paradise, now ravaged by riots and disease. \r\n\r\nWith stunning prose that is both lush and sensual, Pamela Ball wondrously re-creates this unique period of time. The Floating City is a gorgeously written, evocative tale of an outsider thrust into intrigue-and the treacherous search for truth amid corruption and chaos.", "asin": "0670894729", "rank": "3640766", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51KXD55ZZ1L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}