{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 271, "rating": 3.6, "reviews": [{"review_sentiment": 2.0, "review_text": "Guess it's me on this one. I never got past the first chapter."}, {"review_sentiment": 2.0, "review_text": "Not my taste in reading."}, {"review_sentiment": 3.0, "review_text": "didnt hold my attention so have not finished reading"}, {"review_sentiment": 4.0, "review_text": "This book is a good book for older people living stressful lives to help them realize love and happiness can come at any time!"}, {"review_sentiment": 5.0, "review_text": "Even though I have the movie, the book is so much better.  I loved it."}, {"review_sentiment": 4.0, "review_text": "How Stella Got Her Groove Back3.5What I thought I was going to be reading:I have never read anything by the author, despite having this book as well as “Waiting to Exhale” on my to-read list for a while now. I am a fan of African-American literature, but tend to read more historical fiction than contemporary. I have also never seen the movie adaptation, so I had relatively no expectations coming into reading this.What I actually read:The author’s style of writing takes a few pages to get used to. A sentence goes on, more often than not, for literally an entire page. The stream-of-consciousness style can be annoying, at times, but the rants and tangents die down the further into the plot you read. The novel focuses on a forty-something year old woman experiencing a semi-midlife crisis and enjoying a spur of the moment vacation to Jamaica. After a divorce and contemplation of a job change, the main character enjoys her newfound freedom while on her vacation. Here, she meets a twenty-something year old man who she starts to be attracted to, both physically and emotionally.What to expect:Go into this novel expecting an easy romance read. The plot line and internal character dialogue can get repetitive. (If I had a dollar for every time I read the sentence, “He’s too young for me”…..) The overall story, though, is charming and the characters feel real and developed. At the end of the novel, I was rooting for the main character to find happiness, regardless of whether that was with a man or not. Go into the novel with an open mind to the writing style, too; you will get used to it and it may even grow on you."}, {"review_sentiment": 1.0, "review_text": "This was just painful to get through. Perhaps I disliked this book because it was written in the 90s for people in the 90s. The story (if you can call it that) has no arc. I didn't like the protagonist in this book at all, which made it that much harder to read. To me, most of the book was about Stella freaking out about Winston being 20 years younger than her, and Winston trying to convince Stella that he doesn't care about the age difference; this gets boring very quickly for the reader. There's a lot of poorly written dialogue and unnecessary descriptive details which don't add a whole lot to the story. The sex scenes were disappointing--this is where the author could have used more description (paint the picture girl!). There was no reconciliation at the end about the artist she met at the art gallery, in fact, the whole art gallery exhibition chapter might as well have been cut out from the book because there was no point to it. Very predictable, eye-rolling end.Overall, very disappointing. Can't believe they made a movie out of this (of which the movie was a little better than the book). Spend your money elsewhere."}, {"review_sentiment": 5.0, "review_text": "An Oldie, but A Goodie!"}, {"review_sentiment": 5.0, "review_text": "Loved it..."}, {"review_sentiment": 5.0, "review_text": "My favorite"}]}, "authors": ["Terry McMillan"], "isbn": "0670869902", "longitude": 0.0, "periods": ["1900s"], "title": "How Stella Got Her Groove Back", "word_cloud": "never past first chapter not taste reading dint attention finish reading good older people live stressful life help happiness come time even movie much better love think go read never anything author well wait list fan literature tend historical fiction contemporary also never see movie adaptation relatively expectation come reading actually author style write take page get use sentence go often literally entire page style annoy time rant tangent die focus year old woman experience crisis enjoy spur moment vacation divorce contemplation job change main character enjoy newfound freedom vacation here meet year old man start attract physically expect expect easy romance plot line internal character dialogue get repetitive dollar time sentence young overall story charm character feel real develop end root main character find happiness regardless man open mind write style get use even painful get perhaps dislike write people story call arc protagonist make much harder freak year younger try convince care age difference get boring quickly lot poorly write dialogue unnecessary descriptive detail add whole lot story sex scene disappoint author use description paint picture girl reconciliation end artist meet art gallery fact whole art gallery exhibition chapter well point predictable disappointing believe make movie movie little better money elsewhere love favorite", "genres": ["Fiction & Literature", "Romance", "Women's Fiction"], "summary": "Stella Payne is forty-two, divorced, a high-powered investment analyst, mother of eleven-year-old Quincy- and she does it all. In fact, if she doesn't do it, it doesn't get done, from Little League carpool duty to analyzing portfolios to folding the laundry and bringing home the bacon. She does it all well, too, if her chic house, personal trainer, BMW, and her loving son are any indication. So what if there's been no one to share her bed with lately, let alone rock her world? Stella doesn't mind it too much; she probably wouldn't have the energy for love - and all of love's nasty fallout - anyway. \r\n\r\nBut when Stella takes a spur-of-the-moment vacation to Jamaica, her world gets rocked to the core - not just by the relaxing effects of the sun and sea and an island full of attractive men, but by one man in particular. He's tall, lean, soft-spoken, Jamaican, smells of citrus and the ocean - and is half her age. The tropics have cast their spell and Stella soon realizes she has come to a cataclysmic juncture: not only must she confront her hopes and fears about love, she must question all of her expectations, passions, and ideas about life and the way she has lived it. \r\n\r\nTold in Stella's own exuberant, dead-on, dead honest voice, How Stella Got Her Groove Back is full of Terry McMillan's signature humor, heart, and insight. More than a love story, it is ultimately a novel about how a woman saves her own life - and what she must risk to do it.", "asin": "0670869902", "rank": "1572871", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/519RG1ZG1XL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}