{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 50, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "Interesting concept and not easily cracked by this reader. Having five or six POVs is difficult to follow in spite of contrasting voices by characters. In this one every-thing did not fall into place easily. Falls into category of re-reading some time, more carefully at that."}, {"review_sentiment": 3.0, "review_text": "A bit of morbid self reflection but I guess it can be expected from Coetzee. As a South African one can relate to much which possibly keeps it a bit more interesting. Enjoyed it but it did not really go anywhere."}, {"review_sentiment": 4.0, "review_text": "The book is exceptionally well written. So much so that it leaves you with a sense, not of Summertime, but of an eternal autumn..Disturbingly honest, with glimpses of all our lives."}, {"review_sentiment": 5.0, "review_text": "In Summertime, his new novel, J.M. Coetzee has chosen to write about himself as if he's died and a biographer is trying to piece together a vision of the man from fragments.I've only just started reading it, but so far it starts with some excerpts from notebooks he supposedly kept in the early 1970's while living in South Africa. At the end of the notes are other notes in italics beginning with phrases such as \"expand upon this...\". The following chapters are named for people who \"knew\" Coetzee. The first person is asked questions by the biographer about Coetzee, but the person interrupts him to ask about these notebooks. The biographer sent the pages from the notebooks to the person for them to read and comment on. The first woman asks about the italicized notes, wondering who wrote them. The biographer says that Coetzee wrote them in 1999-2000 because he was considering making a book from the notes.Why would anyone write about themselves as if they were dead? It's not an obituary by any means.How odd to write now about yourself by creating notes that you supposedly made in the 1970's and then \"added\" more notes to in 1999, and then to have a biographer attempt to piece it all together.One clue (I think) is in a scene from these notes in which he is describing himself pouring and mixing concrete and thinking about how the concrete slab and bricks he is making will outlast him, how they are a type of immortality, and he wonders if men who work in construction think of having monuments to their own immortality all over town in the form of the buildings they worked to build.Not that Coetzee needs me to decode anything he writes, but perhaps this format of retelling your own life is constructed in such a way as to create some form of immortality for himself. Although of course there is much more going on here than that.  Instead of the quick retelling and summarizing of a life in an obituary, here is this puzzle, skewered through with these fictionalized people's lives like the rotisserie spit through a pig over a fire.I don't how I would retell my own life, fictional or real tidbits, no matter which.This novel is a fiction. Coetzee made all of this up. This is what he's been doing the past few years. While I was reading his other works, trying to figure them out, he was making more enigmas. But I'm happy to live with the unanswered questions. I think he is mountains above all other living writers today. He has more than a mastery of language and form; he has courage."}, {"review_sentiment": 3.0, "review_text": "Under the series title \"Scenes from Provincial Life\", the South African writer J.M. Coetzee had published two volumes of semi-fictionalized memoirs, Boyhood (1997) and Youth (2002) that distilled some of his experiences into a novelistic format written in the third person. SUMMERTIME, first published in 2009, continues this series but makes a major change to the format and the historical basis for these events.Rather than the conventional narration of the earlier books, SUMMERTIME is a collection of interviews held by one Mr. Vincent, who is at work on a biography of the \"deceased writer John Coetzee\". Vincent wants to cover the years 1972-1977 when John Coetzee has come back to South Africa after a spell teaching in an American university, and when his literary career slowly began to take shape. (J.M. Coetzee had in fact been deported from the US for his involvement in a Vietnam War protest, and his first novel, Dusklands, was published soon after his return). Vincent's interlocutors are four women and one man. Julia was a married woman with whom this John Coetzee carried on a brief affair. Margot was his cousin, close to him in childhood and later concerned about his having no wife to look after him. Adriana is a Brazilian refugee, who fled her expat life in Angola for South Africa and then was, to her horror, pursued romantically by John Coetzee. Sophie is a French academic who taught an African literature course with the deceased. Martin was first a rival for an academic post and then a friend. Most of the women note that he was still unmarried in his mid-thirties, and complain of how he was unkempt, either a poor lover or repellant to love, and he cannot even maintain the shabby home he shares with his father.Here is where the disconnect with real-life comes in: Coetzee had in fact married and had two children by this time. Coetzee rarely gives interviews or comments on his personal life, and that has allowed a great mystique to arise around him as an autistic loner, hopeless with women, unable to relate to others emotionally, and never laughing or loosening up. The writer uses this reputation here to achieve a remarkable effect: in talking at length about the supposed subject of Mr. Vincent's project, the people here are in fact revealing more about themselves. Coetzee has subtly turned a memoir on his own life into a detailed fictional work on four different women and how they responded to the pressures in their lives during the time they knew John Coetzee. Below the surface is a subplot on John Coetzee's relationship with his elderly father, and how the writer is torn between his need to be alone for great inspiration and his filial duty to take care of Coetzee Sr. until the end.Coetzee's style is, as usual, highly readable, the prose never too thick to slow one down -- this is the umpteenth book by him that I've read in a single sitting -- but the psychological drama is intense, and Coetzee's descriptions of South Africa really capture the bittersweet magic of that country. If I cannot given this a highly positive rating, it is because I think that the book depends for its effect too much on contemporary gossip about Coetzee, and cannot be expected to have much staying power as people forget the rumour and innuendo."}, {"review_sentiment": 5.0, "review_text": "I have read this book mesmerised by the prose and because of the contents. Coetzee allow us to glimpse some periods of his life though the vision that the author thinks other people had of him,  and you don't really know what's going on: it might be the most truthful bylgraphy or the better orchestrated scam. Whatever, a gift to read."}, {"review_sentiment": 5.0, "review_text": "And it pretty much stayed spot on from there. Like his books which I like, Coetzee is sparse with his prose and sprinkles insight throughout the book. Great..."}, {"review_sentiment": 5.0, "review_text": "Mr. Coetzee's books are always thought provoking and interesting.Summertime is no exception.While not a quick read;this book will make you think about us human beings and our sometimes strange ways."}, {"review_sentiment": 5.0, "review_text": "After BOYHOOD and YOUTH, I expected another searing self-portrait told in calm and beautifully measured third-person.  What I got is autobiography in quite a revolutionary form: the women who knew Coetzee in his early thirties are interviewed about the now-dead author.  Utterly engaging, filled with awkward intimacy and painful slip-ups, SUMMERTIME is the best book in the trilogy.Another interesting aspect of the book:  so many \"greats\" have written their portraits of the artists as young men—Goethe, Flaubert, Joyce, and Coetzee himself spring to mind.  But I've never read a self-examination focusing on this point—beyond youth, \"young-manhood\", I suppose—the trials by fire after self-awareness has cemented and the moral compass has been set, but before artistic recognition occurs."}, {"review_sentiment": 5.0, "review_text": "Reading is possible to grasp the air of f South Africa. A writer that knows how to transmit feelings. The irony of being telling the story from the point of view of being death. I like very much the symbols Coetzee used throughout the writing . This book made me curious to read the previous two books to learn how the story has started."}]}, "authors": ["J. M. Coetzee"], "isbn": "0670021385", "longitude": 18.417396, "periods": ["1900s", "Recent Releases"], "title": "Summertime: Fiction", "word_cloud": "interest concept easily crack difficult follow spite contrasting voice character fall place easily category time carefully bit morbid self reflection guess expect relate much possibly keep bit interesting really anywhere exceptionally well write so much leaf sense eternal honest glimpse life new chosen write die biographer try piece together vision man start read far start excerpt notebook supposedly keep early living end note note italic begin phrase expand following chapter name people know first person ask question biographer person interrupt ask biographer send page notebook person comment first woman ask italicized note wonder write biographer say write consider make anyone dead obituary odd write create note supposedly make added note attempt piece clue think scene note describe pour mix concrete think concrete slab brick make outlast type immortality wonder men work construction think monument immortality town form building work need decode anything write perhaps format retell life construct way create form immortality course much go instead quick retell summarize life obituary puzzle skewer fictionalized people life rotisserie spit pig life fictional real tidbit matter make past year read work try figure make enigma happy live unanswered question think mountain live writer today mastery language form courage series title african writer publish volume memoirs distil experience novelist format write third person first publish continue series make major change format historical basis conventional narration earlier collection interview hold work biography decease writer want cover year come back spell teach university literary career slowly begin take shape fact deport involvement protest first publish soon return interlocutor woman man marry woman carry brief affair cousin close childhood later concerned wife look refugee flee expat life horror pursue romantically academic taught african literature course decease first rival academic post friend woman note still unmarried complain unkempt poor lover repellent even maintain shabby home share disconnect come fact marry child time rarely give interview comment personal life allow great mystique arise around autistic loner hopeless woman unable relate others emotionally never laugh loosen writer use reputation achieve remarkable effect talk length suppose subject project people fact reveal subtly turn memoir life detail fictional work different woman respond pressure live time know surface subplot relationship elderly father writer torn need alone great inspiration filial duty care style usual highly readable prose never thick umpteenth single sit psychological drama intense description really capture bittersweet magic country give highly positive rating think depend effect much contemporary gossip expect much stay power people forget rumor innuendo mesmerize prose content allow glimpse period life vision author think people really know go biography better orchestrate scam gift pretty much stay spot like sparse prose sprinkle insight always think provoke quick make think human being sometimes strange way expect sear tell calm beautifully measure get autobiography quite revolutionary form woman know early thirty interview author utterly engage fill awkward intimacy painful best interest aspect many great write portrait artist young spring mind never focus youth trials fire cement moral compass set artistic recognition occurs read possible grasp air f writer know transmit feeling irony tell story point view death like much symbol use write make curious previous learn story start", "genres": ["Memoir", "Fiction & Literature"], "summary": "Book 3/3 in the Coetzee Autobiographic Series\r\n\r\nNobel Prize-winning author J. M. Coetzee's new book follows a young biographer as he works on a book about the late writer, John Coetzee. The biographer embarks on a series of interviews with people who were important to Coetzee during the period when he was \"finding his feet as a writer\"-in his thirties and sharing a run-down cottage in the suburbs of Cape Town with his widowed father.\r\n\r\nTheir testimonies create an image of an awkward, reserved, and bookish young man who finds it difficult to connect with the people around him. An innovative and inspired work of fiction-incisive, elegant, and often surprisingly funny- Summertime allows one of the most revered writers of our time to imagine his own life with a critical and unsparing eye.\r\n\r\n\"Not since Disgrace, has he written with such urgency and feeling.\" The New Yorker", "asin": "0670021385", "rank": "1863334", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/51SfHAPiUXL.jpg", "country": "RSA", "story_arc": ["Tragedy", "Things only get worse"]}