{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 29, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "A coming of age story, that takes place in the seventies, of a young black college woman, conflicted by various social forces to become accepted and to discover, who she is as a woman, and her purpose for being here. At times I felt like I was right there with her, as she describes her conflicts and struggle. As the book comes to an end, she discovers what really gives her meaning and a true sense of purpose.Mark Susnow, author of The Soul of Uncertainty—A Fable for our Times."}, {"review_sentiment": 4.0, "review_text": "It was required reading in my english class instructor who was also the author.I had no idea Laney had such a history"}, {"review_sentiment": 5.0, "review_text": "Virgin SoulWhat a ride from the inside. Virgin Soul unveils the growth of a revolutionary from the thoughts, behaviors of the naive, ambitious, curious student who wanted to improve her station in life.What I liked most about Virgin Soul was the rare voice of the everyday woman member of the Black Panther Party. Those women who toiled, loved, supported, cooked, marched, raised $$, learned to shoot, wrote the paper, coped- a-case—all for the cause, movement , revolution, party, to support the brothers and the sistahood, some women who even became wife 1, wife 2.Judy Juanita provides an insightful fast moving story that takes the reader throughout the mid to late 1960s Bay Area from Hayward, to Berkeley, to Oakland, to Daly City, Sacramento and of course San Francisco."}, {"review_sentiment": 3.0, "review_text": "I read the preview of Virgin Soul and was immediately drawn into the story line. However, upon reading and completing Virgin Soul, I was very disappointed. The initial chapters started out strong. However as I continued through the novel, I discovered there were no stand out characters. A college student fighting for the cause while in college is very believable, but no characters had any traits that made me either love or hate them."}, {"review_sentiment": 5.0, "review_text": "As a young wannabe radical in the late 1960s, I hitchhiked across country in a Yale/Black Panther Solidarity jacket. But the Oakland Panthers didn't want a crazy, idealistic white woman like me working for their Ministry of Culture.  This fascinating book by Judy Juanita about a young woman coming of age in the Bay Area and exploring her \"black-ness\" made me feel like I had made friends with Geniece Hightower, the protagonist, and gotten to relive the 1960s from her own, vital perspective.  I couldn't put it down!  Highly recommended."}, {"review_sentiment": 4.0, "review_text": "I was able to relate to the period of time in my life when I had just graduated from Wilberforce University (the first HBCU) trying to find my way in the 'struggle'. Well done. Wonder whAt became of Genice?"}, {"review_sentiment": 5.0, "review_text": "Good historical (a nove) view of Oakland in the time of the Black Panthers and the beginning of the Black Power movement."}, {"review_sentiment": 4.0, "review_text": "Thank you Judy Juanita, for this GREAT story; I'm looking forward to reading more of your works. It reminded me of my younger years in Brooklyn, NY."}, {"review_sentiment": 5.0, "review_text": "Virgin Soul is an accurate novel that allowed me to revisit my time living this same life in Watts Calif working with the Black Panther Party.  So many years have past and this novel brought it all back and the importance of our work."}, {"review_sentiment": 5.0, "review_text": "Judy Juanita effectively dispels any myths of homogeneity of black opinion about society, about race and racism and about the Black Panthers as, with gut-wrenching honesty, she explores black thought and identity in a time of change. In some of the best scenes (especially the food – oh my goodness, the food!), her protagonist’s family members expose a range of views, and the members of the Black Panthers aren’t always on the same page, either.  Remarkable in its candor and immediacy, this book provides, in vivid scenes, an emotional truth about a movement both glorified and vilified that will change the way you think about social change."}]}, "authors": ["Judy Juanita"], "isbn": "0670026581", "longitude": -122.4192363, "periods": ["2000s", "Recent Releases"], "title": "Virgin Soul: A Novel", "word_cloud": "coming age story take place seventy young black college woman conflict various social force become accepted discover woman purpose time felt right describes conflict struggle come end discovers really give mean true sense author time require read english class instructor also idea history inside unveil growth revolutionary thought behavior naive ambitious curious student want improve station like rare voice everyday woman member woman toil loved support cooked marched raise learned shoot write paper cause movement revolution party support brother sisterhood woman even become wife wife provide insightful fast move story take mid late course preview immediately draw story line however read complete disappoint initial chapter start strong however continue discover stand character college student fight cause college believable character trait make hate young wannabe radical late hitchhike country jacket want crazy idealistic white woman work fascinating young woman come age explore make feel make friend protagonist gotten relive vital perspective recommend able relate period time life graduate first try way do become good historical move view time begin movement story look forward read work remind younger year accurate allow revisit time live life work many year brought back importance work effectively dispel myth homogeneity black opinion society race racism honesty explore black thought identity time change best scene especially food oh goodness food protagonist family member expose range view member always page remarkable candor immediacy provide vivid scene emotional truth movement glorify vilified change way think social change", "genres": ["Fiction & Literature", "Historical Fiction", "Women's Fiction"], "summary": "At first glance, Geniece's story sounds like that of a typical young woman: she goes to college, has romantic entanglements, builds meaningful friendships, and juggles her schedule with a part-time job. However, she does all of these things in 1960's San Francisco, while becoming a militant member of the Black Panther movement. When Huey Newton is jailed in October 1967 and the Panthers explode nationwide, Geniece enters the organization's dark and dangerous world of guns, FBI agents, freewheeling sex, police repression, and fatal shoot-outs - all while balancing her other life as a college student.\r\n\r\nA moving tale of one young woman's life spinning out of the typical and into the extraordinary, during one of the most politically and racially charged eras in America. Virgin Soul will resonate with readers of Monica Ali and Ntozake Shange.\r\n\r\n\"Witty and deeply engaging . . . about ideas and the passions generated by revolution and romantic love.\"\r\nLos Angeles Times", "asin": "0670026581", "rank": "1493232", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51%2B1YPVvU2L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}