{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 27.708796, "ratings": {"num_ratings": 19, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "I liked the Magic Bus because I lived in that era and experienced some of the life that the people on the Hippie Trail experienced.  I thought the author had an interesting blend of current time, Hippie Times, and ancient historical times, but the book is slow paced and people not drawn to the kind of experiences detailed in the book probably won't be absorbed in the subject matter."}, {"review_sentiment": 5.0, "review_text": "MacLean went in the 21st century, many of us went in the 20th century, but his story and recollections ring very true. If you were on the Hippie trail, you'll love this book."}, {"review_sentiment": 4.0, "review_text": "A good story, we'll written but brought back memories both good and bad that left me somewhat sad. My trip across the route was a highlight of my life but not without adversity. I did like it even though uncomfortable."}, {"review_sentiment": 3.0, "review_text": "The writer retraces the path that 1960's hippies followed. Begins in Turkey and then on to Iran. Mentions people he meets along the way, provides some history and background. some B/W photos at the end as well as suggested reading."}, {"review_sentiment": 5.0, "review_text": "Great history....as well as a 'catch up'!"}, {"review_sentiment": 2.0, "review_text": "This books rambles. Perhaps he was trying to capture the rambling, lost spirt of the 60s in his prose?  The overall impression after reading this, is that you are traveling through some unique and far off places, but seeing it from a tour bus window. I don't mean from a clapped out, smoking, over crowded bus in India, where the kid next to you has head lice.  This is a trip on a giant air conditioned American coach. This author seems to travel through these lands with unbounded amounts of energy and money. He never mentions any difficulty finding a place to sleep, or lacking funds for a sufficient meal.As a matter of fact, his superficial journey, where he travels through the land, but make no mention of enduring any hardship, is the first clue that this book is a glossy overview of the trail.  He goes into vague descriptions often, not detailing what the scene actually looks like. He encounters a fair amount of locals, who are at times brutally honest about their opinions of the intrusion of the west. However, he runs into enough of the old hippies to invalidate his authenticity.  Is the Maharishi's place really abandoned?  There's no metaphor for that happening, just a cheesy insert of another Beatles quote.On it goes, the whole book is like this. You almost want to slap him \"Do you FEEL anything?\". The only time he has any travel trouble is when they can't land the plane in Afghanistan.  Not one vehicle breaks down, he doesn't get sick once off the food, not one instance of lost luggage or pilfering. It's too hard to believe as he goes through the difficulties the hippies faced, yet his journey is so easy. Like I said, he is seeing the trail pass by at the level of a comfortable bus.Another irritation in the book is how often he uses words or phrases that are peculiar to the country he is in. There is no map, no glossary, no appendix. There is nothing to help us on the journey. It is a magic bus, it's a bus ride through brutal and esoteric terrain, without touching the ground. Maybe he really was on the drugs of the sixties...Nahhh his trip was way too good for that."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this book, and benefited from it.First, I found it coherently and accessibly written, with a fluent prose that varied between romantic and whimsical. Second, it contained a substantial, firsthand account of Asian travel, providing real experiences and information rather than secondhand hearsay. After finishing 'Magic Bus,' I felt a bit more educated, as to gain a little more insight into that region of our vast planet.Thanks to the author, the subjects, and the publisher."}, {"review_sentiment": 5.0, "review_text": "good reading through cultures and his experiences with humor and good writing, I learned also a lot of the east in a very pleasant trip on the magic bus. Recommended !"}, {"review_sentiment": 5.0, "review_text": "Wow - what a historical, enjoyable, and fascinating book to read.  I have always been fascinated by anything related to the Silk Road and its impact on cultures, religions and geography.  This is a book I will re-read without a second thought."}, {"review_sentiment": 3.0, "review_text": "Big regret of my life was that I was too young to be a real hippie. At least that is what I've always thought.But the more books I read about hippies, the less interesting they are. Turns out, it seems, most people who went off to become hippies either (1) quickly realized the search was futile or (2) are still out there somewhere, probably sitting in the park in San Francisco waiting for their next high.Maclean follows the road the hippies traveled to see what is there now and what hippies are still left out there doing their hippie things. He finds a few hippies, notably Penny, who struck me as a sad figure. (It could have just been me, but Penny still felt very lost.)And what's there now? Tourists, tourists, tourists. Doesn't look like I'll ever hit the hippie trail. Not terribly sure I am really a hippie kind of person, anyway."}]}, "authors": ["Rory MacLean"], "isbn": "0670914843", "longitude": 85.320244, "periods": ["1900s"], "title": "Magic Bus: On the Hippie Trail from Istanbul to India", "word_cloud": "like live era experienced life people experience think author interesting current time ancient historical time slow pace people draw kind experience detail probably subject matter mac lean go century many go century story recollection ring true love good story write bring memory good bad leave somewhat sad trip route highlight life adversity like even uncomfortable writer retrace path hippy follow people meet along way provide history background photo end well suggest reading history well ramble perhaps try capture ramble lose spurt prose overall impression read travel unique far place see tour bus window mean clap smoke crowd bus next head louse trip giant air condition american coach author seem travel land unbounded amount energy money never mention difficulty find place sleep lack fund sufficient matter fact superficial journey travel land mention endure hardship first clue glossy overview go vague description often detail scene actually look encounter fair amount local time brutally honest opinion intrusion west however run enough old hippy invalidate authenticity place really abandon metaphor happen cheesy insert go whole almost want slap do anything time travel trouble plane not vehicle break get sick food instance lose luggage pilfer hard believe go difficulty hippy face yet journey say see pas level comfortable irritation often use word phrase peculiar country map glossary appendix nothing help journey bus bus ride brutal esoteric terrain touch ground maybe really drug sixty trip way good enjoy benefit find coherently accessibly write fluent prose varied romantic whimsical contain substantial firsthand account travel provide real experience information rather secondhand hearsay finish felt bit educate gain little insight region author subject publisher good reading culture experience humor good writing learn also lot east pleasant trip bus recommend historical enjoyable fascinating always fascinate anything related impact culture religion geography second thought big regret life young real least always hippies le interesting seem people go become hippy quickly realize search futile still somewhere probably sit park wait next follow road hippy travel see hippy still leave thing find hippy notably strike sad figure still felt lose tourists tourist tourist ever hit not terribly sure really kind person anyway", "genres": ["Memoir", "Travel Writing"], "summary": "In the 1960s, hundreds of thousands of young Westerners, inspired by Kerouac and the Beatles, blazed the 'hippie trail' overland from Istanbul to Kathmandu in search of enlightenment and a bit of cheap dope.\r\n\r\nSince the Summer of Love, the countries that offered so much to these dreamers have confronted the full force of modernity and transformed from worlds of Western fantasy to political minefields. Through a landscape of breathtaking beauty Rory MacLean retraces the path of the once well-worn 'hippie trail' from Turkey to Iran, Afghanistan to Pakistan, India to Nepal, meeting trail veterans and locals on his way, and relives wide-eyed adventures as he witnesses a world of extraordinary and terrifying transformation.", "asin": "0670914843", "rank": "3304729", "city": "Kathmandu", "image": "https://images-na.ssl-images-amazon.com/images/I/51pogRrFawL.jpg", "country": "Nepal", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}