{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 35, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "One of the very best books I've ever read...and have several times.  Highly recommended."}, {"review_sentiment": 2.0, "review_text": "After I got over feeling that the author was pompous, I disregarded all his unknown (to Me) references and finished the book.  Enjoyed the last 25% the most."}, {"review_sentiment": 5.0, "review_text": "Robertson Davies writes densely crafted prose that is very satisfying to the careful reader. His protagonist in this gem of a novel is loosely based on the eminent Dr William Osler, who was one of the great medical educators and diagnosticians in the late 19th and early 20th century. As an Osler fan myself, that helped me to enjoy it more."}, {"review_sentiment": 4.0, "review_text": "Robertson Davies was a fine writer.  He also was very well educated in a wide variety of subjects, including music (especially opera), literature, theater, religion, psychology, medicine, philosophy and history. His novels tend to paint keen psychological portraits of a range of characters, often with a mystery involved, interspersed with commentary drawing from his many interests.  His sense of humor also permeates his work, poking fun at his characters' foibles and observing the absurdity of the game of life.I'd read the Salterton and Cornish trilogies and some of the Deptford trilogy before The Cunning Man, and enjoyed them all (particularly the first two volumes of the Cornish trilogy).  The Cunning Man recounts events through most of the narrator's lifetime like a memoir, and I imagine there's more than a little in it that originated in Davies' own life experiences.  For example, the narrator attended the same Canadian boarding school that Davies attended, and much of the story involves a particular Toronto church that I believe Davies was familiar with.  I also suspect that while the narrator is a physician while Davies was not, the attitudes of the two had a lot in common.Although the novel certainly has a plot, I found it of secondary interest.  There are mysteries involved, but Davies telegraphs the solutions far in advance, and finding out what happens is incidental to simply listening to Davies muse about the narrator's (and presumably, Davies') philosophy of life and what he'd learned as the end of his own life approached.  As with all of his novels, everything is said engagingly, cleverly, and articulately--he's never really boring.So in summary, it's not a gripping story, but a long, leisurely stroll through the garden with a master novelist passing on his wisdom in the best way he knows how. I would recommend it either as an introduction to Davies or to someone who has enjoyed his previous work."}, {"review_sentiment": 5.0, "review_text": "Robertson Davies is more than just a good storyteller. He is a literate storyteller who fills his novels with references to literature, music, art and science and does so in an engaging way while creating characters that are so interesting that it is difficult to put the book down. At least that has been my experience and my only regret is that I have read so few of his novels.The Cunning Man is a clever story, part mystery, part bildungsroman, part family saga and a bit of a romance, that keeps you reading to find out how the life of Jonathan Hullah, the cunning and wise doctor at the center of the book, will turn out and how those of the characters whose drama fills his life will also conclude. The doctor is a cunning man in the sense used by Robert Burton in his The Anatomy of Melancholy, a seventeenth century compendium of information about the subject of melancholy. Thus the cunning man is a sort of wizard who is as much a doctor of the soul as he is a doctor of the body. From Dr. Hullah's early days learning from a wise Indian woman called Mrs. Smoke through his years in medical school and as medic in the army he develops both expertise in traditional medicine and sometimes mysterious abilities to look into his patients' souls. The result makes for a unique career. Throughout the story the reader is treated to the differences between high and low church Anglicanism, how one deals with a journalist in the family and, most of all, how the cunning man spins his web of masterful medicine through it all."}, {"review_sentiment": 3.0, "review_text": "I've been an avid, even proselytic fan of Robertson Davies for more than 20 years, and was delighted to discover that this novel (his last) had somehow slipped by me and that there was still more Davies to read. Sadly, The Cunning Man is a let-down--a book that demonstrates, more than anything, an act of literary onomatopoeia: a novel about an elderly man contemplating a life's worth of memories and trying to position himself philosophically and existentially as he nears the end of his own story, written by an elderly writer contemplating a life's worth of memories and trying to position himself etc. The book opens with typical Davies dash, a hook that nonetheless begins to falter after less than 50 pages and which ultimately fizzles out like a Fourth of July sparkler. There's another flash at the very end of the book; in between, there's a long and only intermittently interesting series of anecdotes about characters you never get to know well and who are essentially collections of idiosyncrasies and peculiarities upon which the narrator can comment and, against which, measure himself. Framing an entire novel as a prolonged flashback (spurred in this case by the unwieldy device of a newspaper interview) has its hazards, not the least of which is that the reader essentially knows, going in, that all the characters he's about to meet are dead, disposed of, or immaterial before the narrator even gets warmed up. Like all prolonged reminiscences, that is, the story tends to evoke more passion in the storyteller than in the audience. Here and there, too, Davies allows his protagonist (himself, it seems clear) to wax on to the point of rivaling Polonius: reflections, opinions about life and love, advice, great wisdom (over) generously shared. The Cunning Man thus becomes, sadly, more tedious than not, an unsatisfying coda to the life of great and resourceful writer."}, {"review_sentiment": 5.0, "review_text": "\"The cunning man\" represents the apex in Mr. Davies novels and works. For new comers to Mr Davies legacy, please be so kind as to start with \"The fifth business\" as you may spoil your dessert."}, {"review_sentiment": 3.0, "review_text": "Though Robertson Davies was researching another book -- the end of the unfinished \"Toronto Trilogy\" -- his final novel \"The Cunning Man\" feels like the real end of his career. While it has some typical Daviesian content (mystery, evolving characters), the whole novel feels like an elderly man's farewell to his friends and the changing world.Father Ninian Hobbes, a sweet old High Anglican priest, dies during Good Friday mass. Dr. Jonathan Hullah is perplexed by the details, but not so perplexed that he doesn't take the time to recount his life story: a supposedly fragile child in a backward Canadian village, who encountered love, deep friendship, and the mysteries of psychological and physical medicine.In the present, he's a successful doctor, with a lot of the drama centering on St. Aiden's Church and his two old schoolmates: scholarly Brocky, and tragically pious priest Charlie. The death of old Hobbes sets off a hysterical devotion to the old \"saint,\" followed by a murder, the loss of old friends, and a shocking confession that changes Hullah's world.\"The Cunning Man\" is actually more like two books -- one is the bildungsroman of Hullah's youth and development, and the other is more like a series of short stories about Hullah's waning years. Many pages have musings about how the world -- and Canada -- has changed, regrets, and the loss of old friends to illness and age. You can tell that Davies was near the end of his life when he wrote this.As is usual with Davies' books, there's a wealth of historical and philosophical detail, with quirky moments like the shaman's tent and Hullah trying to diagnose fictional characters. He also tackles the question of miracles (without taking sides), the spirit of marriage, and the idea of religious devotion twisted into something else, when sins are committed in an attempt to glorify God.But his is a less coherent book than most of Davies' works. Some of the characters -- Dwyer, the Gilmartins -- simply fade out or expire offscreen, without fanfare or even much of an explanation. And the latter half is chopped up by multiple subplots and lots of rambly letters from Hullah's landlady, which are interesting but hard to follow.Hullah himself isn't terribly likable; he seems too enamored of himself. The interesting ones are the supporting characters -- lovable cynic Brocky and his wife Nuala (respectively friend and lover to Hullah), the lesbian landladies, Esme the journalist, Dwyer the religious gay banker, Mrs. Smoke the gruff medicine woman, and Charlie the worshipful curate whose piety is slowly perverted.\"The Cunning Man\" is perhaps Davies' weakest novel as well as his last, but it's also a melancholy, introspective piece of work. Farewell, Mr. Davies."}, {"review_sentiment": 3.0, "review_text": "the main character was a little too in love with himself.  maybe that was the point. about 80% of the way through, i got bored and put the book away."}, {"review_sentiment": 5.0, "review_text": "Robertson Davies' \"The Cunning Man\" purports to be the Diary or Case Book of a doctor--Jonathan Hullah--who moves from the wilderness of Sioux Lookout to Toronto, Canada.But it is much more than that.  It turns into what the narrator, Hullah, says he wants to avoid, a Bildungsroman or Novel of Development: in this case the  development of Hullah's character, but also the development of Toronto and Canada itself, from a wild-and-wooly backwoods place to an cosmopolitan, but very quirky, society.The cast of characters is brilliant.Hullah himself is interesting, if a little stuffy.  But Pansy Todhunter, one of \"The Ladies,\" whose letters he quotes in full, is a wonderful offset: slangy, funny, malicious, hearfelt.Charlie his never-quite-holy priest friend is fabulous: tormented and visionary and fanatical and sad.Mrs. Smoke, the cranky Indian shamaness who saves the 8-year-old Jonathan by magic spells and awakens him to The Other.Darcy Dwyer, the aesthete banker  who opens him to music and the visual arts, but also ruthless inquiry and even espionage.Lt. Commander Daubigny, the high-school teacher with  a multi-national and even cannibalistic past.Even Esme, the relentless young reporter with whom Hullah becomes, shockingly, smitten.All are wonderful in themselves, yet emblematic of larger elements of a changing society.Instructive, thoughtful, funny.  A wonderful read."}]}, "authors": ["Robertson Davies"], "isbn": "0670859117", "longitude": -79.387207, "periods": ["1900s"], "title": "The Cunning Man", "word_cloud": "best ever several time highly recommend get feel author pompous disregard unknown reference finish last write densely craft prose satisfy careful protagonist gem loosely base eminent great medical educator diagnostician late early century fan help fine writer also well educate wide variety subject include music especially opera literature theater religion psychology medicine philosophy history novel tend paint keen psychological portrait range character often mystery involve interspersed commentary draw many interest sense humor also permeate work poke fun character foible observe absurdity game trilogy trilogy enjoy particularly first volume cornish recount event narrator lifetime memoir imagine little originated life experience example narrator attend canadian board school attend much story involve particular church believe familiar also suspect narrator physician attitudes lot certainly plot find secondary interest mystery involve telegraph solution far advance find happens incidental simply listen muse narrator presumably philosophy life learn end life approach novel everything say engagingly cleverly articulately never really summary grip story long leisurely stroll garden master novelist pass wisdom best way know introduction davies someone enjoy previous work good storyteller literate storyteller fill novel reference literature music art science engage way create character interest difficult put least experience regret clever story part mystery part part family saga bit romance keep read find life wise doctor center turn character drama fill life also conclude doctor sense use seventeenth century compendium information subject melancholy wizard much doctor soul doctor body early day learn wise indian woman call year medical school medic army develop expertise traditional medicine sometimes mysterious ability look patient souls result make unique career story treat difference high low church deal journalist family spin web masterful medicine avid even proselytize fan year delight discover last somehow slip still demonstrate anything act literary onomatopoeia elderly contemplate life worth memory try position philosophically existentially nears end story write elderly writer contemplate life worth memory try position open typical dash hook nonetheless begin falter le page ultimately fizzle sparkler flash end long intermittently interesting series anecdotes character never get know well essentially collection idiosyncrasy peculiarity narrator comment measure entire prolong flashback spurred case unwieldy device newspaper interview hazard least essentially know go character dead dispose immaterial narrator even get warm prolonged reminiscence story tend evoke passion storyteller audience here davies allows protagonist seem clear wax point rival reflection opinion life advice great wisdom generously share thus become sadly tedious unsatisfying coda life great resourceful writer represent apex novel work new comer legacy kind fifth business dessert research end unfinished final feel real end career typical daviesian content mystery evolve character whole feel elderly farewell friends change ninian sweet old high priest die perplex detail perplexed take time recount life story supposedly fragile child backward canadian village encounter love deep friendship mystery psychological physical present successful doctor lot drama center old schoolmate scholarly tragically pious priest death old set hysterical devotion old saint follow murder loss old friend shock confession change world actually bildungsroman youth development series short story wan year many page musing world change regret loss old friend illness age tell davy end life write usual wealth historical philosophical detail quirky moment shaman tent try diagnose fictional character also tackle question miracle take side spirit marriage idea religious devotion twist something else sin committed attempt glorify coherent work character simply fade expire off screen fanfare even much explanation latter half chop multiple subplots lot brambly letter landlady interest hard terribly likable seem enamor interesting one support character lovable cynic wife respectively friend lover lesbian landlady journalist religious gay banker medicine woman worshipful curate piety slowly pervert perhaps davies weakest well last also melancholy introspective piece work davy main character little love maybe point way get bored put davies purport doctor move wilderness much turn narrator say want avoid case development character also development backwoods place cosmopolitan quirky cast character interest little stuffy letter quote full wonderful offset slangy funny malicious priest friend fabulous torment visionary fanatical cranky shamaness save magic spell awaken aesthete banker open music visual art also ruthless inquiry even teacher even cannibalistic relentless young reporter become shockingly wonderful yet emblematic larger element change thoughtful funny wonderful", "genres": ["Fiction & Literature"], "summary": "The Cunning Man is a perceptive and entertaining memoir of a doctor’s life, available as an eBook for the first time. \r\n\r\nWhen Father Hobbes mysteriously dies at the high altar on Good Friday, Dr. Jonathan Hullah—whose holistic work has earned him the label “Cunning Man” (for the wizard of the folk tradition)—wants to know why. The physician-cum-diagnostician’s search for answers compels him to look back over his own long life. He conjures vivid memories of the dazzling intellectual high jinks and compassionate philosophies of his circle, including flamboyant, mystical curate Charlie Iredale; cynical, quixotic professor Brocky Gilmartin; outrageous banker Darcy Dwyer; and jocular, muscular artist Pansy Todhunter. In compelling and hilarious scenes from the divine comedy of life, The Cunning Man reveals profound truths about being human. \r\n\r\nIn Robertson Davies’ last novel, he returns to those issues which concerned him throughout his writing career–the nature of friendship, religion, faith, and artistic life–with his famous wit and humour and his usual rich characterization.", "asin": "0670859117", "rank": "1002238", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/21ZVRY3E1EL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}