{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 26, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "i love this author. all his books are great."}, {"review_sentiment": 4.0, "review_text": "Book arrived as described."}, {"review_sentiment": 4.0, "review_text": "1950s South Africa viewed through the eyes of a young boy. Brilliant, compelling, and evocative. A fine example of concise, expressive writing. And, it is a most interesting view of the lives of humble European people living in non-glamourous parts of southern Africa."}, {"review_sentiment": 5.0, "review_text": "In the fascinating BOYHOOD, Coetzee examines the personality and emotional growth of a very able boy, always first in his class, from his tenth to his 13th year. This boy, the prince of the household, is both childishly dependent on his mother and resentful of that dependence. As a result, he sometimes heaps scorn on her. Meanwhile, he is disappointed with his weak father, who he views as second-rate. And this boy has fantasies of omnipotence, which emerge as he practices cricket alone or considers death, which, in his imagination, he transcends. The selfish and uncharitable perspective of this self-centered boy, who is also an outsider with odd affiliations, animates the people and stories that Coetzee presents in this novel.The question you’re probably asking right now is: Who would want to read a book that explores the point of view of such an unlikable character? Well, the answer is anyone who is interested in family dynamics and the foundations and development of character, since the reader finishes this book with a firm grasp of the protagonist’s personality and the ins-and-outs of his extended family. There is also much in this book about race relations in South Africa from 1950 to 1953. This is not Coetzee’s subject in this novel. But the issue is there and manifests in surprising nuggets of information. At the age of ten, for example, the protagonist says he has personally met only four natives.IMHO, there are three truly exceptional chapters in BOYHOOD. These are:o Chapter 13: Elderly Aunt Annie breaks her hip and the protagonist, with his mother, travels to the hospital. There he learns that the father of Aunt Annie, who is the sister of his mother’s mother, wrote a long and unreadable book about his youth in Germany and his divine visions. Aunt Annie had the book printed, which she was unable to sell. Scores of copies that the world does not want are in Aunt Annie’s storage.o Chapter 15: The protagonist considers his affinity for the English language, where “he feels at home.” Specifically, he considers: How did his mother, whose extended family tends to use the Afrikaans language, learn to write and speak impeccable English? And why did his father love Shakespeare and not slip back to an Afrikaans identity?o Chapter 18:  The protagonist’s father tries to reestablish his law practice. In doing so, he nearly ruins the family, which survives only because of his mother’s strength of character and the family resentments she harbors.There is, BTW, not even a single word in this pellucid novel (and probable quasi-autobiography) that is out of place. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "Very good condition!"}, {"review_sentiment": 5.0, "review_text": "First book I've ever read by Coetzee; put off him before because assumed one more colonial author; this doesn't fit any stereotypes, and prompts me to start reading his novels."}, {"review_sentiment": 5.0, "review_text": "Few authors would merit the five stars...  but Coetzee does it over and over again, whatever his subject, he captures me and doesn't let go until I get to the end.  Insightful, funny, harshly real...  and superb writing!"}, {"review_sentiment": 5.0, "review_text": "Like Stephen Daedelus, young John Coetzee does not come across as the most likeable boy, but this memoir is beautifully written and compelling in how it handles issues of self-identity, race, and family dynamics.  Essential for anyone who has enjoyed his extraordinary novels.  I should note, however, that the sequel, Youth, is considerably drier; still of interest for Coetzee fans, but by no means compelling."}, {"review_sentiment": 4.0, "review_text": "Coetzee's Boyhood, his fictional autobiography (or autobiographical work fiction) starts off slowly, but if you remain with it, and its somewhat detached tone, you will be richly rewarded.Cotetzee does The Education of Henry Adams trick in this book, telling the story of a boy who is named John Coetzee in the third person. At first it seems that this move just distances the narrative from the events. There is a haughty tone to the prose. But then the events begin to gather momentum. You realize just what is wrong with this family, its culture, its language and future.Then it kicks in: Coetzee is not writing so much about his youth, but the death of a way of life for Afrikaner white South Africans. The youth of the boy in this book is also the old age of a people and their dreams (a loss Coetzee mourns ambivalently). If some distance is what Coetzee needed to write this material, it is well worth the loss."}, {"review_sentiment": 4.0, "review_text": "Coetzee is one of the authors that i like to go back to, for the simplicity with which complex issues are unfolded in his understated style.the current book looks at the 'boyhood' of the author.distanced in time, forty years later, he brings to bear his wisdom to untangle his vivid childhood memories for our benefit and describes it in the third person.the contradictions of childhood is one of the running themes - the child Coetzee is petrified that his beloved mother,Dinny, will die and at the same morbidly fascinated by the thought of her death.his father has many virtues but each has an embarrassing qualification- 'an attorney but one who no longer practises, a soldier but only a lance corporal, a rugby player but only for the Gardens second team, he plays cricket but for the Worcester second team which no one bothers to watch'. he hates his father's personal habits, is unable to work out the position of his father in the household.he is a self absorbed child who spends long hours with his Meccanno set, his stamp collection and reading books which he borrows from the library - when he is unwell enough to skip school, he forces his mother to visit the library and borrow books so that he may read it in bed.his school is another of those contradictions. his life in school is a secret which he does not share at home just as his life at home- he is from a strange and unnatural family- is a secret not shared in school . he comes first in class, his conduct is rated 'very good' and his progress 'excellent' . he has never been caned in school and is ready to kill himself if he were to be ever flogged. but at the same time feels left out in class, since he cannot discuss with the other boys the relative merits of different canes used by the teachers, the character of the cane and the quality of pain that they inflict. for this he blames his mother since she has never beaten him.coetzee loved visiting the farm where his father grew up and where his uncle currently lived. he confesses that he is twice-born: once born of his mother and again of his grandfather's farm. he feels he belongs to the farm. this part of the narrative in the book has echoes of 'life and times of michael k' by coetzee. in that book the narrator, hibernates under the shade of a rock and revels in the solitude. one is reminded of the same solitude, vast expanse of space in the description of the farm in 'boyhood'. he feels safe, secure during the time he spends on the farm. the boy coetzee also describes various activities associated with sheep - their sheering which is done by a team which goes from one farm to the next and creates a festive atmosphere; the casatration of sheep; and the killing and gutting of sheep. it is a very cruel description but one can again relate to it, as childhood memories which tend to be devoid of judgement.the book revolves around coetzee's relationship with his mother and how she was constantly on his mind. it made me pause and reflect on how my actions are perceived by my son, whether every mother is a touchstone forever for the childs' world view....an extremly lucid but crisp recital of vivid childhood memories by a master."}]}, "authors": ["J. M. Coetzee"], "isbn": "0670872202", "longitude": 18.417396, "periods": ["1900s", "Recent Releases"], "title": "Boyhood: Scenes from Provincial Life", "word_cloud": "love author great arrive described view eye young boy brilliant compelling evocative fine example concise expressive writing interesting view live humble european people live part southern fascinate examine personality emotional growth able boy always first class tenth year boy prince household childishly dependent mother resentful dependence result sometimes heap scorn meanwhile disappointed weak father view boy fantasy omnipotence emerge practice cricket alone considers death imagination transcend selfish uncharitable perspective boy also outsider odd affiliation animate people story present question probably ask right explores view unlikable character anyone interested family dynamic foundation development character finish firm grasp protagonist personality extend family also much race relation subject issue manifest surprise nugget information age ten example protagonist say personally meet truly exceptional chapter break hip protagonist mother travel hospital learn father sister mother mother write long unreadable youth divine vision print unable sell copy world want protagonist considers affinity english language feel specifically consider mother extend family tends use language write speak impeccable father slip back identity protagonist father try reestablish law practice nearly ruin family survive mother strength character family resentment even single word pellucid probable place recommend very good condition first ever put colonial author fit stereotype prompt start read novel few author star subject capture let get end funny harshly real superb write young come likable boy memoir beautifully write compelling handle issue race family dynamic anyone enjoy extraordinary novel note however sequel considerably drier still interest fan mean compel fictional autobiography autobiographical work fiction start slowly remain somewhat detached tone richly trick tell story boy name third person first seem move distance narrative event haughty tone prose event begin gather momentum realize wrong family culture language kick write much youth death way white youth boy also old age people dream loss mourn ambivalently distance need write material well worth loss author go back simplicity complex issue unfold understated current look time year later bring bear wisdom untangle vivid childhood memory benefit describes third contradiction childhood run theme child petrify beloved mother die morbidly fascinate think father many virtue embarrass attorney longer practice soldier lance corporal rugby player second team play cricket second team bother watch hat father personal habit unable work position absorb child spends long hour set stamp collection reading borrow library unwell enough skip school force visit library borrow school contradiction school secret share home strange unnatural secret share school come first class conduct rat good progress never can school ready ever flog time feel leave class discus boy relative merit different cane use teacher character cane quality pain inflict blame mother never beat love visit farm father grow uncle currently live confesses bear mother grandfather farm feel belongs farm part narrative echo time michael k coetzee narrator hibernates shade rock revel solitude remind solitude vast expanse space description farm feel safe secure time spend farm boy coetzee also describe various activity associate sheep sheer do team go farm next create festive atmosphere castration sheep kill gutting sheep cruel description relate childhood memory tend devoid revolves coetzee relationship mother constantly make pause reflect action perceive son mother touchstone forever child world view extremely lucid crisp recital vivid childhood memory master", "genres": ["Memoir", "Fiction & Literature"], "summary": "Book 1/3 in the Coetzee Autobiographic Series\r\n\r\nCoetzee grew up in a new development north of Cape Town, tormented by guilt and fear. With a father he despised, and a mother he both adored and resented, he led a double life—the brilliant and well-behaved student at school, the princely despot at home, always terrified of losing his mother's love. \r\n\r\nHis first encounters with literature, the awakenings of sexual desire, and a growing awareness of apartheid left him with baffling questions; and only in his love of the high veld (\"farms are places of freedom, of life\") could he find a sense of belonging. Bold and telling, this masterly evocation of a young boy's life is the book Coetzee's many admirers have been waiting for, but never could have expected.", "asin": "0670872202", "rank": "2130530", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/715PJHFZK9L.gif", "country": "RSA", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}