{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 17, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "Good read.  Characters are totally believable and pretty gritty.  Humor is well done, and helps you get past the gruesome bits.  One of those books you have a hard time putting down.  Waiting for your next book!!"}, {"review_sentiment": 2.0, "review_text": "Sordid, violent, insidious, and that's only the beginning.  A character in Dirty Sally asks, \"What is the largest creature in the world?\" and then answers, \"A network of cypress trees.  The roots are attached, tree to tree, over a span of a hundred miles.  You can cut down one tree but you can't kill the roots.  Evil is like that.  You don't beat it.  It draws back and pops up somewhere else.  But it didn't move. It's here, there, it has a network that stretches across the world.\"  OK, so if this is true, then why live?  What are the characters in this book doing besides killing, mutilating bodies and having doped-up or drunken sex?  Are we actually supposed to believe a love story develops in this sordid mess?  But what really threw me is the kingpin behind it all's justification for causing these rivers of blood and semen, lame to the extreme.  But I guess it must be me, for the jacket says, \"Noir fans will be hungry for more.\""}, {"review_sentiment": 4.0, "review_text": "I started reading this book because I picked up Little Faith first and realized it was like the fourth in a series. Simon does a good job with Dirty Sally. It's gritty and dark. It started off a little slower than I would have liked and took me a little longer to read than I usually do. Towards the middle though, it was really engrossing. I enjoyed it. Now I'm ready to continue the series...."}, {"review_sentiment": 5.0, "review_text": "This is the first of the Dan Reles novels.  It was totally different and unexpected. It was not just a thriller and I was surprised where the story went.  There is a 1930s gumshoe/film noir feeling, but the novel is very current. The characters are believable. I just finished the 4th of the Dan Reles novels. I was sad when I finished one, then happy I could start the next one. I enjoyed them so much."}, {"review_sentiment": 3.0, "review_text": "I like his writing style, but too many characters are introduced, then killed off. The plot is a bit tangled as well. For me, this one was barely worth (3) stars."}, {"review_sentiment": 5.0, "review_text": "I stumbled across this book and was immediately hooked from Page 1. It is a gripping, entertaining and engrossing neo-noir tale set in the unlikely location of Austin, Texas - not the first location that would pop into my head for this genre of fiction, but Simon makes it work beautifully. His  prose is colorful and concise, the plot moves at breakneck speed, the characters are well-drawn and believable, and the dialogue snaps, crackles and pops right off the page. A great read!"}, {"review_sentiment": 5.0, "review_text": "I was born and raised in Austin.  How cool is it to have a fictional account my hometown,(home neighborhood for that matter) from my teens and up.  WOW.  Thanks.  Well written, smart, exciting thriller.  I'm telling my friends about it...and can't wait for book four!"}, {"review_sentiment": 4.0, "review_text": "Bought and read Dirty Sally after first reading great reviews for this author on another site and then the reviews from readers at Amazon.  If you like Michael Connelly, Robert Crais, Rick Riordan, Richard Barre, etc., I think you'll like Michael Simon.  Not quite yet on the writing level of the above, but great beginnings and I plan on buying his second."}, {"review_sentiment": 3.0, "review_text": "This is a very well written book, drawing you in and keeping you reading.  But alas, there is one major flaw - the publishers forgot to include the last chapter.  I'm sure this must be the case, as no competent author would just end his book like this.Hopefully, when the paperback version comes out, it will include the book's lost ending.  As I was reading it, I kept thinking that I'll definately buy this guy's next book - until there was not even a wimpy ending - it just stopped.Is this a cliff-hanger?  Will there be a sequel?  I'd wait to see if there is before buying this book."}, {"review_sentiment": 4.0, "review_text": "Set in Austin, Texas, Dirty Sally is the brooding debut novel of Michael Simon and hits the ground with a dark murder, an even darker more disturbed homicide squad and a compelling investigation taking place among the detritus of society. It's the kind of contemporary noir story that fans of George Pelecanos, James Sallis and Ken Bruen will enjoy and be clamoring for more.The story begins with a gruesome murder.Well actually, that's not entirely accurate. In fact the murder is a fairly run of the mill strangulation of a prostitute, the likes of which has been detailed in any number of thriller in the past. The gruesome part comes after the torso of the victim is discovered by Dan Reles when parts of the body begin showing up in the mail of selected Austin businessmen.Dan Reles is a homicide detective with the Austin police department and is one extremely tormented guy with a list of emotional issues dating way back to his childhood. The first time we meet him though is his first day back at work after he had been suspended for hitting another cop. Dominating just about every thought in his head is Joey Velez, his partner, mentor and friend who was killed 6 months previously. His inability to cope with the death has turned him into an unpredictable loner and he is generally regarded by his fellow cops as a loose cannon.But back to the case. An unidentified prostitute's torso is a grim enough find but pieces of her being sent through the mail calls for full and immediate action. Someone is out there sending a powerful message, but to whom?This is a much more complicated story than a simple murder investigation. Reles is also distracted by a young university student who is in fear of his life, having just lost a couple of friends in \"accidents\". It's one of those side-stories that appears unrelated but persists on the periphery until it gradually integrates with the main storyline. Simon seamlessly joins the lines together to build a tightly woven tale that had me casting around in every direction, unsure of who was good and who was evil - who would live and who would die.Much of the story is told from the first person perspective of Reles and through him we are tossed into the maelstrom of an enormously complicated person. But the point of view switches, rather fluidly I might add, to the 3rd person narrative in order to get an alternative viewpoint of the story and to catch up on parts of the story that doesn't involve Reles.Dirty Sally is unmistakably noir with the protagonist displaying serious personality flaws, as does the rest of his fellow homicide detectives. There is a consistent feeling of hopeless failure about the investigation so that even when progress is made it invariably comes at a cost. Maybe that cost is a life or a friendship or a trust.Across the board the main characters are a pretty off-beat, unlikable lot. Even Dan Reles, our protagonist mind you, is a moody, self-absorbed so-and-so who barely makes a decision without wondering how his dead partner would have done things. The rest of the squad are either corrupt bigots who delight in baiting their colleagues or defensive, unfriendly men with whom you would hesitate before trusting. It's a good thing I don't have to like the central characters to enjoy a book because looking back, they're all a fairly motley bunch of people with few redeeming qualities.As the story really gets going you sense a tremendous feeling of desperation, heightened by a growing body count, an impatient set of superiors who want results yet seemingly hamstring the investigation and a growing suspicion that not everyone is on the same team.Michael Simon has written an incredibly deep and incredibly complex thriller that I found captivating as we groped our way though some pretty depressing neighborhoods, met some of the scum who live there and found that it was all controlled by the usual rich power brokers who believe themselves above the law. Readers of hardboiled mysteries looking for a new name on the block will be pleased to hear that there is a new name on the block who has produced a resounding winner in Dirty Sally."}]}, "authors": ["Michael Simon"], "isbn": "0670033197", "longitude": -97.7436995, "periods": ["2000s", "Recent Releases"], "title": "Dirty Sally", "word_cloud": "good character totally believable pretty gritty well do help past gruesome bit hard time put wait next violent insidious begin character ask largest creature world answer network cypress tree root attach tree tree span hundred mile cut tree root beat draw back pop somewhere else network stretch world true live character kill mutilate body drunken sex actually suppose believe story develops sordid mess really throw kingpin justification cause river blood semen lame extreme guess say fan hungry start read pick first realize fourth series good job gritty dark start little slower take little longer usually really engross enjoy now ready continue series first novel totally different unexpected thriller surprise story go nor feel current character believable finish novel sad finish happy enjoy much like write style many character introduce kill plot bit tangle well barely worth star stumble immediately hooked page grip entertain engross tale set unlikely location first location head genre fiction make work beautifully prose colorful concise plot move breakneck speed character believable dialogue snap crackle pop right page great bear raise cool fictional account hometown home neighborhood matter teen write smart excite thriller tell friend first read great review author site review reader amazon think not quite yet write level great beginning plan buy second well write draw keep read major flaw publisher forget include last chapter sure case competent author paperback version come include lose end read keep think definitely buy guy next even wimpy end sequel wait buying brood debut hit ground dark murder even darker disturbed homicide squad compel investigation take place detritus society kind contemporary nor story fan enjoy clamor story begin gruesome actually entirely accurate fact murder fairly run mill strangulation prostitute like detailed number thriller gruesome part come torso victim discover part body begin show mail select homicide detective police department extremely tormented guy list emotional issue date way back childhood first time meet first day back work suspend hit cop dominate think head partner mentor friend kill month previously inability cope death turn unpredictable loner generally regard fellow cop loose back case unidentified prostitute torso grim enough find piece send mail call full immediate action send powerful message much complicate story simple murder investigation also distract young university student fear life lose couple friend accidents appear unrelated persists periphery gradually integrate main story line seamlessly join line together build tightly weave tale casting direction unsure good evil story tell first person perspective toss maelstrom enormously complicate person point view switch rather fluidly person narrative order alternative viewpoint story catch part story involve unmistakably nor protagonist display serious personality flaw rest fellow homicide detective consistent feeling hopeless failure investigation even progress make invariably come cost maybe cost life friendship board main character pretty unlikable lot even protagonist mind moody barely make decision wonder dead partner do thing rest squad corrupt bigot delight bait colleague defensive unfriendly men trust good thing like central character enjoy look back fairly motley bunch people redeem story really get go sense tremendous feel desperation heighten grow body count impatient set superior want result yet seemingly hamstring investigation grow suspicion everyone write incredibly deep incredibly complex thriller find captivate groped way pretty depress neighborhood meet scum live found control usual rich power broker believe law reader hard boiled mystery look new name block please hear new name block produce resound winner", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "<span class=\"a-size-small a-color-secondary a-text-bold\">Book 1/4</span><span class=\"a-size-small a-color-secondary\"> in the </span><span class=\"a-size-small\">Dan Reles Series</span>\r\n\r\nWhat James Ellroy did for L.A., Michael Simon now does for Austin, Texas, in the first of a series of ferociously paced crime novels. The time is the oil-bust year of 1988.\r\n\r\nThe detective is Dan Reles, a New York–born Jew marooned among good ol’ boys and unhinged by the violent death of his partner. His career depends on solving the case of a murdered prostitute whose body is arriving in grisly installments at inconvenient locations. But as he tries to find out who killed \"Dirty Sally,\" Reles starts crossing the lines between his town’s crack-ridden ghettos and the watering holes of its moneyed elite.\r\n\r\nUnerring in its sense of place, propulsively written, Dirty Sally announces a major new talent.", "asin": "0670033197", "rank": "3307589", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/611S5NH4A7L.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}