{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 15, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "A book that should be taught in every school.  English/writing.  A modern classic."}, {"review_sentiment": 4.0, "review_text": "My favorite, most memorable Brautigan book.  I've given away 2 copies because I liked it so much.  Favorite chapter title - \"My Three Abortions\""}, {"review_sentiment": 5.0, "review_text": "Late sixties--early seventies--the counter-culture--hippies and flower children--a gentler society--the protest movement--the Vietnam war that galvanized us--feminism, civil rights, gay rights--bell bottom pants, long hair--Out with the old order, in with the new--freedom, love and brotherhood! We were going to change the world.For music, we had Dylan, Hendrix and CSN--The LA Free Press was our only news source--and our authors?? Well, Richard Brautigan was one--one of our spokesman. We shed the cold, analytic, sophisticated classics we'd been schooled in and turned to Brautigan for something simpler, something purer, something part reality-part fantasy that struck at the truth more directly, made us feel better, gave us hope--something that freed our souls--something whimsical--something bizzare, no thought or analysis required. His themes opened our minds to new possibilities, new ways of thinking about the world--much of it fantasy and unattainable but he made you feel like it was. His stories and his unique way of telling them was like a fresh gust of wind in our sails that propelled us further along our way in our quest for a better world--but it was not to be and sadly we couldn't change it--things only got worse--Brautigan left us--perhaps because he knew we'd failed. Now almost fifty years later both his books and the life he and we had envisioned are \"out of print\".Who could forget \"Confederate General of Big Sur\", \"Watermellon Sugar\", Trout Fishing in America\" or most of all-- \"The Abortion\". Now that I am an author myself I see even more the genius of a library where only unpublished, unread books are kept--zealously guarded 24 hours a day by a custodian who considers them treasure--where people can come in and place their books on the shelf then sit for hours reading other unappreciated books. A library that has no set hours, never closes its doors and the custodian never leaves his post, open day and night should some poor soul want to bring their book there.I can still visualize, fifty years after having read \"The Abortion\", the fellow that periodically showed up at the library in an old pickup truck to transport the overflow books--to make room for more on the shelves--to some dark and dank cave outside of town. I can visualize and feel the kind of man that is the custodian--living in total isolation--having even his groceries brought to him from the outside as he desperately tries to write his own book that he hopes he can one day place on the librarys' shelves. I feel his joy when he finally finds female companionship--and love. And I experience their bittersweet trip to Mexico for the abortion.Now Brautigan is gone--hopes for a better world are gone--wars continue--women and little girls are brutalized around the globe--discrimination against those that are different and genocide continue--and on and on. The world of Brautigan and the hope of the sixties was but an illusion--and we can't even read his books-- because they're \"out of print\"!DH Koester--\"And There I Was\" And There I Was Volume VII: A Backpacking Adventure in Guatemala"}, {"review_sentiment": 5.0, "review_text": "This was one of the easiest books to read. I finished it in no time. I bought it for a research paper, but actually really liked the book."}, {"review_sentiment": 1.0, "review_text": "This book is one of the most god-awful pieces of \"literature\" that I have ever laid eyes on. I would really like to have a serious heart-to-heart with anyone who gave this thing over one star. This guy just pukes out the weirdest, most ill-fitting similies and metaphors (not to mention he's a ridiculous sexist pig).An under-achieving 5th grader taking his first creative writing course could do better than this. I mean, c'mon...just read this line: \"Her stomach was so unbelievably thin that it was genius and I wondered how there could be enough intestines in there to digest any food larger than cookies or berries.\"Dude. Lay off the LSD. Seriously. You're hurting your brain."}, {"review_sentiment": 5.0, "review_text": "this book is my favorite book of all time.  the subject matter is simple but the but the style of the writing is amazing and keeps your interest.  the book is about a man who works and lives in a library and has lived there for a few years.  the books contained in the library are written by random people who drop the books off when they are finished writing them.  eventualy the character meets a beautiful insecure woman who he falls in love with. she later becomes pregnant and they end up on a trip to mexico to get an abortion.  i know it does not sound that exciting but i swear the writing and the characters make the book truely enjoyable."}, {"review_sentiment": 4.0, "review_text": "Somewhere out there maybe there's a library for all the books never published, by people who weren't authors, for readers who weren't interested.  Maybe my reviews should be sent there !  Richard Brautigan imagined himself working in such a place, where the overflow was stored in caves (but what about seepage?  Whoa, man, what a bummer !)  He no doubt thought melancholy thoughts about how his own writings would wind up just in such a place.  But as for me, that's the wrong tune.  He captured so much about his times, about human nature, about life itself in those minimalist little chapters of his.  THE ABORTION is more lineal than his other works-it has a plot that he sticks to, a plot that even got me feeling tense as with some kind of pop thriller.  He meets a most beautiful girl who is disgusted with her own beauty, doesn't feel it becomes her true soul.  She settles down with the author in his weird library, a place where he has been hiding away from the \"real world\" for three years.  But one thing leads to another, and an abortion becomes necessary.  Given the way our great nation is going, someday soon this book is going to be burned; read it while you can.  The couple fly down to San Diego, cross over to Tijuana, and find the abortionist.  What happens ?  Meatball doesn't reveal endings.  Sorry.  The Brautigan humor, the whimsical observations plunked down in the middle of a totally different conversation.  I like non-sequiturs.  Perhaps enlightenment is found in such bouncing, scintillating simplicity.  In any case, if you liked any others of Brautigan's work, you'll like this one for sure.  Read the rest of them too.  Richard Brautigan is gone.  We will not see his like again, more's the pity."}, {"review_sentiment": 4.0, "review_text": "The main character is a librarian at a different type of library. At this library, books by writers who can never hope to be published are given a place in the world. The librarian lives in the library, always answer the silver bell which signifies some new aspirant. They are treated kindly, and told that they can leave their book on any shelf once it has been entered into the registry. The narrator falls in love with Vida, a shy and awkward girl who is trapped in the body of what may be the most beautiful woman on earth. They live together happily for a period of months until she becomes pregnant, necessitating a trip to an abortion doctor in Tijuana, which is also the librarian's first exit from the library in three years.The Good and the Bad:What a breath of fresh air. Brautigan's book just sails right by, with every page containing a reason to smile or visualize a stunning metaphor. As with his Hawkline Monster, this is a slightly surreal world in which whimsy overtakes reason. Positives include interesting and believable characters, awesome metaphors, witty dialogue, and a good feel for pacing. The flavor of the book is similar to Kerouac in that there is a sense of wild abandon and randomness that moves the characters along, but it is far superior in almost every aspect.If I had to choose a negative, I guess I would say that I was slightly confused at the ending, in which the librarian has become a hero on a college campus. I don't get a sense of why he is needed or held up, because he is no longer a librarian. Also, Brautigan includes himself as a character, and that's just too self-indulgent."}, {"review_sentiment": 5.0, "review_text": "Richard Brautigan's writing speaks directly to my soul. I cannot read more than a line or two of his prose without getting the eerie feeling that if I could somehow magically distill my feelings to their perfect essence (which is far beyond my abilities) the result would still fall far short of the understanding of who I am, so effortlessly expressed in his stories. I have never read an author whose writing more poignantly captured such overpowering feelings of love, isolation, and (perhaps frighteningly) understanding. I cannot recommend this book (or any of Brautigan's books) highly enough. I would have given it 25 stars, if it had been possible."}, {"review_sentiment": 5.0, "review_text": "This is one of the best works of Richard Brautigan. One day a man who lives in a unique library meets a girl who has perfect beauty, and a strange love story starts off. The plain and beautiful style, which has influenced Raymond Carver, is easy to read, but what it says is never a simple matter: this book is written about the loneliness that everyone who lives in this modern world has. But you needn't worry that you'll get depressed after you read this. I assure you that, instead, you'll feel a gentle optimism at the end of the novel."}]}, "authors": ["Richard Brautigan"], "isbn": "067120873X", "longitude": -122.4192363, "periods": ["1900s"], "title": "The Abortion: An Historical Romance 1966", "word_cloud": "taught school modern classic favorite memorable give copy like much chapter title abortion late sixty early seventy hippy flower child gentler society protest movement war galvanize feminism civil right gay right bell bottom pant long hair old order new freedom love brotherhood go change music news source author spokesman shed cold analytic sophisticated classic school turn something simpler something purer something part fantasy strike truth directly make better give hope something free soul something whimsical something bizarre think analysis require theme open mind new possibility new way think world much fantasy unattainable make feel story unique way tell fresh gust wind sail propel way better world sadly thing get worse leave perhaps know fail now almost fifty year later life envision print now author see even genius library unpublished unread keep zealously guarded hour day custodian considers treasure people come place shelf sit hour read unappreciated library set hour never close door custodian never leave post open day night poor soul want bring still visualize fifty year fellow periodically show library old pickup truck transport make room shelf dark dank town visualize feel kind man custodian living total isolation even grocery bring outside desperately try write hope day place library shelf feel joy finally find female companionship love experience bittersweet trip go hop better world go war continue woman little girl brutalize globe discrimination different genocide continue world hope sixty illusion even be be volume easiest finish time buy research paper actually really liked piece literature ever lay eye really serious anyone give thing star guy puke weirdest simile metaphor mention ridiculous sexist pig grader take first creative writing course mean line stomach unbelievably thin genius wonder enough digest food larger cooky hurt brain favorite time subject matter simple style write amazing keep interest man work live library live year contain library write random people drop finish write eventual character meet beautiful insecure woman fall love later become pregnant end trip mexico abortion know excite swear write character make truly enjoyable somewhere maybe library never publish people author reader interested maybe review sent imagine work place overflow store cave seepage man bummer doubt think melancholy thought writing place wrong tune capture much time human nature life minimalist little chapter lineal plot stick plot even get feel tense kind pop thriller meet beautiful girl disgust beauty feel become true soul settle author weird library place hide away real world year thing lead abortion become necessary way great nation go someday soon go burn couple fly cross find abortionist happen reveal ending sorry humor whimsical observation plunk middle totally different conversation like perhaps enlightenment find bounce scintillate simplicity case like others work sure rest go see pity main character librarian different type library library writer never hope publish give place world librarian live library always answer silver bell signify new aspirant treat kindly tell leave shelf enter registry narrator fall awkward girl trap body woman live together happily period month become pregnant necessitate trip abortion doctor also librarian first exit library good breath fresh air sail right page contain reason smile visualize stun metaphor slightly surreal world whimsy overtakes reason positive include interest believable character awesome metaphor witty dialogue good feel pace flavor similar sense wild abandon randomness move character far superior almost choose negative guess slightly confuse end librarian become hero college campus get sense need held longer librarian also include character write speaks directly soul line prose get eerie feeling magically distill feeling perfect essence far ability result still far short understand effortlessly express story never author write poignantly capture overpowering feeling love isolation perhaps frighteningly understand recommend highly enough give star possible best work day man live unique library meet girl perfect beauty strange love story start plain beautiful style influence easy say never simple matter write loneliness everyone live modern world need worry depressed assure instead gentle optimism end", "genres": ["Fiction & Literature"], "summary": "A reclusive young man works in a San Francisco library for unpublishable books. Life's losers, an astonishing number of whom seem to be writers, can bring their manuscripts to the library, where they will be welcomed, registered and shelved. They will not be read, but they will be cherished. \r\n\r\nIn comes Vida, with her manuscript. Her book is about her gorgeous body in which she feels uncomfortable. The librarian makes her feel comfortable, and together they live in the back of the library until a trip to Tijuana changes them in ways neither of them had ever expected.\r\n\r\nSet in a magical library that is always open, The Abortion is a cult classic, and revolves around a librarian who accepts only books that are “the unwanted, the lyrical and haunted volumes of American writing.” The librarian falls in love with a woman named Vida, who becomes pregnant, and the two seek an abortion in Tijuana. \r\n\r\nA truly beautiful book about the love that can only happen between the people who love books. Timelessly ’60s, endlessly dreamy, Brautigan’s writing is curious, quirky, and uniquely poetic.", "asin": "067120873X", "rank": "706949", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51QSIP88yiL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}