{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 13, "rating": 3.4, "reviews": [{"review_sentiment": 2.0, "review_text": "I got this book for some background on Barcelona for a fiction series. After some interesting opening descriptions of the city and landscape and history, I have to admit I was bored to tears. Maybe something was lost in the English translation, but the prose is unforgivably boring, especially given that the plot seems so compelling. It was like there is a great story waiting to be told here, but the actually telling of it was terrible. That could be the fault of the translator for turning a potential classic into mind-numbing prose that carries all the excitement of a wet plastic bag, but I couldn't even read the whole thing. This book was recommended to me by a native Spanish speaker who loved it, so perhaps it is best enjoyed in the original language. I couldn't say."}, {"review_sentiment": 3.0, "review_text": "Eduardo Mendoza's award-winning international bestseller, The City of Marvels, is an extraordinary tale of a fabulous city on the sea.  Originally published in Spanish in 1986, it was later translated into English by Bernard Molloy for Harcourt Brace Jovanovich, Inc. in 1988.  In this adventurous novel, the young protagonist, Onofre Bouvila, begins his lonely journey to Barcelona, a city with its own lifestyle, language and hierarchy.  He goes to the city to find wealth.  Throughout his life, Bouvila discovers how much corruption there is in Barcelona.  He also meets people who help him fulfill his purpose in Barcelona.  The novel begins with Bouvila searching for a place to stay.  As he wanders through the streets of Barcelona, he comes across Señor Braulio, a homeowner who rents out rooms.  Bouvila decides to move into Braulio's boardinghouse.  In order to pay his rent, Bouvila finds work distributing anarchist pamphlets, a job arranged by Delfina, Señor Braulio's daughter. Delfina is a frail and raggedy girl for whom Onofre develops an unhealthy obsession. Despite his attractions, love does not interfere with his main objective: To be an affluent and powerful man. Bouvila is sent to distribute the anarchist pamphlets at the 1888 World Fair construction site.  By working at the World Fair, he is able to establish connections with people who later further his career.  Initially, Bouvila is earning a very low pay by distributing the pamphlets.  Later, he sells stolen merchandise from the world fair site and then joins a mob that virtually runs the city, and eventually becomes its leader.  Through his innate sense of Catalan industrialism, manipulation and determination, he becomes a rich and important man who tricks and uses people.  Two of the major themes of Bouvila's tale are place construction and the problems of urbanization in Barcelona.  Place construction is the term used to describe the attempt that Barcelona makes to portray itself to the rest of Spain and the rest of the world that it is important and a global city.  To do this, Barcelona hosts two World Fairs which result in the selling of its history, culture, architecture, and people.  Interestingly, the publication of this novel coincides historically with another era of place construction, the preparation for the 1992 Olympic Games in Barcelona.The second theme is the problems of urbanization which have made Barcelona an uncomfortable and expensive place to live.  Only a few areas were developed.  This happened with the reality speculation and selective renovation which has occurred throughout Barcelona's history.  Although Barcelona developed over time, it became congested and costly. Corruption led to construction of low quality housing. Instead of developing social classes, the poor were displaced. As  a result, the rich became more rich and the poor became more poor with no middle class.  Even though the novel is fictional, it is based on historical fact, making it a dazzling piece of literature.  The reader will learn about Barcelona, and still be entertained.  I recommend The City of Marvels to anyone visiting Barcelona, because it contains everything one needs to know about it."}, {"review_sentiment": 3.0, "review_text": "Eduardo Mendoza's 1986 Spanish novel The City of Marvels is a wonderful work which takes place in Barcelona during the late 1888-1929.  It was translated in 1988 by Bernard Molloy and published by Harcourt Brace Jovanovich, Publishers.  It opens with the protagonist, Onofre Bouliva, living in a boarding house ran by Delfina and her father Senor Braulio.  While there Delfina helps him acquire a job for the anarchists group being run by Paulo where he begins handing out flyers promoting the group.  Through this job Onofre begins to put his foot in the door of Barcelona.  Constantly changing jobs, Onofre begins to sell hair products at the World fair, soon he becomes and arms dealer and then works his way up in the mob and finally he ends up in the movie business and buys a mansion in La Bonanova.  Despite all this acquired wealth, Onofre was not happy; he always wanted more.  This leads to his great escape from Barcelona at the 1929 World's Fair. Onofre's constant desire for more supports the story's theme of power, greed and money.  He always wanted to acquire more, but was never satisfied with what he had.  Onofre left his home for Barcelona in search of a job and more money.  Then after that, with every job he had, he always tried to make as much profit as possible.  Even though people wanted to kill him, he was always focused on money. Onofre believed that with more money came more power, and acquiring more money would mean he would have more class.  As an outsider, Onofre wished to be accepted in the Barcelonan society and be a part of the inner circle of the city's nobility.Along with Greed, another major theme in the story is the development of space.  People, culture, social distinctions and reality describe historical facts while incorporating fictional characters.  As Barcelona expanded, the city began to be divided into sectors.  The city began to expand and classes were established.  Upper, middle, and lower classes were distinguished into certain areas of Barcelona.  The emphasis of urban development for the World's Fair parallels the time frame of the book and the urban development of the city for the Olympics. I would recommend this book to anyone who is interested in Barcelona or just a good leisure read.  It has many relevant topics about the Barcelona culture and tells an intriguing story and overall is a very good book and is highly recommended."}, {"review_sentiment": 4.0, "review_text": "Eduardo Mendoza's The City of Marvels (1986) translated from Ciudad de los Prodigios by Bernard Molloy of Harcourt Brace Jovanovich, Inc. and William Collins Sons & Co. Ltd., is a brilliant and enjoyable historical fiction novel.  Though first published in Spain, The City of Marvels became a best seller internationally.  The book chronicles Onofre Bouvila's economic journey through Barcelona during the years of 1888 through 1929, from Barcelona's first World's Fair to its most recent.  During this stretch of time, Bouvila goes from being a poor, nearly homeless anarchist, to becoming the wealthiest man in Barcelona.  Along the way he finds himself occupied with various jobs, ranging from thievery to weapon trafficking.  He also encounters several different people including future business partners such as Efren the giant, and lovers such as Delfina, an ugly, yellow-eyed maid.  Most importantly, the book equates Bouvila's life to the similar situations taking place in Barcelona at that time through some accurate history such as the dates and locations of the World's Fairs, and some fiction like the make-believe characters Onofre encounters.Two of the central themes in this book are power and greed.  Throughout the novel, Onofre encounters both quite frequently.  Onofre starts out as a poor, homeless boy, desperate for work and in need of a place to reside.  However, as the plot unravels, Onofre discovers that he has a knack for manipulating the people of the city and for taking advantage of all opportunities that come his way.  The exemplification of Barcelona in the novel and Onofre's manipulation of the city herself is also very evident.  Directly paralleling Barcelona is Onofre's relationship with women and his exploitation of women is a metaphor for his use of the city. He will only love the city, his women, until he can benefit no more. He uses his gift to excel in the businesses of the city until he is the richest and most powerful capitalist in Barcelona.  Nonetheless, Onofre is never satisfied with his position in life, whether it is business or pleasure.  His greed eventually leads to the demise of several people, including former lovers, friends, and family members; and toward the end of the novel, we realize that Onofre's life will never be fulfilled because of his uncontrollable greediness.I highly recommend The City of Marvels to anyone, especially people interested in the city of Barcelona.  The novel contains several detailed descriptions of geographical and historical features of the city, and the intriguing plot will keep any reader on the edge of their seat.  If you are looking for an interesting, enjoyable, and exciting book, The City of Marvels is the perfect choice for you!"}, {"review_sentiment": 5.0, "review_text": "The City of Marvels, a fictional novel, written by Eduardo Mendoza follows the adventures and trials of Onofre Bouvila, a poor country boy living in Barcelona as he progresses toward his goal of becoming wealthy and powerful. Immediately upon his arrival in the city he moves into a boarding house where he meets the owner and his mysterious daughter Delfina. Although he is disheartened at the prospect of never finding work in the city, his new acquaintance Delfina gets him a job with a fellow anarchist Pablo to work for their campaign. Onofre then begins a long string of various jobs that help launch him into wealth. These occupations include handing out anarchist pamphlets, selling hair oil, selling stolen merchandise from the World Fair, working his way up through a Barcelonan mob, filmmaking and more. Onofre reaches his goal, and becomes a wealthy and well known figure in Barcelona, rarely thinking of his past family, and his father who was a constant disappointment to him. Throughout the book he continually longs for more power and money and never seems to find contentment. Throughout the novel, Mendoza deals with several main themes including Place, money, and power. The novel follows the development of Barcelona as a place through two World Fairs, different city rulers and even discusses the different class distinctions. Although, Barcelona is trying to emerge as an important and global city, Mendoza continues to focus on the poor and problems the city continues to harbor. Money and power also become a central part of the book and Onofre's life, he is never happy with the amount of money or control he obtains. These themes of place, money and power are continued in the novel, developing them as the city and Onofre develop with them.After following the development of Onofre and the city of Barcelon, the ending comes as both an interesting twist and a surprise to the reader. This is not your typical novel, but still interesting as it contains a great deal of information about the city of Barcelona with long descriptions of geography and historical references, and how it parallels with the novels characters. Mendoza uses Onofre's strange attraction yet horrible treatment of women in his novel to represent different parts of Barcelona. His relationship with Delfina represents his treatment of the lower class and his disregard for their space. Onofre's later relationship with his wife represents his treatment of the upper class, and his need to gain more wealth. Lastly, his involvement with the young Beltal girl shows how he abuses the middles class and their space.  The novel follows Barcelona as it develops and preps for the two World Fairs, and parallels with the changes made for the Olympics at the time of the novels publication. Although, a background of Barcelona is not necessary to read this novel, it may help when trying to understand the many references made to the geography and history of the city. This novel will give you an understanding of Barcelona while keeping the reader interested with Onofre's constantly changing life, and I would recommend this novel to all readers."}, {"review_sentiment": 5.0, "review_text": "Eduardo Mendoza's novel, La Ciudad de Los Prodigios translated into The City of Marvels, depicts the story of not only fictional characters, but also covers facts of historic events and geography.  This book was copyrighted in the year 1986, however the translated book by Bernard Molloy was copyrighted in 1988.  Through the main character, Onofre, the audience sees that he always used his power to benefit from Barcelona.  Mendoza displays reoccurring themes about the main character such as, greed and the concept that people with power corrupts every person who comes in their path.In the story readers observe, the life of Onofre Bouvilia, the main character in the novel as he learns of the power he eventually gains. This novel takes place in Barcelona, Spain.  Onofre first moves to Barcelona at the young age of thirteen.  He earns money by working a few tedious jobs such as distributing pamphlets at the World Fair, stealing products from the World's Fair, selling war weapons, and working as a mobster.  Through out his jobs, he becomes an accomplished business man by creating ways to manipulate others to gain in his own fortune.  He uses trickery and murders his fellow co-workers in order to receive what he desire.  This is true for his experiences in both the business world and his own personal life.  Once Onofre views his objects of affection and obession, he still will always find himself wanting more.Mendoza's novel depicts the life of a young man who changes the way he is because of a reversal in fortune.  Mendoza displays reoccurring themes about the main character such as, greed and the concept that people with power corrupts every person who comes in their path.  Mendoza explains these themes as the readers watch as Onofre becomes successful in life and grows greedier.  He then uses his power to corrupt and manipulate people who are connected to him such as the women and friends around him.  Onofre will never be content with what he has in life.  Mendoza's novel depicts the life of a young man who changes the way he is because of a reversal in fortune. If one desires to learn about the culture and history of the city, this would be the book to read."}, {"review_sentiment": 3.0, "review_text": "Eduardo Mendoza has certainly done it again.  The City of Marvels is a colorful tale of Barcelona in the late 1800s and early 1900s that has captivated audiences from all around the world.  Throughout the novel Mendoza unravels a mesmerizing story that touches on enticing themes including anarchism, political corruption, the influence of money, cynical manipulations of power, and of course, sexuality and romance.  The constant references to governmental corruption and prostitution give the reader large insights as to the ways of the old city.  The book follows Onofre Bouvila from the time he arrives in Barcelona as an adolescent through his development into the money-hungry entrepreneur that he becomes.  Mendoza leads his readers into feeling sorry for this antihero with his emotional struggles over his failed father and his consistently bad relationships.  Onofre discovers himself at the first of two world fairs in Spain, and after over 3 decades of achievements and let-downs the story winds to an end as the second world fair is coming to a start.  In his quest to make money he falls into a long list of jobs including the distribution of anarchist pamphlets, smuggling arms during the war, and developing a silent movie industry that eventually fails.The most interesting part of this novel is the parallel between Onofre's life and the development of the city of Barcelona at the turn of the 20th Century.  As Onofre builds his fortune and reconstructs everything around him time and time again, Barcelona undergoes similar renovations and changes in the preparations for the World Fairs and the beautification of old structures.  When Onofre grows and matures, the city expands and develops.  When Onofre suffers personal blows in his relationships, Barcelona undergoes painful corruption that is detrimental to the heart of the city.  This undeniable comparison leads the reader through a history lesson as it weaves throughout the fiction of the character's lives and the reality of the triumphs and failures of the city. Surprises lie at each turn of the novel and although the ending leaves you wanting more, it is definitely not a disappointment."}, {"review_sentiment": 4.0, "review_text": "The City of Marvels (originally Ciudad de los prodigios), was written by Eduardo Mendoza in 1986 and translated to English by Bernard Molloy in 1988.  It is a fictional novel that incorporates events in Spanish history beginning in the late nineteenth century and ending in 1930.  The novel revolves around the character Onofre Bouvila, who moves to Barcelona as an adolescent in 1888 in search of wealth and new experiences.  He stays at a boarding house, where he meets and becomes obsessed with Delfina, the owner's daughter. She plays an important role due to her recurring love affair with Onofre.  Despite his persistence, which is illustrated throughout the novel, Onofre is unable to find work on his own and receives aid from Delfina.  He begins to work for an anarchist group, even though he is rather apathetic towards politics.  Through some illegal dealings and connections with influential individuals in the city, Onofre eventually gains both wealth and power, abandoning the idealistic anarchist principles he had learned earlier.  Brutally cunning, manipulative, and desperate for power, he becomes involved in numerous moneymaking activities that allow him to rise in the ranks of the city's political structure.  The novel is full of corruption: Onofre's transformation into a treacherous powermonger and the system of corruption in Barcelona's politics play major roles. Most of the themes in The City of Marvels deal with the politics of the city; repression, industry's effects on the city, the divisions between social classes, and the accumulation of wealth and power are all shown in both Onofre's character and the influences around him.  For example, the disparity between nobility and common people is repeatedly shown in Onofre's inability to climb to the very top of the social ladder; no matter how much money he gains, he is still looked down upon because he is not nobility.  Also, Mendoza shows different aspects of the city's politics: First, Onofre is involved with the anarchist group, and later, he becomes tied to the more wealthy and powerful individuals of the city, who oppose the anarchists.  Onofre's progression up the rungs of society represents the different sides of the city and its advancement through numerous stages.  This work also emphasizes Barcelona's extensive restoration and renovation at the turn of the twentieth century, forming a link to the intense urban development taking place for the 1992 Olympics when The City of Marvels was published.  The novel also reveals major flaws in human nature related to greed, corruption, and selfishness.The City of Marvels flows extremely well, with an intriguing mix of flashbacks, foreshadowing, history, and fantasy.  I would recommend this novel for all readers, especially those with an interest in Spanish culture, history, or politics."}, {"review_sentiment": 4.0, "review_text": "Kristi WysockiOctober 1, 2004City of Marvels Book ReviewEduardo Mendoza's, City of Marvels, published in Spanish in 1986 and translated into English in 1988 by Harcourt Brace Jovanovich, Inc.  This novel City of Marvels accurately portrays the city of Barcelona through the eyes of a young man, Onofre Bouvila, as Onofre and the city of Barcelona grow up into dominating forces together. The book starts as the city prepares to host their first World Fair in1888 when Onofe comes to the city as a young, country boy. He finds shelter in a rickety boarding house run by Senor Braulio, his wife, and his wretched daughter Delfine; for whom Onofre grows a frightening obsession. Since work is hard to find at this point in Barcelona, Delfina helps Onofre by getting him a job with her anarchist friends. He is sent to the World Fair construction sight to distribute anarchist pamphlets. There he learns the tricks of the trade to avoid the police, and starts to find success through corrupt and illegal activities. At the World Fair site he meets Efren Castells who becomes his long time right hand man. Efren, a gigantic man accompanies Onofre on his many journeys. Soon, Onofre is hand picked by Don Humbert, a mob boss,  and works for him for several years. During this time, Onofre's intelligence and charm helps him work is way to the top of the mob. He overthrows a major mob, and becomes head of Don Humbert's gang. Onofre also falls in love with Don Humbert's much younger daughter. The two marry and have kids, but Onofre becomes quickly bored with his wife and the marriage. After many years of lies, hit men, and corruption Onofre decides to get out of the business and venture into other areas. An attempt at the movie business does not bring him any money, but he is able to reconnect with his first female obsession, Delfina, as she stars in his movies. During this time, Barcelona prepares for another World Fair, and Onofre make one final, extravagant attempt to be accepted into Barcelona's elite.One of the main themes in the books is social acceptance. Onofre wanted to be accepted into the most exclusive inner circle of Barcelona's high society; but no matter how much money he has he will never be totally accepted, due to his lack of nobility and poor background. For example, when Onofre coordinated and sponsored the arrival and elegant dinner for Princess Aliz de Hesse. There at the dinner at the Ritz Hotel, he was not allowed to sit next to the Princess, even though he paid for the entire event. In addition this shows money, power, and greed will never lead one to true happiness. Furthermore, another theme that one sees in this book is that as Onofre grows and changes into a successful man, the city of Barcelona is also growing and changing into a dominating city. For example, with each job that Onofre takes on he hopes that it will make him richer and more powerful. This would allow him to be accepted into Barcelona's elite. Barcelona is doing the same thing, they hope that with each World Fair, and to become a richer and more powerful city, thus gaining acceptance as one of the world's elite cities.I would recommend this book to anyone this story. I believe that this book deserves all the awards it has received. Eduardo Mendoza creates an interesting storyline while placing the fictional characters in historical settings. Also for anyone interested in Barcelona this book is a great way to learn about the city besides reading boring, informational texts. With every book though there is some criticism. The writing style can be a little difficult to follow at times; for example, when a person is concentrating on one part of a story it then quickly switches to a different part. However, these twist and turns can be positive attributes, for it keeps the reader interested and on their toes. Overall, I was impressed with this book immensely. I fell in love with the characters, and enjoyed the plot line, while at the same time learning about an exciting city."}, {"review_sentiment": 4.0, "review_text": "The City of Marvels, written by Barcelona native Eduardo Mendoza, is one of the most important novels in contemporary Spanish literature.  It was written in 1986 and translated to English in 1988 by Bernard Molloy.  The novel is set between 1888 and 1929, the years of Barcelona's two World Fairs.  The City of Marvels chronicles the life of corrupt businessman Onofre Bouvila.  As an early teen, Onofre moves to Barcelona from a small farm with the hopes of getting rich.  He finds a place to live at a shabby boardinghouse where he becomes obsessed with the owner's daughter, an awkward girl named Delfina.  She in turn finds him his first job distributing anarchist pamphlets at the site of the 1888 World Fair.  Eventually, through several random schemes such as arms smuggling, land speculating, and film producing, Onofre becomes the wealthiest man in Spain.  With help from his monstrous buddy Efrén Castells, whom he met at the Fairgrounds in 1888, he uses violence to work his way to the top and reach his dreams of being rich and powerful.  The City of Marvels has quite a few important themes.  A very important one is about money and the power it brings.  When Onofre was a young boy, his family had practically no money so he made it his goal to grow up and make as much money as possible.  Once he finally did, he realized he could use his money to get literally everything he could imagine.  With this money, Onofre was able to wield power and manipulate business deals, women and urban space.  Another theme is the similarities between the characters in the novel and the city of Barcelona.  In The City of Marvels, Onofre treats the city as he does his women.  He treats both extremely poorly and acts as if it his right to do so.  Onofre and Barcelona are also similar in their growth.  As the city grows and expands, so does Onofre's empire.  There is also a parallelism between the renovation of Onofre's mansion and the urban development of Barcelona for the two World Fairs of 1888 and 1929.  This idea of urban renovation and development also links to the city when the book was written and published in the 1980s, in the midst of intense preparation for the Olympic Games of 1992.  The novel is well written, well developed and intriguing.  However, it seems as if some of its effect was lost in translation. All in all, I would definitely recommend this novel to any reader, especially one interested in the history and culture of Barcelona."}]}, "authors": ["Eduardo Mendoza"], "isbn": "0671702343", "longitude": 2.1774322, "periods": ["1800s", "1900s"], "title": "The City of Marvels", "word_cloud": "get background fiction series interest opening description landscape history admit bore tear maybe something lose english translation prose unforgivably bore especially give plot seem compel great story wait tell actually tell terrible translator turn potential classic prose carry excitement wet plastic bag even thing recommend native spanish speaker love perhaps best enjoy original language international bestseller extraordinary tale fabulous sea publish spanish later translate adventurous young protagonist begin lonely journey lifestyle language hierarchy go find wealth life discover much corruption also meet people help begin search place stay wanders street come homeowner rent room decide move boardinghouse order pay rent find work distribute anarchist pamphlet job arrange daughter frail raggedy girl develop unhealthy obsession attraction love interfere main objective powerful man send distribute anarchist pamphlet construction site work able connection people later career earn low pay distribute pamphlet sell steal merchandise world fair site join mob virtually run eventually become leader innate sense industrialism manipulation determination become rich important man trick use people major theme tale place construction problem urbanization construction term use describe attempt make portray rest rest world important global host result sell history culture architecture people publication coincides historically era place construction preparation second theme problem urbanization make uncomfortable expensive place live only area develop happen reality speculation selective renovation occur history develop time become congest costly lead construction low quality housing instead develop social class poor displace result rich become rich poor become poor middle class even fictional base historical fact make dazzle piece literature learn still entertain recommend anyone visit contain everything need wonderful work take place translated publish open protagonist live board house run father help job anarchist group run begin hand flier promote group job begin foot door change job begin hair product fair soon become arm dealer work way mob finally end movie business buy mansion acquire wealth happy always want lead great escape constant desire support story theme power greed money always want never satisfy leave home search job money then job always try make much profit possible even people want kill always focus money believe money come power acquire money class outsider wish accepted society part inner circle major theme story development space culture social distinction reality describe historical fact incorporate fictional character expand begin divided sector begin expand class establish lower class distinguish certain area barcelona emphasis urban development parallel time frame urban development anyone interested good leisure many relevant topic culture tell intriguing story overall good highly recommend translate brilliant enjoyable historical fiction first publish become best seller internationally chronicle economic journey year first recent stretch time go poor nearly homeless anarchist become wealthiest man way find occupied various job range thievery weapon trafficking also encounter several different people include future business partner giant lover ugly maid most importantly equate life similar situation take place time accurate history date location fiction character central theme power greed encounter quite frequently start poor homeless boy desperate work however plot unravels discovers knack manipulate people take advantage opportunity come way exemplification manipulation also evident directly parallel relationship woman exploitation woman metaphor use love woman benefit use gift excel business richest powerful capitalist never satisfy position life business pleasure greed eventually lead several people include former lover friend family member end realize life never fulfil uncontrollable highly recommend anyone especially people interested contains several detailed description geographical historical feature intriguing plot edge seat look interest enjoyable excite perfect choice fictional write follow adventure trial poor country boy live progress goal become wealthy powerful immediately arrival move board house meet owner mysterious daughter dishearten prospect never find work new acquaintance get job fellow anarchist work campaign begin long string various job help wealth occupation include hand anarchist pamphlet sell hair oil selling steal merchandise work way mob film making reach goal become wealthy well know figure rarely think family father constant disappointment continually long power money never seem find contentment deal several main theme include money power follow development place different ruler even discuss different class distinction try emerge important global continue poor problem continue harbor power also become central part life never happy amount money control obtain theme place money power continue develop follow development end come interesting twist surprise typical still interest contains great deal information long description geography historical reference parallel novel character use strange attraction yet horrible treatment woman represent different part relationship represent treatment lower class disregard space later relationship wife represent treatment upper class need gain wealth involvement young girl show abuse middle class space follow develop prep parallel change make time novel publication background necessary try many reference make geography history give understanding keep interested constantly change life reader translate depict story fictional character also cover fact historic event geography copyright year however translate copyright main character audience see always use power benefit display reoccurring theme main character greed concept people power corrupts person come story reader observe life main character learn power eventually gain take place first move young age thirteen earn money work tedious job distribute pamphlet steal product sell war weapon work mobster job becomes accomplish business man create way manipulate others gain fortune use trickery murder fellow order receive desire true experience business world personal life view object affection obsession still always find wanting depicts life young man change way reversal fortune display reoccurring theme main character greed concept people power corrupts person come path explain theme reader watch become successful life grows greedier use power corrupt manipulate people connect woman friend never content life depict life young man change way reversal fortune desire learn culture history certainly do colorful tale late early captivated audience world unravels mesmerize story touch entice theme include anarchism political corruption influence money cynical manipulation power course sexuality romance constant reference governmental corruption prostitution large insight way old follow time arrive adolescent development entrepreneur become lead reader feel sorry antihero emotional struggle fail father consistently bad relationship discovers first world fair decade achievement story wind end second world fair come start quest make money fall long list job include distribution anarchist pamphlet smuggle arm war develop silent movie industry eventually interesting part parallel life development turn build fortune reconstructs everything time time undergoes similar renovation change preparation beautification old structure grow matures expand develop suffer personal blow relationship undergoes painful corruption detrimental heart undeniable comparison lead history lesson weave fiction character live reality triumph failure lie turn end leaf want definitely disappointment originally prodigious write translate fictional incorporate event spanish history begin late nineteenth century end revolves character move adolescent search wealth new experience stay board house meet become obsessed owner daughter play important role due recur love affair persistence illustrate unable find work receives aid begin work anarchist group even rather apathetic towards politics illegal dealing connection influential individual eventually gain wealth power abandon idealistic anarchist principle learn earlier cunning manipulative desperate power becomes involve numerous moneymaking activity allow rise rank political structure full corruption transformation treacherous power monger system corruption politics play major role most theme deal politics repression industry effect division social class accumulation wealth power show character influence example disparity nobility common people repeatedly show inability climb top social ladder matter much money gain still look nobility also show different aspect politics involved anarchist group later becomes tie wealthy powerful individual oppose anarchist progression rung society represent different side advancement numerous stage work also emphasize extensive restoration renovation turn twentieth century form link intense urban development take place publish also reveal major flaw human nature relate greed corruption flow extremely well intriguing mix flashback foreshadow history fantasy reader especially interest spanish culture history politics publish translate accurately portray eye young man grow dominate force together start prepare host first come young country boy find shelter rickety board house wife wretched daughter grow frighten obsession work hard point help get job anarchist friend send construction sight distribute anarchist pamphlet learn trick trade avoid police start find success corrupt illegal activity site meet become long time right hand man gigantic man accompany many journey hand pick bos work several year time intelligence charm help way top mob overthrow major mob become head gang also fall love much younger marry kid become quickly bore wife marriage many year lie hit men corruption decide get business venture area attempt movie business bring money able reconnect first female obsession star movie time prepare make final extravagant attempt accept main theme social acceptance want accepted exclusive inner circle high society matter much money never totally accepted due lack nobility poor background example coordinate sponsored arrival elegant dinner dinner allow sit next even pay entire event addition show money power greed never lead true happiness theme see grow change successful man also grow change dominate example job take hope make richer powerful accept elite thing hope become richer powerful thus gain acceptance world elite anyone story believe deserve award receive create interesting story line place fictional character historical setting also anyone interested great way learn read boring informational text criticism writing style little difficult follow time example person concentrate part story quickly switch different part however twist turn positive attribute keep interested overall impress immensely fell character enjoy plot line time learn exciting write native important novel contemporary spanish literature write translated set year chronicle life corrupt businessman early teen move small farm hop get rich find place live shabby boardinghouse become obsessed owner daughter awkward girl name find first job distribute anarchist pamphlet site several random scheme arm smuggle land speculate film produce become wealthiest man help monstrous buddy meet use violence work way top reach dream rich powerful quite important theme important money power bring young boy family practically money make goal much money possible finally realize money literally everything money able wield power manipulate business deal woman urban space theme similarities character treat woman treat extremely poorly act right also similar growth grow expand empire also parallelism renovation mansion urban development idea urban renovation development also link write publish midst intense preparation game well write well developed intrigue however seem effect lose translation definitely especially interested history culture", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Eduardo Mendoza's extraordinary novel fictionalises the teeming life of the city between the Universal Expositions of 1888 and 1929.\r\n\r\n\"The traveller who comes to Barcelona for the first time soon notices where the old city ends and the new begins. The streets become straight and wide instead of winding: the pavements, less crowded; tall plane trees shade them pleasantly; the buildings are more distinguished … another city.\"", "asin": "0671702343", "rank": "1493560", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51G--RqvLeL.jpg", "country": "Spain", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}