{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 18.4801972, "ratings": {"num_ratings": 37, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "The book is a great look into Haitian history and should be read by anyone who wants to learn about Haitian history."}, {"review_sentiment": 5.0, "review_text": "Started reading and love this book"}, {"review_sentiment": 5.0, "review_text": "Historically fluent literature. Wonderful read."}, {"review_sentiment": 4.0, "review_text": "This book was extremely readable and had much insight into the revolution, its personalities and the culture behind it. My only very small complaint is that it felt at times as if events weren't getting the details they deserved. That's a nitpick and probably a conscious decision by the author to keep the book moving. I highly recommend this."}, {"review_sentiment": 5.0, "review_text": "Excellent source for an undercovered subject"}, {"review_sentiment": 5.0, "review_text": "Very good product i love it"}, {"review_sentiment": 5.0, "review_text": "Excellent reading.  Could hardly put it down."}, {"review_sentiment": 2.0, "review_text": "Fair enough"}, {"review_sentiment": 5.0, "review_text": "Well written history of the Haitian Revolution, foundational to the American Civil War and to other Latin America revolutions."}, {"review_sentiment": 5.0, "review_text": "Excellent book. The topic was concise and well presented be the author. The entire book just flowed seemlessly. It is rare to find any historical literature as well presented to the point where the book was truly a \"page turner\". While the topic is very painful, it was so well written i thanked my lucky stars for finding this book.  Very well done Mr. Dubois. Im now reading another book by this author."}]}, "authors": ["Laurent Dubois"], "isbn": "0674018265", "longitude": -69.942111, "periods": ["1700s", "1800s"], "title": "Avengers of the New World: The Story of the Haitian Revolution", "word_cloud": "great look history anyone want learn history start reading love historically fluent literature extremely readable much insight personality culture small complaint felt time event get detail deserve nitpick probably conscious decision author move highly recommend source under covered subject very good product love excellent reading hardly put enough well write history foundation revolution topic concise well present author entire flow seamlessly rare find historical literature well present point truly page turner topic painful well write thank lucky star find very well do read author", "genres": ["History", "Politics"], "summary": "The first and only successful slave revolution in the Americas began in 1791 when thousands of brutally exploited slaves rose up against their masters on Saint-Domingue, the most profitable colony in the eighteenth-century Atlantic world. Within a few years, the slave insurgents forced the French administrators of the colony to emancipate them, a decision ratified by revolutionary Paris in 1794. This victory was a stunning challenge to the order of master/slave relations throughout the Americas, including the southern United States, reinforcing the most fervent hopes of slaves and the worst fears of masters.\r\n\r\nBut, peace eluded Saint-Domingue as British and Spanish forces attacked the colony. A charismatic ex-slave named Toussaint Louverture came to France's aid, raising armies of others like himself and defeating the invaders. Ultimately Napoleon, fearing the enormous political power of Toussaint, sent a massive mission to crush him and subjugate the ex-slaves. After many battles, a decisive victory over the French secured the birth of Haiti and the permanent abolition of slavery from the land. The independence of Haiti reshaped the Atlantic world by leading to the French sale of Louisiana to the United States and the expansion of the Cuban sugar economy.\r\n\r\nLaurent Dubois weaves the stories of slaves, free people of African descent, wealthy whites, and French administrators into an unforgettable tale of insurrection, war, heroism, and victory. He establishes the Haitian Revolution as a foundational moment in the history of democracy and human rights.", "asin": "0674018265", "rank": "204644", "city": "Santo Domingo", "image": "https://images-na.ssl-images-amazon.com/images/I/51-ITLIs4hL.jpg", "country": "D.R.", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}