{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 48, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "Wish it was better. New Orleans is a compelling city that's alive and vibrant. Unfortunately, this book of it's early history reads too droll, like a history text book and loses a lot of the charm. There are some great things that are learned and occasionally it comes to life, but not often enough. I suspect there is a better history of the early New Orleans out there to be fund or written. This is a city filled with characters and drama. It needs a writer with a flair for painting pictures and a sense of adventure to bring it to life. This isn't it."}, {"review_sentiment": 5.0, "review_text": "Shortly after hurricane Katrina, an intelligent friend in Baltimore where I currently live seriously questioned the wisdom of not totally abandoning the city of New Orleans for a safer location.  As a native of the crescent city and with numerous relatives dating back to the mid nineteenth century now residing in Greenwood Cemetery, I attempted to argue for the importance and logic of keeping the city just where it is.  I now wish I had read this book prior to that conversation.  Unlike any other major city on the continent, New Orleans must be located where it is not only because of its geography, but in spite of its geography.  This book delves deep into this fascinating paradox while providing a heck of an entertaining read.  Whether you are a life long resident or a convention visitor, this book will give you a wonderful insight into what makes New Orleans what it is - what makes it tick. Buy the book. Read it. You will never look at the city the same way again."}, {"review_sentiment": 3.0, "review_text": "Had its highlight, but I lost interest at times, but then came back for more interesting facts.Read more like a textbook instead of topical history storybook."}, {"review_sentiment": 5.0, "review_text": "Powell writes with clarity and a clear respect and affection for the city and its history. Though I came to it with some knowledge of the subject, there were many surprises - all well-documented- along the way. The richness of the city's history and the people (known and not) who made it are brought out in such a way as to make you want to read further. This is an elegant yet accessible (in the best sense of the word) resource. Outside of Louisiana little attention is paid to the pre-Purchase events, so this fills an important gap. The city is fascinating now, and here we see the roots of it all."}, {"review_sentiment": 5.0, "review_text": "If you like New Orleans it is a must read."}, {"review_sentiment": 3.0, "review_text": "Complete history of New Orleans and the development of its society.  However, a little superficial and dull."}, {"review_sentiment": 4.0, "review_text": "A fascinating read about the origins of the city, but it should be"}, {"review_sentiment": 5.0, "review_text": "Excellent Read"}, {"review_sentiment": 4.0, "review_text": "It was like traveling through history.  Loved it!"}, {"review_sentiment": 4.0, "review_text": "I appreciated the historical perspective this book gave me about da N.O. It begins with the establishment of New Orleans by the French, then continues with the Spanish purchase, slavery and more. Corruption and a relaxed, free way of life was always a part of New Orleans and this book tells you how it all began."}]}, "authors": ["Lawrence N. Powell"], "isbn": "0674725905", "longitude": -90.0701156, "periods": ["1800s", "1900s", "2000s", "Recent Releases"], "title": "The Accidental City: Improvising New Orleans", "word_cloud": "better compelling city alive vibrant unfortunately early history read droll history text lose lot charm great thing learn occasionally come life often enough suspect better history early fund write city fill character drama need writer flair paint picture sense adventure bring life shortly hurricane intelligent friend currently live seriously question wisdom totally abandon city safer location native crescent city numerous relative date back mid nineteenth century reside attempt argue importance logic keep city wish prior conversation major city continent locate geography spite geography delve deep fascinating paradox provide heck entertain life long resident convention visitor give wonderful insight make make tick never look city way highlight lose interest time come back interest textbook instead topical history storybook write clarity clear respect affection city history come knowledge subject many surprise way richness city history people know make brought way make want elegant yet accessible best sense word resource little attention pay event fill important gap city fascinate see root like complete history development society however little superficial dull fascinating origin city excellent travel history love appreciate historical perspective give da begin establishment french continue spanish purchase slavery relax free way life always part tell begin", "genres": ["History"], "summary": "America's most beguiling metropolis started out as a snake-infested, hurricane-battered swamp. Through intense imperial rivalries and ambitious settlers who risked their lives to succeed in colonial America, the site became a crossroads for the Atlantic world. Powell gives us the full sweep of the city's history from its founding through statehood.", "asin": "0674725905", "rank": "361254", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51Oy430JRhL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}