{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 4, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Absolute Must Read. Now more than ever."}, {"review_sentiment": 5.0, "review_text": "Excellent portrayal of all of the reasons that in fact the trial could not deal with a true sense of justice.The crimes were so heinnous that the penal code was inadequate to address them.The prosection's hands were tied and a mere 6500 were charged. It was too little too late.S.J.Tagliareni author of Hitler's Priest"}, {"review_sentiment": 5.0, "review_text": "Wittman shows us the imperfections of the young West Germany, struggling to come to grips with an awful and recent past. One might reasonably wonder why the trial took place as late as 1963-5, when the war ended in 1945. Of course, in the immediate war years, the Allies conducted the Nuremburg trials, and West Germany as an independent country did not yet exist. But by the early 1950s, it did. Surely this trial could have started then.Yet, as Wittman describes, many difficulties were encountered by the West German prosecutors, which probably helped push the trial date to into the 60s. They appear to have done a conscientious job. But they faced many constraints. Some of which was the sheer mass of evidence that surfaced as they prepared for trial. Insufficient resources seem to have been provided to them. Which led to only 20 defendents being put on trial in 1963, instead of the original 800 investigated.The worst constraint was simply the use of a criminal code that was largely taken from pre-war years, and which simply proved inadequate in the face of the enormity of the crimes.The title of this book is Beyond Justice. Far too restrained. Wittman's analysis makes it clear that a better title would have been Justice Denied."}, {"review_sentiment": 4.0, "review_text": "I was very impressed with this book, my Uncle was on Trial in this Book, and was pleased with plenty of New Information that I didnt have, I was also impressed about the details of the Times in the Camps, and about the Officers & NCO's etc. I read also the deeds that some things my Uncle did, I am not ashamed on what happened, as I look at it that it all was part of the war, and with this book, I am shown what happened Good & Bad.Rebecca Wittman must be praised on this Excellent publication, and hope she will continue to excell in her future Works.Too my Late Uncle Hans, I will always remember your plight and never will Judge you.Just wished I could have meet you in my Life time. RIP"}]}, "authors": ["Rebecca Wittmann"], "isbn": "0674063872", "longitude": 0.0, "periods": ["1900s"], "title": "Beyond Justice: The Auschwitz Trial", "word_cloud": "now ever excellent portrayal reason fact true sense crime heinous penal code inadequate address prosecution hand tie mere charge little author pittman show imperfection young struggle come grip awful recent reasonably take place late war end course immediate war year conduct trial independent country yet exist early surely many difficulty encounter west german prosecutor probably help date appear do conscientious job face many constraint sheer mass evidence surface prepared resource seem provide lead defendant put instead original worst constraint simply use criminal code largely take year simply prove inadequate face enormity title restrain analysis make clear better title impress please plenty dint also impress detail etc also deeds thing ashamed happen look part war show happen good praise publication hope continue excel future always plight never wish time", "genres": ["History", "WWII", "Politics"], "summary": "In 1963, West Germany was gripped by a dramatic trial of former guards who had worked at the Nazi death camp Auschwitz. It was the largest and most public trial to take place in the country and attracted international attention. Using the pretrial files and extensive trial audiotapes, Rebecca Wittmann offers a fascinating reinterpretation of Germany's first major attempt to confront its past.\r\n\r\nEvoking the courtroom atmosphere, Wittmann vividly recounts the testimony of survivors, former SS officers, and defendants--a cross-section of the camp population. Attorney General Fritz Bauer made an extraordinary effort to put the entire Auschwitz complex on trial, but constrained by West German murder laws, the prosecution had to resort to standards for illegal behavior that echoed the laws of the Third Reich. This provided a legitimacy to the Nazi state. Only those who exceeded direct orders were convicted of murder. This shocking ruling was reflected in the press coverage, which focused on only the most sadistic and brutal crimes, allowing the real atrocity at Auschwitz--mass murder in the gas chambers--to be relegated to the background.\r\n\r\nThe Auschwitz trial had a paradoxical result. Although the prosecution succeeded in exposing SS crimes at the camp for the first time, the public absorbed a distorted representation of the criminality of the camp system. The Auschwitz trial ensured that rather than coming to terms with their Nazi past, Germans managed to delay a true reckoning with the horror of the Holocaust.", "asin": "0674063872", "rank": "1670233", "city": "Auschwitz", "image": "https://images-na.ssl-images-amazon.com/images/I/41PC--0arcL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}