{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 3, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "It shed light on the social tension in Montreal. It states the importance of  knowledge of various cultures and languages​. Specifically  the French and English."}, {"review_sentiment": 4.0, "review_text": "Basilieres' black comedy has a strong humorous start. The Grandfather, who is a career grave robber, hits the frost line while trying to dig up his latest corpse and proclaims the \"season\" (the grave robbing season) over. A visit to a funeral home to pay respects to his daughter-in-law's deceased father offers another brilliant comedic moment, on par with Stephen Leacock's famed visit to a bank.Unfortunately, the comedy gives way too often for Basilieres' personal exposition on separatism and French/English relations which seem artificially hammered into the narrative. In that, he offers little new in the debate.He also seems to play a bit too much with the history of the October Crisis and ends up confusing the reader familiar with Quebec history. The book starts off before the Laporte/Cross kidnappings. Basilieres' then introduces a PQ premier who you assume is Rene Levesque. Since Levesque took power during the late '70s, you assume the author has moved up the story in time. But apparently not. We're still back in 1970 although Robert Bourassa, leader of the Liberal party, was actually the premier at that time. Unfortunately, what started as a novel that promised a hard biting tact and a dark humor that holds nothing as sacred suddenly begins to look like an author pulling his punches. Kudos, however, to Basilieres' for working into the story the theft of Brother Andre's heart, which actually took place in 1973.Despite these short comings, it's a rather good read."}, {"review_sentiment": 5.0, "review_text": "Crafting a delightfully macabre comic novel incorporating nods to PQ premier/homicidal motorist Rene Levesque, faith healer Brother Andre, dastardly doctor Ewan Cameron (of \"In the Sleep Room\" fame) and the October Crisis is not an easy task, but Michel Basilieres pulls it off with great aplomb. It's hard to see how Basilieres will top this stunning first novel, but until he does \"Black Bird\" provides much to entertain the erudite reader, and should particularly amuse those familiar with Montreal's geography and history. Highly recommended."}]}, "authors": ["Michel Basilieres"], "isbn": "0676975283", "longitude": -73.6103642, "periods": ["1900s", "Recent Releases"], "title": "Black Bird", "word_cloud": "shed light social tension state importance knowledge various culture french basilieres comedy strong humorous start career grave robber hit frost line try dig latest corpse proclaims season grave rob season visit funeral home pay respect decease father offer brilliant comedic moment par famed visit comedy give way often personal exposition separatism relation seem artificially hammer narrative offer little new also seem bit much history end confuse familiar history start kidnapping introduces premier assume take power late assume author move story time apparently still leader party actually premier time unfortunately start promise hard bite tact dark humor hold nothing sacred suddenly begin look author pull punch however basilieres work story theft heart actually take place short coming rather good craft delightfully macabre comic incorporating nod motorist faith healer dastardly doctor fame easy task pull great hard see stun first provide much entertain erudite particularly amuse familiar geography history recommend", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "With comic brilliance and a delight in the macabre, Michel Basilières holds a fun-house mirror up to a defining moment in Canadian history and reveals, among other things, a family having a very bad year. \r\n\r\nHoled up in a shambling house at the base of Mount Royal is the family Desouche: three generations of English- and French-Canadians caught in the gears of a national emergency. Their world is dark and hard, but alive with hope and expectation. When one of the eldest, an Anglo Montrealer, dies at the hand of one of the youngest, a militant separatist, so begins a year of turmoil and change that culminates in the October Crisis.\r\n\r\nGrave-robbing Grandfather consorts with prostitutes and mad scientists, loses an eye and gains a new vision. His disenchanted wife bonds with his canny pet crow. Mother sleeps her grief away through the seasons, while Father ineffectively schemes to get rich quick. Meanwhile, their twin children, Marie and Jean-Baptiste, find their personal ambitions clashing with their public actions as they derail each other at every turn.\r\n\r\nIn this wholly original novel alive with misfortune and magic, Michel Basilières uncovers a Montreal not seen in any other English-Canadian novel: a forgotten blue-collar neighbourhood in between the two solitudes. Gothic, outrageous, yet tender and wise, Black Bird is as liberating as the dreams of its wayward characters, and as gripping as the insurgencies that split its heart.\r\n", "asin": "0676975283", "rank": "4903249", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/51VcC5Wtv3L.jpg", "country": "Canada", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}