{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 607, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I listened to the audible version and I loved it. The narration was excellent. The plot was really good. The characters were enjoyable. I liked how the book ended. I won't say how it ended, to avoid spoilers, but I was very pleased by how Sam Spade handled the situation. It was not what I expected."}, {"review_sentiment": 5.0, "review_text": "Classic noir."}, {"review_sentiment": 5.0, "review_text": "I loved this book so much that I read it twice.  There is something so intriguing and nostalgic about reading a book that was written by a man born in my own state of Maryland who became one of the greatest detective crime writers who left school at age 14.The Maltese Falcon by Dashiell Hammett is a character-driven story with the been-around-the-block-more-than-once detective, Sam Spade, the driving force in the search for an \"ornament\" of great value.  Sam talks about the truth a lot, because many of the book's characters have a problem with it, but Sam has no problem using his fists to give a lesson about truth and other important concepts.  Sam's wisecracks add that much more to his personality.Hammett's characters' names add to their personalities and descriptions as with Joel Cairo who is from somewhere in the vicinity of Egypt.  The dialogue is sharp, witty, and dangerous.  This cast of characters is one of the most memorable that I will not soon forget."}, {"review_sentiment": 1.0, "review_text": "I can't believe this is a classic!!!  It was poorly written and a stupid plot..if there was less than one star I would mark it..."}, {"review_sentiment": 5.0, "review_text": "Probably the best detective novel I’ve ever read.  It raises questions about sexuality, homosexuality, relationships between women and women, men and women, and asks where is the line between the corrupt and morality, not to mention a distrust of authority and questions of what is right vs. what is wrong.  A great literary novel."}, {"review_sentiment": 5.0, "review_text": "The old crime novels are the best. Description makes you use your imagination"}, {"review_sentiment": 5.0, "review_text": "book was in perfect condition,and arrived when it was said it would. Couldn't ask for more."}, {"review_sentiment": 5.0, "review_text": "Well written old fashion detective story. Keeps you reading"}, {"review_sentiment": 5.0, "review_text": "Wonderful book.  Amazing adaptation into a movie with Humphrey Bogart."}, {"review_sentiment": 5.0, "review_text": "The Maltese Falcon [Blu-ray] played by Humphrey Bogart is a story and a character we believe we know pretty much by heart. What’s the point of reading the novel, especially when the film does such a good and true job of capturing the book? Well, Brigid O’Shaughnessy has red hair, not Mary Astor’s dark brown. Minor, yes, especially in black and white, but you get the point. No matter how true the film adaptation, there will always be differences, sometimes minor, sometimes substantial, between the original and the interpretive copy. And therein lies the biggest reason for reading the book, particularly if you liked the movie.What you see on your screen when you view The Maltese Falcon is director John Huston’s interpretation of the Hammett’s text. While Huston renders the book quite exactly, it remains that he colors it to match his vision. Really, can it be any other way? Bogart does a terrific job of capturing most aspects of Sam Spade’s character, which swings from backslapping, to brooding, to amorous, to brutally aggressive, to cunning, to dumb, to nearly always manipulative. Which aspect of Spade’s character dominates? Maybe you can discern this from the film; maybe you’d be better able to understand Spade’s true nature by reading Hammett’s words; or maybe, eh, who cares. Perhaps you’d like to read somethings that never made it onto the screen. The novel has some strong sexual content, given how many of us filter the past through a lens of greater comity. Hm, people will be people, today, in the Middle Ages, and in 1929, when The Maltese Falcon published.Then there is the pure satisfaction of reading Hammett’s writing, his descriptions, his superb dialogue, and his steady pacing of plot revelations and twists. The dialogue here is the best. Yes, you will find some words and syntax peculiar to the time, but what makes Hammett’s dialogue outstanding, and serves as a lesson to budding writers, is how these define the character, define them better than any wordy description can. And there’s no better example than that of the Fatman, Kasper Gutman, delivered brilliantly by Sidney Greenstreet in the film. Essentially, Gutman’s the jolly fat man, until he releases his ruthless side, jolly too, but potentially deadly. Huston smartly transferred most of Hammett’s dialogue to film. Still, it pays to read the words for yourself to see how Hammett uses them to create character or change mood. It’s the syntax that truly defines the character of Gutman and everybody else in the novel.So, if you enjoyed the movie and wonder why you would want to read the book, here’s why: Reading the book will increase immensely your enjoyment of the movie, and viscera."}]}, "authors": ["Dashiell Hammett"], "isbn": "0679722645", "longitude": -122.4192363, "periods": ["1900s"], "title": "The Maltese Falcon", "word_cloud": "listen audible version love narration excellent plot really good character enjoyable like end end avoid spoiler please handle situation expect classic nor love much twice something intriguing nostalgic reading write man bear state become greatest detective crime writer leave school age story detective drive force search ornament great value talk truth lot many character problem problem use fist give lesson truth important concept wisecrack add much character name add personality description somewhere vicinity dialogue sharp witty dangerous cast character memorable soon classic poorly write stupid le star probably best detective ever raise question sexuality homosexuality relationship woman woman men woman asks line corrupt morality mention distrust authority question right wrong great literary old crime novel best description make use imagination perfect condition arrive say well write old fashion detective story reading wonderful adaptation movie play story character believe pretty much heart point read especially film good true job capture red hair dark brown especially black white get point matter true film adaptation always difference sometimes minor sometimes substantial original interpretive copy therein lie biggest reason read particularly like see screen view director interpretation text render quite exactly remain color match vision way terrific job capture aspect character swing backslapping brood amorous brutally aggressive cunning dumb nearly always manipulative aspect character dominate maybe discern film maybe better able understand true nature read word maybe eh care perhaps somethings never make screen strong sexual content give many filter past lens greater comity people people today age pure satisfaction read write description superb dialogue steady pacing plot revelation twist dialogue best word peculiar time make dialogue outstanding serf lesson bud writer define character define better wordy description better example deliver brilliantly film jolly fat man release ruthless side jolly potentially deadly smartly transfer dialogue film still pay word see use create character change mood syntax truly defines character everybody else enjoy movie wonder immensely enjoyment movie viscera", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A treasure worth killing for. Sam Spade, a slightly shopworn private eye with his own solitary code of ethics. A perfumed grafter named Joel Cairo, a fat man name Gutman, and Brigid O’Shaughnessy, a beautiful and treacherous woman whose loyalties shift at the drop of a dime. \r\n\r\nThese are the ingredients of Dashiell Hammett’s coolly glittering gem of detective fiction, a novel that has haunted three generations of readers.", "asin": "0679722645", "rank": "29958", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51y-b2K90FL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}