{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 44.8178131, "ratings": {"num_ratings": 16, "rating": 3.4, "reviews": [{"review_sentiment": 2.0, "review_text": "This was a struggle from start to finish.  The pointless crossword puzzle gimmick, the scrambled chronology, and multiple characters with the same name, as well as the author's clotted style, made reading it hard work.  And I still didn't get quite a bit of it.  There are brilliant moments and passages if you detach them from context.  Overall, though, I didn't enjoy it."}, {"review_sentiment": 5.0, "review_text": "I was initially attracted to this book by a  favourable review from the late Angela Carter, other than trusting her judgement I really had no idea what I was in for.Think 'One Hundred years of Solitude' or anything Marquez for that matter. Magic realism at its extraordinary, titillating best, a work to be read slowly, put aside, then read again after a period of digestion.Perhaps not for everybody but it certainly worked for me."}, {"review_sentiment": 1.0, "review_text": "I was quickly bored."}, {"review_sentiment": 5.0, "review_text": "A very interesting book by Pavic. With his twisted style he offers different ways to read the history and interlace bit a bit each chapter to a twisted and complex history. His main character develops a complex change in his lifetime and the other character, his wife, is sometimes so complex that is difficult to track. At the end you (the reader) actively interfer in the outcome."}, {"review_sentiment": 4.0, "review_text": "The book is great...very engaging and as poetic as it's title suggests. I read a lot and thsi rates among the most enjoyable."}, {"review_sentiment": 3.0, "review_text": "The author has a rare and indeed quite incredible imagination. The book, for all its endless side motives, is actually enjoyable. However,  I simply started laughing at the book after crossing page 200 or so.After a certain point, the writing is becoming too much of the same. It becomes obvious that feeling that this book could potentially go on forever. I think you should feel free to stop any time. You can even come back to it any time. It might also wear you out. I am really surprised at the popularity of this book -  I expected more people who wouldn't be able to stand it.The act of reading of this polyphonic prose is quite exhausting and requires serious concentration and effort. I don't mind challenges but I think that reading shouldn't be THAT challenging.I am not sure if I am interested in more of Pavic. Gifted but completely unpredictable, he is one of the writers that  don't know moderation."}, {"review_sentiment": 4.0, "review_text": "Milorad Pavic's writing is absurd, amusing, and fantastical in the magical realism tradition. It is also poetical and aphoristic, \"Some women cannot manage a house and theirs are always in disarray. Others cannot manage their own souls and these are in disarray. Things have to be straightened up at the right time; afterward is too late. Because any similarity between the house and the soul ceases in that afterward. Vitacha obviously did not know that\" (p. 164). Vitacha, the heroine of Landscape Painted with Tea, has a very tumultuous life in East Central Europe. The stories of Vitacha and her second husband Atanas Svilar, later Atanas Razin, form the backbone of this book. But what is most engaging for the reader about this , and perhaps all of Pavi''s writing is the format. Book One is a mostly continuous story. Book Two is \"A Novel for Crossword Fans.\" Two small crossword puzzles are given with clues. Each of the following chapters are entitled by number and direction according to the crossword puzzle. The solution to the crossword puzzle corresponds to the words composing the index (reordered of course). Due to the structure of the novel the reader is free to read in a variety of orders, and as with choose your own adventure stories, the ending is entirely dependent on the reader!"}, {"review_sentiment": 4.0, "review_text": "I have read most of Pavic's novels, in beautiful Russian translation which is reasonably close to the original Serbian. This is very far from his best work. Pavic is good at weaving anecdotes and short stories into brief and highly original novels, as in \"The Khazar Dictionary\" which gained him an international following. However, in \"A Landscape...\", by far his longest novel, the strategy fizzles. The anecdotes and digressions drag on and don't lead anywhere, the threads come undone. The last 100 pages fall apart completely. Pavic has run out of steam with this one, writing far more pages than he is capable of piecing together."}, {"review_sentiment": 4.0, "review_text": "As exceptional Serbian author, Milorad Pavic always says, \"The future always starts from the large intestine.\"  This may be taken as either prophecy or advice.  In either case, you should begin the rest of your future by getting ahold of this novel.  Of course, as he says, \"Whoever wants the second half of life has to remain in the first half of everything else.\"  Let's hope this does not mean your large intestine.  But if we concentrate on Pavic' story, rather than on his aphorisms, I think we can quickly conclude the dude is a genius, though one who is not easily understood.  What can we say about a heroine who falls in love with you, the reader ?  The protagonist with several pasts has several futures too.  He is a Yugoslav architect whose designs are never built, but in one future he builds exact replicas of Tito's luxury palaces in the New World.  His father was a Yugoslav soldier who disappeared in Greece, or else he was a Russian mathematician who could shovel snow extremely well.  The hero winds up extremely rich, but lonely.  Or maybe lonely, but extremely rich.  Does it have to do with those people who like to work in sync with others or those who prefer to be lone wolves ?  Pasts intersect and divide, the future is over though it hasn't started either.  Yes, you will dig the leaping non-sequiturs that lead to larger truths or else you will be left scratching your head.  Hey, if you always admired Bob Dylan's great songs like \"Subterranean Homesick Blues\" or if you found Dali's paintings intriguing, you are going to grok this novel in all its fullness.  If however, you want a linear, conventional book, forget this one completely.\"All readers of this book are entirely imaginary.  Any resemblance to actual readers is coincidental.\"  M. Pavic  So be warned.When I was very little, I had a small purple stone which I swallowed.  I never let on to anyone.  I felt purple inside.  So when I saw a purple stripe on the cover of this book in the library, I knew I would either read it or eat it.  Now I can't remember what happened, but as a character exclaims in LANDSCAPE PAINTED WITH TEA, \"In sleep, one doesn't age.\"  The same is true with volumes in your stomach.  Or was that `brain' ?  You can read this book like a crossword puzzle---literally.  The author took great pains in its construction, which recalls (Argentine author) Julio Cortazar in some bizarre way.  I read the novel in the conventional fashion (or I ate it with a knife and fork) not because I have a stolid or military personality, as Pavic would claim, but because I admire turtles, who always take the shortest route to the pond.  The Tajiks say that eels never swim towards the sun.  The readers of this book will not wind up enlightened either, but they will be delighted by the author's wit and imagination.  Or they will get a stomach ache."}, {"review_sentiment": 5.0, "review_text": "It's difficult to comment on this book because this is a book that almost defies comment.  One has simply read it...or one hasn't.  It is the lucky one who has.In this lyrical and playful novel, Milorad Pavic tells the story of Belgrade architect, Atanas Svilar and his journey through life, a journey he hopes will answer the question, \"why had his life been barren and futile, despite the enormous effort invested?\"His journey leads him to an ancient monastery on Mount Athos in Greece, that holy mountain reserved for men, a mountain where no woman has set foot for centuries, the mountain where Atanas' father disappeared during World War II.Since Atanas doesn't find all he is seeking on Mount Athos, in Book Two, he abandons his family, changes his name to Atanas Fyodorovich Razin and moves to the United States with the beautiful Vitacha Milut.  There, something goes his way at last, and he becomes wealthy, at least in a material sense.Like Pavic's first book, \"Dictionary of the Khazars,\" \"Landscape Painted With Tea,\" is a playful enterprise containing chapters that can be read \"down\" or \"across,\" much in the same way a crossword puzzle is read.  The person who solves the solution to the ultimate puzzle is said to have the key to the solution to the puzzle of life.  While I didn't find the key to life in these pages, I did find fun and enjoyment, and, not surprisingly, quite a bit of beauty.  So much so that I'm recommending the book to all of my friends.If stark realism is what you enjoy, you'd probably be better off skipping this book.  Those who love writers who can spin magic with words, who are playful and inventive as well as creative, will no doubt love \"Landscape Painted With Tea\" as much as I did.  \"Dictionary of the Khazars\" made me a Pavic fan; \"Landscape Painted With Tea\" has simply cemented my admiration for this playful and inventive author."}]}, "authors": ["Milorad Pavic"], "isbn": "0679733442", "longitude": 20.4568974, "periods": ["1900s", "0-500s"], "title": "Landscape Painted with Tea", "word_cloud": "struggle start pointless crossword puzzle gimmick scramble chronology multiple character name well author clot style make read hard work still quite bit brilliant moment passages detach context enjoy initially attract favorable review late trust judgment really idea year anything matter realism extraordinary titillating best work slowly put aside period everybody certainly work quickly bore interesting twisted style offer different way history interlace bit bit chapter twist complex history main character develop complex change lifetime character wife sometimes complex difficult track end actively interfere outcome great engaging poetic title suggest lot this rate enjoyable author rare indeed quite incredible imagination endless side motif actually enjoyable however simply start laugh cross page certain point write become much become obvious feeling potentially forever think free stop time even back time also really surprise popularity expect people able act read polyphonic prose quite exhaust require serious concentration effort mind challenge think read sure interested completely unpredictable writer know moderation write absurd amuse fantastical magical realism tradition also poetical aphoristic woman manage house always disarray manage souls disarray straighten right time afterward late similarity house soul cease afterward obviously know heroine tumultuous life story second husband later form backbone engage perhaps write format mostly continuous story small crossword puzzle give clue follow chapter entitle number direction accord crossword puzzle solution crossword puzzle correspond word compose index reorder course due structure free variety order choose adventure story end entirely dependent novel beautiful russian translation reasonably close original serbian far best work good weaving anecdote short story brief highly original novel gain international follow however far longest strategy fizzle anecdote digression drag lead anywhere thread last page fall apart completely steam writing far page capable piece together exceptional serbian author always say future always start large intestine take either prophecy advice case rest future get hold course say want second half life remain first half everything else hope large intestine concentrate story rather aphorisms think quickly conclude dude genius easily understand say heroine fall love protagonist several past several future yugoslav architect design never build future build exact replica luxury palace father soldier disappear else russian mathematician extremely well hero wind extremely rich lonely maybe lonely extremely rich people work sync others prefer lone wolf past intersect divide future started dig leap lead larger truth else leave scratch head always admire great song find painting intrigue go grok fullness however want linear conventional forget completely reader entirely imaginary resemblance actual reader coincidental little small purple stone swallow never let anyone felt purple saw purple stripe cover library know either now happen character exclaims sleep age true volume stomach crossword author take great pain construction recall author bizarre way conventional fashion eat knife fork stolid military personality admire turtle always take shortest route pond say eel never swim towards reader wind enlighten either delighted author wit imagination stomach ache difficult comment almost defy comment simply lucky lyrical playful tell story architect journey life journey hop answer question life barren enormous effort invest journey lead ancient monastery holy mountain reserve men woman set foot century mountain father disappear find seek abandon family change name move beautiful something go way last become wealthy least material first playful enterprise contain chapter much way crossword puzzle person solve solution ultimate puzzle say key solution puzzle life find key life page find fun enjoyment surprisingly quite bit beauty so much recommend stark realism enjoy probably better skip writer spin magic word playful inventive well creative doubt much make fan simply cement admiration playful inventive author", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "By the author of the highly acclaimed literary bestseller \"Dictionary of the Khazars, \" \"Landscape Painted with Tea, \" Milorad Pavic's second novel, is a tale of mysterious quest that is part modern Odyssey and part crossword puzzle. \r\n\r\nIt begins with the story of a brilliant but failed architect in Belgrade and his search for his father, an officer who vanished in Greece during World War II. The truth about his fate - some of it set in motion 2,000 years ago and some of it by the Nazis - is raveled in the history and secrets of Mount Athos, the most ancient of all monasteries, perched atop its inaccessible mountain on the Aegean.", "asin": "0679733442", "rank": "821437", "city": "Belgrade", "image": "https://images-na.ssl-images-amazon.com/images/I/51JYnPBK5lL.jpg", "country": "Serbia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}