{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": -27.4689682, "ratings": {"num_ratings": 6, "rating": 3.5, "reviews": [{"review_sentiment": 4.0, "review_text": "I had three books I really wanted to read and this was one of them and unfortunately I know I read it too fast. The subtlety's were many and it deserves a slower more thoughtful read than I gave it. What a wonderful writer Malouf is that can punch out something as good as this so quickly. His thoughts must just be worth writing down unedited.I paint so I can really see how Harland managed to be were he was. Without the tag of Artist he would have been deemed nuts and with the obsession of his Art it most likely made him worse than he may have been, doomed one way or the other. I enjoyed the whole book, not all the characters were particularly endearing but the plot and the way we as readers are taken through the family drama's  almost was and it personal so you got involved. There were so many uplifting and generous parts of the book that it created a balance."}, {"review_sentiment": 5.0, "review_text": "This work by Malouf read something like Thomas Wolfe, of whom I'm very fond. It has always been my favorite work by Malouf, despite the fact that several other of his books have been more commercially successful. Lovely characters, setting, plot. Malouf, I think, is a writer's writer, and although I'm not a writer, I do pick up on the little intricacies he does so well. I recommend it to readers who enjoy writers like Wolfe, Cather, and Mansfield."}, {"review_sentiment": 1.0, "review_text": "This book had no depth was irritating to read. It was like reading rambling gossip. The timeline changes and new characters abound then disappear.I have read Maloufs' Ranson and An imaginary Life and both were excellent. This was like reading another author."}, {"review_sentiment": 5.0, "review_text": "The thesaurus is not needed to read this book, but to describe Malouf's work.  There is certainly no single term that can encompass his superb writing abilities.  \"Opulent\" might cover his descriptive powers, but fails to address the strength of Malouf's chronicle of Frank Harland.  \"Gripping\" isn't appropriate to a life so realistically portrayed - with its tumultuous events mixed with the mundane.  Artist Frank Harland is anything but mundane, however.  Raised in a rural, hilly environment, Harland is buffeted by lasting poverty, overborne by deep loyalties to father and brothers, never losing sight of the meaning of \"place.\"  That place is the one-room house of his birth.  No matter how far he strays from that locale, it haunts his life and his paintings.  In the end, he confines himself to the \"Half Acre\" in solitary exile.  What the thesaurus fails to convey for the reviewer, Malouf's own words will keep you embedded in this real life story.This early book presages why many awards are granted Malouf for his writing.  He was the first winner of the IMPAC award, the richest in publishing.  The story of Frank Harland captures the reader from the first page.  His father, an indolent dairy farmer, imparted a sense of story in Frank from his earliest days.  He applies his learning to drawing instead of text, giving a fresh image of his home and its people throughout his life.  Affected by the powers experienced in the hill country, the various intensities of light and shadow, the wonder-generating storms that beset the hills, the flora and fauna encountered, he struggles to impart his feelings to his art.  Using any available medium, Frank paints on wood, cardboard panels, paper or whatever is at hand.  The work gains wide circulation, almost unknown to Frank.  Success and fame are not his aim, however, but getting through life remains the dominant theme throughout this work.  In the background, he remains beset by \"place,\" which is translated into spending his earnings on enlarging his father's land holdings.Malouf's great strength is in characterization.  Every person in this story is vividly depicted, Frank, father Clem, Tam the stepbrother and Phil the lawyer.  Would you like these people? It's doubtful.  Frank, caught up in his art, is slovenly, his various residences a chaos, his appearance ragged. Phil is hesitant, charmless and limited in scope.  Little wonder he remains unmarried throughout his life.  There is little to attract in any of these people.  Still, Malouf manages to portray them sympathetically.  His prose keeps you attentive, following their fates, no matter how distasteful their personalities might seem.  It is Malouf's honed skills that keeps this book timeless."}, {"review_sentiment": 5.0, "review_text": "Generational Family Trees are often found at the beginning of Biographies. Mr. Malouf's, \"Harland's Half Acre\", is a novel so the Families are fictitious, however the complexity of the relationships are very real, so a pen a paper may help keep all in order. The Author is not a writer of clichés, and the people and how they relate are in no way contrived. There is some unusual movement of players, and they sometimes concur with the death of another key character, it may just have been me, however there seemed much to follow.This is the fifth work of the Authors that I have read, so I have by no means even reached the halfway mark in his work. Of the works I have read this is my favorite. This book is neither as complex as, \"An Imaginary Life\", nor as seemingly straightforward as, \"The Conversations At Curlow Creek\".  The works I have read that were about the settlement of Australia were placed at the beginning of the earlier settlers history while this work shows the results and failures of the descendents of those pioneers.The artist in the book reminded me of another Author's portrayal of a painter in. \"The Moon And Sixpence\", by W. Somerset Maugham. The artist's personalities are very different, and the issues they struggle with differ as well. I make the reference as it may cause an association to the better-known work. Mr. Malouf's work is every bit as good a read.All of the attributes about the Author's work I have mentioned before I will try not to repeat, however in this work the manner with which he had his characters experience death was interesting to me. His writing of death and its dismantling of life is very well done, however the way he chose to deal with the actual instant of death was new as a reader for me. It occurs more than once, so I believe the note is something the Author wanted to make a point of. Death is hardly a new area, but as he has done in his previous books, he writes about aspects of what you believe you are familiar with and he brings a fresh perspective. His work is not derivative, it is unique as he takes a detail, a moment in time, and causes it to be a noteworthy event.A wonderful writer, I look forward to the balance of his work."}, {"review_sentiment": 4.0, "review_text": "David Malouf's Harland's Half Acre is by every standard a great book. Malouf has elected to deal the life of Frank Harland, a fictional Australian painter based loosely on real-life painter and recluse Ian  Fairweather. Thematically, Malouf's book is comparable to Patrick White's  The Vivisector, although Malouf's book certainly is a less demanding and  far more beautiful read.  As usual, Malouf's almost liquid prose is beyond  reproach, and the central characters are more substantial  than in previous  works.  Harland's Half Acre has not received as much acclaim as other  novels by David Malouf, which is a great pity. The novel is not as grandly  imagined as Malouf's masterpiece An Imaginary Life, yet it follows in the  footsteps of Johnno, 12 Edmondstone St. and The Great World by painting an  intensely personal picture of Australian history/memory."}]}, "authors": ["David Malouf"], "isbn": "0679776478", "longitude": 153.0234991, "periods": ["1900s"], "title": "Harland's Half Acre", "word_cloud": "really want unfortunately know fast subtlety many deserves slower thoughtful give wonderful writer punch something good quickly thought write paint really manage tag nut obsession likely make worse way enjoy whole character particularly endear plot way reader take family drama almost personal got involve many uplift generous part create balance work something fond always favorite work fact several commercially successful lovely character set plot think writer writer writer pick little intricacy well recommend reader enjoy writer depth irritate read ramble gossip timeline change new character abound imaginary excellent read author thesaurus need describe work certainly single term encompass superb write ability descriptive power fail address strength chronicle appropriate life realistically portray tumultuous event mixed mundane anything mundane however raise rural hilly environment buffet last poverty overborne deep loyalty father brother never lose sight mean place place house birth matter far stray locale haunt life painting end confines solitary exile thesaurus fail convey reviewer word embed real life early presage many award grant write first winner award richest publish story capture first father indolent dairy farmer impart sense story earliest day apply learn draw instead give fresh image home people life power experience hill country various intensity light shadow storm beset hill flora fauna encounter struggle impart feeling art use available medium paint wood cardboard panel paper hand work gain wide circulation almost unknown fame aim however get life remain dominant theme work background remain beset place translate spending earnings enlarge father land great strength characterization person story vividly depict father lawyer people doubtful catch art slovenly various residence chaos appearance rag hesitant charmless limit scope wonder remain unmarried life little attract people still manage portray sympathetically prose keep attentive follow fate matter distasteful personality hone skill keep timeless often find begin fictitious however complexity relationship real pen paper order writer cliche people relate way contrive unusual movement player sometimes concur death key character however much fifth work mean even reach halfway mark work work favorite neither complex imaginary seemingly straightforward conversation work settlement place begin earlier settler history work show result failure descendant artist remind portrayal painter artist personality different issue struggle differ well make reference association work work bit good attribute author work mention try repeat however work manner character experience death interest write death dismantle life well do however way chose deal actual instant death new occur believe something want point hardly new area do previous writes aspect believe familiar brings fresh perspective work derivative unique take detail moment time cause noteworthy wonderful writer look forward balance work standard great elect deal life fictional painter base loosely painter recluse comparable certainly le demand far beautiful usual almost liquid prose reproach central character substantial previous work receive much acclaim novel great pity grandly imagined masterpiece imaginary yet follow footstep paint intensely personal picture australian", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Born on a poor dairy farm in Queensland, Frank Harland's life is centred on his great artistic gift, his passionate love for his father and four brothers and his need to repossess, through a patch of land, his family's past. The story spans Frank's life; from before the First World War, through years as a swaggie in the Great Depression and Brisbane in the forties, to his retirement to a patch of Australian scrub where he at last takes possession of his dream. \r\n\r\nHarland's Half Acre tells how a man sets out to recover the land his ancestors discovered and then lost and how, in fulfilment, this vision becomes a new reality.", "asin": "0679776478", "rank": "2231236", "city": "Brisbane", "image": "https://images-na.ssl-images-amazon.com/images/I/41OSI4BNAsL.jpg", "country": "Australia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}