{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 183, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Great product, recommended seller."}, {"review_sentiment": 5.0, "review_text": "Now that it's linked to the Amazon Empire, Goodreads makes a pretty good catalog of my reading (for myself . . . ) Since I read almost exclusively on Kindle, having disassembled bookshelves and hit the road. I do wish that I took more care to classify and comment since memory is so unreliable.In my mind this book goes together with a book I read some time ago and remember often, but can't quite name. Perhaps it's _Survival of the Sickest_ but I can't get that on Kindle to check my memory.Anyhow - one for medicine and one more generally for the way we inhabit the planet and especially the way we grow our food - both of these books convincingly send up much conventional wisdom as mediated by powerful corporate structures with profit as a motive for understanding.For neither of these books is that the authors' aim. This particular book has become a classic on evolutionary theory, mostly because of how throughly its author documents his comprehensive survey of the field. Dissonance with general understanding (of medicine or of evolution more generally to account for both books) falls out from that documentation.This book continues to resonate because there remains hope by its end that it is because our human designs are so much deficient in the face of the greater forces of ever-evolving life on the planet, that those designs will be subsumed by something more alive.The hint is that this will depend on our own continued evolution as well. That there is something beyond consciousness and cognitive power in store for the planet, and that we are locking ourselves away from it by our only temporary but terminal for the species as we are, dominance. Pride our downfall, but also our hope, as it promises to destroy our destruction.Blessed be the meek who feel the strains of evolution more than the pride of arrival.Anyhow, this book still makes a terrific refresher on the principles of evolutionary theory. I'd wanted a different book to document recent discoveries regarding the heritability of acquired characteristics. Some kind of folding of the DNA. I'll keep looking. Because I retain hope for the flowers."}, {"review_sentiment": 5.0, "review_text": "This is a wonderful book. For me it elevated a study of a small corner of biological science to the larger questions of who we are, where did we come from. Loved it."}, {"review_sentiment": 5.0, "review_text": "very informative"}, {"review_sentiment": 5.0, "review_text": "I have always understood evolution on a simple level, but this book helped me appreciate it in a new light, helped me see the ever-changing nature of our whole world (and probably our universe).  It has also made me look anew at humanity, its various settings and conditions, and, as a result, the many likely subspecies"}, {"review_sentiment": 3.0, "review_text": "Rather dull, but better than most of my assigned textbooks"}, {"review_sentiment": 5.0, "review_text": "Fascinating story, compelling language, made me so engaged in evolution that I'm planning a trip to the Galapagos!"}, {"review_sentiment": 4.0, "review_text": "I read this while on a cruise in the Galapagos, which made it more interesting to me than if I had been somewhere else.  The story of the Grants' research on the \"Darwin finches\" is fascinating, but I thought the narrative did not maintain as coherent a story line as in the best popular science writing.  I thought the reflections on larger issues (e.g. science vs. religious dogma, the causes and effects of climate change, and the rapid evolution of bacteria and viruses in reaction to modern medicines) at the end of the book were well done and among the best sections."}, {"review_sentiment": 5.0, "review_text": "The best book on evolution I have ever read.  I give it to all my creationist friends.  It doesn't help but is stops them from bothering me."}, {"review_sentiment": 3.0, "review_text": "I'm tempted to give this book only two stars.  It has a poor flow of thoughts and descriptions.  I think it's popular because it does canvas the central topic(s) so well .  I think there are better ways to get your head into science.  Great collection of stories, though ."}]}, "authors": ["Jonathan Weiner"], "isbn": "067973337X", "longitude": 0.0, "periods": ["1900s"], "title": "The Beak of the Finch: A Story of Evolution in Our Time", "word_cloud": "product recommend seller now link make pretty good catalog read almost exclusively disassemble bookshelf hit road wish take care classify comment memory mind go together remember often quite perhaps medicine generally way inhabit planet especially way grow food convincingly much conventional wisdom mediate powerful corporate structure profit motive author aim particular become classic evolutionary theory mostly thoroughly author document comprehensive survey field general understanding medicine generally account fall continue resonate remain hope end human design much deficient face greater force life planet design subsume something hint depend continue well something consciousness cognitive power store planet lock away temporary terminal specie dominance downfall also hope promise destroy meek feel strain pride still make terrific refresher principle evolutionary theory want different document recent discovery regard irritability acquire characteristic kind fold dna keep look retain hope flower wonderful elevate study small corner biological science larger question come love informative always understand simple level help new light help nature whole world probably universe also make anew humanity various setting condition result many likely subspecies rather dull better assign textbook fascinate compelling language make engaged plan trip cruise make interest somewhere else research finches fascinate think narrative maintain coherent line best popular science write think reflection larger issue science religious dogma cause effect climate change rapid bacteria viruses reaction modern medicine end well do best section best ever give creationist friend help stop bother tempt give star poor flow thought description think popular canvas central topic well think better way get head science collection story", "genres": ["Science & Nature"], "summary": "Winner of the Pulitzer Prize\r\nWinner of the Los Angeles Times Book Prize\r\n\r\nOn a desert island in the heart of the Galapagos archipelago, where Darwin received his first inklings of the theory of evolution, two scientists, Peter and Rosemary Grant, have spent twenty years proving that Darwin did not know the strength of his own theory. For among the finches of Daphne Major, natural selection is neither rare nor slow: it is taking place by the hour, and we can watch.\r\n\r\nIn this dramatic story of groundbreaking scientific research, Jonathan Weiner follows these scientists as they watch Darwin's finches and come up with a new understanding of life itself. The Beak of the Finch is an elegantly written and compelling masterpiece of theory and explication in the tradition of Stephen Jay Gould.", "asin": "067973337X", "rank": "26171", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/51IPRq5I8yL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}