{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 31.75, "ratings": {"num_ratings": 49, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Item received as expected"}, {"review_sentiment": 2.0, "review_text": "Philip Roth reads in the NYTimes that Philip Roth is leading a movement to create a new Diaspora to repatriate Israel’s Ashkenazi Jews to their counties of origin.  Roth, headed to Israel for an interview, planned to see what was up with this.  Roth found that the Diaspora advocate not only has his name, he looks like him.The plot is mad cap. It has the clever twists and the apt phrasings Roth is famous for but delivers no out loud laughs or fully comic scenes.The setting is the late 1980’s with backdrops of the first Intifada and the trial of  John Demjanjuk.  Roth’s Israel is a cauldron of intrigue, soldiers (some willing and some not so willing) spies (and double agents) and duplicitous lawyers.Characters, such as the Roth imposter, his girlfriend Jinx, George Ziad and Mr. Smilesburger have feasible back-stories that explain why they are in Israel doing what they are doing. Without spoiling the ending, suffice it to say, their actions towards the end don’t fully fit the personalities that had been developed.Most irritating about the characters is their long-winded (going on for pages) speeches. Most have a very narrow focus: i.e.  Irving Berlin secularized Christmas and Easter with his iconic songs.  Jews should only speak well of other Jews (losbon bora).  Jews are great achievers, except for Jews living in Israel; they need their home culture to thrive which is the idea at the heart of the (imposter Roth’s) Diaspora theory.There is the Roth view of women, which leads to sex (it just happens); the irrelevance of which is seen in that there are no ramifications for the characters or implications for the plot.  There is a dark portrait of Israel and the Israeli people.  The ending was, I’ll leave it at unsatisfying.In the hands of most other writers this would be a bomb; but, the plot is clever, and aside from the soliloquies, there is some very good prose .  I did keep reading which is very unusual for a book that I rate a 2."}, {"review_sentiment": 4.0, "review_text": "Philip Roth the writer turns himself (maybe) into Philip Roth the character, who travels to Israel to confront another fictional version of Philip Roth who is trying to get Jews to abandon Israel and move back to Europe. It's...weird.This is Roth at his most recursively self-absorbed. Which Roth is real and which one is fake gets shunted through a hall-of-mirrors framework where every character's identity becomes hopelessly doubled and and intertwined with some paranoid other version of themselves.As if that wasn't convoluted enough, almost the entire book is set in Israel, and comes with all of the staggering socio-cultural-political baggage that writing about Israel brings, and which is injected with a further, colossal dosage of moral confusion, misgiving and, lets face it, paranoia, that comes with writing about that place as skeptical, secular American jew.Operation Shylock is overflowing with conceits, conversations and set pieces, any one of which feels like Roth could have spun out into an entire novel unto itself. There is just too much of interest at play here, and not everything can be resolved or even, for that matter, truly broached. Roth is drinking from the ultimate fire hose of American Jewish identity and anxiety here. It's a miracle this book coheres on any level, but this is later career Roth, and his mastery of novelistic technique and style is as formidable here as it ever got. Somehow, the whole thing doesn't just fall apart on every page, itself a huge achievement.If you have never read Roth before, DO NOT start with this one. There are references throughout to his previous works and to his life more generally, and that only adds to the book's already overwhelming confusions. If you have, buckle up, this is Roth at his most hysterically crazed and overwrought."}, {"review_sentiment": 5.0, "review_text": "Last words in this novel: This confession is false. But which one?A tortuous and ambiguous plot about madness, identity and espionage. Serious and funny.''You look upset. You're not yourself tonight.' 'Don't have to be. Got someone else to do it for me.''After going through a difficult time with a mental breakdown triggered by medication after an operation, PRoth encounters another PR. An imposter? A prank? A hoax? A coincidence? A conspiracy?The other PR is explicitly impersonating the author. He acts weirdly, culminating in the promotion of 'diasporism', the idea that Jews leave Israel and return to their former homes in Europe, in order to avoid a second Holocaust, this time at the hand of Arabs.The center point of the plot, in time and space, is the 1988 Jerusalem trial against 'Ivan the Terrible', the Ukrainian American accused of having been a sadistic camp guard in Treblinka. The two PRs meet at or because of the trial.The 'real' PR is quite weird too. He keeps doing things that nobody in his right mind would even consider. Example: accepting a million dollar check as donation from a man who obviously mistakes him for his double. Or riding a taxi from Ramallah to Jerusalem at night. And worse. He should never have left Newark.Roth's perpetual subject, apart from his own self, is: what is a Jew? That has many chapters, in history and in our time. Pogroms, Holocaust, Zionism, Israel, Jerusalem, Palestine...and also diaspora, anti-semitism, integration, adaptation... Roth always addresses a cocktail of these within a more personal framework of identity, family, relationships. Not religion; that is the least of his concerns.Roth's acrobatics about identity reach dizzy new heights here. The story dives into the complexity of the Israel/Palestine situation, the writing at times not far from Le Carré's espionage plots. He transcends the thriller genre by his absurdities and his post modern plot abuses. Quote: ' ... (the writer) slips silently out of the plot on the grounds of its general implausibility, a total lack of gravity, ..., an absence of inner coherence, ...' While the 2016 Nobel goes to Bob Dylan, and that is fine by me, Roth is surely a serious candidate for another year. Except, can there be another American so soon? And: can the jury live with PR's addiction to ambivalence?"}, {"review_sentiment": 4.0, "review_text": "This man knows how to write a novel."}, {"review_sentiment": 5.0, "review_text": "At times raunchy, hilarious - essential Philip Roth, the bad boy of literature."}, {"review_sentiment": 2.0, "review_text": "I was unable to get through this book for the reasons well expressed by the other less impressed reviewers here. Some writing projects are better presented as essays rather than forcing them into a contrived and frankly boring and tedious fiction formulation. I have the feeling that because of his stature among the book buying NY intelligentsia his editors feared to do this long-winded and frequently pretentious work the cutting it sorely needed. I also think that professional reviews, in general, found in newspapers and magazines would be more helpful and perhaps more critical if they were not performed by personal friends of the author."}, {"review_sentiment": 4.0, "review_text": "It's Phillip Roth.  Plenty of sex, amazing intelligence and depth, not one of his most successful experiments, but as always really gets you thinking."}, {"review_sentiment": 4.0, "review_text": "I have ALL fiction books by Roth, but I have only read 6. I had high expectations for this one, and although it did not disappoint, my expectations were I guess too high. This is something I of course knew already, because when you are expecting too much of something, usually things don't go as expected.Anyway, as for the book, I loved the approach to Zionism that Roth brings to the table, and I also loved the idea of the double Roth character."}, {"review_sentiment": 3.0, "review_text": "3.5 if I could give it an additional half-star. Like many (I'm guessing), I would have liked this a little better had it been cut by a third, or, at least a quarter. In some books, Roth's writing impresses - he's a good writer, sometimes elegant. Not here. This book is a harangue. All of Roth's weaknesses are here on parade: self-obsession, which for a novelist, means a narrow \"world view\" and not a lot of depth or uniqueness to the other characters (even considering that the other main character is a doppelganger Roth, this book is self-absorbed). The main female character is a fuckable bimbo, which means the characterization is typical of Roth, but a downer for real females like myself.The book's strength is its intelligence and it's intellectual arguments. Roth presents both sides of the Israeli-Palestinian conflict robustly and in depth - he makes the case for both sides very well, though the Israeli's come out the worst, which is as they should since they took didn't belong to them, and the consequences of that choice are everywhere to be seen, in the novel as in real life.This aspect of the novel - Roth's long engagement throughout the novel with this question - who is \"right\" or most \"right\" in the Israeli/Palestinian conflict - doesn't get nearly as much attention as the aspect that explores identity and individual double-ness, and to me, this is the most interesting, juiciest part.The idea of \"diasporism\" as an antidote to Zionism is interesting and lively and I wish it could work, though it can't for reasons Roth also identifies. Some parts of the book are on-the-money funny, such as \"ASA - anti-semite's anonymous,\" a 12-step program for Jew-baiters and Jew-haters, as well as the (male) Israeli agent who pops up to offer Roth and his double the occasional blow job, and Roth2's gigantic penile implant.I was disappointed by the ending - not just by the \"author's note\" at the end about the confession, but by the last scene and where Roth leaves it at the end, the last words. The incoherence though, is likely intentional and part of the story of the paranoid self-obsession that is one of the book's themes.So, overall, for this reader - a mixed bag; not as well-written as some of his novels are (the Ghost novels, for example, and American Pastoral and his last few), but intellectually interesting and strong; this novel is nothing if not complex. Read it for yourself and see."}]}, "authors": ["Philip Roth"], "isbn": "0679750290", "longitude": 35.0, "periods": ["1900s"], "title": "Operation Shylock : A Confession", "word_cloud": "receive expect read lead movement new repatriate county origin head interview plan find advocate name look plot mad cap clever twist apt phrasing famous delivers loud laugh fully comic setting late backdrop first trial intrigue soldier willing willing spy double agent duplicitous imposer girlfriend feasible explain spoil end suffice say action towards end fully fit personality irritate character go page speech most narrow focus secularize iconic song speak well lisbon boar great achiever live need home culture thrive idea heart imposer view woman lead sex happen irrelevance see ramification character implication plot dark portrait people end leave hand writer plot clever soliloquy good prose keep read unusual rate writer turn maybe character travel confront fictional version try back recursively real fake get shunt framework character identity become hopelessly double intertwine paranoid version convolute enough almost entire set come staggering baggage write brings inject colossal dosage moral confusion misgive let face paranoia come write place skeptical secular american overflow conceit conversation set piece feel entire much interest play everything resolve even matter truly broached drinking ultimate fire hose american identity anxiety miracle coheres level later novelist technique style formidable ever get whole thing fall apart page huge never reference previous work life generally add already overwhelming confusion buckle hysterically craze overwrought last word false tortuous ambiguous plot madness identity espionage serious funny look tonight someone else go difficult time mental breakdown trigger medication encounter imposer prank hoax coincidence conspiracy explicitly impersonate author act weirdly culminating promotion idea leave return former home order avoid second time hand center point plot time space trial ukrainian accuse sadistic camp guard meet quite weird keep thing nobody right mind even accept dollar donation man obviously mistake double rid taxi night worse never leave perpetual subject apart self many chapter history time also diaspora integration adaptation always address cocktail personal framework identity family relationships not religion least acrobatics identity reach dizzy new height story dive complexity situation write time far espionage plot transcend thriller genre absurdity post modern plot abuse quote writer slip silently plot ground general implausibility total lack gravity absence inner coherence go fine surely serious candidate year american soon jury live addiction ambivalence man know time raunchy hilarious essential bad boy literature unable get reason well express le impressed reviewer write project better present essay rather force contrive frankly bore tedious fiction formulation feel stature buy intelligentsia editor fear frequently pretentious work cut sorely need also think professional review general find newspaper magazine perhaps critical perform personal friend author sex amaze intelligence depth successful experiment always really get think fiction high expectation disappoint expectation guess high something course know already expect much something usually thing go love approach bring table also love idea double character additional many guess like little better cut third least quarter write impress good writer sometimes elegant not harangue weakness parade novelist mean narrow world view lot depth uniqueness character even consider main character doppelganger main female character fuckable bimbo mean characterization typical downer real female strength intelligence intellectual argument present side conflict robustly depth make case side well come worst take belong consequence choice everywhere see real aspect long engagement question right right conflict get nearly much attention aspect explore identity individual interesting juiciest idea diasporism antidote interest lively wish reason also identify part funny anonymous program well male agent pop offer double occasional blow job gigantic penile disappoint end author note end last scene leave last word incoherence likely intentional part story paranoid overall mixed bag novel novel example american last intellectually interest strong nothing complex see", "genres": ["Fiction & Literature"], "summary": "Time Magazine Best American Novel (1993)\r\n\r\nIn this fiendishly imaginative book (which may or may not be fiction), Philip Roth meets a man who may or may not be Philip Roth. Because someone with that name has been touring Israel, promoting a bizarre reverse exodus of the Jews. Roth is intent on stopping him, even if that means impersonating his own impersonator. \r\n\r\nWith excruciating suspense, unfettered philosophical speculation, and a cast of characters that includes Israeli intelligence agents, Palestinian exiles, an accused war criminal, and an enticing charter member of an organization called Anti-Semites Anonymous, Operation Shylock barrels across the frontier between fact and fiction, seriousness and high comedy, history and nightmare.", "asin": "0679750290", "rank": "551654", "city": "Jerusalem", "image": "https://images-na.ssl-images-amazon.com/images/I/410tX-4dYAL.jpg", "country": "Israel", "story_arc": ["Tragedy", "Things only get worse"]}