{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 1316, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "It may be a classic, but I found it to be kinda boring and very depressing. No thanks.."}, {"review_sentiment": 3.0, "review_text": "A very challenging book due to the unusual time period and the difficult metaphors. Unusual characters as well. Either way a good work of liturature."}, {"review_sentiment": 4.0, "review_text": "The example of a book exaggerated by interpreting."}, {"review_sentiment": 5.0, "review_text": "Another Classic"}, {"review_sentiment": 1.0, "review_text": "You may say I'm ignorant, or stupid, or insane - but I really didn't like this book. At all. I couldn't get into it, I couldn't decipher what was going on half the time, and if it weren't for the fact that I actually knew parts of the story, I wouldn't have been able to keep up, because it's a classic and almost everyone has heard of the story in one way or another.The writing style was so bland and tiresome. There was no pause, no break, just constant rambling. So much so, that I probably missed a lot of poignant or important moments because I would skim through huge chunks of it wondering what was happening or where it was going to take me.I know it's a classic, one that is loved by many, but it just wasn't for me. The way it was written, the way it was told, I just couldn't connect or get engrossed in the horror that was being described. I appreciate the message behind the book, of course, I did a lot of research to understand what I had read better, but if it weren't for all that research, I wouldn't have been able to appreciate the book. So in all honesty, I couldn't give it more than a star, based on the book as a standalone.Sorry. Not for me."}, {"review_sentiment": 5.0, "review_text": "A wonderful ready a master writer. Story might be a little trite, but writing certainly supersedes it."}, {"review_sentiment": 5.0, "review_text": "It does have the dreaded N word, but was written in 1903. NIce read, and whoever did the adaptation for the movie is a genius."}, {"review_sentiment": 2.0, "review_text": "Don't get the fuss. I don't think this is well written and it doesn't capture any atmosphere for me. No characterization and therefore no sympathy with the narrator or the other figures. Has not aged well, of course, but in my opinion its flaws run much deeper than that.I certainly have no idea why this is retarded as one of the greatest novels ever- someone, please, enlighten me!?"}, {"review_sentiment": 5.0, "review_text": "One of my favorite books. For me the other reviews missed the real point of the book. Plainly, as the title says it is about the Heart Of Darkness within mankind not about africans or colonialism which are just sets for the deep story. Time and again this heart of darkness is made clear. When Marlow gets the job with the company he has to have his head measured by the company physician before leaving on his assignment. Asking what this is all about the physician replies that the company keeps records of how employees are changed after completing there assignment - a foreboding of the horror that he will discover about mankind. I find it wonderful how Conrad describes how the company treats the machinery and their employees in the same manner. The employees and machinery are both abandoned to rot in the jungle when their useful life is reached. A most telling scene is evoked when Marlow notices a group of wealthy European enter the company jungle camp. He notes that they have none of the talents or motives of true explorers and are only motivated by greed and personal gain. After they slip out of camp on donkeys and are never heard of again, he wonders what happened to the better animals - the donkeys. This exposee of the unvarnished dark side of human nature continues to be exposed as the story proceeds all the way to Kurtz."}, {"review_sentiment": 5.0, "review_text": "Good quality"}]}, "authors": ["Joseph Conrad"], "isbn": "0679428011", "longitude": -0.12574, "periods": ["1800s"], "title": "Heart of Darkness", "word_cloud": "find kinda bore depress challenging due unusual time period difficult metaphor unusual character well way good work literature example exaggerate interpret classic ignorant stupid insane really go half time fact actually know part story able classic almost everyone heard story way write style bland tiresome pause break constant ramble so much probably miss lot poignant important moment huge chunk wonder happen go know classic love many way write way tell engrossed horror describe appreciate message course lot research understand better research able honesty star base not wonderful ready master writer trite write certainly supersedes dread word write adaptation movie genius think well write capture atmosphere characterization therefore sympathy narrator figure age well course opinion flaw run much deeper certainly idea retard greatest novel someone please favorite review miss real point title say mankind african colonialism set deep story make clear get job company head measure company physician leave assignment ask physician reply company keep record employee change complete assignment forebode horror discover mankind find wonderful describe company machinery employee manner employee machinery abandon rot jungle useful life reach tell scene evoke notice group wealthy european enter company jungle camp note none talent motif true explorer motivate greed personal gain slip camp donkey never hear wonder happen better animal donkeys expose unvarnished dark side human nature continue expose story proceeds way good quality", "genres": ["Fiction & Literature"], "summary": "In a novella which remains highly controversial to this day, Conrad explores the relations between Africa and Europe. On the surface, this is a horrifying tale of colonial exploitation. The narrator, Marlowe journeys on business deep into the heart of Africa. But there he encounters Kurtz, an idealist apparently crazed and depraved by his power over the natives, and the meeting prompts Marlowe to reflect on the darkness at the heart of all men. This short but complex and often ambiguous story, which has been the basis of several films and plays, continues to provoke interpretation and discussion.\r\n\r\nHeart of Darkness grew out of a journey Joseph Conrad took up the Congo River; the verisimilitude that the great novelist thereby brought to his most famous tale everywhere enhances its dense and shattering power.\r\n\r\nApparently a sailor’s yarn, it is in fact a grim parody of the adventure story, in which the narrator, Marlow, travels deep into the heart of the Congo where he encounters the crazed idealist Kurtz and discovers that the relative values of the civilized and the primitive are not what they seem. Heart of Darkness is a model of economic storytelling, an indictment of the inner and outer turmoil caused by the European imperial misadventure, and a piercing account of the fragility of the human soul.", "asin": "0679428011", "rank": "87298", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51Q62PG3THL.jpg", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}