{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 55, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Having witnessed the recent (and on going) collapse of the real estate, mortgage, and banking industries, which were preceded by only a few years by the Dot Com bubble of the late - 90’s – I wonder – will we ever learn?Brightness Falls is a needed morality tale (and history lesson) for a lost generation. I read this book nearly twenty years ago, yet the characters and story still resonant within me. Our culture is ruled by greed, unbridled ambition and more of everything. This is the fuel for our very lives – a good citizen today is a good consumer. Our responsibility, if we do not wish for the house of cards to fall, is to buy lots of crap – crap we not need, with money we do not have to impress people we do lot like!Brightness Falls features the quest of a couple for the golden ring – wealth, fame and privilege.It is a story about all of us – about Americans who came of age in the Reagan Era and beyond. It speaks the truth about what rests in our hearts. To be rich. Why? The rich live a different life. This is the story we have been told, and sold, anyway. Over last century, beginning with the stories of Horatio Alger, we’ve been indoctrinated with the  belief that every man can attain high-society status. Everyone can be rich, famous and “important.” One he does so, all of his troubles will disappear.For many, this has become an obsession – one for which they will sacrifice their morals, ethics and their very soul to attain. We have witnessed this time and again over the past 30 years. Watch Wall Street, The Smartest Guys in the Room, Margin Call, or Glengarry Glen Ross for great depictions – real and fictional – of our ethical slide.Brightness Falls places us in the front row of this mania– to witness the gradual surrender of everything of importance to two individuals – all in exchange for the chance to strike it rich. The scenes I remember the most are those involving the main characters father – who is a retired auto worker living a simple, frugal life in Michigan on his pension. The conversations between son and father were heartbreaking – as the son buried all the values of his Mid-western upbringing in exchange for the values of the big city. Father and son had nothing in common. The wholesome values of the father didn’t produce enough fruit fast enough for the son.This is the story of our times. We look to the founders of Facebook and Google – billionaires before 30 – free to live large, never to punch a clock or drudge through a morning commute. We all want what they have – and we want it now, while we’re young. We do not wish to work, earn, save, and grow. Unfortunately, we do not recognize that from the simple life comes great wisdom. Only through years of experience – of seeing it all – can one begin to understand the world and our place in it. In Brightness Falls we see the crash in slow motion. We see how every decision impacts relationships and compromises the individuals involved. We can see what will happen and learn from the experience of these characters. Slow and steady wins the race!"}, {"review_sentiment": 5.0, "review_text": "I really enjoyed Bright Lights, Big City - also by Jay McInerney - so I picked up this novel as well. It is fantastic - I highly recommend it. It follows the story of the Calloways who outwardly appear to be a super-successful, young NY power couple. But like many relationships, things are a little different behind closed doors. There are a handful of other characters in the novel who are interesting to follow as well. This novel is interesting to read for a peak at young, high-class life in New York City. It's also just interesting for how promising young careers and relationships can wither and tarnish over time. As in Bright Lights, McInerney has plenty of interesting observations and truths to drop on the reader."}, {"review_sentiment": 4.0, "review_text": "Very Good, Interesting Story"}, {"review_sentiment": 5.0, "review_text": "Jay McInerney was a decent novelist before he began his Calloway trilogy, capturing some of the quirky characters of '80s Manhattan in a satisfactory way, but 'Brightness Falls' is where he really turned into a chronicler of the city's saga in the way of his idols like Fitzgerald. Falls begins the story of Russell and Corinne Calloway, a young married couple navigating life in late '80s, stock-market crazed Manhattan. Russell is a dissatisfied, idealistic book editor looking for a better future, Corrine is beautiful but full of doubts, and McInerney takes us through a ride of heartbreak and nostalgia as no other contemporary novelist has. Read this, 2006's The Good Life, and 2016's \"Bright, Precious Days.\" You'll feel as if you've lived Russell and Corinne's lives with them, a journey well worth taking."}, {"review_sentiment": 5.0, "review_text": "This is the first book by McInerhey that follows NYC alpha-couple Corrine and Russell.  It is a technical firecracker, with dazzling edgy depictions and satire of NYC 1980s capitalist shallowness, and the very real emotional desires of humans both trapped within and promoting cutthroat cynicism and power games. The book is dominated by sexual predators and is occasionally problematic from a feminist point of view, though in McInherhey's favour he \"describes cynically,\" and emphatically does not \"justify\" much of the chauvinism in this book. Perhaps the empathy his characters possess in their most difficult moments barely overcomes the machismo present in so much of the book.If the book retained only the scandal and cynicism, the sexual machismo and predation, it would be a no-go.  However, there is just enough sympathy and objectivity in the writing style to see and feel the characters, and thus to begin to like them, even.  In the end this book is a page-turner, and at best it truly brings the characters and their lives from the page directly into the conscious minds of the reader."}, {"review_sentiment": 3.0, "review_text": "Lovely writing style: smart but kind with a charming turn of phrase."}, {"review_sentiment": 5.0, "review_text": "Jay McInerey's best book. Should be a movie."}, {"review_sentiment": 5.0, "review_text": "Brilliant"}, {"review_sentiment": 5.0, "review_text": "So happy to discover this author!"}, {"review_sentiment": 5.0, "review_text": "Made me want to read all of McInerney again.  Has his pen on the pulse of New York"}]}, "authors": ["Jay McInerney"], "isbn": "0679745327", "longitude": 0.0, "periods": ["1900s"], "title": "Brightness Falls", "word_cloud": "have witness recent go collapse real estate mortgage banking industry precede year bubble late wonder ever learn need morality tale history lesson lose generation nearly year ago yet character story still culture rule greed unbridled ambition everything fuel live good citizen today good consumer responsibility wish house card fall lot crap crap need money impress people lot feature quest couple golden ring wealth fame story come age speak truth rest heart rich live different life story tell sell anyway last century begin story indoctrinate belief man attain status rich famous trouble many become obsession sacrifice moral ethic soul witness time past year watch great depiction real fictional ethical place front row witness gradual surrender everything importance individual exchange chance strike rich scene remember involve main character father retire auto worker live simple frugal life pension conversation son father heartbreaking son bury value upbringing exchange value big city son nothing common wholesome value father produce enough fruit fast enough story time look founder billionaires free live large never punch clock drudge morning commute want want young wish work earn save grow unfortunately simple life come great only year experience see begin understand world place see crash slow motion see decision impact relationship compromise individual involve see happen learn experience character steady win race really enjoy also pick well fantastic highly recommend follow story outwardly appear young power couple many relationship thing little different closed door handful character interest follow well interesting peak young life also interest promise young career relationships wither tarnish time plenty interest observation truth drop very good story decent novelist begin trilogy capture quirky character satisfactory way really turn chronicler city saga way idol begin story young marry couple navigate life late craze dissatisfy idealistic editor look better future beautiful full doubt take heartbreak nostalgia contemporary novelist read good feel live live journey well take first follow technical firecracker dazzle edgy depiction satire capitalist shallowness real emotional desire human trap promote cutthroat cynicism power game dominate sexual predator occasionally problematic feminist point view favor describes cynically emphatically much chauvinism perhaps empathy character possess difficult moment barely overcome machismo present much retain scandal cynicism sexual machismo depredation however enough sympathy objectivity write style see feel character thus begin even end best truly bring character live page directly conscious mind lovely write style smart kind charm turn phrase best movie brilliant so happy discover author make want pulse", "genres": ["Fiction & Literature"], "summary": "Combining the lyrical observation of F. Scott Fitzgerald with the laser-bright social satire of Evelyn Waugh, Jay McInerney gives us a novel that is stunningly accomplished and profoundly affecting. \r\n   \r\nAs he maps the fault lines spreading through the once-impenetrable marriage of Russell and Corrine Calloway and chronicles Russell's wildly ambitious scheme to seize control of the publishing house at which he works, Jay McInerney creates an elegy for New York in the 1980s. \r\n\r\nFrom the literary chimeras and corporate raiders to those dispossessed by the pandemonium of money and power, Brightness Falls captures a rash era at its moment of reckoning and gives reality back to a time that now seems decidedly unreal.", "asin": "0679745327", "rank": "210215", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51XiZ6t1nWL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}