{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 9, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "required reading for school"}, {"review_sentiment": 5.0, "review_text": "Chamoiseau explains that it is nearly impossible to capture oral tradition by writing about it and then proceeds to do a great job of it, at least to a reader who, as with most future readers, has never been magically transfixed by a story teller. Never having been to the Caribbean, never have I gone to the glossary as frequently as in this book. The story is tragic, violent, unfair, justice is served, sweet and brings readers, even those who have been to the Caribbean, into a world we would pass by if we saw it outside a market, not understanding what could be in it for us. Tourists aren't usually buying charcoal.I was in Africa. This isn't Africa. This is its own culture, language and people. As usual, the biggest, blackest, most African, former slave guy (Congo) gets it the worst which I found disturbing. My distress at his crashing through a window to escape was another reader's heroic escape. In Africa age is revered. In this novel it is only talk. Actions say otherwise. No one escapes unchanged.One of the main characters seems to be the character Edwidge Danticat based her novel, the Dew Breaker, about a torturer, on. The resolutions are different. Danticat finds the crime unforgiveable. Chamoiseau has the torturer change and become a better person through the events and interaction with other characters in the novel and a realization of the value of his culture. Danticat has the easier solution; you are bad. You are going to stay bad. You should spend the rest of eternity in Hell if not prison. Chamoiseau coughs up Higher Understanding which is uncomfortable but awesome.Solibo yells, \"Patat, sa\" his last cry but \"only the dumb yam... holds out its roots for you to yank out of its home.\" It is a novel of place and time, a people soon to be lost to our understanding."}, {"review_sentiment": 4.0, "review_text": "What a great fiction take. It's funny and a pleasure to read"}, {"review_sentiment": 4.0, "review_text": "Martiniquan writer, Patrick Chamoiseau, has written a delightful book about a young man, Solibo, who loves to tell a story. Chamoiseau beautifully portrays the conflict between the ancient oral tradition of story-telling and the modern scientific and linguistic reality.On one level, the book is a gruesome and bloody burlesque on police methods of investigating a murder. On another deeper level, it is a lament for a disappearing culture of stories, magic, demons and superstition in favour of logic and the written word. It is also a tale of colonial stupidity and inevitability.Chamoiseau's prose is lyrical and evocative. It is more of an oral history than a verbal study - an attempt to revive the oral history of his culture.He includes himself as one of the characters, contrasting his status as a mere story-teller with the central character, Solibo, the embodiment of a dying culture.Martina Nicolls, Author of \"The Sudan Curse\" and \"Kashmir on a Knife-Edge\""}, {"review_sentiment": 5.0, "review_text": "Solibo Magnificent can at times make you laugh and at times make you sad at the loss of tradition. It is a touching tale of Solibo and his audience who are suspected of his murder. The story goes deeper than the comedy that takes place in the police investigation. Solibo the story teller who dies while telling a story emerges as  magnificent even after death. His audience, their innocent belief in him and his words makes a touching tale as they are pitted against the cold logic of police investigation to detect the murderer. Interestingly , it is cold logic of medical investigation which brings the suspected audience respite. The beauty of \"belief\" and the ability of cold logic to hound or bring justice are so well captured in this readable book. The imagery and language is so new to readers of books written in English. Thanks to Amazon I could know about this book from so far away a land - India. Solibo Magnificent"}, {"review_sentiment": 5.0, "review_text": "Anyone who is at all sensitive to the gap that exists between the spoken word and the written word will immediately become thoroughly immersed in Chamoiseau's Solibo Magnificent.  The narrator of this tale about the death of a storyteller and the events that follow his death struggles at times to capture on the page the vivacity of what only speakers can express.  I've now read this novel three times and during each reading I stop and think about how differently I speak and write.  Having derived such pleasure and intellectual challenge from Solibo Magnificent, I plan to read every other work of his that has been translated into English.The novel is both pathos and a comedy.  It begins with a formal police report of a fatality and a listing of people who have been rounded up as suspects in the homicide.  Solibo, we learn, died in a public park and is immediately surrounded by people who debate about the best way to revive him.  Instead of preparing for a funeral, these same people tell stories about Solibo and his miraculous powers.  For instance, once, a farmer tried unsuccessfully to kill one of his pigs.  When Solibo came to visit him, the farmer told of his frustration; Solibo looked the pig in the eyes and told it to die.  The pig died.  The power of the word revealed!What is most revealing, however, is the gap that exists between the abstractions that are encased in language that can be written and the concrete nature of the language that is spoken.  In one case, one suspect is taken to the police headquarters and questioned.  The policeman, who speaks only French, asks, \"What is your address?\" and \"When is your birthday?\"  The suspect doesn't understand either question.  He is only able to answer when he is addressed by another police officer, one who speaks French and Creole.  That policeman asks, \"When do you go to eat dinner?\" and then, \"After which hurricane were you born?\"In these examples, one discovers a fuller meaning of the idea of assimilation, in this case, one that failed to take root, even though the French had dominated the island of Martinique.  In its own way, the novel is a story of resistance to assimilation and a testimony to the value of such resistance for everyone who has been raised in a culture that places such great value on writing alone.Chamoiseau began the novel with three epigraphs.  One is a fragment from Italo Calvino.  Anyone who has been enchanted by a work by Calvino will find Solibo Magnificent a joy to the eyes and to the inner voice that talks to us in silence."}, {"review_sentiment": 5.0, "review_text": "An incredibly readable story of an endangered species: the oral tradition. That the telling of this small epic is done with adding both French and Creole phrases (translated in a glossary) is *essential* to understanding the people living in Fort-de-France. There are broad hints at Césaire's ideas of negritude and many of Fanon's racially-charged concepts from his \"Black Skin, White Masks.\" Chamoiseau even puts himself in the tale as the character of the \"word scratcher,\" someone who makes a pitiful attempt to put down in words what the oral tradition is all about.This book is a true gem."}, {"review_sentiment": 4.0, "review_text": "Patrick Chamoiseau's Solibo Magnificent is a powerful novel, both hilarious and tragic at once.  In Fort-de-France, Martinique, Solibo (a Creole nickname meaning somersault or pirouette) has dropped dead in front of some of his followers after uttering a non-sequitor, \"That potato!\"  His band of listeners, believing this to be a part of Solibo's act, wait patiently for the great man to rouse himself.  When he doesn't, the police are brought in, and they at once suspect the witnesses , which include the character of the author, of having murdered Solibo.  What follows is part slapstick, part theater of the absurb, part philosophy, part tragedy, part magic, all poetry.  Somehow Chamoiseaux manages to meld these elements into a coherent whole that makes this novel an extraordinary experience.As other reviewers have noted, this story is not only about the death and murder investigation of a beloved storyteller, but about the death of the oral tradition in general.  Chamoiseau leaves no doubt that he intends the reader to walk away with this notion.  Written words are inadequate to describe the power of the spoken; one has only to read the reconstructed version of Solibo's last words at the end of the book to understand this. Despite the somewhat heavy-handed approach to his theme, Chamoiseau tells a riveting story with natural lyricism.  (Kudos to the translators!)This author deserves a much wider readership (or is it audience?)"}, {"review_sentiment": 5.0, "review_text": "What a great novel! Chamoiseau manages to create both a rich alleghory on the death of oral tradition, and a keystone cops-style farce. The style and language that Chamoiseau plays with here is a delight to read, and takes on  an added weight considering the setting. It's reminiscent of Rushdie's  mishmash of Indian and English to make a point in Midnight's Children.  Kudos to the translator for not attempting to translate everything in the  text. There are footnotes to a glossary, which at first seems daunting, but  is very rewarding - I never thought footnotes could lead to so much  laughter (I take that back, D.F. Wallace). Ultimately, this book is a love  affair of language. Enjoy!"}]}, "authors": ["Patrick Chamoiseau"], "isbn": "0679432361", "longitude": 0.0, "periods": ["1900s"], "title": "Solibo Magnificent", "word_cloud": "require reading school explain nearly impossible capture oral tradition write proceeds great job least future reader never magically transfixed story teller never go glossary frequently story tragic violent unfair justice serve sweet brings reader even world saw outside market understanding usually buy culture language people usual biggest blackest african former slave guy get worst find disturb distress crash window escape heroic escape age revere talk action say otherwise one escape main character seem character base torturer resolution different find crime unforgivable torturer change become better person event interaction character realization value culture easier solution bad go bad spend rest eternity prison cough higher understand uncomfortable yell sa last cry dumb yam hold root home place time people soon lose understanding great fiction funny pleasure martinique writer write delightful young man love tell story beautifully portray conflict ancient oral tradition modern scientific linguistic level gruesome bloody burlesque police method investigate murder deeper level lament disappear culture story magic demon superstition favor logic write word also tale colonial stupidity prose lyrical evocative oral history verbal study attempt revive oral history include character contrast status mere central character embodiment die time make laugh time make sad loss tradition touch tale audience suspect story go deeper comedy take place police investigation story teller die tell story emerge even death audience innocent belief word make touch tale pit cold logic police investigation detect murderer cold logic medical investigation brings suspect audience beauty belief ability cold logic hound bring justice well capture readable imagery language new reader write english far away land anyone sensitive gap exist spoken word write word immediately become thoroughly immersed narrator tale death storyteller event follow death struggle time capture page vivacity speaker express time read stop think differently speak write derive pleasure intellectual challenge plan work translate pathos comedy begin formal police report fatality list people round suspect homicide learn die public park immediately surround people debate best way revive instead prepare funeral people tell story miraculous power instance farmer try unsuccessfully pig come visit farmer tell frustration look pig eye tell pig die power word reveal reveal however gap exist abstraction encased language write concrete nature language speak case suspect take police headquarters question policeman speak french asks address birthday suspect understand question able answer address police officer speak french policeman ask eat dinner hurricane bear example discovers fuller mean idea assimilation case fail root even french dominate island way story resistance assimilation testimony value resistance everyone raise culture place great value write begin epigraph fragment enchant work find joy eye inner voice talk silence incredibly readable story endanger specie oral tradition tell small epic do add french phrase translate glossary understanding people live broad hint idea negritude many concept even put tale character word scratchier someone make pitiful attempt put word oral tradition true gem powerful hilarious tragic nickname mean somersault pirouette drop dead front follower utter potato band listener believe part act wait patiently great man rouse police bring suspect witness include character author murder follow part slapstick part theater part philosophy part part magic poetry manage meld element coherent whole make extraordinary reviewer note story death murder investigation beloved storyteller death oral tradition general leave intend away notion word inadequate describe power speak reconstruct version last word end understand somewhat approach theme tell rivet story natural lyricism translator author deserve much wider readership audience great manage create rich allegory death oral tradition keystone farce style language play delight take added weight consider set reminiscent mishmash indian make point translator attempt translate everything text footnote glossary first seem daunt reward never think footnote much laughter take back love affair language", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "New York Times notable book of the year\r\n \r\nIn Fort-de-France, Martinique, a colorful group of musicians, street vendors, and hopeless disciples, including the author, gather under a tamarind tree to listen to legendary bard Solibo Magnificent spin tales. Suddenly, in the middle of a raucously entertaining story, Solibo drops dead. So entranced and drunken are his friends, they initially fail to realize that their hero has spoken his last word. One hysterical listener runs to find the doctor and inadvertently returns with the overly eager, sinister chief sergeant, who holds Solibo's friends under suspicion for murder. At turns a madcap murder mystery, a political satire, and a lament on the death of a treasured tradition, Solibo Magnificent is wildly imaginative and exuberantly lyrical. \r\n \r\n“Both a meaty tale and a cry on behalf of a drowning culture . . . by a poet and a novelist with a raffishly human and lyrical touch.” Los Angeles Times ", "asin": "0679432361", "rank": "2337687", "city": "Martinique", "image": "https://images-na.ssl-images-amazon.com/images/I/51QF8FDXKCL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}