{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 133, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Reading now and enjoying! Quick pace and humorous with interesting characters."}, {"review_sentiment": 4.0, "review_text": "Entertaining story of family life.  Enjoyed it."}, {"review_sentiment": 5.0, "review_text": "What a treat and masterwork this book is. Even if you are not Hispanic, you will hang on every word and story within the bigger one."}, {"review_sentiment": 4.0, "review_text": "A significant feature in Sandra Cisneros's novels is the colourful language, the unforgettable characters and the unique settings. Her stories are narratives about strong women, the ones who struggle their whole lives to make the people they love happy.In this book we find the protagoniast 'Lala' Reyes and her family crossing the border between their homes in USA to Mexico, where Little grandfather and Awful grandmother wait for them.During those summers, we see the relationship between the children and the adults, the tales the latter told the little ones when they ask questions about their family history. When Lala tries to understand the story of Awful grandmother, she enters into the land of unbelievable stories, unreliable fantasies, sophisticated lies and intriguing lives.A multigenerational narrative that makes the reader question their own past and how the identity of their family and, at the same time, their own shelves was created."}, {"review_sentiment": 4.0, "review_text": "A good read"}, {"review_sentiment": 4.0, "review_text": "I hate the label \"coming of age\" book, because it seems there are so many of them. This book takes a long time to relate all of the back-story and history of various characters, but in the end wraps it all up neatly and tidily. It is about a young girl, Lalita, who is unsure of her place in Mexican society and within her own family and how she comes to accept and embrace her heritage. This is a very well written book and I'm surprised that it hasn't gotten more attention. It is lengthy, but worth the read!"}, {"review_sentiment": 3.0, "review_text": "I read House on Mango Street a couple years ago and that book really came together at the end, so I was expecting a similar experience with this book as it was written by the same author. Throughout a majority of the book, I wasn't really sure where it was heading or why the Grandmother's life story was so important. I thought that maybe Celaya, the main character, was telling this as an oral history to her children or grandchildren as a sort of way to continue the book off the page. The ending did, however, put the story into perspective and answered many questions, so it was both similar and different to House on Mango Street in that sense. I liked how even if I hadn't experienced many of the things the characters had, I could still relate to them and understand their thoughts and though processes especially about the U.S. as there was a huge theme of this side v. the other side (or U.S. v. Mexico) and the differences between Mexican-Americans and Mexicans. I didn't like not knowing the point of the book and why it was written until the end and I didn't really like how the author expounded on many characters that didn't matter to the story plot whatsoever. Overall, it was a decent book and I would recommend reading it if you enjoy reading about other peoples' lives, how they live, and enjoy the uncertainty of an unreliable narrator."}, {"review_sentiment": 2.0, "review_text": "was hard to follow never finished reading it."}, {"review_sentiment": 5.0, "review_text": "Love Sandra Cisneros."}, {"review_sentiment": 5.0, "review_text": "a must read"}]}, "authors": ["Sandra Cisneros"], "isbn": "0679742581", "longitude": -99.1333416, "periods": ["2000s"], "title": "Caramelo", "word_cloud": "read enjoy pace humorous interesting character entertain story family life treat masterwork even hang word story bigger one significant feature novel colorful language unforgettable character unique setting story narratives strong woman one struggle whole life make people find protagonist family cross border home grandfather wait summer see relationship child adult tale latter tell little one question family history try understand story grandmother enters land unbelievable story unreliable fantasy sophisticate lie intrigue multi generational narrative make question identity family time shelf create good hate label come age seem many take long time relate history various character end wrap neatly tidily young unsure place society family come accept embrace heritage well write surprise gotten attention lengthy couple year ago really come together end expect similar experience write author majority really sure head life story important think maybe main character tell oral history child grandchildren sort way continue end however put story perspective answer many question similar different sense like even experience many thing character still understand thought process especially huge theme side side difference like know point write end really author expound many character matter story plot overall decent read read people life live enjoy uncertainty unreliable narrator hard follow never finish reading", "genres": ["Fiction & Literature"], "summary": "Every year, Ceyala \"Lala\" Reyes' family--aunts, uncles, mothers, fathers, and Lala's six older brothers--packs up three cars and, in a wild ride, drive from Chicago to the Little Grandfather and Awful Grandmother's house in Mexico City for the summer. \r\n\r\nStruggling to find a voice above the boom of her brothers and to understand her place on this side of the border and that, Lala is a shrewd observer of family life. But when she starts telling the Awful Grandmother's life story, seeking clues to how she got to be so awful, grandmother accuses Lala of exaggerating. \r\n\r\nSoon, a multigenerational family narrative turns into a whirlwind exploration of storytelling, lies, and life. Like the cherished rebozo, or shawl, that has been passed down through generations of Reyes women, Caramelo is alive with the vibrations of history, family, and love.", "asin": "0679742581", "rank": "104403", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/514UQFmeTUL.jpg", "country": "Mexico", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}