{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 119, "rating": 3.0, "reviews": [{"review_sentiment": 2.0, "review_text": "Very well written but in I didn't understand the motivation of the couple in returning to their hosts. Nor did I get the pleasure the baddies got out of their final action (without wanting to give away the plot)."}, {"review_sentiment": 2.0, "review_text": "Disappointing, usually love this author but found the ending disappointing"}, {"review_sentiment": 1.0, "review_text": "This is a horrible tale with no purpose except to display its own horror. The fact that McEwan is such a superb writer only makes it that much the worse. Don't subject yourself to this book."}, {"review_sentiment": 1.0, "review_text": "bad"}, {"review_sentiment": 3.0, "review_text": "I was not blown away by this book. I like the author and his style and some sections were excellent but, on the whole, the book left me cold. Nothing much really happens and when something does it feels contrived.  Not my favorite of Ian McEwan, not even close."}, {"review_sentiment": 1.0, "review_text": "Meaningless story."}, {"review_sentiment": 2.0, "review_text": "I like most of McEwan's books but did not care for this one at all.  It is macabre and not to my liking.  This may be a personal preference in terms of topic because I feel the writing itself is well done it's the topic I object to.  I will continue to read this author but hope I don't encounter any more like this one."}, {"review_sentiment": 5.0, "review_text": "Ian McEwan never ceases to amaze. Arguably the best writer of our time and my favourite author. I've loved all his books.They are simply \"different\""}, {"review_sentiment": 3.0, "review_text": "I have read most of his books, Atonement being one my best ever. I felt this was something from one of his college creative courses."}, {"review_sentiment": 4.0, "review_text": "I would buy Ian McEwan's grocery list.  Probably my favorite author but I'm still having nightmares about this one."}]}, "authors": ["Ian McEwan"], "isbn": "0679749845", "longitude": 12.3345898, "periods": ["1900s"], "title": "The Comfort of Strangers", "word_cloud": "very well write understand motivation couple return host get pleasure baddie get final action want plot disappoint usually love author find end disappointing horrible tale purpose display horror fact superb writer make much worse bad blow away like author style section excellent whole leave cold much really happen something feel contrive not favorite even close story like care macabre like personal preference term topic feel write well do topic object continue hope encounter never cease amaze arguably best writer time favorite author love simply different atonement best ever felt something college creative course grocery list favorite author still nightmares", "genres": ["Fiction & Literature"], "summary": "\"Haunting and compelling.\" The Times \r\n\r\nAs their holiday unfolds, Colin and Maria are locked into their own intimacy. They groom themselves meticulously, as though there waits someone who cares deeply about how they appear. Then they meet a man with a disturbing story to tell and become drawn into a fantasy of violence and obsession.", "asin": "0679749845", "rank": "459812", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/41YUt-qIfSL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}