{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 47, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "This was a very thorough tome on Rembrandt's paintings and his biography.  Very good resource for Rembrandt lovers."}, {"review_sentiment": 5.0, "review_text": "Sometimes books are called \"magisterial,\" to suggest their awesome power and scope, as in \"your majesty,\" royalty. This book lives up to that term. It sweeps across a century of European history, encompassing not only the life and work of one of the world's greatest and most innovative painters (and a world-class etcher and sketcher,too), but also looks deeply at the times that shaped the man and the artistic rivalries and heroes who helped mark his path.The book basically covers Belgium and Holland from the late 16th century through to nearly the end of the 17th century. It began with Antwerp as perhaps the wealthiest city in the world and was when Amsterdam definitively became the world's wealthiest city. Because Amsterdam's wealth was based on trade, its leaders became familiar with and accustomed to art (as well as food, animals, technology, etc.) from around the world. But at the same time, they retained a very parochial sense of what the world was -- with religion at the pinnacle.Into this world, Rembrandt was born (under a slightly different name, as he took or was given the \"van Rijn\" part to reflect his adult decision to move to Amsterdam). His family was prosperous, but not gentry, and he received a good education and was apprenticed at a young age to local artists and then moved up the chain, with more important commissions, as his talent became obvious by age 20.At the same time,  Peter Paul Rubens was the most celebrated painter of the age -- considered a genuine heir to the Italian and Greek masters of antiquity. Rubens had, in fact, lived in Italy for a number of years in his 20s, imbibing the lessons of painting and, especially, sculpture. He brought that muscularity and theatricality to his paintings. And -- important -- Rubens was deeply Catholic and lived in Antwerp, which stayed Catholic during the incessant religious wars of the 16th and 17th century.  The first quarter of this book is more about Rubens than about Rembrandt, and at first it seems a curious decision, like, why do I have to wade through this stuff about Rubens (who I don't even like, as it's way too overdone and way too full of winged cherubs)? But the point is that any artist living in 1600 Europe had to start with Rubens, and then decide where to go from there.Rembrandt, who was from Holland not Belgium (oh, and by the way, Belgium wasn't a nation at the time), copied Rubens for a while. And he did it remarkably well. Sometimes even with a bit of arrogance, such as taking a pose from a famous Rubens painting and putting himself in it. But Rembrandt was not a Catholic; he was a Protestant, and while not on the level of severity of the Calvinists, he had to painting in  less florid style. The book does a great job of explaining why Catholic painting was so over the top, and why Calvinist painting of the same Bible stories or the same formal portraiture of the rich had to be so different.  Basically, Catholics believed that a church painting had to overwhelm its viewers with an emotional attachment to the subject, especially Jesus and his miracles and suffering. This was a direct bond with Jesus and the Holy Trinity -- and it had to be felt by those of high and low education immediately.  Calvinists felt this was blasphemy -- that God wasn't about feeling, but was a distant ruler who preordained whatever was going to happen to you -- and images of the Trinity was idolatry. So they quite literally painted over Catholic images in churches and would allow only art like the 10 Commandments (sounds like Islam's restrictions).  Rembrandt and many other Protestants were in the middle. They didn't go for the Rubenesque over-the-top Catholicism, but they liked their art nonetheless. So he and others developed a more muted, more realistic style to tell the same lurid and inspirational stories.  The heart of the book goes through those details, with literally hundreds of reproductions of images.It also reflected in Rembrandt's decisions throughout his career not to paint idealized people (though he did sometimes). He painted people as they really looked, starting with himself. If they were old, they looked old. If they had a wart, it showed. His women had real flab, and were not copies of Greek ideals. This was scandalous at the time and even for centuries afterwards, as critics and artists argued over whether art should show the ideal or the real.  And it resonates through to today, whenever an artist dares to show an ugly reality.  And Rembrandt was one of the first, and maybe the most prominent, to jump into the fray.The book also details the financial travails of Rembrandt (in contrast to the astounding wealth that Rubens achieved), and the sadness in his life. Like so many others of his generation, he lost children and wives to a series of plagues that came to the Low Country almost every summer, sometimes taking a quarter of the population. Now, that might make you think about God....Anyway, without going into every detail of the book, let's just say that it hits on all levels. It's a biography. It's an deep education -- painting by painting of a master painter -- with tremendous explanations in a page or less of what to look for in various works. It's a cultural history. It's a religious education with explanations I found tremendously helpful. And it explains what made Rembrandt special, especially as he aged and began to go beyond the styles that had been approved in his youth. Rembrandt began to layer his paints thicker and thicker, sometimes blending in ground up glass or ashes or even precious metals to give more texture. He stopped drawing with thin, defined lines -- although he could do it with the best of them.  He wanted to show the truth, not an idealized version of reality. And he broke new ground in painting styles, selecting what to show (such as deeper closeups than other painters, with less attention to backgrounds, so as to give more energy to the key subject).It's all there in this book.  I'll observe that this is not an \"easy read.\" It's deep, it's complicated, and I didn't understand many sections of it. One would probably have to have had a few college art classes to really understand all of it. But I got a lot out of it, and my understanding of art is much deeper than it was before."}, {"review_sentiment": 5.0, "review_text": "What a great read.  I am enjoying learning about the clients who sat for his paintings. I've seen many Rembrandt paintings in person and marveled close up in how he rendered those layers of lace with perfectly placed paint dots. This is an excellent art history book.  The artwork is impeccable and good quality and thus, the book weighs a ton,  I was going to recommend it to read on an overseas trip but it would require you to pay higher baggage fees. On the weekends I have time to have coffee and read and this book has kept me thoroughly entertained for two months now.  The writer is a master of our language and you need a dictionary once in a while.  I like the writing style very much, and always appreciate being able to drop into a different culture at a very different time, which this writer delivers in droves.  I understand Rembrandt's life better and what his paintings, etchings, and hand drawings were all about.  I have a couple of this author's books at home in the queue."}, {"review_sentiment": 5.0, "review_text": "Schama wrote this in a \"baroque writing style\"? Maybe that'ss the problem that caused me to fall in love with it! If Schama could deliver an art history lecture as well as he writes in \"Rembrandt's Eyes,\" I might have ended up changing my major. My God, this book is delicious."}, {"review_sentiment": 5.0, "review_text": "Congratulations.Everything was ok"}, {"review_sentiment": 5.0, "review_text": "Beautiful, sensitive, well-written book about the greatest of all."}, {"review_sentiment": 5.0, "review_text": "Maybe art experts will think this work shallow because it's written in plain words without losing extremely interesting explanations on paintings not only from Rembrandt but of several Dutch masters.I had already read Mr.Schama book on Netherland  history and though Rembrandt's era is mentioned it comes in a way pertaining to this book.I was never a fan of Rubens but this book does even that.I wished all Rembrandt's works mentioned could be found in a single place as this is not possible Reading this book is the second best option"}, {"review_sentiment": 5.0, "review_text": "Essencial para entendê-lo."}, {"review_sentiment": 5.0, "review_text": "As a novice in art history, this book was manna from heaven in appreciating Rembrandt (and Rubens too). Schama points out the details in the paintings that make Rembrandt's  \"people\" such unique individuals - as well as meaningful items or lack of such - an education in how to look at art.  Wrapped up with wonderful history (Schama is a professor in both history and art history).  I enjoyed Embarrasment of Riches and Patriots & Liberators, both history on the Dutch, but the eyes book is a must-read if you like art and witty stories, well researched - a great read."}, {"review_sentiment": 4.0, "review_text": "Wow, 701 pages of endless detail of the life of Rembrandt - and all the people he knew or knew him.The vocabulary of Mr. Schama has led me to nearly wear out my thesaurus.However, his insights paint a detailed picture of the culture and politics of that era.Vastly illuminating!"}]}, "authors": ["Simon Schama"], "isbn": "067940256X", "longitude": 4.8936041, "periods": ["1600s"], "title": "Rembrandt's Eyes", "word_cloud": "thorough tome painting biography very good resource lover sometimes call magisterial suggest awesome power scope majesty royalty live term sweep across century european history encompass life work world greatest innovative painter etcher sketcher also look deeply time shape man artistic rivalry hero help basically cover late century nearly end century begin perhaps wealthiest city world definitively become world wealthiest city wealth base trade leader become familiar accustomed art well food animal technology etc world time retain parochial sense world religion world bear slightly different name take give part reflect adult decision move family prosperous gentry receive good education apprentice young age local artist move chain important commission talent become obvious age time celebrate painter age consider genuine heir italian master antiquity fact live number year imbibe lesson paint especially sculpture bring muscularity theatricality painting important deeply live stay incessant religious war century first quarter first seem curious decision wade stuff even like way overdone way full wing cherub point artist live start decide go oh way nation time copy remarkably well sometimes even bit arrogance take pose famous paint put level severity calvinists paint le florid style great job explain paint top paint bible story formal portraiture rich different believe church paint overwhelm viewer emotional attachment subject especially miracles suffer direct bond felt high low education immediately felt blasphemy feeling distant ruler preordain go happen image idolatry quite literally paint image church art sound restriction many protestant middle go rubenesque like art nonetheless others develop mute realistic style tell lurid inspirational story heart go detail literally hundred reproduction also reflect decision career paint idealized people sometimes paint people really look start old look old wart show woman real flab copy greek ideal scandalous time even century critic artist argue art show ideal real resonates today artist dare show ugly reality first maybe prominent jump also detail financial travail contrast astound wealth achieve sadness life many others generation lose child wive series plague come almost summer sometimes taking quarter population now go detail let say hit level biography deep education paint paint master painter tremendous explanation page le look various work cultural history religious education explanation find tremendously helpful explains make special especially age begin style approve youth begin layer paint thicker thicker sometimes blend ground glass ash even precious metal give texture stop draw thin define line want show truth idealize version reality break new ground painting style select show closeup painter attention background give energy key subject observe easy deep complicate understand many section probably college art class really understand get lot understand art much deeper great enjoy learn client sit painting see many painting person marvel close rendered layer lace perfectly place paint dot excellent art history artwork impeccable good quality thus weigh ton go recommend overseas trip pay higher baggage fee weekend time coffee keep thoroughly entertain month writer master language need dictionary like write style much always appreciate able drop different culture different time writer delivers droves understand life better painting etching hand drawing couple author home queue write baroque write style maybe problem cause fall love art history lecture well write end change major delicious ok sensitive greatest maybe art expert think work shallow write plain word lose extremely interesting explanation painting several already history era mention come way pertain never fan even wish work mention single place possible read second best option essential para novice art history manna heaven appreciate point detail painting make rembrandt people unique individual well meaningful item lack education look art wrap wonderful history professor history art history enjoy history art witty story well research great page endless detail life people know knew vocabulary lead nearly wear insight paint detailed picture culture politics illuminate", "genres": ["Biography", "Art & Architecture", "History"], "summary": "This dazzling, unconventional biography shows us why, more than three centuries after his death, Rembrandt continues to exert such a hold on our imagination. Deeply familiar to us through his enigmatic self-portraits, few facts are known about the Leiden miller's son who tasted brief fame before facing financial ruin (he was even forced to sell his beloved wife Saskia's grave). \r\n\r\nThe true biography of Rembrandt, as Simon Schama demonstrates, is to be discovered in his pictures. Interweaving of seventeenth-century Holland, Schama allows us to see Rembrandt in a completely fresh and original way.", "asin": "067940256X", "rank": "370313", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/716WNSAR87L.gif", "country": "The Netherlands", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}