{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 85, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Interesting and entertaining read. Written 75+ years ago but the book remains highly relevant, especially when read against the backdrop of today's Hollywood sex scandals that are splattered all over the media these days.The author was a Hollywood insider and based his central character on a composite of real life entertainment figures he knew in the business. By reading the book one soon learns that little if nothing has changed in the intervening period (if there's been any doubt).The author's style is freewheeling, a little repetitive, and the Great American Novel it ain't, but I do highly recommend it. \"What Makes Sammy Run\" is one of the best books I've read this year and I've read a bunch."}, {"review_sentiment": 5.0, "review_text": "Wonderful book that I personally highly recommend reading to people of all ages."}, {"review_sentiment": 5.0, "review_text": "I bought this book on a recommendation. So glad I did!As a salesman who reads too many sales books, I really to spice up my reading list with a little fiction. This is a great story! I can relate to Al, as I  have been steamrolled by many alpha males. It goes to show that people like Sammy have to reach an age where the next generation of steamrollers are coming of age and it's only a matter of time before they get a taste of their own medicine.I liked this book so much I bought 'The Harder They Fall'!"}, {"review_sentiment": 4.0, "review_text": "As relevant now as when it was written, we all know a Sammy and as shulberg says In a great, insightful afterword ,the attitude and method has become a norm rather than an exception.  Definitely worth a read."}, {"review_sentiment": 4.0, "review_text": "We all have run into that ruthless individual who tramples on whatever is in their path and Sammy gives us an up close and personal look at the narcissist at work.  This book's main character is as recognizable today as much as it was when the book was written.  I loved the glimpse into old Hollywood and can imagine the baseness described in the book still exists today."}, {"review_sentiment": 5.0, "review_text": "A great and twisted book on typical Hollywood. A must read for writers"}, {"review_sentiment": 5.0, "review_text": "Story about someone who is very successful, who impacts the world and fulfills his desires and ambitions, but who is the last person anyone (decent) would want to be."}, {"review_sentiment": 5.0, "review_text": "Phenomenal"}, {"review_sentiment": 5.0, "review_text": "A hollywood classic.  Nothing's changed.  The heels still win."}, {"review_sentiment": 2.0, "review_text": "For cynics only.  Why does the narrator follow this willful opportunist who uses then disposes?Redeeming value?  Shows the seamy side of Hollywood business:  the theft of intellectual property, collusion with critics . . . .  Fly-over zoners might have some trouble with Yiddish slang: gonif, shtunk . . . .BTW, most of it could have been written by a high school kid.  A modern classic?"}]}, "authors": ["Budd Schulberg"], "isbn": "0679734228", "longitude": 0.0, "periods": ["1900s"], "title": "What Makes Sammy Run?", "word_cloud": "interest entertain year ago remain highly relevant especially backdrop today sex scandal splatter medium author insider base central character composite real life entertainment figure know business read soon learn little nothing change intervening period doubt author style freewheel little repetitive ai highly recommend best year bunch wonderful personally highly recommend read people age buy recommendation glad salesman read many sale really spice read list little fiction great story relate steamroll many alpha male go show people reach age next generation steamroller come age matter time taste like much buy fall relevant write know shulberg say great insightful afterword attitude method norm rather exception worth run ruthless individual trample path give close personal look narcissist work main character recognizable today much write love glimpse old imagine baseness describe still exist today great twisted typical someone successful impact world fulfill desire ambition last person anyone decent phenomenal hollywood classic nothing change heel still win cynic narrator follow willful opportunist use dispose value seamy side business theft intellectual property collusion critic zone trouble slang gonif shrunk write high school kid modern classic", "genres": ["Fiction & Literature"], "summary": "What Makes Sammy Run?\r\n\r\nEveryone of us knows someone who runs. He is one of the symp-toms of our times—from the little man who shoves you out of the way on the street to the go-getter who shoves you out of a job in the office to the Fuehrer who shoves you out of the world. And all of us have stopped to wonder, at some time or another, what it is that makes these people tick. What makes them run?\r\n\r\nThis is the question Schulberg has asked himself, and the answer is the first novel written with the indignation that only a young writer with talent and ideals could concentrate into a manuscript. It is the story of Sammy Glick, the man with a positive genius for being a heel, who runs through New York’s East Side, through newspaper ranks and finally through Hollywood, leaving in his wake the wrecked careers of his associates; for this is his tragedy and his chief characteristic—his congenital incapacity for friendship.\r\n\r\nAn older and more experienced novelist might have tempered his story and, in so doing, destroyed one of its outstanding qualities. Compromise would mar the portrait of Sammy Glick. Schulberg has etched it in pure vitriol, and dissected his victim with a precision that is almost frightening.\r\n\r\nWhen a fragment of this book appeared as a short story in a national magazine, Schulberg was surprised at the number of letters he received from people convinced they knew Sammy Glick’s real name. But speculation as to his real identity would be utterly fruitless, for Sammy is a composite picture of a loud and spectacular minority bitterly resented by the many decent and sincere artists who are trying honestly to realize the measureless potentialities of motion pictures. To this group belongs Schulberg himself, who has not only worked as a screen writer since his graduation from Dartmouth College in 1936, but has spent his life, literally, in the heart of the motion-picture colony. In the course of finding out what makes Sammy run (an operation in which the reader is spared none of the grue-some details) Schulberg has poured out everything he has felt about that place. The result is a book which the publishers not only believe to be the most honest ever written about Hollywood, but a penetrating study of one kind of twentieth-century success that is peculiar to no single race of people or walk of life.", "asin": "0679734228", "rank": "89383", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/5192kRqG2YL.jpg", "country": "Los Angeles", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}