{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 33, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Vividly written by someone who knows every nook & cranny; warts & splendor.  Able to convey an astoundingly complex world in a riveting style"}, {"review_sentiment": 3.0, "review_text": "great city and its stories and history are fascinating, having lived there I can attest to its wonderful storied roads and lanes filled with mystery...the book brings it to life...."}, {"review_sentiment": 4.0, "review_text": "Very enjoyable book with sufficient detail and a lively style. I would definitely recommend this book to anyone travelling to Egypt."}, {"review_sentiment": 5.0, "review_text": "No book has fully captured the essence and spirit of Cairo the way this book did. Written with thorough research and an awe inspiring eye for detail that could only come from an insider, this book is a testimony to the author's unsurpassed experience with the city, its history, its people, and his overriding passion for the place. As a Cairene myself, I have to say my eyebrows were raised more than once at the astonishing detail I thought few people could convey with such command, I caught myself laughing many times at the anecdotes and the Rodenbeck's personal observations. And in more than one place I was driven to tears by the passion I could read between the lines. Thanks to this book I believe I have rediscovered my own home and rebuilt my peace with it (because if you read the book you will understand that Cairo can drive many of its inhabitants quite mad). I fell in love with it all over again, and I really needed to; the recent events and the upheaval, the revolution's ongoing struggle for transformation against stagnation, the chaos and the lawlessness have driven many of us to despair. But Rodenbeck reminded me once again that I live in an ancient city that has seen so much more than I can take. He assured me, \"Whatever challenges it may face, Cairo will surely endure. By the grace of Allah, for another five thousand years.\"I just know it will."}, {"review_sentiment": 5.0, "review_text": "An outstanding concise insightful documentation of not only the history of one of the oldest and greatest cities of the world, but of Egypt in total. The author showed a remarkable local knowledge, exposed to egyptians of different intellect and psychosocial backgrounds, he managed to convey a true story of what is going on now and always compare it to what was happening in the distant past. I was born and lived in Cairo myself till my late twenties, then moved on to the rest of the world and has found this remarkable review after reading an incredible article about Egypt written in the Economist magazine by the same author. After reading it in a soft cover I went and purchased the hard cover version as this is a book I would hope my kids would get to read one day. If you are planning a trip to Cairo or if you are a true scholar this book is your key to the gates of the city, so enjoy."}, {"review_sentiment": 5.0, "review_text": "Max Rodenbeck wrote this book as though, he was speaking to me on a cafe, somewhere by the Nile.I am Egyptian, and thought I knew a lot about Cairo, but after reading this, its a shame to say that I learned a plethora of things from Rodenbeck. Every page is filled with information, leaving you wanting more. I love how he doesn't get in the way of telling us about Cairo - I just wonder, how did he find out all those juicy tidbits about Cairo and he isn't even Egyptian nor a true Cairene?! I did not want to finish the book as I would want to learn more about Cairo. Excellent work, would love to see more."}, {"review_sentiment": 3.0, "review_text": "This is a generally well-written and decently translated history of the Egyptian capital.  There is more information and detail than you want at times, but the personal stories and narratives compensate for the over verbiage.  Worth reading if you're planning a trip to Cairo."}, {"review_sentiment": 4.0, "review_text": "Max Rodenbeck, who has lived much of his life in Cairo, reveals the city through its long and varied history--from the Creation myth of On to the year 2000 with its \"quickening sense that Cairo is on the verge of change.\"  When I finished this book, I felt I understood more about the place and the people, about the evolution of the city through many eras.  In the final chapter, writing about the contemporary political situation, Rodenbeck provides a list of the events that point to \"looming dangers\":  \"The Iranian revolution and civil war in Algeria, continuing Israeli colonization of the Occupied Territories, the Gulf War, and the arrival of American troops on Arab lands...\"  With the September 11 and other terrorist attacks around the world, the on-going war in Afghanistan, the American occupation of Iraq, and other events that have further destabilized the region, I wonder what Rodenbeck would now say about the prognosis for this city that both fascinates and irritates him--as only one's home town can."}, {"review_sentiment": 3.0, "review_text": "I'll be visiting Cairo next month so i wanted to read something about this city.The book is not bad when it comes to history.The author explains the political,economical and social changes with accuracy and insight.However he lets out,what i believe, important history about the city.He doesnt go into details regarding The Citadel or the islamic buildings in the city.He just mentioned them when it is relevant to the story his telling.I felt that, as i was going to be a first time visitor to the city, i wasnt getting all the neccesary info or inside scoop on the monuments ,buildings and landmarks that makes Cairo a great city.I think the author falls short in this regard.But as an introduction to the city itself is very good and gives color to the account."}, {"review_sentiment": 5.0, "review_text": "As an American ex-pat living in Cairo for the past four years--with all the resultant emotions and biases inherent in that--Rodenbeck's history has taken my somewhat jaded view of Cairo and reinvested it with a sense of awe and appreciation.  Three-fourths of the way through the book, I have a long list of sites to visit--places I hadn't heard of, let alone seen--and an increased understanding of this complex city and its contrasts.  Rodenbeck fills the book with wonderful bits of trivia ( it was possible in 16th century Cairo to make a living as a professional farter!) to round out his broader explanation of the sweep of Cairene history.  Other reviews take him to task for his lack of thoroughness, but that was not his goal.  If you're looking for a highly readable and insightful overview of Cairo from the end of the last Ice Age to the present, this is the book!"}]}, "authors": ["Max Rodenbeck"], "isbn": "0679767274", "longitude": 31.243666, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases", "1500s", "500-1400s", "0-500s", "Pre Common Era"], "title": "Cairo: The City Victorious", "word_cloud": "vividly write someone know nook cranny wart splendor able convey astoundingly complex world rivet style great story history fascinate live attest wonderful storied road lane fill mystery brings life very enjoyable sufficient detail lively style definitely anyone travel fully capture essence spirit way research awe inspire eye detail insider testimony author unsurpassed experience history people override passion place say eyebrow raise astonish detail think people command catch laugh many time anecdotes personal observation place drive tear passion line believe rediscover home rebuilt peace understand drive many inhabitant quite mad fell really need recent event upheaval revolution ongoing struggle transformation stagnation chaos lawlessness driven many despair remind live ancient see much take assure challenge surely endure grace year know outstanding concise insightful documentation history oldest greatest city world total author show remarkable local knowledge expose egyptian different intellect psycho social background manage convey true story go always happen distant past bear live till late twenty move rest world find remarkable review read incredible article write magazine author read soft cover go purchase hard cover version kid day planning trip true scholar key gate enjoy write speaking cafe somewhere egyptian thought know lot reading shame say learn plethora thing page fill information leave wanting love way tell wonder find juicy tidbit even true want finish learn work generally decently translate history egyptian capital information detail want time personal story narratives compensate verbiage read plan trip live much life reveals long vary history myth year quicken sense verge change finish felt understood place people evolution many era final chapter write contemporary political situation provide list event point loom danger iranian revolution civil war continue colonization arrival american troop arab land terrorist attack world war occupation event destabilized region wonder prognosis fascinate irritate home town visit next month want something bad come author explain political economical social change accuracy let believe important history doesn't go detail regard islamic building mention relevant story felt go first time visitor wast get necessary info scoop monument building landmark make great think author fall short introduction good give color account american living year resultant emotion bias inherent history take somewhat jaded view reinvested sense awe appreciation way long list site visit place hear alone see increase understanding complex contrast fill wonderful bit trivia possible century make live professional rafter round broader explanation sweep history other review take task lack thoroughness goal look highly readable insightful overview end last present", "genres": ["History", "Politics", "Ancient Civilizations", "Urbanism"], "summary": "A dazzling cultural excavation of one of the world's greatest cities--from its ancient beginnings, through the heights of medieval splendor, to the present day--by a gifted writer who has spent much of his life in Cairo.\r\n\r\nThe seat of pharaohs and sultans, the prize of conquerors from Alexander to Napoleon, Cairo has never stopped reinventing itself. Even in this century, as Max Rodenbeck shows us, the city has transformed itself yet again--from a glamorous European outpost into the nationalistic capital of the Arab world. \r\n\r\nAnd, most recently, we have been witness to contemporary Cairo grappling with a population explosion that strains every aspect of city life beyond capacity. From its vantage atop the plateau of Giza, the Sphinx has witnessed it all: forty-five centuries of a city evolving on the river plain below it. \"The Victorious\" is what Arabs call Cairo, and its indomitable spirit still merits the name.\r\n\r\nTo this richly textured story Rodenbeck brings a keen eye for telling detail, gained from years of wandering Cairo's markets, chatting in its cafés, and burrowing in its dusty libraries. From the hashish dens to the salons of contemporary Cairo, Rodenbeck explores the city's stark contrasts. Ancient tombs abut skyscrapers and genteel colonial mansions, and the people, pulled  between the cultural poles of Paris and Mecca, struggle with the double burden of an incomparably rich past and a challenging future. \r\n\r\nWith wit and an understanding that comes from a deep-seated love of the place, Rodenbeck brings Cairo to life in all its chaotic beauty. Fusing the excitement of travel with the stimulation of history, Cairo: The City Victorious is an epic, resonant work.", "asin": "0679767274", "rank": "892806", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51OpDWO8o6L.jpg", "country": "Egypt", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}