{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 109, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "A personal favorite"}, {"review_sentiment": 5.0, "review_text": "This is a great book! It was at first difficult and confusing to read but what transpired later on in the book turned out to be timeless and beautifully written. I got the chills from reading this."}, {"review_sentiment": 2.0, "review_text": "Did not love this book and may not have finished it if it wasn't my book club's selection.  There were pages where I had no idea what the author was talking about.  Historically there were some interesting parts re: the building of the tunnel in Canada."}, {"review_sentiment": 5.0, "review_text": "This book tells the story  of Patrick, living in Canada backwoods and then Toronto, and his life of adventures with others—two women he loves, Alice and Clara who are friends; a thief named Caravaggio; a millionaire, Ambrose, who weaves through these women’s lives; a nun he saves. The writer goes back and forth in time and place.As usual, the writing is poetic, insightful, subtle, complex. The book is full of exquisite description, mixing emotion with motion, action and reaction with detail. He writes the sensual and sensitive,  visual and visceral into every scene. He is a true poet!"}, {"review_sentiment": 3.0, "review_text": "Before I this book, I read The English Patient by the same author.  His prose is as beautiful and graceful as poetry or ballet.  However, if you were to ask me specific questions about either of them about what happened to this one and why, did do-and-so get together with the other, why did so-and-so do that crazy thing he did, did he save her from the war,when and why did he do what he did, DID he do that, etc., my answer to you would be, \"I don't have the vaguest idea.\"  I read this book to read more flowing prose, but maybe this time, I'd be practiced enough to speak informatively and correctly these veiled stories.  Well, I am here to tell you to \"GIVE UP\".  If you do figure out all the characters, then I'll send you my 30 and 30 questions about each one, I'll have my friends send them to you.  We'll have a huge party to understand it all.  Perhaps we'll charge for attendees and put out small refreshments.  That TRULY is the best way!!!  Now someone volunteer,!! When will we meet?"}, {"review_sentiment": 5.0, "review_text": "You haven't read it?It is one of the best novels ever written."}, {"review_sentiment": 2.0, "review_text": "Not my style of books"}, {"review_sentiment": 2.0, "review_text": "just so so."}, {"review_sentiment": 1.0, "review_text": "This book is absolutely absurd. The character development of the main character \"Patrick\" is next to non-existent. This book has no sense of pacing either. One moment they're working at a leather tannery, and in the next paragraph they're sucking semen through each others teeth. The main character because clinically insane half way through without any explanation. All in all, this book is just a slew of artsy metaphors and awful characters making the worst possible decisions at the worst possible times mixed with sudden over-the-top erotica. Don't read this book if you value a good story."}, {"review_sentiment": 4.0, "review_text": "Beautiful writer, but not what I expected."}]}, "authors": ["Michael Ondaatje"], "isbn": "0679772669", "longitude": -79.387207, "periods": ["1900s"], "title": "In the Skin of a Lion", "word_cloud": "personal favorite great first difficult confuse transpired later turn timeless beautifully write get chill read club selection page idea author talk interesting part build tunnel tell story living backwoods life adventure woman love friends thief name millionaire weave woman live nun save writer go back forth time usual writing poetic insightful subtle complex full exquisite description mix emotion motion action reaction detail write sensual sensitive visual visceral scene true poet author prose beautiful graceful poetry ballet however ask specific question happen get together crazy thing save war answer vaguest idea flow prose maybe time practice enough speak informatively correctly veil story tell figure character send question friends send huge party understand perhaps charge attendee put small refreshment best way now someone volunteer meet best novel ever write not style absolutely absurd character development main character sense pace moment work tannery next paragraph suck semen others teeth main character clinically insane half way explanation slew artsy metaphor awful character make worst possible decision worst possible time mixed sudden erotica value good story beautiful writer expect", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In the Skin of a Lion is a love story and an irresistible mystery set in the turbulent, muscular new world of Toronto in the 20s and 30s.\r\n\r\nMichael Ondaatje entwines adventure, romance and history, real and invented, enmeshing us in the lives of the immigrants who built the city and those who dreamed it into being: the politically powerful, the anarchists, bridge builders and tunnellers, a vanished millionaire and his mistress, a rescued nun and a thief who leads a charmed life.\r\n\r\nThis is a haunting tale of passion, privilege and biting physical labour, of men and women moved by compassion and driven by the power of dreams -- sometimes even to murder.", "asin": "0679772669", "rank": "155764", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51TAo5NAK0L.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}