{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 51, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "brilliant, good product, prompt shipping, good packaging. thanks!"}, {"review_sentiment": 2.0, "review_text": "This text is complex.  Good for a graduate student comfortable with dense material and prepared with background knowledge, not so great for a casual tourist seeking to get ready for a trip."}, {"review_sentiment": 1.0, "review_text": "It was very dry.  Not my kind of reading material.  I only got through 60 pages and stopped reading the book.  I was told by a few other people who said it was a good and interesting book to read.  Again. not my kind of book to keep my interest."}, {"review_sentiment": 4.0, "review_text": "Excellent and fact-packed assessment of the origins of Dutch character, at least from Schama's point of view, in the Golden Age.  It's dense reading, and Schama assumes more knowledge of Dutch history than I have so it's tough going sometimes.  Occasionally, I think a more merciless editor might have helped make it more accessible to a lay reader, but that said, I'm impressed by the breadth of the work, and am learning a lot.  If you're willing to dig in, I'd recommend it."}, {"review_sentiment": 4.0, "review_text": "This is a little heavy going, lots and lots of detail. I enjoyed it but did skim some sections. Maybe that's the key, read the parts you want and skip the rest. The book is so long and thorough that you'll still get your money's worth."}, {"review_sentiment": 5.0, "review_text": "The book came in great shape."}, {"review_sentiment": 5.0, "review_text": "I like it very much, but then I like everything written by Simon Shama. It is both a historical book and about capitalism and helps to understand not only the Netherlands in the 17th. Century but also modern capitalism."}, {"review_sentiment": 5.0, "review_text": "Simon Schama - - no matter what his subject - - is worth every second spent with him.  This book is endlessly fascinating, and I learned things I'd never heard about (and I'm Dutch!).  He gave me new insight into the great paintings and the incredibly rich life of the Dutch golden age, and I'm recommending this book to everyone with a love of art, history, culture - - or simply great writing.  Buy it!!  You'll be riveted and enchanted."}, {"review_sentiment": 5.0, "review_text": "Halfway through now, and it is hard to put down (except for those passages where the author does seem to take along time to get over dwelling on some particular (art) pieces to put in context). Having said that, the very same thing that makes it so intriguing and interesting, that is being able to explain context and add nuance before trying to draw a conclusion, can make it a challenge to get thru, at times. If you stick with it though the insight that's gained is uniquely valuable, and changes your view on history, if you had already formed some (for some reason, i.e. by roots, like me), forever. The most surprising aspect of reading though, when you're native, or somehow have a connection with the subject already (i.e. by birth, descent, etc.), is that many traits in the attitudes, culture are recognizable, as in still present today.In other words; what Schama is giving us is a time travel that allows one to understand how the particulars of a people, country, culture, came into being, and in that way you learn about yourself (if applicable), or your friend, your colleague, your ancestry, etc., (fill in as applicable). Schama does presuppose a certain amount of historic knowledge though, by way of making references that will be totally lost on you if you don't possess that. And he's not filling in, nor repeating, all the historic conflicts, details, etc., (in all honesty, it would need to send me back to 'history class'); that's not what the book is about; it is focusing and refocusing on the general attitudes and popular sentiments that prevailed time and again in the Netherlands through the 17th century. Schama does so with his uncanny talent to portray times as if you live in them, to bring them back to life, with the help of detail, art, and his hard to match talent for story-telling."}, {"review_sentiment": 4.0, "review_text": "Very interesting read. A deft rendition of the period and its value and influence in subsequent centuries."}]}, "authors": ["Simon Schama"], "isbn": "0679781242", "longitude": 4.8936041, "periods": ["1600s"], "title": "The Embarrassment of Riches: An Interpretation of Dutch Culture in the Golden Age", "word_cloud": "brilliant good product prompt ship good packaging thanks text complex graduate student comfortable dense material prepare knowledge great casual tourist seek ready trip dry not kind read material get page stop read tell people say good interesting kind keep interest excellent assessment origins character least schema point view dense read assumes knowledge history tough go sometimes occasionally think merciless editor accessible lay say impress breadth work learning lot willing dig recommend little heavy go lot lot detail enjoy skim section maybe key part want skip long thorough still money worth come great shape like much like everything write historical capitalism help also modern capitalism matter subject worth second spent endlessly fascinate learn thing never hear give new insight great painting incredibly rich life recommend everyone love art history simply great write rivet enchant hard put passage author seem time dwell particular art piece put say thing make intrigue interest able explain context add nuance try draw conclusion make challenge get thru time stick insight gain uniquely valuable change view history already form reason root forever surprising aspect read native somehow connection subject already birth descent etc many trait attitude recognizable still present word give time travel allow understand particulars people country come way learn applicable friend colleague ancestry fill applicable presuppose certain amount historic knowledge way make reference totally lose posse fill repeat historic conflict detail honesty back class focusing refocus general attitude popular sentiment prevail time century uncanny talent portray time live bring life help art hard match talent very interest deft rendition period value influence subsequent century", "genres": ["History", "Politics"], "summary": "Schama explores the mysterious contradictions of the Dutch nation that invented itself from the ground up, attained an unprecedented level of affluence, and lived in constant dread of being corrupted by happiness. \r\n\r\nDrawing on a vast array of period documents and sumptuously reproduced art, Schama re-creates in precise detail a nation's mental state. He tells of bloody uprisings and beached whales, of the cult of hygiene and the plague of tobacco, of thrifty housewives and profligate tulip-speculators. He tells us how the Dutch celebrated themselves and how they were slandered by their enemies. ", "asin": "0679781242", "rank": "108460", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/51D6tOLu4jL.jpg", "country": "The Netherlands", "story_arc": ["Tragedy", "Things only get worse"]}