{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 7, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "It might be forgivable for a beginner novelist to write book which is so long but totally lacks any development of characters. But to claim that this book series be \"highly acclaimed\" would be a big stretch.Indeed, book sets the stage in a city of Mooran, and within 560 pages fails to move elsewhere, except brief mentioning of trips to the US or Mecca. All right, even in static circumstances the author could have thought of some events, maybe court intrigues, love affairs, assassinations, etc. - the kind of things our life has plenty of. Instead, the author describes a bunch of self-sufficient people who just happened to be close friends of Sultan, and these people simply waste the lives as time goes by. Well, by \"wasting\" I mean that they build palaces, buy luxury cars, and some of them even create philosophical theories. Maybe this is indeed what happens in Arab world, which I am not very familiar with, but politics in the US and Europe is much more dynamic, nowadays as well as before.So, the author presents those rulers as totally uninteresting, boring people. All right, if that is the case, why spend 500+ pages describing them? Sometimes, I have impression that the author was paid on per-page basis, so he was simply working as \"typewriter\" - just type what comes up to your head, and God will sort it out..."}, {"review_sentiment": 3.0, "review_text": "This is the second book of the trilogy by Abdelrahman Munif.  Although I'm sure that these books are very meaningful to citizens of Saudi Arabia, I had a hard time relating.  I have read all three but the first book, \"City of Salt\" was my favorite."}, {"review_sentiment": 5.0, "review_text": "\"The Trench\" is the second book in a trilogy commencing with \"Cities of Salt.\"  Munif's novels are thinly disguised accounts of events in Saudi Arabia, commencing with the discovery of oil by the Americans in the Eastern Provence, and its impact on the inhabitants.  This book spans a decade, roughly corresponding to the rule of King Saud (Khazael in the novel), from 1953, with the death of the nation's founder, King Abdul Aziz (Khureybit) to 1962, when Faisal (Fanar) assumed active control of the government. Whereas \"Cities of Salt\" was largely set in Dhahran (Harran), \"The Trench\" is set in the capital, Riyadh (Mooran).It is a great novel, rich with insights into the human condition that transcends the Saudi setting. The rush of modernization, coupled with the nostalgic loss of traditional values. There is the corruption and scheming that money can inspire. Munif might present it in a satirical, even tongue-in-check way, but there are numerous lessons in \"statecraft\" that are worthy of \"The Prince.\" Munif displays a full palette of characters, major and minor, most, plausibly developed. I could almost hear Munif chuckling to himself as he wrote about Dr. Subhi Al Mahmilji evolving his \"Square Theory.\"  Clearly Munif possessed visceral contempt for at least one person who had wormed himself into the King's inner court. There are the dynamic complexities of family relationships, and there is some love, and much lust and sex. I found the appointment and evolution of the first head of intelligence, Hammad Al-Mutawa particularly well done, and fascinating. Certainly one of the most sympathetic characters was the \"crazy radical,\" Saleh Al-Rushdan, whose horse-shoeing skills became obsolete with the introduction of the motor car, but could always be counted on \"to tell it like it is,\" and whose fate Munif might have feared himself. Mohammed Eid's vital support of Dr. Al Mahmilji was described in the first novel, so the disappointment of his marital aspirations and rejection was quite poignant. For all of Munif's words there is little descriptive power, but there was a beautiful exception when he wrote of  Khazael's desert visit with: \"the sun diffidently, almost lazily, caressed the sand and cleansed away the night' dew....(p 502).Like other reviewers at Amazon, I was amazed by the Kirkus Review - clearly the \"professionals\" churn out \"good copy,\" but how many pages have they actually read? And there is the review from the New York Review of Books printed on the back cover that says the novel evokes a \"the royal court of an obscenely rich monarchy.\" This is at the time in which Saud essentially bankrupted the country; electric power was slowly being installed and quality medical care had to be obtained abroad. Missing are the Saudi reviewers who had a true feel for that era - or for that matter, any Saudi reviewer. I'd love to know if Faisal spent much time traveling due to poor health prior to assuming control in '62 - which I had not heard previously... and if tanks played a part in the transfer of power in that year.  If neither of these actually occurred, reasonable speculation on Munif's motives for inventing these details would be appreciated. In terms of the role of women, one reviewer described them as \"very limited,\" which certainly seemed belied by the philandering of Widad, who exhibited a woman's classic skills, and desires.I found this novel a better read than \"Cities of Salt,\" primarily due to the lack of the \"magic realism\", and although it was dealing with the real concept and fears of djinns, I felt it did not work.  I also found Munif's use of dramatic tension much more compelling in this novel, yes, page turning even. Therefore I gave it a full 5-star rating, though 4.5 might be much more appropriate. I feel that a note from the publisher, as well as translator might be appropriate.  It helps to consider a book like \"War and Peace,\" and be specifically told that a character might have three different names, involving the familial relationships, using \"Abu\" and \"Umm\" (Father and Mother of) as well as \"Ibn\" (son). Also, like I was once advised in school, concerning War and Peace, it helps to make your own list to keep it all straight. The translator, Peter Theroux, appeared to do a good job, but some notes of the translation, and the ambiguities with certain words, and possible double-entendres with proper names would have been appreciated. As for Munif, I still think he is too wordy, certainly not in the descriptive sense, where he is light, but in terms of the conversations, some of which could easily be omitted.  Also, despite the pages, I do not feel he provided sufficient motive to the reader for Fanar's actions at the end of the book.On a person note, during the `80's and `90's, I saw four physicians, three Saudi, one American, use their medical practice to catapult themselves into the Royal inner circle, like Dr. Al Mahmilji did. All but one had similar denouements. Vis-à-vis the United States, this seems to be a cultural and governmental difference.  It's much rarer for a medical practitioner to gain such influence over governmental leaders - though an astrologer seemed to have significant influence over Nancy Reagan, and she over her husband.Overall, a very important, unique and vital work that covers the Kingdom as few others do. It is great literature that is both anchored to its time and place, and transcends them."}, {"review_sentiment": 5.0, "review_text": "I consider myself a professional reader but took a long time to get through this novel; most readers--I suspect--should not pick it up thinking that it's a casual read.  Two reasons: The author, Abdelrahman Munif (1933-2004) takes us across unfamiliar territory, inside a Persian Gulf nation during its transition from camel-herding to skyscrapers (1955 to about 1962), and, secondly, the characters's dialogues and unspoken thoughts are recorded so precisely as to be journalistic or sociological.  Here's what I mean: it's obvious that as oil money flows to the top people, i.e., the Sultan and his family and friends, the people at the bottom of the social ladder (camel and sheep herders, farriers, and lower tradespeople) find their peaceful villages razed or turned upside down to accommodate the Sultan's desire for palaces and shopping.  As a compensation for the loss of village life, the Sultan showers gifts of cars and cash on people lower down the social ladder, but the forces of social change are too fast for most and they see the Sultan's financial generosity as either waste or a power play.Secondly, the relationships among characters, including their interior thoughts, are detailed because the author felt that if he painted his canvas with light, impressionistic brush strokes no one would believe the story he had to tell.  Munif used precise, reporter-like quotations in all conversations.  This necessity for detail accounts for the 554-page length, but the reader will see why.  The novel could not have been a page shorter, in my view, because the exhaustive detail shows us how regulated Saudi life is/was, how every individual must have a strategy for survival, how relationships and loyalties are characterized by suspicion and arbitrary emotion.  At times, when the scenes showed that a character's emotions were over-the-top, or over-drawn, and paranoid, I felt I was reading a satire by Jonathan Swift during the early days of struggle with Britain's own absolute monarch.The author never mentions \"Saudi Arabia,\" but he mentions other nations; so I figure that by default the setting is S.A.  The identity of the two cities (former villages) of Mooran and Harran become clearer if you consult a good map: Harran in the novel is a seaport, Dhahran, and Mooran (the village that is wantonly leveled for palaces and skyscrapers) might be the capital Riyadh.  It seems to me that the author, Munif, was a good Muslim, and would never have written anything about Mecca or Medina, the holy cities; blasphemy would have been contrary to the novelist's art, this tale of modernity coming to Muslim towns.The arc of the novel is determined by the career of Dr. Subhi Mahmilji, his rise as the Sultan's counselor and Palace insider.  Mahmilji is the only character who is in the entire novel from the beginning to almost the end.  Several things are `untranslated' from the author's original Arabic; many characters seem to have two names, but I had read somewhere that \"Abu\" is a title of respect for men, \"Umm\" or \"Ummi\" for women.  In other words, Dr. Mahmilji is also Abu Ghazwan.  It's clear that the original audience for this tale of culture clash and turmoil was Arabic reading people; even in English translation, the novel has an insider feel to it partly because there are no American characters, except by brief mention, and the Doctor's son goes to an American college.Another paradox: there is no trench in The Trench; the title is metaphorical, it seems, for the ditches or abysses which people dig for themselves, e.g., you dug your ditch, now lie in it, or a trench as a predicament so deep that you can't see the bottom.  I won't spoil it for you, but notice the development of Widad, the doctor's wife, also look for Muhammed Eid, Abdelaziz al-Ghamdi, Hammad al-Mutawa the head of the Security Agency, Rateb, Samir Caesar, Umm Hosny, the Sheikha, and Prince Fanar.The author seems to identify with the camel-herders and working class characters like Shamran al-Oteibi, the manager of the outdoor market, and his son Najm, the bookstore owner, and Saleh al-Rushdan, men who are developed more after the novel's half-way point when they find some solace in Zaidan's Coffeehouse (after the village has been totally rebuilt from oil revenues).  Also, the reader should keep in mind that because the setting is the late 1950s, roles for women are very limited; with only marriage and shopping as possibilities, there is little that Widad and Umm Hosny can do, but they are fully-developed characters.  Few people escape Munif's observation and his analysis.  I am thankful that he wrote as he did, that he was able to get it published, and that I went the distance with his tale.  Perhaps, Munif saw the changes coming in Arab and Muslim societies; in retrospect, this novel could be an argument that only a system of democracy can handle oil wealth as a national asset not the private money of those at the top of the food chain."}, {"review_sentiment": 5.0, "review_text": "Part 2 of his trilogy, following Cities of Salt, is an intelligent and interesting continuation of a fascinating place and time. First, I strongly agree with reviewer Mr. Maclean in his comment about the Kirkus review! What book did the Kirkus reviewer read?As I stated in my review of Cities of Salt, this is more a story of a fictional Middle Eastern nation moving from a tribal to a 20th Century economy with all the societal, political and cultural upheavals that implies. Munif uses the personalities of his characters more than actual events to tell this part of the trilogy's story.This is NOT a book about the evils of the \"West\" or about those nasty folks destroying all that was good about their country. It is about the growing pains felt by all countries trying to grow up and be a part of the rest of the world. Sure, there are opportunists, double-dealers, etc. but there were some of the same in their \"old\" tribal society, too.  This is revelatory rather than reactionary.Please read this, BUT read Cities of Salt first; and don't read into it what Munif didn't put into it!!!!"}, {"review_sentiment": 5.0, "review_text": "This is indeed part two of a trilogy; the first book is \"Cities of Salt,\" and the last is \"Variations on Night and Day.\" However, Western readers are likely to be confused by the thread of narration; Book 1 describes the effects of American oil industry on the fictional Sultanate of Mooran (1940's?) while #2 dispenses with the Americans to focus on the intrigue and cultural shifts in the sultanate (1950's?).  Book 3 returns to before the discovery of oil, and features the British-born Hamilton, modelled largely on St. John Philby (father of Kim Philby).I am very sorry to have to refute the incredibly snide Kirkus Associates review, which joyfully embraces the trope of squalid, vile Yanks and noble, complex Britons. Kirkus' reviewer needs to actually read what the writer says rather than regurgitate his own prejudices.  Mooran has nothing whatever to do with Jordan; it is clearly a medley of Saudi Arabia and the Trucial States (for one thing, there is not a significant volume of oil in Jordan).  It's difficult to make the case that the Doctor's son, who indeed attends graduate school in San Francisco, is corrupted by \"American values\" (whatever the hell those are!); the only Americans he interacts with are employees of the State Department, and are agents of state policy, not \"American values.\"  This book describes an entirely different world from either Iraq or Kuwait, and the reason Munif \"cannily\" keeps the USA or the oil offstage is that he's done with them.Munif does indeed write about what he feels like, and the vignettes are narrated in whatever sequence he wants.  He returns to earlier points in each narrative to achieve whatever point he needs to make.  This is not an especially clear-cut polemic against any nationality; the Arabs are perfectly capable of acting on their own \"values\" (they're not \"half devil and half child\"); it is LITERATURE, and very fine literature at that.  It involves very rich and vivid character development; the characters have their own motives and respond to events in plausible ways. It is a sad and tiresome business to spend so much time refuting another's review, but readers would be justly deterred if they believed Munif was merely ranting against some vile alien influence.  He is not; his narrative is a beautifully and spontaneously woven fabric woven from existentially human threads."}, {"review_sentiment": 5.0, "review_text": "This great book came to a thrilling non-ending.  The final page, 524, ended in mid-sentence.  Where was the next page?  Not in my edition.  I'd love to know how it all ends.....Is this why it's the second part of a trilogy?"}]}, "authors": ["Abdelrahman Munif"], "isbn": "0679745335", "longitude": 0.0, "periods": ["1900s"], "title": "The Trench", "word_cloud": "beginner novelist write long totally lack development character claim series highly acclaim big set stage city page fails move elsewhere brief mention trip right even static circumstance author event maybe court intrigue love affair assassination etc kind thing life plenty instead author describe bunch people happen close friend sultan people simply life time go well waste mean build palace buy luxury car even create philosophical theory maybe indeed happen arab world familiar politics much dynamic nowadays well author present ruler totally uninteresting bore people right case page describe sometimes impression author pay basis simply work typewriter type come head sort second trilogy sure meaningful citizen hard time relate first favorite second trilogy commence novel thinly disguise account event commence discovery oil impact inhabitant span decade roughly corresponding rule death nation founder assume active control government largely set set capital great rich insight human condition transcends set rush modernization couple nostalgic loss traditional value corruption scheme money inspire satirical even way numerous lesson statecraft display full palette character major minor plausibly develop almost chuckle write evolve possess visceral contempt least person worm inner court dynamic complexity family relationship love much lust sex find appointment evolution first head intelligence particularly well do fascinate certainly sympathetic character crazy radical skill become obsolete introduction motor car always count tell fate vital support describe first disappointment marital aspiration rejection quite poignant word little descriptive power beautiful exception write desert visit sun diffidently almost lazily caressed sand cleanse away night dew p reviewer amazon amaze clearly professional churn good copy many page actually print back cover say evokes royal court obscenely rich monarchy time essentially bankrupt country electric power slowly installed quality medical care obtain abroad miss reviewer true feel era matter reviewer love know spend much time travel due poor health prior assume control hear previously tank play part transfer power year actually occur reasonable speculation motives invent detail appreciate term role woman reviewer described limit certainly seem belied philander exhibit woman classic skill find better primarily due lack magic realism deal real concept fear djinns felt work also find use dramatic tension much compel yes page turn even give full rating much feel note publisher well translator help specifically tell character different name involve familial relationship use well son also advise school concern help list straight translator appear good job note translation ambiguity certain word possible proper name appreciate still think wordy certainly descriptive sense light term conversation easily omit also page feel provided sufficient motive action end person note saw physician use medical practice catapult inner circle similar denouement seem cultural governmental difference much rarer medical practitioner gain influence governmental leader astrologer seem significant influence important unique vital work cover others great literature anchor time place transcends consider professional take long time get reader suspect pick think casual reason author take unfamiliar territory nation transition skyscraper secondly character dialogue unspoken thought record precisely journalistic sociological here mean obvious oil money flow top people family friends people bottom social ladder camel sheep herder farrier lower tradespeople find peaceful village raze turn upside accommodate desire palace shopping compensation loss village life shower gift car cash people lower social ladder force social change fast financial generosity waste power relationship character include interior thought detail author felt painted canvas light impressionistic brush stroke story tell use precise quotation conversation necessity detail account see shorter view exhaustive detail show regulate life individual strategy relationship loyalty characterize suspicion arbitrary emotion time scene show character emotion paranoid felt read satire early day struggle absolute author never mention mention nation figure default set identity city former village clearer consult good map seaport village wantonly level palace skyscraper seem author good never write anything holy city blasphemy contrary novelist art tale modernity come arc determine career rise counselor insider character entire beginning almost several thing author original many character seem name somewhere title respect men woman word also clear original audience tale culture clash turmoil reading people even translation insider feel partly american character brief mention son go american paradox title metaphorical seem ditch abyss people dig dug ditch lie predicament deep bottom notice development doctor wife also look head author seem identify work class character manager outdoor market son bookstore owner men develop point solace village totally rebuilt oil revenue also keep mind set late role woman limit marriage shopping possibility little character few people escape observation analysis thankful write able get publish go distance tale perhaps saw change come society retrospect system democracy handle oil wealth national asset private money top food chain trilogy follow intelligent interesting continuation fascinate place time strongly agree reviewer mac lean comment reviewer state review story fictional nation move tribal economy societal political cultural upheaval implies use personality character actual event tell part trilogy evils nasty folk destroy good country grow pain felt country try grow part rest world opportunists etc old tribal society regulatory rather first put indeed part trilogy first last variation however western reader likely confuse thread narration describe effect american oil industry fictional dispenses focus intrigue cultural shift sultanate return discovery oil feature model largely father sorry refute incredibly snide review joyfully embrace trope squalid vile yank noble complex reviewer need actually writer say rather regurgitate prejudice nothing clearly medley thing significant volume oil difficult case son indeed attend graduate school corrupt american value hell interacts employee agent state policy american value describe entirely different world reason cannily keep oil offstage do indeed write feel vignette narrate sequence want return earlier point narrative achieve point need make especially polemic nationality perfectly capable act value devil half child fine literature involve rich vivid character development character motif respond event plausible way sad tiresome business much time refute review reader justly believed merely rant vile alien influence narrative beautifully spontaneously woven fabric weave existentially human thread great come thrill final page end next page not edition love know end second part trilogy", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "From one of the most highly regarded writers of Arabic literature, Trench is the second volume in the epic quintet Cities of Salt. Tracing the economic history of the Arabic world, Munif picks up where Vol. I left off, with the effects of the discovery of oil reserves in the region beginning to show their true colors. \r\n\r\nFollowing The Doctor as he is invited by the Sultan of Harran, the character watches as the royalty succumbs to corruption and greed, and in turn, the political and natural destruction of his homeland. \r\n\r\n“Munif’s wonderful novel is a welcome corrective. . . . [It] deepens, enriches and above all humanizes whatever sense of Arab culture we may have.\" The New York Times ", "asin": "0679745335", "rank": "190956", "city": "Saudi Arabia", "image": "https://images-na.ssl-images-amazon.com/images/I/41D4VRGPPTL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}