{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 18.4801972, "ratings": {"num_ratings": 84, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "A fascinating account, but 1) it goes all OVER the place and has no center, and 2) it is in desperate need of an editor."}, {"review_sentiment": 5.0, "review_text": "must read"}, {"review_sentiment": 5.0, "review_text": "love it"}, {"review_sentiment": 5.0, "review_text": "This is an amazing gem of a book. Written in 1938 as Europe was trembling in the shadow of Fascism and the race-based policies of Hitler, James writes of a 1802 revolution against a major European power by blacks in Haiti.  Trinidadian by birth, James is writing at a time when India and most of the world that had been colonized by Britain, France and Germany are still colonies (India won independence only in 1947, following the end of W.W.II). It is quite remarkable the Marxist analysis James brings to bear upon the ways slavery was maintained in Haiti, the effect of the French Revolution upon the island, the deep psychological hold it had on free blacks and bi-racials as they struggled with their respective nationalisms and colonial upbringing. Ought to be read alongside \"The Wretched of the Earth.\" Indispensable for those interested in postcolonial studies."}, {"review_sentiment": 5.0, "review_text": "very intense."}, {"review_sentiment": 5.0, "review_text": "GREAT read!!!!!!"}, {"review_sentiment": 5.0, "review_text": "Book was in great condition."}, {"review_sentiment": 5.0, "review_text": "This book tells the astonishing tale of what I believe is the only successful slave revolt in history, which according to C.L.R.James in a bravura performance owes much to the presence of a personality, Toussaint l’Ouverture, of astonishing intelligence, culture, bravery and powers of endurance; a slave who led his people almost all of the way to independence before the job was finished for him by Dessalines.James of course is himself a Caribbean, cricket-loving Marxist, and probably all of those qualities come to play.  Most importantly, ‘The Black Jacobins’ is an example of Marxist history at its best, because no other approach offers the facility to truly understand the interests of the various parties: the black imported slaves; the mulattoes some of whom were landowners, but all of whom were despised by the whites; the cruel parasitic white landowners whose viciousness set new standards; and as the revolution progressed, the craven folly of Buonaparte and the French, and the sickening cynicism of the British and Americans.It also has to be acknowledged that the permutations of policy in France during its own revolution were crucial, and it is doubtful if the birth of Haiti would ever have occurred were it not for the fact that at least for about three weeks, the great radicals of France managed to overcome the greed of their bourgeois tendencies long enough to outlaw slavery.  Thanks to Buonaparte and many others this view didn’t last long, but it was enough to give the Haitian blacks who at that time were still loyal to France enough courage to burn their boats and declare war on the colonialists.In a way the key drama in this book is the soul of l’Ouverture, who could never give up his loyalty to France, and as James suggests, his appreciation of European culture.  He always held out, even when he was dying of exposure in a French jail, for support from Napoleon and the French.  This was fatal for him in the end, and he lost the colossal support he had in Haiti because of it, but in the early stages his European style sense of fairness –‘It’s not cricket!’, you almost hear him saying – and diplomacy helped him manoeuvre his people away from servility, whilst temporarily acquiring the loyalty for strategic purposes of different races and classes within Haiti and beyond its borders.European fairness of course only applies to those the ruling class approve of, and Toussaint did not long remain in that group.Another key drama is the amazing letters of Leclerc, the French general on a mission to hell sent out to return the triumphant blacks of Haiti to slavery, who lost just about every man of the 50,000 troops under his command to warfare and sickness.After the revolution Haiti was treated abominably by all the world’s major powers right up to the present day, but then most small countries are.  Despite this it was a beacon of inspiration to other countries, especially in Latin America trying to get out from under the heel of global imperialism.Truly a triumph, this book."}, {"review_sentiment": 5.0, "review_text": "Excellent,seller met my expectations."}, {"review_sentiment": 4.0, "review_text": "Goes to the heart of things, by-passing establishment perspectives."}]}, "authors": ["C.L.R. James"], "isbn": "0679724672", "longitude": -69.942111, "periods": ["1700s", "1800s"], "title": "The Black Jacobins: Toussaint L'Ouverture and the San Domingo Revolution", "word_cloud": "fascinating account go place center desperate need editor love amazing gem tremble shadow policy write major european power black birth write time world colonize still colonies independence follow end quite remarkable marxist analysis bring bear way slavery maintain effect french island deep psychological hold free black struggle respective nationalism colonial upbringing interested postcolonial study intense great great condition tell astonish tale believe successful slave revolt history accord bravura performance owes much presence personality l astonish intelligence culture bravery power endurance lead people almost way independence job finish course probably qualities come play most importantly example history best approach offer facility truly understand interest various party import slave mulatto landowner despise white cruel parasitic white landowner viciousness set new standard progress craven folly sicken cynicism also acknowledge permutation policy crucial doubtful birth ever fact least week great radical manage overcome greed bourgeois tendency long enough outlaw slavery many others view last long enough give haitian black time still loyal enough courage burn boat declare war way key drama soul l overture never loyalty suggest appreciation european culture always hold even die exposure french jail support fatal end lose colossal support early stage european style sense fairness cricket almost hear say diplomacy help man oeuvre people servility whilst temporarily acquire loyalty strategic purpose different race class fairness course applies rule class long remain key drama amaze letter general mission hell send return triumphant black slavery lose man troop command warfare treat abominably world major power right present day small country beacon inspiration country especially try heel global triumph seller meet expectation heart thing establishment perspective", "genres": ["Biography", "History", "Politics"], "summary": "A classic and impassioned account of the first revolution in the Third World.\r\n\r\nThis powerful, intensely dramatic book is the definitive account of the Haitian Revolution of 1794-1803, a revolution that began in the wake of the Bastille but became the model for the Third World liberation movements from Africa to Cuba. \r\n\r\nIt is the story of the French colony of San Domingo, a place where the brutality of master toward slave was commonplace and ingeniously refined. And it is the story of a barely literate slave named Toussaint L'Ouverture, who led the black people of San Domingo in a successful struggle against successive invasions by overwhelming French, Spanish, and English forces and in the process helped form the first independent nation in the Caribbean.\r\n\r\n\"Mr. James is not afraid to touch his pen with the flame of ardent personal feeling -- a sense of justice, love of freedom, admiration for heroism, hatred for tyranny -- and his detailed, richly documented and dramatically written book holds a deep and lasting interest.\" The New York Times", "asin": "0679724672", "rank": "28984", "city": "Santo Domingo", "image": "https://images-na.ssl-images-amazon.com/images/I/41zeEva-5UL.jpg", "country": "D.R.", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}