{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 131, "rating": 3.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Keith!! Darts!!!"}, {"review_sentiment": 1.0, "review_text": "Unreadable"}, {"review_sentiment": 2.0, "review_text": "I've read several Martin Amis books (Money being my favorite, and considered his best, it appears), but I can't finish this one.  Started out great, very exciting, and Amis is a master of the English language (but beware, he can get \"wordy\").  But it's just dragging on and kind of stuck at this point (I'm about 2/3 through).  Frustrating.  I wanted to like it. I love the character development and Amis nails the late '80's ennui and sterility, but I feel like the wheel is just spinning..."}, {"review_sentiment": 1.0, "review_text": "Although skillfully written, it's a terrible novel. You really shouldn't waste your time on it. It drags on and on, with nothing interesting happening to cartoon characters."}, {"review_sentiment": 5.0, "review_text": "London Fields is a masterpiece that defies a quick blurb to recommend it.  I can say from the outset that this is not a novel for many fans of horror or mysteries… but for those who treasure Burgess's A Clockwork Orange, this book will insinuate itself under your skin.Amis is an unrivaled master of the complex interpollation of unreliable narrators into a fascinatingly dark journey through Thatcher's England of the 1980s.  Writing in 1989, but set 10 years into the future, this novel captures the sense of dread and world-ending paranoia from the late cold war years like no other.  Under the nebulous, ever present possibility of global nuclear war that Amis ominously refers to as \"the crisis,\" this book takes the reader on a tour of London's underbelly via the voices of three primary characters and an unstable narrator.Psychic Nichola Six has a premonition that she will be murdered by one of two men she meets at a bar… or is it a premonition?  From that premise, Amis brings the reader into a twisted story of preemptive revenge, madness, and tragedy.  THe chapter called \"Horrorday,\" appearing midway through the novel, is as dark and terrifying as anything written about Thatcher's England in the last decade of the 20th century.This novel, while challenging and provocative, is a modern masterpiece."}, {"review_sentiment": 5.0, "review_text": "One of the best stories I have ever read."}, {"review_sentiment": 5.0, "review_text": "One thing that must be nice about being a semi-famous author is that publishers are seemingly all too willing to publish whatever you write without really questioning whether people will actually buy it or, perhaps less importantly, even enjoy it.  Or if the author is even writing the book with the intent of having the reader enjoy it.In that light, we can have only have some small pity for the extremely tolerant fellow at Martin Amis' publisher who eventually green-lit a book that could best be described as \"a murder mystery starring an unlikable woman who we're told almost from the get-go is going to be dead by end of the book and her relationship with three other unlikable people, one of whom is a petty criminal and abuser, one is a rich doormat and the other is the author.  Sometimes, it's funny.\"If you think I'm kidding about that being the plot, just find the book yourself and see that beyond some small elaborations, that's the basic gist of it.  Nicola Six is quite willing to die and to that end seeks to manipulate the none too bright Keith Talent (he of the wife-beating and dart playing) and the slightly dippy Guy Clinch while the rather gleeful narrator tells us all about it and gets actively involved in the happenings since he's stuck for the plot of his latest novel and all this drama is prime fodder for a best seller, so its in his best interest to ensure that she does get murdered on schedule or is this will be a fairly dull book, or at least one that breaks its own promises.Alas, a \"fairly dull book\" may be the opinion of people who are here solely for the plot, as there isn't much surprise to it and given the length of the book (nearly five hundred pages) you have to reasonably wonder what the heck happens to fill up all that space.  And to be honest, nothing much.  You're told early on that Nicola Six will die and one of the main characters will kill her.  The money seems to be in Keith Talent since he's a colossal horse's butt but if you're thinking the author is going to go the obvious route you must be new to slightly avant-garde literature.  In the meantime we watch as Nicola seduces both Keith and Guy using different techniques, succeeding in playing one against the other, while the author watches all this with increasing joy as he imagines the kind of bestseller he's going to write once the girl finally gets around to getting herself offed.But what's fascinating about this book is what it does instead of bothering with a plot.  In a word, it's savage.  Freed of the notion that he needs to be sympathetic to any of the characters, including his own narrator, he can go about joyfully portraying every single person in the novel in the most negative light possible, with the other exception potentially being Keith Talent wife and child, both of whom spend most of their time not really bothering anyone and generally get rewarded with the back of Keith's hand for their trouble (something even the narrator can't quite tolerate by the end, a welcome sliver of humanity).  Talent spends most of his time plotting crimes that have no chance of succeeding, or obsessing over darts like its the key to understanding all of history and philosophy while Guy spends an inordinate amount of time defending himself from his only child Marmaduke, who winds up being bleakly hilarious by being the most monstrous child ever, treating Guy like a cat treats a ball of yarn infused with catnip and shaped like the most delicious mouse ever.  Meanwhile, Nicola wants to die and the narrator wants to watch.  What fun!Yet, and this probably says profound things about me that I shouldn't admit in public, I came very close to enjoy this novel heartily.  For one thing, Amis' prose is at what must be a personal peak here, a feverish rush of words that never lets up once it starts, steadily increasing in intensity and consistently dazzling in richness and detail.  For all the unpleasantness being described, there's generally at least one passage on every page that is insanely good at what how well put it is.  If you're at all interested in watching a literary author push himself to new heights in rhythm and intensity, the writing will be what saves the book for you because it's a pure joy to simply READ what Amis puts down, the sheer energy and verve comes swaggering with a confidence that only come when you're very clear about you're doing or you just don't care what anyone else thinks.And what's more, it's funny.  Not all the time in the \"ha-ha\" way but in how it contrasts the absurdities of the world against the characters, how it fearlessly skewers these people and doesn't care if it's going after the low hanging fruit (Keith fancies himself much smarter than he is, but fiendishly rich Guy isn't much further behind, not understanding basic history like what the Enola Gay was), how it's willing to push a nutty situation even further by going way over the top and then pretending that it could go even further (this especially applies to Marmaduke, whose violent exploits are detailed with a foaming at the mouth glee and then treated as if they were toned down to avoid further offending our sensibilities).  It makes it okay to laugh at these people and then when they do terribly callous or monstrous acts, you wonder what it is you found so funny in the first place.Yet, it's probably no coincidence that it takes place on the eve of the millennium and that as the book goes on the narrator becomes even more intense, the prose becomes moodier and the tone verges on the apocalyptic, with the notion that nobody really wants this little game to end but all too aware that it's going to end one way or another and the choices in how it ends are between unpleasant and depressing.  If you've made it this far into the book the whole scenario becomes positively magnetic, a grim lesson in how to keep a reader's attention when there's no one to root for, even as it belatedly discovers some stunted sense of morality, mixed with a heavy heaping dose of inevitability, and you realize that you're in a situation where Everything Means More than One Thing but all of those are Bad Things, as the prose reaches a teeth rattling intensity just in time for the climax.  It goes exactly how you'd expect and its terrible to watch.  Its a highwire performance that's almost breathtaking to both take in and endure, and wouldn't have remotely succeeded if Amis didn't have a firm grasp on what he was doing.  I'm not sure its an experience I'd want to undergo again but as example of how to sustain a mood despite not having even half the plot the length should require, its nearly awe-inspiring to witness.  People wanting something a little more straightforward than a five hundred page exercise in scathingly moody desolation will probably want to spend their time elsewhere but if you let go of the notion that a plot is the most important aspect of a story, there's plenty here to enjoy."}, {"review_sentiment": 5.0, "review_text": "One of the best Ive ever read"}, {"review_sentiment": 5.0, "review_text": "A hilarious book, with unforgettable characters and sordid scenes that you won't soon forget.  More of Amis on children too, but with a twist this time.  I think his writing on children is very real, not hypocritical, very closely observed."}, {"review_sentiment": 3.0, "review_text": "I had trouble getting through it, but was glad I finished it in the end."}]}, "authors": ["Martin Amis"], "isbn": "0679730346", "longitude": -0.12574, "periods": ["1900s"], "title": "London Fields", "word_cloud": "dart unreadable several favorite consider best appear great excite master language beware wordy drag kind stuck point frustrate want love character development nail late ennui sterility feel wheel spin skillfully write terrible really waste time drag nothing interest happen cartoon character defies quick blurb recommend say outset many fan horror treasure insinuate unrivaled master complex interpolation unreliable narrator fascinatingly dark journey set year future capture sense dread paranoia late cold war year nebulous ever present possibility global nuclear war ominously refer crisis take tour underbelly voice primary character unstable premonition murder men meet premonition premise bring twisted story preemptive revenge madness chapter call appear midway dark terrify anything write last decade challenge provocative modern masterpiece best story ever thing author publisher seemingly willing publish write really question people actually buy perhaps le importantly even even write intent enjoy light small pity extremely tolerant fellow publisher eventually describe murder mystery star unlikable woman tell almost go dead end relationship unlikable people petty criminal abuser rich doormat author sometimes funny think kid plot see small elaboration basic gist quite willing die end seek manipulate none bright dart play slightly dippy rather gleeful narrator tell get actively involve happening stuck plot latest drama prime fodder best seller best interest get murder schedule fairly dull least break fairly dull opinion people solely plot much surprise give nearly hundred page reasonably wonder heck happens fill space nothing much tell early die main character kill money seem colossal horse butt think author go go obvious route new slightly literature meantime watch seduce use different technique succeed play author watch increase joy imago kind bestseller go write girl finally get get fascinate instead bother plot word savage notion need sympathetic character include narrator go joyfully portray single person negative light possible exception potentially wife child spend time really bother anyone generally reward hand trouble something even narrator quite end welcome sliver humanity spend time plot crime chance succeed obsess dart key understanding history philosophy spend inordinate amount time defend child wind bleakly hilarious monstrous child ever treat cat treat ball yarn infuse catnip shape delicious mouse ever meanwhile want die narrator want fun yet probably say thing admit public come close enjoy heartily thing prose personal peak feverish rush word never let start steadily increase intensity consistently dazzle richness detail unpleasantness describe generally least passage page insanely good well interested watch literary author push new height rhythm intensity write save pure joy simply put sheer energy verve come swagger confidence come clear care anyone else funny not time way contrast absurdities world character fearlessly skewer people care go low hang fruit fancy much smarter fiendishly rich much understanding basic history willing push nutty situation even go way top pretending even especially apply violent exploit detail foam mouth glee treat toned avoid offend sensibility make okay people terribly callous monstrous act wonder find first probably coincidence take place eve millennium go narrator becomes even intense prose becomes moodier tone verge apocalyptic notion nobody really want little game end aware go way choice end unpleasant depress make far whole scenario become positively magnetic grim lesson attention root even belatedly discovers stunt sense morality mixed heavy heap dose inevitability situation mean more prose reach teeth rattle intensity time climax go exactly expect terrible watch high wire performance almost breathtaking take endure remotely succeed firm grasp sure experience want undergo example sustain mood even plot length require nearly witness people want something little straightforward hundred page exercise scathingly moody desolation probably spend time elsewhere notion plot important aspect story plenty enjoy best ever hilarious unforgettable character sordid scene soon more child twist time think write child real hypocritical closely observed trouble get glad finish end", "genres": ["Fiction & Literature", "Mystery & Suspense", "Satire"], "summary": "London Fields is Amis's murder story for the end of the millennium. The murderee is Nicola Six, a \"black hole\" of sex and self-loathing intent on orchestrating her own extinction. The murderer may be Keith Talent, a violent lowlife whose only passions are pornography and darts. Or is the killer the rich, honorable, and dimly romantic Guy Clinch?\r\n\r\n\"A comic murder mystery, an apocalyptic satire, a scatological meditation on love and death and nuclear winter...by turns lyrical and obscene, colloquial and rhapsodic.\"--Michiko Kakutani, New York Times", "asin": "0679730346", "rank": "93605", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41NDNUAu-fL.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}