{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 35.6828378, "ratings": {"num_ratings": 922, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Fascinating story. Murakami knows how to spin them. Buy it (or get it from the library) and see what I mean"}, {"review_sentiment": 5.0, "review_text": "Pure Murakami, love it! He gets me every time with his crazy way of describing every detail of what's happening. And the story line is unwinding and unwinding...love it."}, {"review_sentiment": 5.0, "review_text": "One of Murakamis best. Rereading it for the third time, one becomes aware of more and more. The whole thing feels like a wonderful dream. I sometimes wonder what I am missing not growing up in Japan and knowing the symbolism of cats and wells, but it works even for a westerner."}, {"review_sentiment": 3.0, "review_text": "Not among my favorites by Haruki Murakami. Still, it was a good read."}, {"review_sentiment": 2.0, "review_text": "I received this as a gift. The presenter of the gift told me she was not sure about the book because the reviews were all over the place. I began reading in earnest. The book was slow to start. The author, although translated from the original Japanese language, is competent with language to describe people, places, and things - in great, GREAT, long-winded detail. I was about 300-pages into the book and was still trying to determine if there was a plot, and if there was, where it was going. It seemed to be a great collection of barely connected stories, wandering as the author desired, presenting new characters to suit his mood at the time and perhaps, JUST PERHAPS, he had an overall goal in mind to tie everything together at the end of the book. I got to the point where I was bound and determined to finish the book to see where he was going. I felt like a monkey that grabs a piece of candy at the bottom of a vase and my clenched fist was too large to get it out of the vase. It was a hard book to read and I found myself reading the first sentence of each paragraph during pages of long, meandering letters from the character May Kasahara. I actually flinched when I saw her letter starting an entire chapter. I persevered and finished the book and use it as an example of how to say too much with too little purpose, much like this review. If I was forced to give a short review, or summarize this review, I'd simply say \"I'd rather have read several novels other than this and taken my chances.\" This I believe is much better than simply stating, \"It sucked.\""}, {"review_sentiment": 3.0, "review_text": "There are things you read in this book you cannot unread. Be warned if you don't need to be grossed out."}, {"review_sentiment": 5.0, "review_text": "Like many others, this book was my first exposure to Murakami-needless to say that, perhaps more than any other author, living or dead, his books have had a huge impact on my life. A friend of mine, who also owns a used book store, ( a very Murakami occupation) recommended Wind Up to me. He said, \"you have to read this-it all started with a man cooking some noodles for spaghetti.\" I was intrigued. It was one of those times in my life when, like the protagonist in this, and many of Murakami's novels, I was \"in between\" things. With no job, and after a break-up with a long term girlfriend, I hung out at that tiny hole in the wall bookstore A LOT. His books always find me \"in between.\" In between jobs, relationships, in between periods of relative peace and stability. And yet this book, and the others, gave me hope. The protagonist in Wind Up is also \"in between\" things, and yet, he remains calm. He is, in fact, the eye of calm in the storm that surrounds him. I discovered that during this in between time, which came after years of corporate and relational boredom and routine and, yes, stability, that the more I just allowed life to happen around me, and the less impatient and proactive I was, the more things occurred to me, the more things happened to me. This is also true of many of Murakami's protagonists. Reminds me of what Kafka said: “You do not need to leave your room. Remain sitting at your table and listen. Do not even listen, simply wait, be quiet, still and solitary. The world will freely offer itself to you to be unmasked, it has no choice, it will roll in ecstasy at your feet.” I think this summarizes Murakami's writing perfectly. There is a lot more going on this book and the others, but for me this is the great lesson of Murakami-there is always hope. Reading Murakami is a strangely isolating experience for me; the only relatable experience I can compare it to is listening to Brian Eno. In both cases, I feel as if the artist is speaking to me directly and sharing in a world that only we \"get\", a reality superimposed on the \"real\" and only inhabitable by us.  It is hard for me to express how much his writing means to me-but I thank him for what he has given."}, {"review_sentiment": 5.0, "review_text": "so good"}, {"review_sentiment": 5.0, "review_text": "Loved this book. First book in a while that has intrigued me to the point I can't stop thinking about it. The story is really well written, the characters are all extremely complex, and the historical portions are fascinating. It's a truly dreamlike story and I will never forget it."}, {"review_sentiment": 5.0, "review_text": "This book was truly life changing for me. It was simple, but so complex. It was fast paced, but sometimes beautifully slow and detailed.A work of art that will stick with me forever."}]}, "authors": ["Haruki Murakami"], "isbn": "0679775439", "longitude": 139.7589667, "periods": ["2000s", "Recent Releases"], "title": "The Wind-Up Bird Chronicle", "word_cloud": "fascinate story know library see mean get time crazy way describe detail happening story line unwind unwinding love best reread third time aware whole thing feel wonderful dream sometimes wonder miss grow know symbolism cat well work even westerner not favorite still good receive presenter gift tell sure review place begin read earnest slow start author translate original japanese language competent language describe people place thing great great detail still try determine plot go seem great collection barely connect story wander author desire present new character suit mood time perhaps overall goal mind tie everything together end get point bind determined finish see go felt monkey grab piece candy bottom vase clench fist large get vase hard find read first sentence paragraph page long meander letter character actually flinch saw letter start entire chapter persevere finish use example say much little purpose much review force give short review summarize review simply say rather several novel take chance believe much better simply state suck thing unread warn need gross many others first exposure say perhaps author live dead huge impact life friend mine also own use store occupation recommend say start man cook noodle spaghetti intrigue time life protagonist many novel thing job long term girlfriend hang tiny hole wall always find job relationship period relative peace stability yet others give hope protagonist also thing yet remain calm fact eye calm storm surround discover time come year corporate relational boredom routine stability allow life le impatient proactive thing occur thing happen also true many protagonist say need leave room sit table listen do even simply wait quiet still solitary world freely offer unmasked choice roll ecstasy think summarizes write perfectly lot go others great lesson always hope read strangely isolate experience repeatable experience compare listen case feel artist speak directly share world get reality superimpose real inhabitable hard express much writing mean thank give good love intrigue point think story really well write character extremely complex historical portion fascinate truly story never truly life change simple complex fast pace sometimes beautifully slow work art stick forever", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Japan's most highly regarded novelist now vaults into the first ranks of international fiction writers with this heroically imaginative novel, which is at once a detective story, an account of a disintegrating marriage, and an excavation of the buried secrets of World War II. \r\n\r\nIn a Tokyo suburb a young man named Toru Okada searches for his wife's missing cat.  Soon he finds himself looking for his wife as well in a netherworld that lies beneath the placid surface of Tokyo.  As these searches intersect, Okada encounters a bizarre group of allies and antagonists: a psychic prostitute; a malevolent yet mediagenic politician; a cheerfully morbid sixteen-year-old-girl; and an aging war veteran who has been permanently changed by the hideous things he witnessed during Japan's forgotten campaign in Manchuria.\r\n\r\nGripping, prophetic, suffused with comedy and menace, The Wind-Up Bird Chronicle is a tour de force equal in scope to the masterpieces of Mishima and Pynchon.", "asin": "0679775439", "rank": "7134", "city": "Tokyo", "image": "https://images-na.ssl-images-amazon.com/images/I/51x1oL3Z50L.jpg", "country": "Japan", "story_arc": ["Tragedy", "Things only get worse"]}