{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 699, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Second book I read in the series, some parts were more compelling than others. I lost little interest at one point but the book got really good towards the end. I would have never been able to learn about this period in Rome’s history and still stay awake without these books. I really recommend them for anyone that finds the subject interesting."}, {"review_sentiment": 5.0, "review_text": "Very creative and well-researched book. Can feel a little overwhelming with names and characters sometimes, but often the scrupulous detail serves to flesh out the world."}, {"review_sentiment": 5.0, "review_text": "I'm not a scholar. I don't consider myself to be super-intellectual. I started reading 12 Caesars because I love history and it sounded fascinating. I admit, however, the way it is formatted made it hard for me to enjoy and sometimes follow. I mentioned it to my friend who IS amazingly smart and well-versed in pretty much everything and he suggested I might enjoy I, Claudius since it is fiction based on the 12 Caesars and more readable (for me). I thoroughly enjoyed it. It was riveting and thought provoking. I learned more about ancient Roman culture and history and made some connections I hadn't made before about other ancient cultures of that time period. This book made me feel as if I was watching the story unfold right there. Now I do realize this is fiction and am always careful to take that into consideration, but from what I've read about the author, it seems he went to great effort to base it on as much historical supporting evidence that's available. I believe he probably closely created a book based in that time period as possible. It feels authentic (again, not a scholar nor a historian so I can only report my impressions). I definitely recommend it for any history buff. It was great and I'm just starting the next book that continues the story."}, {"review_sentiment": 4.0, "review_text": "I remember reading the book in high school and then watching the TV miniseries with Derek Jacobi. When the book turned up for $1.99 I thought I'd visit it again to see if it was as good as I remembered. I'm happy to say it was, so much so that I started on Claudius, the God, and His Wife Messalina, the sequel.It must have been terrifying to live in Rome with Caligula as a near relative. Claudius took the smart way out, playing up his stutter and apparent stupidity, for all that he was a gifted scholar and historian. Through being constantly overlooked and underestimated, he survived to live to the end of this book, where he is declared emperor.I'm looking forward to the sequel to see how he manages on the throne he never wanted."}, {"review_sentiment": 2.0, "review_text": "Very long and wordy.  I did learn about the politics  and culture of the Romans empire.  To sum it,  crazy! No wonder it fell."}, {"review_sentiment": 5.0, "review_text": "Loved it!"}, {"review_sentiment": 5.0, "review_text": "great read"}, {"review_sentiment": 5.0, "review_text": "One of the best histories I have ever read.  The author keeps the suspense high from chapter to the next chapter.  I found hte book hard to put down.  The research that went into the book's writing is mind boggling."}, {"review_sentiment": 5.0, "review_text": "Wonderful classic work of fiction by a historian.  An easy, great read - I hope they eventually do the remake of the series."}, {"review_sentiment": 5.0, "review_text": "Great Book"}]}, "authors": ["Robert Graves"], "isbn": "067972477X", "longitude": 12.4829321, "periods": ["0-500s", "Pre Common Era"], "title": "I, Claudius", "word_cloud": "second series part compel others lose little interest point get really good towards end never able learn period history still awake really recommend anyone find subject interest very creative little overwhelming name character sometimes often scrupulous detail serf flesh world scholar consider start read love history sound fascinating admit however way format make hard enjoy sometimes follow mention friend amazingly smart pretty much everything suggest fiction base readable thoroughly enjoy rivet think provoke learn ancient roman culture history make connection make ancient culture time period make feel watch story unfold right now realize fiction always careful consideration author seem go great effort base much historical support evidence available believe probably closely create base time period possible feel authentic scholar historian report impression definitely recommend history buff great start next continue story remember read high school watch tv miniseries turn think good remember happy say much start terrify live relative take smart way play stutter apparent stupidity gift scholar historian constantly overlook underestimated survive live end declare look forward sequel see manage throne never want very long wordy learn politics culture empire crazy wonder fell love great best history ever author keep suspense high chapter chapter find the hard put research go write mind boggling wonderful classic work fiction historian easy great hope eventually series", "genres": ["Fiction & Literature", "Historical Fiction", "Ancient Rome"], "summary": "I, Claudius (written in 1934) is a novel by English writer Robert Graves, written in the form of an autobiography of the Roman Emperor Claudius. Accordingly, it includes the history of the Julio-Claudian Dynasty and the Roman Empire, from Julius Caesar's assassination in 44 BC to Caligula's assassination in 41 AD.\r\n\r\nThe 'autobiography' of Claudius continues (from Claudius' accession after Caligula's death, to his own death in 54) in Claudius the God (1935). The sequel also includes a section written as a biography of Herod Agrippa, contemporary of Claudius and future King of the Jews. The two books were adapted by the BBC into an award-winning television serial, I, Claudius.\r\n\r\nIn 1998 the Modern Library ranked I, Claudius fourteenth on its list of the 100 best English-language novels of the 20th century. In 2005, the novel was chosen by Time as one of the one hundred best English-language novels from 1923 to present.", "asin": "067972477X", "rank": "42523", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/517efjnUZRL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}