{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 41, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Very well. comfortable,nice . my sister, I just love this product I just use it for basic cutting I bought it because I read the reviews and its just what they I just have to go buy a sleeve for it best service."}, {"review_sentiment": 5.0, "review_text": "Hughes' masterful history of Barcelona is detailed and rich with descriptions, explanations, and critiques of everything from economics, class cultures, and art to architecture and politics.  Gaudi is well explained and Hughes' talent as an art critic shines through."}, {"review_sentiment": 5.0, "review_text": "Absolutely perfect condition. Thank you."}, {"review_sentiment": 5.0, "review_text": "I'm not a history buff. I got this book in preparation for a trip to Barcelona. I'm enjoying this book so much more than I imagined. The author is witty and had me drawn in at the first page. The information and insights are fascinating. I'm learning about areas of Catalunya I wasn't aware of and it's cause met o schedule additional day trips I didn't know about before reading this."}, {"review_sentiment": 5.0, "review_text": "Great informative book! Arrived very quickly. Thanks!"}, {"review_sentiment": 3.0, "review_text": "Interesting history of an interesting place.  Kind of slow in parts, and I got tired of the pedantic use of words, but overall it was enjoyable, especially the sections on artists and architects."}, {"review_sentiment": 5.0, "review_text": "Amazing story about Barcelona and its treasures and history. This is a real keeper!"}, {"review_sentiment": 5.0, "review_text": "Every word Robert Hughes wrote should be studied and cherished!The best art critic of our times."}, {"review_sentiment": 3.0, "review_text": "Dense"}, {"review_sentiment": 5.0, "review_text": "Very well written ."}]}, "authors": ["Robert Hughes"], "isbn": "0679743839", "longitude": 2.1774322, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s"], "title": "Barcelona", "word_cloud": "very well comfortable nice sister love product use basic cutting buy review go sleeve best service masterful history detail rich description explanation critique everything economics class culture art architecture politics well explain talent art critic shine absolutely perfect condition history buff get preparation trip enjoy much imagine author drawn first information insight fascinate learn area aware cause met schedule additional day trip know read informative quickly thanks interest history interesting place slow part get tired pedantic use word overall enjoyable especially section artist architect story treasure history real keeper word write study cherish best art critic time dense very well write", "genres": ["Biography", "Art & Architecture", "History"], "summary": "Barcelona is Robert Hughes's monumentally informed and irresistibly opinionated guide to the most un-Spanish city in Spain. Hughes scrolls through Barcelona's often violent history; tells the stories of its kings, poets, magnates, and revolutionaries; and ushers readers through municipal landmarks that range from Antoni Gaudi's sublimely surreal cathedral to a postmodern restaurant with a glass-walled urinal. The result is a work filled with the attributes of Barcelona itself: proportion, humor, and seny -- the Catalan word for triumphant common sense.", "asin": "0679743839", "rank": "219529", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51FEeUea9mL.jpg", "country": "Spain", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}