{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 53, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "great condition, and so far a great read"}, {"review_sentiment": 5.0, "review_text": "Simply genius.Having sought to undertake a literary appreciation of this great American novelist for some time now, I’ve, in the past, often found myself afloat in various segments of Faulkner’s works, reading shifting and protean examples but not ever developing a cohesive plan to actually appreciate his catalogue. By chance discovering a trusted web page that advised a suggested starting point for a guide to his novels, I grabbed a copy of this amazing canon and was immediately astounded by not only the approachability of the work (it is said that this is Faulkner’s most “readable” novel) but his amazing talent for transitioning from the hard-edged, late Civil War, indigenous Mississippi language to a more deep, nuanced and insightful observation, all seemingly in a single paragraph. I literally had to catch myself in my early reading to not miss a single sublime paragraph or exalted summary... indeed I found Faulkner exceedingly adroit at combining the two.The story revolves around the very late stages of the Civil War, beginning just prior to Union General William Tecumseh Sherman’s scorching march throughout the South. Bayard Sartoris, the fifteen year old son of local Confederate regiment leader John Sartoris and John’s fifteen year old slave Ringo make up the main protagonists here, with the book’s POV being strictly that of Bayard. We discover the two boys as they grow from innocent plantation denizens, wary of the “war” but completely devoid of its circumstances or meaning, into men, suffering tragedy and personal loss at a young age.Always connected, as if on a spiritual level, even as Bayard goes off to college, the two provide the vehicle for Faulkner to describe the harrowing environment facing the victims of Sherman’s wrath. And as they grow, it is Bayard who recognizes in Ringo, a natural intelligence and forlorn motivation for justice.This relationship becomes important for reasons that become apparent at the end of the book. Faulkner eloquently ties together all the disparate ends of this rather complex tome and does so with an amazing grace and literary fortitude that certainly solidifies his reputation. His writing here is said to lead to the more complex “stream of consciousness” style that he is famous for in works like “Absalom! Absalom!” and “The Sound and the Fury” but to me it is just amazingly literary:“What counted was, what one of us had done or seen that the otherhad not, and ever since that Christmas I had been ahead of Ringobecause I had seen a railroad, a locomotive. Only I know now that itwas more than that with Ringo, though neither of us was to see theproof of my belief for some time yet and we were not to recognise itas such even then. It was as if Ringo felt it too and that the railroad,the rushing locomotive which he hoped to see symbolised it – themotion, the impulse to move which had already seethed to a headamong his people, darker than themselves, reasonless, followingand seeking a delusion, a dream, a bright shape which they couldnot know since there was nothing in their heritage, nothing in thememory even of the old men to tell the others, ‘This is what we willfind’; he nor they could not have known what it was yet it was there –one of those impulses inexplicable yet invincible which appear amongraces of people at intervals and drive them to pick up and leave allsecurity and familiarity of earth and home and start out, they don’tknow where, empty handed, blind to everything but a hope and a doom.”Yes, admittedly, I’ve not read a lot of him but, already, the one characterization that I cannot stand is that Faulkner has been forever catalogued as a “southern” novelist. Another of my favorite authors is Richard Price who writes about crime and murder in NYC…this certainly isn’t to suggest that Price is a novelist in Faulkner’s class but the characterizations are pertinent. Price is considered a “crime/thriller” writer, not a “NYC writer” or “Northern writer” so it really bugs me that virtually all Faulkner descriptions start out with him having “the Great Southern Writer” sobriquet tagged to him. I know, I know…Grisham gets the same treatment and Graham Greene is considered a great “English novelist” but these appellations only hide what they really are, and in the case of Faulkner he is in extremis, and that is great literary novelists. I’m certainly looking forward to discovering more of the Faulkner genius as I move through his works."}, {"review_sentiment": 5.0, "review_text": "The Unvanquished is essentially a compilation of stories Faulkner wrote to solve a cash-flow problem during the writing of Absalom, Absalom! The concluding chapter, \"An Odor of Verbena,\" the only story not sold to a magazine and published before the novel's publication, is the finest of the otherwise solid collection and the only one of the seven written wholly in the mature, fully-formed Faulknerian voice and style. These are fine stories all, narrated in chronological order by Bayard Sartoris, scion of \"The Sartoris,\" John, a Confederate Colonel known by Union invaders as a fearsome battlefield foe but a symbol of the old slaveholding South making its way into an uncharted future prepared for by  \"the Lost Cause\" and its train of consequences. But \"An Odor of Verbena\" attains a magnificence its companion stories fall short of - essentially a \"testing of manhood\" story of now 24-year-old law student Bayard and his response to the fatal shooting of his father and the almost Balkan code of revenge his society expects Bayard to extract. (This is Bayard's second \"test of Southern manhood,\" the first coming in his desire to avenge the wartime murder of his grandmother.) As a tale, this final chapter has everything: the juxaposition of order and change, old and new, memory and the present, codes for men as well as for women, elements of moral and sexual tension,  and of Bayard's arc-of-becoming following his father's death: \"my chance to find out if I am what I think I am or if I just hope; if I am going to do what I have taught myself is right or if I am just going to wish I were.'\"I particularly enjoyed The Unvanquished's two dominant women, Rosa Millard, or \"Granny,\" and Druzilla (\"Dru\") Hawk (later, Sartoris), which shows Faulkner a master of writing and characterizing complex, compelling women - a talent that has often evaded otherwise strong storytellers. granny and Dru's respective stories dominate the front and back halves of  the novel.In short, The Unvanquished is a powerful  reflection of William Faulkner on the Civil War and its consequences and the pressures the ensuing decade of Reconstruction exerted on the men and women of his Yoknapatawpha County."}, {"review_sentiment": 5.0, "review_text": "you can't beat faulkner.  the phrases inform your days forever.  I bought this again since chapter 6 has a haunting scene of the men coming back from the Civil War understanding that they have lost, and why...and the women who have held fast while they ate pigweed and peanuts through all those years refusing to accept it.  This must have been a big part of the end of the Civil War in the South, but Faulkner's the only writer I've ever seen to write about it."}, {"review_sentiment": 5.0, "review_text": "Great book...great product which was in great shape!"}, {"review_sentiment": 3.0, "review_text": "Good cd. Did not like the book boring."}, {"review_sentiment": 2.0, "review_text": "The fact that the Book was in LARGE PRINT was not mentioned in descriptor. I would have not ordered such a copy"}, {"review_sentiment": 2.0, "review_text": "Faulkner is a brilliant writer - but The Unvanquished isn't his best work. The author himself had some negative things to say about this one, and there's much better out there by this great American author. Still, The Unvanguished is a pretty good introduction and is definitely more accessible than many of his other works."}, {"review_sentiment": 4.0, "review_text": "I love Faulkner, and the more I read him tbe easier it is to understand, because the same characters appear in different novels and at different times in their lives. The Unvanquished has a lot of death and tragedy in it, but it too has much humor surrounding some of its events, to boot."}, {"review_sentiment": 4.0, "review_text": "Lovely story! If it feels like the beginning is slow or uninteresting, keep reading! No chapter is boring, but there's a huge plot twist in the middle that changes everything. It can be difficult to understand in some parts, but rereading usually clears any problems. Overall, I enjoyed it and loved the characters!"}]}, "authors": ["William Faulkner"], "isbn": "0679736522", "longitude": 0.0, "periods": ["1900s"], "title": "The Unvanquished", "word_cloud": "great condition far great seek undertake literary appreciation great american novelist time past often find afloat various segment work read shift protean example ever develop cohesive plan actually appreciate catalogue chance discovering trust web page advise suggest start point guide grab copy amaze canon immediately astound approach ability work say readable amazing talent transition late indigenous language deep nuanced insightful observation seemingly single paragraph literally catch early reading miss single sublime paragraph exalt summary indeed find exceedingly adroit combine story revolves late stage begin prior scorch march fifteen year old son local regiment leader fifteen year old slave make main protagonist strictly discover boy grow innocent plantation denizen wary war completely devoid circumstance mean men suffer tragedy personal loss young connect spiritual level even go college provide vehicle describe harrow environment face victim wrath recognize natural intelligence forlorn motivation relationship become important reason become apparent end eloquently tie together disparate end rather complex tome amaze grace literary fortitude certainly solidify reputation writing say lead complex stream consciousness style famous work amazingly literary count do see other had ever ahead ringo because see railroad locomotive only know twas see the proof belief time yet it even felt railroad rush locomotive hop symbolized the motion impulse move already seethe head among people darker reason less following and seek delusion dream bright shape couldn't nothing heritage nothing the memory even old men tell others will find yet impulse inexplicable yet invincible appear among races people interval drive pick leave all security familiarity earth home start empty hand everything hope admittedly lot already characterization stand forever catalog southern novelist favorite author writes crime murder certainly suggest novelist class characterization pertinent consider writer writer writer really bug virtually description start sobriquet tag know get treatment consider great english novelist appellation hide really case extremist great literary novelist certainly look forward discover genius move work essentially compilation story write problem write conclude chapter story sell magazine publish publication finest otherwise solid collection write wholly mature faulknerian voice style fine story narrate chronological order scion know invader fearsome battlefield foe symbol old slave holding make way uncharted future prepare train consequence attain magnificence companion story fall short essentially test manhood story law student response fatal shoot father almost code revenge society expect extract second test manhood first come desire avenge wartime murder grandmother tale final chapter everything juxtaposition order change old new memory present code men well woman element moral sexual tension follow father death chance find think hope go teach right go wish particularly enjoy dominant woman later show master write characterize complex compel woman talent often evade otherwise strong storyteller granny respective story dominate front back halve short powerful reflection consequence pressure ensue decade exert men woman faulkner phrase inform day forever buy chapter haunt scene men come back understand lose woman hold fast ate pig weed peanut year refuse big part end writer ever see write great product great shape good cd boring fact mention descriptor order copy brilliant writer best work author negative thing say much better great american author still pretty good introduction definitely accessible many work love tb easier understand character appear different novel different time live lot death tragedy much humor surround event boot lovely story feel begin slow uninteresting read chapter bore huge plot twist middle change everything difficult understand part reread usually clear problem overall enjoy love character", "genres": ["Fiction & Literature"], "summary": "Set in the fictional town of Yoknapatawpha County, in Mississippi during the Civil War and Reconstruction, THE UNVANQUISHED focuses on the Sartoris family, who, with their code of personal responsibility and courage, stand for the best of the Old South's traditions.\r\n\r\n", "asin": "0679736522", "rank": "137184", "city": "Lafayette County", "image": "https://images-na.ssl-images-amazon.com/images/I/51v8G1hDmAL.jpg", "country": "MS", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}