{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1798, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "This book took me by surprise. I saw the movie years ago and knew how vicious Bateman was, but I was definitely disturbed by some chapters. Other than that, it was mostly entertaining. I would write more, but I have to return some video tapes."}, {"review_sentiment": 5.0, "review_text": "The movie and the book are not the same mood. Aiming for --that mood-- this book is not that thing.Other than that, Wow what a book! Disturbing in places, not to spoiler, he is definitely off his rocker in the book."}, {"review_sentiment": 4.0, "review_text": "The writing is good, Ellis is talented, but the endless lists (a plot device I soon found annoying) and breakdown of items purchased were a little tedious. The psychosis of the main character was believable and you almost find yourself rooting for him as he murders his pretentious associates. I would not go so far to call this a classic, but maybe...it does encapsulate a time period rather well and with its ludicrously bloody murders and the killers ability to evade arrest or even suspicion for so long highlights the eras self-involved, consumer oriented, you-are-what-you-wear culture. I enjoyed it and read it pretty quickly, and I still recall it very well though it's been quite a long time since I finished it. worth a look and maybe a good entry point for Ellis newbies.but a Broadway play? really? Well it's better material than Spiderman I suppose."}, {"review_sentiment": 5.0, "review_text": "Really good book. Worth the listen."}, {"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 5.0, "review_text": "Great read  great read great read great read great dead greats reads greatdreadzz greatrwad great read greatrewad great read great read"}, {"review_sentiment": 4.0, "review_text": "Thumbs up!"}, {"review_sentiment": 4.0, "review_text": "This period piece is a great read."}, {"review_sentiment": 2.0, "review_text": "Not sure what the hype was all about. Too much unnecessary detail = boredom"}, {"review_sentiment": 3.0, "review_text": "My compost heap LOVED this book, thus the 3 stars."}]}, "authors": ["Bret Easton Ellis"], "isbn": "0679735771", "longitude": 0.0, "periods": ["1900s"], "title": "American Psycho", "word_cloud": "take surprise saw movie year ago know vicious definitely disturb chapter other mostly entertaining return video tape movie mood mood place spoiler definitely rocker write good talented endless list plot device soon find annoy breakdown item purchase little tedious psychosis main character believable almost find rooting murder pretentious associate far call classic maybe encapsulate time period rather well ludicrously bloody murder killer ability evade arrest even suspicion long highlight eras consumer orient culture enjoy pretty quickly still recall well quite long time finish worth look maybe good entry point play really better material suppose really good listen great great great great great dead great read greatdreadzz greatrwad great greatrewad great great thumb period piece great not sure much unnecessary detail boredom compost heap thus star", "genres": ["Fiction & Literature"], "summary": "In American Psycho, Bret Easton Ellis imaginatively explores the incomprehensible depths of madness and captures the insanity of violence in our time or any other. Patrick Bateman moves among the young and trendy in 1980s Manhattan. Young, handsome, and well educated, Bateman earns his fortune on Wall Street by day while spending his nights in ways we cannot begin to fathom. Expressing his true self through torture and murder, Bateman prefigures an apocalyptic horror that no society could bear to confront.", "asin": "0679735771", "rank": "9873", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51UPuMIfpuL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}