{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 39.7391536, "ratings": {"num_ratings": 90, "rating": 3.6, "reviews": [{"review_sentiment": 1.0, "review_text": "The book was printed very weirdly. The pages were upside down and read from right to left (instead of left to right). It is a nightmare"}, {"review_sentiment": 3.0, "review_text": "I had to push myself in the middle to connect with a renewed \"interest\" at the end, ending with great disappointment.  Why?  I ordered it because I am retired and now officially an old man.  I thought I would read about a man's inner thoughts and emotions and dialogs with himself over becoming introduced to the changes in body and spirit in aging.  I was looking for some insights and just identifying with someone else - (her character) as they faced changes in life that one not always wants to accept.  But her manner of writing I enjoyed.  She is very detailed.  You'll get a glimpse of the color of the lamp shade behind the desk.  Things like that; and her detailed descriptions of people's faces and human shape.  She was truly a gifted writer.  I \"think\" (?)  I'll try her book on the Pioneer days in the Midwest, and maybe feel more satisfaction."}, {"review_sentiment": 5.0, "review_text": "The synopsis shown here is NOT for The Professor's House which is a beautifully written story with many undertones to it. On the surface it appears a story of family life, quite mundane really but there are hidden depths here. Wonderful characterisation of all the characters I felt not just Godfrey St. Peter, even the periphery characters all had their time on the page.A gentle novel, but heartfelt and reflective."}, {"review_sentiment": 4.0, "review_text": "Cather's writing is, as always, beautiful and lucid, and her characters are finely drawn. I found myself riveted by the tensions in the family as well as the romantic figure of Tom Outland and his relationship with the professor and his daughters. The only reason I didn't give this five stars is that the book ends abruptly, with no resolution of the issues raised, such as the outcome of a lawsuit. I wish the loose ends had been tied up. I've read that Cather wrote the middle section first (Tom's story) and then filled in the end pieces, as it were; this may explain the unsatisfying conclusion. But the book is well worth reading for its lyrical descriptions of the Southwestern landscape."}, {"review_sentiment": 5.0, "review_text": "An artful and unique examination of our relationship with the past"}, {"review_sentiment": 4.0, "review_text": "More simply written and accessible than its Introduction would lead you to believe. A character study which is both effective and involving."}, {"review_sentiment": 5.0, "review_text": "Wonderful book with interesting characters."}, {"review_sentiment": 5.0, "review_text": "This is the story of another dysfunctional family.  The story begins when Professor St. Peter, an unusual name, is working in his office in a house he has lived in since his marriage.  An unattractive house, but one the professor feels at home, where he keeps his office even though, due to his writing of eight books on Spanish history and exploration, he made money to buy a much finer house.  His wife, Lillian, cannot believe how stubborn he is about keeping his office in this old house.  One good friend is Augusta, the niece of his landlord, a sewing woman, a spinster and very religious.  The two work different hours in the office at the top of the house, are considerate of each other in leaving the place neat.  The professor is fifty-two and feeling so old.Mrs St. Peter is a pretty woman, the St Peters are parents of two daughters, both married, two sons-in-law, different from each other as are the daughters.  Most of the characters are unlikable, and dislike each other.  A young man, killed in the Great War, was in love with the older daughter, Rosamund.  Rosamund was the fiancee of Tom Outland who when he was killed left her his heir.  Rosamund married Louie Marsellus who made Tom's inventions and lab work very wealthy.  This man is good at business and in making money.  The couple is wealthy, building a beautiful home, lavishly furnished.  Louis calls his mother-in-law Dearest, which she loves and I feel is silly.  The other couple, Scott and Kathleen McGregor, are middle class.  The rich couple are always donating their old possessions to the younger couple infuriating the two.  The pair likes to show off their possessions.  Mrs St Peter is happy that her daughter has married such a prosperous man.  Mother and daughter are materialistic.  The professor is unhappy with all of this, wants a quiet life. sympathizes with the younger couple.Another woman, the wife of the physics professor feels that her husband should share in Outlander's fortune.  He worked in her husband's lab, worked with him.  The good professor is disturbed with all of this.The book is set in a college located near Lake Michigan.  Many of Cather's books are in the Great Plains State of Nebraska.  The book is divided into three parts, The Family about the family's life and ways of living, Tom Outland's Story which I read in a collection of Cather's short stories.  Tom is much talked about in the book, a star among the students.The Tom Outland Story is the best part of the book.  It is a magical story set among the mountain country, a beautiful, desolate area.  High up on the cliffs, Tom found a beautiful town or city, a very sophisticated, ancient civilization.  He and his friend, Blake, dug up some artifacts and built a road to the old city.  This area should have been left alone.  Tom went to Washington to let archaeologists know about his find and was badly misused in many ways.  I was disgusted by the manner Tom and very old precious artifacts were treated.  This section of the book is beautifully written.This is a deep, sad book.  The third section is quite short.  Godfrey St Peter is alone.  His older daughter, husband and mother have gone to spend the summer in France.  The professor is able to do what he wants, to be his own man, not to have to be who he must be to his family.The family members made me angry and disgusted, fighting over possession, showing off their home to those they thought important, going to fancy restaurants, on expensive vacation, bragging.  Jealousy, envy, but money talks loud and clear.  An important book."}, {"review_sentiment": 5.0, "review_text": "Very readable story (in 3rd person) with a startling middle section \"Tom Outland's Story\" (in 1st person), making a very interesting, profound novel.  One of Cather's best."}, {"review_sentiment": 4.0, "review_text": "She writes so well"}]}, "authors": ["Willa Cather"], "isbn": "0679731806", "longitude": -104.9847034, "periods": ["1900s"], "title": "The Professor's House", "word_cloud": "print weirdly page upside right leave instead leave right nightmare push middle connect renew interest end end great disappointment order retire officially old man think man thought emotion dialog become introduce change body spirit age look insight identify someone else character face change life always want accept manner writing enjoy detail get glimpse color lamp shade desk thing detailed description people face human shape truly gift writer think try day maybe feel satisfaction synopsis show beautifully write story many undertone surface appear story family life quite mundane really hidden depth wonderful characterization character felt even periphery character time gentle heartfelt reflective writing always beautiful lucid character finely draw find rivet tension family well romantic figure relationship professor daughters reason give star end abruptly resolution issue raise outcome lawsuit wish loose end tie write middle section first story fill end piece unsatisfying conclusion well worth read lyrical description landscape artful unique examination relationship more simply write accessible character study effective involve wonderful interesting character story dysfunctional family story begin unusual name work office live marriage unattractive professor feel home keep office even due write spanish history exploration make money much finer wife lillian believe stubborn keep office old good friend niece landlord sew woman spinster religious work different hour office top considerate leave place neat professor feeling pretty woman parent daughter marry different daughter most character unlikable young man kill older daughter fiancee kill leave heir marry make invention lab work wealthy man good business make money couple wealthy building beautiful home lavishly furnish call love feel silly couple middle class rich couple always donate old possession younger couple infuriate pair like show possession happy daughter marry prosperous man daughter materialistic professor unhappy want quiet life sympathizes younger woman wife physic professor feel husband share fortune work husband lab work good professor disturb set college locate divide part family life way live collection short story much talk star best part magical story set mountain country beautiful desolate area cliff find beautiful town city sophisticated ancient civilization friend dug artifact build road old city area leave alone go let archaeologist know find badly misuse many way disgust manner old precious artifact treat section beautifully deep sad third section quite short alone older daughter husband mother go spend summer professor able want man family member make angry disgusted fight possession show home thought important go fancy restaurant expensive vacation brag envy money talk loud clear important very readable story person startle middle section person make interesting profound best write well", "genres": ["Fiction & Literature"], "summary": "Willa Cather's lyrical and bittersweet novel of a middle-aged man losing control of his life is a brilliant study in emotional dislocation and renewal. \r\n\r\nProfessor Godfrey St. Peter is a man in his fifties who has devoted his life to his work, his wife, his garden, and his daughters, and achieved success with all of them. But when St. Peter is called on to move to a new, more comfortable house, something in him rebels. And although at first that rebellion consists of nothing more than mild resistance to his family's wishes, it imperceptibly comes to encompass the entire order of his life. \r\n\r\nThe Professor's House combines a delightful grasp of the social and domestic rituals of a Midwestern university town in the 1920s with profound spiritual and psychological introspection. ", "asin": "0679731806", "rank": "96959", "city": "Denver", "image": "https://images-na.ssl-images-amazon.com/images/I/51HZD4mZDYL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}