{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 36.1662859, "ratings": {"num_ratings": 1161, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I truly enjoyed reading this book. I felt like it was me on a trip a made to Las Vegas high all the way. This book is very relatable, there is no way I can’t give it 5 stars, which there were more stars. Loved it!"}, {"review_sentiment": 5.0, "review_text": "Hunter Thompson is an American Legend. Extremely enjoyable read."}, {"review_sentiment": 3.0, "review_text": "This is obviously a classic of American literature, a major influential book. Some aspects of it remain both powerfully insightful and hilarious of the sort that creates belly-ache laughter.But it is also horribly misogynistic and makes violence against women a joke. I could not in good conscience give this to a young person to read without a whole presentation on how to read in the context of it's time. I think this basic inhumanity cripples the work, and invalidates much of it from surviving as a classic in the greater sense of the word.Three stars is the average of extremes: some five star passages and some zero star passages."}, {"review_sentiment": 1.0, "review_text": "Very bad spelling mistakes and low quality"}, {"review_sentiment": 1.0, "review_text": "The font is comic sans! The first page put a's where there should have been d's eg 'we arove aown to Malibu'. The story is fine but don't buy prime version of this book."}, {"review_sentiment": 1.0, "review_text": "Great book, but the price for the kindle version is too much.It should come with the print edition for this price.Read it, but not on a kindle."}, {"review_sentiment": 5.0, "review_text": "What a long strange trip it was. Its almost as if I lived it.........wait! Oh yeah, I think I did. Been there."}, {"review_sentiment": 5.0, "review_text": "One of my favorite books ever. Thompson was a brilliant writer. I could read this again and again. I recommend this book to anyone who even slightly considers reading it. You will not regret it."}, {"review_sentiment": 5.0, "review_text": "One of Thompson's classics. It will be incredible to know where life was really like that when he was growing up. Only way want to find out..."}, {"review_sentiment": 5.0, "review_text": "Classic."}]}, "authors": ["Hunter S. Thompson"], "isbn": "0679785892", "longitude": -115.149225, "periods": ["1900s"], "title": "Fear and Loathing in Las Vegas: A Savage Journey to the Heart of the American Dream", "word_cloud": "truly enjoy read felt trip make high way repeatable way give star star love extremely enjoyable obviously classic literature major influential aspect remain powerfully insightful hilarious sort creates also horribly misogynistic make violence woman joke conscience give young person whole presentation context time think basic inhumanity cripple work invalidates much survive classic greater sense star average extreme star passage star passage very bad spell mistake low quality font comic sans first page put eh rove sown story fine buy prime version price kindle version come print edition long strange trip almost live wait yeah think be favorite ever brilliant writer recommend anyone even slightly considers read regret classic incredible know life really grow only way want find classic", "genres": ["Memoir", "Essay", "Travel Writing", "Social & Cultural Studies", "Politics"], "summary": "Fear and Loathing in Las Vegas is the best chronicle of drug-soaked, addle-brained, rollicking good times ever committed to the printed page. \r\n\r\nIt is also the tale of a long weekend road trip that has gone down in the annals of American pop culture as one of the strangest journeys ever undertaken.", "asin": "0679785892", "rank": "5633", "city": "Las Vegas", "image": "https://images-na.ssl-images-amazon.com/images/I/51BwDija1nL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}