{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 39, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "gift for my daughter"}, {"review_sentiment": 4.0, "review_text": "enjoyable read .."}, {"review_sentiment": 5.0, "review_text": "I arrived at this novel by Faulkner after a rereading of _The Sound and the Fury_ and a reading of _Pylon_, which I reviewed recently. Having read Faulkner's best-known masterpieces a few years ago, I had had my eye on _The Wild Palms_ (1939) for a while. The novel certainly has a good reputation (unlike, say, _Requiem for a Nun_), but it seems to me it is often eclipsed by the novels that Faulkner published before it. I for my part regard _The Wild Palms_ as an example of Faulkner at his best. So, if you've enjoyed _The Sound and the Fury_, _As I Lay Dying_, _Absalom, Absalom!_, _Light in August_, and _Go Down, Moses_, you will love _The Wild Palms_. I'd even say if you haven't read the other novels, if you're new to Faulkner and are thinking of starting with _The Wild Palms_, by all means, do so.Known also as _If I Forget Thee, Jerusalem_ (the author's original title), _The Wild Palms_ consists of two equally compelling interwoven stories: \"Wild Palms\" and \"Old Man.\" In a sense, _The Wild Palms_ could be regarded as Faulkner's greatest structural experiment, as the two stories are not directly related: there is no unity of time, place, or character. The two stories, however, are tightly related thematically. The obvious link is that both are concerned with men dealing with women. To me, the most important theme the two stories share is that of individual freedom, and what people choose to do with it.In \"Wild Palms,\" two lovers go on a mad adventure as they try to escape respectability. \"Old Man\" follows a convict on the loose during a flood and his efforts to take a pregnant woman to safety. As I said, freedom is an important issue here, and I couldn't stop turning the pages of _The Wild Palms_ as I wondered whether the main characters would \"do the right thing\" in the end and find the redemption that so many Faulkner characters seek, though only some find.Why two stories? Faulkner wrote each one separately. He started with \"Wild Palms,\" which was to be a short story but developed into a novel. \"Old Man\" was written later and interwoven with the first story \"as a counterpoint to [\"Wild Palms\"], in an effort to maintain the intensity of the latter story without allowing it to become shrill\" (from the editor's note). Given the genesis of the text, many have contested whether _The Wild Palms_ is really a novel, but then the same question has been asked of _Go Down, Moses_, which is composed of short stories. The great Spanish novelist Camilo José Cela once defined the novel as \"a book featuring the phrase 'a novel' under its title\" (I'm paraphrasing). Is _The Wild Palms_ a novel? \"Sure,\" I would say, \"it's a Faulkner novel.\" Looking at the issue from another perspective, those who answer the question negatively are still getting an awesome deal: two novels for the price of one.The ten years between 1929 and 1939 saw the publication of Faulkner's best work. (If we have to choose a low point in this decade, that would probably be _Pylon_, though this is still a good novel.) _The Wild Palms_ brings Faulkner's decade of creative virtuosity to a magnificent close. The novel, incidentally, was greatly influential in France (it provided the structure for Agnes Varda's film _La Pointe Courte_, which some take to mark the true beginning of the French New Wave) and in Latin America (the translation to Spanish was by Borges).Next on my Faulkner reading list: _The Hamlet_ (1940).Thanks for reading, and enjoy the book!"}, {"review_sentiment": 3.0, "review_text": "This was a book by Faulkner, so good anyway, but I'm pretty sure I lost the train of thought along the story (ok I have read it all in a bookshop without buying it while I was waiting a friend - it was a long wait). So I have mixed feelings because I had to run trough it.Siccome lo ha scritto Faulkner, questo libro per me é bello di default, ma credo di aver perso il filo del discorso mentre lo leggevo (l'ho letto velocemente mentre aspettavo un'amica in libreria, é stata una lunga attesa) quindi non so bene come parlarne."}, {"review_sentiment": 2.0, "review_text": "Turns out I am not a fan of this style of writing."}, {"review_sentiment": 5.0, "review_text": "Love his books. basically there two books in one"}, {"review_sentiment": 5.0, "review_text": "Great story of sex and violence"}, {"review_sentiment": 4.0, "review_text": "An oddity that in the end makes perfect artistic sense. In OLD MAN the world has returned to its original state: water. It is the best fictional depiction of a flood I've ever read. In THE WILD PALMS Faulkner sets aside all that past-is-never-dead baloney and writes a contemporary story of love and passion that approaches the best of D. H. Lawrence."}, {"review_sentiment": 2.0, "review_text": "The story of the couple es fantastic, but the one about the flood, unbearable."}, {"review_sentiment": 2.0, "review_text": "This book is supposed to be great, but it drags on and on."}]}, "authors": ["William Faulkner"], "isbn": "0679741933", "longitude": 0.0, "periods": ["1900s"], "title": "The Wild Palms", "word_cloud": "gift daughter enjoyable arrive reread reading review recently have masterpiece year ago eye certainly good reputation say seem often eclipse novel publish part regard example best so enjoyed love even say novel new think start mean also author original title consist equally compel interwoven story sense greatest structural experiment story directly relate unity time place character story however tightly relate thematically obvious link concern men deal woman important theme story share individual freedom people choose lover go mad adventure try escape respectability follow convict loose flood effort take pregnant woman safety say freedom important issue turn page wonder main character thing end find redemption many character seek story write separately start short story develop write later interweave first story counterpoint effort maintain intensity latter story allow become shrill editor note genesis text many contest really question ask compose short story great spanish novelist define feature phrase title paraphrase be sure issue perspective answer question negatively still get awesome deal novel price year saw publication best work choose low point decade probably still good brings decade creative virtuosity magnificent close incidentally greatly influential provide structure film mark true begin french translation read list reading enjoy good anyway pretty sure lose train thought story ok bookshop buy wait friend long wait so mix feeling run trough lo ha scritto quest libra bell di default credo di peso il filo led discorso entree lo legged lento velocemente aspettavo liberia stats tuna lung attest quin non been come parlance fan style writing basically story sex violence oddity end make perfect artistic sense world return original state water best fictional depiction flood ever set aside baloney writes contemporary story love passion approach best story couple fantastic flood unbearable suppose great drag", "genres": ["Fiction & Literature"], "summary": "In this feverishly beautiful novel—originally titled If I Forget Thee, Jerusalem—William Faulkner interweaves two narratives, each wholly absorbing in its own right, each subtly illuminating the other.\r\n\r\nIn New Orleans in 1937, a man and a woman embark on a headlong flight into the wilderness of illicit passion, fleeing her husband and the temptations of respectability.\r\n\r\nIn Mississippi ten years earlier, a convict sets forth across a flooded river, risking his own chance at freedom to rescue a pregnant woman. From these separate stories Faulkner composes a symphony of deliverance and damnation, survival and self-sacrifice, a novel in which elemental danger is juxtaposed with fatal injuries of the spirit.\r\n\r\nThe Wild Palms is grandly inventive, heart-stopping in its prose, and suffused on every page with the physical presence of the country that Faulkner made his own.", "asin": "0679741933", "rank": "371592", "city": "Lafayette County", "image": "https://images-na.ssl-images-amazon.com/images/I/51TgJ7%2BQ5JL.jpg", "country": "MS", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}