{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 22, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "An interesting first novel, this does an excellent job of switching from the teen point of view to that of the settled adult later. It examines many key turning points in life, and also holds well to its chronological setting, giving clear pictures of times and places."}, {"review_sentiment": 4.0, "review_text": "I must admit I struggled through this book thoroughly disliking the main character and his old friend and couldn't figure out where the story was going. However the final chapter (almost an epilogue) made the read worthwhile and in fact after I read it once, I retread it slowly and savored each word and sentiment"}, {"review_sentiment": 5.0, "review_text": "Excellent."}, {"review_sentiment": 5.0, "review_text": "I read this book for a literature class and it was probably one of my favorite books I've read this year. It was hilarious and made me think a lot about my own philosophy on life. I'd definitely recommend for a bit of light yet awesome reading."}, {"review_sentiment": 5.0, "review_text": "An extraordinary work that shows fully why Julian Barnes may be one of the best English language authors -- not just of the 20th-21st centuries, but ever.Few compare with his depth of observation and insight and fewer still with the ability to effortlessly convey it in words."}, {"review_sentiment": 4.0, "review_text": "BARNES SAYS HIS MOTHER HATED THIS DIRTY-MINDED LITTLE BOOK AND i CAN UNDERSTAND WHY SHE DID.  BUT IT APPEALS TO MY DIRTY LITTLE MIND!!!"}, {"review_sentiment": 5.0, "review_text": "Julian Barnes is a great writer, and do not think that will ever change. Always a worthwhile read....just wish he was a bit more prolific. Buy it read it, you will not be sorry....Get also a Sense of an Ending--very good also."}, {"review_sentiment": 2.0, "review_text": "While this is the first book that Julian Barnes published, way back in 1980, it is also definitely the dullest of the three of his that I've read (none of which I really enjoyed very much). No wonder - it won the Somerset Mahgham Prize! I still wonder why people I know who like reading much more than I do adore Barnes. Maybe they are reading it for different words than I am?Sliced into three distinct parts, this slight book (it could have easily been edited down to one or two very good short stories) covers a short period in the author's (it is surely autobiographical, as first novels are wont to be) early life, his first overseas foray, along with the more recent post-marriage and post-baby phase. Great.So the narrator Christopher plays innocent French word games with his tri-cultural partner in crime Toni (a Polish Jew born in the UK) in British museums in the first act; in the second he matures, bedding a French girl in a brief, cryptic romance, while in the third part he comes full circle, enduring a casual crisis with his wife, whom he met at the same time.Sounds exhausting, but there's no need for concern - it's all very irrelevant. There's a brief moment when the tale gets interesting, which could have made one of the two short stories this novel had in it: that moment occurs when our hero realises with relief that he's a cuckold, confirming at the same time our theory that he's a loser - but it's really quite brief. Great."}, {"review_sentiment": 4.0, "review_text": "I did like the story, and the way Barnes wrote it. Download was fast to my Samsung tablet and stored in my kindle app. Pitty the app does not allow the option of audio-book, or underline important sentences along the story. All the same, I do recommend this book, and the download of it by kindle.  Overall result:  8/10"}, {"review_sentiment": 4.0, "review_text": "Julian Barnes is my preferred author for the present time. I read the great majority of his books. They contain a lot of life philosophy. I felt richer spiritually after reading each of his books. The most beautiful page I read about fiction was the preface of his latest book \"Through the window\". I read it for all my friends"}]}, "authors": ["Julian Barnes"], "isbn": "0679736085", "longitude": 2.3514992, "periods": ["1900s"], "title": "Metroland", "word_cloud": "interesting first excellent job switch teen point view settle adult later examine many key turn point life also hold well chronological set give clear picture time place struggle thoroughly dislike main character old friend story go however final chapter almost epilogue make worthwhile fact retread slowly savor word sentiment excellent literature class probably favorite year hilarious make think lot life definitely recommend bit light yet awesome reading extraordinary work show fully julian best english language author century compare depth observation insight fewer still ability effortlessly convey word julian great writer think ever change worthwhile wish bit prolific sorry also good also first julian barnes publish way back also definitely dullest none really enjoy much wonder still wonder people know read much adore barnes maybe read different word slice distinct part slight easily good short story cover short period author surely autobiographical first novel wont early life first overseas foray recent phase narrator play innocent french word game partner crime bear museum first act second matures bed french girl brief cryptic romance third part come full circle endure casual crisis wife meet exhaust need concern irrelevant brief moment tale get interest short story moment occur hero reality relief cuckold confirming time theory loser really quite brief like story way write fast tablet store kindle app app option underline important sentence story recommend download overall result julian prefer author present time great majority contain lot life philosophy felt richer spiritually read beautiful page fiction preface latest window friends", "genres": ["Fiction & Literature"], "summary": "From the winner of the 2011 Man Booker Prize for Fiction comes a magnificent portrait of youth and growing up.\r\n\r\nChristopher and Toni found in each other the perfect companion for that universal adolescent pastime: smirking at the world as you find it. In between training as flaneurs and the grind of school they cast a cynical eye over their various dislikes: parents with their lives of spotless emptiness, Third Division (North) football teams, God, commuters and girls, and the inhabitants of Metroland, the strip of suburban dormitory Christopher calls home. \r\n\r\nLonging for real life to begin, we follow Christopher to Paris in time for les evenements of 1968, only to miss it all in a haze of sex, French theatre and first love, leading him, to Toni's disappointment, back to Metroland.", "asin": "0679736085", "rank": "495361", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/618BpTQnFHL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}