{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 35.6828378, "ratings": {"num_ratings": 200, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "What is left unspoken is the beauty of Kawabata Yasunari's prose."}, {"review_sentiment": 5.0, "review_text": "Very good book and I recommend it for anyone interested in learning makeup basics!"}, {"review_sentiment": 5.0, "review_text": "O.M.G.What a wonderful Artist the book is amazing. The transformations. The magazine covers mind blowing. kevin 💘  we miss U."}, {"review_sentiment": 3.0, "review_text": "This book was well written and I was interested by the foreignness of a long ago Japan, but I could not get into the book too much as I did not care for the characters. I just didn't care about any of them. The man was too self centered and lived a purposeless life, one woman was always on the verge of hysteria (too emotional and a drama queen) the other too suppressed and unable to manage her emotional life. Of course these characters were created to bring us into the world of oldtime Japan but as a modern day woman, I could not imagine being either woman nor caring for such a shallow man. However the visual rural scenes of Japan in the winter and spring were quite beautiful."}, {"review_sentiment": 1.0, "review_text": "Cliches in description. No character development. Lost empty main character self absorbed with nothing in the self to be absorbed by."}, {"review_sentiment": 5.0, "review_text": "I loved this book.  It moves slowly over a fairly short time span, but it has depth and insight.  Beautifully written and elegantly translated."}, {"review_sentiment": 1.0, "review_text": "I read this book for my book club. I have to admit, I was immediately drawn to the title, the description, the acclaim of the Noble Prize in literature, etc. Furthermore, we hadn't read a \"love story\" for book club since I joined, so to say that I was looking forward to reading this would be a slight understatement.  My initial impression of the writing sadly carried through to the end of the book. The writing is austere and lacking poignancy in both diction and syntax. I would argue that not only is it \"simple\" - which can be stunningly effective - but it's simplistic, almost as if the work had been translated by someone who knew limited English. I was shocked to read the reviews about how \"masterfully\" this book is written. Aside from a few vaguely captivating descriptions of \"the snow\" and \"the country\", there are few redeeming qualities to this book. The characters are undeveloped, flat, and one dimensional.  The premise of this story could take one so deeply into the human condition, and yet, leaves so much unexplored.  The one dimensional pusillanimous portrayal of the feminine - while perhaps historically and culturally valid - left me feeling, how should I say this...pissed off.  The female heroin is bland and weak. Her utterances and actions alike reek of rueful adolescent desperation.  It was hard to get past this. The dialogue is perhaps the most torturous part of the book. Reading the dialogue sections evoked the image of a little man searching the dictionary for the right translation, but deciding that it was taking to long, and instead falling back on repeating the trite, familiar words over and over and over again."}, {"review_sentiment": 4.0, "review_text": "good reprint"}, {"review_sentiment": 4.0, "review_text": "Doomed relationship between a geisha and a wealthy, shallow dilettante.  Features some of the most beautiful and lyrical writing I've ever encountered.  In some ways, the novel is like a great painting.  A masterpiece but it's hard to care about the people portrayed."}, {"review_sentiment": 4.0, "review_text": "Fascinating how a seemingly calm style of text can shimmer with emotion.Found satisfying the cyclic element in the story arc.The initial image of Yoko in the railway carriage window is haunting.The Snow Country is like an ever-present character in the story."}]}, "authors": ["Yasunari Kawabata"], "isbn": "0679761047", "longitude": 139.7589667, "periods": ["1900s"], "title": "Snow Country", "word_cloud": "leave unspoken beauty prose very good recommend anyone interested learn makeup basic wonderful amaze transformation magazine cover blow kevin miss well write interested foreignness long much care character care man self center live purposeless life woman always verge hysteria emotional drama queen suppress unable manage emotional life course character create bring world old time modern day woman woman care shallow man however visual rural scene winter spring quite beautiful description character development empty main character self absorb nothing self absorb love move slowly fairly short time span depth insight write elegantly translate club admit immediately draw title description acclaim noble literature etc love story club join say look forward read understatement initial impression write sadly carried end writing austere lack poignancy diction syntax simple stunningly effective simplistic almost work translate someone know limited shock review masterfully write vaguely captivate description redeem quality character undeveloped flat dimensional premise story deeply human condition yet leave much unexplored dimensional pusillanimous portrayal feminine perhaps historically culturally valid leave feeling say piss female heroin bland weak utterance action alike reek rueful adolescent desperation hard dialogue perhaps torturous part dialogue section evoke image little man search dictionary right translation decide take long instead fall repeat trite familiar word good reprint relationship geisha wealthy shallow dilettante beautiful lyrical writing ever encounter way great paint masterpiece hard care people portray fascinate seemingly calm style text shimmer satisfy cyclic element story initial image railway carriage window character story", "genres": ["Fiction & Literature", "Romance"], "summary": "Nobel Prize winner Yasunari Kawabata’s Snow Country is widely considered to be the writer’s masterpiece: a powerful tale of wasted love set amid the desolate beauty of western Japan.\r\n \r\nAt an isolated mountain hot spring, with snow blanketing every surface, Shimamura, a wealthy dilettante meets Komako, a lowly geisha. She gives herself to him fully and without remorse, despite knowing that their passion cannot last and that the affair can have only one outcome. In chronicling the course of this doomed romance, Kawabata has created a story for the ages — a stunning novel dense in implication and exalting in its sadness.\r\n \r\n“Kawabata’s novels are among the most affecting and original works of our time.” The New York Times ", "asin": "0679761047", "rank": "38142", "city": "Tokyo", "image": "https://images-na.ssl-images-amazon.com/images/I/51CzRw3jk1L.jpg", "country": "Japan", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}