{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 471, "rating": 4.1, "reviews": [{"review_sentiment": 2.0, "review_text": "This is a difficult book and makes for slow reading.  In part this is because its language is so crafted that you have to take your time over it.  In part it is because it takes a long time before you learn the names of its two main characters, initially referred to as just “he” and “she”.  In the case of the patient, we will find that there is a good reason for this.He had been in an aeroplane which had caught fire in the Egyptian desert towards the end of the Second World War.  He had been dreadfully burnt.  He had been rescued by Bedouins, and ended up in a badly damaged villa, not far from Florence, which had been temporarily used as a hospital.  He is looked after with great devotion by a Canadian nurse whose name, we eventually learn, is Hana; and they both refuse to move out of the villa when the other patients have been moved to a more suitable building.  It is never clear to me why she is so attached to him and why they refuse to move.In another hospital in Rome, a less seriously wounded patient called Caravaggio, who, before the war, had been a friend of Hana’s father’s in Canada, hears of Hana’s whereabouts and travels to see her. We find that he has been a professional thief who had been employed by the Allies, but had been caught by the fascists, who had amputated his thumbs. But we will find, much later, that Hana was not the only reason that brought him to the villa.Then a young Sikh sapper, nicknamed Kip, charged with clearing mines and booby-traps in the neighbourhood, turns up and occasionally enters the villa.  He and Hana become lovers, though Kip, conscious of being an outsider, always keeps an emotional distance.After some 140 out of around 320 pages of the book, the patient at last begins to tell Hana something of his earlier life.  For some ten years before the war he had been one of the explorers who had tried to find and map unknown oases in the Libyan desert, and he describes the ordeals involved.  In 1936 his party was joined by a young and newly-married couple, Geoffrey and Katharine Clifton.From this point onwards, anything I write would be a spoiler.  Moreover, the plot becomes more involved, and the structure of the story, moving backwards and forwards in time, becomes more difficult to follow.  Indeed, there are two chapters, each well away from the story of the patient.  The first of these, highly technical, deals with Kip’s work during the war of disabling German bombs, while I could make no sense at all of the next one.  In the end, the story is far more about Kip than about the patient – especially about Kip’s emotional self-control disappearing when he hears of the atomic bombs dropped on the Japanese, Asians like himself.  The last part of the book was again so enigmatic that I could make no sense of it.The book won the Booker Prize in 1993.  That truly astonishes me.  The main plot, about the patient, is ingenious (when it isn’t lost sight of, which, in long stretches, it frequently is); there are some dramatic scenes and the revelation of some unexpected secrets, such as who the patient actually is; but it makes for a laborious read, and, for me, the style, whose imagery is often grotesquely extravagant and pretentious, became an irritant rather than an enhancement of the book.  It got worse and worse as the book proceeded, and by the end I was so exasperated that I was about to give it one star, but reluctantly gave it two as I remembered the better, earlier parts of it."}, {"review_sentiment": 5.0, "review_text": "This review is from my wife (we share this account).Who are those people who gives 4 and even 3 stars to this book?! I read and reread it so many times during last 15 or so years - both in English and in Russian, and nothing beats it for me ever since. The language in this book is amazingly beautiful, I am not a native speaker, but even I can see it, mesmerized by it.The story is so powerful, though sad. It is one of the greatest romances for sure.And you can learn so many things reading this novel."}, {"review_sentiment": 5.0, "review_text": "This has always been my favorite book to pick up and read a random passage. Simply beautiful writing throughout and well worth rereading over and over."}, {"review_sentiment": 3.0, "review_text": "OK"}, {"review_sentiment": 5.0, "review_text": "Had lost my copy and wanted to re-read"}, {"review_sentiment": 5.0, "review_text": "Really enjoyed this book.Well written, just enough detail, not a hair too much.Now I want to watch the movie!"}, {"review_sentiment": 5.0, "review_text": "I loved each of the characters and their development throughout the story.  At times it is hard to follow until you grasp who is talking or thinking."}, {"review_sentiment": 5.0, "review_text": "Great story. Beautifully told"}, {"review_sentiment": 4.0, "review_text": "His best!"}, {"review_sentiment": 4.0, "review_text": "The story is interesting but the author's unusual punctuation took some time to get used to . About 1/3 of the way in, I couldn't put it down."}]}, "authors": ["Michael Ondaatje"], "isbn": "0679745203", "longitude": 31.243666, "periods": ["1900s"], "title": "The English Patient", "word_cloud": "difficult make slow reading part language craft take time part take long time learn name main character initially refer case find good reason aeroplane catch fire egyptian desert towards end second dreadfully burn rescue end badly damage villa far temporarily use hospital look great devotion canadian nurse name eventually learn refuse move villa patient move suitable building never clear attach refuse hospital seriously wound call war friend father hear whereabouts travel see find professional thief employed caught fascist amputate thumb find much later reason bring young sapper nickname charge clear mine neighborhood turn occasionally enters become lover conscious outsider always keep emotional page last begin tell something earlier life ten year war explorer try find map unknown oasis desert describes ordeal involve party join young couple point inwards anything write moreover plot becomes involve structure story move backwards forward time become difficult follow indeed chapter well away story first highly technical deal work war disabling german bomb sense end story far especially emotional disappearing hears atomic bomb drop japanese asian last part enigmatic sense truly astonish main plot ingenious lose sight long stretch frequently dramatic scene revelation unexpected secret actually make laborious style imagery often grotesquely extravagant pretentious become irritant rather enhancement get worse worse proceed end exasperate give star reluctantly give remember better earlier part review wife share account people give even star reread many time last year russian nothing beat ever language amazingly beautiful native speaker even see mesmerized story powerful sad greatest romance learn many thing read always favorite pick random passage beautiful write well worth reread ok have lose copy want really enjoy write enough detail hair want watch movie love character development story time hard follow grasp talk thinking story tell best story interesting author unusual punctuation take time get use way", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "With ravishing beauty and unsettling intelligence, Michael Ondaatje's Booker Prize-winning novel traces the intersection of four damaged lives in an Italian villa at the end of World War II. Hana, the exhausted nurse; the maimed thief, Caravaggio; the wary sapper, Kip: each is haunted by the riddle of the English patient, the nameless, burned man who lies in an upstairs room and whose memories of passion, betrayal,and rescue illuminates this book like flashes of heat lightening.", "asin": "0679745203", "rank": "34382", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51CrEeFLmFL.jpg", "country": "Egypt", "story_arc": ["Tragedy", "Things only get worse"]}