{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 20, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I love this book, but the person I sent it to hasnt received it. It's over a week after it was expected."}, {"review_sentiment": 5.0, "review_text": "This book, like Carey's \"The Unusual Life of Tristan Smith\" is a little like a balloon ride: You're never quite sure where you will touch down next, and what wacky characters are likely to get on (or off) when you do, but the views are great. If you like to follow a straightforward plot with 'recognizable' characters (or easily identifiable good guys and bad guys) and find all the loose ends tied up by the time you finish reading, these books are not for you, but I found both of them delightful.I particularly enjoyed the Australian background, the fairly detailed descriptions of mechanical processes and local ecosystems, and, above all, the tolerant acceptance of people with all kinds of human foibles and failings, as well as toward a variety of other creatures, including reptiles and birds. Readers may even be lured to sympathize, at least a little, with a monstrous carnivorous lizard that, like its mistress, has become rather fat and sluglike over many years of captivity.If that's not your cup of tea, or if you are put off by words from local dialects that are not familiar to you, try one of Carey's less fanciful books instead."}, {"review_sentiment": 3.0, "review_text": "Carey, Peter.  IllywhackerFrom the outset the reader is aware that he is being led on by a con-man, for Carey makes it plain on the cover that his narrator, Herbert Badgery ‘is a terrible liar and always has been.’  Moreover in the novel’s epigraph Carey cites dictionary definitions of the Australian word ‘Illywhacker’ indicating its meaning as variously ‘professional trickster,’ ‘trickster or spieler,’ ‘one who wacks the illy,’ ‘peter tickler’ and ‘eeler spee.’  So the book craves wary walking.  The reader is at once seduced into the world of Herbert Badgery, a man aged139 who is famous for being a physical wreck.  Strangely one more or less believes him, especially when he speaks of his internal workings, which leaves him ‘like some old squid lying on the beach.’  He tells us ‘I didn’t read a book until an age when most men are going blind.’  By the time he was in Rankin Downs gaol he was known as ‘The Professor.’I picked up this book in Poundland.  It was the solitary copy, lonely on a shelf of random leftovers.  The back cover was bent and from the front one a grizzled old man, face spotted with old age warts stared out at me.  After a one-page apologia we are plunged into the world of 1919 Geelong, an Australian resort on its beam ends, where we meet Annette Davidson, a disgruntled teacher and Phoebe, one of her pupils, a sulky girl, who gets excited only when, seeing an aeroplane gliding towards her - ‘my aeroplane,’ according to the narrator - and her parents Jack and Molly McGrath.  From then on Herbert becomes our guide, though often disappearing into the sidelines.  We soon forget that he is an old man, his time in gaol is skimped and his son Charles becomes the main focus.  It’s not ‘his story’ after all but a potted history of Australia, told by an aggrieved survivor.  I was reminded of Carey’s later novels through which I’d struggled many years ago.This is a densely packed book, moving through various cities (Ballarat, Sydney, Geelong), with swarms of characters, some having just walk-on parts.  The chapters are short, the scenes curtailed, and the book lacks focus.  Badgery appears and disappears, leaving many unanswered questions, such as Is Charles’s ‘Best Petshop in the World’ a reality?  Is his wife Emma mad?  Was he tricked into marrying her?  And the teasing ultimate question of course:  Is it Badgery or Carey who’s in charge of the narrative?"}, {"review_sentiment": 2.0, "review_text": "Illywhacker is an frustrating book. The quality of the writing and the command of metaphore are exceptional. Taken in isolation, many passages are gems. After a good start, however, the book does not hold together and, despite the quality of the prose, borders on the tedious. The main characters have too much interior life to be comic and too little interior life to be convincing. There is no real sense of direction. As this is not compensated for by other qualities of vision, I read the last page with considerable relief."}, {"review_sentiment": 4.0, "review_text": "Crazy story - terrific writing!"}, {"review_sentiment": 5.0, "review_text": "The one that got Peter Careyoff on his path to much success. A brief perspective history of Australians in the 20th century. A very good read."}, {"review_sentiment": 5.0, "review_text": "Australian writer Peter Carey has written a tour-de-force about a con man who winds up being conned. I am neither a Conner nor a man, but I had to empathize with the protagonist, warts and all, because of the pure power of Carey's writing. Carey has few equals when it comes to plot twists and characterization, and he couples this with a remarkable flair for dialog and language that will leave you shaking your head in admiration. How can one author combine beautiful language with constant surprises? The solution is too subtle to grasp but Carey manages, and very well."}, {"review_sentiment": 1.0, "review_text": "My copy of this book was a gift, and I was suckered in by the adjective \"funny\" from the review on the cover.  Intrigued, I read all the glowing reviews from the \"big name\" periodicals and prepared myself for one amazing read.  By the first hundred pages, as I got familiar with the protagonist and the author's style, I began to wonder if I had been flim-flammed.  I have to admit my first thought, upon finishing the book, was that this may have been the biggest waste of reading effort I have ever put into a book and that the glowing reviews were faked.  Yes, there are lush descriptions of Australia.  There are words and phrases that are singularly Australian.  There are a couple of plot twists that could only happen in Australia... yet there isn't anything about the characters that is uniquely Australian (their universality is in fact a plus for the author).  I'm left very confused, then, wondering how this could be considered the Great Australian Novel?Where is the \"funny?\"  The \"towering?\"  Before you accuse me of ethnocentrism I'll inform you that I am a well-read fan of world literature, and I'm familiar with novels that are \"funny\" and \"towering.\"  This book has not earned the right to be listed among them.  Lest you think I'm too hard a critic, in all my years I've only read one other book that, upon completion, I deemed a complete waste of time and trees... and my dislike for it dims in comparison to my visceral rejection of \"Illywhacker.\"  It is no small feat, therefore, to land on this, my very short list of books to avoid.  I've even waited two months after finishing \"Illywhacker\" to attempt a review, out of concern I would be too vitriolic in my critique.  Please keep in mind that I am exercising restraint when I say I read 600 pages waiting for something spectacular to happen, only to feel ripped off when I closed the book. If that was the intent of the author, then he achieved the effect marvelously.  However, he's also achieved my personal disdain and I'm confident that nothing short of a large cash payment in advance will encourage me to open another of his books.  Even today, eight weeks after finishing the book (and for the rest of my life, I fear) I actually *loathe* the name of the main character, \"Badgery.\"This would be a good book to have if you were stranded on a deserted island; you wouldn't feel guilty using it for toilet paper.I do not think it helpful or prudent to steer people away from books in general, but please use caution when deciding to purchase this for a friend.  It would only be fair to finish with the admission that I am no longer speaking to the \"friend\" who gave me this book, who claimed they had read it and that it was \"wonderful,\" only to concede (after I had finished it) that they had given up twelve pages in.  If you love and would like to keep your friends, do not send them a copy of this book."}, {"review_sentiment": 5.0, "review_text": "This is the book that introduced me, many years ago,  to Peter Carey.  I picked it up because I was intrigued by the title, because I was interested in Australia, and because I like long books.  But I *loved* it because Carey knows -- as simplistic as this sounds -- how to tell a story.  His characters are well drawn (from scoundrels to nutters to fools).  His pacing is spot-on.  His ear for language is superb.  This novel is well worth your time.  So many of the books I read are forgotten within days or weeks.  I read Illywhacker years and years ago, but it's stayed in my mind all this time.  It's that good."}, {"review_sentiment": 5.0, "review_text": "I love this book.  (I love Peter Carey generally, and especially here.)Many of the reviewers have confessed a certain bafflement when confronted with Carey, both in this novel and elsewhere.  This is not, I think, because his prose is stylistically off-putting, or his themes too profound or personal.Rather, Carey's novels are constructed in an unconventional manner, and that novelty, I think, confuses: each of his many chapters serves as a floating, almost separate episode.  The cumulative effect is less that of linked stories than linked prose poems.  The reader does not feel caught up in a forward moving narrative, but instead awash, for lack of a better word.  Sort of like Bruno Schulz.Beautiful, beautiful, haunting, haunting."}]}, "authors": ["Peter Carey"], "isbn": "0679767908", "longitude": 151.2164539, "periods": ["1800s", "1900s"], "title": "Illywhacker", "word_cloud": "love person send hast receive week expect like little balloon ride never quite sure touch next wacky character likely get view great follow straightforward plot character easily identifiable good guy bad guy find loose end tied time finish reading find particularly enjoy australian background fairly detailed description mechanical process local ecosystem tolerant acceptance people kinds human foible failing well variety creature include reptile bird reader even least little monstrous carnivorous lizard mistress become rather fat many year cup tea put word local dialect familiar try le fanciful instead lead make plain cover narrator terrible liar always moreover epigraph cite dictionary definition australian word indicate mean variously professional trickster trickster spieled wacks lily peter tickler peeler crave wary walk seduced world man famous physical wreck strangely le believe especially speaks internal working leaf old squid lie tell age men go time goal pick solitary copy lonely shelf random leftovers back cover bent front grizzle old man face spot old age wart star apologia plunge world resort beam end meet disgruntle teacher pupils sulky girl get excited see aeroplane glide towards accord narrator parent become guide often disappear sideline soon forget old man time goal skimp son become main focus story pot history tell aggrieve survivor remind later novel struggle many year densely pack move various city swarm character part chapter short scene curtail lack appear disappear leave many unanswered question be reality be wife mad trick marrying tease ultimate question course be charge narrative frustrate quality write command metaphor exceptional isolation many passage gem good start however together quality prose border tedious main character much interior life comic little interior life convince real sense direction compensated vision last page considerable relief story terrific write get path much success brief perspective history century good australian writer write con man wind con man empathize protagonist wart pure power write equal come plot twist characterization couple remarkable flair dialog language leave shake head admiration author combine beautiful language constant surprise solution subtle grasp manage well copy gift suckered adjective funny review cover glow review big name periodical prepare amazing first hundred page get familiar protagonist author style begin wonder admit first think finish biggest waste read effort ever put glow review fake lush description word phrase singularly australian couple plot twist yet anything character uniquely australian universality fact author leave confused wondering funny towering ethnocentrism inform fan world literature familiar novel funny tower earn right list think hard critic year completion deem complete waste time tree dislike dims comparison visceral rejection small feat therefore land short list avoid even wait month finish attempt review concern critique mind exercise restraint say page wait something spectacular feel rip close intent author achieve effect marvelously however also achieve personal disdain confident nothing short large cash payment advance encourage open even today week finish rest life fear actually name main character strand deserted island guilty use toilet think helpful prudent steer people away general please use caution decide purchase friend finish admission longer speak friend give claim wonderful concede finish give page love friend send copy introduce many year ago pick intrigue title interest like long know simplistic sound tell story character well draw scoundrel nutter fool pace ear language superb well worth time many forget day week year year ago stay mind time good love love generally especially many reviewer confess certain bafflement confront elsewhere think prose stylistically theme profound novel construct unconventional manner novelty think confuses many chapter serf float almost separate episode cumulative effect le link story link prose poems feel catch forward move narrative instead awash lack better word beautiful haunting haunting", "genres": ["Memoir", "Fiction & Literature", "Historical Fiction"], "summary": "In Australian slang, an illywhacker is a country fair con man, an unprincipled seller of fake diamonds and dubious tonics. And Herbert Badgery, the 139-year-old narrator of Peter Carey's uproarious novel, may be the king of them all. Vagabond and charlatan, aviator and car salesman, seducer and patriarch, Badgery is a walking embodiment of the Australian national character—espcially of its proclivity for tall stories and barefaced lies.\r\n\r\nAs Carey follows this charming scoundrel across a continent and a century, he creates a crazy quilt of outlandish encounters, with characters that include a genteel dowager who fends off madness with an electric belt and a ravishing young girl with a dangerous fondness for rooftop trysts. Boldly inventive, irresistibly odd, Illywhacker is further proof that Peter Carey is one of the most enchanting writers at work in any hemisphere.\r\n\r\n\"Carey can spin a yarn with the best of them.... Illywhacker is a big, garrulous, funny novel.... If you haven't been to Australia, read Illywhacker. It will give you the feel of it like nothing else I know.\" The New York Times ", "asin": "0679767908", "rank": "1506106", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51aox8P9uTL.jpg", "country": "Australia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}