{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 64, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Poetry in novel verse that gets very high marks!"}, {"review_sentiment": 5.0, "review_text": "a classic , i read it twice!"}, {"review_sentiment": 4.0, "review_text": "The prose verse form was surprising at first but one quickly gets used to it. A decent study of the \"me me me\", young, '80s mentality."}, {"review_sentiment": 5.0, "review_text": "Admittedly somewhat difficult to read, until one gets the rhythm (iambic tetrameter) in one's inner voice. If you can read Shakespeare without the iambic pentameter being obvious, this book will interest you.I have not completed it. It does seem to have bits of \"Tales of the CIty\" interposed.On the whole, I find it enjoyable: Good, but not great."}, {"review_sentiment": 2.0, "review_text": "This book really isn't very good. Maybe it's because I read it directly after Anna Karenena (a very good book), but the sonnet model is strange, doesn't add much to the story, and the story isn't that great either (in my opinion)."}, {"review_sentiment": 5.0, "review_text": "Incredible! 600 sonnets that make up a novel! What talent! Sheer genius!"}, {"review_sentiment": 5.0, "review_text": "Excellent book at a reasonable price!"}, {"review_sentiment": 4.0, "review_text": "Extremely clever form of writing!  The story however was quite contrived and therefore not believable.  But wordsmiths, punsters, and lovers of satire will enjoy the literary style."}, {"review_sentiment": 4.0, "review_text": "....... and you're ready to excuse a lot from an author who sets out to write a novel in verse: so he gets away with less-than-memorable characters and flimsy story-lines. Some rhymes are stretched and / or trite, and he sometimes resorts to little-known words - archaisms, even - to help things along. But some of the verses are highly impressive - the nature ones and the philosophical ones, for example. It's fun, too, winkling out the literary allusions."}, {"review_sentiment": 4.0, "review_text": "Upon a crisp and sunny winter's dayA year ago in fair Eugene(Many narrative poems start this wayWith unabashed mise en scene)I wandered to the Bookstore Familyof Smith, perhaps, perchance, that day to spyA novel unbeknownst to me(\"Not new, but new enough\", said he).The shelves, as usual, overflowingWith a mute ferocityOf yet unread verbosityWould leave any bibliophile glowingBut Smith's ends with a bonus score:The extra pilings on the floor.Content, as I am, for creative strictureThat shapes my meandering thoughtI updated my censorial picturethus, \"Suppose I only boughta book from those upon the floor?Indeed, I like that picture more.\"Contented, now, I let my glanceRoll over Sense and CircumstanceBy Austen Krugman, don't forget...What else, this day, should my roving eye see?...From ancient grudge, break to new mutiny! -Another Romeo and Juliet.But what's this here? Intriguing! Wait.A novel called The Golden GateBy Vikram Seth. It's writ in verseIn lieu of more predictableForms. Indeed, it's quite inverseOf novels more habitual.Intrigued, I stood and thumbed its pages.Next I knew, the subtle agesThat, in bookstores, come to passHad come again down on my ass.A narrative of deft delivery;Self-conscious, yes, but tongue-in-cheek,A pleasure, yet, to read and speak,Adorning words with such sweet liveryAs comes from gentle virtuosityOf verse and verb. My curiosityWas piqued and so I parted with this bookTo give it subtler critique.It's dense reading. To savor it, I tookThe better part of that next weekUnhurriedly, to let the words sink in.Iambic tetrameter's hardly beenIn vogue these days, and thus, it takes essayingSometimes to make out just what Seth is saying.Thankfully, the setting shines of oldIn San Francisco where we lay our sceneThat foggy bay, so fair, so crisp, so meanAgainst the backdrop of that Gate of GoldThat funnels traffic land to landWhere steel meets concrete, sea and sand.The snobbiness of college bratsAnd artsy, twitsy citygoersIs the focus of the spatsThat Seth so shrewdly muses o'er.I cannot help but wonder ifHis fluency with high-class tiffIs autobiographicalOr merely hypothetical.In either case, he's on the markObserving how the educatedGo about their obduratedLifestyles, while in the darkTheir doubtings stumble through a mazeOf Minotaurs and city haze.These characters aren't lovableBy any metric I can fast produceDemises seem so probableFrom first the author quaintly introduceEach brat in turn. He has no loveFor them, and yet he's quite proud ofEach one's respective idiom.They seem doomed by the tediumOf lives only half-chose, indeedThe nature of their existentialMusings feels consequentialOf the author's constant needTo reassure his educationHas been put to good vocation.Let me, though, not condescendTo imply that I didn't raptly savorEvery twist and sinuous bendOf Seth's refined and polished love of labor.What's lacking in his characterizationIs more than made up for by the narration:A voice that commands as it croonsThe literary reader swoonsOn cleverness quite unabated,Repeating rhymes they wish they'd pennedOr blindsided by more again!One can see why the critics ratedThis so highly as a masterpiece.(A minor one, of course, to keep the peace.)If you like your tetrameter iams(Pentameter ne'er fails to creep out)And your taste for a Onegin stanza cramsFor satisfaction, check this novel out.It's a peculiar delicacyDelivered with scenic efficacy.I have my reservations, don't you doubt itBut most of what I have to say about itShimmers with a gleaming admirationWhat else will you read soon that compares to it?For those still undecided, I say, \"Do it.\"You may just find this novel's liberationRemains with you while others fare less well -Romeo, Juliet... just go to hell."}]}, "authors": ["Vikram Seth"], "isbn": "0679734570", "longitude": -122.4192363, "periods": ["1900s"], "title": "The Golden Gate", "word_cloud": "verse get high mark classic twice prose verse form surprising first quickly get use decent study young mentality admittedly somewhat difficult get rhythm iambic tetrameter inner voice iambic pentameter obvious interest complete bit whole find enjoyable good great really good maybe directly good sonnet model strange add much story story great opinion incredible sonnet make talent sheer genius excellent reasonable price extremely clever form write story however quite contrive therefore believable wordsmith punster lover satire enjoy literary style ready excuse lot author set write verse get away character flimsy rhyme stretch trite sometimes resort word archaism even thing verse highly impressive nature one philosophical one example fun winkle literary allusion crisp sunny winter day a year ago fair narrative poem start unabashed muse scene wander perhaps perchance day not new new enough say shelf usual mute ferocity of yet unread verbosity would leave bibliophile glowing but end score extra piling creative stricture that shape meander thought i update censorial picture thus buy floor indeed like picture content let glance roll else day rove eye see ancient grudge new mutiny call writ verse in lieu predictable forms indeed quite inverse of novel stand thumbed know subtle ages that bookstores come pass had come narrative deft delivery yes pleasure yet speak word sweet livery as come gentle virtuosity of verse verb curiosity was pique part book to give subtler dense reading took the better part week unhurriedly let word tetrameter hardly been in vogue day thus take essaying sometimes make set shine old in lay foggy bay fair crisp mean against backdrop funnel traffic land steel meet concrete sea snobbishness college brats and artsy twitchy citygoersis focus shrewdly muse help if his fluency tiff is autobiographical or merely case mark observing educated go obduratedlifestyles dark their doubting stumble maze of city character lovable by metric fast produce demises seem first author quaintly introduce each brat turn love for yet quite proud of each respective seem doom tedium of live indeed the nature existential musings feel consequential of author constant need to reassure education has put good condescend to imply raptly savor every twist sinuous bend of refine polish lack characterization is make narration voice command croons the literary swoons on cleverness quite unabated rhyme wish penned or blindside see critic rated this highly masterpiece minor course peace tetrameter aim fail creep taste stanza crams for satisfaction check peculiar delicacy delivered scenic reservation doubt it but say it shimmers gleam else soon compare still undecided say do liberation remains others fare le well go hell", "genres": ["Fiction & Literature"], "summary": "“The great California novel been written, in verse (and why not?): The Golden Gate gives great joy.”—Gore Vidal\r\n\r\nOne of the most highly regarded novels of 1986, Vikram Seth’s story in verse made him a literary household name in both the United States and India.  \r\n\r\nJohn Brown, a successful yuppie living in 1980s San Francisco meets a romantic interest in Liz, after placing a personal ad in the newspaper. From this interaction, John meets a variety of characters, each with their own values and ideas of “self-actualization.\" However, Liz begins to fall in love with John’s best friend, and John realizes his journey of self-discovery has only just begun. \r\n\r\n“A splendid achievement, equally convincing in its exhilaration and its sadness.” The New York Times\r\n", "asin": "B007CKJMRS", "rank": 0, "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/41eSj9pLOML.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}