{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 281, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "Same quality as all other Faulkner novels: complicated, confusing, and unique."}, {"review_sentiment": 4.0, "review_text": "Absalom, Absalom! (the title relates to the return of the central character’s son, Charles; Absalom, according to the Jewish bible, was the third son of King David.  A handsome, high-living man, Absalom killed his older half-brother for the rape of their sister) is set in the early to middle 19th century, mostly in Mississippi.  The central character, Thomas Sutpen, a rough, ungentlemanly fellow, appears in a small Mississippi town with 20 slaves and considerable funds of suspect origin.  He acquires 100 square miles of property 12 miles outside the town, builds an enormous mansion, grows cotton, marries the town shopkeeper’s daughter, and has a son, Henry, and a daughter, Judith.  Sutpen had married the daughter of a Haitian sugar planter, who bore him a son whom he named, Charles Bon.  When Sutpen discovered that his new wife has negro blood, he pays to have the marriage annulled under obscure circumstances.  In his mid-twenties, Charles Bon suddenly appears at the U of Miss. where Henry is attending and the two become friends, though Henry does not learn Charles’ identity until later, when Charles begins to realise who his father is.  Henry and his mother begin to promote the marriage of Judith to Charles.  Sutpen travels to New Orleans (where Charles first appeared) and learns who he is.  On his return, he tells Henry that Charles is his half-brother and the marriage will not be permitted.  Henry refuses to believe that Charles is his brother.  The Civil War intervenes.  Charles decides to break the impasse by marrying Judith, and Henry kills him.  Other deaths follow until there is no mansion and no living heirs to the Sutpen name.This is an intriguing story, deeply coloured with the culture of the Old South.  Falkner’s story-telling technique is quite oblique: he makes use of different narrators to illuminate parts of the story that they know first-hand, have heard from others, or suspect, so that the reader is able to gradually pick up the thread.  This technique creates a sense of mystery, uncertainty and ambiguity about a story which was nearly a century old.  Faulkner’s writing is a poetic, erudite, stream of consciousness by the narrator, particularly when the subject is what a character is thinking or feeling; not infrequently, these dissections of a character’s motives can go on for two pages or more, and they are not easy to read, because they lack fluency and are full of parenthetical statements.  Sentences can go on for half a page.  Nonetheless, a careful reader will, at thinking and feeling levels, understand the character.  There is almost no dialogue in the novel; nearlyh all is revealed by the narrators.  Interestingly, the narrators never set the scenes: what the town, the battlefield, the mansion looked like.The characters are all clearly drawn.  I found it somewhat surprising that all of the female characters were presented as passive.  One gets a clear sense of what life was like in the Old South, particularly before the Civil War, from the point of view of the wealthy few, the middle class and the slaves and poor whites. The slaves themselves had various classes.  As a literally minded person, I found it difficult to accept that Thomas Sutpen could have acquired the wealth he had as the overseer of a Haitian sugar plantation: something is missing.  Similarly, it is doubtful that Sutpen, 20 unskilled slaves and a French architect could have built the huge, elaborate mansion ‘Sutpen’s Hundred’.Absalom,Absalom! is not an easy read, but it should not be overlooked if one is interested in distinctive American writing – particularly about the Old South."}, {"review_sentiment": 5.0, "review_text": "Fine; as promised. Thank you"}, {"review_sentiment": 5.0, "review_text": "Faulkner was a brilliant stylist!"}, {"review_sentiment": 5.0, "review_text": "William Faulkner’s Absalom, Absalom! is a pivotal tome in classic American literature. The rich, complex narrative appears inaccessible to many modern readers, but the stream of consciousness style was the haute couture of the modernist era. Faulkner once again transports the reader to his famed—and fictional—Yoknapatawpha County, Mississippi, though unlike in his other works, he includes a map and a chronology of the events. Absalom, Absalom! is a difficult novel to unpack, but the themes of the tale have a timeless resonance. In what is likely his most famous and best remembered work, Faulkner explores the idea of home, of wanting to belong and have a place, and how that desire oft times is misconstrued with a physical structure. Sutpen’s “design” and blind ambition leads him further and further into moral degradation and ruin, and each character’s own hopes and dreams are influenced by Sutpen’s actions. The ripple effect of misguided ambition is felt through multiple generations. Faulkner tells the same narrative from multiple perspectives. There is no linear sense of plot arc, but rather an accordion folding of time, creating a sense of fluidity and unreliability. The narrators carefully unwind the threads of memory only to have them unravel and snarl once more, for each character’s memory is laden with the complications of fallacies and inaccuracies. Those familiar with Faulkner’s work will know that he features particular characters throughout the course of his oeuvre, and the most poignant figure in this tale may be that of Quentin Compson, a young man who is haunted by the mysterious tragedies of the past and tormented in the present, and whose tale is told further in The Sound and the Fury. In this story, he is a boy on the cusp of adulthood, about to leave his Mississippi home for a Harvard education, and increasingly obsessed with the past. As in all of Faulkner’s tales, the South is as much a character as it is a setting, rich in heritage, distinct and regional, steeped in history, and—much like Faulkner’s stories—grounded in tragedy and family. Issues of race and social structures permeate the tale, but at its heart, Absalom, Absalom! is a story about the tangled web that is family. Dysfunction, incest, betrayal, and murder drive the family tragedies at the center of the story. Faulkner’s work is a stellar example of the modernist era of the early twentieth century. Filled with prose that is in turns dense and poetic, Absalom, Absalom! is a classic ode to the American South, to the complexities and heartbreak of family, to the nostalgic influence of home and memory, and to the deadly whirlpool of ambition.__________Recommendation Highly recommended for fans of classic American literature, particularly literature set in the south and written in the modernist style"}, {"review_sentiment": 5.0, "review_text": "Amazing book with fearless analysis of Southern culture still relevant."}, {"review_sentiment": 5.0, "review_text": "Beautiful"}, {"review_sentiment": 5.0, "review_text": "The story of how Quintin ( The Sound & the Fury ) sees the South.Told from different points of view."}, {"review_sentiment": 1.0, "review_text": "Ordered this ... it came in german. I don't speak German. *rolls eyes*"}, {"review_sentiment": 5.0, "review_text": "Absolutely a great book. Held my interest from start to finish. Couldn't put it down."}]}, "authors": ["William Faulkner"], "isbn": "0679732187", "longitude": 0.0, "periods": ["1900s"], "title": "Absalom, Absalom!", "word_cloud": "quality novel complicate confuse unique title relate return central character son accord jewish bible third son handsome man kill older rape sister set early middle century mostly central character ungentlemanly fellow appear small town slave considerable fund suspect acquire square mile property mile outside town build enormous mansion grow cotton marries town shopkeeper daughter son daughter marry daughter sugar planter son name discover new wife negro blood pay marriage annul obscure circumstance suddenly appear attend become friend learn identity later begin father mother begin promote marriage travel first appear learns return tell marriage permit refuse believe brother intervenes decide break impasse marry kill other death follow mansion live heir intrigue story deeply colored culture technique quite oblique make use different narrator illuminate part story know hear others suspect able gradually pick thread technique create sense mystery uncertainty ambiguity story nearly century old write poetic erudite stream consciousness narrator particularly subject character think feel infrequently dissection character motif go page easy lack fluency full parenthetical statement sentence go half page nonetheless careful think feeling level understand character almost dialogue nearly reveal narrator narrator never set scene town battlefield mansion look character clearly draw find somewhat surprising female character present passive get clear sense life particularly point view wealthy middle class slave poor white slave various class literally mind person find difficult accept overseer haitian sugar plantation something miss similarly doubtful unskilled slave french architect huge elaborate mansion easy overlook interested distinctive american write particularly promise brilliant stylist pivotal tome classic american literature rich complex narrative appear inaccessible many modern reader stream consciousness style hate couture modernist era transport work include map chronology event difficult unpack theme tale timeless resonance likely famous best remembered work explore idea home want belong place desire oft time misconstrued physical structure design blind ambition lead moral degradation ruin character hop dream influence action ripple effect misguide ambition felt multiple generation tell narrative multiple perspective linear sense plot rather accordion folding time create sense fluidity unreliability narrator carefully unwind thread memory unravel snarl character memory laden complication fallacy inaccuracy familiar work know feature particular character course oeuvre poignant figure tale young man haunt mysterious tragedy tormented present tale tell story boy cusp adulthood leave home education increasingly obsess past tales much character set rich heritage distinct regional steep history tragedy family race social structure permeate tale heart story tangle web family incest betrayal murder drive family tragedy center story work stellar example modernist era early twentieth century fill prose turn dense poetic classic ode american complexity heartbreak family nostalgic influence home memory deadly whirlpool recommend fan classic american literature particularly literature set south write modernist style fearless analysis southern culture still relevant beautiful story see different point view order come german speak german absolutely great interest start finish put", "genres": ["Fiction & Literature"], "summary": "“Read, read, read. Read everything—trash, classics, good and bad, and see how they do it. Just like a carpenter who works as an apprentice and studies the master. Read! You’ll absorb it. Then write. If it is good, you’ll find out. If it’s not, throw it out the window.” William Faulkner\r\n\r\nAbsalom, Absalom! is Faulkner’s epic tale of Thomas Sutpen, an enigmatic stranger who comes to Jefferson, Mississippi, in the early 1830s to wrest his mansion out of the muddy bottoms of the north Mississippi wilderness. He was a man, Faulkner said, “who wanted sons and the sons destroyed him.”\r\n\r\nSet in the fictional town of Yoknapatawpha County.\r\n\r\n&nbsp;", "asin": "0679732187", "rank": "29621", "city": "Lafayette County", "image": "https://images-na.ssl-images-amazon.com/images/I/51EEbRvhCFL.jpg", "country": "MS", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}