{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 22, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Wonderful story full of frontier details showcasing the first woman who settled in the remote Miramichi area of New Brunswick, Canada. The snowstorm scene alone will give you chills. Charlotte Taylor survived many hardships, raised numerous children, and demanded her rights along with the men. A brave woman."}, {"review_sentiment": 5.0, "review_text": "I didn't want to miss a word of this historical novel, especially since it was based on a real person. Author Sally Armstrong's ancestor, Charlotte Taylor, had to have  the stealth of a cat to live the nine lives that she was given. Charlotte was a pre-Loyalist pioneer in New Brunswick, formerly part of Nova Scotia. Each adversity Charlotte overcame made her stronger. It was a hard life but she worked and fought for her large family her whole life. What vivid insight into the daily management of a pioneering woman."}, {"review_sentiment": 5.0, "review_text": "I found this book to be fascinating. I read it shortly before a trip to New Brunswick, and specifically an area of he province where the book is set. This helped set the scene for my trip. It is historical fiction, but seems to be well researched. Charlotte Taylor was the first white female settler in New Brunswick, so it's based on an actual person. Sally Armstrong worked with archival material about Taylor (a distant relative) to bring the story to life. Taylor had a difficult, but rewarding life, with plenty of adventures. I was quite pleased with the book."}, {"review_sentiment": 5.0, "review_text": "good book,"}, {"review_sentiment": 5.0, "review_text": "I'm biased. Charlotte is my 5th Great-Grandmother, and the book, while fictionalized, is a good mirror of life in early Nova Scotia/New Brunswick, and represents how Charlotte likely lived her life. It was a good read and made me wish there was more. Its not often one gets to meet their ancestors and see their life style as I did. If it was not related to me, I would have still found the book interesting."}, {"review_sentiment": 4.0, "review_text": "Very good story of an independent, strong woman who defied society's expectations.  The story was engaging and didn't slow down.  Charlotte Taylor definitely lived a busy, interesting life.  The story is a fictionalized biography of the author's great-great grandmother."}, {"review_sentiment": 4.0, "review_text": "This is a good story, a fictionalized account of a real woman. I hesitated reading it, because she is my 5th great grandmother,and i didn't want to confuse myself with fact from fiction, however i'm glad i read it. I recommend it.  Dave"}, {"review_sentiment": 5.0, "review_text": "Most amazing story of a very strong woman.  Found where her family was buried in St Martins , New Brunswick, CACan't imagine having to do the things she did."}, {"review_sentiment": 5.0, "review_text": "Great story about a woman of history!  (We have too many of men.).  Such perseverance amid great hardships.  I loved the book.  Sally Armstrong has again proven what a good writer she is."}, {"review_sentiment": 4.0, "review_text": "Enjoyed reading the story of this pioneer woman albeit imagined for the most part. I am also researching my New Brunswick roots so it gave some idea of what people must have gone through."}]}, "authors": ["Sally Armstrong"], "isbn": "0679314059", "longitude": 0.0, "periods": ["1700s"], "title": "The Nine Lives of Charlotte Taylor", "word_cloud": "wonderful story full frontier detail showcasing first woman settle remote area snowstorm scene alone give chill survive many hardship raise numerous child demand right men brave woman want miss word historical especially base real person ancestor stealth cat live give pioneer formerly part adversity overcame make stronger hard life work fought large family whole life vivid insight daily management pioneer woman find fascinate shortly trip specifically area province set help scene trip historical fiction seem well research first white female settler base actual person work archival material distant relative bring story life difficult reward life plenty adventure quite please good bias fictionalize good mirror life early represent likely live life good make wish often get meet ancestor see life style relate still interest very good story independent strong woman defy society expectation story engage slow definitely live busy interesting life story fictionalize biography author grandmother good story fictionalize account real woman hesitate read great grandmother want confuse fact fiction however glad recommend most amazing story strong woman find family bury imagine thing story woman history many such perseverance great hardship love sally proven good writer read story pioneer woman albeit imagine part also research root give idea people go", "genres": ["Fiction & Literature", "Historical Fiction", "Action & Adventure"], "summary": "Charlotte Taylor lived in the front row of history. In 1775, at the young age of twenty, she fled her English country house and boarded a ship to Jamaica with her lover, the family’s black butler. Soon after reaching shore, Charlotte’s lover died of yellow fever, leaving her alone and pregnant in Jamaica. \r\n\r\nIn the sixty-six years that followed, she would find refuge with the Mi’kmaq of what is present-day New Brunswick, have three husbands, nine more children and a lifelong relationship with an aboriginal man. Using a seamless blend of fact and fiction, Charlotte Taylor's great-great-great-granddaughter, Sally Armstrong, reclaims the life of a dauntless and unusual woman and delivers living history with all the drama and sweep of a novel.\r\n\r\n“Sally Armstrong has done a brilliant job bringing her ancestor vividly to life in a compelling recreation of a settler’s life. . . . The list of well-written historical novels set in Canada are short, but The Nine Lives of Charlotte Taylor should be close to the top.” The Globe and Mail", "asin": "0679314059", "rank": "1479981", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/51XYjOZFpPL.jpg", "country": "New Brunswick", "story_arc": ["Tragedy", "Things only get worse"]}