{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 299, "rating": 3.0, "reviews": [{"review_sentiment": 3.0, "review_text": "This was an interesting novel that took some odd twists and turns at points. I do enjoy Mr. Carr`s writing style and story telling. This was not my favorite of his books, but it was still a very unique, original story. It is set in a grim future where a group of technologically advanced geniuses is going about preforming mischief. They are a little like half-assed super villains (that makes the book sound more amusing than it is). The main character, Gideon, really doesn`t seem to fit in with this group. I never fully understood why he was recruited other than he was apparently a good looking psychologist with skeptical view of American history. Like I said, it was an interesting book and if you like Mr. Carr`s writing style, you may like this. If you are looking for another Alienist, this is not it."}, {"review_sentiment": 5.0, "review_text": "Great read.  Love Caleb Carr."}, {"review_sentiment": 2.0, "review_text": "Doesn't measure up with his other books."}, {"review_sentiment": 1.0, "review_text": "Such a disappointing premise from an author who wrote such great earlier novels."}, {"review_sentiment": 5.0, "review_text": "great job"}, {"review_sentiment": 4.0, "review_text": "This dystopian sci-fi novel of the near future suffers a bit as time itself has moved on since it was written. But the liveliness of the first-person writing and the ingenious devices that take our hero on his journey to the unknown keeps the reader riveted. There is a feeling of Jules Verne's 20,000 Leagues Under the Sea in this story of an everyman who is swept up into a fight between super science and the forces of evil. Read it. Enjoy it. And don't ask too many  questions."}, {"review_sentiment": 5.0, "review_text": "Outstanding twists and turns and mysterious happenings.  A bit dark, but very compelling - the \"you can't put it down\" that keeps you up all hours of the night."}, {"review_sentiment": 5.0, "review_text": "On of my three favorite books by Mr. Carr and on a personal favorite top twenty of all time for me."}, {"review_sentiment": 2.0, "review_text": "Stranded on ship with nothing to read. Did not like this one."}, {"review_sentiment": 5.0, "review_text": "Arrived fine in excellent condition. Thanks!"}]}, "authors": ["Caleb Carr"], "isbn": "0679463321", "longitude": 0.0, "periods": ["2000s"], "title": "Killing Time", "word_cloud": "interesting take odd twist turn point enjoy write style story tell favorite still unique original story set grim future group technologically advanced genius go preform mischief little super villain make sound amuse main character really seem fit group never fully understood recruit apparently good look psychologist skeptical view american history say interest write style look alienist doe measure such disappointing premise author write great earlier novel great job dystonia future suffers bite move write liveliness write ingenious device take hero journey unknown keep rivet feel story every man sweep fight super science force evil many question outstanding twist turn mysterious happening bit dark compelling keep hour night favorite personal favorite top twenty strand ship nothing fine excellent condition thanks", "genres": ["Fiction & Literature", "Mystery & Suspense", "Science Fiction"], "summary": "Meet Dr. Gideon Wolfe, expert criminologist of the new millenium. A professor at New York's John Jay University in the year 2023, he lives in an era that has seen plague, a global economic crash, and the 2018 assassination of President Emily Forrester. In this turbulent new world order, Wolfe's life and everything he knows are turned upside down when the widow of a murdered special-effects wizard enters his office.\r\n\r\nThe widow hands him a silver disc from her husband's safety deposit box, hoping that Wolfe's expertise in history and criminology will compel him to track down her husband's killers. The disc contains footage of President Forrester's assassination, the same video that has been broadcast countless times on TV and over the internet-with one crucial, shocking difference: This version shows that before the video was released, it was altered with sinister special effects.\r\n\r\nThis explosive discovery will lead Gideon Wolfe on an electrifying journey from a criminal underworld of New York to the jungles of Africa and on a quest to find the truth in an age when all information can be manipulated. With this novel, Carr has boldly established a new genre-future history-combining the best elements of mystery and thrillers with unique historical insight. Breathtakingly suspenseful,Killing Time unfolds as the work of a master novelist.", "asin": "0679463321", "rank": "384523", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/5158BAH8PGL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}