{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 143, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "This book is more like a travel guide so less interesting than his other book about living in the provence."}, {"review_sentiment": 5.0, "review_text": "Great way to spend the afternoon. Inforce the dream of living in Provence and living the good life."}, {"review_sentiment": 3.0, "review_text": "A poor follow-up to the original.  It smacked of 'oh, here are some left-overs that didn't make the cut for the initial book'!!"}, {"review_sentiment": 4.0, "review_text": "Wouldn't you love to inherit a vineyard in the Rhone Valley of France? especially if you had just lost your regular job in London? A dream come true for readers who love vacations in France."}, {"review_sentiment": 5.0, "review_text": "Always a good read"}, {"review_sentiment": 5.0, "review_text": "Still as funny today as when I read it years ago."}, {"review_sentiment": 5.0, "review_text": "Fun to read the recipes and the stories about the area"}, {"review_sentiment": 5.0, "review_text": "excellent"}, {"review_sentiment": 3.0, "review_text": "I absolutely loved French Lessons on cd - Simon Jones read it and it's my favorite book on cd of all.  Encore Provence is read by David Case, and his voice and maybe the story too, just isn't as fun, funny or fascinating.  Probably if Simon Jones read it..."}, {"review_sentiment": 5.0, "review_text": "When a book starts out with someone power washing their underwear you know you are going to be laughing out loud. This is the third book of Mr. Mayles' time in France. I read all three in quick succession. He is very witty with just the right amount of descriptions to make you feel like you are there."}]}, "authors": ["Peter Mayle"], "isbn": "0679762698", "longitude": 0.0, "periods": ["1900s"], "title": "Encore Provence: New Adventures in the South of France", "word_cloud": "like travel guide le interesting living provence way spend afternoon dream live living good life poor original smack cut initial inherit especially lose regular job dream come true reader love vacation always good still funny today year ago recipes story area excellent absolutely love french cd favorite cd voice maybe story fun funny fascinating start someone power wash underwear know go laugh loud third time quick succession witty right amount description make feel", "genres": ["Fiction & Literature", "Travel Writing"], "summary": "In his most delightful foray into the wonders of Provençal life, Peter Mayle returns to France and puts behind him cholesterol worries, shopping by phone, California wines, and other concerns that plagued him after too much time away.\r\n\r\nIn Encore Provence, Mayle gives us a glimpse into the secrets of the truffle trade, a parfumerie lesson on the delicacies of scent, an exploration of the genetic effects of 2,000 years of foie gras, and a small-town murder mystery that reads like the best fiction. Here, too, are Mayle's latest tips on where to find the best honey, cheese, or chambre d'hìte the region has to offer. \r\n\r\nLyric, insightful, sparkling with detail, Encore Provence brings us a land where the smell of thyme in the fields or the glory of a leisurely lunch is no less than inspiring.", "asin": "0679762698", "rank": "163691", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/51qMMEw-CfL.jpg", "country": "FR", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}