{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 397, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Another great book from Nora Roberts.  Never disappointed."}, {"review_sentiment": 1.0, "review_text": "I am huge fan of this author but I didn't care for this book. The bond I usually get with Nora's characters wasn't there. This was slow and boring in comparison to her other novels."}, {"review_sentiment": 5.0, "review_text": "My all-time favorite author never disappoints. Suspense up until the end along with heartwarming, fairytale type love stories. She's amazing"}, {"review_sentiment": 4.0, "review_text": "read before but still good."}, {"review_sentiment": 2.0, "review_text": "I'm a Nora Roberts fan for those times when I just want some escapism. This book was suspenseful and entertaining, but I feel like the author was doing the typical murder mystery/suspense/romance thing and hadn't really found her groove yet when this was written.  The relationships were a little too non-consensual at first, the women were strong but not the well-rounded characters she writes now., and she only did that three-phrase thing in conversations that I consider her hallmark in one place that I noticed. Fun to read and see how much she's evolved since this was written though."}, {"review_sentiment": 5.0, "review_text": "One of her bests!  Intriguing, many twists and terns.  I was captivated through the whole book!"}, {"review_sentiment": 5.0, "review_text": "Another great read by Nora Roberts"}, {"review_sentiment": 5.0, "review_text": "Was a great story!"}, {"review_sentiment": 5.0, "review_text": "Another great one. Dated but timeless."}, {"review_sentiment": 4.0, "review_text": "Good read .... Bit too much like Search"}]}, "authors": ["William Faulkner"], "isbn": "0679748148", "longitude": 0.0, "periods": ["1900s"], "title": "Sanctuary", "word_cloud": "great disappoint huge fan author care bond usually get nora character slow boring comparison novel favorite author never disappoint suspense end heartwarming fairy tale type love story amaze still good fan time want escapism suspenseful entertaining feel author typical murder thing really find groove yet write relationship little first woman strong character write thing conversation consider hallmark place notice much evolve write best many twist terns captivate whole great great story great timeless good much search", "genres": ["Fiction & Literature"], "summary": "A powerful novel examining the nature of evil, informed by the works of T. S. Eliot and Freud, mythology, local lore, and hardboiled detective fiction. Sanctuary is the dark, at times brutal, story of the kidnapping of Mississippi debutante Temple Drake, who introduces her own form of venality into the Memphis underworld where she is being held.\r\n\r\nSet in the fictional town of Yoknapatawpha County (based on Lafayette County, Mississippi).", "asin": "0679748148", "rank": "100581", "city": "Lafayette County", "image": "https://images-na.ssl-images-amazon.com/images/I/41-vWmoxpNL.jpg", "country": "MS", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}