{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 82, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "Pretty weird.  Best part was when the dildo smashed the glass out of the hotel room window and ran away into the lake after a lotta graphic sex-depicting.  Too many long, uninteresting passages but I read 'em anyway because Leonard Cohen is Leonard Cohen.  And he just died."}, {"review_sentiment": 5.0, "review_text": "Love everything he does."}, {"review_sentiment": 5.0, "review_text": "He wanted it darker..."}, {"review_sentiment": 5.0, "review_text": "Reader beware! You have probably never read anything like this (even if you have). For the self-aware, it will delight you as it enlightens you. For the yet obtuse, steer clear of the horrific accounts of mundane and base humanity. It's one of the best books ever written and should be burned in the south, praised in the west, and yawned over in the east. God bless this man by giving him the life He did and letting us reap in his few words."}, {"review_sentiment": 4.0, "review_text": "Probably one of the wieirdest books I've read in a long time, but Leonard being who he is.......!"}, {"review_sentiment": 5.0, "review_text": "Always delightful"}, {"review_sentiment": 1.0, "review_text": "terrible couldnt read it sick sex scene constantlyHorrible book! a waste of money for unread crap."}, {"review_sentiment": 5.0, "review_text": "The book arrived in good shape."}, {"review_sentiment": 3.0, "review_text": "Wasn't what I expected, but wasn't a bad book either."}, {"review_sentiment": 5.0, "review_text": "Excellent"}]}, "authors": ["Leonard Cohen"], "isbn": "0679748253", "longitude": -73.6103642, "periods": ["1900s"], "title": "Beautiful Losers", "word_cloud": "weird part dildo smash glass hotel room window run away lake lotto graphic many long uninteresting passage anyway die everything want darker beware probably never anything even delight enlightens yet obtuse steer clear horrific account mundane base humanity best ever write burn south praised west yawn east bless man give life let reap word probably weirdest long time always delightful terrible couldn't sick sex scene constantly horrible waste money unread crap arrived good shape expect bad excellent", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "One of the best-known experimental novels of the 1960s, Beautiful Losers is Leonard Cohen’ s most defiant and uninhibited work. As imagined by Cohen, hell is an apartment in Montreal, where a bereaved and lust-tormented narrator reconstructs his relations with the dead. In that hell two men and a woman twine impossibly and betray one another again and again. Memory blurs into blasphemous sexual fantasy--and redemption takes the form of an Iroquois saint and virgin who has been dead for 300 years but still has the power to save even the most degraded of her suitors. \r\n\r\nFirst published in 1966, Beautiful Losers demonstrates that its author is not only a superb songwriter but also a novelist of visionary power. Funny, harrowing, and fiercely moving, it is a classic erotic tragedy, incandescent in its prose and exhilarating for its risky union of sexuality and faith.\r\n\r\n\"Gorgeously written. . . . One comes out of it having seen terrible and beautiful visions.\" The New York Times", "asin": "0679748253", "rank": "71917", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/41YkRFEL9KL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}