{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 190, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Perfect"}, {"review_sentiment": 5.0, "review_text": "it is a great book. ought to read"}, {"review_sentiment": 2.0, "review_text": "I'd a Camus fan, but found The Fall heavy-handed, self-indulgent, poorly executed (or maybe the translation is poor), and just plain boring.  Also it's too abstruse and convoluted.  I prefer writers who speak plainly with economy."}, {"review_sentiment": 5.0, "review_text": "Great item! Will shop again."}, {"review_sentiment": 2.0, "review_text": "Loved The Stranger but I really did not like this one. A rambling philosophy essay that has tendrils of a story intermixed into it."}, {"review_sentiment": 4.0, "review_text": "Excellent read, beautiful prose but it's also pretty dense. As short as it is, it still takes some time to get through because it's tough to absorb more than 20-30 pages at a time. Some brilliant quotes though. \"The lowest man in the social scale still has his wife or his child. If he’s unmarried, a dog. The essential thing, after all, is being able to get angry with someone who has no right to talk back.\" I personally enjoyed Camus' novels better such as \"The Stranger\" and \"The Plague.\""}, {"review_sentiment": 5.0, "review_text": "gift for my son"}, {"review_sentiment": 5.0, "review_text": "this may be my favorite book a tale that moves beyond literature to the philosophy that has corrupted society and it is  told in a most unusual way leaving the evil we don't understand to be understood and the blessings we might all I have  if the lessons of this profound tale were  Learned"}, {"review_sentiment": 5.0, "review_text": "These comments are based on the reading of an original Vantage 1957 paperback from a used bookstore. The reader was immediately reminded of a lunch meeting at a university level between a talkative student of the humanities and a quieter listener of the sciences. At one point, the humanities fellow complains that a casual examination of his hand gives no hint of the underlying complex of biology, physics and chemistry. Therefore, the empirical and theoretical viewpoints come into conflict. \"Camus,\" the empiricist demands,  \"Takes the point of view that men are responsible for their decisions!\" \"Well,\" suggests the theorist, \"Science has shown that decisions are made a few milliseconds before one is consciously aware of them. Hawking suggests that free will is attributed to humans because the process of decision making is too complex to be sequentially followed.\" This matter is the crux of the position that Camus takes. Any verbal exchange beyond this point is rendered meaningless. \"The Fall,\" is essentially \"art\" : a statement of one man's view of reality which collapses on empirical testing. Therefore, treat this volume as an entertaining exchange between two casual friends rather than a far reaching depiction of an injunction against mankind in general."}, {"review_sentiment": 5.0, "review_text": "Love this book. If your a fan  of existentialism era, then this is for you. Campus did a fantastic job writing this and can easily see why he won the Nobel prize in literature for this book. Has you question everything in life."}]}, "authors": ["Albert Camus"], "isbn": "0679720227", "longitude": 2.3514992, "periods": null, "title": "The Fall", "word_cloud": "perfect great fan find poorly execute maybe translation poor plain boring also abstruse convolute prefer writer speak plainly economy item shop love really rambling philosophy essay tendril story intermixed excellent beautiful prose also pretty dense short still take time tough absorb page time brilliant quote lowest man social scale still wife child unmarried dog essential thing able get angry someone right talk back personally enjoy novel better gift son tale move literature philosophy corrupt society tell unusual way leave evil understand understood blessing lesson profound tale learn comment base read original paperback use immediately remind lunch meeting university level talkative student humanity quieter listener science point humanity fellow complains casual examination hand give hint underlie complex biology physic chemistry therefore empirical theoretical viewpoint come conflict empiricist demand point view men responsible decision well suggest theorist show decision make millisecond consciously aware hawk suggests free attribute human process decision making complex sequentially follow matter crux position take verbal exchange point render essentially art statement man view reality collapse empirical test therefore treat volume entertain exchange casual friend rather far reach depiction injunction general fan existentialism era fantastic job write easily literature question everything life", "genres": ["Fiction & Literature"], "summary": "The Fall (French: La Chute) is a philosophical novel by Albert Camus. First published in 1956, it is his last complete work of fiction.\r\n\r\nSet in Amsterdam, The Fall consists of a series of dramatic monologues by the self-proclaimed \"judge-penitent\" Jean-Baptiste Clamence, as he reflects upon his life to a stranger. In what amounts to a confession, Clamence tells of his success as a wealthy Parisian defense lawyer who was highly respected by his colleagues; his crisis, and his ultimate \"fall\" from grace, was meant to invoke, in secular terms, The Fall of Man in the Garden of Eden.\r\n\r\nThe Fall explores themes of innocence, imprisonment, non-existence, and truth. In a eulogy to Albert Camus, existentialist philosopher Jean-Paul Sartre described the novel as \"perhaps the most beautiful and the least understood\" of Camus' books.\r\n\r\nWikipedia", "asin": "0679720227", "rank": "49715", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41tRcpBhbnL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}