{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 11, "rating": 3.0, "reviews": [{"review_sentiment": 2.0, "review_text": "I found The Tax Inspector very difficult to follow. Every character had their own complexities and did not get on with any other character in the book. I found the disfunctionality of all the people in the book unbelievable. This is the first Peter Carey bok I have read and was extremely disappointed"}, {"review_sentiment": 4.0, "review_text": "Interesting characters and a great story.  It is well written and gives the reader insight into the workings of Australian civil servants, but ends sort of abru"}, {"review_sentiment": 3.0, "review_text": "I made it to page 105 of the Faber & Faber edition of THE TAX INSPECTOR - a little over one-third of the way through the novel.  By that point I could tell that Peter Carey is a flashy and probably talented writer, but that his subject in this novel - the three-generation Catchprice family - was highly dysfunctional and that some sort of cataclysm(s) probably were in the offing.  But at page 105, I read a sentence that Amazon would not permit me to quote the first time I tried posting this review, so this time I will substitute \"toe\" for what surely was the offensive word:  \"She stood at the door of her bedroom one Saturday afternoon and saw her husband sucking her younger son's [toe].\"  I didn't read further.  Call me a prude if you wish, but I have better uses for my limited reading time, especially when the novel held little promise of being great.Before quitting on it, my provisional \"Amazon assessment\" was in the range of three or four stars.  I have settled for the lower mark."}, {"review_sentiment": 4.0, "review_text": "This story has many of the features that seem to be characteristic of Carey's novels:* gothic family drama played out by quirky, larger-than-life characters, who are nonetheless oddly likable* dark simmering family secrets* sporadic alcohol- or rage-fueled acts of extreme violence* at least one character (generally male) who is off-the-chart crazy* a wildly original plot, whose plausibility doesn't really hold up under careful scrutiny, but which is made palatable by* the author's natural gift for storytelling (excellent pacing and tight construction) and* writing that is polished and highly readableThere are worse formulas, and so far I've not read anything by Carey that's been a complete dud. \"The Tax Inspector\" falls in the middle of the pack - an enjoyable read, but not his best, in my opinion. Aspects that I thought didn't work all that well included:MINOR SPOILER ALERT (though if you haven't figured out by page 20 that this story is going to end with a bang, you're not paying attention)# Things were just a little too gothic - the rampant dysfunction within the Catchprice family, ranging from the gelignite-toting grandma to the psychopathic 16-year old, Benny, (whose initial meltdown precipitates the havoc that unfolds as the story progresses), is just a little too over the top to carry much of an emotional charge# the particular deep dark family secret that featured in this story  just seems overworked by writers in recent years, almost as if it were de rigeur for a memoir/family story to be considered \"serious\"# Almost the first thing we're told about Granny Catchprice is that she carries a stick of gelignite in her handbag at all times. Which means, by a simple application of Chekhov's law of the loaded gun, that we know how things will turn out. So where was the suspense?# The whole Sarkis story arc seemed entirely tangential and added little to the overall developmentThese criticisms are actually less serious than they might seem. Because, as in his other books, Carey's gift for telling a good yarn, his ability to pull the reader into the eccentric milieu of his characters and make us care about those characters (even the weird ones) more than compensate for minor structural weaknesses. So that this was a very enjoyable read. 3.5 stars, rounded up to 4, because Carey's writing is always thought-provoking, never boring."}, {"review_sentiment": 1.0, "review_text": "\"The Tax Inspector\" is not a pleasant read. It's a story about a family damaged by incest making its final descent into hell, and it's also about a very pregnant woman who stumbles into this mess at the worst possible time.I don't mind the subject matter being dark and all, but spending time with so many ugly characters in such an ugly setting - a run-down car dealership/garage - for over 300 pages is just painful and unrewarding. The \"explosive\" ending is a joke."}, {"review_sentiment": 2.0, "review_text": "Having just finished \"Theft\" and having read a number of Carey's other novels, this one was a disappointment. Much of this may have to do with the fact that this was written early in his career, a time where writers presumably work on finding their voice. I think my overly critical view of the novel may have to do with my respect for his much later work, but this novel, an account of a few pivotal days in the lives of the Catchprices, a dysfunctional family that owns a car dealership, although interesting, is flawed in so many ways. The novel reminded me of Zadie Smith's 'On Beauty,' but without the feeling of truly knowing and understanding the characters and what drives them.Two central figuresdrive this novel - Benny, a 16 year old who wants to reinvent himself, and Maria, the character who the book's title refers to. What ensues is three days that change the lives of all of the people in this family. Maria is asked to come and audit the family's books, much to her chagrin, and soon finds herself caught up in the family's drama.Carey's prose is tight and each sentence's smooth, almost lilting flow, most certainly foreshadows Carey's future success. Unfortunately, with so many characters to juggle, the story never fully comes together. Carey seems to want to include every character he can think of as well as their motivations, but instead gives us only bits and pieces of everyone, providing a somewhat disjointed narrative. At one point, I couldn't even tell all the family members apart. The only thing that ends up differentiating them is their gender and the one crazy identifying feature - one is a Hare Krishna, another is a wannabee country star, etc. Their voices blend into each other to the point where I could have been reading about anyone in the novel.If you are a Carey fan, this book is important in terms of seeing the writer grow. If not, stick to his more recent novels, as you will be far more entertained by them."}, {"review_sentiment": 5.0, "review_text": "Carey's novels are so dark. I'm seduced by the prose and the situations but always find myself achingly wondering how I can bear to read more about the horrible histories of the characters and the tragic relationships between them. Mostly the characters start off seemingly likeable but the more I read the less I can identify with them.The Tax Collector is another brilliant Peter Carey book, thankfully with a glimpse of hope in the mostly appalling ending. I'm glad there are still some more Carey novels left that I haven't read!"}, {"review_sentiment": 4.0, "review_text": "The Tax Inspector maybe about the Catchprizes, a family entangled in its own guilt, sick games, and confusing emotion. It may also be about Maria, who gets into the Catchprize's path of destruction just by trying to perform a pointless auditing of their financial books (we learn from the first pages they are practically broke). But I could say the book is more about the emotional handicaped. No single character leaves this mess standing-up. Not even marginal characters like Maria's friend, lover and coworkers. Not even the reader. This is no book to put down as entertainment. Carey writes like a virtuous, his use of language to convey past and present into a downsiding spiral of distress is memorable. You will find yourself deep into Catchprize motors, you'll smell the oil stains, the decay and the hopelesness."}, {"review_sentiment": 5.0, "review_text": "This is the second Peter Carey book I've read, Oscar and Lucinda being the first.  It took me a year to get over Oscar et al., before I could pick up The Tax Inspector.  What a ride!  Now another year has passed and I'm ready to see what Mr. Carey is going to do to me this time. I could read three \"Hannibal\" books in a row, but I can't do that with Carey books.  There's an intensity that goes beyond my ability to describe it."}, {"review_sentiment": 5.0, "review_text": "Another totally unpredictable masterpiece by Peter Carey. Poor Maria, young, intelligent, beautiful, and gifted so far in her life with financial/career success, is thrust into juxtaposition with the Catchprice  family when she is assigned to audit Catchprice Motors. The Catchprices  seem to epitomize the modern dysfunctional family, a wild blend of  discordant characters commonly saddled with guilt and impossible dreams.  Against the Catchprice backdrop, Maria shines like a diamond.  Unfortunately, the Catchprices are charmed by Maria, too, and their  attempts to bring her into their world are varied and unforgettable.Far  busier and more entangled than Bliss, less uplifting than either Bliss or  Jack Maggs, this is not a book for the faint of heart, or those prone to  depression!  But there is still a thread of hope throughout this tale,  winding through seamy strands of dishonesty and craziness."}]}, "authors": ["Peter Carey"], "isbn": "0679404341", "longitude": 151.2164539, "periods": ["1900s"], "title": "The Tax Inspector", "word_cloud": "find difficult follow character complexity get character find dis functionality people unbelievable first bk extremely disappoint interest character great story well write give insight working australian civil servant end sort abrupt make page edition little way point flashy probably talented writer subject family highly dysfunctional sort cataclysm probably off page sentence first time try post review time substitute toe surely offensive word stand door bedroom afternoon saw husband suck younger son toe call prude wish better us limited reading time especially hold little promise quit provisional assessment range star settle lower mark story many feature seem characteristic novel gothic family drama play quirky character nonetheless oddly dark simmer family sporadic act extreme least character generally male wildly original plot plausibility really careful scrutiny make palatable author natural gift storytelling excellent pace tight construction write polish highly readable there worse formula far anything complete dud fall middle pack enjoyable best opinion aspect think work well include figured page story go end bang pay attention little gothic rampant dysfunction family range grandma psychopathic old initial meltdown precipitate havoc unfolds story progress little top carry much emotional charge particular deep dark family secret feature story seem overworked writer recent year almost story consider serious first thing tell carry stick gelignite handbag time mean simple application law load gun know thing turn so suspense whole story arc seem entirely tangential add little overall development these criticism actually le serious gift tell good yarn ability pull eccentric milieu character make care character even weird one minor structural weakness so enjoyable star round write always never bore pleasant story family damage incest make final descent hell also pregnant woman stumble mess worst possible mind subject matter dark spending time many ugly character ugly set car page painful unrewarding explosive end joke have finish number novels disappointment much fact write early career time writer presumably work find voice think overly critical view much later work account pivotal day live dysfunctional family own car dealership interest flaw many way reminded feel truly know understand character drive central figures drive year old want reinvent character title refers ensue day change live people family ask come audit family much chagrin soon find caught family tight sentence smooth almost lilt flow certainly foreshadow future success unfortunately many character juggle story never fully come together seem want include character think well motivation instead give bit piece everyone provide somewhat disjointed narrative point even family member apart thing end differentiate crazy identify feature wannabee country star etc voice blend point read anyone fan important term see writer stick recent novel far entertain novel dark seduce prose situation always find achingly wonder bear horrible history character tragic relationship mostly character start seemingly likable less identify brilliant thankfully glimpse hope mostly appal end glad still novel leave maybe family entangle guilt sick game confuse emotion also get path destruction try perform pointless audit financial learn first page practically break emotional handicap single character leave mess not even marginal character friend lover coworkers not even put entertainment write virtuous use language convey past present downsize spiral distress memorable find deep motor smell oil stain decay hopelessness second first take year get et ride now year pass ready see go time row intensity go ability describe totally unpredictable masterpiece young intelligent beautiful gift far life success thrust juxtaposition family assign audit seem modern dysfunctional family wild blend discordant character commonly saddle guilt impossible dream backdrop shine diamond charm attempt bring world vary busier entangle le uplifting bliss faint heart prone depression still thread hope tale wind seamy strand dishonesty craziness", "genres": ["Fiction & Literature"], "summary": "From Granny Catchprice, who runs her family business--and her family--with senility, cunning, and a handbag full of explosives to sixteen-year-old Benny, who dreams of transforming a failing automobile franchise into an empire--and himself into an angel--the Catchprices may be the most spectacularly contentious family since Dostoevsky's Karamozovs.\r\n\r\nBut when a beautiful and very pregnant agent of the Australian Taxation Office enters their lives, the resulting collision becomes, in Carey's hands, masterpiece of coal-black humour and compassionate horror.", "asin": "0679404341", "rank": "5216180", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/41rA-9MCK0L.jpg", "country": "Australia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}