{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 31, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "While I love all my previous VN books, I did not particularly enjoy The Gift. I liked the initial chapter very much, with Yasha the ghost boy and his grieving parents, the prescribed order of businesses in Berlin, Fedor's room, and the piano tied down in the moving van, i found the remainder of the book tedious and not very engaging.  Perhaps if I were knowledgeable about Pushkin, etc, as well as Russian political history of the time period in question,  the book would have had more meaning for me. Well written, yes, but that was not enough in this case."}, {"review_sentiment": 3.0, "review_text": "To RE-READ-- So, we chose this for book club and I found this book fascinating-- tore through at lightening speed until I hit the interminable, tearing-my-hair-out, dreadful 4th chapter. I kept at it thankfully (despite members of our book club dropping like flies), realizing that Nabokov was using a device [MILD SPOILER]--- of making this a chapter of the book that the main character was writing (sort of \"If on a winter's night a traveler\" of him). Predictably the 5th and final chapter was much more enjoyable. I actually laughed out loud when I realized the 5th chapter was full of criticisms of the author's \"work\"---still, I feel I would be better served reading this later, after a healthy diet of Pushkin, Gogol, et. al. I couldn't help but feel there were huge literary jokes that I was missing, or that I would sort of \"recognize\" but then miss the punchline. Nabokov's versatility and fluidity between styles is really very cool in this work-- I saw nothing of the author of Lolita until the 5th (and my favorite) chapter. I actually almost felt the 5th could exist as a short on its own. The rest of the book I found a bit high-brow or inaccessible for the average reader, without either a good amount of homework or a hearty appreciation specifically for Russian Lit.HOWEVER, that is not to say that the language isn't incredibly seductive and rich. It really is full of tasty descriptions and imagery. This part at least, can be enjoyed by anyone who loves a good book.Interesting to note that this is the last that he wrote in his own language, and that he helped quite a bit with the English translation. Still, I wish I could read it in Russian, as I'm sure with a subject like this it can only truly be appreciated fully in the original (what with all the discussions of metre and rhythm of language, etc.)"}, {"review_sentiment": 5.0, "review_text": "Good book to ready if you are really intellectual"}, {"review_sentiment": 3.0, "review_text": "Nabokov was a brilliant writer, but this book is tedious."}, {"review_sentiment": 5.0, "review_text": "Great item and good service. This book is such a masterful example of deconstruction and postmodern art literature."}, {"review_sentiment": 5.0, "review_text": "We all have to choose (or have it selected for us). Nabokov chose the latter, and The Gift is a celebration of that choice with a diatribe against the opposite camp thrown in. For the casual reader, the diatribe can be perplexing, if not taxing. For the Nabokovian, the diatribe is part and parcel of being a Nabokovian: It’s all good—with a grain of salt, i.e. if you accept the idea that whether a thought expressed is true or not is immaterial, and that what matters is that it’s a thought, something with a soul of its own, as opposed to being an act of ventriloquism.The book looks backward while surging ahead forward, and it’s not an easy transition. How could it be when so much of who Fyodor Godunov-Cherdyntsev is, is tied to his Russian past which he must now shed and discard forever on account of the Bolsheviks. According to historical accounts, Nabokov’s father died a nobleman’s death: He took a bullet to save a friend. The fictional account of Fyodor’s father’s death is no less romantic. Indeed, I would think that Nabokov’s father would have chosen to die as his son had depicted the death of Fyodor’s father if such a thing were possible.Bearing in mind that I may be utterly off the mark in inferring that Nabokov is indeed writing about his father when he has Fyodor’s father refracted through the prism of Fyodor’s mind, I don’t think Nabokov ever wrote so highly of his father as he had wrote of him in The Gift. Nabokov comes close in Speak, Memory but elsewhere, as in Glory, the portrait is less than flattering. But why risk losing one’s sanity over etiology when there’s so much to take delight in? Who cares if Nabokov was a mama’s boy? Read The Gift on its own terms, and don’t misconstrue it according to your biases. At its worst, The Gift will make you work hard, and its best….Well, you should find out on your own."}, {"review_sentiment": 5.0, "review_text": "His last book in Russian and a worthy farewell. Nabokov's complex and difficult novel can be tough to stick to but is so original and unpredictable that one should persevere."}, {"review_sentiment": 3.0, "review_text": "I tend to read fairly quickly, ladies and gentlemen, but \"The Gift\" took me way more time than even its 366 pages would seem to indicate. This may have something to do with the fact that according to many critics, and even according to Nabokov himself in a manner of speaking, this novel is a farewell note to Russian language and literature. Then again, it may have something to do with me, not the author.Either way, let's clear one thing up. The \"Book Description\" up there, as well as the blurb on the back jacket, tells us that \"The Gift\" is  \"the story of Fyodor Godunov-Cherdyntsev, an impoverished émigré poet living in Berlin, who dreams of the book he will someday write--a book very much like The Gift itself.\" Well, it's certainly about Fyodor, a genuine impoverished Russian poet living in Berlin, but the business about his dream of writing the very book you're reading occurs about two pages before the end. I suspect that whoever wrote that copy wanted you and me to believe that this piece is another twisty, supertextual Nabokovian puzzle. Not quite.Let's have a look at the surface plot before we go digging beneath it, at least. It's pretty straightforward; we've seen characters like Fyodor in Nabokov's work before now. Yeah, he's a refugee from Soviet Russia living in Berlin and he participates in the Russian literary life of the city as best he can, but thankfully he's not quite as egotistical as some of Nabokov's earlier heroes. He's a good poet who doesn't make a big deal about his gifts. He makes a living primarily by giving language lessons, and for a time considers writing a biography of his deceased father, who was a well-known explorer and naturalist before his mysterious death at around the time of the Russian revolution. The plans for this biography fall through, and Fyodor prepares instead a highly creative biography of one Nikolay Gavrilovich Chernyshevski, a real-life novelist, teacher and critic whose work proved highly popular and influential among Lenin and his allies. While researching and writing this piece of work, incidentally, Fyodor begins a secret affair with his landlord's stepdaughter Zina.So far, so good. \"The Gift\" is the last novel Nabokov ever wrote in the Russian language, turning exclusively to English afterwards, but he supervised the translation of this work . It's an important point, because the descriptions of both the natural world and city scenery are some of the most beautiful the man ever turned out. Admittedly, I had to force myself to read and enjoy them as they appear on the page, because by this time I'm so accustomed to Nabokov's literary tricks that I wondered, as I read the description of Chinese mountains and Berlin forest lakes, if I was missing something the author buried there. And let's face it, maybe he did plant twists and turns for us in those passages, but with all due respect, that's not our problem. At least during our first time through \"The Gift\", may I suggest we simply enjoy the gorgeous prose and the amusing adventures of Fyodor and let it go at that.Unfortunately, even if we do so, we now bump again into that assertion that this is a love letter to Russian literature. We are told, again by literary critics and by Nabokov himself, that certain passages in this novel appear in the style of famous Russian authors. The Chinese expedition takes on some highly romantic trappings, for instance, like Pushkin; the adventures of Fyodor and Zina in Berlin's streets border on the surreal, in the manner of Gogol. This is all very well, of course, but you (probably) and I (certainly) neither speak Russian nor read it, so what good do these stylistic pastiches do us as we read \"The Gift\"?Here's where we get into that traditional question, familiar to all; \"Why is this author different from all other authors?\" In almost all other cases, an author will slip some kind of structural experiment or contextual clue or just an interesting detail into his or her work to communicate something to the reader. Sometimes this adds to the piece's theme or meaning, sometimes it's just there to please us by finding it. Nabokov is different. You find all of these things in his work, and they can be a lot of fun to find, but he himself admitted that he did it all to please himself, and that this was the only good reason an author ever does anything.Agree with that or disagree, but it does go some way to showing what's pleasing about \"The Gift\". Whether or not authors and poets should concentrate on pleasing themselves, Fyodor, our main character, is such an artist. He needs to make money, of course, and does sell his work to publishers, but he doesn't bother much about the outcome or the reviews. The only other poet whose opinion he cares about is a young man named Koncheyev, with whom he has two fascinating conversations, neither one of which actually means what it seems to. I'll leave you to find out why.Interestingly, all of this makes Fyodor a pretty likeable character. You'd think someone that careless of his world and his people would be a serious pain in the neck. Actually, he comes across as independent, funny, even charming, and by no means egocentric. You have friends who constantly need your approval, and they can be very wearing. That's not Fyodor; his talent is real and his ego is healthy. Nabokov insisted that Fyodor was not a self-portrait, but with all due respect to the master, I kind of hope he was.Benshlomo says, Put a strong person in a beautiful setting and you've really got something."}, {"review_sentiment": 5.0, "review_text": "This is the last book Vladimir Nabokov wrote in what he called his `untrammelled, rich, and infinitely docile Russian tongue'.  The story of Fyodor Konstantinovich Godunov-Cherdyntsev, a young Russian émigré aristocrat in Berlin, told in this novel is both a personal journey and a reflection of Russia's past.  Nabokov provides a brief synopsis in his foreword:`The plot of Chapter One centers in Fyodor's poems. Chapter Two is a surge toward Pushkin in Fyodor's literary progress and contains his attempt to describe his father's zoological explorations. Chapter Three shifts to Gogol, but its real hub is the love poem dedicated to Zina.  Fyodor's book on Chernyshevsky, a spiral within a sonnet, takes care of Chapter Four. The last chapter combines all the preceding themes and adumbrates the book Fyodor dreams of writing someday: The Gift.'I would need to read this book at least two more times to fully appreciate it. It is not a novel to be devoured quickly, it deserves to be savoured slowly.  On this, my first read, I simply enjoyed Nabokov's use of language both as he describes Fyodor's progress and as he lampoons Nikolai Chernyshevsky (1828-1889) in the `spiral within a sonnet'.  It's beautifully done, the way that Nabokov works a biography of Chernyshevsky into his novel, contrasting two quite different Russias but with some shared shortcomings.`Existence is thus an eternal transformation of the future into the past - an essentially phantom process - a mere reflection of the material metamorphosis taking place within us.'And when the novel ends, will Fyodor's success continue? Will he and Zina be happy? Or will his (and their) moment be brief, like the butterflies?  We have seen Fyodor evolve for self-indulgent idleness to focussed observer: one of his roles in the book is complete; the other is neatly transferred to the reader.  Or so I think, on this reading.`Good-bye, my book!'Jennifer Cameron-Smith"}, {"review_sentiment": 5.0, "review_text": "I needed the novel in order to begin advising one of my graduate students who has embarked on a formalist study of Nabokov's masterful work. The virtually unused copy provided a blank slate for my annotations."}]}, "authors": ["Vladimir Nabokov"], "isbn": "0679727256", "longitude": 13.3888599, "periods": ["1900s"], "title": "The Gift", "word_cloud": "love previous particularly enjoy like initial chapter much ghost boy grieve parent prescribe order business room piano tie move van find remainder tedious engage perhaps knowledgeable etc well russian political history time period question write yes enough case chose club find fascinate tore lighten speed hit interminable dreadful chapter keep thankfully member club drop fly realize use device make chapter main character write sort winter night traveler final chapter much enjoyable actually laugh loud realize chapter full criticism author work feel better reading later healthy diet al huge literary joke miss miss punchline versatility fluidity style really cool work saw nothing author favorite chapter actually almost felt rest find bit inaccessible average good amount homework hearty appreciation specifically russian say language incredibly seductive rich really full tasty description imagery part least enjoyed anyone love good note last write language help quite bit english translation still wish sure subject truly appreciate fully original discussion meter rhythm language etc good ready really intellectual brilliant writer tedious great item good service masterful example deconstruction postmodern art literature choose select choose latter celebration choice diatribe opposite camp thrown casual diatribe perplex tax nabokovian diatribe part parcel nabokovian grain salt idea thought express true immaterial matter think something soul oppose act look backward surge ahead forward easy transition much tie russian past discard forever account accord historical account father die nobleman death take bullet friend fictional account father death le romantic indeed father die son depict death father thing mind utterly infer indeed write father father refract prism mind think ever write highly father write come close speak elsewhere portrait le flatter risk lose sanity etiology much delight care boy read term misconstrue accord bias worst make work hard find last russian worthy farewell complex difficult tough stick original unpredictable persevere tend fairly quickly ladies gentleman take way time even page something fact accord many critic even accord manner speak farewell note russian language literature then something way let clear thing well blurb jacket tell story impoverish poet live dream someday write much certainly genuine impoverish russian poet live business dream write read page end suspect whoever write copy want believe piece twisty super textual puzzle not surface plot go dig beneath least pretty straightforward see character work refugee soviet living participate russian literary life city best thankfully quite egotistical earlier heroes good poet make big deal gift make live primarily give language lesson time considers write biography decease father explorer naturalist mysterious death time russian revolution plan biography fall prepare instead highly creative biography novelist teacher critic work prove highly popular influential ally research write piece work incidentally begin secret affair landlord stepdaughter far good last ever write russian language turn exclusively english afterwards supervise translation work important point description natural world city scenery beautiful man ever turn admittedly force enjoy appear page time accustom literary trick wonder description chinese mountain forest lake miss something author bury face maybe plant twist turn passage due respect problem least first time suggest simply enjoy gorgeous prose amuse adventure let even bump assertion letter russian literature tell literary critic certain passage appear style famous russian author chinese expedition take highly romantic trapping instance adventure street border surreal manner well course probably certainly speak russian good stylistic pastiche here get traditional question familiar author different author almost case author slip kind structural experiment contextual clue interest detail work communicate something sometimes add piece theme meaning sometimes find different find thing work lot fun find admitted please good reason author ever disagree way show please author poets concentrate pleasing main character artist need money course sell work publisher bother much outcome review poet opinion care young man name fascinate conversation actually mean seem leave find make pretty likable character think someone careless world people serious neck come independent funny even charm mean egocentric friends constantly need approval wear talent real ego healthy insist due respect master kind hope say strong person beautiful set really get something last write call rich infinitely docile russian tongue story young aristocrat tell personal journey reflection provide brief synopsis foreword plot center poem surge literary progress contains describe father zoological exploration shift real hub love poem dedicate spiral sonnet take care last chapter combine precede theme adumbrate dream write someday least time fully appreciate devour quickly deserves savor slowly first simply enjoy use language describe progress lampoon sonnet beautifully do way work biography contrast quite different share thus eternal transformation future essentially phantom process mere reflection material metamorphosis take place end success continue happy moment brief butterfly see evolve idleness focus observer roles complete neatly transfer think need order begin advise graduate student embark formalist study masterful work virtually unused copy provide blank slate annotation", "genres": ["Fiction & Literature"], "summary": "The Gift is the last of the novels Nabokov wrote in his native Russian and the crowning achievement of that period in his literary career. It is also his ode to Russian literature, evoking the works of Pushkin, Gogol, and others in the course of its narrative:  the story of Fyodor Godunov-Cherdyntsev, an impoverished émigré poet living in Berlin, who dreams of the book he will someday write--a book very much like The Gift itself.", "asin": "0679727256", "rank": "225353", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/41toUNQwXCL.jpg", "country": "Germany", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}