{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -27.4689682, "ratings": {"num_ratings": 15, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Extraordinary book"}, {"review_sentiment": 5.0, "review_text": "Exquisite!"}, {"review_sentiment": 5.0, "review_text": "The futility of war and the loss of young lives, the theme more young people should read about before rushing off to quieten their sense of nationalism through signing up for the cause. Thirty years ago David Malouf wrote this astounding description of war and sadly his character's understanding of the world has come true. War is truly a bottomless pit requiring endless blood loss to work its  machinery. 'He and his contemporaries had fallen into a dark pocket of time from which there was no escape'. Malouf uses dream-like scenes to soften the death blow striking its victim. 'He had a fearful vision. The war or something like it with a different name would go on growing from here till the whole earth was involved.' 'He realised what an innocent life he had led before....' Nevertheless the reader is left admiring the experience."}, {"review_sentiment": 2.0, "review_text": "20/09 - Had to read this for year 12 English and I didn't really understand it and therefore didn't enjoy it. I find both situations strange as I am usually drawn to Australian war stories, fiction and non-fiction. Maybe it deserves a re-read with my older, more mature brain...one day."}, {"review_sentiment": 4.0, "review_text": "Jim Saddler lives in Queensland, Australia, just outside Brisbane. He is a young, countryman who has not quite found his place in the world. Jim does not know what he wants to do, with who or where. According to his drunken, gruff, unfeeling father Jim is of no consequence, a useless burden. But there is one thing that Jim likes to do and that is watching the native birds that frequent the local swamplands near the ocean. \"... lorikeets, rosellas and different families of pigeons - fruit-pigeon, bronze-wings, the occasional topknot or squatter - and high over all stood the birds of prey, the hawks and kestrels\": Jim knows them by the tens of hundreds and can name their place of migratory origin and the times of their arrival and departure. The ebb and flow of nature speaks to him and he becomes lost in them for hours at a time. Then by coincidence Jim meets Ashley Crowther, the young new master of the property on which the swamp lies. Ashley to is fascinated by birds but lacks knowledge of the local wildlife. He was born in Australia, but has spent most of his life being educated in England. Seeing Jim's potential immediately Ashley offers Jim a job. Jim, as a kind of amateur naturalist, is to keep records of the arrival, number and behavior of the birds on Ashley's property. The two men become close friends. They share a bond more than employer and employee. Next Jim meets Imogen Harcourt, an aging spinster who supplements her meager funds by selling the nature photographs she takes in the local countryside. Once again like Jim Imogen has a love of birds. She struggles to photograph them at just the right pose so as to capture their essence. Soon Jim and Imogen become an 'odd' pair. But the year is 1914 and soon a rush of excitement goes through the local neighborhood. There is war in Europe. How will these three people, tied by their mutual love of nature, fair in the coming tumult? Most of all how will Jim survive the ugly machinations?This is a book of contrasts: the delicate cry of birds, and the brutal thud of bombs: the lush fields of the country, and the stinking mud of the war field: the brief moment of friendship first realized, and the almost impersonal, repeated, agonizing loss of comrades-in-arms. This book is a celebration of life, though the author has no delusions that beauty is lasting or even common. It is also an anti-war book, though the author has not written a single word of condemnation or judgment, not one diatribe. The events simply speak for themselves.Malouf began his career as a poet and this book shows the mark of that experience. In this book words are used carefully and sparingly. The first part of the book is beautiful in its lyric charm. Briefly the author records scenes of life and friendship that move us. Malouf is not maudlin or sickly-sweet, just honest. The second part of the book can be read like one long nightmare, increasingly violent and dehumanizing. Yet here too words are used sparingly. The author does not need to dwell on the ugliness. Once again honest, brief description serves the purpose.The book centers on Jim and his odyssey from the fields of Queensland to the trenches of Armenitieres, in France. Malouf describes well the metamorphosis of the bright-eyed, country boy into the numbed, weary, brutalized soldier. The characters of Ashley and Imogen are dealt with only briefly. Here we have more static pictures rather than rounded development. The author could have spent just a little more time on these portraits. The reader does not see them quite enough to develop an attachment to them. As a result, for example, Imogen's grief seems understandable enough, but we don't quite feel for her.Of course all novels take their place in the history of literature, as does this book. Reading it I am reminded of Stephen Crane's _The Red Badge of Courage_: the country lad, the psychological struggles of the soldier, the carnage of war, the beauty of nature even amid the destruction of war, the final flight from the slaughterhouse. Both books are poetic in their style, and both are brief in length. Crane's book has been called \"the first modern war novel\" and Malouf would find it difficult to escape from its shadow. Malouf does have, however, his own voice and has used his imagination in unique ways: the nature sanctuary, the description of naive Brisbane, the chance meeting with the city girl, the numbered, unbelieving life of the peasants near the front, the squalor of the trenches._Fly Away Peter_ is a short read, and indeed could even be described as a novella, but it deals with weighty issues. The reader will find that it works a charm over them and they will not want to put it down. Malouf has won many literary prizes for his various works, and this book took the 1982 Melbourne _Age_ Book of the Year Award."}, {"review_sentiment": 5.0, "review_text": "This is an exquisite little novella that begins in beauty on the coast of Queensland and ends (almost) in the mud of Flanders on the other side of the world. Birds, of course, make similar migrations; this is one of the things that fascinates 20-year-old Jim Saddler as he studies birds with borrowed binoculars, noting their species, their habits, their comings and goings. He strikes up a friendship with Ashley Crowther, the young owner of this stretch of Australian farmland, and also with Imogen Harcourt, a middle-aged photographer with a similar passion. But then the 1914 War breaks out, and Jim and Ashley sign up, in different regiments and at different ranks.There are many books about the Western Front. The ingredients are all much the same: boredom, companionship, carnage. What makes one stand out from another is the quality of the writing, the particular point of view, and whatever aspects of normal life the author chooses to set against the obscenity of war. The last book I read about the trenches, for example, Sebastian Barry's A LONG LONG WAY, was written with a rich Irish poetry, kept its point of view very much at ground level, and set the War against the very different Irish fight for independence back home. Malouf's writing is also poetic, but simpler, and he excels particularly at describing the air above and the land behind the war, as in the following:\"Often, as Jim later discovered, you entered the war through an ordinary looking gap in a hedge. One minute you were in a ploughed field, with snowy troughs between ridges that marked old furrows and peasants off at the edge of it digging turnips or winter greens, and the next you were through the hedge and on duckboards, and although you could look back and still see the farmers at work, or sullenly watching as the soldiers passed over their land and went slowly below ground, there was all the difference in the world between your state and theirs. They were in a field and very nearly at home. You were in the trench system that led to the war.\"But it is Malouf's juxtaposition of the battlefield to the Australian nature reserve that is so daring. For there is no possibility of a literal resolution that connects them. Indeed, Malouf seems to avoid following narrative links; Ashley and Jim barely meet again, and the biplane so prominently featured on the cover ultimately serves only to offer Jim a metaphor for his own bird's eye view on life. Yet it is an important metaphor. The two halves of the book portray beauty and destruction with memorable power. But the coherence of the novel as a whole depends upon the final chapter, which returns to Imogen Harcourt watching the birds among the sand dunes. I had to sleep on this and re-read it for it to fully work, but now I see the beauty in her simple understanding of the life that connects both birds and man."}, {"review_sentiment": 2.0, "review_text": "A novel about the horrors of running around on the battlefield during world war one, in the main.  Unforunately, it is also a very dull example of the same.The good thing then in that respect, is that it is also quite short so you don't have to put up with it for every long."}, {"review_sentiment": 5.0, "review_text": "Malouf deals with big themes here: the continuities of nature; the horror of human conflict; our desire to hold onto the past, and the necessity of relinquishing it.  But he handles them in such a personal, beautiful and profoundly moving way that he manages to say it all in under 150 pages.  Some readers might prefer more languorous pacing, but Malouf has no reason to stall.  Unlike many writers, he knows precisely what he's doing.  His precision is utterly astounding.  He can say more, move you more, in a dozen pages than lesser writers seem to manage in whole careers.  Chapter 14, scarcely more than 2000 words, is the most powerful account of the Great War - what it meant, what it can be made to mean - that I have ever read."}, {"review_sentiment": 4.0, "review_text": "David Malouf's prize winning novel, 'Fly Away Peter' is a beautifully written story that both beautifies and simplifies the life of humans and animals. Malouf has to be considered as one of Australia's leading writers and poets. This novel is not a story to be read if one is after light entertainment. It is truly the work of a poet, a fine piece of literature. His descriptive text beckons the reader to find a deeper meaning. The simple messages of love, friendship and the beauty of life are both refreshing and moving. Do not attempt to read it if you are after cheap thrills. This book needs to be savoured. It follows the lives of three main characters, Ashley, Jim and Imogen. Together they appreciate the joyous beauty of nature by studying and photographing a sanctuary owned by Ashley. However the terror of war rips the paradise apart and leaves the three friends seperated and questioning the meaning of life. Through different experiences, each character comes to a similar conclusion, that life is simple, beautiful and a gift to be enjoyed. It will go on over any hurdles. There are always survivors. An interesting read if you are having difficulties facing each day."}, {"review_sentiment": 4.0, "review_text": "I have read most of Mr. Malouf's novels and he is an Author of remarkable talent and consistency. It has generally not been whether a given work is good, just how very good it is. He almost competes with himself alone when he pens another work. This work, \"Fly Away Peter\", is closer to a novella in length, but felt a bit crowded when read. It would seem examining an issue in depth, or a general theme in breadth can be accomplished without a regard for length, rather just skill. This time out I felt there was room for two or three times the length of the actual work.This book promises to deal with the issue of men from different classes of life, how they place the strata of society aside and become partners. And then to narrate how the First World War draws the two different men into its maw. These men are not the only characters, and it is not just their histories the Author must communicate. When all of these aspects are brought together in barely 134 pages, it became incomplete for me, almost claustrophobic. Mr. Malouf is a remarkable writer and poet. To read any of his work is to read great literature from this admired Australian Author.The four stars may seem to contradict what I have said, however I cannot go back and change all of the previous books of his I have commented upon. This is excellent reading when placed next to much of what is available; it only comes up short when compared to the balance of his work. It certainly is worth the time to read and enjoy, it should probably be placed at the beginning of reading his body of work, rather than near its end."}]}, "authors": ["David Malouf"], "isbn": "0679776702", "longitude": 153.0234991, "periods": ["1900s"], "title": "Fly Away Peter", "word_cloud": "extraordinary exquisite futility war loss young live theme young people rush quieten sense nationalism signing cause year ago write astound description war sadly character understanding world come true truly bottomless pit require endless blood loss work machinery contemporary fall dark pocket time escape use scene soften death blow strike victim fearful vision war something different name grow till whole earth involve realized innocent life lead leave admire experience year really understand therefore enjoy find situation strange usually draw australian war story fiction maybe deserves older mature brain day live young countryman quite find place world know want accord gruff unfeeling father consequence useless burden thing like watch native bird frequent local swampland ocean lorikeet rosella different family pigeon occasional topknot squatter high stood bird prey hawk kestrel know ten hundred name place migratory origin time arrival departure ebb flow nature speak become lose hour time then meet young new master property swamp lie fascinate bird lack knowledge local wildlife bear spent life educate potential immediately offer job kind amateur naturalist keep record arrival number behavior bird property men become close friend share bond employer employee meet age spinster supplement meager fund sell nature photograph take local countryside love bird struggle photograph right pose capture essence pair year soon rush excitement go local neighborhood war people tie mutual love nature fair come tumult most survive ugly machination contrast delicate cry bird brutal thud bomb lush field country stink mud war field brief moment friendship first realize almost impersonal repeated agonizing loss celebration life author delusion beauty last even common also author write single word condemnation judgment diatribe event simply speak begin career poet show mark experience word use carefully sparingly first part beautiful lyric charm author record scenes life friendship move maudlin honest second part long nightmare increasingly violent dehumanize word use sparingly author need dwell ugliness once honest brief description serve center odyssey field trench describe well metamorphosis country boy numbed weary brutalize character deal briefly here static picture rather round development author little time portraits see quite enough attachment result example grief seem understandable enough quite course novel take place history literature read remind country lad psychological struggle soldier carnage war beauty nature even destruction war final flight slaughterhouse poetic style brief length call first modern war difficult escape shadow however voice use imagination unique way nature sanctuary description naive chance meeting city girl number unbelieving life peasant front squalor short indeed even novella deal weighty issue find work charm want put many literary prize various work take exquisite little novella begin beauty coast end almost mud side world course make similar migration thing fascinate study bird borrow binoculars note specie habit coming going strike friendship young owner stretch farmland also photographer similar passion break sign different regiment different many western ingredient much boredom companionship carnage make stand quality write particular point view aspect normal life author choose set obscenity war last trench example write rich poetry keep point view much ground level set different fight independence back home writing also poetic simpler excels particularly describe air land war follow later discover entered war ordinary look gap hedge minute slough field snowy trough ridge mark old furrow peasant edge dig turnip winter green hedge duckboard still farmer sullenly watch soldier pass land go slowly grind difference world state field nearly home trench system lead war juxtaposition battlefield australian nature reserve dare possibility literal resolution connects indeed seem avoid follow narrative link barely meet biplane prominently feature cover ultimately serve offer metaphor bird eye view life important metaphor half portray beauty destruction memorable power coherence whole depend final chapter return watch bird sand dune sleep fully work see beauty simple understanding life connects bird man horror run around battlefield world war main unfortunately also dull example good thing respect also quite short put long deal big theme continuity nature horror human conflict desire hold past necessity relinquishing handle personal beautiful profoundly move way manages say page reader languorous pace reason stall many writer know precisely precision utterly astound dozen page lesser writer seem manage whole career chapter scarcely word powerful account mean make mean ever win beautifully write story beautifies simplify life human animal consider lead writer poet story light entertainment truly work poet fine piece literature descriptive text beckons find deeper mean simple message love friendship beauty life refresh move thrill need savor follow life main character appreciate joyous beauty nature study photograph sanctuary own however terror war rip paradise apart leave friend separate question mean life different experience character come similar conclusion life simple beautiful gift enjoy hurdle always survivor interesting difficulty face day novel remarkable talent consistency generally give work good good almost compete alone pen work work closer novella length felt bit crowd examine issue depth general theme breadth accomplish regard length rather time felt room time length actual promise deal men different class life place stratum society aside become partner narrate draw different men men character history aspect bring together barely page become incomplete almost claustrophobic remarkable writer poet great literature admire australian star contradict say however go back change previous comment excellent reading place next much available come short compare balance work certainly worth time enjoy probably place begin read body work rather end", "genres": ["Fiction & Literature", "Historical Fiction", "WWI"], "summary": "In this shimmering work of imagination, one of Australia's most honored writers conjures a single still moment on the edge of the 20th century in which two unlikely people share a friendship. When Ashley Crowther returns to Australia to manage his father's property, he discovers a timeless landscape of kingfishers and ibises; he also meets Jim Saddler, the young woodsman who becomes Ashley's guide to his inheritance. Together they discard the differences of personality and class to enter a partnership of wonder. \r\n\r\nBut when war breaks out in Europe, Jim and Ashley are drawn into obscene enterprise of the trenches, where death falls from the sky and burrows out of the earth. In telling the story of these men, Fly Away Peter combines overwhelmingly sensual imagery with an unblinking consciousness of the worst that history can inflict to produce a novel of phosphorescent beauty.", "asin": "0679776702", "rank": "1913960", "city": "Brisbane", "image": "https://images-na.ssl-images-amazon.com/images/I/516uFqntJ2L.jpg", "country": "Australia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}