{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 36, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "This was a great, thrilling read."}, {"review_sentiment": 5.0, "review_text": "I was pleasantly surprised at the ease with which I read Despair; not as difficult as Nabokov's more noted works, Lolita and Pale Fire. It was enjoyable and amusing. Beyond the puns and jabs at Dostoevsky, it is a serious portrait of the writer and the work of writing. The metaphor of the writer as criminal struggling to commit the perfect crime is excellent. The criminal in the throes of plotting and executing his crime experiences a delusion very similar to the writer living in the artificial world of his imagination. And, like Hermann, the rejected or unsuccessful writer is similarly disappointed that the readers didn't buy into his vision, his story. But, he never gives up, as the last paragraph attests."}, {"review_sentiment": 5.0, "review_text": "Amazon asks, \"How is the author's writing?\" but doesn't provide a \"Like no other, he's Vladimir Effing Nabokov\" button to select from."}, {"review_sentiment": 5.0, "review_text": "Fabulous story"}, {"review_sentiment": 4.0, "review_text": "Every single high school student should read this book. Particularly those currently enamored with the suddenly attractive sheen of Socialism."}, {"review_sentiment": 5.0, "review_text": "Great Nabokov!"}, {"review_sentiment": 3.0, "review_text": "This piece of early Nabokov, pre WWII but revised many years later, is narrated by a lunatic. The language is very entertaining, but the plot drags."}, {"review_sentiment": 3.0, "review_text": "Nobokov's writing was highly anticipated. I found this book a bit disappointing. Plot line was simplistic and predictable. Not one I would recommend to others as a worthy read."}, {"review_sentiment": 5.0, "review_text": "This book is good. The print and the cover are both simple but inspiring. Plus, the price is totally acceptable."}, {"review_sentiment": 4.0, "review_text": "It is always dangerous to form preconceptions about a book before reading it. When a reader's expectations about what a book is going to be are dashed, as they often are, it tends to lead to disappointment. I formed an idea of what I thought this book was going to be about based on its title, and based on the very short blurb on the back of the book, that turned out to be totally mistaken. I think I would have appreciated this novel more if I had not been operating under my own mistaken first impressions about what I thought the book was going to be about. The back cover says that the book is about \"a man who undertakes the perfect crime: his own murder.\" I took that quite literally and, combined with the title, thought that the book was going to be a black humor take on someone who decides to commit suicide. I thought it might even be a humorous existential meditation on the meaninglessness of existence, or something of that nature. It turns out I was wrong.The book is actually a book about a chocolate salesman, named Hermann, who, on a business trip to Prague, runs into a homeless person who he believes to be his exact double. The narrator becomes obsessed with his double, but the reader is unclear about Hermann's ultimate intentions at first. It is clear that Hermann is hatching some kind of a plan, but it is not clear what that plan is, or whether he will succeed in carrying it out. I will not give anything away, though anyone who has read the back of the book will be able to guess some of it.Hermann himself slowly and methodically narrates the unfolding of his own plan. Hermann is impatient as a narrator, he gets bored with the boring parts, and Nabokov is able to induce the same impatience, and sometimes boredom, in the reader. There is a fair amount of humor in the book. Nabokov certainly has a felicity with language, and there is some degree of suspense, as Hermann's plan slowly unfolds for the reader. The narrator himself is extremely unreliable. There are also a lot of interjections about the nature of writing. The narrator often addresses himself directly to the reader, and openly debates with himself about different possible ways of beginning a chapter. The narrator often makes comments about the standard conventions of writing. This is, indeed, one of the most self-conscious books I have ever read. It is very aware of itself as a book, and as a piece of writing.While there is a fair amount of humor in the book, and it is certainly possible to glean some interesting reflections on the nature of writing and art from the book, there is not, I do not think, any deep philosophical message in the book. Indeed, Nabokov seems to be making fun of readers who attempt to find some deep philosophical meaning in the work in the foreword when he writes that he \"shall be interested to see if anyone calls my Hermann 'the father of existentialism'.\" While it may not offer much food for the philosophers, Nabokov continues, \"Plain readers...will welcome its plain structure and pleasing plot.\" Nabokov also comes right out and says that the book \"has no social comment to make, no message to bring in its teeth.\" Hermann, the narrator, makes fun of possible Marxist interpretations of the book throughout his narration.Nabokov has certainly mastered the techniques of writing. I have already drawn attention to his felicity with language, but he also creates interesting characters. Creating interesting, full blooded, characters is often difficult for writers, even good writers. Some writers are good at describing their characters, or having their characters describe themselves, but when their characters actually speak, they all tend to speak in the same voice. Though there are only four main characters in the book, Nabokov's characters all speak in their own voice. Nabokov has also mastered the technique of creating suspense (I actually read the whole book in a single sitting).I did feel, at times, however, that Nabokov is sort of all style, with little substance. There is an interesting story here, but it is not that much different from a standard mystery novel. What sets it apart from a standard mystery novel is the extremely high level of writing, and the sort of post-modern (whatever that means) reflexivity or self-consciousness of the narrator. Nabokov is a master of style, but there were times when I felt as if he was being virtuosic simply for the sake of virtuosity. Sometimes it felt as if Nabokov was simply showing off. Reading Nabokov is kind of like watching a really good juggler. There is no doubt that a really professional juggler is often able to inspire a great deal of admiration in me, but ultimately juggling is just a trick. There is not really any chance that you are going to come away from a juggling show with a new perspective on the world or human life. Nabokov seems to me to be like a professional juggler. His writing is certainly impressive, but I did not really feel like I came away with anything of substance.Some people may be fine with that. There is nothing wrong with being a juggling enthusiast, and there is nothing wrong with enjoying art for art's sake, and who knows, perhaps I am simply missing the point (it would not be the first time). Personally, I tend to prefer more philosophical novels. Hermann, the narrator, makes a number of references in the book to Crime and Punishment (Vintage Classics), and there are certainly a number of similarities between the two books. There are also some pretty huge differences. Dostoevsky's novel (which is one of my all time favorite novels) is a psychological novel that delves deeply into the human heart, and attempts to give expression to the deep existential struggles of human life. Nabokov does not seem to me to have a similarly serious purpose in this book.The bottom line is: if you are interested in a book with a \"plain structure and pleasing plot\", that also happens to have been written by a master of the craft, then you will almost certainly find a great deal to enjoy in this book. If you are expecting (as I was) a more philosophical novel, then you might be disappointed, although, you will probably still find (as I did) a great deal to enjoy in the book, which should take the edge off of the disappointment. I have a feeling that if I had simply known upfront what to expect, and had not been misled by my own hasty assumptions, I probably would have been able to simply enjoy the book, without any attendant disappointment. But such is life."}]}, "authors": ["Vladimir Nabokov"], "isbn": "0679723439", "longitude": 14.4212535, "periods": ["1900s"], "title": "Despair", "word_cloud": "great thrilling pleasantly surprise ease difficult note work enjoyable amuse pun jab serious portrait writer work write metaphor writer criminal struggle commit perfect crime excellent criminal throe plot execute crime experience delusion similar writer live artificial world imagination reject unsuccessful writer similarly disappointed reader buy vision story never give last paragraph attests ask author write provide button select fabulous story single high school student currently enamor suddenly attractive sheen socialism piece early per revise many year later narrate lunatic language entertain plot drag write highly anticipate find bit disappointing line simplistic predictable not others worthy good print cover simple inspire price totally acceptable always dangerous form preconception read expectation go dash often tend lead disappointment form idea think go base title base short blurb back turn totally mistaken think appreciate operate mistake first impression think go back cover say man undertakes perfect crime murder take quite literally combine title thought go black humor someone decides commit think even humorous existential meditation meaninglessness existence something nature turn actually chocolate salesman name business trip run homeless person believe exact double narrator become obsess double unclear ultimate intention first clear hatch kind plan clear plan carry give anything away anyone back able guess slowly methodically narrate unfolding plan impatient narrator get bore boring part able induce impatience sometimes boredom fair amount humor certainly felicity language degree suspense plan slowly unfold narrator extremely unreliable also lot interjection nature write narrator often address directly openly debate different possible way begin chapter narrator often make comment standard convention write indeed ever aware piece fair amount humor certainly possible glean interesting reflection nature write art think deep philosophical message indeed seem make fun reader attempt find deep philosophical meaning work foreword write interested anyone call father existentialism much food philosopher continue reader welcome plain structure please plot also come right say social comment make message bring teeth narrator make fun possible marxist interpretation certainly master technique write already draw attention felicity language also create interesting character create interesting full blood character often difficult writer even good writer writer good describe character character describe character actually speak tend speak voice main character character speak voice also master technique create suspense actually whole single sit feel time however sort style little substance interest story much different standard mystery set apart standard mystery extremely high level write sort mean reflexivity narrator master style time felt virtuosity simply sake virtuosity felt simply show read kind watch really good juggler doubt really professional juggler often able inspire great deal admiration ultimately juggle trick really chance go away juggle show new perspective world human life seem professional juggler write certainly impressive really feel come away anything people nothing wrong juggling enthusiast nothing wrong enjoy art art sake know perhaps simply miss point time tend prefer philosophical novel narrator make number reference certainly number similarity also pretty huge difference time favorite novel psychological delf deeply human heart attempt give expression deep existential struggle human life seem similarly serious purpose bottom line interested plain structure please plot also happen write master craft almost certainly find great deal expect philosophical disappoint probably still great deal enjoy take edge disappointment feel simply know upfront expect mislead hasty assumption probably able simply attendant disappointment life", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "The narrator and protagonist of the story, Hermann Karlovich, a Russian of German descent and owner of a chocolate factory, meets a homeless man in the city of Prague, whom he believes is his doppelgänger. Even though Felix, the supposed doppelgänger, is seemingly unaware of their resemblance, Hermann insists that their likeness is most striking.\r\n\r\nHermann is married to Lydia, a sometimes silly and forgetful wife (according to Hermann) who has a cousin named Ardalion. It is heavily hinted that Lydia and Ardalion are, in fact, lovers, although Hermann continually stresses how much Lydia loves him. On one occasion Hermann actually walks in on the pair, naked, but Hermann appears to be completely oblivious of the situation, perhaps deliberately so.\r\n\r\nAfter some time, Hermann shares with Felix a plan for both of them to profit off their shared likeness by having Felix briefly pretend to be Hermann. But after Felix is disguised as Hermann, Hermann kills Felix in order to collect the insurance money on Hermann on March 9. Hermann considers the presumably perfect murder plot to be a work of art rather than a scheme to gain money.\r\n\r\nBut as it turns out, there is no resemblance whatsoever between the two men, the murder is not 'perfect', and the murderer is about to be captured by the police in a small hotel in France, where he is hiding. Hermann who is writing the narrative switches to a diary mode at the very end just before his captivity, the last entry is on April 1.\r\n\r\nDespair is the seventh novel by Vladimir Nabokov, originally published in Russian, serially in the politicized literary journal Sovremennye zapiski during 1934. Most copies of the 1937 English edition were destroyed by German bombs during World War II; only a few copies remain. Nabokov published a second English translation in 1965; this is now the only English translation in print.\r\n\r\nWikipedia", "asin": "0679723439", "rank": "384339", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51%2BsxAcUDsL.jpg", "country": "Czechia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}