{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 73, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Nabakov has a way with words.  Even when i'm not into the story, i can get into how he's telling it."}, {"review_sentiment": 4.0, "review_text": "Laughter in the Dark is a dramatic novel that catches the reader's attention through 40 year old Albinus's love life. Laughter in the Dark gives a new perspective and makes the reader consider the love they are searching for, if any. The author, Vladimir Nabokov, is an intelligent man with a writing style that keeps the reader entertained. Vladimir takes us on a trip through the typical mid-life crisis but it winds up feeling like our own. Vladimir's writing makes the reader invested in Albinus's life and you wind up questioning his decisions and showing just as much emotion as Albinus does. Albinus suffers through heartbreak and denial that he created for himself. He left his wife for his 17 year old mistress, but doesn't know if she's worth it. Eventually throughout the story his mistress, Margot, finds her old ex-lover. A love triangle comes into play and the rest of the story involves wealth, death, and fake love. Laughter in the Dark provides an entertaining read where Vladimir attempts to conquer the mysteries of fate and the mental decisions we make for someone who doesn't love us."}, {"review_sentiment": 5.0, "review_text": "Vladimir Nabokov is one of my favorite authors. Laughter in the Dark was a great read with an unexpected twist."}, {"review_sentiment": 5.0, "review_text": "*Spoilers*Actually, no need for a spoilers alert since Nabokov proceeds to tell us the entire plot in the first paragraph. By this ingenious opening, the interest is no longer in what's going to happen so much as how. Also, the interest comes in learning the specific details to what is a common story.This novel reminded me of Josef Von Sternberg's film The Blue Angel (1930) which came out two years earlier. It is almost cinematic with its short scenes and chapters, its concise use of imagery, and its pithy dialogue.Reading it, I couldn't help but admire the masterful use of prose while at the same time watching a train hurtling towards a cliff.Lastly, I found Margot and Rex to be frightening characters, especially Rex with his depravity."}, {"review_sentiment": 3.0, "review_text": "In the novel, Laughter in the Dark, Vladimir Nabokov’s writing explores the secrecy and betrayal of affairs and the crumbling effect that comes with discovering the truth, targeting a young-adult audience and leaves the reader curiously wondering if their “under the radar” love will bring happiness or pain.  A man, named Albinus, once had everything he could want, a family, money, and respect, but ends up with nothing in the end.  But how can a man lose everything in only one year?  Nabokov keeps the reader engaged in the beginning and end of the book, but lacks significant substance in the middle.  On the contrary to some ravishing reviews, many readers feel that Laughter in the Dark does not live up to Vladimir Nabokov’s previous works and was seen to be too predictable."}, {"review_sentiment": 3.0, "review_text": "While the beginning and end fly by, the middle wanes to a painfully slow pace. It's not a story that will stick with me, and I most likely won't read it again, but parts of it were enjoyable."}, {"review_sentiment": 4.0, "review_text": "Such a joy to read. My only complaint- that it wasn't longer (not unlike this review)."}, {"review_sentiment": 5.0, "review_text": "one of my favorite novels"}, {"review_sentiment": 4.0, "review_text": "Good book, but not close to Lolita. For modern readers the story is so exciting any more."}, {"review_sentiment": 5.0, "review_text": "Great book.  Any other input might spoil it."}]}, "authors": ["Vladimir Nabokov"], "isbn": "0679724508", "longitude": 13.3888599, "periods": ["1900s"], "title": "Laughter in the Dark", "word_cloud": "way word even story get tell dramatic catch attention year old love life give new perspective make search author intelligent man write style keep entertain take trip typical crisis wind feel write make invest life wind question decision show much emotion suffers heartbreak denial create leave wife year old mistress know eventually story mistress find old love triangle come play rest story involve wealth death fake love provide entertaining attempt conquer mystery fate mental decision make someone favorite author great unexpected twist need spoiler alert proceeds tell entire plot first paragraph ingenious open interest longer go much also interest come learn specific detail common remind film come year earlier almost cinematic short scene chapter concise use imagery pithy masterful use prose time watch train hurtling towards find frighten character especially depravity write explores secrecy betrayal affair crumble effect come discover target audience leave curiously wonder radar love bring happiness pain man name everything family money respect end nothing end man lose everything year keep engage begin end lack significant substance middle contrary ravish review many reader feel live previous work see predictable begin end fly middle wane painfully slow pace story stick likely part such joy longer review favorite novel good close modern reader story excite input", "genres": ["Fiction & Literature", "Weimar Republic"], "summary": "The classic novel from the author of Lolita, brilliantly portraying one man's ruin through love and betrayal.\r\n\r\n\"Once upon a time there lived in Berlin, Germany, a man called Albinus. He was rich, respectable, happy; one day he abandoned his wife for the sake of a youthful mistress; he loved; was not loved; and his life ended in disaster.\" Thus begins Vladimir Nabokov's Laughter in the Dark; this, the author tells us, is the whole story―except that he starts from here, with his characteristic dazzling skill and irony, and brilliantly turns a fable into a chilling, original novel of folly and destruction. \r\n\r\nAmidst a Weimar-era milieu of silent film stars, artists, and aspirants, Nabokov creates a merciless masterpiece as Albinus, an aging critic, falls prey to his own desires, to his teenage mistress, and to Axel Rex, the scheming rival for her affections who finds his greatest joy in the downfall of others.\r\n\r\nPublished first in Russian as Kamera Obskura in 1932, this book appeared in Nabokov's own English translation six years later. This New Directions edition, based on the text as Nabokov revised it in 1960, features a new introduction by Booker Prize-winner John Banville.", "asin": "0679724508", "rank": "347837", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/41k-gJ3uy4L.jpg", "country": "Germany", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}