{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 11, "rating": 3.2, "reviews": [{"review_sentiment": 1.0, "review_text": "Outdated, tedious, inaccurate, romantic drivel.  If you think this is a useful guide for a visitor or resident of Hong Kong, it is not"}, {"review_sentiment": 3.0, "review_text": "While the book gave me a great history of the former British Colony it was written before the turnover to China. Great review of the power-brokers of Hong Kong, however it left me with a desire to know more about what has transpired since 1997. I suppose the rating I gave Jan Morris' book was due simple to this fact. I hope someone extends on what she has written and bring those of us interested up to date on the new role Hong Kong has in the world and China's dealing with this financial center of the world. It saddens me to think that in 2047 China will probably have destroyed the ambiance of this wonderful city. However, I will not be against Hong Kong people. Going fast now is the Cantonese language that is being replace with Mandarin."}, {"review_sentiment": 3.0, "review_text": "First of all, I greatly enjoyed this classic.  Jan Morris is one of the English world's greatest travel writers and this book is a tour de force.  It really gives one a sense of what colonial Hong Kong was like for the British, despite the somewhat disjointed approach obliged by its single volume format.However, as I read the book I grew more and more concerned about its balance and what had been left out.  For its first hundred years, Hong Kong basically survived on the opium trade, and what was known as the \"pig trade,\" the trans-shipment of Chinese peasant workers to other areas of the British Empire.  I kept waiting to hear about these activities that were so basic to the life of the colony, and its great companies,  Jadines, Swires, etc., but Morris hardly touches on them.  There was no mention of the \"pig trade\" at all, and as for opium, it basically revolved around descriptions of beautiful, highly polished, opium clippers racing off to somewhere on the China coast.  Such analytical holes automatically bias any balanced analysis of the Hong Kong's history, and tend to confirm that Morris is regarded in many academic circles as \"Urban History Lite.\"As well, there is her description of Hong Kong's two basic cultures.  Morris does a good job of describing the British in the colony with their inherent greed, conceit, and racism.  I have studied colonialism in detail here in Canada, and also in the Caribbean, and the variety of racism found in the Far East seems to have been the worst.  However, the Chinese which made up 96% of the population, remain throughout the book a mysterious, superstitious mass, stereotyped repeatedly  as being cheerful, energetic, and ingenious.  There is something suspicious about these repetitions, and my first thought was does Morris speak Chinese.  I have always felt that anyone who did not speak the local language should not get involved in writing about the culture.  The links are just too vague to get it right.Finally after all this meandering, Morris makes some pretty strong judgments about Hong Kong's history and the British contribution to it.  She feels that Hong Kong was not a parasite as many have characterized it, but rather, gave as much to China as it got.  This may be true, but she certainly hasn't proven it with this book.  As well, she feels that the British, in spite of their many faults, basically governed the colony well, and ultimately, left Hong Kong honorably, even though they waited till the very last minute, before offering it any form of democratic alternative to their authoritarian rule.  This argument also seems terribly weak to me, and rather underlines that the British, right up to the very last minute, were busy feathering their nest with this golden egg.No this is not the definitive book on Hong Kong, but rather the beginning of the end of a very old, and very self serving British colonial genre.  Will the sun every set on this British Empire?  Not likely, not for another 1,000 years!Cheers"}, {"review_sentiment": 5.0, "review_text": "Another recent re-reading of this excellent historical portrait led to this review, but it was also stimulated by another review in which the reader complains of Ms Morris as reflecting a `western perspective'. Given that the Hong Kong of which Jan Morris writes was created by Westerners, from a declining pearl of the East, and that those same creators returned the territory and its teeming millions back to the East in an unprecedented action for a former Empire, a `western perspective' would seem to me to be perfectly valid.Indeed, quoting Frank Ching, a noted Hong Kong author, from his own review of the book in the New York Times (1989); \"She approaches the subject of Hong Kong as a student of British imperialism\" and notes that she does a superb job.For decades Hong Kong was not only a refuge for `mainland' Chinese but a destination that encourage the growth of a true Chinese middle and educated class that now inherits that `western' imperialistic generated wealth and relative democracy. Our `western' concerns and doubts of this, the first hand-over of free millions to a Communist regime, are not yet stilled and Jan Morris in her excellent book, outlines the historical roots that will eventually confirm the reality of the new `eastern\" Hong Kong."}, {"review_sentiment": 5.0, "review_text": "In this book, Jan Morris accounts Hong Kong's past and present concisely.  This is a product of Jan Morris' accumulated years of intelligent perception and understanding of Hong Kong's history, culture, politics. Filled with quick-witted humor and details only perceived by someone who had travelled there, this book is entertaining and enlightening to read."}, {"review_sentiment": 4.0, "review_text": "At least one of the reviewers on this list was unkind about the book, but I think it only fails, in the manner that all single-volume histories do, by trying to cover so much in so little. I have only read the unrevised 1990 Penguin paperback and only after I had already worked in Hong Kong in the early 90's. I wish I had read it before I went there, because it would have helped me to make sense of the total assault on the senses that HK is.If you want, or need, to have more context than a guidebook will provide, this is where you will get it."}, {"review_sentiment": 4.0, "review_text": "At least one of the reviewers on this list was unkind about the book, but I think it only fails, in the manner that all single-volume histories do, by trying to cover so much in so little. I have only read the unrevised 1990 Penguin paperback and only after I had already worked in Hong Kong in the early 90's. I wish I had read it before I went there, because it would have helped me to make sense of the total assault on the senses that HK is.If you want, or need, to have more context than a guidebook will provide, this is where you will get it."}, {"review_sentiment": 2.0, "review_text": "If lace doilies could read, they'd love Jan Morris. Yes, she's a facile writer. Her sentences are at once both sinewy and elegant, and her book is rich with detail. However, reading Hong Kong by Jan Morris is like surveying the wreckage after a car bomb explodes a national archive. Miles of shelves have dumped their contents; and all the pages have been blown off their bookbindings. What remains are heaps of torched and scattered passages having little to no connection, except in catastrophic coincidence. To think of it another way, imagine learning animal husbandry by studying the floor of the butcher shop: odd scraps of meat, tangled ligaments, knotty tendons, and splattered blood. Collectively, they suggest \"animal,\" but all the meaning and life has been stripped away. No one is going to learn to raise pigs that way. Similarly, I couldn't understand Hong Kong by reading Hong Kong. Perhaps I'm too harsh. Her book was neither a terrorist act nor even a massacre. In fact, at times her flowery writing is intoxicating. Nevertheless, I got the feeling that in her mind, Morris writes to seduce William F. Buckley, Jr., and that's just sick."}, {"review_sentiment": 5.0, "review_text": "I read and re-read this book over and over again while living in Hong Kong in the late nineteen nineties, both before and after the end of British rule.I found it both an absorbing, exciting read, and a useful practical guide - I explored many parts of Hong Kong after first reading about them in this book - for example, some of the more remote peaks of the New Territories where there are wonderful hiking trails set up in British days, full of beauty and history (they are Hong Kong's best kept secret - the only antitidote for the city's overcrowding).  Also, the author's description of the ceaseless (aargh!) jack-hammering in urban areas is almost poetic (every expat's nightmare).Her description of Western expatriate life is informative and amusing - and accurate - some expats resent this kind of blunt description!  Her account of the Chinese population must not be missed as she goes into great detail of the sad and poignant refugee movement that sent millions of Chinese fleeing into Hong Kong from mainland China to become the city's residents of today - if you are going to Hong Kong (or are simply interested), do take this book along, as the refugee status of the population is a very painful subject (understandably) for Hong Kong Chinese and you will here little about it in post - handover Hong Kong, but an essential element in understanding how the place ticks.Like many wonderful, accurate books about Hong Kong (Timothy Mo's the Monkey King; Paul Theroux's Kowloon Tong - read those if you like this one), Jan Morris's Hong Kong can be a painful read for some - Hong Kong's sad history of insecurity ensures that.  But the detached reader, with this book, is in for a truly enjoyable experience that will be both a wealth of information and insight.  Cracking good prose, too.  UK edition is updated to 1997."}, {"review_sentiment": 4.0, "review_text": "Two lions made of bronze guard the entrance of the old Hong Kong and Shanghai Bank building on the Bund in Shanghai. One looks cross, the other one snarls. Their paws shine from the touch of thousands of hands. Many people hope that some of the lions' power (and some of the bank's wealth) will rub off on them. The two guards of good fortune even had names once. In the 19th century, the snarler was called Stephen, and the cross lion was called Stitt in honor of their resemblance to two senior managers at the bank's offices in Hong Kong.This piece of trivia is part of the fun of reading Jan Morris's \"Hong Kong: Epilogue to an Empire\". As the subtitle suggests, the main focus of the book is on the British influence in Hong Kong. This is particularly evident in the four chapters that deal with selected periods of the history of Hong Kong: (1) the 1840s when Hong Kong was founded on a barren island as the base for British drug trafficking into China, (2) the 1880s when the colony and the British Empire were at the pinnacle of their power, (3) the 1920s when Shanghai began to eclipse the city, and (4) the 1940s when Hong Kong was occupied by the Japanese and later became the refuge for Chinese (many of them entrepreneurs from Shanghai) who fled the Communist revolution in China. The historical chapters are well-researched, and Morris enjoys elaborating on the quirks of the British in Hong Kong. The historical chapters are embedded in five chapters that take a more anecdotal look at the social, cultural, administrative, and economic aspects of life in Hong Kong. The chapter on administration is aptly named \"Control Systems\". Not surprisingly for Hong Kong, the most extensive and interesting chapter deals with business and the economy. \"Means of Support\" is a very understated title for this aspect of life in Hong Kong. It would be more fitting to call it \"Get rich quick\". Jan Morris knows how to sprinkle delightful illustrations of Chinese industriousness and entrepreneurial talent into her tale. With a smirk she revels in the \"endless variety of ingenuity, given to the world by such splendid-sounding concerns as \"the Grand Dragon Universal Sales Company, the Ever-Rich Industrial Company, or the perhaps unfortunately named Flying Junk Industrial Company Ltd.\"The book has only two shortcomings. One is the fact that most parts of the book have been written in 1987, and only minor revisions were added in 1997, just before Hong Kong became a Special Administrative Region of China. To understand today's Hong Kong, the epilogue to an empire ought to be appended by a prologue to an uncertain future. The other shortcoming is the effect of Ms. Morris's expatriate perspective on Hong Kong. Her point of view omits many aspects that shape the life of the Chinese who have always been the majority of the city's inhabitants. There is still some truth in William Somerset Maugham's observation in the 1920s: the vast majority of foreign residents has not the slightest notion what is happening among the Chinese masses. Yet, in defense of Ms. Morris I want to state that she writes about what she knows best - and that is a writer's job.Currently Ms. Morris's book is the best work about the vibrant, greedy, contradictory, and ultimately inscrutable city of Hong Kong, a place where it seems that only the temporary is permanent (except for the constant, ubiquitous noise of jack-hammers maybe), nothing is rooted and everyone is trying to move on. There is no simple denominator for this city and its inhabitants.Having lived in Hong Kong for half a year, I can recommend Jan Morris's book as an entertaining introduction to the history and character of this fascinating city. I have enjoyed her Western perspective and her sense of humor as evidenced in her illustration why the Hong Kong Chinese are opportunists of genius: \"When communal lavatories were first installed in Hong Kong, Chinese entrepreneurs took to sitting on them for so long that people were obliged to bribe them to come off.\""}]}, "authors": ["Jan Morris"], "isbn": "0679776486", "longitude": 114.1628131, "periods": ["1900s"], "title": "Hong Kong", "word_cloud": "outdated tedious inaccurate romantic drivel think useful guide visitor resident give great history former british write turnover however leave desire know transpire suppose rating give due simple fact hope someone extends write bring interested date new role world deal financial center world sadden think probably destroy ambiance wonderful city however people go fast cantonese language first greatly enjoy classic world greatest travel writer tour force really give sense colonial somewhat disjointed approach oblige single volume grow concerned balance leave first year basically survive opium trade know pig trade peasant worker area british keep wait hear activity basic life colony great company hardly touch mention pig trade opium basically revolve description beautiful highly polished opium clipper race somewhere coast such analytical hole automatically bias balanced analysis history tend confirm regard many academic circle well description basic culture good job describe british colony inherent greed conceit racism study colonialism detail also variety racism find seem worst however chinese make population remain mysterious superstitious mass stereotype repeatedly cheerful energetic ingenious something suspicious repetition first think speak always felt anyone speak local language get involve writing culture link vague meandering make pretty strong judgment history british contribution feel parasite many characterize rather give much get true certainly proven well feel spite many fault basically govern colony well ultimately leave honorably even wait till last minute offering form democratic alternative authoritarian rule argument also seem terribly weak rather underline right last minute busy feather nest golden definitive rather begin old self serve british colonial genre sun set not likely year recent excellent historical portrait lead review also stimulate review complain reflect perspective give write create westerner decline pearl creator return territory teeming million back unprecedented action former perspective perfectly quote note author review approach subject student british imperialism note superb decade refuge chinese destination growth true middle educate class inherits imperialistic generate wealth relative democracy concern doubt first free million regime yet still excellent outline historical root eventually confirm reality new account past present concisely product accumulate year intelligent perception understand history culture politics fill humor detail perceive someone travel entertain enlighten least reviewer list think fails manner history try cover much little unadvised paperback already work early wish go sense total assault sens want need context guidebook provide least reviewer list think fails manner history try cover much little unadvised paperback already work early wish go sense total assault sens want need context guidebook provide lace doily facile writer sentence sinewy elegant rich detail however read survey wreckage car bomb explode national archive shelf dump content page blow bookbinding remain heap torch scattered passage little connection catastrophic coincidence way imagine learn animal husbandry study floor butcher shop odd scrap meat tangle ligament knotty tendon splatter blood collectively suggest animal mean life strip away one go learn raise pig way similarly read perhaps harsh neither terrorist act even massacre fact time flowery write intoxicate get feel mind write seduce sick live late nineteen ninety end british find absorb excite useful practical guide explore many part first read example remote peak wonderful hiking trail set british day full beauty history best keep secret antidote city overcrowding also author description ceaseless aargh urban area almost poetic expat nightmare description life informative amuse accurate expat resent kind blunt description account chinese population miss go great detail sad poignant refugee movement send million chinese flee mainland become city resident today go simply interested take refugee status population painful subject understandably little post handover essential element understand place many wonderful accurate painful sad history insecurity ensure detach truly enjoyable experience wealth information insight good prose edition update lion make bronze guard entrance old building look snarl paw shine touch thousand hand many people hope lion power bank wealth rub guard good fortune even name century snarlier call cross lion call honor resemblance senior manager bank office piece trivia part fun read subtitle suggest main focus british influence particularly evident chapter deal select period history found barren island base british drug traffic colony pinnacle power begin eclipse city occupy japanese later become refuge many entrepreneur flee communist revolution historical chapter enjoy elaborate quirk british historical chapter embed chapter take anecdotal look social cultural administrative economic aspect life chapter administration aptly name not surprisingly extensive interesting chapter deal business economy understate title aspect life fit rich quick know sprinkle delightful illustration chinese industriousness entrepreneurial talent tale smirk revel endless variety ingenuity give world concern sale perhaps unfortunately name shortcoming fact part write minor revision add become special administrative today epilogue empire prologue uncertain future shortcoming effect expatriate perspective point view omit many aspect shape life always majority city inhabitant still observation vast majority foreign resident slightest notion happen chinese mass defense want state writes know best writer best work vibrant greedy contradictory ultimately inscrutable city place seem temporary permanent constant ubiquitous noise maybe nothing root everyone try move simple denominator city live half year recommend entertain introduction history character fascinate city enjoy perspective sense humor evidence illustration chinese opportunist genius communal lavatory first instal chinese entrepreneur take sit long people oblige bribe come", "genres": ["Travel Writing"], "summary": "In its last days under British rule, the Crown Colony of Hong Kong is the world’s most exciting city, at once fascinating and exasperating, a tangle of contradictions. It is a dazzling amalgam of conspicuous consumption and primitive poverty, the most architecturally incongruous yet undeniably beautiful urban panorama of all.\r\n\r\nWorld renowned travel writer Jan Morris offers the most insightful and comprehensive study of the enigma of Hong Kong thus far.", "asin": "0679776486", "rank": "692507", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/51OT%2BxWQkmL.jpg", "country": "China", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}