{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 20, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I love reading about Brazil and Samba and I really enjoyed this book."}, {"review_sentiment": 5.0, "review_text": "Love this book. Read it MANY years ago when Dona Zica was still alive.  I'm a VERY active member of the Mangueira samba school and work with and talk to many of the people she talks about in this book. They said they remember her living in Mangueira and writing this book.  I've looked for a Portuguese translation to give to them, but can't find any.  Does ANYONE know if this book has ever been published in Portuguese?  I am thinking about translating parts of it where they are mentioned so they can read what was written about them. Especially Dona Neuma's daughters, Chininha and Guezinha.... What a tribute to them and their mother!"}, {"review_sentiment": 5.0, "review_text": "It took me all these years to review this book, but it recently came to mind (I anticipate traveling to stay with a branch of my family tree I've never met before) and suddenly Samba is on my must re-read list. It's fabulous — even now I get chills thinking about it, and I haven't read it for years.But now that I've brought it to mind, you can bet it's on my re-read list. The most amazing thing is Guillermoprieto's kicker — what writers call it when you've got just the perfect anecdote or quote or image or whatever it is that leaves readers slack-jawed. Because by the end she was already writing at such a fever pitch that I couldn't see how she could possibly out-do herself. But she did. Meanwhile, no need for me to repeat the (positive) insights of other reviewers — they're right-on."}, {"review_sentiment": 5.0, "review_text": "Great."}, {"review_sentiment": 5.0, "review_text": "I like samba"}, {"review_sentiment": 4.0, "review_text": "Good product. Would recommend buying it if this is what you need."}, {"review_sentiment": 2.0, "review_text": "I was required to read this for a class, and it was honestly a waste of time. It's high on poorly written \"flavor\" and low on actual factual meat. A book that was simultaneously torture to read and not particularly informative. Unless you have to, like me, find another book on this subject."}, {"review_sentiment": 2.0, "review_text": "If you're into the history of favelas and Samba in brazil, probably a great read for you.  i had to read it for school, and while i loved the class, did not love the book.  A little to scatter-brained for me."}, {"review_sentiment": 4.0, "review_text": "The title of the book \"Samba\" (either picked by the author or by the publisher for marketing purposes) is misleading.  The book has nothing significant about Samba, music or dance.  (For example, one of the very few Samba dance descriptions is of a couple coming from an affluent beach neighborhood to a rehearsal, where the male dancer kept rubbing his neck against the female dancer c...).However, the book presents realistic life in a Rio favela and centered on preparations of one of the most famous samba schools for the carnival, from the point of view of a high class Mexican (American comparable) talented journalist.  The author moved to live in a favela for short periods, with a luxury apartment and maid in the rich part of the city to escape to frequently.  The result is one of a few books that describe life of the lowest Brazilian class in a Rio favela.  The misery, drug culture, fatalism, lawlessness, male dominance, and the joy of the preparations for the few happy days of the year during the carnival, which the author followed through, until the last minute before the climax, the parade that she could only see briefly from afar but not participate, due to what appears to be a nervous breakdown."}, {"review_sentiment": 2.0, "review_text": "As a student who had to read this book for a class and think critically about it in terms of Anthropology and race, this book was a pain to sludge through. The writer's style is very ambiguous and confusing at times. With that said I did like the topic but I believe there are better books out there. I have no idea how to analyze this book for an essay!"}]}, "authors": ["Alma Guillermoprieto"], "isbn": "067973256X", "longitude": 0.0, "periods": ["1900s"], "title": "Samba", "word_cloud": "love read really enjoy year ago still alive very active member school work talk many people talk say living write look portuguese translation ever publish portuguese think translate part mention write daughter tribute mother take year recently come mind anticipate travel stay branch family tree never meet suddenly fabulous even get chill think bring mind bet list amazing thing kicker writer call get perfect anecdote quote image leave reader end already write fever pitch possibly meanwhile need repeat positive insight reviewer great like good product buy need require class honestly waste time high poorly write flavor low actual factual meat simultaneously torture particularly informative find subject history faves brazil probably great school love class little title pick author publisher marketing purpose mislead nothing significant music dance example dance description couple come affluent beach neighborhood rehearsal male dancer keep rub neck female dancer c present realistic life fa vela center preparation famous school carnival point view high class mexican comparable talented journalist author move live fa vela short period luxury apartment maid rich part city escape frequently result describe life lowest brazilian class fa vela misery drug culture fatalism lawlessness male dominance joy preparation happy day year carnival author follow last minute climax parade briefly afar due appear nervous student class think critically term race pain sludge writer style ambiguous confuse time say like topic believe better idea analyze essay", "genres": ["Memoir", "History"], "summary": "Carnival-time Rio in 1988, the centennial of the abolition of slavery in Brazil. The author spent a year in the Mangueira favela, and joined its famous samba school.\r\n\r\nFor one year, Alma Guillermoprieto lived in Manguiera, a village near Rio de Janeiro, to learn the ritual of samba - the sensuous song and dance marked by a rapturous beat - and to take part in Rio's renowned carnivale parade.", "asin": "067973256X", "rank": "956616", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/51dIxgjMGoL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}