{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 262, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "A very good and detailed look at the Vietnam from the perspective of Vann, however his feet of clay."}, {"review_sentiment": 5.0, "review_text": "Just as advertised!!"}, {"review_sentiment": 5.0, "review_text": "I consider this a seminal work about the early history of the Vietnam War.It goes into detail about the whys and hows of early attempts to help the South fight its own war and the slow takeover of the effort by the Americans.The books focus is John Paul Vann,a soldiers soldier.He is personally fascinating and a man for his time.An excruciatingly long but thorough work."}, {"review_sentiment": 5.0, "review_text": "The Best Military History book I have ever read. Riveting with incredible details and insights. How could Vietnam have ever happened? This book explains it. The message to me was to not ever let government get too big as it almost invariably turns into a stupid, self serving, self aggrandizing and inhuman bureaucracy. For Vietnam to happen there had to be the enmeshment of Naive government bureaucracy with Military bureaucracy. As I understand it  Gen. Westmoreland had the idea that the war would be won by a process of attrition of the North Vietnamese forces. So all the military action seemed to have as its GOAL FINDING the enemy in the Jungle (which was quite difficult) and not letting the enemy Surprise you in the jungle (not very easy.) I salute all the brave American heroes who did the best they could  for their fellow servicemen under the terrible circumstances."}, {"review_sentiment": 5.0, "review_text": "The Go To Book about the Vietnam War."}, {"review_sentiment": 5.0, "review_text": "Disturbing rememberences of a time I trusted my leaders. Not enough John Paul Vann. He was a real warrior."}, {"review_sentiment": 5.0, "review_text": "bright"}, {"review_sentiment": 5.0, "review_text": "Bought for class. Good read."}, {"review_sentiment": 5.0, "review_text": "You could stack the literature generated by the French and US Vietnam wars - mostly good, often excellent - high and wide on a very large table, the four legs of which would, in my opinion, consist of Hell In A Very Small Place (Bernard Fall), Vietnam (Stanley Karnow), Death In The Ricefields (Pierre Scholl-Latour), and Bright Shining Lie. Apologies to Bao Ninh, whose brilliant \"Sorrow Of War\" merits equal billing, but its modest size would cause structural malfunction if it were to replace one of the four monsters. \"Bright Shining Lie\" is the longest of the lot, and its 800 pages are not for the faint-hearted, though neither were the deeds and words of the mercurial, brilliant, brave, reckless, flawed John Paul Vann, both of which Neil Sheehan covers and contextualises so brilliantly. In our instagram age in which men and women of power have their private lives dragged onto the global stage with theatre liights ablaze, Vann's poor treatment of his first wife and family, and of his subsequent Vietnamese and other paramours, would have done for him well before he co-authored (with Fred Weyand) the military defeat of the Viet Cong in the Tet Offensive of 1968, and the defeat of the North's regular army at Kontum in May 1972. It is a credit to Sheehan that his gripping narrative causes the reader to will Vann to succeed knowing full well that those successes served merely to delay the inevitable and prolong the agony. However it is the history of the early years of the US' ill-starred intervention, during Kennedy's \"advisory\" period and well before the general slaughter of the Johnson and Nixon eras, that the insitutional arrogance, inflexibility and dishonesty of the US military establishment of the time, and the monstrous corruption of its Saigon clients, is mercilessly exposed by Vann's incisive, courageous and hands-on approach to a cause in which he never ceased to believe. The chapter devoted to the January 1963 battle of Ap Bac and its momentous consequences serves both as warning to, and ultimately parable for, the US's entire tragic fourteen year experience. With the benefit of hindsight it would be easy to criticise Vann for not advocating total withdrawal after Ap Bac, however to do so would be to under-estimate just how his generation of bright, patriotic, optimistic American junior and middle-ranking serviceman and journalists covering the war believed in all sincerity that their cause was both just and worth persevering with. After Tet the reader is entitled to be more judgmental. Vann evidently came to terms with the Saigon establishment's venality, and the conclusion we are invited to draw is that because he had so much invested in the war, professionally and personally, his moral compass drifted as his sole aim became its continuation, with himself as one its shining stars, which in military terms he certainly was. His apparent betrayal of his friend and confidant Daniel Ellsberg (Pentagon Papers) does not make pretty reading. That his unexpected and seemingly karmic death (a narrative highlight) was welcomed by Hanoi with an outpouring of vitriol and barely concealed relief, is testament to the unlikely story of how the illegitimate child of a prostiture from a poor southern family rose to become one of the finest military leaders of the late 20th century. Graham Greene wrote of Vietnam in The Quiet American, \"whatever you are looking for, you will find here\". John Vann surely found what he was looking for."}, {"review_sentiment": 5.0, "review_text": "A sweeping, first person account of America’s early years in Vietnam through the life of a key American.  Non-fiction reads like fiction.  Fast paced chronicle by reporter recognized for his seminal work."}]}, "authors": ["Neil Sheehan"], "isbn": "0679724141", "longitude": 0.0, "periods": ["1900s"], "title": "A Bright Shining Lie: John Paul Vann and America in Vietnam", "word_cloud": "good detailed look perspective however foot clay just advertise consider seminal work early history go why hows early attempt help fight war slow takeover effort focus soldier personally fascinate man excruciatingly long thorough work best military history ever rivet incredible detail insight ever happen explain message ever government big almost invariably turn stupid self serve aggrandize inhuman bureaucracy enmeshment naive government bureaucracy bureaucracy understand idea war attrition vietnamese force so military action seem enemy quite difficult let enemy jungle easy salute brave american hero best serviceman terrible circumstance disturb remembrance time trust leader not enough real warrior class literature generate french war mostly good often excellent high wide large table leg opinion brilliant merit equal billing modest size structural malfunction monster longest lot page deed word mercurial brilliant brave reckless flaw cover contextualizes brilliantly instagram age men woman power private life drag global stage theater light ablaze poor treatment first wife family subsequent vietnamese paramour do well military defeat defeat regular army credit grip narrative cause know full well success serve merely delay inevitable prolong agony however history early year intervention advisory period well general slaughter eras institutional arrogance inflexibility dishonesty military establishment time monstrous corruption client mercilessly expose incisive courageous approach cause never cease chapter devote battle momentous consequence serve warn ultimately parable entire tragic fourteen year experience benefit hindsight advocate total withdrawal however generation patriotic optimistic american junior serviceman journalists cover war believe sincerity cause persevere entitle judgmental evidently come term establishment venality conclusion invite draw much invest war professionally personally moral compass drift sole aim become continuation star military term certainly apparent betrayal friend confidant make pretty reading unexpected seemingly karmic death narrative highlight welcome outpouring vitriol barely conceal relief testament unlikely story illegitimate child prostitute poor southern family rise become finest military leader late century write quiet american look find surely find look sweeping first person account early year life key american read fiction pace chronicle reporter recognize seminal work", "genres": ["Biography", "History", "Politics"], "summary": "Selected by the Modern Library as one of the 100 best nonfiction books of all time\r\n\r\nIn this magisterial book, a monument of history and biography that was awarded the National Book Award and the Pulitzer Prize for nonfiction, renowned journalist Neil Sheehan tells the story of Lieutenant Colonel John Paul Vann–\"the one irreplaceable American in Vietnam\"–and of the tragedy that destroyed that country and the lives of so many Americans.\r\n\r\nOutspoken and fearless, John Paul Vann arrived in Vietnam in 1962, full of confidence in America's might and right to prevail. A Bright Shining Lie reveals the truth about the war in Vietnam as it unfolded before Vann's eyes: the arrogance and professional corruption of the U.S. military system of the 1960s, the incompetence and venality of the South Vietnamese army, the nightmare of death and destruction that began with the arrival of the American forces. Witnessing the arrogance and self-deception firsthand, Vann put his life and career on the line in an attempt to convince his superiors that the war should be fought another way. But by the time he died in 1972, Vann had embraced the follies he once decried. He went to his grave believing that the war had been won.\r\n\r\nA haunting and critically acclaimed masterpiece, A Bright Shining Lie is a timeless account of the American experience in Vietnam–a work that is epic in scope, piercing in detail, and told with the keen understanding of a journalist who was actually there. Neil Sheehan' s classic serves as a stunning revelation for all who thought they understood the war.", "asin": "0679724141", "rank": "35796", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/41wd34zzaZL.jpg", "country": "Hanoi", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}