{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 114, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Brilliant exploration of the intersections of race and gender and living in a world where who \"makes it\" and who doesn't can be the result of how well and how lucky one is at playing the game.  Baldwin's narrative masterfully weaves together a tale that seamlessly moves from events in the past to the present and from characters' back stories in such a way that the reader never gets lost.  The narrative captures the imagination and yet, manages to examine the nature of relationships and money and race in a philosophical manner that never gets preachy or that takes away from or feels misplaced in the story."}, {"review_sentiment": 5.0, "review_text": "Another Country is a very powerful read, both gut wrenching and heart warming. It’s not a book to simply skim through...I read every moving moment. If you’re looking for something tough and thoughtful, give it a chance...you won’t be disappointed."}, {"review_sentiment": 4.0, "review_text": "Prescient.  It is almost eerie to read this today, now, where we are just catching up with Baldwin.  He articulated it so well, so long ago."}, {"review_sentiment": 1.0, "review_text": "This definitely serves its purpose.  I love both its work and appearance.  I have to remember this store, if need, I will come back again.  Very good customer services  A perfect solution  I am so glad I made a right choice"}, {"review_sentiment": 5.0, "review_text": "It's a heavy read, but it amazing how much though time moves on how things stay the same. Great book!"}, {"review_sentiment": 5.0, "review_text": "EVERYONE needs to read this book! James Baldwin's prose will make you cry and laugh at the same time."}, {"review_sentiment": 5.0, "review_text": "Great book!"}, {"review_sentiment": 5.0, "review_text": "Love Baldwin's writing style because he opens your mind to different perspectives.Another Country seeks to bring understanding to those who are often most misunderstood. Gay men, black women and adulterous wives, those societies tend to hate the most, the people who are often only understood by one another. I would recommend the book for open minds; it is a passionate novel that vocalizes the agony of being different."}, {"review_sentiment": 1.0, "review_text": "Wut."}, {"review_sentiment": 5.0, "review_text": "Mr. Baldwin provides not only a history of this time period but also provides the reader a very s strong look into each character"}]}, "authors": ["James Baldwin"], "isbn": "0679744711", "longitude": 0.0, "periods": ["1900s"], "title": "Another Country", "word_cloud": "brilliant exploration intersection race gender living world make result well lucky playing game narrative masterfully weave together tale seamlessly move event past present character back story way never get lose narrative capture imagination yet manage examine nature relationship money race philosophical manner never get preachy take away feel misplace story powerful gut wrench heart warm simply skim move moment look something tough thoughtful give chance disappoint prescient almost eerie today catch articulate well long ago definitely serve purpose love work appearance remember store need come back very good customer service perfect solution glad make right choice heavy amaze much time move thing stay everyone need prose make cry laugh time great write style open mind different seek bring understand often misunderstood men black woman adulterous wife society tend hate people often understood open mind passionate vocalizes agony different wu provide history time period also provide strong look character", "genres": ["Fiction & Literature"], "summary": "Set in Greenwich Village, Harlem, and France, among other locales, Another Country is a novel of passions--sexual, racial, political, artistic--that is stunning for its emotional intensity and haunting sensuality, depicting men and women, blacks and whites, stripped of their masks of gender and race by love and hatred at the most elemental and sublime. In a small set of friends, Baldwin imbues the best and worst intentions of liberal America in the early 1970s.", "asin": "0679744711", "rank": "34427", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41fBj2ig4KL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}