{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 50, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": ".... of life in post-World War II Greenwich Village by one of the true giants of The New York Times and its incomparable book critic!!"}, {"review_sentiment": 5.0, "review_text": "A great memoir and time-piece of post-war bohemian Greenwich Village now sadly gone, where you could literally run into the likes of W.H. Auden."}, {"review_sentiment": 2.0, "review_text": "Didn't care about his sexual experiences. Was very disappointed. I grew up in NY and used to hang out in the Village in late 60's and 70s. I had read a review of this book when it first came out and had it on my list for years. Wished I had read some online comments. I thought the story was very self absorbed and not well written. I did see when I finished he kind of left this story hanging and wrote about his illness leading up to his death."}, {"review_sentiment": 4.0, "review_text": "Great depiction of a place and time in NYC that is worth remembering.  Broyard is an extraordinary writer."}, {"review_sentiment": 2.0, "review_text": "needed more anecdotes"}, {"review_sentiment": 4.0, "review_text": "A very enjoyable read, captures the feel of the time well..."}, {"review_sentiment": 4.0, "review_text": "His writing about life in Greenwich Village in the sixties is crisp, incisive and poetic. He crafts the story according to the ruling ennui of that mist fascinating decade in a par of New York at the heart of that momentous cultural shift."}, {"review_sentiment": 4.0, "review_text": "Would have enjoyed learning more about the post-war Village and less about the author. But extremely well written. Broyard was an excellent writer."}, {"review_sentiment": 4.0, "review_text": "Excellent reading. Would obviously prefer it be longer but won't elaborate out of respect for its prospective readers. Insightful, highly engaging account of a city's romance long under-appreciated today."}, {"review_sentiment": 5.0, "review_text": "Wonderful book. I'm sorry it ended so soon. I wanted more. I'm sorry he died before he could return to the Village."}]}, "authors": ["Anatole Broyard"], "isbn": "0679781269", "longitude": 0.0, "periods": ["1900s"], "title": "Kafka Was the Rage: A Greenwich Village Memoir", "word_cloud": "life true giants incomparable critic great bohemian sadly go literally like sexual experience disappoint grow use hang late review first come list year wish online comment think story self absorb well write see finish kind leave story hang write illness lead death depiction place time remember extraordinary writer need anecdote enjoyable capture feel time well write life sixties crisp incisive poetic craft story accord rule ennui mist fascinate decade par heart momentous cultural shift learn author extremely well write excellent writer excellent reading obviously prefer longer respect prospective reader highly engage account city romance long today wonderful sorry end soon want sorry die", "genres": ["Memoir", "History"], "summary": "What Hemingway's A Moveable Feast did for Paris in the 1920s, this charming yet undeceivable memoir does for Greenwich Village in the late 1940s. In 1946, Anatole Broyard was a dapper, earnest, fledgling avant-gardist, intoxicated by books, sex, and the neighborhood that offered both in such abundance. \r\n\r\nStylishly written, mercurially witty, imbued with insights that are both affectionate and astringent, this memoir offers an indelible portrait of a lost bohemia.", "asin": "0679781269", "rank": "228428", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51p%2BMB9ElGL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}