{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 34, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Peter Carey does not write bad reads, all his work is phenomenal"}, {"review_sentiment": 3.0, "review_text": "Not going to be a fan"}, {"review_sentiment": 5.0, "review_text": "Review about a film, when it was the book I puchased, but that's how Amazon wants it, sure, no problems, I've seen the film and read the book.The book is great, the film is great.Only the ending of the film is different from the book."}, {"review_sentiment": 4.0, "review_text": "Book arrived in a decent amount of time and is is a big worn, but expected for a well loved book. Thanks."}, {"review_sentiment": 4.0, "review_text": "beautiful writing but some of the foreign terms were confusing"}, {"review_sentiment": 5.0, "review_text": "I read this book as part of a class assignment in high school some 25+ years ago. It remains one of my all-time favorite books, with Carey's unique combination of wit, irony, heart, and humor.  This is a spectacular, compelling, thought-provoking read and includes one of the greatest \"love letters\" of all time.  I cannot fathom why it's not higher up in the canon of great modern literature."}, {"review_sentiment": 5.0, "review_text": "This is a beautifully written novel . You will fall in love with Honey Barbara and Harry Joy, and won't be able to,stop reading"}, {"review_sentiment": 4.0, "review_text": "Quite a strange book. A story that is obscure yet compelling, extreme and even seedy in parts.Not every persons type of book mainly because it is so unusual in the story line. Shows the most base of human nature.The book shows that affluence is not everything and that many of us are suffering from affluence."}, {"review_sentiment": 4.0, "review_text": "Great read, unusual characters. I was a little disappointed with the ending. Seemed a bit weak and a little rushed."}, {"review_sentiment": 5.0, "review_text": "An oldie but a goodie. A great read. Deserves to be read in summer holidays, in a shaded garden with a glass of good sav blanc."}]}, "authors": ["Peter Carey"], "isbn": "0679767193", "longitude": 0.0, "periods": ["1900s"], "title": "Bliss", "word_cloud": "write bad read work phenomenal not go fan film purchase want sure problem see film great film end film different arrive decent amount time big worn expect well loved thanks beautiful write foreign term confuse part class assignment high school year remain favorite unique combination wit irony heart humor spectacular compelling include greatest love letter time fathom higher canon great modern literature beautifully write fall able reading quite strange story obscure yet compel extreme even seedy person type mainly unusual story line base human show affluence everything many suffer affluence unusual character little disappointed end bit weak little rush oldie foodie great summer holiday shade garden glass good sac blanch", "genres": ["Fiction & Literature", "Humour"], "summary": "Bliss is the first novel by Australian writer Peter Carey. Published in 1981, the book won that year's Miles Franklin Award.\r\n\r\nWritten as a dark, comic fable, the story concerns an advertising executive, Harry Joy, who briefly 'dies' of a heart attack. On being resuscitated, he realizes that the life he has previously drifted amiably through is in fact Hell – literally so to Harry. His wife is unfaithful with his partner. His son is selling drugs, and his daughter is a communist selling herself to buy them. In one of the novel's more shocking scenes, glimpsed through a window, incest occurs.\r\n\r\nRedemption comes in the form of Honey Barbara – a pantheist, healer and prostitute. In the words of the book's blurb \"Honey is to Harry as Isis is to Osiris. Together they conquer Hell and retire to the forest where their children inherit the legend of paradise regained.\" But Harry must die for a second time to be truly saved.\r\n\r\nWikipedia", "asin": "0679767193", "rank": "1081185", "city": "Yandina", "image": "https://images-na.ssl-images-amazon.com/images/I/51kf3X%2BZ6AL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}