{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 73, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "A good mystery intertwined with an interesting look at neighborhoods in Venice.  Get a flavor of Venice tourists don't see.  Interesting"}, {"review_sentiment": 3.0, "review_text": "Loved the descriptions of Venice. Having visited a few times, I could almost picture the setting of every scene and event, and during the course of the novel, events take place in nearly every part of the city and the other islands in the lagoon.  The plot, however, was just so-so.  I kind of lost interest about half way through."}, {"review_sentiment": 3.0, "review_text": "I'm a belated reader of the highly praised Michael Dibdin series of Aurelio Zen mysteries, and this is my third go at them. Sad to say, I'm liking them less and less. \"Ratking,\" the first, was highly promising with its pile-up of Italian duplicities, vivid setting (the Umbrian hill town, Perugia) and my initial encounter with the intriguing, barely scrutable Zen of the Roman police force. I savored Dibdin's careful, unhurried approach to his intricate tale and I was eager to find out whether its protagonist had anything like a moral center. I jumped into Book 2, \"Vendetta,\" and came away further intrigued. But having finished Book 4 (I skipped the 3rd one), I'm disinclined to venture further. The problem is Zen. Here, he's back in his hometown, Venice, and all sorts of mysterious doors into his past are opening to provoke tantalizing questions about just who this bad-tempered, self-involved, cold fish of a detective really is. The forthcoming answers are not encouraging. Badly scarred knight-errants have been a mainstay of this sort of fiction since the dawn of the genre, leading us past character flaws with their uncommon wit, perspicacity, courage and basic sense of decency in a highly indecent world. Zen, apparently, has none of these qualities. Saturnine of manner, he's amoral to the core, unshaken by the truly hideous death he brings to a fellow cop, icily unemotional when he learns he has driven his best childhood friend to suicide.  Perhaps the Zen of subsequent books becomes someone to care about. But by the time I reached the dead end of \"Dead Lagoon,\"  I'd decided I wouldn't stick around to find out."}, {"review_sentiment": 3.0, "review_text": "A little slow but a fill in time read."}, {"review_sentiment": 2.0, "review_text": "I really hate to comment on this Author, because this book did not give me what I wanted or what I was looking for. Coming from the PBS presentation of three of this writers' books, Vendetta, Cabal and Ratking I was looking for that kind of reading and it did not happen.I brought this book to read while on vacation and it did not work for me. Now, this is not to say that the author or the book is no good, however I was expecting a different experience, perhaps like the PBS experience and did not get that."}, {"review_sentiment": 5.0, "review_text": "I am really 'stuck' in Michael Dibdin's book Dead Lagoon because I don't want to leave Dibdin's enticing prose - or the city of Venice. So I am reading the novel through for the second time and slowly savoring each sentence as I go."}, {"review_sentiment": 5.0, "review_text": "Great service. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "Dibdin and his creation Zen are my favorits, so I'm partial. Answering the questons about the plot, mood ant the pace is pointless from my point of view."}, {"review_sentiment": 4.0, "review_text": "Aurelio Zen, a Venetian born detective working out of Rome, has returned to his native city under a pretense---which when he visits the local police station, turns out to be a case no one wants to waste time with---that of a crazy contessa, a next door neighbor of his mother, and his former baby sitter, who is being harassed by ghosts.  But the real reason he's there is that a wealthy American family is paying him under the table to find out what happened to the family breadwinner, who disappeared from his Venetian island fortress.  The reader realizes what has happened to Mr. Durridge (an Americanized version of his Slavic surname) within the first few pages, but it takes Zen a while to get there.  The Contessa turns out to be a real piece of work.  Everyone thinks she's crazy, driven over the edge a half century earlier when her young daughter disappeared in the waning days of WW2.  She's actually gotten closer to the truth than anyone will give her credit for, but the Truth of Rosetta's disappearance is more shocking still.  The Contessa is a formidable woman though, allowing her imagination to protect her sanity and survive.That all contrasts with Aurelio Zen, who has to be one of the most dangerously inept gumshoes, ever.  Terrible judgement.  Mile-wide blind spots.  His mistress is playing him.  He gets a fellow Venetian cop murdered.  He doesn't realize that the Contessa is not nearly as crazy as even he comes to believe.  And, as if that isn't enough, the bad guys prove to be too big to take down, even in the New, Improved Italy of 1994.  So, while the novel resolves itself nicely, most of the main mysteries are left hanging, loose ends labeled and logged, and stored in the evidence locker.  Hmmm.While the story itself is engaging, the setting is even moreso.  Venice is as much of a character as any of the people in the book.  Half dead, nearly abandoned Venice;  25 deaths/4 births that year.  No jobs, exorbitant housing prices (despite over a third of the villas standing empty on the lagoon) and yet, when a local craftsman is brought to fabled New York City, he returns to proclaim that the legendary city of skyscrapers is \"...like Mestre\".  Not a compliment---even when the author quickly adds that no, New York City really isn't like Mestre.  Of course, if the reader has been to Venice, the story will resonate all the more, but don't let that get you down:  If nothing else, the book will give you an excuse to go to Venice.All in all a very fine read---so much more so as I'd just finished \"The Crow Trap\", which was the first Vera Stanhope novel---which has spawned the \"Vera\" series.  Vera didn't show up until page 228, almost half way through a very indulgent and tedious novel, with which \"Dead Lagoon\" has little in common."}, {"review_sentiment": 5.0, "review_text": "Dibdin at his best, with this installment in Zen's hometown of Venice, rather than the customary setting of Rome.."}]}, "authors": ["Michael Dibdin"], "isbn": "0679753117", "longitude": 12.3345898, "periods": ["1900s"], "title": "Dead Lagoon: An Aurelio Zen Mystery", "word_cloud": "good intertwine interesting look neighborhood flavor tourist see interest love description visit time almost set scene event course event take place nearly part city islands lagoon plot however kind lose interest half way belated highly praised series mystery third say like le le rat first highly promise italian duplicitous vivid set hill town initial encounter intrigue barely inscrutable police force savor careful unhurried approach intricate tale eager protagonist anything moral center jump come away intrigue finish skip disincline venture problem here back hometown sort mysterious door open provoke tantalize question cold fish detective really forthcoming answer encourage badly scar mainstay sort fiction dawn genre lead past character flaw uncommon wit perspicacity courage basic sense decency highly indecent world apparently none quality manner amoral core unshaken truly hideous death brings fellow cop icily unemotional learns driven best childhood friend suicide perhaps subsequent become someone care time reach end decide little slow fill time really comment give want look come presentation writer look kind reading bring vacation work now say author good however expect different experience perhaps experience get really want leave entice prose city read second time slowly savor sentence go service recommend creation favorites partial question plot mood ant pace pointless point view bear detective work return native city pretense visit local police station turn case want waste time crazy contessa next door neighbor mother former baby sitter harass ghost real reason wealthy family pay table find happen family breadwinner disappear venetian island fortress realizes happen version surname first page take turn real piece work think crazy driven edge half century earlier young daughter disappear waning day actually get closer truth anyone credit disappearance shock still formidable woman allow imagination protect sanity contrast dangerously inept gumshoe ever terrible judgment spot mistress playing get fellow venetian cop murder nearly crazy even come believe enough bad guy prove big even resolve nicely main mystery leave hang loose end label log stored evidence locker story engage set even much character people nearly abandon birth year no job exorbitant housing price third villa stand empty lagoon yet local craftsman bring fabled return proclaim legendary city skyscraper not compliment author quickly add really course story resonate let nothing else excuse fine much finish first spawn series show page almost way indulgent tedious little common best installment hometown rather customary setting", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 4/11 in the Aurelio Zen Series\r\n\r\nAmong the emerging generation of crime writers, none is as stylish and intelligent as Michael Dibdin, who, in Dead Lagoon, gives us a deliciously creepy new novel featuring the urbane and skeptical Aurelio Zen, a detective whose unenviable task it is to combat crime in a country where today's superiors may be tomorrow's defendants.\r\n\r\nZen returns to his native Venice. He is searching for the ghostly tormentors of a half-demented contessa and a vanished American millionaire whose family is paying Zen under the table to determine his whereabouts-dead or alive. But he keeps stumbling over corpses that are distressingly concrete: from the crooked cop found drowned in one of the city's noisome \"black wells\" to a brand-new skeleton that surfaces on the Isle of the Dead. \r\n\r\nThe result is a mystery rich in character and deduction, and intensely informed about the history, politics, and manners of its Venetian setting.", "asin": "0679753117", "rank": "562568", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51GrFjaACNL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}