{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 35.7032751, "ratings": {"num_ratings": 341, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Classic and painful and an almost comical representation of the plague and it's consequences. Definitely a must read for high schoolers and college students like me."}, {"review_sentiment": 4.0, "review_text": "excellent. Highly recommend."}, {"review_sentiment": 2.0, "review_text": "It's a script.  The original book isn't a script and the description doesn't say this is a script version."}, {"review_sentiment": 1.0, "review_text": "What a scam. The e-book version is incorrectly formatted, full of spacing errors, and seems to have been adapted by Franklin W. Dixon."}, {"review_sentiment": 5.0, "review_text": "Wonderful characters.  Very hard to put down"}, {"review_sentiment": 5.0, "review_text": "Riveting. I read this in one big bite. Now need to go see it produced!"}, {"review_sentiment": 1.0, "review_text": "The kindle version that is provided is formatted a play and is not the original novel. This is not stated anywhere on the page and all the paperback versions sold on the same page are the original novel. Extremely dissapointed in this."}, {"review_sentiment": 3.0, "review_text": "read this for a class. it was a very interesting read. Recommend to anyone who is interested in how the plague affected peoples lives."}, {"review_sentiment": 5.0, "review_text": "This is a very fine,very depressing tale, which i read many years ago, and rereading it impressed and depressed me again."}, {"review_sentiment": 5.0, "review_text": "gift for my son"}]}, "authors": ["Albert Camus"], "isbn": "0679720219", "longitude": -0.6492976, "periods": ["1900s"], "title": "The Plague", "word_cloud": "classic painful almost comical representation consequence definitely schooner college student excellent recommend script original script description say script version scam version incorrectly format full spacing error seem adapted wonderful character very hard rivet big bite now need produced kindle version provide formatted play original state anywhere page paperback version sell page original extremely dissapointed class interest anyone interested affect people life fine depress tale many year ago reread impress depressed gift son", "genres": ["Fiction & Literature"], "summary": "A gripping tale of human unrelieved horror, of survival and resilience, and of the ways in which humankind confronts death, The Plague is at once a masterfully crafted novel, eloquently understated and epic in scope, and a parable of ageless moral resonance, profoundly relevant to our times. \r\n\r\nIn Oran, a coastal town in North Africa, the plague begins as a series of portents, unheeded by the people. It gradually becomes a omnipresent reality, obliterating all traces of the past and driving its victims to almost unearthly extremes of suffering, madness, and compassion.", "asin": "0679720219", "rank": "14054", "city": "Oran", "image": "https://images-na.ssl-images-amazon.com/images/I/510DrjdPdZL.jpg", "country": "Algeria", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}