{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 214, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Wonderful story."}, {"review_sentiment": 5.0, "review_text": "Exquisitely written, rich in history of people and place at a critical juncture in the life of a young refugee."}, {"review_sentiment": 5.0, "review_text": "Beautiful, lyrical writing about an intimate, devastating subject -- a poet-survivor of the Holocaust in Poland who found his savior/mentor, who also saved himself through the child he rescued, as they both discovered their wings in Greece and Canada. As a writer, I found myself re-reading paragraphs simply to enjoy their loveliness."}, {"review_sentiment": 5.0, "review_text": "Wonderfully Poetic and difficult story about orphaned Jewish boy during WWII."}, {"review_sentiment": 5.0, "review_text": "Loved the language especially."}, {"review_sentiment": 5.0, "review_text": "Very good movie that lets one think about the issues."}, {"review_sentiment": 3.0, "review_text": "Not an easy read, by any stretch.  I persevered through the beginning, was determined to move on and finish.  It had its ups and downs for me.I am a person who finishes what I start, but had I known how hard it was to get through this book, I would not have started it."}, {"review_sentiment": 5.0, "review_text": "This is a very profound book."}, {"review_sentiment": 4.0, "review_text": "Will update soon, because, right now, I'm only a quarter of the way through the book.  I love the author's style and the prologue was especially compelling.  I read this part as an assignment for a creative writing class and then decided to purchase the book.  The only thing I'm not liking as much now is the slowing pace.  Anne Michaels' writing is still amazingly beautiful, so I will keep reading and hope the pace picks up again soon.  On a side note, I prefer fast-paced reads and this is not a genre I regularly read.  Bear with me here and I'll be back for a more thorough report.  Although, for now, I really recommend this book if you're looking for flowing prose and truly raw emotion."}, {"review_sentiment": 4.0, "review_text": "Insight into a Jewish boy's life."}]}, "authors": ["Anne Michaels"], "isbn": "0679776591", "longitude": -79.387207, "periods": ["1900s"], "title": "Fugitive Pieces: A Novel", "word_cloud": "wonderful story exquisitely write rich history people place critical juncture life young refugee beautiful lyrical write intimate devastate subject find also save child rescue discovered wing writer find paragraph simply loveliness wonderfully difficult story orphan jewish boy love language especially very good movie let think issue not easy stretch persevere begin determine finish ups down person finish start know hard get start profound soon right quarter way love author style prologue especially compel part assignment creative write class decide purchase thing like much slow pace write still amazingly beautiful keep read hope pace pick soon side note prefer read genre regularly back report really recommend look flow prose truly raw emotion boy life", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "A New York Times Notable Book of the Year\r\n\r\nIn 1940 a boy bursts from the mud of a war-torn Polish city, where he has buried himself to hide from the soldiers who murdered his family. His name is Jakob Beer. He is only seven years old. And although by all rights he should have shared the fate of the other Jews in his village, he has not only survived but been rescued by a Greek geologist, who does not recognize the boy as human until he begins to cry. With this electrifying image, Anne Michaels ushers us into her rapturously acclaimed novel of loss, memory, history, and redemption.\r\n\r\nAs Michaels follows Jakob across two continents, she lets us witness his transformation from a half-wild casualty of the Holocaust to an artist who extracts meaning from its abyss. Filled with mysterious symmetries and rendered in heart-stopping prose, Fugitive Pieces is a triumphant work, a book that should not so much be read as it should be surrendered to.", "asin": "0679776591", "rank": "166119", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51Sy3l7tt8L.jpg", "country": "Canada", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}