{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 35.6828378, "ratings": {"num_ratings": 79, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "This book was not a page-turner, it was meant to be savored.  The descriptions of the social mazes in pre-war Japan was very enlightening; a society that functions on manners, mores and respect for tradition.  What is expected can be stifling or it can be liberating in that both men and women savor nature, beauty and art.  The sisters had distinct personalities and didn't always behave as expected in that society.  The book is a leisurely meander into an unfamiliar world for me and I enjoyed it very much."}, {"review_sentiment": 5.0, "review_text": "Great book! Incredible picture of Japan at the outbreak of WWII. Seen through the eyes of women, you get picture of their place in country still trying to emerge from feudalism."}, {"review_sentiment": 2.0, "review_text": "Salmon Rushdie recommended it.  I don't."}, {"review_sentiment": 5.0, "review_text": "Tanizaki was considered for the Nobel Prize.  That consideration was well deserved.  This novel focuses on Japanese rituals of marital matchmaking in the years before Pearl Harbor.  The third and fourth Makioka sisters are unmarried.  The family, merchant aristocracy, is concerned because Yukiko is getting long in the tooth and they have rejected far too many suitors. In the backdrop is the invasion of Manchuria and the bombing in London and the reader knows that both the Makioka family and Japanese society will soon implode."}, {"review_sentiment": 4.0, "review_text": "A look into a declining upper class. Four sisters, four stories, four paths."}, {"review_sentiment": 5.0, "review_text": "This is the story of four sisters growing up in Osaka just before the outbreak of World War II—a time of great change from traditional Japanese ways to western-influenced ways. The upper class—its subtle gestures, language, thoughts, persuasions; ambitions—is detailed in descriptions of manners, clothing, food, celebrations. and the clash of old with new, adult with youth, and woman's roles in a male dominated society. Each daughter in the family reflects parts of the change, from the eldest Yukiko who is constantly pressed to marry so the younger sisters may also do so; to the youngest sister Taeko who reflects the western ways by wanting to dress as such and work out of the home, as well as have lovers.With a copyright of 1957, the reader knows what will occur as Germany and England and China each build barriers, armies, and turmoil—and what will be Japan's fate."}, {"review_sentiment": 5.0, "review_text": "The translation had only a few minor glitches. Usually I forgot I was reading a translation. Although it was nearly 500 pages, it was constructed with short chapters which gave it many good stopping points. I read it slowly which matched the pace of the writing. There was so much of the story in the long inner thoughts of the characters. Each sister was distinct so I had no confusion as to which one I was reading about.  Some of the descriptions were so real that I can recall them easily. The depiction of the cherry blossom festival itself was worth the price of the book.I read the book with the sad knowledge that all this (1936 - 1941) was to radically change in a very short time. The book though does not have any feeling of dread for coming events. It is a lovely book by an obviously great writer. I can see why it is considered an international classic. The book itself, a selection from Everyman's was a joy to hold. The pages are silky and there is an attached bookmark made of black ribbon. For someone who likes to immerse themselves into long story of a rather short time span with credible people caught in history, this is a perfect book."}, {"review_sentiment": 4.0, "review_text": "very enjoyable read However there are a few typos or imperfect translation/editing that can make it difficult to understand.  kind of disturbing.  otherwise very sweet read."}, {"review_sentiment": 5.0, "review_text": "Exceptional."}, {"review_sentiment": 4.0, "review_text": "The book is dense, so it was a slower read for me. If you are expected a riveting adventure, this book is not for you. But as for an insight into this era of Japan, it was fascinating. Other reviews I read noted that there's not much of a plot line, with which I agree, but that does not make their struggles any less real or intriguing."}]}, "authors": ["Junichiro Tanizaki"], "isbn": "0679761640", "longitude": 139.7589667, "periods": ["1900s"], "title": "The Makioka Sisters", "word_cloud": "meant savor description social maze enlighten society function manner more respect tradition expect stifle liberate men woman savor nature beauty distinct personality always behave expect society leisurely meander unfamiliar world enjoy much incredible picture outbreak eye woman get picture place country still try emerge feudalism recommend consider consideration well deserve focus japanese ritual marital matchmaking year third fourth unmarried family merchant aristocracy concern get long tooth reject far many suitor backdrop invasion bomb know family japanese society soon implode look decline upper class story path story grow outbreak time great change traditional japanese way way upper subtle gesture language thought persuasion detailed description manner clothe food celebration clash old new adult youth woman roles male dominate society daughter family reflect part change eldest yukiko constantly press marry younger also sister reflect western way want dress work home well copyright know occur build barrier army fate translation minor glitch usually forget read translation nearly page construct short chapter give many good stop point slowly match pace write much story long inner thought character sister distinct confusion read description real recall easily depiction cherry blossom festival worth price sad knowledge radically short time feeling dread come event lovely obviously great writer see consider international classic selection joy hold page silky attach bookmark make black ribbon someone like immerse long story rather short time span credible people catch history perfect enjoyable however typos imperfect make difficult understand kind disturb otherwise sweet exceptional dense slower expect riveting adventure insight era fascinate other review note much plot line agree make struggle le real intriguing", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "Junichirō Tanizaki’s magisterial evocation of a proud Osaka family in decline during the years immediately before World War II is arguably the greatest Japanese novel of the twentieth century and a classic of international literature. \r\n\r\nTsuruko, the eldest sister of the once-wealthy Makioka family, clings obstinately to the prestige of her family name even as her husband prepares to move their household to Tokyo, where that name means nothing. Sachiko compromises valiantly to secure the future of her younger sisters. The shy, unmarried Yukiko is a hostage to her family’s exacting standards, while the spirited Taeko rebels by flinging herself into scandalous romantic alliances and dreaming of studying fashion design in France. \r\n\r\nFilled with vignettes of a vanishing way of life, The Makioka Sisters is a poignant yet unsparing portrait of a family—and an entire society—sliding into the abyss of modernity. It possesses in abundance the keen social insight and unabashed sensuality that distinguish Tanizaki as a master novelist.\r\n\r\n“Skillfully and subtly, Tanizaki brushes in a delicate picture of a gentle world that no longer exists.” San Francisco Chronicle\r\n\r\n", "asin": "0679761640", "rank": "257250", "city": "Tokyo", "image": "https://images-na.ssl-images-amazon.com/images/I/41EGP0YbhdL.jpg", "country": "Japan", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}