{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 16, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "a very interesting book. the paper could be harder though."}, {"review_sentiment": 4.0, "review_text": "Madame Marie-Sophie Laborieux, born in the early 1900s, late in life to former slaves, Esternome Laborieux and Idoménée Carmélite Lapidaille. Long after her parents’ deaths, she founded the quarter known as Texaco in 1950, outside the city of Fort-de-France, Martinique. Texaco, owned by Texas Oil Company, had subsidiaries in South America and in the Caribbean. On Martinique, Texaco housed large tankers on land near a mangrove swamp.Prior to Madame Laborieux deciding to build on Texaco’s property, like other poor Martinicians, she inhabited a hutch on the steep slopes, known as the morne, with dirt floors. As a young woman, she lived and worked for families, as a nanny or housekeeper in the city of Fort-de-France.Middle aged, childless, and alone, Madame Laborieux no longer wanted to live on the hills feeling the heat from the fiery sun. She found land near the sea with a gentle slope, temperate winds, and the scent of herbs. This was Texaco; she thought it magical.The watchman was not enchanted with her appearance on Texaco’s grounds, nor was the owner. Madame Laborieux faced numerous expulsions from the property, but continuously returned. More families arrived and dotted the region. Like Madame Laborieux, they erected crude dwellings on stilts, made of tin, crate wood and asbestos, planted vegetables and fruit trees. Eventually the homes, although still crude, were built with bricks and cement.In 1980, the Urban Planner, known as the “Christ,” arrived to Texaco. Without electricity and plumbing, the city judged the property unhealthy and had decided to raze the area.In her own words, Madame Laborieux, provides the Urban Planner her inspiring family history, beginning with her father, Esternome Laborieux, a carpenter by trade, born a slave and freed years prior to Martinique’s abolishment of slavery in 1848. Convincingly, she changed the minds of those in authority, obtaining proper housing and utilities.The author, Martinician, Patrick Chamoiseau, taped the late Madame Laborieux to write this book. Texaco, first written in French, won the 1992 French Prix Goncourt for Texaco.Chamoiseau captured Madame Laborieux’s history replete with her father’s voice; a fascinating man. She revealed the quality of transparency and purity in her father and mother, Idoménée. And in Madame Laborieux’s own story, you felt the sensitivity, suffering, sadness, passion, loss, lovers, longing, humor, and courage. Madame Laborieux was an indomitable spirit, a woman of profound substance. No doubt, she left an indelible impression on Martinicians.I thought the run-on sentences, although at times poetic and beautifully written were sometimes annoying. This might have been due to Madame Laborieux speaking on tape, in Creole and French. I felt emotionally spent after reading the account of Madame Laborieux’s history. I gave this book four stars."}, {"review_sentiment": 5.0, "review_text": "An historical fiction, but the only one I know of which is from the perspective of a Caribbean persona. It speaks from every part of the history of the islands, from a perspective of the sea, to the beach, the streams, the old plantations, the deep valleys, the hidden mountain springs and the tops of ridges. It is not about dates or epcohs. It emphasizes and reflects the islanders in how they think, how they move. Every Caribbean person should read this book and those looking for a more actual look into one of the most historically dynamic regions of the world."}, {"review_sentiment": 3.0, "review_text": "It was a decent novel but i never would have picked it up if it wasn't for a class."}, {"review_sentiment": 5.0, "review_text": "i bought this book as part of my mphil research and the way the story is intertwined with the country's history is quite intriguing."}, {"review_sentiment": 3.0, "review_text": "Translating is a difficult thing, and I imagine it's more difficult when you're dealing with Creole and French and language itself is the theme, and no translation is ever finished... but that said... the translators make some really odd choices that make reading this book difficult. They tend to maintain what I assume to be the original Latin phrasing and cognates. I don't speak French, but I'm fluent in Spanish and translate from that language, and in this book I've run across many awkward latin-like phrasings that make me wince. Just two examples:\"It's complicated but here's the real thread: the best bearing was a skin without slavery's color.\" (71)First of all, a more natural way to say this would be \"the real thread is this\" but second and most importantly, what does \"here's the real thread\" mean? That's a metaphor that just doesn't exist in English, as far as I know. And what does \"the best bearing\" mean? I can sort of guess from context, but no one would write a sentence like that in English. Similarly, somewhere I saw a reference to someone's head as a \"pumpkin.\" Maybe that makes sense in French/Creole (it definitely makes sense in Spanish) but in English, if you want to compare someone's head to a vegetable, it's a gourd, or a melon.\"Sunday afternoon became a rite for him.\" (81)I imagine the French here is similar to the Spanish, rito... quick dictionary check says maybe \"rites\"? But you don't really say \"rite\" in English unless you're being very specific/archaic. You say ritual. Like, a Sunday-afternoon ritual. I don't want to be nit-picky, but the text is full of little things like this, and they bug me. It's up to every individual translator to what degree he or she wishes to maintain the tone of the source language, its unique metaphors, images, etc. They may have good reasons for the choices they made. It's an art, not a science. But to my taste, this translation lacks grace, and the text ends up feeling choppy and Latin."}, {"review_sentiment": 4.0, "review_text": "Reading \"Texaco\" is like taking a walk along the ocean. Sometimes the reader walks along a sandy beach and the gentle waves lap against bare toes. However, most of \"Texaco\" is similar to climbing the giant, jagged rocks along the coast while the violent waves crash around you. It's worth the work for once you climb the rocks you find the tidal pools full of treasure.Poetry. Aching, haunting poetry. Completely fascinating"}, {"review_sentiment": 5.0, "review_text": "this book feels alive in your hands. I found myself feeling almost a deficiency of life compared to the aliveness in the book. not sure i spoke clearly. read the book."}, {"review_sentiment": 5.0, "review_text": "This is the first book I've read by Chamoiseau, it reminded me of Gabriel Marquez's \"One Hundred Years of Solitude\", and is really fine literature, magical & funny, a caribbean tale of the island of Martinique.  It begins in the time of slavery on the sugar plantations and ends in more modern, corporate times.  The book's ending is surprisingly uplifting and postive.  It was hard to decide what rating to give this book - certainly it deserves the highest praise, however I have a feeling this book is much better read in its' original language.  There are footnotes throughout explaining original Creole terms used.  I would recommend this to anyone interested in Caribbean history or \"universal\" world literature."}, {"review_sentiment": 4.0, "review_text": "While I have greatly profited from the translator's hard work and I do recommend that anglophones have a copy of her English version handy; reading this book in English is like reading Faulkner or Joyce translated into French.  Again, I wish to emphasize that the translator has done a good job -- but the magic of the original pales in translation.Five stars for the original (for which Chamoiseau won the Prix Goncourt) -- available from Amazon.fr"}]}, "authors": ["Patrick Chamoiseau"], "isbn": "0679751750", "longitude": 0.0, "periods": ["1800s", "1900s"], "title": "Texaco: A Novel", "word_cloud": "interesting paper bear early late life former slave parent death found quarter know outside city own subsidiaries house large tanker land mangrove decide build property poor inhabit hutch steep slope know morn dirt floor young woman live worked family nanny housekeeper city age childless alone longer want live hill feel heat fiery sun find land sea gentle slope temperate wind scent herb think watchman enchant appearance ground owner face numerous expulsion property continuously return more family arrive dotted region erect crude dwelling stilt make tin crate wood asbestos plant vegetable fruit tree eventually home still crude build brick known arrive electricity plumb city judge property unhealthy decide raze word provide inspire family history begin carpenter trade bear slave free year prior abolishment slavery convincingly change mind authority obtain proper housing author tap late first write french french capture history replete father voice fascinate man reveal quality transparency purity father mother story felt sensitivity suffer sadness passion loss lover long humor courage indomitable spirit woman profound substance doubt leave indelible impression think sentence time poetic beautifully write sometimes annoy speak tape felt emotionally spent read account history give star historical fiction know perspective persona speak part history islands perspective sea beach stream old plantation deep valley hidden mountain spring top ridge date emphasize reflect islander think person look actual look historically dynamic region world decent never class buy part phil research way story intertwined country history quite intriguing translate difficult thing imagine difficult deal french language theme translation ever finish say translator make really odd choice make read difficult tend maintain assume original phrasing cognate speak french fluent spanish translate language run across many awkward phrasing make wince example complicate real thread best bearing skin slavery color natural way say real thread second importantly real thread mean metaphor exist far know best bearing mean sort guess context sentence somewhere saw reference someone head make sense definitely make sense spanish want compare someone head vegetable gourd melon afternoon become rite imagine french similar spanish righto quick dictionary check say maybe rite really rite english say ritual ritual want text full little thing bug individual translator degree wish maintain tone source language unique metaphor image etc reason choice make art science taste translation lack grace text end feel choppy latin read take walk ocean walk sandy beach gentle wave lap bare toe however similar climb giant jag rock coast violent wave crash worth work climb rock find tidal pool full haunting poetry completely fascinate feel alive hand find feel almost deficiency life compare aliveness sure speak clearly first remind really fine literature magical funny caribbean tale island begin time slavery sugar plantation end modern corporate time end surprisingly uplift postie hard rating give certainly deserve highest praise however feel much better original language footnote explain original term use anyone interested history universal world literature greatly profit translator hard work recommend anglophones copy english version handy read english read translate wish emphasize translator do good job magic original pale star original available", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "\"Chamoiseau is a writer who has the sophistication of the modern novelist, and it is from that position (as an heir of Joyce and Kafka) that he holds out his hand to the oral prehistory of literature.\" Milan Kundera\r\n\r\nOf black Martinican provenance, Patrick Chamoiseau gives us Texaco (winner of the Prix Goncourt, France's most prestigious literary prize), an international literary achievement, tracing one hundred and fifty years of post-slavery Caribbean history: a novel that is as much about self-affirmation engendered by memory as it is about a quest for the adequacy of its own form.\r\n\r\nIn a narrative composed of short sequences, each recounting episodes or developments of moment, and interspersed with extracts from fictive notebooks and from statements by an urban planner, Marie-Sophie Laborieux, the saucy, aging daughter of a slave affranchised by his master, tells the story of the tormented foundation of her people's identity. The shantytown established by Marie-Sophie is menaced from without by hostile landowners and from within by the volatility of its own provisional state. Hers is a brilliant polyphonic rendering of individual stories informed by rhythmic orality and subversive humor that shape a collective experience.\r\n\r\nA joyous affirmation of literature that brings to mind Boccaccio, La Fontaine, Lewis Carroll, Montaigne, Rabelais, and Joyce, Texaco is a work of rare power and ambition, a masterpiece.", "asin": "B00A2OG9TA", "rank": 0, "city": "Martinique", "image": "", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}