{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 44.8178131, "ratings": {"num_ratings": 0, "rating": 0.0}, "authors": ["Dragan Todorovic"], "isbn": "0679313966", "longitude": 20.4568974, "periods": ["2000s", "Recent Releases"], "title": "The Book of Revenge", "word_cloud": "", "genres": ["Memoir", "Travel Writing"], "summary": "A darkly comic recollection of a country that no longer exists, and a lyrical examination of the importance of taking a stand when it counts. Set against a backdrop of horrific world events, this is narrative non-fiction at its best.\r\n\r\nTo a young boy growing up poor but happy in an industrial town in Serbia, politics means many national holidays that result in parades, piglets roasting on a spit, and getting to see both his hard-working parents at the same time. An observant child, Dragan Todorovic quickly learns the power of words. Even before he can read or write, he is mesmerized by the squiggles made by the grownups around him and diligently recreates them in the notebooks he carries with him always. He also learns that reciting naughty limericks usually yields some chocolate.\r\n\r\nThis love of words eventually takes Dragan to Belgrade, as editor for a cultural magazine. He hopes to inspire and support the young and innovative artists of the time, but soon discovers that naughty articles do not yield the same results as limericks, and he finds himself constantly clashing with the system. His many questions get only one answer: he is drafted into the army. \r\n\r\nDragan survives his tour of duty, but his return to Belgrade is unsettling. Everything is changing, rapidly. Friendships are collapsing, conversations are guarded, nothing is as it seems. Bit by bit, the country he knows and loves is being torn apart.\r\n\r\nFilled with great characters and poignant and often hilarious stories, The Book of Revenge is a superb duet of a citizen and his country, a universal exploration of just what it is that inoculates the human spirit from dangerous ideologies and toxic nationalism.", "asin": "0679313966", "rank": "5670026", "city": "Belgrade", "image": "https://images-na.ssl-images-amazon.com/images/I/51HZVA7RQSL.jpg", "country": "Serbia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}