{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 22, "rating": 4.1, "reviews": [{"review_sentiment": 2.0, "review_text": "Not one of Roth's better novels....I am big Roth fan and consider him to be one of America's greatest writers;but when he writes about sex in his better books it is usually quite funny...and absorbing.Not so here ...the writing except for the first parts is dreadfully dull...and as is true of his best onesthere is an element of suspense at the outcome..this book has few of the intriguing qualitiesof his other books.This novel was written some time ago in the 1990's I think..but Roth came back to formin his later efforts with I think were 2 masterpieces...INDIGNATION....and  EVERYMANI regret him quitting writing ...a truly great talent"}, {"review_sentiment": 5.0, "review_text": "It is an amazng novel, one paragraph made me laugh, the next made me cry and this happened repeatedly."}, {"review_sentiment": 5.0, "review_text": "Great as a character piece or a fictional glimpse of the underbelly of college life by an author who surely knows from which he writes."}, {"review_sentiment": 5.0, "review_text": "Roth writing like Roth"}, {"review_sentiment": 4.0, "review_text": "Always well written and excellent character developmentbut to long and slow because ofrepeating plot line.Roth and his sex problems !!"}, {"review_sentiment": 4.0, "review_text": "Good satirical book....upstate New York/Connecticut Woody Allen style! Humerous and tragic at the same time....some passages a little confusing but altogether a good pace read!"}, {"review_sentiment": 5.0, "review_text": "Is the worst over? Are there no more terrible mistakes to make? You wish.David Kepesh was the hero of Roth's idiotic sexual satire The Breast. Now he gets reactivated as 'professor of desire', presumably as an act of rehabilitation. I admit, it worked for me. I liked this Kepesh. This is a smart and funny novel, far from the provocations of Portnoy, or the absurdity of the Breast. It is a Bildungsroman in the Roth manner.Kepesh grows up in a family of Jewish hotel owners, at the Hungarian Royale in the Catskills. His artsy interests take him to literature studies, and from upstate New York to England. David tries many things. His sexual adventures overwhelm his literary expeditions. Icelandic sagas? Sidelined by a Swedish ménage à trois, dabbling in mild SM games.Back on his professional track, now at college in California, he meets and marries a great beauty, though their prior three year relationship should have taught him otherwise. This bad decision leads David into the middle of a trashy Grade B thriller, which costs him dearly. He drops into depression and impotence, and the required shrink sessions. Until he meets a fabulous and normal woman.... Back to square one? If only our Professor of Desire didn't know himself so well. Poor man!The literary interests of Professor Kepesh are worth taking into account. After he drops out of serious interests in his early student years, later he becomes a devotee to Checkov, and then focuses on Kafka. Including a Prague trip with his fabulous woman.Would it be worthwhile to think about his life in the light of Chekhov and Kafka? The last chapter is a wonderful Chekhovian/American short story."}, {"review_sentiment": 4.0, "review_text": "Good read. Takes timne, and passion."}, {"review_sentiment": 5.0, "review_text": "Years ago the local public library that I worked for was putting some paperbacks up for sale that had been donated.  A couple of them were Philip Roth novels and as I'd heard he was a fairly important 20th century author, I snagged a handful to put in my queue.  One of them \"Goodbye, Columbus\" I eventually read but the other had such a goofy title and a cover that made the battered paperback look like something utterly tawdry that I couldn't bring my mid-twenties self to actually read it, and wound up getting rid of it somewhere.  Apparently all that manages to prove that I do judge books by their covers because years after that I wound up buying another version that has a more tasteful look, more like how a literary novel is supposed to look like to me, I guess.  Which is an interesting thing to find out about yourself.But of all the Roth novels I've read so far, this one is probably the most enjoyable on a level of pure reading.  While the title suggests that it's about the exploits of a lecherous instructor with unique ideas about what extra credit might be and the deliciously pronouncing every syllable of \"See me after class\", it's nothing like at all.  Telling the story of the college and early professor years of David Kepesh, it feels like a Roth novel before Roth figured out what a \"Roth novel\" is supposed to be like.  Thus there's little of the metatextual games he likes to play (ooh, the protagonist is also named \"Philip\", could it be a thinly disguised version of the author or what he wants us to think?) or the ideas about family and Jewish identity that crop up again and again in the Nathan Zuckerman novels.  There's not as much of a sense that he's toying with you in some respect, daring you to uncover that he really believes in all the long speeches his characters make about contrasting ideas.  Instead it's about a young man deciding if pleasure is worth it for its own sake, or if that gets old after a while, and if his sexual track record proves anything it's that being open-minded and having a little bit of confidence that open all kinds of doors into new experiences.Yet for the cheeky title and passages about sexual exploits, the novel isn't steeped in carnal humor the way some of his other novels are.  It's the characterizations that pretty much carry the day here.  Kepesh comes across as a confused young man trying to find his way in the world, and his reactions to things come across as realistic given the circumstances.  Presented with an opportunity to have relations with two hot Swedes (potentially at the same time), he makes the same choice that aren't necessarily that surprising.  The people he surrounds himself with are equally well-drawn and even when they venture into the edge of ridiculousness, it's a kind that we can relate to because it fits into the context of this world and its times.  His parents, the people he knows growing up, his roommate in college, the ladies that he attempts to romance, nobody comes across as created to strictly prove a point, but instead as characters all colliding with each other, sometimes traveling along the same road for a bit before separating.  But for all the humor involved, it's those early sections that are mostly about Kepesh's sexual escapades and discoveries that have a tendency to drag the most.  Since they aren't exactly titillating they sometimes come across as a really enthusiastic guy telling you about all the great times he had even though you may not be completely interested.However, once a degree of melancholy starts to take hold and the book starts to resemble something closer to real life, it begins to attain its own tangible pull.  For me it was around the time that he gets married and even though there's still some degree of ridiculous exaggeration going on, its toned down and the confusion and anguish of someone going through something they can't quite understand begins to take hold.  Kepesh becomes the kind of person who asks the same questions that we might, and even though he asks them in perhaps a more neurotic way, he never seems sleazy, just someone who thinks he knows what he wants until he realizes that he doesn't, and maybe never did, and then is forced to ask himself what exactly did he want then.Even the more rambling backend of the novel (there's a section that might as well be Roth's pitch to be president of the Kafka Fan Club), which seems to show him achieving a kind of bliss, or at least contentment is leavened by the lingering questions that at some point everyone in a relationship is forced to ask, whether they want to or not: is it always going to be like this, and when it isn't am I still going to be happy?  It's about knowing the difference between purely seeking pleasure and realizing that it's a moving target, always changing, much as we are.  And you can change in opposition to it, blundering forward like a desire seeking missile toward whatever you feel your goal is that particular day, or you can adapt in time with someone, and complement your own pleasures with theirs.  But for some people, especially the young, it's hard to get past the knowledge when it hits that things will change and never quite be the same again.  It's not a bad thing, but it's a testament to Roth's early skills that he can capture the paralysis of that notion and leave you wondering what your own response would be, and even maybe sympathize with another's dilemma, instead of wishing that you had their problems."}, {"review_sentiment": 4.0, "review_text": "Philip Roth is to my mind a genius of a writer. There is no one who has ever been funnier. HIs grasp of people , his description of situations are so rich, vital, comic, interesting that every page of his has its treasures  On the other hand this explorer of eroticism in extremis is somewhere far beyond my own prudish soul. This story of David Kepesh and his lusts and loves has as most of Roth's writing tremendous vitality, almost as much as the Catskill mountain tumeler he describes at the outset of the work. It has many of  the recurrent themes of  Roth's work in which the Portnoy,Kepesh Zuckerman character carries his confusion into dialogue with a psychiatrist. It of course has the most notorious Roth theme that of the lust and sexual adventures of the main character, and how these do not lead to happiness, contentment, stability of a lasting relation but rather to confusion and torment of the soul. The  same astute professional, in this case academic describes his life in teachings. Roth also is a real researcher  and brings to the reader much about worlds unknown to him. Roth also creates female characters who in one sense are tremendously attractive but in another do not bring about a 'happier ever after' world.I do not know where I would rate this book on the long list of Roth's novels, but it is certainly a book which will bring its readers must laughter, and much insight into life. Whether it will also lead to disgust and a kind of sense of having done something wrong, i.e. guilty pleasure is another question.I for  one often enjoy reading Roth while at the same time feel guilty about it."}]}, "authors": ["Philip Roth"], "isbn": "0679749004", "longitude": 0.0, "periods": ["1900s"], "title": "The Professor of Desire", "word_cloud": "not better novel big fan greatest writer write sex better usually quite funny write first part dreadfully dull true best ones there element suspense intrigue qualities of write time come back forming later effort think masterpiece regret quit write truly great talent amaze paragraph make next make cry happen repeatedly character piece fictional glimpse underbelly college life author surely know writes write always well write excellent character development but long slow of repeating plot sex problem good satirical style tragic time passages little confusing altogether good pace be worst terrible mistake make hero idiotic sexual satire now get reactivate presumably act rehabilitation admit work like smart funny far provocation absurdity grow family jewish hotel owner hungarian artsy interest take literature study upstate try many thing sexual adventure overwhelm literary expedition saga sideline swedish menage trio dabble mild professional track college meet marries great beauty prior year relationship teach otherwise bad decision lead trashy thriller cost dearly drop depression impotence require shrink session meet fabulous normal woman square know well man literary interest worth take account drop serious interest early student year later become devotee focus trip fabulous worthwhile think life light last chapter wonderful short story good time passion year ago local public library work put paperback sale donate couple novel hear fairly important century author snag handful put eventually goofy title cover make battered paperback look something utterly tawdry actually wind get rid somewhere apparently manage prove judge cover year wind buy version tasteful look literary suppose look guess which interesting thing novel far probably enjoyable level pure read title suggest exploit lecherous instructor unique idea extra credit deliciously pronounce syllable class nothing story college early year feel figure suppose little meta textual game like play ooh protagonist also name thinly disguise version author want idea family identity crop novels much sense toy respect dare uncover really believe long speech character make contrast idea instead young man decide pleasure worth sake get old sexual track record prove anything little bit confidence open kind door new cheeky title passage sexual exploit steep carnal humor way characterizations pretty much carry day come confused young man try way world reaction thing come realistic give circumstance present opportunity relation hot potentially time make choice necessarily surprise people surround equally even venture edge ridiculousness kind relate fit context world time parent people know grow roommate college lady attempt romance nobody come create strictly point instead character collide sometimes travel along road bit separate humor involve early section mostly sexual escapade discovery tendency drag exactly titillate sometimes come really enthusiastic guy tell great time even completely melancholy start take hold start resemble something closer real life begin attain tangible pull time get married even still degree ridiculous exaggeration go toned confusion someone go something quite begin hold become kind person asks question even asks perhaps neurotic way never seem sleazy someone think know want realizes maybe never force exactly want ramble backed section well pitch president seem show achieve kind bliss least contentment leaven lingering question point everyone relationship force want always go still go happy know difference purely seek pleasure realize move target always change much change opposition blunder forward seek missile feel goal particular day adapt time someone complement pleasure people especially young hard get knowledge hit thing change never quite bad thing testament early skills capture paralysis notion leave wonder response even maybe dilemma instead wish problem mind genius writer ever funnier grasp people description situation rich vital comic interesting page treasure hand explorer eroticism extremist somewhere far prudish soul story lust love write tremendous vitality almost much mountain tumbler describe many recurrent theme work character carry confusion dialogue psychiatrist course notorious theme lust sexual adventure main character lead happiness contentment stability last relation rather confusion torment soul astute professional case academic describes life teaching also real researcher brings much world unknown also create female character sense tremendously attractive bring ever know rate long list novel certainly bring reader much insight life also lead disgust kind sense do something wrong guilty pleasure often enjoy read time guilty", "genres": ["Fiction & Literature"], "summary": "As a student in college, David Kepesh styles himself \"a rake among scholars, a scholar among rakes.\" Little does he realize how prophetic this motto will be—or how damning. \r\n\r\nFor as Philip Roth follows Kepesh from the domesticity of childhood into the vast wilderness of erotic possibility, from a ménage à trois in London to the throes of loneliness in New York, he creates a supremely intelligent, affecting, and often hilarious novel about the dilemma of pleasure: where we seek it; why we flee it; and how we struggle to make a truce between dignity and desire.\r\n\r\n\r\n\"A thoughtful...elegant novel.... A fine display of literary skills.\" The New York Times ", "asin": "0679749004", "rank": "853841", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41yxlw2MW6L.jpg", "country": "London", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}