{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 33.9550905, "ratings": {"num_ratings": 42, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "DeLillo's most transformative work, marking the discovery of the aesthetic that defines his work moving forward. It's no coincidence that what follows this novel are his four most important works."}, {"review_sentiment": 2.0, "review_text": "Good bedtime book as this story of a depressed and newly separated  insurance  risk analyst will definitely put you to sleep."}, {"review_sentiment": 3.0, "review_text": "An okay book by a great writer"}, {"review_sentiment": 1.0, "review_text": "I just don't like his writing. After20 pages I gave up."}, {"review_sentiment": 5.0, "review_text": "Superb DeLillo. This prescient tale of post-modern terrorism is a harrowing descent into the mind & machinations of the terrorist psychopath."}, {"review_sentiment": 2.0, "review_text": "Characters are stuffy, bland, and unrelatable; no apparent point to the narrative. Though I really enjoyed White Noise! Maybe I'll give this another try someday, but probably not."}, {"review_sentiment": 3.0, "review_text": "This is one of those books where every sentence has a lot to say but they add up to little that is comprehensible.  There is so much narration, so much description and analysis that one loses track of who is speaking about what.  This may be considered an experiment in 1980s  metafiction in which coherence is left behind.  Not one of this excellent author's best efforts for sure."}, {"review_sentiment": 4.0, "review_text": "My second DeLillo book.  Recently read White Noise which was outstanding.  The Names was a \"little different\" but I did enjoy it.  The book focused on the subject of languages (old and new) and the importance of the written word in all of our world cultures.  Fittingly, the novel was set primarily in Athens circa 1979 (certainly not the Golden Age of Greece).  While reading the book I thought about all the history of Greece and it's importance to the modern world.  Greece today (broke and shiftless) and Greece in the age of Pericles.  What a drop off.  The well-developed characters are brought together due to their work in the Middle East.  The narrator is separated from his wife who has primary custody of his young son (a writer in the making).  The characters come together for drink and food.  Realistic portrayals and interactions of Americans in a foreign country.  Hemingwayesque characters (minus the kid) drinking and conversing. The plot is rather weak in my view and centers on a cult of murder.  An old person is senselessly murdered/bludgeoned with a hammer and this is where the plot/mystery begins.  In the course of some of the dialog there are some very meaningful and thoughtful ideas to ponder.  DeLillo, for me, is a writer who makes one think.  In this book you think about the power, significance and the importance of languages.  DeLillo is a wonderful wordsmith and it is obvious that he takes great care in the structure of his words, sentences and paragraphs.  He is well aware of the importance of words and language and he is also an idea man.  A smart guy from the Bronx.  An excellent writer.  Well done.  Mao II is on deck."}, {"review_sentiment": 5.0, "review_text": "Outstanding read!  One of my favorite novels. Incredibly underrated in Delillo's canon and overall. The Names contains breathtaking prose."}, {"review_sentiment": 2.0, "review_text": "Plotless, redundant, and over-written."}]}, "authors": ["Don DeLillo"], "isbn": "0679722955", "longitude": -83.3881868, "periods": ["1900s"], "title": "The Names", "word_cloud": "trans formative work mark discovery aesthetic defines work move forward coincidence follow important work good bedtime story depress newly separate insurance risk analyst definitely put sleep okay great writer like write page give prescient tale terrorism harrow descent mind machination terrorist psychopath character stuffy bland unrepeatable apparent point narrative really enjoy give try someday probably sentence lot say little comprehensible much narration much description analysis lose track speak experiment meta fiction coherence leave not excellent author best effort sure second outstanding little different enjoy focused subject languages old new importance write word world culture set primarily circa certainly read think history importance modern world today break shiftless age drop character bring together due work narrator separate wife primary custody young son writer make character come together food realistic portrayal interaction foreign country character minus kid drinking converse plot rather weak view center cult murder old person senselessly hammer begin course dialog meaningful thoughtful idea ponder writer make think think power significance importance languages wonderful wordsmith obvious take great care structure word sentence paragraph well aware importance word language also idea man smart guy excellent writer do deck outstanding favorite novel incredibly underrate canon overall contain breathtaking redundant", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Set against the backdrop of a lush and exotic Greece, The Names is considered the book which began to drive \"sharply upward the size of his readership\" \r\n\r\nAmong the cast of DeLillo's bizarre yet fully realized characters in The Names are Kathryn, the narrator's estranged wife; their son, the six-year-old novelist; Owen, the scientist; and the neurotic narrator obsessed with his own neuroses. A thriller, a mystery, and still a moving examination of family, loss, and the amorphous and magical potential of language itself, The Names stands with any of DeLillo's more recent and highly acclaimed works. \r\n\r\n\"DeLillo sifts experience through simultaneous grids of science and poetry, analysis and clear sight, to make a high-wire prose that is voluptuously stark.\" Village Voice Literary Supplement\r\n\r\n\"DeLillo verbally examines every state of consciousness from eroticism to tourism, from the idea of America as conceived by the rest of the world to the idea of the rest of the world as conceived by America, from mysticism to fanaticism.\" New York Times", "asin": "0679722955", "rank": "177324", "city": "Athens", "image": "https://images-na.ssl-images-amazon.com/images/I/510Ppk7fxUL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}