{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 382, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Probably the best book ever written about what it was like for American GI's serving in the Vietnam War. I read this book over 40 years ago about 1973, so I bought this copy for a friend who was wounded in Vietnam in 1966."}, {"review_sentiment": 4.0, "review_text": "An incredible view of serving in Vietnam from the constant emotional impact  and stress.  How anyone survived with their sanity intact is a miracle."}, {"review_sentiment": 5.0, "review_text": "A book written from the grunt point of view.  Having served in Vietnam, this book was spot on."}, {"review_sentiment": 4.0, "review_text": "\"Conventional journalism could no more reveal this war than conventional firepower could win it\" p218.There are very few negative reviews on this book. I think those reviewers were expecting the linear \"...landed in Saigon...gooks in the wire...as I boarded the transport back to The World\" story.Herr makes it clear he is a writer, not a reporter or historian. He is writing about the Vietnam war, not recording or reporting. Specifically he is writing about his experience as a war correspondent and not any particular unit, battle or individual. There are no footnotes that would make it \"scholarly.\" It could be called fiction but realize that fiction is not synonymous with lie. The happenings in the book happened.The opening section is titled \"Breathing In.\" I found it difficult to read because it is written as a stream of consciousness and I couldn't get the writer's voice. I had to go back and re-read each paragraph. I am going to specifically re-read the whole section. I would bet the audiobook version of this gave the voice talent fits. This section is the only reason I didn't give the book five stars and I suspect some readers give up on the book. Keep reading because the rest of the book is a home run.Many of the characters in the book are representative of actual people he encountered so you not find their names on The Wall although, in a sense, they are. The other war correspondents he encounters are actual people and stories can be followed up on with a google search.Michael Herr is a credited writer on Apocalypse Now and Full Metal Jacket. Influences from Breathing In seem to be in Apocalypse while much of the remainder of the book will spark images of Full Metal Jacket.I recommend this book. If you get hung up with Breathing In, skip to the next section. The writing on Hue and Khe Sanh is a much more 'traditional' and hard you'll find it hard to put down. The last section focuses on combat photographers and war correspondents."}, {"review_sentiment": 5.0, "review_text": "Read it twice in High School when it came out.  Blew me away.  Re-read it 10 yrs ago.  I can't say I've read better.  Just a great book, a classic. Neil Sheehan's \"A Bright Shining Lie: John Paul Vann and America in Vietnam‎\" is a runner up.A lot of the real people Herr met in Vietnam can be found in the characters like the movies Full Metal Jacket and Apocalypse Now.  He played a role in the screenplays of both.  Since Herr and his colleagues were press, they could hop all over Vietnam on choppers and witness the war with a multifaceted view.  So when you hear some revisionist Vet say I never saw that, we never did that, you can answer ya well maybe you didn't, but Herr did witness it.  You were in one unit, he was flying all over the country."}, {"review_sentiment": 5.0, "review_text": "Astonishingly well written by a journalist who actually lived the war. No BS here. Brings back a lot of memories for me (not all of them good, unfortunately)."}, {"review_sentiment": 5.0, "review_text": "Required reading for all leaders and leaders in waiting! There is nothing more thst needs to be said. Case closed. No more war!"}, {"review_sentiment": 3.0, "review_text": "Fails to compare to \" Rumor of War\" by Caputo"}, {"review_sentiment": 3.0, "review_text": "I prefer the accounts of soldiers but this added an interesting dimension. It's a solid B for me. Just probably not my preferred style."}, {"review_sentiment": 5.0, "review_text": "Love it"}]}, "authors": ["Michael Herr"], "isbn": "0679735259", "longitude": 0.0, "periods": ["1900s"], "title": "Dispatches", "word_cloud": "probably best ever write serve year ago buy copy friend wound incredible view serve constant emotional impact anyone survive sanity intact miracle write grunt point view serve spot conventional journalism war conventional firepower negative review think reviewer expect linear land gook wire board transport back make clear writer reporter historian write war record report specifically write experience war correspondent particular unit battle individual footnote scholarly fiction realize fiction synonymous lie happening open section title find difficult write stream consciousness writer voice go back paragraph go specifically whole section version give voice talent fit section reason give star suspect reader give reading rest home character representative actual people encounter find name sense war correspondents encounter actual people story follow google credit writer now seem much remainder spark image hung skip next section write much hard hard put last section focus combat photographer war correspondent twice high come away yrs better great classic runner lot real people meet find character movie now play role screenplay colleague press chopper witness war multifaceted view hear revisionist say never saw never answer ya well maybe witness unit fly country astonishingly well write journalist actually live war back lot memory good unfortunately require reading leader leader wait nothing that need say close war fails compare prefer account soldier add interesting dimension solid probably prefer style", "genres": ["Memoir"], "summary": "Written on the front lines in Vietnam, Dispatches became an immediate classic of war reportage when it was published in 1977.\r\n\r\nFrom its terrifying opening pages to its final eloquent words, Dispatches makes us see, in unforgettable and unflinching detail, the chaos and fervor of the war and the surreal insanity of life in that singular combat zone. Michael Herr’s unsparing, unorthodox retellings of the day-to-day events in Vietnam take on the force of poetry, rendering clarity from one of the most incomprehensible and nightmarish events of our time.\r\n\r\nDispatches is among the most blistering and compassionate accounts of war in our literature.\r\n\r\n“The best book I have ever read on men and war in our time.” John le Carré\r\n\r\n“In the great line of Crane, Orwell, and Hemingway . . . Herr reaches an excruciating level of intensity . . . He seems to have brought to this book the ear of a musician and the eye of a painter . . . The premier war correspondence of Vietnam.” The Washington Post\r\n\r\n\" . . . Dispatches puts the rest of us in the shade.\" Hunter S. Thompson", "asin": "B000S5MUI2", "rank": "739450", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/31uHEvdTDhL.jpg", "country": "Hanoi", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}