{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 1028, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Book was just perfect !"}, {"review_sentiment": 4.0, "review_text": "This book is lovely.  The writing is beautiful."}, {"review_sentiment": 5.0, "review_text": "This book arrived timely and as described."}, {"review_sentiment": 5.0, "review_text": "As a first generation immigrant, I can totally relate to these Japanese immigrants."}, {"review_sentiment": 5.0, "review_text": "Good read!"}, {"review_sentiment": 5.0, "review_text": "I couldn't put this book down.  Guterson drew me in with his story line, always keeping a slight tension in the story.  I enjoyed his character development and felt as if I knew everyone personally.  I thoroughly enjoyed this book."}, {"review_sentiment": 5.0, "review_text": "I read SNOW FALLING ON CEDARS when it was first published years ago and it left such a positive impression that I decided to re-read it recently.  This is one of my favorite books of all time and the second time around was just as spellbinding, emotional and gripping as the first.  While I discovered more details with my recent reading than I remembered, the overall experience was just as powerful.  I've recommended it to numerous people who have also been impressed with the quality of writing and the powerful and emotional impact of this novel.  I happen to know quite a bit about gill net fishing and about Puget Sound so felt immersed in this setting.  CEDARS creates a palpable \"feeling\"... not just words...haunting and ethereal at the same time...I was inside the cedar tree with Hatsue and Ishmael, on the boats and at Manzanar.  The author is truly a master with words and his novel is a master of literature.  I probably will read it again and again."}, {"review_sentiment": 2.0, "review_text": "I enjoyed the book, and learning about the prejudice towards the Japanese, however the graphic sexual material was very disturbing and unnecessary. Definitely not for teens. J"}, {"review_sentiment": 5.0, "review_text": "One of my all time favorites."}, {"review_sentiment": 5.0, "review_text": "I have this book and movie. Please remove this from this site."}]}, "authors": ["David Guterson"], "isbn": "067976402X", "longitude": -122.3300624, "periods": ["1900s"], "title": "Snow Falling on Cedars", "word_cloud": "perfect lovely writing beautiful arrive timely describe first generation immigrant totally relate japanese immigrant good story line always keep slight tension story enjoy character development felt know everyone personally thoroughly enjoy first publish year ago leave positive impression decide recently favorite time second time spellbind emotional gripping first discover detail recent reading remember overall experience powerful recommend numerous people also impressed quality write powerful emotional impact happen quite bit gill net fishing felt immersed setting create palpable feeling word haunt ethereal time inside cedar tree boat author truly master word master literature probably enjoy learn prejudice towards japanese however graphic sexual material disturb unnecessary definitely teens time favorite movie site", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Winner of the PEN/Faulkner Award\r\n\r\nAmerican Booksellers Association Book of the Year Award\r\n\r\nSan Piedro Island, north of Puget Sound, is a place so isolated that no one who lives there can afford to make enemies.  But in 1954 a local fisherman is found suspiciously drowned, and a Japanese American named Kabuo Miyamoto is charged with his murder.  \r\n\r\nIn the course of the ensuing trial, it becomes clear that what is at stake is more than a man's guilt. For on San Pedro, memory grows as thickly as cedar trees and the fields of ripe strawberries--memories of a charmed love affair between a white boy and the Japanese girl who grew up to become Kabuo's wife; memories of land desired, paid for, and lost. \r\n\r\nAbove all, San Piedro is haunted by the memory of what happened to its Japanese residents during World War II, when an entire community was sent into exile while its neighbors watched. Gripping, tragic, and densely atmospheric, Snow Falling on Cedars is a masterpiece of suspense-- one that leaves us shaken and changed.\r\n\r\n\"Haunting.... A whodunit complete with courtroom maneuvering and surprising turns of evidence and at the same time a mystery, something altogether richer and deeper.\" Los Angeles Times\r\n\r\n\"Compelling...heartstopping. Finely wrought, flawlessly written.\" The New York Times Book Review", "asin": "067976402X", "rank": "27704", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/516IBTAsG7L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}