{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 27, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "fun"}, {"review_sentiment": 5.0, "review_text": "Updike or Roth.  Who you gonna choose?  Loved the deathbed chat with father and the vitriol from the brother.  Can't wait to finish the trilogy"}, {"review_sentiment": 4.0, "review_text": "This book seems to be mostly train of thought. It would seem to be mostly autobiographical. It would also seem to be blown out of proportion. Yet it is interesting reading."}, {"review_sentiment": 4.0, "review_text": "Philip Roth’s ZUCKERMAN UNBOUND is the second Zuckerman novel, published in 1981, that followed the novel THE GHOST WRITER. There are quite a few parallels between Roth and Zuckerman. The novel opens with Zuckerman publishing a literary sensation called CARNOVSKY, which was a coming-of-age novel full of sex and Jewishness, similar to Roth’s PORTNOY’S COMPLAINT, a novel that was hinted at in THE GHOST WRITER and the cause of tension between Zuckerman and his father, who felt the work gave ammunition to anti-Semitics who would see Jewish stereotypes in the work. In UNBOUND we see Zuckerman’s uncomfortable run-ins with fans that see too much in his novel, including one Alvin Pepler who seems directly based on Herb Stempel from the 1950s quiz show scandals. 1969 New York City is the backdrop for this fascinating glimpse of an author running from his creation without a place to stop."}, {"review_sentiment": 5.0, "review_text": "I have yet to be disappointed in anything that Philip Roth has written."}, {"review_sentiment": 5.0, "review_text": "You can’t go wrong with Philip Roth.  His writing is always authentic and engaging, if a little preoccupied with sex.  In Zuckerman Unbound, he has some fun with the relationship of author Zuckerman to his fictional protagonist, Carnovsky, mirroring Roth’s relationship to his own protagonists.  Other reviewers have commented on this, including fictional ones in the book.Not to be overlooked is Roth’s handy guide for aspiring writers.  If you’re planning to be a writer, you might want to study Zuckerman and work habits.  He has read fifty yards of books, and he tells us his favorites.  One is Thomas Wolfe, obviously relevant to the censure over Carnovsky.Hints about Zuckerman’s output are sprinkled throughout the trilogy.  He writes for six hours a day, producing three or four pages.  This is in the morning, when his energy is fresh.  He prefers sex at “her place,” because it’s easier to disengage and get back to his desk.  After writing, he takes a long walk and then reads for another three hours.I recommend all three books but, if you read only one, Zuckerman Unbound (the second one) is best.  It starts with Carnovsky, and it has a proper dramatic ending.  The Ghost Writer is more of a prologue.  If you tire of the Jewish guilt theme, try American Pastoral instead.  As the title suggests, it is more mainstream, with Zuckerman narrating someone else’s life."}, {"review_sentiment": 5.0, "review_text": "If you need to read what I think of this novel before buying it, you're in trouble. I'm not even qualified to give a review on this book. Buy it. Read it. You'll be a better person for having done so."}, {"review_sentiment": 5.0, "review_text": "Be sure to read Ghost Writer and other Zuckerman books first. Important to read them in order for maximum enjoyment. Not my favorite Zuckerman. Very readable, very light compared to some other Roth books. If you are looking for humor and entertainment, a good read."}, {"review_sentiment": 4.0, "review_text": "In fairness, the Zuckerman series has never really engaged me as a reader. Well written with a myopic visions, the story shows a mark of Philip Roth's talent. At the same time, I want more to happen.The plot of \"Zuckerman Unbound\" has some tremendous potential, but I never felt as though it materializes. The paranoia of fame bring Alvin Pepler into Zuckerman's life. The character has potential that is never realized. Instead, Roth spends much of his time avoiding Pepler while engaging in female encounters and dealing with family issues.The issue of the paranoia that comes with fame is obviously semi-autobiographical. Perhaps it is a demon that many encounter with new found fame. I do enjoy the sense of realism, but would have liked to have seen Roth take the issue a step or two further."}, {"review_sentiment": 3.0, "review_text": "Very well written.  Too solipsistic for my taste.  He focuses on how the world perceives him without taking sufficient responsibility for what the role that he plays in he response he gets and the outcomes in his life.  Again, good writing but not my favorite book of Roth's.  Probably depends on your phase of life, persepective...but that is what makes it interesting, huh?"}]}, "authors": ["Philip Roth"], "isbn": "0679748997", "longitude": 0.0, "periods": ["1900s"], "title": "Zuckerman Unbound", "word_cloud": "fun hon deathbed father vitriol brother wait finish trilogy seem mostly train thought mostly autobiographical also blown proportion yet interesting reading second publish follow quite parallel open publishing literary sensation call full sex similar hint cause tension father felt work give ammunition jewish stereotype work see uncomfortable fan see much include seem directly base quiz show scandals backdrop fascinate glimpse author run creation place stop yet disappoint anything write go wrong writing always authentic engage little preoccupied sex fun relationship author fictional protagonist mirror relationship protagonists other reviewer comment include fictional one overlook handy guide aspire writer planning writer study work habit fifty yard tell favorites obviously relevant censure output sprinkle trilogy write hour day produce page morning energy fresh prefer sex place easier disengage back desk write take long walk read recommend second best start proper dramatic end prologue tire jewish guilt theme american instead title suggest mainstream narrate someone else life need think buy trouble even qualify give review better person do sure first order maximum enjoyment not favorite readable light compare look humor entertainment good fairness series never really engage write myopic vision story show mark talent time want plot tremendous potential never felt paranoia fame bring life character potential never realize instead spend much time avoid engage female encounter deal family issue paranoia come fame obviously perhaps many encounter new find fame enjoy sense realism see issue step very well write solipsistic taste focus world perceives take sufficient responsibility role play response get outcome life good writing favorite depend phase life perspective make interesting huh", "genres": ["Fiction & Literature"], "summary": "The sensationalizing sixties are coming to an end, and even writing a novel can make you a star. The writer Nathan Zuckerman publishes his fourth book, an aggressive, abrasive, and comically erotic novel entitled Carnovsky, and all at once he is on the cover of Life, one of the decade's most notorious celebrities.\r\n\r\nThis is the same Nathan Zuckerman who in Philip Roth's much praised The Ghost Writer was the dedicated young apprentice drawing sustenance from the great books and the integrity of their authors. Now in his mid-thirties, Zuckerman, a would-be recluse despite his fame, ventures out on the streets of Manhattan, and not only is he assumed to be his own fictional satyr, Gilbert Carnovsky (\"Hey, you do all that stuff in that book?\"), but he also finds himself the target of admirers, admonishers, advisers, and would-be literary critics. The recent murders of Robert Kennedy and Martin Luther King, Jr., lead an unsettled Nathan Zuckerman to wonder if \"target\" may be more than a figure of speech.\r\n\r\nYet, streetcorner recognition and media notoriety are the least disturbing consequences of writing Carnovsky. Against his best interests, the newly renowned novelist retreats from his oldest friends, breaks his marriage to a virtuous woman, and damages, perhaps irreparably, his affectionate connection to his younger brother and his family. Even when finally he lives out the fantasies of his fans and enjoys an exhilarating night with the beautiful and worldly film star Caesara O'Shea (a rather more capable celebrity), he is dismayed the following morning by the caliber of the competition up in the erotic big leagues.\r\n\r\nIn some of Zuckerman Unbound's funniest episodes Zuckerman endures the blandishments of another New Jersey boy who has briefly achieved his own moment of stardom. He is the broken and resentful fan Alvin Pepler, in the fifties a national celebrity on the TV quiz show \"Smart Money.\" Thrust back into obscurity when headlined scandals forced the quiz show off the air, Pepler now attaches himself to Zuckerman and won't let go--an \"Angel of Manic Delights\" to the amused novelist (who momentarily sees him as his \"pop self\"), and yet also the likely source of a demonic threat.\r\n\r\nBut the surprise that fate finally delivers is more devilish than any cooked up by Alvin Pepler, or even by Zuckerman's imagination. In the coronary-care unit of a Miami Hospital, Nathan's father bestows upon his older son not a blessing but what seems to be a curse. And, in an astonishingly bitter final turn, a confrontation with his brother opens the way for the novelist's deep and painful understanding of the deathblow that Carnovsky has dealt to his own past.", "asin": "0679748997", "rank": "881655", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/214SazhLDQL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}