{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 264, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Every descendant of a Jewish man from the NYC metro area of the Greatest Generation and/or Baby Boomer Generation absolutely mist read this book. That’s all there is to it."}, {"review_sentiment": 5.0, "review_text": "A mix of bawdy humor and remarkable insight. A work of pure brilliance. The book is explicit in tone, and tests the reader's capacity for the outrageous throughout, but isn't that what great fiction is all about. Roth is clearly a genius. One of the legends of our era. His novels are easily among the greatest in popular literature."}, {"review_sentiment": 5.0, "review_text": "I admit that this book was a random purchase. I had been dealing with insomnia and I thought if I purchased a book of which I had no prior knowledge or information I could just open it up in bed at 2:30 AM and in just a paragraph or two would be lulled to sleep. Mistake.I ended up laughing out loud and waking my wife.Loved the book. Especially the nostalgia and sense of being there, real-time, New Jersey in the late ‘60s. Immersive."}, {"review_sentiment": 5.0, "review_text": "great if you like Roth"}, {"review_sentiment": 5.0, "review_text": "Yes, he's a whiner and a misogynist. But he is so honest about himself and such a great writer, I basically forgave him. Loved it."}, {"review_sentiment": 5.0, "review_text": "When I read this as a teenager OH SO MANY YEARS AGO, I thought it was a classic. I bought this as a gift for a young friend. Read a few pages and realized that it was no longer anything I'd want to reread. Still, Philip Roth is one of my top 5 favorite authors. His Pulitzer Prize winning book American Pastoral is one that I read cover to cover in one sitting."}, {"review_sentiment": 5.0, "review_text": "rereading it after many years I laughed my head off."}, {"review_sentiment": 5.0, "review_text": "This book is unlike any I have read. Fascinating, honest, at times titillating and at times disgusting. Having had the WASP experience I found the exploration of being Jewish confusing and interesting. I think most of what he deals with is not limited to anything to do with a Jewish upbringing, perhaps more about being male or American male, than any religious or even ethnic. He does poignantly describe the anxieties of negotiating life's seemingly contrary motivations. This book will rattle in my head for some time to come!"}, {"review_sentiment": 1.0, "review_text": "An embarrassment to anyone with a Jewish background. Were it written by a non-Jew, it would be obviously labeled as anti-Semitic. All the more pity that a Jewish intellectual should write this."}, {"review_sentiment": 5.0, "review_text": "Best book I've read in a long time and I read a lot and I recommend  it to all my friends"}]}, "authors": ["Philip Roth"], "isbn": "0679756450", "longitude": 0.0, "periods": ["1900s"], "title": "Portnoy's Complaint", "word_cloud": "descendant jewish man area absolutely mist mix bawdy humor remarkable insight work pure brilliance explicit tone test capacity outrageous great fiction clearly genius legends novel easily greatest popular literature admit random purchase deal insomnia think purchase prior knowledge information paragraph sleep end laugh loud wake especially nostalgia sense late great whiner misogynist honest great writer basically forgive love teenager think classic buy gift young friend page realize longer anything want reread still top favorite author win american cover cover sit reread many year laugh head fascinate honest time titillate time disgust have experience find exploration jewish confuse interesting think deal limit anything jewish upbringing perhaps male american male religious even ethnic poignantly describe anxiety negotiate life seemingly contrary motivation rattle head time embarrassment anyone jewish background write obviously pity intellectual write best long time lot recommend friend", "genres": ["Fiction & Literature", "Humour"], "summary": "Portnoy's Complaint n. [after Alexander Portnoy (1933- )] A disorder in which strongly-felt ethical and altruistic impulses are perpetually warring with extreme sexual longings, often of a perverse nature. Spielvogel says: 'Acts of exhibitionism, voyeurism, fetishism, auto-eroticism and oral coitus are plentiful; as a consequence of the patient's \"morality,\" however, neither fantasy nor act issues in genuine sexual gratification, but rather in overriding feelings of shame and the dread of retribution, particularly in the form of castration.' (Spielvogel, O. \"The Puzzled Penis,\" Internationale Zeitschrift für Psychoanalyse, Vol. XXIV, p. 909.) It is believed by Spielvogel that many of the symptoms can be traced to the bonds obtaining in the mother-child relationship.\r\n\r\nWith a new Afterword by the author for the 25th Anniversary edition.\r\n\r\n\"Touching as well as hilariously lewd.... Roth is vibrantly talented...as marvelous a mimic and fantasist as has been produced by the most verbal group in human history.\" Alfred Kazin, New York Review of Books", "asin": "0679756450", "rank": "27500", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41Av0LV6AZL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}