{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 461, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "My dad was insatiable when it came to all things “holocaust” so mesmerized by the sheer brutality of it. I went to Germany and saw that school children have to take this as a “course “ going to the concentration camps seeing what went on; went I visited Dachau myself ,I was just amazed, for lack of a better word, to see how slowly they integrated first the Jews were “bad negative “ people then it moved onto the gypsys and so onto be in those rooms ... feeling the ghosts of the past it was quite difficult for me and yet reading this book I realize why things are of such importance to understand our past and God help us make sure something like that never happens again.I liked the book but I’ve read better ones; should I say more readable ones , as I agree with the others that it seemed as if a thesaurus played a big part in the writing of this novel"}, {"review_sentiment": 3.0, "review_text": "I enjoyed the theme of the book.. however, using words which the average reader must spend most of their time looking up pronunciation(s) and meaning(s), on almost every page, distracts from the book."}, {"review_sentiment": 1.0, "review_text": "Terrible.  I couldn't even finish it.  So many inconsistencies and historical inaccuracies (for example, the first mobile phone call wasn't even made until the early 1970's, not the post-WWII period- there's no way Mr. Blackstock could've made a mobile phone call from his car).  This book reads like an over-sexed, literary word-snob wrote it."}, {"review_sentiment": 3.0, "review_text": "It was a little worn (which I expected) and I found it very tedious reading...never finished it."}, {"review_sentiment": 5.0, "review_text": "Who do you love the most, would you die for them"}, {"review_sentiment": 5.0, "review_text": "Certainly one of the best narratives of a person's life during the second world war. The complexity of characters, the writer's first person narrative, the unbelievably beautiful use of the language, all come together to leave a haunting memory when you are done with the book. It is a long read, not something done in one sitting, but is well worth reading through the end."}, {"review_sentiment": 5.0, "review_text": "Wonderfully written, and it will move you to tears. This book is clearly a literary classic, and Styron understands the human condition like few others."}, {"review_sentiment": 3.0, "review_text": "William Styron's original novel of Sophie's Choice takes us to post-WWII Brooklyn. It's not the poverty-ridden borough of A Tree Grows In Brooklyn, but neither is it modern-day wealthy hipster Brooklyn. It's in-between, an \"ethnic\" (read: mostly Jewish) working-class neighborhood. It's in a boarding house there that our narrator, aspiring writer and native Southerner Stingo, finds himself after he quits his dead-end publishing house job and can't afford Manhattan any longer. His first day in his new room, he's treated to the sound of noisy, athletic sex in the room right above his...and not too long after, he meets the lovers, Sophie and Nathan, in the midst of an awful, emotionally and physically violent public fight.The pair are soon reconciled, though, and Stingo is quickly drawn into their orbit. Beautiful Sophie is a Polish survivor of Auschwitz who does secretarial work for a chiropractor, and the mercurial Nathan is an American Jewish medical researcher, and Stingo falls a little bit in love with both of them as he begins to write a novel based in his experiences of the South. But another messy fight and breakup between Sophie and Nathan ultimately reveals that neither of them is exactly who they seem to be and makes their tragic end seem inevitable.This took me unusually long to get through: not because the subject matter is tough, even though it is, but because the book is just dense. Styron's prose tends towards the purple, and while usually I'm down with books that are on the overwritten side, it's a lot, you guys. It feels like the writing is struggling against the story, almost, trying to keep it from sweeping over the reader. There are plenty of remarkable passages, but the ratio of those to portions that drag isn't nearly high enough.The story of Sophie and Nathan, when it manages to take off, is sweeping and powerful and dramatic (if a bit on the Freudian side...there's a lot of eros/thanatos stuff going on). But what grinds it to a halt is the character of Stingo. He's an obvious writer-insert character, and Styron badly overestimates how interesting the portion of the book that's devoted to his sexual frustration is. It's not only boring, it's cringe-worthy, especially the section where he jerks himself off while sharing a hotel room with his father and makes so much noise when he finishes that he wakes his dad up. I'm not going to say that no one wants to read about that because maybe someone does, but it's tonally discordant with a book that's mostly about the evils humans inflict on themselves and each other and the way we tell our own stories to try to shape the world into a way we can better cope with it. There's greatness here, but it desperately needed a better editor to cut it and make it shine like it should have. As is, it's worth reading but not something I'd honestly recommend."}, {"review_sentiment": 5.0, "review_text": "You typically only hear about the first(gut wrenching) part, and for good reason. But the fact is that other parts of this book will have you laughing, not just out loud, but hard. Styron tackles some heavy topics in this book: anti-semitism; the holocaust; mental disease; and many others. And he does it with no apparent effort, with words that are amazingly easy to understand. The book almost reads itself. I am very impressed by his writing, obviously. It's a must read."}, {"review_sentiment": 5.0, "review_text": "A very well written book."}]}, "authors": ["William Styron"], "isbn": "0679736379", "longitude": 0.0, "periods": ["1900s"], "title": "Sophie's Choice", "word_cloud": "dad insatiable come thing holocaust mesmerize sheer brutality go saw school child take course go concentration camp see go go visit amaze lack better word see slowly integrate first bad negative people move gypsy room feel ghost quite difficult yet read realize thing importance understand help sure something never happen liked better one say readable one agree others seem thesaurus play big part write enjoy theme however use word average time look pronunciation meaning almost page distracts terrible even so many inconsistency historical inaccuracy example first mobile phone call even make early way mobile phone call car read literary write little worn expect find tedious reading never finish love certainly best narrative person life second world war complexity character writer first person narrative unbelievably beautiful use language together leave haunt memory do long something do sit well read end wonderfully write move tear clearly literary classic understand human condition others original take wealthy hipster ethnic mostly jewish neighborhood board house narrator aspire writer native find quit publish house job longer first day new room treat sound noisy athletic sex room right long meet lover midst awful emotionally physically violent public pair soon reconcile quickly draw orbit survivor secretarial work chiropractor mercurial medical researcher fall little bit begin base experience messy fight breakup ultimately reveal exactly seem make tragic end seem take unusually long get subject matter tough even dense prose tend towards usually overwrite side lot guy feel write struggle story almost try sweep plenty remarkable passage ratio portion drag nearly high story manages take sweeping powerful dramatic bit freudian side lot stuff go grind halt character obvious character badly overestimate interesting portion devote sexual frustration bore especially section jerk share hotel room father make much noise finish wake dad go say want maybe someone tonally discordant mostly evils human inflict way tell story try shape world way better cope greatness desperately need better editor cut make shine worth read something honestly recommend typically hear first gut wrench part good reason fact part laugh loud hard tackle heavy topic holocaust mental disease many others apparent effort word amazingly easy understand almost read impress write obviously well write", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Sophie's Choice is a 1979 novel by American author William Styron. It concerns the relationships between three people sharing a boarding house in Brooklyn: Stingo, a young aspiring writer from the South who befriends the Jewish Nathan Landau and his lover Sophie, a Polish, Catholic survivor of the German Nazi concentration camps. The plot ultimately centers on a tragic decision that Sophie was forced to make on her entry, with her children, into Auschwitz.\r\n\r\nSophie's Choice won the US National Book Award for Fiction in 1980. The novel was the basis of a successful film of the same name. It was controversial for the way in which it framed Styron's personal views regarding the Holocaust.", "asin": "0679736379", "rank": "57729", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51lLiAyKraL.jpg", "country": "Brooklyn", "story_arc": ["Tragedy", "Things only get worse"]}