{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 353, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "This is the first time I write a review of a book so maybe it is not very helpful, but I wanted to let people who read this know that I think this is a good story, with good rhythm and interesting characters. The story unfolds in a way that kept me stuck to the book and always wanting to discover what was going to happen next. This book was the first I read from Dashiell Hammett and I liked it so much that I went on to read others from him. If you like this kind of stories, you will like this book."}, {"review_sentiment": 5.0, "review_text": "good story"}, {"review_sentiment": 3.0, "review_text": "Loved the movies...but the book was lacking."}, {"review_sentiment": 4.0, "review_text": "Here’s one of the best, if not the very best, comic private detective mysteries you’ll ever read. Nick and Nora Charles, and their dog Asta, visit New York City for the Christmas and New York  holidays at the close of 1932, also the last days of the ill-fated temperance experiment, Prohibition (December 18, 1917 - March 22, 1933, ratification of the 18th and 21st Amendments, respectively). They are there to party, and as Nick likes to say, drink. However, the disappearance of an old client, Clyde Wynant, an eccentric and erratic millionaire inventor, followed by multiple murders, sets them off on finding Wynant and the killer in their midsts. Along the way, they run into an assortment of odd characters, including Wynant family members and a Runyon-esque gallery of rogues.As with most mysteries, it’s less about the mystery itself than it is about the characters and the telling. What distinguishes The Thin Man is Hammett’s sharp wit, as expressed by Nick and Nora. What’s more is the copious amounts of alcohol consumed by Nick and Nora. On nearly every page, they busy themselves preparing cocktails, regardless of the time of day. Nick frequently imbibes upon waking before taking his breakfast. Of course, Hammett himself was an alcoholic, a disease that he led to his death.Such a popular novel gave birth to an equally popular film adaptation. While the film departed from the novel in places, it did capture the essence of Nick and Nora, and gave personality to Asta. Once you’ve seen the 1934 film, you’ll find it hard to picture and hear Nick and Nora any differently from William Powell and Myrna Loy. As a matter of fact, it’s probably safe to say that most people will think of Nick himself as the thin man. In fact, the real thin man is Clyde Wynant, but such is the power of the visual association of trim Powell and the film’s title.If you have never read the novel, it comes to you highly recommended, to be followed by a viewing of the 1934 film adaptation. And the best way to watch the film, of course, is with a shaker of Martinis at hand."}, {"review_sentiment": 4.0, "review_text": "I thought that it was fun, but I suspect that younger readers not familiar with the detective stories of that genre will not be impressed.  The final resolution was out of left field and there were very few clues that would lead the reader to know 'who done it.'"}, {"review_sentiment": 4.0, "review_text": "It quite a period piece."}, {"review_sentiment": 5.0, "review_text": "Terrific detective story"}, {"review_sentiment": 5.0, "review_text": "Great characters with a lot of edge in the dialogue.  A wonderful read."}, {"review_sentiment": 5.0, "review_text": "Good mystery reading. Thanks."}, {"review_sentiment": 5.0, "review_text": "Hammett introduces a new character, Ned Beaumont as the detective, though in fact that is not his profession. The story takes a lot of turns but always stays with the main theme and as usual the final denouement is a surprise."}]}, "authors": ["Dashiell Hammett"], "isbn": "0679722637", "longitude": 0.0, "periods": ["1900s"], "title": "The Thin Man", "word_cloud": "first time write review maybe helpful want let people know think good story good rhythm interest character story unfolds way keep stuck always want go happen first like much go others kind story good story love movie lack here best best comic private detective mystery ever dog holiday close also last day temperance experiment ratification amendment respectively party like say drink however disappearance old client eccentric erratic millionaire inventor follow multiple murder set find killer midst way assortment odd character include family member gallery mystery le mystery character tell distinguish sharp wit express copious amount alcohol consume nearly page busy prepare cocktail regardless time day frequently imbibe wake take breakfast course alcoholic disease lead popular give birth equally popular film adaptation film depart place capture essence give personality see film hard picture hear differently matter fact probably safe say people think fact real power visual association trim film never come highly recommended follow view film adaptation best way watch film course shaker hand think fun suspect younger reader familiar detective story genre impress final resolution leave field clue do quite period piece detective story great character lot edge dialogue wonderful good mystery reading thanks introduce new character detective fact profession story take lot turn always stay main theme usual final denouement surprise", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Nick and Nora Charles are Hammett&#039;s most enchanting creations, a rich, glamorous couple who solve homicides in between wisecracks and martinis. At once knowing and unabashedly romantic, The Thin Man is a murder mystery that doubles as a sophisticated comedy of manners.", "asin": "0679722637", "rank": "83246", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/5101Yc%2BjRkL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}