{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 127, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "After reading American Pastoral and Portnoy's Complaint I assumed that Roth had peaked and any further reads would be a disappointment...Sabbath's Theater is by far my favorite Philip Roth novel..Plot wise, characters and storytelling are superb and the prose is gorgeous as usual."}, {"review_sentiment": 2.0, "review_text": "Philip Roth is one of my favorite authors, yet I’d never read this winner of the 1995 National Book Award. Alas, I shouldn’t have done so now. Even Roth cannot make the sex-drenched misanthropic puppeteer Mickey Sabbath come to life. He means his title character to be transgressive; he is merely unimaginatively obsessive. Save the brilliant section where Sabbath visits the Jersey shore of his childhood, and the family memories scattered throughout, there is little to redeem the novel’s self-indulgent writing. Was I shocked? No, merely bored."}, {"review_sentiment": 1.0, "review_text": "I have found that people who love this book believe that people who hate this book do so because they fail to appreciate unlikable characters.  Mickey Sabbath, the main character of this work, is certainly unlikable.  His actions are consistently depraved and mean-spirited - his sexual exploits (which are described at an unnecessary length) are least among the terrible things Sabbath does or says.  I don't mind unlikable characters. I don't hate this book because of Sabbath.  I hate this book because of Philip Roth.I found this book to be written poorly.  It might have worked as a novella, but at 450 pages in paperback, it drags on too long, focusing too much time on describing sexual conquests that provide no insight into characters and only serves to break the flow of the book.  The women in this book are poorly developed.  They have no value if they are not sexual beings. For a character who seems to base his life around three things: the death or disappearance of loved ones; sex; and attempting to manipulate people, the women with whom the Sabbath is intimately involved (he has an ex wife and a wife, along with a permanent lover), none of the women are developed beyond a sketch.Additionally, the racist rantings of Sabbath go without critique and nothing more than a tepid one-word challenge.  It begins to feel less like a purposeful attempt at making an unlikable character and more like an excuse to use a characters as a vehicle to spout one's own unpopular opinions.I have friends who loved this book.  I have friends who hated it.  I'm firmly in the second camp."}, {"review_sentiment": 5.0, "review_text": "The (anti-) hero, Morris 'Mickey' Sabbath, is an 'Evangelist of Fornication'. The core of seduction is persistence - that sums up his operational paradigm. He is also deeply into pessimism. Part 1 of this novel is titled 'There's nothing that keeps its promise'. A typical addict view, right? But then, the title is wrong, the book is better than its own opening. Or does that mean it is right?This novel starts by seeming pointless, and by being a bit repulsive. But don't give up too quickly, things develop and grow depth, though they tend to stay repulsive. Don't come here with tasteful pretensions or expectations. Certainly don't put any bet on Mickey's good character.Games and dreams of a dirty old man. Well, let's say 'elderly'. At 64, he has reached the end of his tether. He has no life and no future. His first wife disappeared, his second wife kicks him out, his soul- and playmate has died of cancer, his reputation in his New England town is ruined by a scandal, his arthritic hands make him unable to work in his profession as a puppeteer, he has no money. What now? Even suicide is elusive.What we have now is the past. The past is complex and messy enough to give Roth food for masterly prose. The disappearance of wife 1, an actress, adds a sort of mystery element to the tale. Did she run and hide? Was violence involved? Did he kill her, as he sometimes enjoys boasting?Sabbath walks NYC streets, a Jersey beach, a New England cemetery with a suicidal mind set. His doomsday is  a stylish salute to  Bloomsday. Though it may seem, in bits, like a copy, if not a parody, I would go so far as to say that Sabbath, in his mental state, has more reason and plausibility to think and observe in that manner than Bloom ever had. Sabbath is also a more complex person, with his outrageous misbehavior. I began to enjoy him, after a few hundred pages. Just wait for the Rosa episode, and then the Michelle climax!The past also has the story of Mickey 's brother, who died in the Pacific War. There is a lot of past in Mickey. He is a sort of senior Portnoy. In a way I like him better than Portnoy."}, {"review_sentiment": 1.0, "review_text": "This is going to be short and sweet. After admiring most of Roth's novels, and learning that he himself picked Portnoy's Complaint and Sabbath's Theater (try reading that one to its conclusion), two of the most depraved and misogynistic novels in American literature, as his best ones, Roth will never be a contender for the Nobel Prize. Having said that, he is still my favorite American writer."}, {"review_sentiment": 3.0, "review_text": "The main character is so loathsome that I kept trying to stop reading but I couldn't because it so well written. Hard to recommend because its so dark."}, {"review_sentiment": 2.0, "review_text": "Very disappointed.  I've enjoyed Roth's work in the past and saw that this book was generally praised.  As I was reading, I began skimming pages, and the by the time I got to the latter stages, I abandoned the text entirely.  Roth's sentences flow easily, and yet, I became so bored with the mis-adventures of Mickey Sabbath that I was rooting for him to die.  What a slog.  I couldn't find a single character that was believable, appealing (even a villain), or able to hold my interest.  Elements of the premise had potential (the puppeteer metaphor).  It's not required that realism be an requirement for fiction, but few of the circumstances detailed in the novel seemed at all believable.  I hope I have better luck with a different Roth novel."}, {"review_sentiment": 4.0, "review_text": "Philip Roth not at his best, but still Philip Roth."}, {"review_sentiment": 5.0, "review_text": "Fabulous Roth!  What more can anyone say!"}, {"review_sentiment": 4.0, "review_text": "In general Philip Roth is a writer with a controversial reputation, - you like him or you don’t -, and that’s so even more for this book, - you can notice reading the reviews on this site. Apparently this has everything to do with the very pornographic content of Sabbath’s Theatre. I am not going to start a semantic discussion on what is pornographic, and what just is explicit writing more or less functional to the story; I suspect that Roth himself scrupulously opted for the former, and so we must not be faint about that. But to be honest,- of course it depends on what you are used to -, every now and then, reading Sabbath's Theatre, I really had to swallow (my apologies for the too obvious pun).In general Philip Roth is a writer with a controversial reputation, - you like him or you don’t -, and that’s so even more for this book, - you can notice reading the reviews on this site. Apparently this has everything to do with the very pornographic content of Sabbath’s Theatre. I am not going to start a semantic discussion on what is pornographic, and what just is explicit writing more or less functional to the story; I suspect that Roth himself scrupulously opted for the former, and so we must not be faint about that. But to be honest,- of course it depends on what you are used to -, every now and then, reading Sabbath's Theatre, I really had to swallow (my apologies for the too obvious pun).In a superficial reading of the book you see main character Mickey Sabbath, a 64-year-old former puppeteer on the way down, just as a sex addict, as a pervert: he can't get enough of his mistress, the 10-year younger nymphomaniac Drenka, of Croatian descent, and even apart from that, he dreams permanently of trios, he has phone sex with young girls, he gets a kick touching the underwear of the daughter of his best friend, and so on. For Mickey, it's all very innocent and his natural way of life; and through the intense and indeed sometimes very explicit way of describing by Roth, that does sound rather plausible (p 245: For a pure sense of being tumultuously alive, you can’t beat the nasty side of existence).Throughout the book, we see that there’s a lot more to this natural, “amoral” state of mind of Sabbath. He is unbalanced by the death of his mistress, and then we discover that he has become traumatized by the early death of his brother Morty, the death of his mother (with whom he still talks permanently), and by the sudden disappearance of his first wife Nicky. Gradually you get to see that the sex addiction of Sabbath is essentialy an intense endeavour to live, derived from the existential feeling of lack and loss, and permanently fired by a flight for death. Roth succesfully turns the pervert that he describes at first, into a touching, pitiful older man who notes that he is approaching the end and realizes he’s a failure (but nevertheless gives his orgiastic instinct free rein).During the reading of the book I regularly was reminded of Leopold Bloom, the also Jewish main character of James Joyce in Ulysses: just as Sabbath Bloom is portrayed by Joyce as a man of small proportion, but eventually more as an Elckerlyc , representative of men in general. Also in this book there are many implicit and explicit winkings at Ulysses: shortly before halfway Roth even presents us a quick overview of the writing styles of Ulysses, as a brilliant homage to Joyce; and who can not link the masturbation scene of Sabbath's wife at the end of the book, with Penelopes (Bloom’s wife) monologue interieur at the end of Ulysses?So, also from a literary point of view, this book must not be underestimated, and then I don’t even mention the rousing rhetorical delights Sabbath regularly gives, the countless hilarious scenes and the constatation that despite the sometimes embarrassing descriptions you can’t really put down this book. The picaresque novel (in the tradition of Apuleius, Rabelais and numberous others)is not really my favorite genre, but in this genre this book is a XXth Century masterpiece!"}]}, "authors": ["Philip Roth"], "isbn": "0679772596", "longitude": 0.0, "periods": ["1900s"], "title": "Sabbath's Theater", "word_cloud": "read american assume peak read far favorite wise character storytelling superb prose gorgeous usual favorite author yet never winner do even make misanthropic puppeteer come life mean title character transgression merely unimaginatively obsessive brilliant section visit shore childhood family memory scatter little redeem writing shock merely bore find people believe people hate fail appreciate unlikable character main character work certainly unlikable action consistently deprave sexual exploit describe unnecessary length least terrible thing say mind unlikable character hate hate find write poorly novella page paperback drag long focus much time describe sexual conquest provide insight character serve break flow woman poorly develop value sexual being character seem base life thing death disappearance love one sex attempt manipulate people woman intimately involve ex wife wife permanent lover none woman develop racist ranting go critique nothing tepid challenge begin le purposeful attempt make unlikable character excuse use character vehicle unpopular friend love friends hated firmly second camp hero core seduction persistence sum operational paradigm also deeply pessimism title nothing keep promise typical addict view right title wrong better opening right start seem pointless bit repulsive give quickly thing develop grow depth tend stay repulsive tasteful pretension expectation certainly put good dream dirty old man reached end tether life first wife disappear second wife kick playmate die cancer reputation town ruin scandal arthritic hand make unable work profession money even suicide past complex messy enough give food masterly prose disappearance wife actress add sort mystery element tale hide violence involve sometimes enjoys boast walk street beach cemetery suicidal mind set doomsday stylish salute bit copy parody far say mental state reason plausibility think manner ever also complex person outrageous misbehavior begin enjoy hundred page wait episode climax past also story brother die lot sort senior way like better go short sweet admire novel learn pick try read conclusion deprave misogynistic novel american literature best one never contender say still favorite american writer main character loathsome keep try stop reading well write recommend dark very disappointed enjoy work past saw generally praise read begin skim page time get latter stage abandon text entirely sentence flow easily yet become bored root slog single character believable appeal even villain able hold interest element premise potential puppeteer metaphor require realism requirement fiction circumstance detail seem believable hope better luck different best still fabulous anyone say general writer controversial reputation even notice read review site apparently everything pornographic content go start semantic discussion pornographic explicit write le functional story suspect scrupulously opt former honest course depends use read really swallow apology obvious general writer controversial reputation even notice read review site apparently everything pornographic content go start semantic discussion pornographic explicit write le functional story suspect scrupulously opt former honest course depends use read really swallow apology obvious pun superficial reading see main character former puppeteer way sex addict pervert enough mistress younger nymphomaniac descent even apart dream permanently trio phone sex young girl get kick touch underwear daughter best friend innocent natural way life intense indeed sometimes explicit way describe sound rather plausible p pure sense tumultuously alive beat nasty side existence see lot natural amoral state mind unbalance death mistress discover traumatized early death brother death mother still talk permanently sudden disappearance first wife sex addiction essential intense endeavor live derive existential feeling lack loss permanently fire flight death successfully turn pervert describes first touch pitiful older man note approach end realize failure nevertheless give orgiastic instinct free rein reading regularly remind also main character portray man small proportion eventually representative men general also many implicit explicit winking ulysses shortly halfway even present quick overview write style ulysses brilliant homage link masturbation scene wife end wife monologue interior end ulysses also literary point view underestimate even mention rouse rhetorical delight regularly give countless hilarious scene constipation sometimes embarrass description really put picaresque tradition numerous others really favorite genre genre masterpiece", "genres": ["Fiction & Literature", "Humour"], "summary": "Sabbath's Theater is a comic creation of epic proportions, and Mickey Sabbath is its gargantuan hero. Once a scandalously inventive puppeteer, Sabbath at sixty-four is still defiantly antagonistic and exceedingly libidinous. But after the death of his long-time mistress—an erotic free spirit whose adulterous daring surpassed even his own—Sabbath embarks on a turbulent journey into his past. \r\n\r\nBereft and grieving, besieged by the ghosts of those who loved and hated him most, he contrives a succession of farcical disasters that take him to the brink of madness and extinction.", "asin": "0679772596", "rank": "142327", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/511qnZBw25L.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}