{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 69, "rating": 3.3, "reviews": [{"review_sentiment": 1.0, "review_text": "Stopped reading after 30 or so pages."}, {"review_sentiment": 3.0, "review_text": "Jack Maggs is an interesting novel, set in 1830's Great Britain, about a convict who returns from exile in New South Wales (Australia) to meet the young man he has been supporting from afar for the past 20 years, an orphaned boy named Phipps.  If this sounds vaguely familiar, that's to be expected--Jack Maggs is a re-imagining of the character Magwitch from Great Expectations.So, picture Great Expectations from the point-of-view of Magwitch (Maggs), with the action compressed to a period of less than 3 weeks.  Due to a case of mistaken identity, Maggs is pressed into service as a footman in the household of Percy Buckle.  While there, Jack meets Mercy, a young maid who is fascinated with him, and Tobias Oates, a writer struggling with financial difficulties who is eager to learn Maggs' history and perhaps profit from it.  Maggs, however, simply wants to locate Phipps, his long-lost \"son.\"  We are also treated to flashbacks into Maggs' own past, which highlights the series of heartbreaks that led him to be exiled in the first place.It took me about 40 or so pages to get into this book, but once I did, it was a quick read. If you're not familiar with Dickens, brushing up on the plot of Great Expectations will make your reading much more enjoyable."}, {"review_sentiment": 5.0, "review_text": "Jack Maggs began life as an unwanted baby in late 18th-Century London.  Three days old, he was found lying in the muck beneath London Bridge.  He was taken in by a pair of miscreants and raised by them to be a thief, sliding down chimneys to gain entrance to houses containing hauls of silver.  Eventually he betrayed himself in a futile effort to save the girl he loved from hanging.  In 1813, just before being placed on a ship for transport to New South Wales for life, Maggs was befriended by a four-year-old orphan named Henry Phipps.  He came to think of Phipps as his son.  After suffering much as a convict laborer in the Moreton Bay penal colony, including losing two fingers and having his back hideously scarred in a double-cat whipping, Maggs became wealthy and began sending money back to England to set Henry Phipps up as a gentleman.  In April 1837 Maggs returns to London, risking death in order to see his \"son\".It is at that point that the present action of JACK MAGGS begins, and the story of Maggs's search for Henry Phipps over the next month develops at a brisk clip, taking all sorts of unexpected twists and turns.  Suspense builds, at first rather slowly but ever faster as the novel progresses, rapidly accelerating near the end towards what the reader expects to be an apocalyptic conclusion.  In one final twist, however, the last two pages reveal a subdued, rather sentimental happily-ever-after ending to the life of Jack Maggs (one which makes ironical the statement of Maggs that I have used as the title for this review).From that capsule description of the novel, astute readers will note parallels to Charles Dickens's \"Great Expectations\", with Jack Maggs as Dickens's Magwitch and Henry Phipps as Pipp.  The parallel to \"Great Expectations\" becomes more convoluted and intriguing with the introduction of Tobias Oates, a young, up-and-coming novelist from a humble background, who, of course, is a re-casting of Dickens himself.  Oates determines to make a novel out of the life of Jack Maggs, and the \"mesmerizing\" sessions he conducts to pry into Maggs's secrets lead him to become entangled in Maggs's search for Henry Phipps.  At the same time, Oates has to deal with his growing distaste for his wife and his love (or lust) for his wife's sister -- a situation that becomes a secondary plot to the novel.JACK MAGGS is not a great, profound novel.  I didn't note any transcendent themes, other than, perhaps, the temptation (or is it the necessity?) for a novelist in creating his characters to appropriate and exploit the personalities and stories of people he knows.  But I found JACK MAGGS to be a clever, entertaining novel with a rollicking good story.  The reader is dropped into the London of the 1830's, with its gulf between master and servant, the rich and the destitute, the respectable and the pariahs.  Further, one is exposed to several beyond-the-norm practices, such as mesmerism and down-and-dirty abortion.  As a whole, the characters in JACK MAGGS are a rather sorry, sordid lot.  Tobias Oates/Charles Dickens is especially pathetic.  The two who are most appealing are Jack Maggs and Mercy Larkin, a maid who as a thirteen-year-old had been sent out by her starving mother to trade her body for a few coins and at novel's end saves Jack Maggs.I had never read anything by Peter Carey before, in an inexplicable spasm, I bought four of his novels at Powell's in Portland four years ago.  I couldn't get beyond page 105 of \"The Tax Inspector\", so I was hesitant to try any of the others.  Thankfully, JACK MAGGS is much better.  I even enjoyed it more than \"Great Expectations\", which I re-read three years ago.  I now look forward to the two remaining Carey novels from that expedition to Powell's."}, {"review_sentiment": 2.0, "review_text": "I enjoyed the book very much.  I love Carey's prose and his desperate characters, in this case, Jack.  This is not among his very best novels, but it held my attention steadily."}, {"review_sentiment": 5.0, "review_text": "Great spin on a classic novel."}, {"review_sentiment": 2.0, "review_text": "2 things Dickens fans must know before reading this re-write of Great Expectations:  Carey has no interest in facts (other than those he can twist) and this work has nothing to do with Dickens.  Carey is writing about his own privileged background (eg went to a school future kings go...) and his career 'borrowing' stories.  Carey is an Australian, after all."}, {"review_sentiment": 1.0, "review_text": "There is not one likable character in this novel. If it were not required for a class, I would have put it down after 50 pages."}, {"review_sentiment": 4.0, "review_text": "Peter Carey, as always, envelopes us in his tale and we become a silent witness to his characters' lives. He's truly a gifted storyteller who affects a vaguely Victorian sensibility in a modern novel. Carey has a knack for capturing the very essence of his characters without getting bogged down in details. His prose is lush and a pleasure to lose yourself in.I highly recommend you pick up this book and witness for yourself how a truly talented author can make a story sing."}, {"review_sentiment": 4.0, "review_text": "It is the mid-nineteenth century, and a man has secretly returned to London from the colonies. Having made his fortune in Australia, and anonymously forwarded it towards the prosperity and education of a young man who as a child was kind to him, Maggs now seeks out Henry Phipps.Like this? For full review, see https://pastbooks.wordpress.com/2014/02/27/jack-maggs-peter-carey/Names and dates slightly changed, this is a familiar plot to any reader acquainted with Great Expectations. Yet a reader expecting a straightforward adaptation of the original from the Australian perspective would be disappointed. The characters of Dickens' Magwitch and Carey's Maggs immediately have marked differences, for Magwitch returns to London in 1829 at the age of 60, and Maggs returns to London at an earlier and more fashionable time of his life, and in 1837, emphasising Carey's rewriting of the Victorian era."}, {"review_sentiment": 4.0, "review_text": "Well developed characters . Plot based on background of Madgwick of Great Expectations. Very entertaining read. Some detailed historical glimpses of life in London in 18th century."}]}, "authors": ["Peter Carey"], "isbn": "0679760377", "longitude": -0.12574, "periods": ["1800s"], "title": "Jack Maggs: A Novel", "word_cloud": "reading page interesting set convict return exile meet young man support afar past year orphan boy name sound vaguely familiar expect character picture action compress period le week case mistaken identity press service footman household meet young maid fascinate writer struggle financial difficulty eager learn history perhaps profit however simply want locate son also treat flashback highlight series heartbreak lead exile first take page get quick familiar brushing plot make read much enjoyable begin life unwanted baby late day old find lie muck beneath take pair miscreant raise thief slide chimney gain entrance house contain haul silver betray futile effort save girl loved hanging place ship transport life befriend orphan name come son suffer much convict laborer penal colony include lose finger back hideously scar whip become wealthy begin send money back set gentleman return risk death order see son point present action begin story search next month develop brisk clip take sort unexpected twist turn build first rather slowly ever faster progress rapidly accelerate end towards expect apocalyptic conclusion final twist however last page reveal subdue rather sentimental end life make ironical statement use title review capsule description astute reader note parallel parallel becomes convolute intriguing introduction young novelist humble background course determines make life mesmerize session conduct pry secret lead entangled search time oates deal grow distaste wife lust wife sister situation become secondary plot great profound note transcendent theme perhaps temptation necessity novelist create character appropriate exploit personality story people know find clever entertain rollick good story dropped gulf master servant rich destitute respectable pariah expose several practice mesmerism abortion whole character rather sorry sordid lot especially pathetic appeal maid send starve mother trade body coin end save never anything inexplicable spasm buy novel year ago page hesitant try others thankfully much better even enjoy year look forward remain novel expedition enjoy much love prose desperate character case best novel hold attention steadily spin classic thing fan read interest fact twist work nothing write privilege background eh go school future king go career story likable character require class page always envelop tale become silent witness character live truly gift storyteller affect vaguely victorian sensibility modern knack capture essence character get bogged detail prose lush pleasure highly recommend pick witness truly talented author make story sing century man secretly return colony have make fortune anonymously forward towards prosperity education young man child kind seek full review see http date slightly change familiar plot acquaint expect straightforward adaptation original australian perspective character immediately mark difference return age return earlier fashionable time life emphasize rewrite victorian era well developed character base background entertain detailed historical glimpse life century", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The Booker Prize-winning author of Oscar and Lucinda returns to the nineteenth century in an utterly captivating mystery. The year is 1837 and a stranger is prowling London. He is Jack Maggs, an illegal returnee from the prison island of Australia. He has the demeanor of a savage and the skills of a hardened criminal, and he is risking his life on seeking vengeance and reconciliation.\r\n       \r\nInstalling himself within the household of the genteel grocer Percy Buckle, Maggs soon attracts the attention of a cross section of London society. Saucy Mercy Larkin wants him for a mate. The writer Tobias Oates wants to possess his soul through hypnosis. But Maggs is obsessed with a plan of his own. And as all the various schemes converge, Maggs rises into the center, a dark looming figure, at once frightening, mysterious, and compelling. Not since Caleb Carr's The Alienist have the shadowy city streets of the nineteenth century lit up with such mystery and romance.\r\n\r\n\"A rousing old-fashioned narrative. . . . [that] stands on its own as an adventure story.\" The New York Times\r\n", "asin": "0679760377", "rank": "697589", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51ikNI3wECL.jpg", "country": "England", "story_arc": ["Tragedy", "Things only get worse"]}