{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 123, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "The dialogue was confusing at times to me because it is British, but other than this, it was a great book that made you want to just keep reading."}, {"review_sentiment": 4.0, "review_text": "Damage is not pretty.  This isn't a pretty book.  It's desperate and sad and makes statement after statement of uncommon truth.  It's hard to categorize this short little novel,  maybe it's an allegory?  Maybe it's a cross eyed peek at human passion.  Passion is from the Greek word for suffering.  It will plunge a knife into your chest and turn it."}, {"review_sentiment": 5.0, "review_text": "In retesting story. Can't decide what I like most, the movie or the book. Great read."}, {"review_sentiment": 5.0, "review_text": "Couldn't put it down. \"Damaged people are dangerous, they know they can survive.\" BTW The movie starring Jeremy Irons, was equally as great."}, {"review_sentiment": 3.0, "review_text": "This book was extremely well written.  However, the subject matter was extraordinarily dark and very depressing.  It is the tale of a man who seemingly has everything.  A beautiful wife and two perfect children. A life of wealth and comfort.  A long standing career as a physician, and then a successful turn as an elected official.  Despite all of this, this man feels empty and not quite alive.  That all changes when by chance he encounters his son's new love interest.  This is a tale of desperation, fateful choices made.  A tale of loss and despair, albeit beautifully crafted."}, {"review_sentiment": 5.0, "review_text": "I needed to read another story of a white dude's mid-life crisis like I needed a hole in the head, but I actually really liked this book. It's beautifully written and the characters are really well developed - even those on the periphery of the story, which is rare. I would recommend this to anyone looking for a quick, easy read but still wanting powerful prose and storytelling rather than romantic fluff."}, {"review_sentiment": 4.0, "review_text": "Honestly if I had not seen the movie years ago and wondered why it isn't aired like many other older movies; I probably would not have purchased DAMAGE.  But I am so glad that I have now read the book that filled in some needling questions left by the movie.  I thoroughly enjoyed the book.  Now if someone would just air the movie again, all will be well."}, {"review_sentiment": 5.0, "review_text": "What a fantastic book. Brilliantly written. What an epic love story. I highly recommend this novel. It is utterly Devine."}, {"review_sentiment": 4.0, "review_text": "This is a story of a twisted and obsessed man who's deceit ruined everyone around him."}, {"review_sentiment": 5.0, "review_text": "Stunning novel. The film is terrific too, but the book is subtle and compelling."}]}, "authors": ["Josephine Hart"], "isbn": "0679401350", "longitude": -0.12574, "periods": ["1900s"], "title": "Damage", "word_cloud": "dialogue confuse time british great make want keep reading pretty pretty desperate sad make statement statement uncommon truth hard short little maybe allegory cross eye peek human passion word suffer plunge knife chest turn retesting story decide movie put people dangerous know survive movie star equally great extremely well write however subject matter extraordinarily dark depress tale man seemingly everything beautiful wife perfect child life wealth comfort long stand career physician successful turn elect official man feel empty quite alive change chance encounter son new love interest tale desperation fateful choice make tale loss despair beautifully craft need story white dude crisis need hole head actually really like beautifully write character really well develop even periphery story rare anyone look quick easy still want powerful prose storytelling rather romantic fluff honestly see movie year ago wonder air many older movie probably purchase glad fill needle question leave movie thoroughly enjoy now someone movie well fantastic write epic love story highly recommend utterly story twist obsessed man deceit ruin everyone stun film terrific subtle compelling", "genres": ["Fiction & Literature"], "summary": "“A passionate, elegant, ruthless story.” —Iris Murdoch\r\n\r\nDamage is the gripping story of a man’s desperate obsession and scandalous love affair. He is a man who appears to have everything: wealth, a beautiful wife and children, and a prestigious political career in Parliament. But his life lacks passion, and his aching emptiness drives him to an all-consuming, and ultimately catastrophic, relationship with his son’s fiancée.\r\n\r\nChilling and brilliant, Damage is a New York Times–bestselling masterpiece—a daring look at the dangers of obsession and the depth of its shattering consequences.", "asin": "0679401350", "rank": "862104", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/11%2BGoQ-ZHhL.jpg", "country": "England", "story_arc": ["Tragedy", "Things only get worse"]}