{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 22, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Classic mid-20th century view of one aspect of Jewish life, written with humor and empathy"}, {"review_sentiment": 5.0, "review_text": "This turns out to be one of the Best books I've ever read. He puts into one paragraph more than some writers put into an entire book."}, {"review_sentiment": 4.0, "review_text": "I always enjoy whatever Phillip Roth has written.  This one is from early in his career, and in my opinion,  is not his best.  If you are going to read Roth, my favorite is \"The Plot Against America\""}, {"review_sentiment": 1.0, "review_text": "After 300 pages of over lengthy, excruciatingly detailed, expositions of the emotional incompetence of a parade of intensely annoying characters I called it quits.  No way I was going through the second half.  The problem is, all the characters, including the main protagonists, are equally,  predictably, and uniformly tedious.  Nothing to hang on to.  The book goes back to the library."}, {"review_sentiment": 5.0, "review_text": "I will tell you this. I am just 200 pages into this book right now. This book describes the truth of so many people's lives, probably most people's lives. The horror and disappointment of Thanksgiving, the futile search for peace and comfort in relationships, the search for simplicity and naturalness in living, the complexity and the stumbling difficulty of it all. To me this book is alive and true, providing companionship like a good dog does(all dogs are good)."}, {"review_sentiment": 4.0, "review_text": "There are few novels I have enjoyed reading more than I did Letting Go (1962), Phillip Roth's first full-length work (his previous output consisted of short stories and the novella Goodbye Columbus). Roth's mellifluous prose, ear for dialogue and ability to create interesting characters and put them in dramatic but plausible situations makes this a thoroughly enjoyable read even at over 600 pages.The book concerns the lives of a small group of characters centered around Gabe Wallach, son of a fairly affluent New York dentist who recently lost his mother to cancer when the story opens. Wallach is a graduate student in literature who for most of the book teaches at the University of Chicago. He has a romantic relationship with Martha, a divorced single mother of two young children, and gets involved in the lives of Paul and Libby Herz, a troubled mixed marriage (he's Jewish, she's Catholic) between a struggling fellow grad student and a psychologically and physically delicate young woman to whom Gabe is drawn.The plot moves through multiple perspectives as Roth focuses on reach of the main characters in turn. Several major plot turns toward the end of the book up the dramatic ante until the very end, where I though Roth basically abandoned ship.Still, this is a highly literate and engaging piece of work in the very early career of one of the most celebrated American writers of the second half of the 20th century and well worth checking out."}, {"review_sentiment": 5.0, "review_text": "A supreme first novel by PR!  Sorry I waited this long to read it."}, {"review_sentiment": 3.0, "review_text": "Still one of my favorites, and it help launch my journey into the tools of letting go.One of my favorite tools of letting go of anything is what Hail Dwoskins called The Fifth Way.When you can see past the illusion of yourself as a separate \"me\" and stop, just for a moment, from coming from memory, you will find the truth of who you are. Here is a link to a recent video blog post I did on The Fifth Way: [...]"}, {"review_sentiment": 4.0, "review_text": "Impossible to get any solace from feeling sorry for oneself.Philip Roth's first novel, published 1962. A sprawling big thing. Great it may not be, but it is very readable. The man was a young genius in developing awkward situations in front of your eyes. A star was born.The structure could be seen as a bit overloaded. The novel is organized in 6 long chapters and short final one. I would like the book better without the final one. It gives the story a weird, unnecessary twist.Central man, around whom all stories are built, with him either in the center or in a tangent, is young Gabe Wallach. He is a grad student, then a teacher in the Midwest. He is independent due to an inheritance from his mother. He has a reputation as a bit of a playboy, though he is really more a pushover. His subject is literature, with a specialization on Henry James. That doesn't impact his own style much, and certainly not Roth's style. Roth is more down to earth, more attuned to our ears. In contrast, James' style is called 'virginal' here. Undeniable.Dialogues between Gabe and his widowed dentist father on the East Coast, whether on the phone, during visits, or in flashbacks, have an intense way of being tortuous and twisted.This turbulent father had been a man of extreme attitudes, like practicing yoga, or eating health food. On the other hand, the restraining, reasonable, solid mother with the moderate emotions held things together. All very good reasons for a son to run for distance, except that it leads to feelings of guilt.As troubled as his family life has been, and however far he tries to run from emotional entanglement,  in his 'own' life Gabe struggles too, with women, with friends, with colleagues. He let's people bother him with their problems. He can't let go. The book title lies.Most people in this big novel have couple problems. Most couples are religiously mixed, but that doesn't really take center stage. The general tone of the novel is people behaving in an awkward manner and communicating awkwardly. Their inability to talk reasonably about anything is quite painful. I suffered through so many quarrels, in this novel. Vague memories of my own student times. (I wouldn't have been able to tolerate any of Gabe's women. Impossible people!)Action gets sometimes exaggerated and becomes absurdly amusing or horribly slapsticky. Some of us were awkward when young. We are still young, so we keep being awkward. On the other hand, much of the trouble here would not have happened if people didn't marry so young. An American illness?While this novel is 50 years old, and is set in the 1950s, which sounds like a very finished period, the book doesn't appear dated in the least, apart from technicalities like cars and appliances. The reason could be this: it deals with issues that have not gone away."}, {"review_sentiment": 4.0, "review_text": "10th time I've read it since it came out.Always stands up!! This is his best book, and his first!"}]}, "authors": ["Philip Roth"], "isbn": "0679764178", "longitude": 0.0, "periods": ["1900s"], "title": "Letting Go", "word_cloud": "classic century view aspect jewish life write humor empathy turn ever put paragraph writer put entire always enjoy write early career opinion best go page lengthy excruciatingly detailed exposition emotional incompetence parade intensely annoy character call quits way go second problem character include main protagonist equally predictably uniformly tedious hang go back library tell page right describe truth many people live probably people live horror disappointment futile search peace comfort relationship search simplicity naturalness live complexity stumble difficulty true provide companionship good dog dog good novel enjoy read first work previous output consist short story novella mellifluous prose ear dialogue ability create interesting character put dramatic plausible situation make thoroughly enjoyable even concern live small group character center son fairly affluent dentist recently lose mother cancer story open graduate student literature teach romantic relationship divorce single mother young child get involve life trouble mixed marriage jewish struggle fellow grad student psychologically physically delicate young woman plot move multiple perspective focus reach main character turn several major plot turn end dramatic ante end basically abandon highly literate engage piece work early celebrated american writer second half century well check supreme first wait long still favorites help launch journey tool favorite tool anything call see past illusion separate stop moment come memory truth here link recent video blog post impossible solace feeling sorry first publish sprawl big thing man young genius develop awkward situation front eye star structure see bit overloaded organize long chapter short final one better final give story weird unnecessary man story build either center tangent young grad student teacher independent due inheritance mother reputation bit playboy really subject literature specialization impact style much certainly style earth attune ear contrast style call widow dentist father phone visit flashback intense way tortuous turbulent father man extreme attitude practice yoga eat health food hand restrain reasonable solid mother moderate emotion hold thing together all good reason son run distance lead feeling trouble family life however far try run emotional entanglement life struggle woman friend colleague people problem title people big couple problem most couple religiously mixed really take center stage general tone people behave awkward manner communicate awkwardly inability talk reasonably anything quite painful suffer many quarrel memory student time able woman impossible people get sometimes exaggerated becomes absurdly amuse horribly awkward young still young keep awkward hand much trouble people marry young american illness year old set sound finished period date least apart technicality car appliances reason issue go away time come stand best first", "genres": ["Fiction & Literature"], "summary": "Letting Go is Roth's first full-length novel, published just after Goodbye, Columbus, when he was twenty-nine. Set in 1950s Chicago, New York, and Iowa city, Letting Go presents as brilliant a fictional portrait as we have of a mid-century America defined by social and ethical constraints and by moral compulsions conspicuously different from those of today.\r\n\r\nNewly discharged from the Korean War army, reeling from his mother's recent death, freed from old attachments and hungrily seeking others, Gabe Wallach is drawn to Paul Herz, a fellow graduate student in literature, and to Libby, Paul's moody, intense wife. Gabe's desire to be connected to the ordered \"world of feeling\" that he finds in books is first tested vicariously by the anarchy of the Herzes' struggles with responsible adulthood and then by his own eager love affairs. \r\n\r\nDriven by the desire to live seriously and act generously, Gabe meets an impassable test in the person of Martha Reganhart, a spirited, outspoken, divorced mother of two, a formidable woman who, according to critic James Atlas, is masterfully portrayed with \"depth and resonance.\"\r\n\r\nThe complex liason between Gabe and Martha and Gabe's moral enthusiasm for the trials of others are at the heart of this tragically comic work.", "asin": "0679764178", "rank": "835387", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41LznUNojLL.jpg", "country": "Chicago", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}