{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 18, "rating": 3.4, "reviews": [{"review_sentiment": 1.0, "review_text": "This book goes nowhere. The characters are unlikable & one dimensional. It hurt my head to discern why anything any of these people were doing had any importance. U want to read about Hawaii? There are a many other BETTER well-researched & articulated books about Hawaii. I gave this book a 1/2 out of 5 stars in m book club. Author puts herself in the story, then dwells on it, is infatuated w/the protagonist = who is vapid; storyline/plot = have no idea what it was, just killing time. You will never get these hours back--read something else fun, educational, informative, interesting or even sexy. This book is just a jumble of words without any meaning."}, {"review_sentiment": 1.0, "review_text": "Rare is the occasion I stop reading a book in the middle, especially one this short. Alas, nothing in the tale made me care about any of the characters, so why keep reading? Not only are they woefully undeveloped and ill-described, but the surnames are also confusing. I love the way Didion coins a phrase and effectively drops in slang, colloquialisms, etc., but not enough to care about a half-baked effort like Democracy. My books-to-read list if far too long to waste time on that. Even though this is a short read, you may want to move onto something more well-crafted. I know I did."}, {"review_sentiment": 5.0, "review_text": "Brilliant"}, {"review_sentiment": 1.0, "review_text": "Worst. Book. Ever."}, {"review_sentiment": 5.0, "review_text": "Just another great Didion tale. This one, of an Hawaiian WASP family and their travails. One of the great writers of our time."}, {"review_sentiment": 5.0, "review_text": "MS. DIDION A GREAT WRITER OF THE 60'S AND BEYOND...DESERVING TO BE READ"}, {"review_sentiment": 5.0, "review_text": "I have four of of Didion's five novels (I haven't read the first one yet) and this is my favorite. And although I haven't yet read all of her non-fiction, this is my favorite so far of any of her books.The writing is pristine. It is very spare. Every word, every sentence well chosen.There actually isn't much of a story. It's more a study in character. It's really more like a long short story than a novel.But it held my interest throughout.If you love the craftsmanship of writing, include this book on your list of great examples."}, {"review_sentiment": 5.0, "review_text": "Absolutely gorgeous."}, {"review_sentiment": 4.0, "review_text": "Enjoyed the book, but it is not at the same level as Didion's essays which are masterful.  The fictional Joan Didion that is inside the pages of the novel is an interesting ploy but becomes a little tiresome as the book continues.  If looking for thought-provoking employment of metafiction I'd go for Pale Fire or If on a Winter's Night a Traveller."}, {"review_sentiment": 1.0, "review_text": "I'm not sure why authors write books like these. I suppose there's a fair amount of people out there willing to read books that are more like cryptic self biographical puzzles."}]}, "authors": ["Joan Didion"], "isbn": "0679754857", "longitude": -157.8556764, "periods": ["1900s"], "title": "Democracy", "word_cloud": "go nowhere character unlikable dimensional hurt head discern anything people importance want many articulate give star club put story dwells infatuated protagonist vapid idea kill time never get hour back something else fun educational informative interest even jumble word mean rare occasion stop read middle especially short nothing tale make care character read not woefully undeveloped surname also confuse love way coin effectively drop slang colloquialism enough care effort list far long waste time even short move something know brilliant just great tale hawaiian family travail great writer time novel first favorite yet favorite far write pristine spare word sentence well actually much story study character really long short story hold interest love craftsmanship write include list great example absolutely gorgeous level essay fictional page interest ploy become little tiresome continue look employment meta fiction go pale sure author write suppose fair amount people willing cryptic self biographical puzzle", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "Inez Victor knows that the major casualty of the political life is memory. But the people around Inez have made careers out of losing track. Her senator husband wants to forget the failure of his last bid for the presidency. Her husband's handler would like the press to forget that Inez's father is a murderer. And, in 1975, the year in which much of this bitterly funny novel is set, America is doing its best to lose track of its one-time client, the lethally hemorrhaging republic of South Vietnam.\r\n\r\nAs conceived by Joan Didion, these personages and events constitute the terminal fallout of democracy, a fallout that also includes fact-finding junkets, senatorial groupies, the international arms market, and the Orwellian newspeak of the political class. \r\n\r\nMoving deftly from Honolulu to Jakarta, between romance, farce, and tragedy, Democracy is a tour de force from a writer who can dissect an entire society with a single phrase.\r\n\r\n\"A gem . . . a beautifully composed story that moves with effortless authority and becomes astonishingly moving. . . . Stirring and memorable.\" Newsday\r\n", "asin": "0679754857", "rank": "93976", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51GMUZZw9gL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}