{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1392, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "A very enjoyable read. Reminiscent in some ways of The Grapes of Wrath. Kept my attention throughout. A must read for fans of American literature."}, {"review_sentiment": 5.0, "review_text": "Many people are confused by \"my mother is a fish.\"  I believe it's an idea that when reading Faulkner to look for answers from the author.  Although the complete answer is a Faulkner sentence or two of considerable length, I'll just butcher it somewhat mercilessly.  You may find the entire passage in Chapter 5 of Absalom, Absalom, and references in other works as well.  Take it or leave it as a possible source for consideration:\"...; I gestate and complete, not aged, just overdue because of some caesarean lack, some cold head-nuzzling forceps of the savage time which should have torn me free, I waited not for light but for the doom which we call female victory which is:  endure and then endure, without rhyme or reason or hope of reward -- and then endure:  I like that blind subterranean fish, that insulated spark whose origin the fish no longer remembers, which pulses and beats at its crepuscular and lethargic tenement with the old unsleeping itch which has no words to speak with other than 'This was called light,'...  no summer's caesarean lack which should have torn me, dead flesh and even embryo, from the living...\"  Much of the sentences' missing parts is inappropriate for quotation here since their beauty is ugly.  If you find this irrelevant, remember I didn't write it, I have read it in the other novel over many years.  Faulkner in my opinion is not one book to be read one time, it's all Faulkner books, like Proust continuous and circumambient (to borrow a Faulkner word.)  The objection, should one think, that Vardaman is a child, can be considered before adopting the knee-jerk dismissal of the passage.It is important I think that Miss Rosa is with Quentin Compson who is our \"drowning man,\" our Fisher King, at the moment she is either speaking or thinking this (since speech and internal monologue are worth consideration;) and of course the Quentins are best known from The Sound and the Fury, not the only way these three novels connect. Quentins?  There are the Quentin and Quentin not Quentin to keep in mind as well."}, {"review_sentiment": 5.0, "review_text": "Book was in excellent conditionLove the story itself, can’t wait to read it again"}, {"review_sentiment": 1.0, "review_text": "This is NOT the entire book, \"Appendix: Compton 1699 -1945\" is NOT included.  Very irritating, a total ripoff. AVOID AVOID"}, {"review_sentiment": 3.0, "review_text": "The language of this book is beautiful. Sometimes it was so poetic I had to read a sentence over again just for how the words felt. Sometimes it described a universal feeling I had never seen put into words so perfectly before. Sometimes it was so strongly a dialect that it made my grammar-brain twitch, but even then I enjoyed how it was not the mere semblance of dialect which is so frequently used. The book is told in many different voices, too many to count (though I’m sure someone has). Yet each voice is unique, not only in language but in tone and understanding as well. I was very impressed by this.That said, the story is somewhat disappointing. The wife/mother of the Budren family has died and she wanted to be buried in her hometown, so the family sets out in a mule-drawn wagon carrying her coffin. It has been and is raining heavily, all the bridges are out, and the story follows the family as they find ways around the difficulties they encounter on the road. However, the voices, and when the switches between them are placed, are used to obscure the reality of the action. Most of the reader’s time is spent figuring out what is going on and who each character really is. None of the characters develop in the course of the story; what they are and have always been is merely slowly revealed to the reader. Things happen to them, but the purpose of each event is not to change them but to show who they have always been. This static state frustrated me.I enjoyed the language of the story and the voices very much, but that is as deep as the book went. I rate this book 5/10."}, {"review_sentiment": 1.0, "review_text": "I accidentally ordered this and tried to cancel but couldn't"}, {"review_sentiment": 5.0, "review_text": "Visceral and poetic.  I love this book."}, {"review_sentiment": 5.0, "review_text": "I am quite happy with this CD and I'm really glad I made the decision to purchase it."}, {"review_sentiment": 3.0, "review_text": "I give “The Sound and the Fury” by Faulkner 3 stars.  Each of the four stories are good and rate at least 4 stars alone.  Due to the different writing styles, mixing times periods for the different sections and not including a simple table of contents makes the book as a whole come off as something just thrown together to publish.  Not a polished work and therefor only 3 stars at best."}, {"review_sentiment": 4.0, "review_text": "I heard about this book for a few years, basically because people said that Faulkner was a racist due to the use of N word in his books, especially this one. But if Toni Morrison finds Faulkner a great writer then I felt I should give him a try. I did research first and learned his writing reflected his time or the time era of his stories. This is when I decided to give this book a shot and glad I did. The N word is in the book but not in a derogatory way I was expecting from what I read. Enough about that.The characters are well written as well as the story or he wouldn't be the great writer he is. Faulkner makes you feel like you are there with the characters and in that time. As you read you will forget the year you are in, that's how much he draws you in to his characters and their stories.Excellent read and a must read for everyone."}]}, "authors": ["William Faulkner"], "isbn": "067964248X", "longitude": 0.0, "periods": ["1900s"], "title": "Light in August", "word_cloud": "enjoyable way attention american literature many people confuse fish believe idea reading look answer author complete answer sentence considerable length butcher somewhat mercilessly entire passage chapter reference work well leave possible source consideration gestate complete age overdue cesarean lack cold forceps savage time torn free wait doom call female victory endure endure rhyme reason hope endure like blind subterranean fish insulate spark origin fish longer remembers pulse beat crepuscular lethargic tenement old unseeing itch word speak call summer cesarean lack torn dead flesh even embryo live much sentence miss part inappropriate quotation beauty ugly find irrelevant remember write many year opinion time continuous circumambient borrow word objection think child consider adopt dismissal important think drown man moment either speak think speech internal monologue worth consideration course best know way novel connect quentin mind well excellent condition love story wait entire include very irritate total ripoff language beautiful sometimes poetic sentence word felt sometimes describe universal feeling never see put word perfectly sometimes strongly dialect make twitch even enjoy mere semblance dialect frequently use told many different voice many count sure someone voice unique language tone understand well impress say story somewhat disappoint family die want bury hometown family set wagon carry coffin rain heavily bridge story follow family way difficulty encounter road however voice switch place used obscure reality action time spent figure go character really character develop course story always merely slowly reveal happen purpose event change show always static state frustrate enjoyed language story voice much deep go rate accidentally order tried cancel poetic love quite happy cd really make decision purchase give star story good rate least star alone different writing style mix time period different section include simple table content make whole something together publish not polished work therefor star best hear year basically people say racist due use word especially find great writer felt give try research first learn write reflected time time era stories decide give shot glad word derogatory way expect enough character well write well story great writer make feel character time forget year much draw character everyone", "genres": ["Fiction & Literature"], "summary": "\r\nOne of William Faulkner’s most admired and accessible novels, Light in August reveals the great American author at the height of his powers. Lena Grove’s resolute search for the father of her unborn child begets a rich, poignant, and ultimately hopeful story of perseverance in the face of mortality. \r\n\r\nIt also acquaints us with several of Faulkner’s most unforgettable characters, including the Reverend Gail Hightower, plagued by visions of Confederate horsemen, and Joe Christmas, a ragged, itinerant soul obsessed with his mixed-race ancestry. Powerfully entwining these characters’ stories, Light in August brings to life Faulkner’s imaginary South, one of literature’s great invented landscapes, in all of its unerringly fascinating glory - Yoknapatawpha County.\r\n\r\nAlong with a new Foreword by C. E. Morgan, this edition reproduces the corrected text of Light in August as established in 1985 by Faulkner expert Noel Polk.", "asin": "067964248X", "rank": "464174", "city": "Lafayette County", "image": "https://images-na.ssl-images-amazon.com/images/I/51AcLFASuML.jpg", "country": "MS", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}