{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 24.5895489, "ratings": {"num_ratings": 19, "rating": 3.2, "reviews": [{"review_sentiment": 1.0, "review_text": "Context of time and location is all over the place. Boring as well. Some good knowledge of and interest in WW2 era is helpful. I read for pleasure, therefore did not finish this book."}, {"review_sentiment": 4.0, "review_text": "This book is a rarity-- experimental writing that isn't boring.  That's because Didion isn't playing with words as with most experimental writing, but working them to show us \"the way we live now,\" which is the classic novel's function but which the classic novel can't do anymore.  Normal human existence today doesn't occur in the classic novel's milieu, which was a largely natural world mitigated by culture. Even in John D. MacDonald's 1960s thrillers, the characters interacted in piney woods, cypress strands, and turtle glass flats as well as marinas, high rises, and condos.  But-- in Didion's book-- the motels, airports, hospitals, marinas, high rises and condos have pretty much blocked out the other stuff, as far as most human activity goes.  So the traditional dramatic narrative becomes artificial, sentimental, as she says.  The \"natural\" way to describe such activity is as reports, dossiers, files, as in this book.  Now,  instead of mitigating nature,  culture has begun to mimic nature's more lethal abstract qualities-- predation, storms, temblors.  That might seem an \"end to nature,\" as the popular catchword has it.  But, as Didion's fascination with disasters implies, nature is still out there, behind the seawalls, as she might say: \"waiting.\""}, {"review_sentiment": 3.0, "review_text": "If you have read a number of Joan Didion novels, particularly starting in the 1980s, she turns her attention progressively on our neighbors in to the south, and American meddling in their internal affairs.  This is certainly the case in The Last Thing He Wanted, which chronicles the mishaps of a novice on the scene of international arms smuggling on an unnamed Caribbean Island.As many commentators have said, there are deep shades of Graham Greene in this novel (and most of the other novels she has written in this vein).  For someone moving through Didion's oeuvre, there is not anything new to stimulate.  If you are coming to Didion fresh, no doubt you are in for an interesting ride.  Didion had a terse way of building narrative tension.  She moves back and forth in time effortlessly, allowing the reader to see every nook and cranny of her created world.However, if you have read her a great deal, this world is a repeat.  Her concerns in this period are rather narrow, and it comes across in this novel."}, {"review_sentiment": 3.0, "review_text": "Joan Didion is that rare thing: an American woman of letters whose pronouncements on that country's way of life are considered to bear great weight.  Journalist, essayist, novelist and columnist, her intelligent and perceptive observations have probed her nation's psyche for three decades.In this, her 10th book and fifth novel, she turns a fictional probe on the machinations of American politics in the Orwellian significant year of 1984.  The story takes in the workings of US central administration and international diplomacy, as well as the American media and the shady operators who work on the fringes of State corruption.Elena McMahon is a journalist reporting on the presidential election campaign when, to oblige her father, Dick, who \"does deals\", she goes to Central America in his stead.  There she find herself adrift, a pawn in a game with rules she can only begin to grasp, at the heart of an arms trafficking operation and a political conspiracy around Treat Morrison, American Ambassador-At-Large.Elena's story is related by an unnamed, \"not quite omniscient author... who wanted the story to materialise for you [reader] as it did for me [narrator]\".  The novel employs such tricks throughout, calling attention to an awareness of its own methods and questioning the conventions of all modern narrative forms - fiction, journalism, thriller writing, reportage, even film scripts.  \"What we want here is a montage, music over,\" begins one chapter.  \"Angle on Elena.  Alone on the dock... taking of her scarf and shaking out her hair.\"Didion is a superb stylist with a number of signature techniques, the most characteristic being the way she repeats key phrases with minute but important variations.  With each repetition a seemingly innocuous phrase - \"Christ, what business are they all in?\"  or \"My understanding is that Dick McMahon will not be a problem\"  - becomes ever more significant.  Beginning with Elena's meeting with Treat Morrison, the narrative moves forward and back in time, layering phrases and events on top of each other with an incancatory rhythm.  The effect is to engender in the reader first suspicion, then dread, and finally understanding.The climax of the novel - the last outcome, Treat Morrison tells us, that he would have wanted - is not unexpected, it has in fact been flagged for us on page 15.  But the reasons that it happens are presented through a finely woven web of intrigue and counter-intrigue.  Through dark details, quiet understatement and subtle ironies Elena's entrapment within this complex web is revealed.Nobody could fault Didion's technical skill.  But this reader was left with a \"so-what\" feeling on finishing this book.  Yes, American politics is rotten.  Yes, what happened to Elena is terrible.  But we are no more moved by her fate than we would be by an in-depth newspaper report.In her journalism and essays, Didion's techniques are illuminating, her intelligence flashing light on the murkier corners of American life.  But fiction can deal only secondarily with the national character; its first duty is to its own characters, and in the best fiction characters are more than just vehicles for ideas, which is essentially what Elena, Treat and the rest turn out to be.  Didion's technical brilliance may disguise this but ultimately does not compensate for it.  Here, rather than illuminating, it obscures.This novel is a cold and clever exploration of the USA's heart of darkness but those who expect novels to also reveal something of the human heart will be disappointed."}, {"review_sentiment": 5.0, "review_text": "Joan Didion, author of Slouching Towards Bethlehem: Essays (FSG Classics), and several others, is one of America's most incisive contemporary novelists. She wrote this novel in the late `90's; the setting is in the previous decade, and concerns the actions of a few individuals working in conformance with America's unofficial policies of maintaining pliable power elites in the countries of \"mare nostrum,\" the Caribbean. When \"the cover\" was blown on some of the most egregious of these actions, in the `80's,  the media adopted the label \"Iran-Contra\" for them. That label covered the selling of arms to Iran, America's purported enemy of the time (and still?), and channeling the proceeds to fund the \"Contras,\" call them rebels, terrorists or freedom-fighters, take you pick based on your political persuasion, who were trying to overthrow the government of Nicaragua, run by Daniel Ortega and the \"Sandinistas.\"  Ortega was \"unfriendly\" to the interest of America's power elites, which all too often means giving a fair shake to the non-power elites in his own country.Didion's novel is a depiction of that dark underbelly of American foreign policy (for sure, carping about \"human rights\" plays no part) \"necessary\" to maintaining \"friendly\" governments. There are the machinations of the CIA; there are the \"free-market\" hustlers that are the arms dealers, still hoping to draw that card so high and wild they'll never have to deal another. There are the surreal conversations about the market falling on the price of anti-personnel mines (`69's) from three dollars to two, each. There is the complicity of our embassy personnel in all these activities, the clock and dagger actions that take place in transit lounges, the crosses and double-crosses. There is Treat Morrison, drawn to the action for the adrenalin rush, with a chip on his shoulder for the \"Harvard guys who never listen.\" There is the pony-tailed guy \"on his way home from Angola\" who was once in the 25th Infantry Division, \"Tropic Lightning.\" And there is the principal character, Elena McMahon, who as a journalist walked away from covering the '84 campaign, and got sucked into helping dad close his \"million dollar deal.\" Overall, a real \"witch's brew.\"And the author demonstrates such deft mastery in handling this \"witch's brew.\" Her prose is lean. She \"backs and fills\" her story, a foreshadow here, a reminder there where the pieces of her tale are. She has an uncanny ear for dialogue, capturing the essentials to reveal character. She maintains dramatic tension throughout, of a \"thriller\" variety, but with far more insights. I'm amazed that she has drawn some 1-star reviews, which only proves she is not for everyone. She has famously embraced much of what is referred to as a \"southern California lifestyle,\" yet is a critical observer not only of that \"scene,\" but ones seemingly far removed, including the inner working of government, whose \"players\" value opacity, and speak in the conditional mood, or, as she says: \"...entire layers of bureaucracy dedicated to the principle that self-perpetuation depended on the ability not to elucidate but to obscure.\"Comparisons with Graham Greene are more than appropriate, particularly the character Alden Pyle in The Quiet American (Penguin Classics Deluxe Edition).  Consider: \"Not dishonest in the sense that he `lied,' or deliberately misrepresented events as he himself construed them...but dishonest in the more radical sense, dishonest in that he remained incapable of seeing the thing straight.\" On the other hand, a jab at fixating on the wrong historical analogy: \"After that you move past it. You know who the unreported casualties of Vietnam were? Reporters and policy guys who didn't move past it.\" And, apocryphal, or no, loved her jabs at the Rand Corporation, with their \"the Del,\" that is, the Delphi Method, for predicting future events, and even the study group on \"Ap Tech--Uses and Misuses\" (i.e., no technological transfers to the Third World since they wouldn't understand them!)It is another great work from Ms. Didion. A great \"thriller,\" yes, but far more so, probably more \"truth\" about Iran-Contra, one more aspect of America's \"bad faith\" dealing with Latin America, than we will ever get from 10 Congressional investigating committees. It was a wonderful re-read; 5-stars plus."}, {"review_sentiment": 5.0, "review_text": "This is the first Joan Didion book I've read; my impression is that she is a master stylist.This is the story of Elena Kagan, reporter, wife of a powerful oilman, daughter of a small-time arms dealer, an ambitious, effective woman but not quite effective enough; this is the story of an \"incident\" in the Caribbean, of the unofficial doings of the U.S. State Department, of human behavior at the intersection of power and fear.  The experience of living under the shadow of family secrets that you don't dare uncover.  It's also about journalism, truth, memory, history, the inevitable failure to get the facts down honestly and whatever drives us to try nonetheless -- and therefore also about writing itself.It's a strange and perfect little book, highly recommended."}, {"review_sentiment": 3.0, "review_text": "Didion is a masterful writer, but after reading this one I'm beginning to agree with another reviewer who felt she does better with nonfiction.  The Last Thing He Wanted reminded me a lot of The Book of Common Prayer, with its odd, drifting, off-kilter women out of their league in out-of-the way, seedy, menacing tropical locations.  In both cases there's a lot of mood, but not too much else.The subject matter--a covert arms deal during the the Reagan years--seems dated to me; a sordid little chapter in American history that I have little interest in revisiting. I'm not sure why Didion felt it was a great premise for a novel when she wrote it more than a decade later.  But, I thought, in the hands of a great writer, almost anything can be interesting.  And Didion is a great writer. I loved The White Album, for example. But for me, her greatness lies in her spare, pointed, insightful, dry style. Here, her style is anything but direct; instead, she takes forever to convey what's going on, repeating phrases incessantly, burying the thin plot with self-conscious literary devices.  I can enjoy style for the sake of style, but here, it just didn't work for me.  I found it labored and difficult to little effect. It was too hard to care about anyone in the story enough to want to follow along with her gimmicky prose.  I'll definitely read more Didion, but I'll think twice before reading another novel that's anything like this one."}, {"review_sentiment": 5.0, "review_text": "In my view, Didion is as close to perfect as any living writer, and this book represents the top of her form.  It is a quiet book, its excellence pervasive but never showy.The fact that this book has averaged three stars here says something about amazon but little about the book.  Perhaps I shouldn't criticize - the level of discourse is higher than, say, youtube."}, {"review_sentiment": 5.0, "review_text": "This is a great read. I wasn't sure if I was interested in the subject (not a big fan of conspiracy theories or the mid-80's), but I wanted to read a Joan Didion novel and this is the one that was on the shelf. I loved it. Reading this novel is like being Elena McMahon/Elise Meyer for 227 pages; her dreams and memories, the catch-phrases. A definite must-read."}, {"review_sentiment": 3.0, "review_text": "I have read several of Didion's non-fiction essay collections and this was the second of the writer's novels for me, after \"Play It As It Lays.\"  Reading \"The Last Thing\" made me feel stupid, and thus I was relieved to see that it averaged only three stars and that I was not the only one who found the prose somewhat irritating and the non-linear narrative quite confusing (for me, this was compounded by the fact that after putting it down I was generally not in a hurry to pick it up again).  While I cared about the heroine, Elena, I gave up caring when it was revealed that so-and-so was really someone else, chiefly because these revelations were usually delivered much after the fact and in a way that seemed airless.  Similar to \"Play It As It Lays\" (which is told in a generally linear fashion), Didion is masterful at instilling a sense of profound dread in the reader as the main character's world unravels and foreshadows her ultimate fate.  However, Didion's usual bag of tricks, such as beginning a series of sentences with the same clause, repeating a quote/thought almost obsessively (\"We used to have a real life and just because I'm your daughter I'm supposed to like it and I don't\"), and cryptic sentences didn't seem to work here.  One wants her to just get to the point.  If you have never read Didion fiction I would recommend you start with the classic \"Play It As It Lays.\"  If you read \"Last Thing\" first you may never read another Didion anything, and that would be a damn shame."}]}, "authors": ["Joan Didion"], "isbn": "0679752854", "longitude": -107.3920441, "periods": ["1900s"], "title": "The Last Thing He Wanted", "word_cloud": "context time location place well good knowledge interest era helpful pleasure therefore finish rarity experimental write boring playing word experimental write work show way live classic function classic anymore human existence today occur classic milieu largely natural world mitigate culture even thrillers character interact piney wood cypress strand turtle glass flat well marina high rise condos motel airports hospital marinas high rise condos pretty much block stuff far human activity go so traditional dramatic narrative becomes artificial sentimental say natural way describe activity report dossier file now instead mitigate nature culture begin mimic nature lethal abstract quality depredation storm temblor end nature popular catchword fascination disaster implies nature still seawall wait number novel particularly start turn attention progressively neighbor south american meddling internal affair certainly case chronicle mishap novice scene international arm smuggle unnamed many commentator say deep shade novel write vein someone move anything new stimulate coming fresh doubt interest ride terse way build narrative tension move back forth time effortlessly allow nook cranny create great deal world repeat concern period rather narrow come rare american woman letter pronouncement country way life consider bear great weight essayist novelist columnist intelligent perceptive observation probe nation psyche fifth turn fictional probe machination american politics orwellian significant year story take working central administration international diplomacy well american medium shady operator work fringe journalist report presidential election campaign oblige father deal go stead find adrift pawn game rule begin grasp heart arm traffic operation political conspiracy story relate unnamed quite omniscient author story materialist narrator employ trick call attention awareness method question convention modern narrative form fiction journalism thriller writing reportage even film script want montage music begin chapter dock take scarf shake hair superb stylist number signature technique characteristic way repeat key phrase minute important variation repetition seemingly innocuous phrase business understanding problem become ever significant meeting narrative move forward back time layering phrase event top incancatory rhythm effect engender first suspicion dread finally climax outcome tell unexpected fact flag page reason happen present finely woven web intrigue dark detail quiet understatement subtle irony entrapment complex web technical skill leave feeling finishing yes american politics rotten happen terrible moved fate newspaper journalism essay technique illuminate intelligence flash light murkier corner american life fiction deal secondarily national character first duty character best fiction character vehicle idea essentially rest turn technical brilliance ultimately compensate here rather illuminate cold clever exploration heart darkness expect novel also reveal something human heart disappoint author several others incisive contemporary novelist write late setting previous decade concern action individual work conformance unofficial policy maintain pliable power elites country mare nostrum cover blown egregious action medium adopt label label cover sell arm purport enemy time still channel proceeds fund call rebel terrorist take pick base political persuasion try overthrow government run unfriendly interest power elite often mean give fair shake elites depiction dark underbelly american foreign policy sure carp human right play part necessary maintain friendly government machination hustler arm dealer still hop draw card high wild never deal surreal conversation market fall price mine dollar complicity embassy personnel activity clock dagger action take place transit lounge cross drawn action adrenalin rush chip guy never listen guy way home principal character journalist walk cover campaign get sucked help dad close dollar deal overall real witch brew author demonstrate deft mastery handle witch brew prose lean back fill story foreshadow reminder piece tale uncanny ear dialogue capture essential reveal character maintain dramatic tension thriller variety far insight amaze drawn review prove everyone famously embrace much refer southern lifestyle yet critical observer scene one seemingly far remove include inner working government player value opacity speak conditional mood say entire layer bureaucracy dedicate principle depend ability elucidate obscure appropriate particularly character quiet american not dishonest sense deliberately misrepresent event construe dishonest radical sense dishonest remain incapable see straight hand jab fixating wrong historical analogy move know unreported casualty policy guy move past apocryphal love jab predict future event even study group use technological transfer great work great thriller yes far probably truth aspect bad faith deal ever get congressional investigating committee wonderful first impression master story reporter wife powerful oilman daughter arm dealer ambitious effective woman quite effective enough story incident unofficial doings human behavior intersection power fear experience live shadow family secret dare also journalism truth memory history inevitable failure fact honestly drive try nonetheless therefore also write strange perfect little highly recommend masterful writer read begin agree reviewer felt better nonfiction remind lot odd drift woman league way seedy menace tropical location case lot mood much subject matter covert arm deal year seem dated sordid little chapter american history little interest revisit sure felt great premise write decade later think hand great writer almost anything interesting great writer love example greatness lie spare point insightful dry style here style anything direct instead take forever convey go repeat phrase incessantly bury thin plot literary device enjoy style sake style work find labor difficult little effect hard care anyone story enough want gimmicky prose definitely dijon think twice read anything view close perfect living writer represent top form quiet excellence pervasive never fact average star say something amazon little perhaps criticize level discourse higher say you tube great sure interested subject big fan conspiracy theory shelf love read page dream memory definite several essay collection second writer novel play lay read make feel stupid thus relieve averaged star find somewhat irritating narrative quite confuse compound fact put generally hurry pick care heroine give care reveal really someone else chiefly revelation usually deliver much fact way seem airless lay tell generally linear fashion masterful instill sense profound dread main character world unravels foreshadows ultimate fate however usual bag trick begin series sentence clause repeat almost obsessively use real life daughter suppose cryptic sentence seem want point never fiction start classic play lay first never dijon anything shame", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "Action & Adventure"], "summary": "In her first novel in twelve years, the legendary author of Play It As It Lays and Slouching Toward Bethlehem trains her eye on the far frontiers of the Monroe Doctrine, where history dissolves into conspiracy (Dallas in 1963, Iran Contra in 1984), and fashions a moral thriller as hypnotic and provacative as any by Joseph Conrad or Graham Greene.\r\n\r\nIn that latter year Elena McMahon walks off the presidential campaign she has been covering for a major newspaper to do a favor for her father. Elena's father does deals. And it is while acting as his agent in one such deal—a deal that shortly goes spectacularly wrong—that she finds herself on an island off the coast of Costa Rica where tourism has been superseded by arms dealing, covert action, and assassination. The Last Thing He Wanted is a tour de force—persuasive in its detail, dazzling in its ambiguities, enchanting in its style.\r\n\r\n\"Simultaneously lucid and surreal . . . the result is entrancing.\" The New Yorker ", "asin": "0679752854", "rank": "631675", "city": "Costa Rica", "image": "https://images-na.ssl-images-amazon.com/images/I/519AhwSyRxL.jpg", "country": "Mexico", "story_arc": ["Tragedy", "Things only get worse"]}