{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 19, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book about my home town by a superb writer"}, {"review_sentiment": 4.0, "review_text": "This was written some time ago, but much of it is relevant to today - especially as we currently have two Cubans running for the presidency. If either of them get close then this book becomes required reading.Joan Didion's writing style is probably not for everyone, but if you stick with it for a few chapters you'll pick up the harmonics and find yourself wondering if maybe you should check out some of her other books as well. One I enjoyed was the White Album. Among the great images she implants in your mind is a tour she took of Ronald and Nancy Reagan's house in Sacramento. She noted how there were no bookcases, and therefore no books in evidence. How could this happen - that we would elect someone who doesn't read? Well it did happen, and it marks the point at which GOP voters started dumbing down and voting for people with whom they'd want to share a beer - and not someone with a vision, wisdom, and the skill to take this great experiment to the next level.We brought this greatly diminished GOP on ourselves, and it's up to us to fix it - and restore a loyal opposition that works for the common good.Brief rant aside, my recommendation is to read this book if you're interested in the backstory about the unusual relationship our elected and unelected officials have had with the Cuban community over the years."}, {"review_sentiment": 2.0, "review_text": "Book Club voted for this book because of all the interest in Cuba lately.  Joan Didion is always a difficult read.  She is brilliant and wants you to know it. Lots of multi syllable and Hispanic words, run-on sentences and convoluted double negative, sarcastic op-ed reporting. Couldn't make it through this dated book and neither did ANYONE else in the club, but we did learn some interesting Cuban history background."}, {"review_sentiment": 5.0, "review_text": "It does not get much better than Joan Didion. I love everything I've read that I've read by Ms. Didion."}, {"review_sentiment": 2.0, "review_text": "As the white Anglo Saxon perspective of a city that successfully blends two cultures it's no surprise to find racism disguised behind the mask of a liberal .What, there are people who don't speak English or agree with my politics, what is America coming to?  Ms Didion, who has never lived in South Florida, has written an embarrassing book that will look worse as time passes and America becomes multicultural."}, {"review_sentiment": 4.0, "review_text": "This is an essential book about Miami in the 70's and the 80's. It explores all the implication that the influx of Cuban nationals had on the tip of Florida, the drug trade, the economic boom and later the rise in crime. This books doesn't sugar coat anything, and after reading it, you actually feel that you know too much and your life is in danger. It portrays a compendium of news, since Didion was a journalist, and you are basically getting unbiased information. Great book and a must read to those interested in Miami, Florida, or interested in Cuban politics."}, {"review_sentiment": 2.0, "review_text": "I used to grab anything that Joan Didion wrote for the sheer pleasure of reading her stiletto-like prose, her sarcasm, and the intelligence of her observations.  However, I guess I'm over her; perhaps I've dumbed down, or perhaps this book is just too dated (it was written in 1987, and while the more things change the more they may stay the same, a great deal HAS changed).  At a minimum, I have to agree with Mr. Blanton's review in many respects; Ms. Didion is writing more for herself than for any reader, though I would add that what I used to think of as sarcasm now seems extremely holier-than-thou and so impressed with itself as to be off-putting to the max.I also have to assume that the book is a compilation of articles that were intended to be read over time - perhaps over a long time.  If that's correct, then putting them into book form does a disservice, because after a while you feel like you're reading the same thing over and over again.  The sense that you're being beaten over the head with repetitious and smug observations is overwhelming and makes for a most unsatisfying read.If you want to read the best of Joan Didion, go back to \"The White Album\" or \"Slouching Towards Bethlehem\" - though I'm not going to re-read them for fear that it really IS all over now."}, {"review_sentiment": 3.0, "review_text": "I lived there when all this was going on.  I felt the book jumped around a bit I wish there had been more time spent on each topic.  Living in Miami at this time was like living in anothercountry and I sometimes felt that the rest of the country did not even realize what was going on."}, {"review_sentiment": 4.0, "review_text": "Joan Didion's Miami is a hard hitting look at the political, social, and economic scene of the title city.  Written mostly about incidents and events which took place in the 1980s, it is difficult to tell how much of this book is still relevant.  Regardless, Didion takes on a complex topic,  handling the heady mixture of people and groups of exilic Cubans in Miami.Care should be taken when reading this book.  Because Didion uses a narrative voice very close to the people and organizations she is examining, it often appears that she is making derogatory or even racist remarks.  But she is merely taking the tone of the person, giving their voice some play in the narrative.  She keeps, more or less, her journalistic distance.All in all, this is a dense book that is not for everyone.  Unless you are a die-hard Didion fan, or have a vested interest in the scene in Miami (over twenty years ago) its concerns may be too remote."}, {"review_sentiment": 3.0, "review_text": "I was surprised I have not read it earlier,not The usual Anti-Exile/ProCastro slanted work such as Bardach's so-called ' \"Confidential\" work and other so-called \"Experts\" even though there is one quoted in this book Marifeli Stable-Perez From Acieto who in Exile circles is at best An Apologist for the regime and a Spy at Worst,yet her and other ProCastroites especially NonCubans write \"History\" about the island, The book is okay,written eloquently and even handed yet there is some subtle jabs here and there,perhaps a condescending tone if you will.And the author of course gives her jabs at Reagan(This book is 1987 and has not been Outdated)but she is equal in taking to task The so-called Kennedy Historians and shattering their Camelot myth with the \"Disposal\" problem and The Biggest Betrayal ever,there is also some interesting people interviewed for the book: one of Former President Carlos Prios Socarras Daugthers is in there who sadly is a Democrat and her then Husband Duran(ProDialogo Apologist) as well Dialogo/apologetic Bernado Benes. Sprinkle in the 1980 Riots(perhaps some sympathy for victim hood) some words such as the proletariat(always careful when you see such words they hint at the leanings)and Throwing lavish parties as if throwing a party should be a sin makes the book at times confusing,what is the approach and what was the author's conclusion? it seems more about Exiles yet titled Miami? perhaps an updated and better explanation would be in due order,Most of the Cubans Arriving now(I can say this I am Cuban) are not very productive more apologetic towards the regime downright appeasers and have made Miami Worst than even 1987 could have been,throw in the jungle elements arriving from third world countries and well you can imagine the Cuban Miami is now Worst,the intolerants who left should see it now(Anglo intolerance is pointed out as well as ignorance or apathy of the cause,yet the author should know the word A Mariel does not make sense but Marielito or If female Marielita,short on research.)A book that is worth a read,however brief and at times flawed nonetheless telling of the times and the Passion and the lack of passion for those who rather Appease than Fight."}]}, "authors": ["Joan Didion"], "isbn": "0679781803", "longitude": -80.1936589, "periods": ["1900s"], "title": "Miami", "word_cloud": "home town superb writer write time ago much relevant today especially currently run presidency get close becomes require write style probably everyone stick chapter pick harmonic find wonder maybe well enjoy great image implant tour take house note bookcase therefore evidence someone mark voter start numb vote people want share beer someone vision wisdom skill great experiment next brought greatly diminish fix restore loyal opposition work common rant aside recommendation interested backstory unusual relationship elect unelected official community year vote interest lately always difficult brilliant want know multi syllable hispanic word sentence convolute double negative sarcastic reporting dated else club learn interesting history background get much better love everything dijon white perspective city successfully blend culture surprise racism disguise mask liberal people speak english agree politics come never live write embarrass look worse time pass become multicultural essential explore implication influx national tip drug trade economic boom later crime sugar coat anything read actually know much life danger portray compendium news journalist basically get unbiased information interested politics use grab anything write sheer pleasure read prose sarcasm intelligence observation however guess perhaps numb perhaps date write thing change great deal change minimum agree review many respect write use think sarcasm seem extremely impressed also assume compilation article intend time perhaps long time correct put form disservice feel read thing sense beat head repetitious smug observation overwhelm make unsatisfying best back go fear really live go felt jump bit wish time spend topic live time live another country sometimes felt rest country even go hard hit political social economic scene title city mostly incidents event take place difficult tell much still relevant take complex topic handle heady mixture people group exile take reading use narrative voice close people organization examine often appear make derogatory even racist remark merely take tone person give voice play narrative keep le journalistic dense everyone fan vested interest scene year concern surprise earlier usual slanted work work even quote circle best apologist regime yet procastroites especially write island okay write eloquently even hand yet subtle jab perhaps condescend tone author course give jab equal taking task shatter myth problem ever also interest people interview sadly well perhaps sympathy victim hood word proletariat always careful see word leaning throw lavish party throw party sin make time confuse approach author conclusion seem yet title perhaps update better explanation order most arrive say productive apologetic towards regime downright appeaser make even jungle element arrive third world country well intolerant leave see intolerance point well ignorance apathy cause yet author know word make sense female short research worth however brief time flaw nonetheless tell time lack passion rather", "genres": ["Fiction & Literature", "Politics"], "summary": "It is where Fidel Castro raised money to overthrow Batista and where two generations of Castro's enemies have raised armies to overthrow him, so far without success. It is where the bitter opera of Cuban exile intersects with the cynicism of U.S. foreign policy. It is a city whose skyrocketing murder rate is fueled by the cocaine trade, racial discontent, and an undeclared war on the island ninety miles to the south. \r\n\r\nAs Didion follows Miami's drift into a Third World capital, she also locates its position in the secret history of the Cold War, from the Bay of Pigs to the Reagan doctrine and from the Kennedy assassination to the Watergate break-in. \r\n\r\nMiami is not just a portrait of a city, but a masterly study of immigration and exile, passion, hypocrisy, and political ", "asin": "0679781803", "rank": "332180", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZR3fIYSSL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}