{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 1424, "rating": 4.0, "reviews": [{"review_sentiment": 2.0, "review_text": "The book \"House On Mango Street\" was written by Sandra Cisneros. I recommend this book because it is very entertaining to read.  Esperanza moves to a house on Mango Street, but she isn't proud of it. She wants to live in a nice house and in a nice area. I liked how it showed her life as she grew up in this house, and the people she encountered were very interesting. What I didn't like was how it jumped around in time for almost every chapter. The writing style is unique and simple. The author's purpose is to tell the readers that there is life outside of what you're use to, so enjoy it. Finish school, and get a good career job.  I encourage you to read this book too. You'll most likely enjoy the characters, events, and plots of the story."}, {"review_sentiment": 5.0, "review_text": "Purchased for school reading program"}, {"review_sentiment": 5.0, "review_text": "This book was truly something. I had to read this for school, but after getting into the first few pages it became something I wanted to read and finish. I couldn't put it down in the end and I'm extremely glad I got to not only read this but Analyze it for a class .. this helped me understand this book so much more in depth."}, {"review_sentiment": 5.0, "review_text": "Need more books like this one."}, {"review_sentiment": 4.0, "review_text": "I enjoyed all the little stories in this book.  I could relate to many of them that took me back to my childhood and adolescence."}, {"review_sentiment": 2.0, "review_text": "Ok...not on my favorite list."}, {"review_sentiment": 4.0, "review_text": "The House on Mango Street by Sandra Cisneros has many themes and messages that make this book enjoyable and relatable.    The House on Mango Street through a series of vignettes covers a year in the life of Esperanza. Esperanza is a young Mexican-American girl growing up in Chicago who struggles to define herself. On page 109 it states,”I like to tell stories. I am going to tell you a story about a girl who didn't want to belong.” Esperanza expresses throughout the story that physically and emotionally she wants to leave Mango Street but finds herself writing as a way to accept and escape her neighborhood.    I found this book to very enjoyable. At first I thought this book was boring and I disliked how confusing it was. I didn't like how it was written in vignettes and how each event was so short and more like poetry. After re-reading the book I realized how the way it is written is very crucial to truly show Esperanzas growth and maturity throughout the story. For example, on page 98 it states,”And the garden that had been such a good place to play didn't seem mine either.” This vignette shows how Esperanza loses her innocent ideals about her friends after encountering a situation in the monkey garden with Sally and some boys.    In conclusion, I would definitely recommend this book to readers. It shows how the people you surround yourself with can influence your life even if it is just neighbors or someone you observe. We see Esperanza’s thinking change after making new friends and imitating what she sees others do. The book is very easy to finish in one sitting and it is written in a very descriptive manner that helps easily visualize the scenery."}, {"review_sentiment": 3.0, "review_text": "Daughter loved it. shipping in a flash"}, {"review_sentiment": 4.0, "review_text": "Picked up this book for National Hispanic Heritage Month and read it in Spanish. It was a great read and she should have a follow up book...Unless she already does.  Next on my list is Woman Hollering Creek.  And Caramelo is on my To Read List."}, {"review_sentiment": 4.0, "review_text": "I had to buy this book for school and I’m a kid who generally hates reading, but “The House on Mango Street” was surprisingly enjoyable. Sandra Cisneros did a fantastic job creating a character that a lot of people could relate to which is something that I LOVE in a novel of any genre. The only downside about the book is the chapter  “four skinny trees” which in my opinion was lacking structure with the whole book. I liked the tone that the overall chapter created and I like that it sounded a lot like prose poetry. But besides that he book is great. The main character Esperanza really caught my attention because I love her goal to become more independent and when she is telling us about how she hates her name and how it doesn’t like her name at all and how she feels like it doesn’t suit her. But this book, I was required to read it for my English class and I’m happy I was assigned this book."}]}, "authors": ["Sandra Cisneros"], "isbn": "0679734775", "longitude": -87.6244212, "periods": ["1900s"], "title": "The House on Mango Street", "word_cloud": "write recommend entertain move proud want live nice nice area like showed life grow people encounter interest like jump time almost chapter writing style unique simple author purpose tell reader life use enjoy school get good career job encourage likely enjoy character event plot story purchase school read program truly something school get first page become something want finish extremely glad get class help much depth need enjoy little story many take childhood adolescence favorite list many theme message make enjoyable repeatable series vignettes cover year life young girl grow struggle page state like story go tell story girl want express story physically emotionally want leave find write way escape neighborhood find enjoyable first think bore dislike confuse like write vignette event short poetry realize way write crucial truly show growth maturity story example page state garden good place play seem mine vignette show lose innocent ideal friend encounter situation monkey garden boys conclusion definitely reader show people surround influence life even neighbor someone observe see esperanza think change make new friend imitate see others easy finish sit write descriptive manner help easily scenery love shipping flash pick spanish great follow already list list buy school kid generally hat read surprisingly enjoyable fantastic job create character lot people something love downside chapter skinny tree opinion lack structure whole like tone overall chapter create like sound lot prose poetry besides great main character really catch attention love goal become independent tell hat name name feel suit require english class happy assign", "genres": ["Fiction & Literature"], "summary": "Acclaimed by critics, beloved by readers of all ages, taught everywhere from inner-city grade schools to universities across the country, and translated all over the world, The House on Mango Street is the remarkable story of Esperanza Cordero. \r\n\r\nTold in a series of vignettes – sometimes heartbreaking, sometimes deeply joyous – it is the story of a young Latina girl growing up in Chicago, inventing for herself who and what she will become. Few other books in our time have touched so many readers.\r\n\r\n“Cisneros draws on her rich [Latino] heritage . . . and seduces with precise, spare prose, creat[ing] unforgettable characters we want to lift off the page. She is not only a gifted writer, but an absolutely essential one.” The New York Times ", "asin": "0679734775", "rank": "1990", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51KEr5saI2L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}