{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 319, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "Not a bad book but not my favorite.  I didn’t find it that funny but maybe that is just me.Rachel Pregnant with her 2nd son discovers her husband, Mark, is having an affair.  Her husband wants to leave to go with the other woman.  You get a glimpse of the emotions she goes thru when she discovers her husband infidelities.  The hurt, anger, distrust, and finally realizing you have to just end it.  A nice short read."}, {"review_sentiment": 5.0, "review_text": "Anything written by the late Nora Ephron is a marvelous read."}, {"review_sentiment": 4.0, "review_text": "Easy read, humor and call it like it is!"}, {"review_sentiment": 5.0, "review_text": "headline:  GOOD BOOK  excellent writing,  truthful  and funny,"}, {"review_sentiment": 5.0, "review_text": "I love the author dry humor, plus I like the fact that she’s having some recipes to go along with the story. I managed to bake the cheesecake recipe, it was quite a hit in my house 👍😊"}, {"review_sentiment": 1.0, "review_text": "My wife and I tried to listen to this on a country road trip. Both of us had to stop it after 90 minutes. It was nothing but listening to a lady whine about other people. MS did an awesome job on the narration, the story line is terrible."}, {"review_sentiment": 5.0, "review_text": "But wanted the pain not to stop. Wanted to hear more of this story and wanted to know which parts were actually true."}, {"review_sentiment": 3.0, "review_text": "Very witty and easy read, but like Chinese food left you hungry after two hours."}, {"review_sentiment": 1.0, "review_text": "Didn't order this."}, {"review_sentiment": 3.0, "review_text": "Did not purchase"}]}, "authors": ["Nora Ephron"], "isbn": "0679767959", "longitude": -77.0366456, "periods": ["1900s"], "title": "Heartburn", "word_cloud": "not bad favorite find funny maybe son discovers husband affair husband want leave woman get glimpse emotion go thru discovers husband infidelities hurt anger distrust finally realize nice short anything write late marvelous easy humor call headline excellent write truthful funny love author dry humor like fact recipe go story manage bake recipe quite hit house wife try listen country road trip stop minute nothing listen lady whine people awesome job narration story line terrible want pain stop want hear story want know part actually true very witty easy chinese food leave hungry hour order purchase", "genres": ["Fiction & Literature", "Humour", "Politics", "Women's Fiction"], "summary": "Is it possible to write a sidesplitting novel about the breakup of the perfect marriage? If the writer is Nora Ephron, the answer is a resounding yes. For in this inspired confection of adultery, revenge, group therapy, and pot roast, the creator of Sleepless in Seattle reminds us that comedy depends on anguish as surely as a proper gravy depends on flour and butter.\r\n\r\nSeven months into her pregnancy, Rachel Samstat discovers that her husband, Mark, is in love with another woman. The fact that the other woman has \"a neck as long as an arm and a nose as long as a thumb and you should see her legs\" is no consolation. Food sometimes is, though, since Rachel writes cookbooks for a living. \r\n\r\nAnd in between trying to win Mark back and loudly wishing him dead, Ephron's irrepressible heroine offers some of her favorite recipes. Heartburn is a sinfully delicious novel, as soul-satisfying as mashed potatoes and as airy as a perfect soufflé.", "asin": "0679767959", "rank": "46372", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/41IFKvaGJ0L.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}