{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 15, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "But maybe not for all"}, {"review_sentiment": 4.0, "review_text": "This book is very entertaining. It seems to give the intellectual reactions of people in an occupied country. There seems to be a sexual interning."}, {"review_sentiment": 4.0, "review_text": "Got a newer edition than the one pictured"}, {"review_sentiment": 2.0, "review_text": "Most of this novella is the manic, nymphomaniacal rant of the character, Olga, she from whom Zuckerman is to retrieve a treasure-trove of short stories lest they be ground under the heel of Czechoslovakia's repressive Communist regime. But I have never been to Czechoslovakia and have, as a reader, no place to stand. Am I to regard the goings on in this fictional Prague as is any way representative of its people ? And if this is all some sort of literary lark, like Candy or Myra Breckinridge, why set up a plot I want to follow to its logical conclusion ? I don't get it. How can I know the dancer from the dance ?"}, {"review_sentiment": 5.0, "review_text": "How will you ever become a good writer if you are such a bad spy?Nathan Zuckerman has gone through his own personal difficulties as a writer, but now he is taught a lesson about real problems of this world when he meets a Czech exile writer who asks him to help smuggle out manuscripts that he hid in Prague. It is 1976 and Breshnev is still in full Stalinist glory. Oppression goes along with a dosis of anti- Semitism.But lest you anticipate a dour tale of politics, Roth bypasses your worries and finds an outrageous tone of satirical scorn. Scorn of the politics and amusement at the intellectuals with their bohemian antics. His tale of friends spying on each other is the funniest treatment of the subject that I remember.This novella is written in first person narrative as Zuckerman's diary from his Prague adventure. It is written as the epilogue to the trilogy 'Zuckerman Bound'. It is not meant to stand alone, but for most purposes, it does stand alone rather well. It is a tail that doesn't need the dog, it has an own life. Readers of Kundera, Kohout, Hrabal etc will appreciate it as a nice absurd outside view of their world and a contribution to it. It seems America's chief cultural contribution to the defeat of the empire of evil is the f- word.I don't know Philip Roth well yet. I am so far much impressed by his imaginative wordsmithing, though the semi permanent focus on two main subjects might become tiring. The joys of being Jewish in America, and the troubles with sex might not be enough to keep me going for many more volumes. This novella shows a way. There is more in P.N.Roth-Zuckerman."}, {"review_sentiment": 4.0, "review_text": "Philip Roth wrote three novels at three different times, \"The Ghost Writer\" (1979), \"Zuckerman Unbound\" (1981), and \"The Anatomy Lesson\" (1983) which, in 1985, he grouped together as a trilogy, \"Zuckerman Bound\". Roth also wrote and added a considerably shorter work to the trilogy, \"The Prague Orgy\" which he described as an \"Epilogue\". Usually printed as part of \"Zuckerman Bound\", \"The Prague Orgy\" was published as a stand-alone work in 1996.The primary character in each of these four works is Nathan Zuckerman, a novelist from Newark, New Jersey who bears resemblances to Roth himself. Each of the three full-length novels take place in the United States as Zuckerman at various points in his life reflects upon his writing, the relationship between imaginative writing and experience, and sex. The series pivots on Zuckerman's successful novel \"Carnovsky\" which garnered both high praise and sharp criticism. On his deathbed, Zuckerman's father cursed his son for the book. \"Carnovsky\" is a thinly-veiled reference to Roth's own \"Portnoy's Complaint\".\"The Prague Orgy\" extends its predecessors but differs from them as well. Roth sets most of the book in Prague, 1976, when Czechoslovakia was in the midst of the Soviet Union's communist domination. Much of the book turns on the plight of the writer under a ruthless communist regime and thus shifts from Zuckerman's preoccupation with his own writing and its relationship to his experience in the United States. The tension between the character Zuckerman and the author Roth also seems of less importance in this Epilogue than in the three books of the trilogy.Roth tends to be an inconsistent writer with his strong and weak moments. Readers frequently disagree about the merits of his various works.  With respect to \"The Prague Orgy\" Harold Bloom has praised the work highly as the climax of \"Zuckerman Bound\" while many other readers are puzzled by the book and find it a trifle. While the book is short, funny, and sharply written, I found it the most difficult work to read in \"Zuckerman Bound\". It is disjointed and episodic, deliberately so, and \"Kafkaesque\" to use an overworked term. The justification for the trite term is the prominent role given to Kafka and his Prague in the story.Roth presents the story as drawn \"from Zuckerman's notebooks\" which gives it its rambling, draft-like character. Zuckerman speaks in the first person. The book is in three sections, the first of which is set in New York City in January, 1976, while the two subsequent sections take place over two turbulent days in Prague on February 4-5, 1976.There is a tendency to rush over the New York section of the book as a prelude to what follows, but it is important in its own right. Zuckerman meets two Prague emigres,a man named Sisovsky and his female companion Eva Kalinova. Sisovsky wrote a book in 1967 which the communists suppressed, destroying his literary career. Kalinova was a renowned actress who left her husband for Sisovsky. The trio engage in much discussion about Zuckerman and the reception of \"Carnovsky\" while contrasting it with readers and the fate of writers under the communists. As the conversation progresses, Sisovsky says that his father had written several hundred stories in Yiddish that are hidden away with Olga, Sisovsky's ex-wife.  He claims that his father had been murdered by the Nazis and asks Zimmerman to try to retrieve the stories so that they may be saved and published.The remainder of the book recounts Zimmerman's efforts in Prague. The book opens with the \"orgy\" as disinherited and rejected writers and intellectuals meet clandestinely every week to commiserate and to engage in various forms of sex. Zimmerman meets Olga who immediately wants to sleep with him. In his brief sojourn, Zimmerman sees a society full of repression of thought, imposed conformity, but, apparently modest material prosperity on behalf of the populace. He is also followed and under immediate suspicion from the regime which deports him \"back to the little world around the corner.\"There is much in the story about the differing role of the artist in the United States and under communism, much surrealistic conversation among the many characters in this cluttered book, and much reflection by Zuckerman himself. The book is tinged with layers of irony. As the Czech minister of culture is about to throw Zuckerman out of the country he lectures on the nature of literature:\"In this small country the writers have a great burden to bear; they must not only make the country's literature, they must be the touchstone for general decency and public conscience. They occupy a high position in our national life because they are people who live beyond reproach.  Our writers are loved by their readers.  The country looks to them for moral leadership.  No, it is those who stand outside of the common life, that is who we all fear.  And we are right to.\"This is the voice of totalitarianism stifling thought and criticism. The irony, however, is that the culture minister's discussion of the function of literature has a good deal to commend it in a free democracy. The book suggests that American writers, with their freedom, tend to be too quick to criticise their country without trying to appreciate the virtues of a free, open culture. In his experience in Czechoslovakia, Zuckerman learns somehow about both the nature of communist repression and about the role of the writer in a free society, a subject which is implicit in the three books of the trilogy.This is my understanding of the short, elliptical Epilogue to \"Zuckerman Bound\". The work seems to me best read as initially intended as an epilogue to the three Zuckerman books rather than as a separate work in its own right.Robin Friedman"}, {"review_sentiment": 4.0, "review_text": "One cluster of Philip Roth's Zuckerman novels follows the writer Nathan Zuckerman through the career stages of young apprentice writer (THE GHOST WRITER), guilty successful rising novelist (ZUCKERMAN UNBOUND), and troubled and libidinous novelist with writer's block (THE ANATOMY LESSON). In each of these novels, Roth examines the nature of literary success while providing a backstory of associated family resentments and guilt.In the novella, THE PRAGUE ORGY, Roth examines Zuckerman in a new stage of his literary career. Specifically, TPO shows Zuckerman, now a renowned novelist, traveling to Communist Czechoslovakia in 1976. There, he tries to acquire hundreds of unpublished stories written by what another character calls the \"Yiddish Flaubert.\" Without Zuckerman's intervention, this literary and cultural trove may otherwise be lost through fickle communist censorship or their complicated stewardship by an alcoholic Czechoslovakian writer.Chronologically, TPO is a natural addition to this cluster of Zuckerman novels, functioning as the caboose to this short literary train. But thematically, TPO moves into new territory. In particular, this three-part novella shows the celebrity novelist Zuckerman: being manipulated by an émigré literary operator; encountering a demoralized and eviscerated cultural world in Communist Prague; and trying to understand his motivation and boundaries as he tries to smuggle the stories to the West. Roth, in other words, has shifted his focus from tortured literary ambition and success to what is primarily an examination of artistic endeavor in a police state. As a result, the emotional conflicts that make the other Zuckerman novels in this cluster so fascinating get short shrift.Not that I'm so well read; but I also think that Central and Eastern European writers (Danilo Kis, for example) who lived under Stalinist and Communist rule are superior at capturing the human despair that develops in a police state. In TPO, Zuckerman parachutes into Prague, where he conveys the outsider's point of view.Regardless, this is a worthwhile read for Roth fans. Further, it does show Roth, yet again, converting his own life experience into fiction. Wasn't he, after all, deeply involved in the worthy cause of helping downtrodden Central and Eastern European writers at the time TPO's publication?"}, {"review_sentiment": 3.0, "review_text": "This is a brief addendum to the first three Zuckerman novels.  It's a funny diversion about Zuckerman's mid 70s visit to Prague.I don't think it really added much to the overall story of the earlier books.It was funny and very Rothlike in tone.It's very, very short.I liked it.I recommend reading as an addendum to the earlier three novels.  On it's own, it doesn't make that much sense."}, {"review_sentiment": 5.0, "review_text": "Look, it's Roth ... the dialogue alone is worth the cost.  Fun stuff, as always.  The only drawback is you'll only wish it were a much longer rift."}, {"review_sentiment": 4.0, "review_text": "The small novel, or rather novella,  The Prague Orgy\" can be treated as an appendix to the trilogy about the Jewish-American writer Nathan Zuckerman. This slim volume is the example of the real wave of the novels appearing in the 1980s by American authors, who described the Eastern European countries under the communist regime, most often based on the personal experience from their travels.Nathan Zuckerman, already a renowned writer, finds himself in Prague under Soviet occupation in the mid-1970s. He has a mission to recovers the manuscripts of the short stories written by the father of a Czech emigre writer.The book is given as excerpts from Nathan's diary, starting with the meeting with the Czech writer, Zdenek Sisovsky, and his lover, a tragic actress Eva Kalinova, in New York, and continuing with the relation of his trip to Prague. The reader is presented with an amazing array of intellectuals, demoralized by the system. The enormous number of delightfully colorful characters and their stories, skilfully woven into the concise text is perhaps the major achievement of The Prague Orgy\", which gives is a stand on its own, athough it has more of the gems to be uncovered by an attentive reader. There are numerous literary allusions, jokes and irony - the whole book is more like a pastiche in Roth's unforgettable style. I can imagine that when the book appeared, it was one of the shocking reports from behind the Iron Curtain, which, additionally, had to be taken with a grain of salt (I wonder what were Roth's real impressions...). Nowadays it still reads well.Although The Prague Orgy\" is a complete work in itself, it is recommended to know other novels about Nathan Zuckerman before reading it, to fully understand the character of Zuckerman and his attitude."}]}, "authors": ["Philip Roth"], "isbn": "0679749039", "longitude": 14.4212535, "periods": ["1900s"], "title": "The Prague Orgy", "word_cloud": "maybe entertain seem give intellectual reaction people occupied country seem sexual interning newer edition picture most novella manic nympho maniacal rant character retrieve short story lest ground heel repressive regime never place stand regard going fictional way representative people sort literary lark set plot want follow logical conclusion get know dancer dance ever good writer bad spy go personal difficulty writer taught lesson real problem world meet exile writer ask help smuggle manuscript hide still full glory go along dos lest anticipate dour tale politics bypass worry find outrageous tone satirical scorn politics amusement intellectual bohemian antic tale friend spy funniest treatment subject novella write first person narrative diary adventure write epilogue trilogy mean alone purpose stand alone rather well tail dog life appreciate nice absurd view world contribution seem chief cultural contribution defeat empire evil know well yet far much impressed imaginative wordsmithing semi permanent focus main subject tire joy trouble sex go many volume novella show way write novel different time group together trilogy also write add considerably shorter work trilogy describe print part publish work primary character work novelist bear resemblance novel take place various point life reflect write relationship imaginative writing experience sex series pivot successful garner high praise sharp criticism deathbed father curse son reference extend predecessor differs well set midst communist domination turn plight writer ruthless communist regime thus shift preoccupation write relationship experience tension character author also seem le importance tend inconsistent writer strong weak moment reader frequently disagree merit various work respect praise work highly climax many reader puzzle find trifle short funny sharply write find difficult work disjoint episodic deliberately use overwork term justification trite term prominent role give present story draw notebooks give ramble character speak first person section first set subsequent section take place turbulent day tendency rush section prelude follow important right meet emigre man name female companion write communist suppress destroy literary career renowned actress leave husband trio much discussion reception contrasting reader fate writer communist conversation progress say father write several story yiddish hide away claim father murder ask retrieve story remainder recount effort open disinherit reject writer intellectual meet clandestinely week commiserate engage various form sex meet immediately want sleep brief sojourn see society full repression think impose conformity apparently modest material prosperity behalf populace also follow immediate suspicion regime deport back little world corner much story differ role artist communism much surrealistic conversation many character clutter much reflection tinged layer irony minister culture throw country lecture nature literature small country writer great burden bear country literature general decency public conscience occupy high position national life people live reproach writer love reader country look moral leadership stand common life fear right voice totalitarianism stifle think criticism irony however culture minister discussion function literature good deal free democracy suggests writer freedom tend quick criticism country try appreciate virtue free open culture experience learn somehow nature communist repression role writer free society subject implicit understand short elliptical work seem best initially intend epilogue rather separate work cluster novels follow writer career stage young apprentice writer guilty successful rise novelist trouble libidinous novelist writer novel examine nature literary success provide backstory associate family resentment examine new stage literary career show renowned novelist travel communist try hundred unpublished story write character call yiddish intervention literary cultural trove lose fickle communist censorship complicate stewardship alcoholic natural addition cluster novels function short literary train thematically move new territory particular novella show celebrity novelist manipulate literary operator encounter demoralize eviscerated cultural world try understand motivation boundary try smuggle story word shift focus torture literary ambition success primarily examination artistic endeavor police state result emotional conflict make zuckerman novel cluster fascinate short well also think writer example live rule superior capture human despair develop police state parachute conveys outsider point worthwhile fan show yet convert life experience fiction deeply involve worthy cause help downtrodden writer time publication brief addendum first novel funny diversion mid visit think really add much overall story earlier funny like recommend reading addendum earlier novel make much sense dialogue alone worth cost stuff always drawback wish much longer small rather treat appendix trilogy writer slim volume example real wave novel appear american author describe eastern european country communist regime often base personal experience already renowned writer find occupation mission recovers manuscript short story write father emigre give excerpt diary start meeting writer lover tragic actress continue relation trip presented amazing array intellectual demoralize system enormous number delightfully colorful character story skillfully weave concise text perhaps major achievement give stand gem uncovered attentive numerous literary allusion joke irony whole pastiche unforgettable style imagine appear shocking report additionally take grain salt wonder real impression still read complete work recommend know novel read fully understand character attitude", "genres": ["Fiction & Literature"], "summary": "The Prague Orgy takes the American novelist Nathan Zuckerman on a quixotic journey to search for the stories of an unknown Yiddish writer. The entries from Zuckermans notebooks are rich with comedy and dense with observation, detailing his relationship with the oppressed artists of communist Prague. In his bizarre adventures with the city's outcast writers, he discovers a perverse but appealing heroism.\r\n\r\nThe Prague Orgy is a startling conclusion to Philip Roths intricately designed magnum opus, Zuckerman Bound.\r\n\r\n''Obscenely outrageous and yet brilliantly reflective of a paranoid reality that has become universal. It is the best of Roth, a kind of coda to all his fiction so far.'' Harold Bloom, The New York Times ", "asin": "0679749039", "rank": "165421", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51FrGpT0OVL.jpg", "country": "Czechia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}