{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 89, "rating": 3.6, "reviews": [{"review_sentiment": 1.0, "review_text": "Peter Carey appears to be doing God's work, and that's all well and good, but I'm afraid it takes a bit more than that to write a decent book. Honestly, the out-&-out rubbish that gets you into Heaven these days! I don't know if it's an English or a Taurean thing; but this book is just absolute drivel from start to ... half-way (well, YOU finish it)! It's right down there with Tim Winton's 'Cloudstreet'. Just criminally boring! And as for the bare-faced lying about how good it is on the back cover (and the self-satisfied photo), ... (And the positive reviewers on here just want to be literary types!) (& they're glad the author wasn't smarter than them!)"}, {"review_sentiment": 4.0, "review_text": "Very dark and slow at the start. But the pace picked up and I enjoyed the emotions that developed between the characters."}, {"review_sentiment": 5.0, "review_text": "Any book that can simultaneously make it difficult to like but impossible not to love most of the characters is as good as it comes."}, {"review_sentiment": 5.0, "review_text": "Quite simply a wonderful book that everybody should read"}, {"review_sentiment": 5.0, "review_text": "A first rate description of people's weaknesses , society's judgement, and lost love. The complexities of human misconception is reminiscent of Charles Dickens."}, {"review_sentiment": 4.0, "review_text": "Okay"}, {"review_sentiment": 1.0, "review_text": "I loved this book. The descriptions were rich, the characters were well-drawn and interesting and the story was compelling with an interesting twist."}, {"review_sentiment": 2.0, "review_text": "How to describe this strange book without giving away major plotpoints -- well, it's full of surprises, but not the good kind. Some authors seem to regard an unhappy ending as more true-to-life than a happy one. But they can feel equally arbitrary unless they are 'earned' by the characters. This unhappy ending comes out of nowhere. The author just felt like yanking the rug out from under the readers' feet, I guess.The plot is also extremely slow; it's not until about halfway through that Oscar and Lucinda even meet.I will give Carey this -- his prose is good enough that I kept reading despite the lack of action."}, {"review_sentiment": 3.0, "review_text": "I just didn't love it. Found it hard to get into and really didn't live up to the hype."}, {"review_sentiment": 2.0, "review_text": "Stiff writing style.  Author seems to be trying to impress the reader with his detailed observations of human idiosynchrosies.  Quirky is a word I'd use to describe the style.  The style interferes with the enjoyment of the story.  Interesting but not pleasant to read."}]}, "authors": ["Peter Carey"], "isbn": "0679777504", "longitude": 151.2164539, "periods": ["1800s"], "title": "Oscar and Lucinda", "word_cloud": "appear work well good afraid take bit write decent rubbish get day know english thing absolute drivel start well you finish right criminally boring lie good back cover photo positive reviewer want literary type glad author smarter very dark slow start pace pick enjoy emotion develop character simultaneously make difficult impossible love character good come quite simply wonderful everybody first rate description people weaknesses society judgment lose complexity human misconception reminiscent okay love description rich character interest story compel interesting twist describe strange give away major plot points well full surprise good kind author seem regard unhappy end happy equally arbitrary character unhappy end come nowhere author felt yank rug reader foot plot also extremely slow halfway even give prose good enough keep read lack action love hard get really live hype stiff write style seem try detailed observation human idiosyncrasy word use describe style style interfere enjoyment story pleasant", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A Booker Prize-winning novel.\r\n\r\nThis sweeping, irrepressibly inventive novel, is a romance, but a romance of the sort that could only take place in  nineteenth-century Australia. For only on that sprawling continent--a haven for misfits of both the animal and human kingdoms--could a nervous Anglican minister who gambles on the instructions of the Divine become allied with a teenaged heiress who buys a glassworks to help liberate her sex. \r\n\r\nAnd only the prodigious imagination of Peter Carey could implicate Oscar and Lucinda in a narrative of love and commerce, religion and colonialism, that culminates in a half-mad expedition to transport a glass church across the Outback.\r\n\r\n“Peter Carey is to Sydney what Joyce was to Dublin . . . an absolute master of language and storytelling.” Thomas Keneally", "asin": "0679777504", "rank": "129150", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51hNRXRO1DL.jpg", "country": "Australia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}