{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 38, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Fantastic blend of historical fiction, poetry, visual art, epistolary etc. Riveting read. Read it for class and the entire class couldn't stop raving about it."}, {"review_sentiment": 5.0, "review_text": "One of the most interesting stories I've read in quite some time.  The mix of poetry, interview, and prose works beautifully."}, {"review_sentiment": 4.0, "review_text": "Good book. Enjoyed it! Replaced my missing copy!"}, {"review_sentiment": 4.0, "review_text": "I am not very familiar with Ondaatje's work and had no idea what to expect in this thin book.  Turns out the man had a long and productive life before Hollywood came calling.  I read a long section of Billy The Kid and did not understand what I had. Ondaatje has captured the rough and raw life of the Wild West in a collection of fragments of short stories, poems, interviews, and memories. We crash from here to there in a whimsical search for more words and paper.Billy the Kid and Pat Garrett were long-time friends and collaborators. Eventually Pat became a law man and put an end to Billy's short mad life of crime. A lot of others got in the way also without good results.  The book has Billy reflecting on Pat and their relationship, Billy listing the men he killed, and Billy describing how members of the gang met their end.  Usually I am not a fan of the Western genre but this collection really resonates.  Unfortunately it is as short and colorful as Billy."}, {"review_sentiment": 5.0, "review_text": "Another imaginative exploration into the prose/poetry of this author. This time he has taken the reader up and into excerpts, narratives, poems, and  voices of all those who shared the short, tense life of this hero/villain of the 1880s.There no sequential framework but rather, points of view, emotions, intentions of Billy’s friends-gang and Garrett’s friends-posse-gang; as well as various women Billy knew. There are descriptions of horses and dogs. And of course, Billy himself. There is an interview, newspaper articles, a play, songs, reminiscences after his death. This book pushes and pulls the reader into the compelling, short life of the romantic hero/vicious killer, William Bonney.The imagination, the  freedom of writing styles, the magical use of language of Michael Ondaatje is amazing."}, {"review_sentiment": 5.0, "review_text": "A mongrel work, as Ondaatje calls it and that is the perfect form with which to resuscitate the simplistic vision of the American west and to bring it alive with all its heat, it's drunkenness, it's rawness and it's madness."}, {"review_sentiment": 5.0, "review_text": "Interesting, short read.  Billy the Kid was a great poet, very perceptive, interesting sensitivity for a sharp-shooter."}, {"review_sentiment": 3.0, "review_text": "Interesting read.  I expected something more like the Cat's Cradle.  This was full of poetry that I did not enjoy.  However, I did enjoy the short stories."}, {"review_sentiment": 2.0, "review_text": "More amusing than enlightening!"}, {"review_sentiment": 5.0, "review_text": "A work of genius!"}]}, "authors": ["Michael Ondaatje"], "isbn": "067976786X", "longitude": 0.0, "periods": ["1800s"], "title": "The Collected Works of Billy the Kid", "word_cloud": "fantastic blend historical fiction poetry visual art epistolary etc rivet class entire class rave interesting story quite time mix poetry interview prose beautifully good miss copy familiar work idea expect thin man long productive life come call long section understand ondaatje capture rough raw life collection fragment short story poems interview memory crash whimsical search word friends collaborator eventually become law man put short mad life crime lot others get way also good result reflect relationship list men kill describe member gang met end fan western genre collection really resonate unfortunately short colorful imaginative exploration author time take excerpt narratives poem voice share short tense life sequential framework rather point view emotion intention well various woman know description horse dog course interview newspaper article play song reminiscence death push pull compel short life romantic killer imagination freedom write style magical use language amaze mongrel work call perfect form resuscitate simplistic vision american west bring alive heat drunkenness rawness madness interest short great poet perceptive interesting sensitivity interest expect something full poetry enjoy however enjoy short story more amusing enlightening work genius", "genres": ["Fiction & Literature", "History", "Historical Fiction"], "summary": "Funny yet horrifying, improvisational yet highly distilled, unflinchingly violent yet tender and elegiac, Michael Ondaatje’s ground-breaking book The Collected Works of Billy the Kid is a highly polished and self-aware lens focused on the era of one of the most mythologized anti-heroes of the American West. This revolutionary collage of poetry and prose, layered with photos, illustrations and “clippings,” astounded Canada and the world when it was first published in 1969. It earned then-little-known Ondaatje his first of several Governor General’s Awards and brazenly challenged the world’s notions of history and literature. \r\n\r\nOndaatje’s Billy the Kid (aka William H. Bonney / Henry McCarty / Henry Antrim) is not the clichéd dimestore comicbook gunslinger later parodied within the pages of this book. Instead, he is a beautiful and dangerous chimera with a voice: driven and kinetic, he also yearns for blankness and rest. A poet and lover, possessing intelligence and sensory discernment far beyond his life’s 21 year allotment, he is also a resolute killer. His friend and nemesis is Sheriff Pat Garrett, who will go on to his own fame (or infamy) for Billy’s execution. Himself a web of contradictions, Ondaatje’s Garrett is “a sane assassin sane assassin sane assassin sane assassin sane assassin sane” (p. 29) who has taught himself a language he’ll never use and has trained himself to be immune to intoxication. As the hero and anti-hero engage in the counterpoint that will lead to Billy’s predetermined death, they are joined by figures both real and imagined, including the homesteaders John and Sallie Chisum, Billy’s lover Angela D, and a passel of outlaws and lawmakers. The voices and images meld, joined by Ondaatje’s own, in a magnificent polyphonic dream of what it means to feel and think and freely act, knowing this breath is your last and you are about to be trapped by history.\r\n", "asin": "067976786X", "rank": "474314", "city": "New Mexico", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZuS2hA4yL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}