{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 32.5008626, "ratings": {"num_ratings": 72, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "Loved the writing and the characters.  It took awhile for the story to get going but I enjoyed it."}, {"review_sentiment": 5.0, "review_text": "Fantastic!"}, {"review_sentiment": 4.0, "review_text": "Not a complex plot, but Nunn gives you a good feel for his characters without handing you everything.  Will keep an eye on on this author."}, {"review_sentiment": 4.0, "review_text": "I'd give this book 5 stars, but I'm not used to Kem's writing style yet. I found myself getting annoyed at how detailed every explanation was for how things looked or how people were feeling... but I kept reading and the story is actually great. I got used to his writing (assuming Kem is a dude). I love references to surfing and the good old days of catching the big wave. Feeling \"washed up\" and those days are behind you - I can relate to that as I get older. I liked the love interest character and how they met. Overall a great story, but the writing is just different than I'm used to. Tapping the Source didn't seem to be as much this way so that's why I decided to give this one a try. It's worth it though - just read it and you'll see."}, {"review_sentiment": 3.0, "review_text": "Decent beach read.  Especially if you love to read about surf in addition to watching it."}, {"review_sentiment": 4.0, "review_text": "Nunn weaves a compelling tale of surfing, nature and old fashioned crime noir.  A battered old surfer and ex-con Sam \"The Gull\" Fahey gets a last chance of beachside redemption when he (against his normally selfish instincts) renders assistance to Magdalena, an activist targeted for death by the wealthy robber barons behind the environmental descration at the Mexican border.  Nunn spends a good deal of time etching his scenes, and while not always smooth, you have to tip your hat to a writer who echoes some of Cormac McCarthy's best wasteland poetry. You really get a feel for the mysteries of the waves off Tijuana Straits, the tragic street child Armando, warped by drugs and toxic waste, who turns to murder and obsessions as he tracks down Magdalena. And Fahey himself, still dreaming of the perfect wave but scarred by the dark crimes of his father and barely getting by.  Enjoyed this one. 4.5"}, {"review_sentiment": 3.0, "review_text": "Easy reading.  Well written by author"}, {"review_sentiment": 5.0, "review_text": "Man what a great read, ordered the next book by Kem Nunn and loved that one too! The sender did a great job of getting it to me in no time."}, {"review_sentiment": 5.0, "review_text": "Captured the sounds and feelings of southern CA. beautifully"}, {"review_sentiment": 3.0, "review_text": "The content or story line of this book is ok, but it seems like the author spent too much time trying to impress the reader with his extensive vocabulary that it lost something and became repetitive and mundane in places."}]}, "authors": ["Kem Nunn"], "isbn": "0684843056", "longitude": -116.9641657, "periods": ["2000s"], "title": "Tijuana Straits: A Novel", "word_cloud": "love write character take story get go enjoy fantastic not complex plot give good feel character hand everything eye author give star use write style yet find get annoyed detail explanation thing look people feel keep read story actually great get use write assume dude love reference surf good old day catch big wave wash day relate get older like interest character meet overall great story write different use tap seem much way decide try worth see beach love surf addition watch weave compel tale surfing nature old fashion crime nor batter old surfer get last chance redemption normally selfish instinct render assistance activist target death wealthy robber baron environmental desecration border spend good deal time etch scene always smooth tip writer echo best wasteland poetry really feel mystery wave street child warp drug toxic waste turn murder obsession track still dream perfect wave scar dark crime father barely get one easy read write author great order next love sender great job get time sound feeling southern beautifully content story line ok seem author spend much time try impress extensive vocabulary lose something become repetitive mundane place", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "From Kem Nunn, the National Book Award-nominated author of Tapping the Source and The Dogs of Winter, comes an exquisitely written tale of loss and redemption. Nunn renders the dangerous beaches and waters of California's borderland as only the critically acclaimed poet laureate of surf noir can, and Tijuana Straits confirms his reputation as a master of suspense and a novelist of the first rank.\r\n\r\nWhen Fahey, once a great surfer, now a reclusive ex-con, meets Magdalena, she is running from a pack of wild dogs along the ragged wasteland where California and Mexico meet the Pacific Ocean -- a spot once known to the men who rode its giant waves as the Tijuana Straits. Magdalena has barely survived an attack that forced her to flee Tijuana, and Fahey takes her in. That he is willing to do so runs contrary to his every instinct, for Fahey is done with the world, seeking little more than solitude from this all-but-forgotten corner of the Golden State. Nor is Fahey a stranger to the lawless ways of the border. He worries that in sheltering this woman he may not only be inviting further entanglements but may be placing them both at risk. In this, he is not wrong.\r\n\r\nAn environmental activist, Magdalena has become engaged in the struggle for the health and rights of the thousands of peasants streaming from Mexico's enervated heartland to work in the maquilladoras -- the foreign-owned factories that line her country's border, polluting its air and fouling its rivers. It is a risky contest. Danger can come from many directions, from government officials paid to preserve the status quo to thugs hired to intimidate reformers.\r\n\r\nAs Magdalena and Fahey become closer, Magdalena tries to discover who is out to get her, attempting to reconstruct the events that delivered her, battered and confused, into Fahey's strange yet oddly seductive world. She examines every lead, never guessing the truth. For into this no-man's-land between two countries comes a trio of killers led by Armando Santoya, a man beset by personal tragedy, an aberration born of the very conditions Magdalena has dedicated her life to fight against, yet who in the throes of his own drug-fueled confusions has marked her for death. And so will Fahey be put to the test, in a final duel on the beaches of his Tijuana Straits.\r\n\r\n\"Thrilling...valuable for its rarity and passion.\" Los Angeles Times", "asin": "B00276A3AC", "rank": "4283941", "city": "Tijuana", "image": "https://images-na.ssl-images-amazon.com/images/I/51FG1grsm6L.jpg", "country": "Mexico", "story_arc": ["Tragedy", "Things only get worse"]}