{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 101, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Death In The Afternoon is one of my favorite books. I have read it now 3 times. This book is expertly written as you would expect from Hemingway. The book is the gold standard by which all other books on the subject of bull fighting is compared to. Most of the men Hemingway writes of were all active in the earlier days of bullfighting. He goes into great depth and detail to explain each part of the even as well as the different people who are active in each segment and what they do. Hemingway also fully explains all the passes found in the fight and explains in minuet detail the history of the fighting even down to ranches that raised the best fighting bulls. If you have any interest in bull fighting do take the time to read this book. This is Hemingway at his very best."}, {"review_sentiment": 5.0, "review_text": "I came this book indirectly after watching the 2015 movie \"Papa Hemingway in Cuba.\"  I have admired his books since high school, and I was aware of this book by Hemingway but I really did not understand what the book was about until I read it.  Now, I think it is one of his best books.  It is absolutely about bull-fighting, and in detail.  But Hemingway is really writing about life as a whole.  He is writing about a time in his life when he was in love with life.  The descriptions of towns and farms and people and the bull-fights are beautiful.  It is a man's view, but this man was a master of words."}, {"review_sentiment": 4.0, "review_text": "Just a great classic book! I am a Hemingway fan."}, {"review_sentiment": 5.0, "review_text": "Love it!!! A classic everyone should own/read!!!"}, {"review_sentiment": 3.0, "review_text": "If you want to learn about bullfighting, this is the book for you."}, {"review_sentiment": 5.0, "review_text": "The person liked this book.  Thank you."}, {"review_sentiment": 5.0, "review_text": "Not a story. Explanation of bull fights."}, {"review_sentiment": 5.0, "review_text": "If you want to learn about the soul of bullfighting, this is the book.  Hemingway is  self-indulgent in this book, too often praising his own literary skills, but I doubt anyone could paint a more vivid picture of the corrida de torros."}, {"review_sentiment": 5.0, "review_text": "This is a fictional work that is actually much more rewarding as a comprehensive explanation of bullfighting.  I read it again every year before I attend the bullfights.  I highly recommend it."}, {"review_sentiment": 1.0, "review_text": "Verbose and over-written.  This work by Hemingway was a disappointment in several ways, not the least of which it was that it was a rambling dissertation that seemed to be convoluted and unlike the Hemingway I had expected to read.  I gave it up after two chapters and grumbled at the 12 bucks it cost me to leave on my \"book shelf.\""}]}, "authors": ["Ernest Hemingway"], "isbn": "0684801450", "longitude": -3.7035825, "periods": ["1900s"], "title": "Death in the Afternoon", "word_cloud": "favorite time expertly write gold standard subject bull fighting compare most men write active earlier day bullfighting go great depth detail explain part even well different people active segment also fully explain pass find fight explain minuet detail history fight even ranch raise best fighting bull interest bull fight time best come indirectly watch movie admire high school aware really understand now think best absolutely detail really write life whole write time life life description towns farm people beautiful man view man master word just great classic hemingway fan classic everyone want learn bullfighting person like not story bull fight want learn soul bullfighting often praise literary skill doubt anyone vivid picture corridor torso fictional work actually much reward comprehensive explanation bullfighting year attend bullfight highly recommend work disappointment several way least ramble dissertation seem convolute expect give chapter grumble buck cost leave shelf", "genres": ["Fiction & Literature"], "summary": "Hemingway&#039;s Classic Portrait Of The Pageantry Of Bullfighting. \r\n\r\nStill considered one of the best books ever written about bullfighting, Death in the Afternoon reflects Hemingway&#039;s belief that bullfighting was more than mere sport. Here he describes and explains the technical aspects of this dangerous ritual, and \"the emotional and spiritual intensity and pure classic beauty that can be produced by a man, an animal, and a piece of scarlet serge draped on a stick.\" Seen through his eyes, bullfighting becomes an art, a richly choreographed ballet, with performers who range from awkward amateurs to masters of great grace and cunning. \r\n\r\nA fascinating look at the history and grandeur of bullfighting, Death in the Afternoon is also a deeper contemplation on the nature of cowardice and bravery, sport and tragedy, and is enlivened throughout by Hemingway&#039;s pungent commentary on life and literature.", "asin": "0684801450", "rank": "96424", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/516G0RSN34L.jpg", "country": "Spain", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}