{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 429, "rating": 3.8, "reviews": [{"review_sentiment": 2.0, "review_text": "He’s difficult to read."}, {"review_sentiment": 3.0, "review_text": "Book started as a convoluted association of words describing scenes of life of those living in the “fast lane “ . Part 2 and 3 improve in the way of literary style as well as the intentions of the writer....the story became more solidified and easier to follow . I am not sure at this time if I will eventually feel tempted in the future to try any of his other books ."}, {"review_sentiment": 5.0, "review_text": "I chose this rating because  FSF writing is exquisite. I intend to read more of hi s writings. Plus the new biography"}, {"review_sentiment": 5.0, "review_text": "The best!!!"}, {"review_sentiment": 1.0, "review_text": "hard to follow the events and characters"}, {"review_sentiment": 1.0, "review_text": "Boring and pointless.  The writing style, of course, is certainly not modern, but it lacks transition and continuity.  I couldn't wait to be done with this book!!  I'm sure Fitzgerald has written better novels, but our book club picked this one.  Sorry!"}, {"review_sentiment": 5.0, "review_text": "What a story! Am loving going through the F Scott Fitzgerald books. Such a classy classic author! I recommend to all..."}, {"review_sentiment": 1.0, "review_text": "Worst book I ever read!  Ugh😩"}, {"review_sentiment": 3.0, "review_text": "I looked forward to reading this book as I had heard that it was his best work. That enticed me as I have always felt Fitzgerald's best book was\"The Great Gatsby\" which I consider a masterpiece. This book does not change my mind. I found it sounding very dated, and even tedious. I could not finish it as I lost interest.Obviously, others will not agree, but if I were asked to recommend a Fitzgerald book, I would definitely go with Gatsby."}, {"review_sentiment": 5.0, "review_text": "The book finished I feel as though returned from a Grand Tour of Europe and of my own sad and glorious past."}]}, "authors": ["F. Scott Fitzgerald"], "isbn": "068480154X", "longitude": 2.3514992, "periods": ["1900s"], "title": "Tender Is the Night", "word_cloud": "difficult start convolute association word describe scene life live fast lane way literary style well intention writer story become solidified easier follow sure time eventually feel tempted future try choose rating write exquisite intend hi writing new biography best hard follow event character pointless writing style course certainly modern lack transition continuity do sure write better novel club pick story be love go classy classic author recommend ever look forward read hear best work entice always felt best consider masterpiece change mind find sound date even tedious lose others agree ask recommend definitely finish feel returned sad glorious past", "genres": ["Fiction & Literature"], "summary": "F. Scott Fitzgerald wrote in a friend's copy of Tender Is the Night, \"If you liked The Great Gatsby, for God's sake read this. Gatsby was a tour de force but this is a confession of faith.\"\r\n\r\nSet in the South of France in the decade after World War I, Tender Is the Night is the story of a brilliant and magnetic psychiatrist named Dick Diver; the bewitching, wealthy, and dangerously unstable mental patient, Nicole, who becomes his wife; and the beautiful, harrowing ten-year pas de deux they act out along the border between sanity and madness.\r\n\r\nIn Tender Is the Night, Fitzgerald deliberately set out to write the most ambitious and far-reaching novel of his career, experimenting radically with narrative conventions of chronology and point of view and drawing on early breakthroughs in psychiatry to enrich his account of the makeup and breakdown of character and culture.\r\n\r\nTender Is the Night is also the most intensely, even painfully, autobiographical of Fitzgerald's novels; it smolders with a dark, bitter vitality because it is so utterly true. This account of a caring man who disintegrates under the twin strains of his wife's derangement and a lifestyle that gnaws away at his sense of moral values offers an authorial cri de coeur, while Dick Diver's downward spiral into alcoholic dissolution is an eerie portent of Fitzgerald's own fate.\r\n\r\nF. Scott Fitzgerald literally put his soul into Tender Is the Night, and the novel's lack of commercial success upon its initial publication in 1934 shattered him. He would die six years later without having published another novel, and without knowing that Tender Is the Night would come to be seen as perhaps its author's most poignant masterpiece. In Mabel Dodge Luhan's words, it raised him to the heights of \"a modern Orpheus.\"", "asin": "068480154X", "rank": "12937", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/414IAO3jGZL.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}