{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 50, "rating": 3.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Classic early McMurtry.  Good read.  Great writer."}, {"review_sentiment": 3.0, "review_text": "Somewhere in between.  I see Timothy Bottoms for some reason."}, {"review_sentiment": 1.0, "review_text": "unbelievably bad, with totally obnoxious characters.  What was Larry McMurtry thinking when he wrote this book, has he turned into a dirty old man obsessed with sex and incapable of writing an interesting storyline?"}, {"review_sentiment": 4.0, "review_text": "good coming of age"}, {"review_sentiment": 4.0, "review_text": "After producing two of the best American novels of the latter half of the 20th century, The Last Picture Show and Moving On, it might be understandable that Larry McMurtry would hit a lull, and that’s what All My Friends Are Going to Be Strangers (1972) is. Rather than the meticulously observed approach of those two masterpieces, All My Friends often settles for kookiness and offbeat characters, which can be amusing but gives off a sense of an author more into crowd-pleasing than truth-telling.The first-person voice is also, I think, a mistake, as it puts too much onus on the central character, Danny Deck, to carry things. While Moving On also focused on a central character, Patsy Carpenter (Deck is briefly alluded to in that book as Patsy in this one) the third person voice allowed the narrative to stretch to other characters and perspectives, fleshing out Patsy in the context of her world. That kind of context is missing here.Danny is an aspiring writer, apparently the creatively exhausted McMurtry’s alter ego, who comes to question the value of his work. He also flounders in his relationships with women, though that doesn’t keep him laying just about every prominent female character at one time or another.This is not to say that this is a bad book. By most authors’ standards it would be excellent. There are some wonderful scenes ranging from laugh-out-loud comic (Uncle Laredo) to creepily disturbing (the Texas Rangers). It’s just that McMurtry had set the bar so high in his previous two efforts that All My Friends Are Going to Be Strangers suffers in comparison."}, {"review_sentiment": 4.0, "review_text": "I never like a good book to end, but I felt this book's ending left too much unsaid...however the title may have said enough."}, {"review_sentiment": 1.0, "review_text": "Not one of McMurtry's finer works.."}, {"review_sentiment": 4.0, "review_text": "McMurtry writes characters like nobody's business, and this novel is no exception.  This book, published in 1972, reflects the counterculture times he lived in.  McMurtry appears in Tom Wolfe' s book Electric Kool-aid Acid Test when Kesey and the Merry Pranksters travel in their painted bus through the Houston area.  While out of character for McMurtry, this novel entertains with many surreal scenes as the lead character road trips his way from Houston, to California, then back again."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this book, would recommend it."}, {"review_sentiment": 5.0, "review_text": "Excellent."}]}, "authors": ["Larry McMurtry"], "isbn": "0684853825", "longitude": -118.244476, "periods": ["1900s"], "title": "All My Friends Are Going to Be Strangers : A Novel", "word_cloud": "classic early mcmurtry writer somewhere see timothy reason unbelievably bad totally obnoxious character think write turned dirty old man obsess sex incapable write interesting story line good come age produce best american novel latter half century last understandable lull meticulously observe approach masterpiece often settle kookiness offbeat character amuse give sense author voice also think put much central character carry thing move also focused central character briefly allude third person voice allow narrative stretch character perspectives flesh context world kind context miss aspire writer apparently creatively exhausted alter ego come question value work also flounder relationship woman keep laying prominent female character time bad author standard wonderful scene range comic creepily disturb set bar high previous effort suffers comparison never good end felt end left much unsaid however title say enough not finer mcmurtry write character nobody business exception publish reflect counterculture time live appear travel paint area character entertain many surreal scene lead character road trip way back enjoy excellent", "genres": ["Fiction & Literature"], "summary": "Ranging from Texas to California on a young writer's journey in a car he calls El Chevy, All My Friends Are Going to Be Strangers is one of Larry McMurtry's most vital and entertaining novels. \r\n\r\nDanny Deck is on the verge of success as an author when he flees Houston and hurtles unexpectedly into the hearts of three women: a girlfriend who makes him happy but who won't stay, a neighbor as generous as she is lusty, and his pal Emma Horton. It's a wild ride toward literary fame and an uncharted country...beyond everyone he deeply loves. All My Friends Are Going to Be Strangers is a wonderful display of Larry McMurtry's unique gift: his ability to re-create the subtle textures of feelings, the claims of passing time and familiar place, and the rich interlocking swirl of people's lives.\r\n\r\n\"Mr. McMurtry's characters are real, believable, and touching...and he is a very funny writer.\" The New York Times ", "asin": "0684853825", "rank": "303211", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/510xlUH9QLL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}