{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -4.3217055, "ratings": {"num_ratings": 26, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "This is historical fiction, fiction written around a few historical facts.  All in all, a good read and I do recommend.My only two criticisms: it comes across too much as being written in our times, versus those times which takes away from its supposed historical base and a little too much on the \"R-rated\" side, gratuitous sex.It's still pretty much a well-written page-turner that is several cuts above the usual lust in the dust or violence-prone novels that sell."}, {"review_sentiment": 5.0, "review_text": "This is an excellent book, written in narrative style by the protagonist, so we hear and know his thoughts, intentions and feelings. The plot os set in the Belgium Congo during the violence and upheaval in 1959 as Patrice Lumumba tries to take power away from the foreigners. Gillespie writer/journalist, who prides himself as objective, is madly in love with a beautiful Italian Ines, who is the very opposite. She is drawn into the revolution, while he remains outside of it. He is considered “ catastrophic” by her because he is such a pessimist, where each happening is an end. As the revolution and various intrigues occur, Gillespie is confronted with cruelty, brutality and atrocity. How he comes to perceive the world slowly changes. The writing is clean, powerful, explicit—it brings the reader into the horror of war, the sacrifice and idealism of revolution."}, {"review_sentiment": 5.0, "review_text": "Good Read"}, {"review_sentiment": 4.0, "review_text": "This novel tells of events in the Congo in 1959-60. It details the rise and fall of Patrice Lumumba, portrayed as a genuine liberationist, whose doom was perhaps inevitable in such a divided country. Many of the problems that beset Africa are recognised. The machinations of the Americans, represented by Mark Stipe, a CIA operative, segue into the other story in the novel. This is the fading love affair between the narrator, James, a middle-aged English novelist with a tendency to distance himself from ideals and political passions, and Ines, a journalist for L'Unita who embraces Lumumba's cause wholeheartedly. The author explores well the issues of love and personal feelings in a time that demands political commitment. The title is Ines' description of James as someone who always expects the worst. The book contrasts interestingly with Barbara Kingsolver's Poisonwood Bible, set in the same time and place, about an American missionary family.The Poisonwood Bible"}, {"review_sentiment": 4.0, "review_text": "I didn't expect to like this book as much as I did! The writing is absolutely breathtaking. Even though the subject is not something I'm terribly interested in, I couldn't put it down. I was drawn in by the seductive, beautiful words! Loved it!"}, {"review_sentiment": 5.0, "review_text": "Irishman, James Gillespie, travels from his home in London to the Congo to follow his lover, Ines Sabiani, an Italian political journalist.He is chasing her; she is chasing political news.The story is about the way they see the world; their passions and their loves. James views his life as a story of failure.It is 1959 in Leopoldville, Belgium Congo, west Africa. It is the time of the rising independence of the Congolese from the Belgiums; a time of violence and dissent. James finds the politics uninteresting; he is only there to save his relationship with Ines. He comes to realize that Ines is more passionate about her work and the freedom of the people of Congo than about him. They have been together for two years in London, where everything was perfect. It was far from perfect in Leopoldville for James.James wants commitment, longevity and marriage. Ines wants none of this and leaves James for Auguste, a younger Congolese man. James defies death to rescue Ines and her new lover from the bloody conflict of angry dissidents, but does it rekindle their love?Historically factual, it is a compelling, interesting, and emotional read as James lays bare his feelings of love and hate.Martina Nicolls, Author of \"The Sudan Curse\" and \"Kashmir on a Knife-Edge\""}, {"review_sentiment": 4.0, "review_text": "On June 30, 1960, the Congo was emancipated from Belgium. African nationalist leader Patrice Emery Lumumba became the first prime minister of the Democratic Republic of the Congo when it declared its independence - the long awaited \"Depanda\" had arrived! In October 1958 Lumumba had founded the Congolese National Movement (Mouvement National Congolais; MNC), the first nationwide Congolese political party. Forced out of office during a period of violent political upheaval in September 1960, he was assassinated in January 1961.During the Congo's turbulent beginning many countries intervened in its political affairs. \"They used: fear of communism, economic collapse, civil war, and protection of European citizens living in the Congo to back themselves for intervening.\" And the expatriate community, living in luxury, sipping sundowners at poolside, did not appreciate their world, their comfortable lives slipping out of their control.At the time, the Congo was the biggest and richest country in central Africa, one with huge strategic importance - not only to the Belgians, but to the US. Katanga Province, the size of Britain, remains one of the richest areas in all Africa if not the richest. \"The mines of the Union Miniere and Forminiere provided the world with eight per cent of its copper, sixty per cent of its uranium, seventy-three per cent of its cobalt, eighty per cent of its industrial diamonds. Katanga has gold, silver, tin, zinc, manganese, columbium, cadmium, tungsten, tantalum: its supplies will never be exhausted.\" This was the land of Unilever, Brufina, Union Miniere and the Banque Empain, companies which were not about to let their holdings slip away easily.Into this tumultuous, politically charged setting wanders James Gillespie, a disaffected Irish/English writer, author of a few well received novels and a contributor to various periodicals. He arrives in Leopoldsville with the intent of pursuing a waning relationship with Ines Sabiani, his fiery, radical Italian girlfriend with whom he is deeply in love. Gillespie's arrival in the Congo represents a major emotional commitment for him. Ines is a journalist with her country's communist newspaper L'Unita. She is as passionate about the cause of Independence and about the charismatic leader, Lumumba, as James is indifferent, or as he would say, \"objective.\" And he is a skeptic, a pessimist. Part of the problem between the two lovers is that James is never on anyone's side. He insists, \"I see all sides. My craft demands it.\" He is against intolerance, dogma, illiberalism. But he is for nothing. In?s invests herself emotionally as well as professionally in that which she believes. Her affair with James is doomed before Gillespie sets foot on African soil - just as Patrice Lumumba's government is doomed before he takes office. At one point In?s tells Gillespie that, \"Dante wrote that the hottest places in hell are reserved for those who in times of great moral crises maintain their neutrality.\" She accuses him of being a \"catastrofista,\" a \"catastrophist,\" one who believes \"that no problem is small. Nothing can be fixed; it is always the end.\"As James becomes caught up in the historical movement, colonial injustice and the chaotic brutality that accompanies it, he is finally forced to take sides...and action.Although well written, I did have some difficulty with author Ronan Bennett's style. It made for ponderous reading at times. I am fascinated by this period in Africa, especially the politics, and by the character of Patrice Lumumba in particular, so I had personal incentive to persevere. \"The Catastrophist\" reminds me of Graham Greene's \"The Quiet American.\" Both novels deal with the chaotic end of colonialism, have journalists as protagonists and idealistic, if Machiavellian, CIA operatives fomenting intrigue and even more violence. The colonialists in both novels, the Belgians here, the French in Vietnam in Greene's work, act paternalistically and condescendingly towards the \"natives\" and don't really take the independence movements seriously.\"The Catastrophist was short-listed for the 1998 Whitbread Novel Award.JANA"}, {"review_sentiment": 1.0, "review_text": "although i liked the setting - and the plot & characters were good, they writing style made it difficult for me to get through this book.  it seemed to general where more detail was needed, too much detail where i wasn't interested and in general i put the book down after every few pages, chapters - where is this going, why is he telling me this...it was just difficult to get through.  on the whole the story is good, but it wasn't fun to read."}, {"review_sentiment": 5.0, "review_text": "I read this book over two years ago, and I still think of it often.  The story is spellbinding, and I was introduced to Africa and the Congo.  It may be my personal favorite."}, {"review_sentiment": 5.0, "review_text": "I read this novel when it was released.  It stayed with me like almost no other novel ever has, hence my decision to review it.  Simply put, it was excellent.  Ronan Bennett told his story with sensitivity for the political climate, and a keen insight into human relationships.  I echo the sentiments of another reviewer in that this is a thinking person's novel.  Bennett's writing style is awesome.  Those not interested in the content but partial to spectacular penmanship should still read this novel.  They will not be disappointed."}]}, "authors": ["Ronan Bennett"], "isbn": "0684863340", "longitude": 15.3125974, "periods": ["1900s"], "title": "The Catastrophist: A Novel", "word_cloud": "historical fiction fiction write historical fact good criticism come across much write time versus time take away suppose historical base little much side gratuitous still pretty much several cut usual lust dust novel sell excellent write narrative style protagonist hear know thought intention feel plot o set violence upheaval try take power away foreigner pride objective madly love beautiful italian draw revolution remain consider catastrophic pessimist happen end revolution various intrigue occur confront cruelty brutality atrocity come perceive world slowly change write clean powerful brings horror war sacrifice idealism revolution good read tell event detail fall portray genuine liberationist doom perhaps inevitable divided country problem beset recognize machination represent operative segue story fading affair narrator novelist tendency distance ideal political passion journalist embrace cause wholeheartedly author explore well issue love personal feeling time demand political commitment title description someone always expect worst contrast interestingly set time place american missionary expect much write absolutely breathtaking even subject something terribly interest draw seductive beautiful word love travel home follow lover ines italian political chase chase political story way see world passion love view life story west time rise independence congolese time violence dissent find politics uninteresting save relationship come ines passionate work freedom people together year everything perfect far perfect want commitment longevity marriage ines want none leave younger congolese man defy death rescue new lover bloody conflict angry dissident factual compelling interesting emotional lay bare feeling love emancipate african nationalist leader become first prime minister declare independence long await arrive found congolese first nationwide political party office period violent political upheaval assassinate turbulent begin many country intervene political affair use fear communism economic collapse civil war protection european citizen live back intervene expatriate community live luxury sip sun downers poolside appreciate world comfortable life slip time biggest richest country central huge strategic importance size remain richest area richest mine provide world cent copper sixty cent uranium cent cobalt cent industrial diamond gold silver tin zinc manganese columbium cadmium tungsten tantalum supply never exhaust land company let holding away tumultuous politically charge set wanders disaffect writer author well receive novel contributor various periodical arrive intent pursue wan relationship fiery radical italian girlfriend deeply arrival represent major emotional commitment journalist country communist newspaper passionate cause charismatic leader indifferent objective skeptic pessimist problem lover never anyone side insist see side craft demand dogma illiberal ism nothing invests emotionally well professionally believe affair doom set foot african soil government doom take office point tell write hottest place hell reserve time great moral crisis maintain neutrality accuse catastrofista catastrophic believe problem small fix always become caught historical movement colonial injustice chaotic brutality accompanies finally force side well write difficulty author style make ponderous reading time fascinate period especially politics character particular personal incentive remind quiet american novel deal chaotic end colonialism journalist protagonists idealistic operatives foment intrigue even violence colonialist novel french work act paternalistic ally condescendingly towards native really take independence movement seriously liked set plot character good writing style make difficult get seem general detail need much detail interested general put page chapter go tell difficult whole story good fun year still think often story spellbind introduce personal favorite release stay almost ever hence decision review put excellent tell story sensitivity political climate keen insight human relationship echo sentiment reviewer think person writing style awesome interested content partial spectacular penmanship still disappoint", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The Catastrophist is a brilliant, highly acclaimed novel of love, passion, violence, and desire, set in the Belgian Congo in 1959. While expatriates loll about their pools in a colonial paradise soon to erupt into chaos, huge crowds are drawn to the charismatic Congolese independence leader Patrice Lumumba -- and his even more dangerous rivals.\r\n\r\nOne man sees the cracks appearing around him and struggles to hold on to his lover, his sanity, and ultimately, his life. Gillespie, the outsider, a journalist, is in Léopoldville for the beautiful Italian, Inés. He is desperate for her love, while she is obsessed with the unfolding drama, caught up in history, ideology, hero worship.\r\n\r\nIn a world slipping out of control, gripped by disgust, fear, and incomprehension, Gillespie feels that events threaten to overwhelm him -- as does his friendship with the amiable but sinister American, Stipe; his relationship with his canny native driver, Auguste; and, above all, his love for Inès.\r\n\r\nIt is Inès who defines Gillespie as a catastrofista, an Italian word for somebody for whom \"no problem is small. Nothing can be fixed; it is always the end,\" for Gillespie is deeply pessimistic and skeptical about their relationship as well as politics, while Inès believes in engagement and commitment, whatever the risks -- which, as it turns out, are greater than either of them can foresee.\r\n\r\nAs colonial corruption and injustice give way to turmoil, brutality, and murder, Gillespie is finally forced to confront what is happening before his eyes. In subtle, haunting prose, Ronan Bennett captures the complex connection between the personal and the political, between cruelty and lust, between eroticism and love, between courage and fear, between detachment and involvement.\r\n\r\nThe Catastrophist is a bold, courageous novel, at once a searing love story and a terrifying political thriller, in the tradition of such books as Graham Greene's The Comedians or such postcolonial classics as The Year of Living Dangerously -- an erotic Heart of Darkness for the twentieth century.", "asin": "B005AZ4HQS", "rank": 0, "city": "Kinshasa", "image": "", "country": "DR Congo", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}