{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 63, "rating": 4.3, "reviews": [{"review_sentiment": 1.0, "review_text": "If this is \"very good\" condition, I would hate to see POOR"}, {"review_sentiment": 4.0, "review_text": "As represented."}, {"review_sentiment": 5.0, "review_text": "Was as promisted.Thank you"}, {"review_sentiment": 5.0, "review_text": "Fascinating!"}, {"review_sentiment": 5.0, "review_text": "Book might have been in slightly better shape (the cover's crumbling off as we read it).  The story's pretty amazing and he's a great writer with a terrific dry sense of humour."}, {"review_sentiment": 5.0, "review_text": "GREAT BOOK... FAST DELIVERY"}, {"review_sentiment": 5.0, "review_text": "thank you"}, {"review_sentiment": 1.0, "review_text": "Boring"}, {"review_sentiment": 4.0, "review_text": "Very long, but a great book about an amazing man."}, {"review_sentiment": 5.0, "review_text": "Loved book which must be read in conjunction with watching All The Presidents Men. Last quarter of book, after Watergate, not quite as good..."}]}, "authors": ["Ben Bradlee"], "isbn": "0684825236", "longitude": -77.0366456, "periods": ["1900s"], "title": "A Good Life: Newspapering and Other Adventures", "word_cloud": "condition represent wa fascinate book slightly better shape cover crumble story pretty amazing great writer terrific dry sense humor great thank bore very long great amazing man love watch president last quarter quite", "genres": ["Memoir", "Politics", "Journalism"], "summary": "This is the witty, candid story of a daring young man who made his own way to the heights of American journalism and public life, of the great adventure that took him at only twenty years old straight from Harvard to almost four years in the shooting war in the South Pacific, and back, from a maverick New Hampshire weekly to an apprenticeship for Newsweek in postwar Paris, then to the Washington Bureau chief's desk, and finally to the apex of his career at The Washington Post. \r\n\r\nBradlee took the helm of The Washington Post in 1965. He and his reporters transformed it into one of the most influential and respected news publications in the world, reinvented modern investigative journalism, and redefined the way news is reported, published, and read. Under his direction, the paper won eighteen Pulitzer prizes. \r\n\r\nHis leadership and investigative drive following the break-in at the Democratic National Committee led to the downfall of a president, and kept every president afterward on his toes. Bradlee, backed every step of the way by the Graham family, challenged the federal government over the right to publish the Pentagon Papers - and won. \r\n\r\nHis ingenuity, and the spirited reporting of Sally Quinn, now his wife, led to the creation of the Style Section, a revolutionary newspaper feature in its time, now copied by just about every paper in the country.", "asin": "B002M048MW", "rank": "489763", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/41%2BC9QY161L.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}