{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 84, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "nice condition"}, {"review_sentiment": 5.0, "review_text": "This book should be required reading for understanding this period in history. Good colorful character development, some humor, probably more historically accurate than I like to think, I'm glad I picked up this book."}, {"review_sentiment": 5.0, "review_text": "A fascinating read."}, {"review_sentiment": 5.0, "review_text": "In 1830, Rutherford Calhoun, a newly freed slave, thief, and cad, wanted to escape Creole, gangster, bill collector, Zeringue, and marrying Bostonian schoolteacher, Isadora Bailey. Rutherford had arrived in New Orleans, Louisiana a year earlier from southern Illinois.  He thought the city had beautiful demi-mondaines aplenty in every hue; it was his kind of town, full of excitement. Marriage to a schoolteacher was the farthest thing from his mind.Rutherford’s only chance of escape from Isadora and Zeringue was to become a cook aboard a ship, the Republic, bound for Guinea, to purchase African slaves. He hoped his absence would dissuade Isadora and his creditors forgetting he existed.Aboard the Republic was a vile, heartless, shrewd dwarf, Captain Ebenezer Falcon, whose byword was Never Explain and Never Apologize.  Falcon had no difficulty running the ship and keeping his motley crew of rapist, murderers and scalawags in line. They all had secrets, and Falcon accepted Rutherford as assistant cook to First Cook, Squibb.In the costal trading post at Bangalang, Falcon bought the mysterious Allmuseri tribesmen, thought by slave masters to be the best quality.  He also purchased their god, kept in the hold, a deity considered telepathic. The crew blamed the deity and Allmuseri for the monstrous storms and later disintegration of the ship’s contents. Mutiny, cannibalism, and an unfurling of diseases, resulted in deaths. Even Rutherford had a meltdown after coming face-to-face with the deity.Although irresponsible, Rutherford is smart, articulate and engaging. He found seafaring disturbing and restricting. He missed the mischievousness and pleasure of his vice, stealing, and the very thought of stealing gave him a ‘tingle,’ “...as if I was slipping inside another’s soul.” He stole doubloons from Falcon and read his journal, discovering a man who sacrificed spiritual values for power and material gain, unlike his first mate, Northerner, Cringle, a man of integrity who believed in fairness and toward the end self-sacrificing.Rutherford appears to have enormous internal conflict concerning anger with his brother, his former slaver, from whom he received a humanist education, and his father for allegedly deserting the family. Added to the conflict was being loyal to his shipmates, but the sorrow felt for the Allmuseri chained in the hold.  He became friend to Allmuseri, Ngonyama, one who readily learned English.  Rutherford realized the joy in the Allmuseri’s lives had diminished, as would their ancient traditions and beliefs. He also realized what he had once enjoyed: women, expensive suits, the latest stage plays, wins at gambling, and parties was nothing new under the sun. Rutherford’s trip to Africa would be far worse than marriage to Isadora.Although I did not like the climax, the book is engrossing with vibrant characters, told in first person and, at times, in narrative. The similes, metaphors, and imageries are exceptional.  Sometimes Rutherford is incoherent, a cue of his emotions.  At this point, the writer’s work is deep and thought provoking. The book contains numerous words from sixteenth century Middle English and a battery of ship terminologies.  As evidenced by his thoughts, Rutherford appeared to have studied under a learned and philosophical man. He considered Falcon a Faustian man. Rutherford used Greek words when describing characters as Icarian or Sisyphean, Parmenidean, and a smattering of Latin, such as causa sui. Make sure you have your dictionary handy. This novel is a good choice for book cIubs. I give the book 4.5 stars. The author served up a book with an unusual flavor."}, {"review_sentiment": 5.0, "review_text": "Loved this book since I first read it over 20 years ago in high school. It is a fantastic book and am glad I finally purchased my own copy! Am very happy with my purchase!"}, {"review_sentiment": 1.0, "review_text": "I could hardly finish it."}, {"review_sentiment": 5.0, "review_text": "The book arrived Brand new although the description stated otherwise. I'm very pleased and can't wait to enjoy it!"}, {"review_sentiment": 5.0, "review_text": "Middle Passage is extremely well written from the perspective of an American \"Freed\" black man.To flee debts and a woman, Calhoun stows away on a ship in New Orleans.  He doesn't know  the ship is going to Africa to transport slaves back to America.Calhoun's experiences, as a black man, seeing the treatment of other black men, women and children is poignant.  As he gets to know the man chosen to be the slave's \"ship leader\",  Calhoun realizes the kidnapped tribe members are actually superior in many ways.The writing is excellent. The characters  come alive.  I could \"see and feel\" what they were experiencing.Middle Passage is a book I will read over and over.  There are so many lessons and \"wow moments\"  that cannot be realized in just one or two readings."}, {"review_sentiment": 5.0, "review_text": "recommended"}, {"review_sentiment": 3.0, "review_text": "An interesting perspective on possibilities during slavery days crossing the Atlantic, and at either end.  Rather a fanciful ending."}]}, "authors": ["Charles Johnson"], "isbn": "0684855887", "longitude": -90.0701156, "periods": ["1800s"], "title": "Middle Passage", "word_cloud": "nice condition required reading understanding period history colorful character development humor probably historically accurate think glad pick fascinating newly free slave thief cad want escape gangster bill collector marry bostonian schoolteacher arrive year earlier southern think city beautiful aplenty hue kind town full excitement schoolteacher farthest thing chance escape cook ship bound purchase slave hop absence creditor forget vile heartless shrewd dwarf byword difficulty run ship keep motley crew rapist murderer scalawags line secrets accept assistant cook coastal trading post buy mysterious tribesman think slave master best quality also purchase god keep hold deity consider crew blame deity monstrous storm later disintegration ship content cannibalism unfurl disease result death even meltdown come irresponsible smart articulate engaging find seafaring disturb restrict miss mischievousness pleasure vice steal think steal give tingle slip inside steal doubloon journal discover man sacrifice spiritual value power material gain first mate man integrity believe fairness end appear enormous internal conflict concern anger brother former slaver receive humanist education father allegedly desert family conflict loyal shipmate sorrow felt chain become friend readily learn realize joy live diminish tradition also realize enjoyed woman expensive suit latest stage play win gamble party nothing new sun trip far worse marriage like climax engross vibrant character tell first person time narrative simile metaphor imagery exceptional incoherent cue emotion point writer work deep think provoke contains numerous word sixteenth century battery ship terminology evidence thought appear study learned philosophical man consider man use greek word describe character icarian smatter causal sew make sure dictionary handy good choice cub give star author serve unusual flavor love first year ago high school fantastic glad finally purchase copy happy purchase hardly arrived new description state otherwise please extremely well write perspective black flee debt woman stow away ship know ship go transport slave back experience black man see treatment black men woman child poignant get know man choose slave ship leader realize kidnap tribe member actually superior many write excellent character come alive feel many lesson wow moment realize reading recommend interesting perspective possibility slavery day cross fanciful end", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A twenty-fifth anniversary edition of Charles Johnson’s National Book Award-winning masterpiece—\"a novel in the tradition of Billy Budd and Moby-Dick…heroic in proportion…fiction that hooks the mind\" The New York Times \r\n\r\nRutherford Calhoun, a newly freed slave and irrepressible rogue, is lost in the underworld of 1830s New Orleans. Desperate to escape the city’s unscrupulous bill collectors and the pawing hands of a schoolteacher hellbent on marrying him, he jumps aboard the Republic, a slave ship en route to collect members of a legendary African tribe, the Allmuseri. Thus begins a voyage of metaphysical horror and human atrocity, a journey which challenges our notions of freedom, fate and how we live together. Peopled with vivid and unforgettable characters, nimble in its interplay of comedy and serious ideas, this dazzling modern classic is a perfect blend of the picaresque tale, historical romance, sea yarn, slave narrative and philosophical allegory.\r\n\r\nNow with a new introduction from renowned writer and critic Stanley Crouch, this twenty-fifth anniversary edition of Middle Passage celebrates a cornerstone of the American canon and the masterwork of one of its most important writers. \"Long after we’d stopped believe in the great American novel, along comes a spellbinding adventure story that may be just that\" (Chicago Tribune).", "asin": "0684855887", "rank": "82833", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51bC6q3p1LL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}