{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 36.1662859, "ratings": {"num_ratings": 26, "rating": 3.3, "reviews": [{"review_sentiment": 5.0, "review_text": "After reading \"The Late Child\" (which was a sequel to \"The Desert Rose\"), I became intrigued with Harmony's early life - and her daughter's as well. Thus, I began the search on Amazon for \"The Desert Rose,\" a book originally published in the 1980s.  I was fortunate that I was able to receive a \"like new\" version of this book -- and look forward to learning more about Harmony and Pepper and their earlier years."}, {"review_sentiment": 3.0, "review_text": "i expected a storyline closer to terms of endeatment and evening star.  i was disappointed that it read sorta chopply.  i guess mcmurtry had a two hit wonder and thats that."}, {"review_sentiment": 4.0, "review_text": "I fell in love with Harnony, respected her resilience and wished better for her.  In just a few pages she became a friend.  Loved the writing.  A simple little book that I really enjoyed."}, {"review_sentiment": 4.0, "review_text": "Good story, ended too soon. I really like Larry McMurtry writing"}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 1.0, "review_text": "Tt%RashTRASH"}, {"review_sentiment": 2.0, "review_text": "Different - difficult to get into.  A soft, surprising ending."}, {"review_sentiment": 4.0, "review_text": "Good solid McMurtry....I have read almost all his books this year...Tthe only thing I like about Kindel is the ability to get all the books writen by a writer even the most ancient...Going back you get the BEST earlier works."}, {"review_sentiment": 1.0, "review_text": "I am a big Larry McMurtry fan and can think of no better novel than Lonesome Dove, but this book was awful.  No character development, no depth of plot, and no connection to the reader.  It was 275 pages of drivel.  I don't think he wrote this book.  The Larry McMurtry I know did not write this book."}, {"review_sentiment": 1.0, "review_text": "By setting the price for this extremely short novel, that was written decades ago - $6.00 more than the paperback - Simon & Schuster makes it clear that they don't want you to buy the kindle edition.I suggest you give them what they want.$13.52 for the paperback is also highway robbery, so I suggest you pick it up second-hand.The Dessert Rose isn't in the same class as classics like Lonesome Dove, Terms of Endearment, etc. but it's still vintage McMurtry, e.g. The Last Picture Show, Texasville, Dwayne's Depressed...BTW while were on the subject of Larry McMurtry - who got an Oscar for the screenplay - I highly recommend Willie Nelson's classic: I Ain't Goin Down on Brokeback Mountain."}]}, "authors": ["Larry McMurtry"], "isbn": "0684853841", "longitude": -115.149225, "periods": ["1900s"], "title": "The Desert Rose : A Novel", "word_cloud": "read sequel become intrigued early life daughter well thus begin search originally publish fortunate able receive new version look forward learn earlier year expect story line closer term endearment even star disappointed sorta choppy guess mcmurtry hit wonder thatch fell respect resilience wish better page become friend write simple little really enjoy good story end soon really write great difficult soft surprising end good solid mcmurtry almost year thing like ability get write writer even ancient go back earlier work big fan think better awful character development depth plot connection page drivel think write know write set price extremely short write decade paperback make clear want buy suggest give paperback also highway robbery suggest pick class classic term etc still vintage last depress subject get screenplay highly recommend classic ai", "genres": ["Fiction & Literature"], "summary": "Pulitzer Prize-winner Larry McMurtry writes novels set in the American heartland, but his real territory is the heart itself. His gift for writing about women -- their love for reckless, hopeless men; their ability to see the good in losers; and their peculiar combination of emotional strength and sudden weakness -- makes The Desert Rose the bittersweet, funny, and touching book that it is. \r\n\r\nHarmony is a Las Vegas showgirl. At night she's a lead dancer in a gambling casino; during the day she raises peacocks. She's one of a dying breed of dancers, faced with fewer and fewer jobs and an even bleaker future. Yet she maintains a calm cheerfulness in that arid neon landscape of supermarkets, drive-in wedding chapels, and all-night casinos. While Harmony's star is fading, her beautiful, cynical daughter Pepper's is on the rise. But Harmony remains wistful and optimistic through it all. She is the unexpected blossom in the wasteland, the tough and tender desert rose. \r\n\r\nHers is a loving portrait that only Larry McMurtry could render.", "asin": "0684853841", "rank": "1504321", "city": "Las Vegas", "image": "https://images-na.ssl-images-amazon.com/images/I/41sU99qFCsL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}