{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 21.161829, "ratings": {"num_ratings": 80, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "I haven't read the book yet but I sure it's a good read otherwise I wouldn't have bought it."}, {"review_sentiment": 5.0, "review_text": "Good book."}, {"review_sentiment": 4.0, "review_text": "good"}, {"review_sentiment": 5.0, "review_text": "This book is great for students and leisurely readers alike. It gives you a great understanding on the Mayan culture.The book was in great condition and came on time!"}, {"review_sentiment": 5.0, "review_text": "Book was in excellent condition."}, {"review_sentiment": 5.0, "review_text": "Good"}, {"review_sentiment": 5.0, "review_text": "Very interesting."}, {"review_sentiment": 5.0, "review_text": "Great edition."}, {"review_sentiment": 5.0, "review_text": "Accurate and poetic translation of the only surviving \"Bible\" of the Maya Indians.  Really wonderful when read aloud and the illustrations (taken from other scrolls, stellae and pottery) take the place of the now missing illustrations that would have adorned an original codex.  Cannot be recommended too highly."}, {"review_sentiment": 4.0, "review_text": "AP World History Review: The Popol Vuh is the Mayan account of creation. This book is eloquently written, and has a similar style to Greek Mythology. The similarity is shown by both cultures focusing on ingenious and original characters which their stories are centered around. These Mayan stories are less known; however, therefore the stories can be difficult to follow, due to of the old phrasing and words. This book was not written through for modern day humans to be able to follow as we would a novel. The Popol Vuh serves the purpose of documenting Mayan oral culture specifically for those of Mayan descent. The authors completed their purpose in documenting Mayan beliefs well. The Popol Vuh was divided into five sections to better tell each portion of the creation story. The characters are constant through each section, and they all magnify the gods in different ways. There are also underlying themes within all the stories. Many of these themes deal with greed, sin, or justice. These are comparable with themes in the bible, and many of these stories also relate to biblical ideas. This correlation shows how the Popol Vuh possibly is the Mayan holy book, and the foundation for Mayan society."}]}, "authors": null, "isbn": "0684818450", "longitude": -86.82505, "periods": ["Pre Common Era"], "title": "Popol Vuh", "word_cloud": "yet sure good otherwise good good great student leisurely reader give great understanding great condition come time excellent condition good very interesting edition poetic translation survive wonderful aloud illustration take scroll stellar pottery take place miss illustration adorn original codex recommend highly account creation eloquently write similar style similarity show culture focus ingenious original character story center story le know however therefore story difficult follow due old phrasing word write modern day human able follow serve purpose document mayan oral culture specifically descent author complete purpose document belief well divide section better tell portion creation story character constant section god different way also underlie theme story theme deal sin justice comparable theme bible many story also relate biblical idea correlation show possibly holy foundation society", "genres": ["History", "Ancient Civilizations"], "summary": "Popol Vuh, the Quiché Mayan book of creation, is not only the most important text in the native languages of the Americas, it is also an extraordinary document of the human imagination. It begins with the deeds of Mayan gods in the darkness of a primeval sea and ends with the radiant splendor of the Mayan lords who founded the Quiché kingdom in the Guatemalan highlands. Originally written in Mayan hieroglyphs, it was transcribed into the Roman alphabet in the sixteenth century. \r\n\r\nThis new edition of Dennis Tedlock's unabridged, widely praised translation includes new notes and commentary, newly translated passages, newly deciphered hieroglyphs, and over forty new illustrations.\r\n\r\n\"Popol Vuh is one of the great books about the creation of the world. It is the Mayan Bible.\" \r\n\r\nCarlos Fuentes ", "asin": "0684818450", "rank": "66267", "city": "Cancun", "image": "https://images-na.ssl-images-amazon.com/images/I/51Wd1W0nnhL.jpg", "country": "Mexico", "story_arc": ["Tragedy", "Things only get worse"]}