{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 24.5895489, "ratings": {"num_ratings": 73, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "An important book for anyone interested in understanding the complex web of life."}, {"review_sentiment": 5.0, "review_text": "Such an interesting and informative read"}, {"review_sentiment": 5.0, "review_text": "My trip to Costa Rica was greatly enriched by having read this book."}, {"review_sentiment": 5.0, "review_text": "One of my favorite books. Will change the way you think about nature and biology. (unless you're already an evolutionary biologist. in which case, still an enjoyable book)."}, {"review_sentiment": 5.0, "review_text": "Good book if you are interested in the tropical forests and how the function. Valuable information for travelers to Ecuador  and Costa Rica ."}, {"review_sentiment": 5.0, "review_text": "This book was so interesting! It was written by two scientists who had a tongue and cheek way of writing. One studied in Costa Rica and the other studied in the Amazon. It  gave such interesting facts about the animals and insects you may find in a rain forest. The chapter on the dung beetle was hilarious! The bot fly really creeped me out, until my doctor told me, \"If you get one, come let me take it out. I want to see one before I die!\""}, {"review_sentiment": 5.0, "review_text": "Reads as smoothly as wonderful fiction! - but its our world. Wow!"}, {"review_sentiment": 5.0, "review_text": "Thanks!"}, {"review_sentiment": 5.0, "review_text": "Great book!  Easy, interesting read."}, {"review_sentiment": 5.0, "review_text": "Very informative book while still being interesting and enjoyable to read.  I highly recommend this book for anyone wanting to learning more about the tropical rainforests."}]}, "authors": ["Adrian Forsyth", "Ken Miyata"], "isbn": "0684187108", "longitude": -107.3920441, "periods": ["1900s"], "title": "Tropical Nature: Life and Death in the Rain Forests of Central and South America", "word_cloud": "important anyone interested understanding complex web such interesting informative trip greatly enrich favorite way think nature biology already evolutionary biologist case still enjoyable good interested function valuable information traveler interest write scientist tongue cheek way write study study give interesting fact animal insect chapter dung beetle hilarious bot fly really creeper doctor tell come let want see die smoothly wonderful fiction world thanks interest very informative still interest enjoyable highly recommend anyone want learn rain forests", "genres": ["Science & Nature"], "summary": "Seventeen marvelous essays introducing the habitats, ecology, plants, and animals of the Central and South American rainforest.\r\n\r\nA lively, lucid portrait of the tropics as seen by two uncommonly observant and thoughtful field biologists. Its seventeen marvelous essays introduce the habitats, ecology, plants, and animals of the Central and South American rainforest. Includes a lengthy appendix of practical advice for the tropical traveler.", "asin": "0684187108", "rank": "71990", "city": "Costa Rica", "image": "https://images-na.ssl-images-amazon.com/images/I/51XdmiJGR0L.jpg", "country": "Mexico", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}