{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 2162, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "Liked this one through and through...a really fast pace...felt like I was right there...Will read again some day...Enjoyed it that much"}, {"review_sentiment": 5.0, "review_text": "I have never fished in my life. I honestly do not care for it, and listening to people talk about fishing generally makes me want to fling myself into a sea full of frenzied sharks. That being said, The Old Man and the Sea is a beautiful story. Picking it up I read it straight through in one sitting, because I simply could not stop. And while some complain about the small font size, it is not so bad as they say. You'll be so engrossed with the story you'll have the pages pressed up close to your face anyways."}, {"review_sentiment": 5.0, "review_text": "Cover has a funky ruppery texture to it. Looks nice!As to the book, what can I say that hasn't been said...it's a classic and definitely one of my favorites."}, {"review_sentiment": 2.0, "review_text": "This magnificent literary classic deserves a much better presentation than this edition provides. When ordering this edition, I thought I was getting a bargain, but I was in fact being taken! This edition is 44 pages because the type is so tiny even someone with perfect eyesight would have to strain to read it. Disappointing but it serves as a renewal of that warning, \"Buyer Beware\"."}, {"review_sentiment": 3.0, "review_text": "As I was reading, I was thinking of how much you could write of a man in a little boat.  My scepticism was for naught."}, {"review_sentiment": 5.0, "review_text": "Great short story.  Wasn’t sure I would like it, but Hemingway has yet to disappoint. Don’t skip this wonderful story!"}, {"review_sentiment": 5.0, "review_text": "Excellent story and short enough to read in a few days. Glad I bought this book, really enjoyed it."}, {"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 5.0, "review_text": "A masterpiece; great purchase."}, {"review_sentiment": 5.0, "review_text": "Worth Reading it!!!Really nice book.Highly Recommended.Definately a five star."}]}, "authors": ["Ernest Hemingway"], "isbn": "0684801221", "longitude": -82.3658671, "periods": ["1900s"], "title": "The Old Man and The Sea", "word_cloud": "like really fast pace felt right day much never fish life honestly listen people talk fish generally make want fling full frenzied shark say beautiful story pick straight sit simply small font size bad say engrossed story page press close face anyways funky crupper texture say say classic definitely favorite magnificent literary classic deserve much better presentation edition provide order edition think get bargain fact take edition page type tiny even someone perfect eyesight serf renewal warn read think much little boat skepticism naught short story sure yet disappoint skip wonderful story excellent story short enough day buy really enjoy excellent masterpiece great purchase worth nice star", "genres": ["Fiction & Literature"], "summary": "The Old Man and the Sea is one of Hemingway's most enduring works. Told in language of great simplicity and power, it is the story of an old Cuban fisherman, down on his luck, and his supreme ordeal -- a relentless, agonizing battle with a giant marlin far out in the Gulf Stream. \r\n\r\nHere Hemingway recasts, in strikingly contemporary style, the classic theme of courage in the face of defeat, of personal triumph won from loss. Written in 1952, this hugely successful novella confirmed his power and presence in the literary world and played a large part in his winning the 1954 Nobel Prize for Literature.", "asin": "0684801221", "rank": "2093", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/411pakPjvdL.jpg", "country": "Cuba", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}