{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 41, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "So good!  Loved Austin in the early years and the various characters."}, {"review_sentiment": 5.0, "review_text": "Book indeed has a Twist at the End. Story kept me on edge. Hard to put down. Story surrounds servant girl murders in Austin Texas. Excellent history of Austin at the turn of the century. Would recommend buying this book."}, {"review_sentiment": 4.0, "review_text": "I live in Austin, Texas so thoroughly enjoyed reading about my city back in 1885. I knew O'Henry lived in Austin but never knew he was here during the infamous Servant Girl Murders so learned a great deal about the murders and Austin in general. I now need to make an effort to visit the O'Henry and Elizabeth Ney museums. :-)  The story itself was engaging but I felt the final chapter dragged a bit and the ending was far-fetched...although I realize fictional. Still overall a fun read and I would recommend -- especially to a fellow Austinite"}, {"review_sentiment": 5.0, "review_text": "I went to high school and college in Austin and am an O.Henry fan.  This was the second time I've read the book -- a great read, doubly so because it is based on actual events in Austin and in O.Henry's life."}, {"review_sentiment": 4.0, "review_text": "I live in Austin and found that Saylor's description of events and characters was based on facts and actual events. The mysterious men who traveled through Austin at the time of murders were fictitious, however. Although the mystery was never historically solved, Saylor's solution was quite remarkable."}, {"review_sentiment": 4.0, "review_text": "This is a fun book despite the seriousness of the crimes involved, especially if you live in Austin TX.  The history and places are so familiar.  It takes place in the mid to late 1800s.  The story line is rather predictable but it is a great read.  You don't want to put it down."}, {"review_sentiment": 4.0, "review_text": "Very compelling book.  Fun to read about all the places in Austin that I know about and have seen.  The end is sort of a stretch, but overall I love Stevens written style and have read all of his Roman sub rosa series."}, {"review_sentiment": 3.0, "review_text": "Not as good as his Roman historical novels."}, {"review_sentiment": 5.0, "review_text": "Steven Saylor is a brilliant storyteller.  He can weave regular boring history into a tight , fast paced,  moving and beautiful novel  I love his novels of the Roman Republic and  glad I took the chance on this book. A great and fascinating read."}, {"review_sentiment": 5.0, "review_text": "It was so fun open this book and see that it was signed by the author!!  I think it is also a first edition.  What a find!"}]}, "authors": ["Steven Saylor"], "isbn": "0684856816", "longitude": -97.7436995, "periods": ["1800s"], "title": "A Twist at the End: A Novel of O. Henry", "word_cloud": "so good early year various character indeed keep edge put surround servant girl murder history turn century buying live thoroughly enjoy read city back know live never know infamous learn great deal murder general need effort visit museums story engage felt final chapter drag bit end realize fictional still overall fun especially fellow go high school college fan second time great doubly base actual event life live find description event character base fact actual event mysterious men travel time murder fictitious however mystery never historically solve solution quite remarkable fun seriousness crime involve especially live history place familiar take place mid late story line rather predictable great want very compelling place know see end sort stretch overall love stevens write style sub rosa series not good historical novel brilliant storyteller weave regular boring history tight fast paced move beautiful love novel glad take chance great fascinating fun open see sign author think also first edition", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "In an artful blending of history, literature, and vivid imagination, author Steven Saylor has crafted a novel that, much as Caleb Carr's bestselling \"The Alienist,\" combines real characters and true crime into a story that is an engrossing work of fiction.\r\n\r\nThe city of Austin, Texas, \"is fearfully dull,\" wrote young Will Porter to a friend in the spring of 1885, \"except for the frequent raids of the Servant Girl Annihilators, who make things lively in the dead of night.\"\r\n\r\nYears later, Will Porter would become famous as O. Henry, the toast of New York and the most celebrated writer in America. The long-ago Texas killings, which he dubbed the work of the Servant Girl Annihilators -- perhaps the first recorded serial murders in America -- would remain unsolved. But the appearance of a merciless blackmailer and a mysterious stranger would draw Porter back into the past, and back to Texas, to confront the stunning solution to those murders -- and the secrets of his own soul.\r\n\r\nWhen he was a young man in Austin in that spring of 1885, Porter fell in love. Her name was Eula Phillips. She was beautiful. She was married to someone else. And she was doomed to be a victim of the Servant Girl Annihilators.\r\n\r\nThe first victims were young Black women who worked in the households of Austin's most prominent citizens. The crimes were unspeakable. The authorities were baffled. The murders continued, month after month, until suddenly, shockingly, the pattern changed. On a bloody Christmas Eve, two women -- neither of them Black and neither of them servants -- were horribly murdered, seemingly by the same vicious stalker. One of them was Eula Phillips. Her death was to be a defining event inthe life of the young man who would one day become O. Henry. The trial that resulted -- uncovering one explosive scandal after another -- would tear the city of Austin apart.\r\n\r\nThe capitol of Texas was a city in uneasy transition. Only a few years earlier, outlaw gangs and Comanche Indians had roamed the hills where now stood the homes of cattle barons and university professors. The animosities of the Civil War still lingered, and the struggle of Blacks for equality was just beginning. By day, politicians in the state legislature debated equal rights for women; by night, those same politicians mingled with the high-class prostitutes of Guy Town, the city's notorious vice district. Southern traditions of manners and decorum concealed ugly secrets, all of which would be revealed before the saga of the Servant Girl Annihilators reached its end.\r\n\r\nAgainst this remarkably rich background, Steven Saylor, author of the acclaimed \"Roma Sub Rosa\" series, has crafted a novel that melds fact with fiction, employing characters both real and imagined. The crimes and trials described in \"A Twist at the End\" actually happened. In real life, no satisfactory resolution was reached. But in the course of investigating the crimes, Saylor has come up with his own startling conclusion to a riveting, century-old mystery.\r\n\r\nThe result is a masterful novel of intrigue and murder, yet at the same time a romance of time and place, with a colorful cast of memorable characters brought vividly to life. It's a true tale of Texas, grand in both setting and scope.\r\n\r\n\"It's all fascinating and provocative...\" The New York Times ", "asin": "0684856816", "rank": "240816", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/41HZ0ZWRY3L.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}