{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 382, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "I loved this book, such great prose, atmosphere, and characters. It will either be your cup of tea or it won't."}, {"review_sentiment": 5.0, "review_text": "Truly a glorious tale of masculinity, rife with debauch. The gateway to middle age, excessive drinking, and hot Caribbean nights. Not to be missed."}, {"review_sentiment": 5.0, "review_text": "Amazing book! Hunter S. Thompson is even a master at writing fiction."}, {"review_sentiment": 5.0, "review_text": "a great read"}, {"review_sentiment": 5.0, "review_text": "The Rum Diary can be had in a hardcover edition?  Hot damn!"}, {"review_sentiment": 5.0, "review_text": "Good Book, Good Man"}, {"review_sentiment": 3.0, "review_text": "This was written when Hunter was real young and it shows. His craft wasnt refined and the book seems to go nowhere. Bought it to see what they kept in the movie."}, {"review_sentiment": 5.0, "review_text": "Great story, slightly different from the Johnny Depp movie.  Classic Hunter S. Thompson."}, {"review_sentiment": 5.0, "review_text": "Hunter Thompson was such a great writer.  This novel was not what I expected, but I really, really liked it.  It was a story about a young newspaper writer's time in Puerto Rico in the late 1950's, giving a lot of insight into why so many Puerto Ricans fled to New York at the time.  Interesting, realistic stories of life there at that time, full of craziness, drinking, sex and life in general."}, {"review_sentiment": 4.0, "review_text": "I enjoyed it. I have to type more words before it will be accepted.... hello what do you do for fun?"}]}, "authors": ["Hunter S. Thompson"], "isbn": "0684856476", "longitude": 0.0, "periods": ["1900s"], "title": "The Rum Diary: A Novel", "word_cloud": "love great prose atmosphere character either cup tea truly glorious tale masculinity rife gateway middle age excessive drinking hot night not miss amazing even master write fiction great hardcover edition damn good man write real young show craft wast refine seem go nowhere see kept movie story slightly different movie great writer expect really really like story young newspaper writer time late give lot insight many flee time realistic story life time full craziness drink sex life general enjoy type word accept hello fun", "genres": ["Fiction & Literature"], "summary": "The Rum Diary—a national bestseller and New York Times Notable Book—is Hunter S. Thompson’s brilliant love story of jealousy, treachery, and violent lust in the Caribbean.\r\n\r\nBegun in 1959 by a twenty-two-year-old Hunter S. Thompson, The Rum Diary is a brilliantly tangled love story of jealousy, treachery, and violent alcoholic lust in the Caribbean boomtown that was San Juan, Puerto Rico, in the late 1950s. \r\n\r\nThe narrator, freelance journalist Paul Kemp, irresistibly drawn to a sexy, mysterious woman, is soon thrust into a world where corruption and get-rich-quick schemes rule and anything (including murder) is permissible. \r\n\r\nExuberant and mad, youthful and energetic, this dazzling comedic romp provides a fictional excursion as riveting and outrageous as Thompson’s Fear and Loathing books.", "asin": "0684856476", "rank": "44989", "city": "Puerto Rico", "image": "https://images-na.ssl-images-amazon.com/images/I/51A-kFAe3ZL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}