{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 456, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Really great service"}, {"review_sentiment": 1.0, "review_text": "This book started out slow and went nowhere. I like a challenging novel, but I could not get interested.Three quarters of the way through he still introduces new characters, none of whom are engaging."}, {"review_sentiment": 5.0, "review_text": "One of DeLillo's longer reads so take that into account if you only have time to read books you can get through quickly.  Whether you'll enjoy this or not depends on if you like a firm 1990's setting and are captivated by the authors writing style along with his slant on things- eye for satire his own particular brand of humor- the critics love him and alot of readers that enjoy something not exactly predictable or standard in style also pick him up."}, {"review_sentiment": 5.0, "review_text": "One of my absolute favorite books. The jumps between NY and the Southwest + the way memory, landscape, art and the distance between years and human relationships are captured is just outstanding. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "The opening sentence is a doozy: \"He speaks in your voice, American, and there's a shine in his eye that's halfway hopeful.\"This is an epic poem of a novel that opens with an account of a 1951 baseball game (which coincides with the Soviets' atomic bomb test) and ends many decades later in the ashes of the Cold War. That opening chapter is spectacular, and the ball from the game-ending home run becomes a talisman, an symbol-laden beacon guiding us forward and back in time. Along the way we spend time with bookies, conceptual artists, nuns, street hoods, celebrities, heroin-addicted pool sharks, math teachers, homeless gay graffiti artists, serial killers, Lenny Bruce and J. Edgar Hoover (among many others).The themes are enormous and the artistry of the writing made me take my time absorbing its nearly 900 pages. Many times I re-read a paragraph to deconstruct how the hell DeLillo did it. The elliptical dialogue is brilliant and made me wish he also wrote plays.I guess Pynchon and Wallace (Infinite Jest) are the obvious comparisons, but DeLillo has a humanity and grace those two lack. Though often brilliantly funny, there’s an elegiac, mournful pedal tone running beneath it; as the relative innocence and simple (though existential) fears of the early Cold War are swapped, at a slow drip, for the complex, cynical ironies of today.To me, Underworld was like a great love affair; it wasn’t always easy, its heightened joys matched by the depths of sadness, its beauty interrupted by flashes of ugliness. I’ll never read it again but I’ll look back on it with a smile on my face and a lump in my throat.It’s about baseball, the atom bomb and the Bronx. And the many ways we’ve tried through the years, successfully or not, to dispose of the detritus of our collective and private past."}, {"review_sentiment": 2.0, "review_text": "nd then I read this book and now I'm afraid to read more. I will definitely be taking a break. This book starts with an absolutely brilliantly told baseball game. If you read no other part of this book (and I don't recommend you do) I definitely recommend the prologue.After that, the book takes a lot of turns all of them reminding me of the little bit I read of [book:Infinite Jest|6759]. Instead of tennis there was baseball, instead of insurance there was trash collection, and there was a movie whose relevance I don't really understand but which was described in detail. Don't write a book to describe a movie within the book. (Pretty sure there was a thing about a movie in IJ.)It was a SLOG to get through. NOTHING happened, I listened to it and spaced out more times than I care to mention and when I got back into it I just didn't care to go back and listen to what I missed. 800 pages of nothingness led us to an understanding of what happened to the main character when he was a kid, and it was just sad and disappointing. Also, HATED HIM and everybody else in the book (that may be partially attributable to the narrator.)Starting to think I should give this one star.I can see WHY this was nominated for an award, and can see why it won. Award people like blather. Nicole does not."}, {"review_sentiment": 5.0, "review_text": "What to make of ‘Underworld”. That is a question that followed me in the week it took for me to read the book. Reading it, I thought of both John Dos Passos and William Faulkner for the style and the breadth of the vision contained in the book. Faulkner captured the essence of the American south or the late 19th and early 20th centuries in his novels. Dos Passos with the USA trilogy and the Mid-Century novel traced the evolution of the American culture in the first half of the 20th century. Both used an elliptical non-linear style to illuminate their themes.  Underworld does the same in its goal of tracing the path of the American culture in the second half of the 20th century.This is a wonderful novel. I had read reviews here that it is difficult to read and that there is no plot to follow. I did not find this in my reading and I would urge people to give the novel a chance."}, {"review_sentiment": 5.0, "review_text": "Incredible prose. Brilliant mind."}, {"review_sentiment": 5.0, "review_text": "Nice selection of books and a great price. Arrived quickly, in great shape, just as advertised. Will order from this vendor again"}, {"review_sentiment": 4.0, "review_text": "Great book."}]}, "authors": ["Don DeLillo"], "isbn": "0684848155", "longitude": 0.0, "periods": ["1900s"], "title": "Underworld", "word_cloud": "really great service start slow go nowhere like challenge quarter way still introduce new character none engage longer read account time quickly depend firm set captivate author write style slant eye satire particular brand critic love a lot reader enjoy something exactly predictable standard style also pick absolute favorite jump way memory landscape art distance year human relationship capture outstanding recommend opening sentence dozy speak voice american shine eye halfway hopeful epic poem open account baseball game coincide atomic bomb test end many decade later ash open chapter spectacular ball home run become talisman beacon guide forward time way spend time bookie conceptual artist nuns street hood celebrity pool shark teacher homeless gay graffiti artist serial killer many others theme enormous artistry write make take time absorb nearly page many time paragraph deconstruct hell elliptical dialogue brilliant make wish also write guess obvious comparison humanity grace lack often brilliantly funny elegiac mournful pedal tone run beneath relative innocence simple existential fear early swap slow drip complex cynical irony great love affair always easy heighten joy match depth sadness beauty interrupt flash ugliness never look back smile face lump baseball atom bomb many way try year successfully dispose detritus collective private past afraid definitely take break start absolutely brilliantly tell baseball game part recommend definitely recommend take lot turn remind little bit instead tennis baseball instead insurance trash collection movie relevance really understand describe detail movie sure thing movie nothing happen listen spaced time care mention get back care back listen miss page nothingness lead understand happen main character kid sad disappointing also everybody else partially narrator start think give see nominate award people make question follow week take think style breadth vision contain capture essence american south late early century novel trilogy trace evolution american culture first half century used elliptical style illuminate theme goal trace path american culture second half wonderful review difficult plot find read people give chance incredible prose mind nice selection great price quickly great shape advertise order vendor great", "genres": ["Fiction & Literature"], "summary": "A finalist for the National Book Award, Don DeLillo’s most powerful and riveting novel—“a great American novel, a masterpiece, a thrilling page-turner” (San Francisco Chronicle)—Underworld is about the second half of the twentieth century in America and about two people, an artist and an executive, whose lives intertwine in New York in the fifties and again in the nineties.\r\n\r\nWith cameo appearances by Lenny Bruce, J. Edgar Hoover, Bobby Thompson, Frank Sinatra, Jackie Gleason and Toots Shor, “this is DeLillo’s most affecting novel…a dazzling, phosphorescent work of art” (Michiko Kakutani, The New York Times).", "asin": "0684848155", "rank": "46169", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51mmfEMO5zL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}