{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 19, "rating": 3.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Book was in good condition."}, {"review_sentiment": 4.0, "review_text": "So you’re an Asian young man in London for the first time. What do you find? A strip club. A launderette where they steal your clothes. Not a promising start is it? Nobody knows who you are beyond merely the colour of your skin.Nor is it to be in a house where the neighbours post lighted rags through the letter box, smash the windows and generally terrorised you because you are Asian. Yet this happened a lot and groups of bodyguards grew up to help and sit with these people.No wonder Muslims retreat in the need to belong, caught between East and West."}, {"review_sentiment": 2.0, "review_text": "Book felt like a sequence of contrived situations which forced the characters to deliver soliloquies to each other based on their various views. The issues the author was trying to nut out are undeniably serious, but felt cheapened by his heavy handed technique. I'm sure other people would love it, but not my thing."}, {"review_sentiment": 4.0, "review_text": "Is the liberalism that claims to fight the subjugation of others truly a colonial mentality that suppresses ethnic identity when it clashes with liberal ideas? \"Equality for everyone, as long as we exist within 'reasonable' boundaries of similarness\"? That's the question posed by this text when the religions and ethnic identity's of Shahid, a Pakistani Muslim living in Britain, clashes with his own liberal ideals, love of literature, and freedom of expression.The story also includes a fantastic romance between Shahid and his professor Deedee, however the strength of the text is in analyzing this apparent contradiction of liberalism which advocates for the rights of everyone but excludes certain practices and ideologies that may be essential for maintaining and asserting ethnic identity. The commentary on this issue is fully featured and dense, leaning towards modern western liberal ideas but not completely vindicating them for this oversight of exclusion. Kureishi doesn't endorse religious fundamentalism, but he certainly seems to respect the right of individuals to express their ethnic identity as they see fit. The text reflects that both well-meaning western liberalism and positive ethnic expression can go wrong if they're intolerant and violent, and the story shows the slippery slope that exists where both mentalities can lead to ruin."}, {"review_sentiment": 1.0, "review_text": "this is really the most boring book i have ever read. i read the whole thing, waiting in vain for something good to happen, and while i was waiting, in vain, the book ended. that was it. the last page. no climax, no excitment. i could say that something good did happen, the book ended, but with a name like \"the black album\", you might expect something more intriguing. maybe something having to do with, and this is a stretch....a black album. maybe i missed something, but the title and the fact that it did end were the 2 best things about this book. that, and i bought it either used, or on clearance. a forest fire would have been a better use of wood."}, {"review_sentiment": 4.0, "review_text": "Why does a college loafer of Pakistan origin flirt with fundamental Muslims, who become increasingly more extreme and more violent?That this topic points more today, in a time of the irrationalcondemnation of all Muslim tendencies than at thepublication date is no hint to a  prophetic gift Kureishis. He  \"only\" describes the colliding of two worlds in a very pointed way. A nightlife and drug-exterminating student, long used to the British rock'n'roll lifestyle and thus avoiding in-depth thinking. All meetings are volatile and forgotten tomorrow. What he notices from hisneighbour in his college-dormitory praying room, is just as volatile. The consequences of the actions of the ever-larger growing group of fundamentalists are invisible to him, in such a way that it's still easy and good to live  in two parallel universes, without coming to the conclusion that  one side could be dangerous to the other.And Kureishi is so intense in his description of this drifting between the worldsthat the reader is almost trying to look after the people in the road after finishing the Black Album.Kureishi has a qualities to offer in this  book that is surely one of his best:-forgetting to think about the own self can easily have dangerous consequences (maybe someday a skinhead-analyzing social paedagogue reads the book?)- it outlines the blueprint of the oh-so concerning and understandingmulticulturalist in the person of the lector, who can be nothing but another volatile relationship for the student.-a book almost selfreading but worth to be read at least one more time to get all sidestreams and hidden wisdom-it shows that one can vary only one topic again and again,without  becoming a selfcopy or delivering poor literature.Sometimes the reader gets the impression that Kureishi only knows one story and three persons. It's just a constant rearranging of the situations and relations which makes  a new book. BUT: Nothing else is done by great cooks and is there anybody out there who doesn't like to have a decent meal?This is great literature! period!"}, {"review_sentiment": 2.0, "review_text": "Indians, Pakistanis, English right-wing thugs, academics, swingers, religious zealeots, idealists, pushers and the hopeless meet in London, but do little to create much excitement.A young Pakistini student moves to the big city after the death of his father and deals with himself, his sexuality, relgious beliefs, his family's bollywood-like dramas and his neighbour's idealists (mis)adventures.To rate this book on the strength of the images it conjures up for those who lived in London during that era, might not be the fairest way to judge a book. Apart from the protagonst's unconvincing affair with his lecturer and run-ins with his brother, there is little else to grab the attention of the reader.A slow and tedious read and had i not picked this up for only US$2, the rating would be easily one star."}, {"review_sentiment": 1.0, "review_text": "It is truly ironic that a novel whose plot and characters culminate in a powerful condemnation of intellectual narrowmindedness (here portrayed by a scene of Muslim radicals burning Rushdie's Satanic Verses on a college campus) turns out to be no more than an allegorical book burning in its own right.  Kureishi's characters are rigid and simplistic proto-types of good and evil that appear to draw their inspiration from vulgar popular stereotypes rather than the imagination of a literary genius.  The protagonist's Muslim friends are befitting of what George Bush today calls \"terrorists,\" while his secular mistress embodies all the excitement of intellectual and physical freedoms which, oddly enough, remain unadulterated in the writer's mind by the fact that she also happens to be a junkie and a nymphomaniac.  It could even be said that the author revels in her worldly vices which emerge as virtues in comparison with the excesses of religious fervor.  The final scene in which the protagonist's mistress and Muslim friend physically struggle for him, each pulling him by one arm in the opposite direction is a ludicrous and exaggerated portrayal of his inner struggle to compromise his faith and worldly passions.  This and other \"key\" scenes of the book (not to mention the dialogue) are so lacking in subtlety that they would do well in an elementary school reader where the audience cannot see beyond the obvious.  As is to be expected of a novel thoroughly colored by an (ironically) anti-intellectual aversion to religion, worldly passions hold sway and all good is ultimately on their side - including freedom of thought.  Unfortunately, Kureishi leaves his readers very little room to think in a story-line that categorically and unjustly rejects compromise between faith and intellectual illumination, forcing one to take sides in what ultimately ends up being a thoroughly anti-intellectual and propagandistic exercise in writing.  Though I treasure books that range from authors such as Gabriel Garcia Marquez to Marquis de Sade, this was the first that I had to relegate to the bin.  It did not deserve a place in what I consider to be an open-minded and intelectually stimulating literary collection."}, {"review_sentiment": 5.0, "review_text": "Yet another winner from Hanif Kureishi as he delves deep into the world of drugs, music and adolescent confusion within theworld of a group of Asian college students. Taking the title from a Prince album, Kureishi explores the interrelations between aworking class Asian student heavily influenced by literature and his revolutionary, English lecturer with whom he begins an affair.This is counterbalanced by the threats of an uprising amongst his fellow students who seek to defend themselves against the prejudice they see within neighbouring communities.In a titanic struggle, Shahid Hasan must choose between his friends and his lover, both of whom are cast in the revolutionarylights yet in radically different ways. Just as in The Buddha of Suburbia, Kureishi's own literary and musical tastes are revealedyet this also shows what can go wrong when one person takes it on themselves to embody the opinions of the majority. Theresult sees the boundaries of class and identity become tragically blurred amongst a haze of pills, alcohol and teenage outrage.Once again Kureishi reinforces his position as one of the best non-British writers in British literature with a rollercoaster novel which moves between the deadly serious and wickedly funny, true genius."}, {"review_sentiment": 5.0, "review_text": "This book is so different from most I read. It is violent, real, well written and provides fascinating insights into the life of a culture we live so close with and normally do not know, our own seen from outside, i.e. the protagonist Shalid's Pakistan part of view, and into that of immigrants around us seen from Shalid's western point of view as he had been growing up here. Rather worth reading!"}]}, "authors": ["Hanif Kureishi"], "isbn": "0684825406", "longitude": -0.12574, "periods": ["1900s"], "title": "The Black Album", "word_cloud": "good condition so asian young man first time strip club launderette steal clothes not promise nobody know merely color house neighbor post light rag letter box smash window generally terrorize asian happen lot group bodyguard grow help wonder retreat need belong catch felt like sequence contrive situation force character soliloquy base various view issue author try nut undeniably serious felt cheapen heavy hand technique sure people thing be liberalism claim fight subjugation others truly colonial mentality suppress ethnic identity clash liberal idea everyone long exist boundary similarness question pose text religion ethnic identity live clash liberal ideal love literature freedom story also include fantastic romance professor however strength analyze apparent contradiction liberalism advocate right everyone exclude certain practice ideology maintain assert ethnic identity commentary issue fully feature dense lean towards modern western liberal idea completely vindicate oversight exclusion endorse religious fundamentalism certainly seem respect right individual express ethnic identity see fit text reflect western liberalism positive ethnic expression go wrong intolerant violent story show slippery slope exist mentality lead ruin really boring ever whole thing wait vain something good happen wait vain end last page climax excitement something good happen end name something intriguing maybe something stretch maybe miss something title fact end best thing buy either used clearance forest fire use wood college loafer origin flirt fundamental become increasingly extreme violent topic point today time irrational condemnation tendencies the publication date hint prophetic gift describe collide world point way nightlife student long use british lifestyle thus avoid think meeting volatile forgotten tomorrow notice hisneighbour pray room volatile consequence action grow group fundamentalist invisible way still easy good live parallel universe come conclusion side intense description drift almost try look people road finish quality offer surely best think easily dangerous consequence maybe someday social pedagogue read outline blueprint concern understandingmulticulturalist person elector nothing volatile relationship almost self reading worth least time side streams hidden show vary topic become self copy deliver poor get impression know story person constant rearrange situation relation make new else do great cook anybody decent meal great literature period indian academic swinger religious zealot idealists pusher hopeless meet little create much young student move big city death father deal sexuality religious belief family dramas neighbor idealist sim rate strength image conjures live era way judge protagonist unconvincing affair lecturer brother little else grab attention slow tedious pick rating easily star truly ironic plot character culminate powerful condemnation intellectual narrow mindedness portray scene radicals burn college campus turn allegorical burning right character rigid simplistic good evil appear draw inspiration vulgar popular stereotype rather imagination literary genius protagonist friends befit today call terrorist secular mistress embodies excitement intellectual physical freedom oddly enough remain unadulterated writer mind fact also happen junkie even say author revel worldly vice emerge virtue comparison excesses religious fervor final scene protagonist mistress friend physically struggle pull arm opposite direction ludicrous exaggerate portrayal inner struggle compromise faith worldly passions key scene mention dialogue lacking subtlety well elementary school audience see obvious expect thoroughly color ironically aversion religion worldly passion hold sway good ultimately side include freedom think unfortunately leave reader little room think categorically unjustly reject compromise faith intellectual illumination force take side ultimately end thoroughly propagandist exercise write treasure range author first relegate deserve place consider intellectually stimulate literary collection yet winner delve deep world drug music adolescent confusion the world group college student take title explore interrelation work class asian student heavily influenced literature revolutionary english lecturer begin counterbalanced threat uprise among st fellow student seek defend prejudice see neighbor titanic struggle friend cast revolutionary lights yet radically different way just literary musical taste revealed yet also show wrong person take embody opinion majority see boundary class identity become tragically blurred among st haze pill alcohol teenage reinforce position best writer british literature roller coaster move deadly serious wickedly funny true genius different violent real well write provide fascinate insight life culture live close normally know see outside protagonist part view immigrant see western point view grow worth read", "genres": ["Fiction & Literature"], "summary": "The Black Album is the second novel by Hanif Kureishi, one of the most praised and influential writers of our times. It is set in London in 1989, the year after the second acid-fuelled 'summer of love' - also the year in which the Ayatollah Khomeini pronounced his infamous fatwa upon Salman Rushdie.\r\n\r\nThe Black Album is a portrait of a young Asian man being pulled in conflicting directions: one way by the lure of sexual and hallucinogenic hedonism, another by the austere certitudes of Islam. Shahid Hasan, a clean-cut kid from the provinces, comes to London after the death of his father. He makes his home in a Kilburn bedsit, falls in love with postmodernist college lecturer Deedee Osgood, and soon finds himself passionately embroiled in a spiritual battle between liberalism and fundamentalism.", "asin": "0684825406", "rank": "1016291", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41jNQ5Q1IoL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}