{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 232, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "It was extremely graphic, and I loved it. I wasn't too big on the gay sex but everything else was fantastic. Thank you Poppy Z. Brite for illuminating these characters and telling their tale."}, {"review_sentiment": 2.0, "review_text": "I don't mind the graphic sex and murder. It just never came together for me. Part of it was that it was too slow: the romance between Jay and Andrew doesn't even begin until well over halfway through the book, and as a result there isn't enough time to effectively convey their connection."}, {"review_sentiment": 5.0, "review_text": "Exquisitely written and a true horror story.  One can tell that Jeffrey Dahmer plays a big role in the characterization of this writer.  The Asian boy that escapes for a few minutes.  Not for the faint of heart but a damn good read if you don't mind gore eloquently depicted."}, {"review_sentiment": 5.0, "review_text": "MUST READ!!! LOVE THIS AUTHOR AND THIS BOOK SPECIFICALLY"}, {"review_sentiment": 1.0, "review_text": "I never received this bad thing k. Which makes me a bit sad. I would have loved to have read it. She's one of my favorite authors."}, {"review_sentiment": 5.0, "review_text": "Definitely one of my new favorites. Judging by the reviews, I know this is not for everyone. However, I must say I'm a bit taken aback by those who were put off by the gore. Did you not read what it was about before you picked it up? It's about serial killers... There's bound to be some gore. Hello? Anyway, there are some OCR issues with the Kindle version so the wrong words are used sometimes--that's not the author's fault. The writing here was solid and juicy, and I lapped it right up. One reviewer said it was purple, but I disagree. Just because there are words used that you don't know does not make it purple. One thing that astounded me was how each character had his own voice. I knew whose POV it was immediately. Well done, Poppy Z. Brite. I will be diving into the rest of her work soon."}, {"review_sentiment": 4.0, "review_text": "I finally picked up this book after remembering what a big splash the author made back in the mid-90s. I have to say that the splash was well deserved. If you know anything about the author’s books, you know that I mean that in the ways you’re probably thinking. But I also mean it in others.The quality of the writing here is very strong. The characters are all generally drawn quite well, with the exception ofAndrew’s voice is compelling, and as he drives a majority of the events, having him take the lead in the first chapter is an excellent choice. And, despite the fact that he is a serial killer who revels in all the usual cruelty and unique bloodiness his obsession entails, he is a compelling character whenever his scenes queue up. A bad guy readers love to hate and love at the same time.It is a particular testament to the author’s skill to note that the method by which Andrew escapes from prison is drawn quite believably in the novel…even skeptical readers will agree to suspend their disbelief.Jay is a budding killer who has the discipline to avoid fouling the city where he lives with his own kills…until Tran, a particularly beautiful Vietnamese hustler throws his considerable charms at Jay’s feet.Tran’s sections are very well drawn, and allow readers to walk in yet a third lifestyle and mindset that is very different than the first two offered up in this book.Lucas is the one that is the least compelling. Perhaps this is because his illness keeps him quiet in terms of activity, or perhaps it’s because he has the most common, almost suburban, existence of all the characters. Still, his portrait, when added to the other three, rounds out this work and creates a richness that otherwise would be lacking.The four are pulled ever more tightly together. The two killers begin to work together, and there is that bloody finale that had so many people squawking when the work came out. (The author was rejected by the publisher of all his previous books because of the gruesome climactic orgy.) Which certainly is shocking but really isn’t any more horrible or ugly to read than many of the sections the killer recalls and enacts in preceding scenes. Which leads you to wonder why this was rejected at all.If you’re a gory fiction fan, this one is for you!If you enjoy stories that capture the mind of killers, you should check out Beloved: A Sensual Noir Thriller"}, {"review_sentiment": 5.0, "review_text": "This was a great book. Superb writing about a very disturbing subject. I have never read a book like this."}, {"review_sentiment": 1.0, "review_text": "I know taste in books is personal, but this book has no redeeming values to me. After reading it, I feel a bit ashamed of myself! I feel l participated in something immoral. I enjoy a dark or gory read sometimes, but this..... I understand that it is fantasy, but the amount and detail of torture was over the top. Morality aside, many of the plot twists were too convenient and the almost supernatural abilities the serial killer used to escape from jail were laughable. I also can't decide if the author hates gay men or just has an obsessive fascination with them. Not every gay man has HIV/AIDS! I normally donate my books after I read them, but I will be using this to line bird cages."}, {"review_sentiment": 1.0, "review_text": "Really gross and unpleasant"}]}, "authors": ["Poppy Z. Brite"], "isbn": "0684836270", "longitude": -90.0701156, "periods": ["1900s"], "title": "Exquisite Corpse", "word_cloud": "extremely graphic love big gay sex everything else fantastic illuminate character tell tale mind graphic sex murder never come together romance even begin well halfway enough time effectively convey connection exquisitely write true horror story tell play big role characterization boy escape minute not faint heart damn good mind gore eloquently depict never receive bad thing make bit sad love favorite author definitely new favorite judge review know everyone however bit take put gore pick serial killer gore issue version wrong word use sometimes author fault writing solid juicy lap right reviewer say purple disagree just word use know make purple thing astound character voice know immediately do dive rest work soon finally pick remember big splash author make say splash well deserve know anything author know mean way probably think also mean quality writing strong character generally draw quite well exception of andrew voice compel drive majority event take lead first chapter excellent choice fact serial killer revel usual cruelty unique bloodiness obsession entail compelling character scene queue bad guy reader love hate love particular testament author skill note method escape prison drawn quite believably skeptical reader agree suspend bud killer discipline foul city life particularly beautiful hustler throw considerable charm section well drawn allow reader walk yet third lifestyle mindset different first offer least compelling perhaps illness keep quiet term activity perhaps common almost suburban existence character still portrait add round work creates richness otherwise pull ever tightly together killer begin together bloody finale many people squawk work come author reject publisher previous gruesome climactic orgy certainly shock really horrible ugly many section killer recall enacts precede scene lead wonder reject gory fiction fan enjoy story capture mind killer check beloved sensual great write disturb subject never know taste personal redeeming value read feel bit ashamed feel l participate something immoral enjoy dark gory sometimes understand fantasy amount detail torture top aside many plot twist convenient almost supernatural ability serial killer use escape jail laughable also author hate gay men obsessive fascination not gay man normally donate use line bird cage really gross unpleasant", "genres": ["Fiction & Literature", "Mystery & Suspense", "LGBT"], "summary": "From the author of Lost Souls, Drawing Blood, and Wormwood comes a thrilling and chilling novel that bestselling author Peter Straub says serves as a “guidebook to hell.”\r\n\r\nTo serial slayer Andrew Compton, murder is an art, the most intimate art. After feigning his own death to escape from prison, Compton makes his way to the United States with the sole ambition of bringing his “art” to new heights. Tortured by his own perverse desires, and drawn to possess and destroy young boys, Compton inadvertently joins forces with Jay Byrne, a dissolute playboy who has pushed his “art” to limits even Compton hadn’t previously imagined. Together, Compton and Byrne set their sights on an exquisite young Vietnamese-American runaway, Tran, whom they deem to be the perfect victim. \r\n\r\nSwiftly moving from the grimy streets of London’s Piccadilly Circus to the decadence of the New Orleans French Quarter, Poppy Z. Brite dissects the landscape of torture and invites us into the mind of a killer. Exquisite Corpse confirms Brite as a writer who defies categorization. It is a novel for those who dare trespass where the sacred and profane become one.", "asin": "0684836270", "rank": "400645", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/41owT74hMWL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}