{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 40.4167047, "ratings": {"num_ratings": 1022, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Good classic read."}, {"review_sentiment": 3.0, "review_text": "I personally found this book way too long and slow-moving.  I read A Farewell to Arms many years ago and remembered liking it better (perhaps it was shorter?).  I stuck with it, and did like how it ended.  But the copy I had contained numerous typos, which seems weird for a classic like this, and I found certain things annoying, like saying \"the\" Pilar or \"the Maria\" at times (but not at others).  I found this in another review - it was strange how he used the word \"obscenity\" instead of using a curse word.  A quote near the end I enjoyed: \"War is a bitchery\".  Shouldn't it have been \"War is an obscenity\"?  Glad I read it, but done with Hemingway."}, {"review_sentiment": 4.0, "review_text": "Classic! A great story, with wonderfully written characters, set during the Spanish Civil War."}, {"review_sentiment": 5.0, "review_text": "what's to say.  one of the best writer's ever."}, {"review_sentiment": 5.0, "review_text": "Started reading Hemingway after visiting hie Key West home."}, {"review_sentiment": 1.0, "review_text": "God...was this a disappointment.  I always heard how great Hemmingway's writing was.  It may be simple, but the story was crap. Just does not have much of a plot and it moves really slow.  Must have been a different age."}, {"review_sentiment": 5.0, "review_text": "Great, thank you!"}, {"review_sentiment": 5.0, "review_text": "Great purchase."}, {"review_sentiment": 1.0, "review_text": "Horrible this is abridged and doesn’t say it! Text didn’t make sense."}, {"review_sentiment": 5.0, "review_text": "wonderful"}]}, "authors": ["Ernest Hemingway"], "isbn": "0684803356", "longitude": -3.7035825, "periods": ["1900s"], "title": "For Whom the Bell Tolls", "word_cloud": "good classic personally find way long a many year ago remember like better perhaps shorter stick end copy contain numerous typo seem weird classic find certain thing annoy say time others find review strange use word obscenity instead use curse word quote end enjoy butchery obscenity do great story wonderfully write character set spanish best writer ever start read visit hie home disappointment always hear great write story crap much plot move really slow different age thank great purchase horrible abridge say make sense wonderful", "genres": ["Fiction & Literature", "Spanish Civil War"], "summary": "In 1937 Ernest Hemingway traveled to Spain to cover the civil war there for the North American Newspaper Alliance. Three years later he completed the greatest novel to emerge from \"the good fight,\" For Whom the Bell Tolls.\r\n\r\nThe story of Robert Jordan, a young American in the International Brigades attached to an antifascist guerilla unit in the mountains of Spain, it tells of loyalty and courage, love and defeat, and the tragic death of an ideal. In his portrayal of Jordan's love for the beautiful Maria and his superb account of El Sordo's last stand, in his brilliant travesty of La Pasionaria and his unwillingness to believe in blind faith, Hemingway surpasses his achievement in The Sun Also Rises and A Farewell to Arms to create a work at once rare and beautiful, strong and brutal, compassionate, moving, and wise.\r\n\r\n\"If the function of a writer is to reveal reality,\" Maxwell Perkins wrote Hemingway after reading the manuscript, \"no one ever so completely performed it.\"\r\n\r\nGreater in power, broader in scope, and more intensely emotional than any of the author's previous works, it stands as one of the best war novels of all time.", "asin": "0684803356", "rank": "8147", "city": "Madrid", "image": "https://images-na.ssl-images-amazon.com/images/I/51ITaxhiA8L.jpg", "country": "Spain", "story_arc": ["Tragedy", "Things only get worse"]}