{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 43.7698712, "ratings": {"num_ratings": 162, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "as expected"}, {"review_sentiment": 5.0, "review_text": "After a month of visits to the Uffizi and many memorable walking trips around Florence this summer, I was delighted to follow up with a comprehensive and well written account of the Medici dynasty. Highly recommended to anyone who is interested in more than a cursory understanding of a gripping family story--punctuated by strident leadership, nonstop drama, and the vagaries of fortune."}, {"review_sentiment": 5.0, "review_text": "Great Book!!  Love this Book!!!"}, {"review_sentiment": 4.0, "review_text": "Good history book.  Liked it."}, {"review_sentiment": 4.0, "review_text": "This was a fascinating biography of a family!  It made me want to read more of the great families of the era, and I am super pumped for my Italy visit next year!  I wish the Kindle version could handle the portraits the analog version has.  And I would have liked to have read more about the wives, as well as the family's incredible influence on the art and architecture of the age (it was touched on, but I wanted more)."}, {"review_sentiment": 5.0, "review_text": "I have read only a few books about the Renaissance in Italy; other than Ross King's book about the creation of the Sistine Chapel amid the drama of the late 15th and early 16th Century, a recent biography of Savonarola, and a bunch of art history books, nothing comes to mind. I have been to most of the art museums in Rome and Florence, and other than that, I'm a complete novice when it comes to this stuff.  I knew virtually nothing about the history of the Medici family, and I found this book compelling and easy to follow. If you're looking for a book that tells the story clearly without requiring any background, this is the one. Now I'm going to read his book about the Borgia family. Excellent book!"}, {"review_sentiment": 5.0, "review_text": "hard to keep a family going for 300 years.  at least they lasted longer than any American dynasties will"}, {"review_sentiment": 3.0, "review_text": "The book is well-researched and interesting, but at times I find myself bored. I bought this book after watching Masters of Florence, I wanted to see the real story of the Medicis. I am getting that, but I don't need to know about every artwork, every artist, every sculpture, door, window, abbey, library, that the Medici family supported, built, endowed, etc.I admit I've only read 17% of the book (this is a very long book), and at times I found myself pleased but I also feel the author doesn't care too much about the \"boring\" side of banking. I do like the politics, and this book has plenty of that. Also, I'd like to know why were the Medicis obsessed with Plato and not Aristotle. Aristotle was far superior to Plato."}, {"review_sentiment": 4.0, "review_text": "Its a very good read.  Especially his description of the Pazzi conspiracy was good.  The only negative is that it ends too abruptly without any kind of conclusion.  Really thought provoking with some interesting anecdotes."}, {"review_sentiment": 4.0, "review_text": "Very informative history of this famous family, well written.  Because of the many family members, a family tree would have been helpful."}]}, "authors": ["Christopher Hibbert"], "isbn": "0688053394", "longitude": 11.2555757, "periods": ["1600s", "1700s", "1500s", "500-1400s"], "title": "The House of Medici: Its Rise and Fall", "word_cloud": "expect month visit many memorable walk trip summer delight follow comprehensive well write account dynasty recommend anyone interested cursory understand grip family story punctuate strident leadership nonstop drama vagary fortune good history like fascinating biography family make want great family era super pump visit year wish version portrait analog version wife well family incredible influence art architecture age touch want creation drama late early recent biography bunch art history nothing come mind art museum complete novice come stuff know virtually nothing history family find compel easy follow look tell story clearly require now go family hard family go year least last longer american dynasty interesting time find bored buy watch want see real story get need know artwork artist sculpture door window library family support build endowed admit long time find pleased also feel author much boring side banking like politics plenty also like know obsess far superior good description conspiracy good negative end abruptly kind conclusion think provoke interesting anecdote very informative history famous family well write many family member family tree", "genres": ["History", "Renaissance"], "summary": "At its height Renaissance Florence was a centre of enormous wealth, power and influence. A republican city-state funded by trade and banking, its often bloody political scene was dominated by rich mercantile families, the most famous of which were the Medici. \r\n\r\nThis enthralling book charts the family’s huge influence on the political, economic and cultural history of Florence. Beginning in the early 1430s with the rise of the dynasty under the near-legendary Cosimo de Medici, it moves through their golden era as patrons of some of the most remarkable artists and architects of the Renaissance, to the era of the Medici Popes and Grand Dukes, Florence’s slide into decay and bankruptcy, and the end, in 1737, of the Medici line.", "asin": "0688053394", "rank": "55447", "city": "Florence", "image": "https://images-na.ssl-images-amazon.com/images/I/51j1CzavuYL.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}