{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "This was a great book."}, {"review_sentiment": 5.0, "review_text": "Let me first say that as a second generation Antiguan and Barbudan I'm slightly ashamed that I had to read a book written by an American journalist in order to be this informed about the rich and in some cases illicit history of my (beloved) country.I found this book to be very informative,it was rich in content without becomming tedious to the reader. The author often time had first hand knowledge as to the goings on, scandals and covering ups that took place in the newly independent country. This work was well researched and well detailed as the author included a thorough bibiliography. First rate work by Robert Coram.I hope that other members of the Antiguan public (specifically the voting public) take note of the content of the book and ensure the safety of our economy, our treasury and our name in the international community when it matters."}]}, "authors": ["Robert Coram"], "isbn": "0688115438", "longitude": 0.0, "periods": ["1900s"], "title": "Caribbean Time Bomb: The United States' Complicity in the Corruption of Antigua", "word_cloud": "great first second generation slightly ashamed write american journalist order inform rich case illicit history beloved found informative rich content become tedious author often first hand knowledge going scandal cover ups take place newly independent country work well research well detailed author include thorough bibliography rate work hope member public specifically vote public take note content safety economy treasury name international community matter", "genres": ["History", "Journalism"], "summary": "An investigation into the corrupt government of Antigua discusses the island's blatant violation of environmental laws; its dictator's involvement with crooks, con artists, and drug dealers; and the U.S. role in Antiguan corruption.", "asin": "0688115438", "rank": "507666", "city": "Antigua and Barbuda", "image": "https://images-na.ssl-images-amazon.com/images/I/51rLFYTprnL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}