{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 21.161829, "ratings": {"num_ratings": 48, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "This is *the* thing to read before you tour Mayan ruins. Really tells a story, makes this civilization come alive for you. I'm amazed at what the authors were able to piece together."}, {"review_sentiment": 5.0, "review_text": "Linda Scheme and David Freidel demonstrate through this book how incredibly important it is to understand how much of an impact the Maya have had in American history. Throughout the book, both offers bring to the fore the various means of Maya agency, how they saw themselves, and how they became one of the great civilizations in history. This is a must-read for any historical enthusiast."}, {"review_sentiment": 5.0, "review_text": "very good overview of the culture, easy to understand"}, {"review_sentiment": 5.0, "review_text": "Thanks"}, {"review_sentiment": 5.0, "review_text": "really enjoy the in depth study and examination of the ancient maya. Good for those looking for details and meanings of these sacred sites."}, {"review_sentiment": 5.0, "review_text": "Very nice book and very fast delivery!"}, {"review_sentiment": 5.0, "review_text": "A useful classic!"}, {"review_sentiment": 4.0, "review_text": "Very detailed. I learned a lot about Mayan culture before our trip to Mexico. A little too academic from time to time"}, {"review_sentiment": 5.0, "review_text": "Great book."}, {"review_sentiment": 5.0, "review_text": "Excellent.  Engagingly written and scholarly, yet accessible for someone like me with no background in ancient Maya culture.  Probably the best up-to-date comprehensive overview of the subject."}]}, "authors": ["David Freidel", "Linda Schele"], "isbn": "0688112048", "longitude": -86.82505, "periods": ["Pre Common Era"], "title": "A Forest of Kings: The Untold Story of the Ancient Maya", "word_cloud": "thing tour ruin tell make civilization alive amaze author able piece together demonstrate incredibly important understand much impact american history offer bring fore various mean agency saw become great civilization history historical enthusiast good overview culture easy understand thanks really depth study examination look detail meaning sacred site very nice fast delivery useful classic very detailed learn lot culture trip little academic time time great excellent engagingly write scholarly yet accessible someone background culture best comprehensive overview subject", "genres": ["History", "Ancient Civilizations"], "summary": "The recent interpretation of Maya hieroglyphs has given us the first written history of the New World as it existed before the European invasion. In this book, two of the first central figures in the massive effort to decode the glyphs, Linda Schele and David Freidel, make this history available in all its detail. \r\n\r\nA Forest of Kings is the story of Maya kingship, from the beginning of its institution and the first great pyramid builders two thousand years ago to the decline of Maya civilization and its destruction by the Spanish. Here the great historic rulers of pre-Columbian civilization come to life again with the decipherment of their writing. At its height, Maya civilization flourished under great kings like Shield-Jaguar, who ruled for more than sixty years, expanding his kingdom and building some of the most impressive works of architecture in the ancient world. Long placed on a mist-shrouded pedestal as austere, peaceful stargazers, the Maya elites are now known to have been the rulers of populous, aggressive city-states.\r\n\r\nHailed as \"a Rosetta stone of Maya civilization\" (Brian M. Fagan, author of People of the Earth), A Forest of Kings is \"a must for interested readers,\" says Evon Vogt, professor of anthropology at Harvard University.", "asin": "B00454UBEW", "rank": "241693", "city": "Cancun", "image": "", "country": "Mexico", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}