{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 3, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "A great book on Animal Style Art of Kazakhstan and the research there for the past two decades"}, {"review_sentiment": 5.0, "review_text": "Thank you!"}, {"review_sentiment": 3.0, "review_text": "Nomads and Networks is a very timely book on a subject covered all too rarely by English speaking archaeologists. The essays are mostly very well written, and the photography is quite wonderful for those pieces actually printed full page. There are a number of photos of excavations in progress that are really exceptional as well. There is one major flaw in this book however, and it is a frustrating one: it is not an exhibit catalogue in the normal modern sense of the term. It is a book of illustrated essays with an artifact \"checklist\" in the back section, with tiny thumbnail pictures of the pieces to the side of a brief text.  This format is somewhat irritating, but all in all it's a good book. If you have an interest in the archaeology of Central Asian nomadic cultures, it's a good find, but if you are looking for an art book for the coffee table, look elsewhere."}]}, "authors": null, "isbn": "0691154805", "longitude": 0.0, "periods": ["Pre Common Era"], "title": "Nomads and Networks: The Ancient Art and Culture of Kazakhstan", "word_cloud": "great research past decade thank timely subject cover rarely english speaking archaeologists essay mostly well write photography quite wonderful piece actually print full page number photo excavation progress really exceptional well major flaw however frustrate exhibit catalogue normal modern sense term illustrate essay artifact checklist section tiny thumbnail picture piece side brief text format somewhat irritate good interest archaeology nomadic culture good find look coffee table look elsewhere", "genres": ["History", "Social & Cultural Studies"], "summary": "The catalogue for the groundbreaking exhibition at New York University's Institute for the Study of the Ancient World, Nomads and Networks presents an unparalleled overview of the sophisticated culture of pastoral nomadic populations who lived on the territory of present-day Kazakhstan from roughly the middle of the first millennium BCE to the early centuries CE.\r\n\r\nFocusing on material from the Altai and Tianshan regions, Nomads and Networks explores the specific conditions of mobile lifeways that resulted from particular ecological conditions in the steppes and high valleys of Inner Eurasia. Highlights of the exhibition are grave goods from the burial mounds at the site of Berel and gold mortuary ornaments from Shilikty, Zhalauli, and Kargaly. Attesting to a sophisticated decorative art flourishing among these nomadic populations, the objects skillfully combine older iconographic traditions of animal style in the steppe with more recent influences from foreign cultures--most notably Persia and China.\r\n\r\nContributors include Nursan Alimbai, Nikolay A. Bokovenko, Claudia Chang, Bryan K. Hanks, Sagynbay Myrgabayev, Karen S. Rubinson, Zainolla S. Samashev, Sören Stark, and Abdesh T. Toleubaev.", "asin": "0691154805", "rank": "1476070", "city": "Kazakhstan", "image": "https://images-na.ssl-images-amazon.com/images/I/416iv-qjbCL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}