{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 24, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Comprehensive and useful information. You just can’t resist visiting Galapagos and thinking about preserving these beautiful creatures."}, {"review_sentiment": 4.0, "review_text": "Good overview on what to expect and plan for upcoming travels."}, {"review_sentiment": 5.0, "review_text": "Great book on our coffee table"}, {"review_sentiment": 4.0, "review_text": "Deos The job."}, {"review_sentiment": 5.0, "review_text": "helpful on our trip"}, {"review_sentiment": 5.0, "review_text": "really good guide, covers birds, land animals, marine animals, plants, individual islands, everything you need to know about the Galapagos."}, {"review_sentiment": 5.0, "review_text": "i found this interesting and helpful. i was in the galapagos and used this pocket guide. very easy to carry and look up what i saw.....various other people on the tour would ask to see this on the bus we were on....just a nice, handy helpful guide.....clearly it does not have every creature; but it hit the highlights"}, {"review_sentiment": 5.0, "review_text": "Gave it as a gift and was told it was spot on regarding wildlife in specific locations.  Very handy guide to bring along."}, {"review_sentiment": 4.0, "review_text": "I think that this is a must have book for nature lovers who visit the Galápagos Islands. The two other popular fold-out \" easy-to-carry publications, aren't suitable for the serious observer.  It was a little lacking on picturing some of the common blooming plants, bushes & trees. Otherwise I would give it 5stars for birders. Also it is not available in stores on the Islands. Buy before you leave the U S."}, {"review_sentiment": 5.0, "review_text": "A gift for a friend"}]}, "authors": ["Julian Fitter", "Daniel Fitter", "David Hosking"], "isbn": "0691170428", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Wildlife of the Galápagos", "word_cloud": "useful information resist visit think preserve beautiful creature good overview expect plan upcoming travel coffee table job helpful trip really good guide cover bird land animal marine animal plant individual island everything need know find interesting helpful galapagos use pocket guide easy carry look saw people bus nice handy helpful guide creature hit highlight gift tell spot regard specific location very handy guide bring think lover visit islands popular publication suitable serious little lack picture common blooming plant bush tree otherwise birder also available store islands leave gift friend", "genres": ["Science & Nature", "Guide Books"], "summary": "Second Edition, Princeton Pocket Guides\r\n\r\nSince its first publication more than a decade ago, Wildlife of the Galápagos has become the definitive, classic field guide to the natural splendors of this amazing part of the world. \r\n\r\nNow fully updated, this essential and comprehensive guide has been expanded to include the more than 400 commonly seen birds, mammals, reptiles, invertebrates, and plants, and other coastal and marine life of this wondrous archipelago. Over 650 stunning color photographs, maps, and drawings are accompanied by accessible, descriptive text. \r\n\r\nThis new edition includes information about all the common fish of the region and Spanish names are featured for the first time. There is also a revised section that discusses the islands' history, climate, geology, and conservation, with the most current details on visitor sites.\r\n\r\nThis is the perfect portable companion for all nature enthusiasts interested in the astounding Galápagos.\r\n\r\nCovers 400+ commonly seen species, including birds, mammals, reptiles, invertebrates, and plants, and other coastal and marine life. Illustrated with over 650 color photographs, maps, and drawings. Includes maps of visitor sites. Written by wildlife experts with extensive knowledge of the area. Includes information on the history, climate, geology, and conservation of the islands.\r\n", "asin": "0691170428", "rank": "31081", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/51TvPZymV7L.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}