{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 13, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "Set at the beginning of the 19th century - not so vastly long ago, yet long enough that antiquarians of the time might have Elizabethan documents among their treasures. In this most enjoyable fiction, Ackroyd conflates two true stories: that of Charles and Mary Lamb, academic siblings living a stifling life with their senile father and authorative mother. And William Ireland: employed in his family bookshop and, like Mary, feeling downtrodden by his parent. Until one day he comes into possession of some writings, including unpublished works,by Shakespeare...Although the Lambs and Ireland never actually had any dealings with one another, this makes for a great read that really transports you back to London of that era."}, {"review_sentiment": 5.0, "review_text": "Peter Ackroyd does it again! Brilliant!"}, {"review_sentiment": 5.0, "review_text": "Wonderfully written!  Loved reading about life in 19th century England."}, {"review_sentiment": 4.0, "review_text": "\"The future is as nothing, being everything…The past is everything, being nothing.\"Peter Ackroyd's \"Lambs of London\" is a fictionalized account of the 18th century hoax that 'discovered' lost works of Shakespeare. When a widow discovers that her late husband had a house full of old documents, she allows a young bookseller's son named William Ireland to take inventory and keep anything he deems of value. Inside the treasure trove are dozens of documents belonging to the Bard himself - including several lost plays. When the first play is staged, it is not exactly a success. But while Ireland has several experts who can vouch for the documents' authenticity, others are skeptical. He is, after all, reluctant to name the woman whose home he discovered them in, and is determined to keep other experts away from the documents themselves.Ireland has made friends with a set of siblings, Charles and Mary Lamb, who live with their ailing parents a few blocks from his father's bookstore. Mary, in particular, is enamored with everything Shakespeare, and when popular opinion starts to turn against Ireland and his \"found\" plays, she is determined to support him no matter what. But when the true origin of the plays is determined, it has disastrous results for the Lamb family.Is \"The Lambs of London\" a great literary masterpiece? No. It's interesting, a diversion, a way of looking at the possibilities behind an historic event. I wouldn't recommend buying it unless you're a lover of anything Shakespeare, but it's a nice little read."}, {"review_sentiment": 4.0, "review_text": "Ackroyd is a historical novelist & Shakespearean scholar.  With all the current hoaxes floating around out there of fiction masquerading as memoirs & authors claiming to be who they are not; he has chosen to write a novel about an actual hoax or rather is this a true account of a hoax that did happen or is this a fictional account of a historical hoax which never happened. In any event, in this slim volume of just over 200+ pages, the author humors the readers by showing the intricacies of literary hoaxes & deceits.  Of course, such hoaxes depend on greed.  The same emotion which is needed for scams & hoaxes to work in the present day. Here we have a son hoping to climb out of his father's suffocating shadow.  The son is only 19.  Who in the world would think him capable of falsely writing a long lost & newly discovered Shakespeare play or poem.  Yet, he claims to have found such items.  His willing dupes are his greedy father, a young aspiring journalist, the journalist's homely sister, some inexpert experts, greedy publishers & a willingly gullible public.  Even the reader is taken in, for awhile. The young man, William Ireland, keeps much counsel with himself & finally with Mary Lamb.  Eventually, he lets out too much & soon enough the cat is out of the bag. The hoax is revealed.  Or was it really a hoax to begin with?  Was this a retelling of historical fact or a totally made up hoax?  Maybe, one can Goggle the answer; but leaving it up to the imagination sounds more exciting."}, {"review_sentiment": 1.0, "review_text": "Got to p68 and nearly threw up at the completely out-of-the-blue, unnecessary description of the sexual molestation of an abandoned child. WT??? I'm sick of books that take the terrible, shame-to-all-humanity Catholic Priests' sex scandal and make it into ALL clergy for ALL of history have to molest children. Disgusting, wanton act by an irresponsible author wanting to be very pseduo-PC. RUINED an otherwise fun book. This sort of thing belongs ONLY in memoirs of those who suffered it."}, {"review_sentiment": 3.0, "review_text": "N.B.: FOR ANYONE NOT ALREADY ACQUAINTED WITH THE STORY OF MARY LAMB AND OF WILLIAM IRELAND, THIS REVIEW CONTAINS A SPOILER.In a note at the beginning Peter Ackroyd gives fair warning that `This is not a biography but a work of fiction.  I have invented characters, and changed the life of the Lamb family for the sake of the larger narrative.'  I do not myself object to fictionalized biography so long as it credibly fills in details of speech or incident, does not depart too far from what is known, and does not deliberately contradict what actually happened.  Ackroyd credibly invents speech and the incidents of daily life; but in the depiction of the relationship between Mary Lamb (whose life is well documented) and William Henry Ireland (ditto) he invents a connection for which there is no historical warrant; and in the case of the Shakespearian scholar Edmond Malone and in the dates he gives he runs directly counter to the known facts.  This may not trouble most readers; but it irritated me and considerably reduced my appreciation of what is a well-told tale, with the atmosphere and the literary scene of late 18th century London being knowledgeably conveyed with Ackroyd's usual skill and light touch.The novel gives us a good picture of the principal characters: of Mary Lamb and her brother Charles; of their parents; and of William Ireland and his father Samuel, a bookseller and collector of historical memorabilia.  Mary is very close to Charles; she is at times mentally disturbed, and is driven mad by having to attend on her old father, who has lost his mind and whose talk is completely inconsequential, and on her controlling old mother.Brother and sister are devoted to the works of Shakespeare; and that makes for the invented bond with William Ireland, who claimed to have discovered a hoard of Shakespearian manuscripts, including a hitherto unknown play, `Vortigern'.  He had forged them all;  but he fooled his father, Mary, Edmond Malone (in historical fact it was Malone who exposed the forgeries) and many others into believing in their authenticity.  This is the spoiler referred to at the top of this review.  The reader who does not already know of the forgeries will, when reading this novel, be as taken in by the charm and enthusiasm of William Fielding as were, for a while, so many others.Those readers who already know the dreadful deed Mary Lamb committed will yet be surprised by what Ackroyd produces as the trigger for it. The final chapter contains a few more deliberate conflicts with the historical facts, for no artistic reason that I can make out."}, {"review_sentiment": 4.0, "review_text": "I'm not a scholar of Shakespeare nor historic England, but I found the combination of a book that delved into Shakespeare and life 200 years ago to be an irresistable combination.  In this novel, author PEter Ackroyd takes a true event -- the forgery of some Shakespeare letters, poems, and a play -- and brings the perpetrators and other early 19th-century Shakespearians to life.For me, the most entertaining thing was to try to inhabit the minds of people who literally seemed to have Shakespeare at-hand in their everyday speech and perception.  They could quote him as easily as we'd quote lines from a sitcom or commercial.  And \"they\" were not necessarily scholars and children of nobility.  These were shopkeepers and clerks -- but with ambitions, intelligence, and intensity.  I'd like to think that I would have been able to do so, if I had been raised in that environment, too.The pace of the story never slackens.  We first meet Mary Lamb (an old maid, destined to care for her senile father) and Charles Lamb (her brother, a clerk with the East India company who dreams of glory as a literary critic and essayist). Since childhood, these two have been close, and they have shared a love of language and intellectual conversation.  While Mary is house-bound, due to the restrictions of her era, Charles works and goes drinking with his friends several night a week.  He's found a boisterous, reasonably literate crew of pals, and they respect the small articles he's been able to place in literary publications.  Charles meets -- or rather, is baited by -- William Ireland, an ambitious and possibly genius 17-year-old son of a bookseller.  Ireland begins to share with William and Mary a series of Shakespeare pieces -- a letter, a poem -- that he has forged.  When these are declared by scholars to be genuine, William presents his greatest forgery: an entire play.  The play is produced, and it's met with derision and closes in six nights, as, perhaps, the public senses that it's not really Shakespeare.  The forgeries unravel, and lives unravel.  Ironically, William did it to impress his father and to test his literary skills, but not for glory or money (which are the reasons his father pursued the verification to its ultimate failure).The author does a deft job of sketching scenes and then leaving them before you get everything you want.  You want to hear more from Charles' cronies, who are witty and foolish at the same time.  You want the mini-play that Charles tries to produce to be done more than once (in front a inmates in an asylum).  You want Mary and William to fall in love and read plays and poetry together for 40 years.  You want Charles to achieve his ambition as a literary critic.  And so on.The only clunker in this book is a two-page visit that William and his father make to a pair of clerics who are Shakespeare scholars, and who become crucial to the deception because they are pleased that the newly found works \"prove\" that Shakespeare was not a secret Catholic.  Those clerics are described as owning a black foundling boy, a former slave, who they molest every night.  It's a dumb, unnecessary detail -- as neither the clerics nor the boy appear again in the book.  So why does the author go out of his way to make those insults?"}, {"review_sentiment": 1.0, "review_text": "I didn't care for this book at all.  Too speculative, and the characters were not especially likable."}, {"review_sentiment": 4.0, "review_text": "In the enthralling (literary fiction) historical novel, The Lambs of London, scribed by renowned British novelist and biographer Peter Ackroyd, the author hooks his readers on the discovery of a new dramatic script that might have been William Shakespeare's unknown literary treasure.Set in London of the Romantic Period (late eighteenth/early nineteenth century), the novel gives a fictitious account of how Charles and Mary Lamb make acquaintance with a young bookseller who claims to have found Shakespeare's yet unknown work. The enthusiasm and skepticism that follow make this story a captivating read.The author tells you upfront that the situations are purely fictitious. The real historical figures like the Lambs, Thomas de Quincey, and R.B. Sheridan only support the ambience of the literary environment of London at the time of the novel's events. However, the incorporation of these characters provides solid grounds for performing this literary march in which the name of Shakespeare leads the lives of its followers.As the plot unfolds through the forays of William Ireland into Shakespeare's world, readers get a chance to take a close look at London life that is blanketed by ennui and unanimity at large. For the middle-class literary figures and businessmen dealing in books, Shakespeare's name signifies a boom that would shake people out of their dormancy. Whether it is turns out to their good or ruin is the point illustrated so cogently in the book's ending.Peter Ackroyd proves to be skilled at `showing' instead of `telling' about a historical situation. As manifest in The Lambs of London, he shows how history can be created and made credible. However, the title of his novel calls critical thought to questioning of its relevance. William Ireland remains the dominant character in the story and precedes the Lambs in both attention and character development. The book's ending, though, makes it a story of the Lambs for a moment.Armchair Interviews says: Ackroyd's novel is definitely a memorable creation for lovers of literary fiction."}]}, "authors": ["Peter Ackroyd"], "isbn": "0701177446", "longitude": -0.12574, "periods": ["1700s"], "title": "The Lambs of London", "word_cloud": "begin century vastly long ago yet long enough antiquarian time document treasure enjoyable fiction conflate true story academic sibling live stifle life senile father authoritative mother employ family bookshop feel downtrodden parent day come possession writing include unpublished work never actually deal make great really transport era wonderfully write read life century future nothing everything nothing fictionalize account century hoax lose work widow discovers late husband house full old document allow young bookseller son name inventory anything deem value treasure trove dozens document belong include several lose play first play stag exactly success several expert vouch document authenticity others skeptical reluctant name woman home discover determined keep expert away document make friend set sibling live ail parent block father bookstore particular enamor everything popular opinion start turn find play determine support matter true origin play determine disastrous result lamb great literary masterpiece interest diversion way look possibility historic event buy lover anything nice little historical novelist scholar current hoax float fiction masquerade memoir author claim choose write actual hoax rather true account hoax happen fictional account historical hoax never happen event slim volume page author humor reader show intricacy literary hoax deceit course hoax depend greed emotion need scam hoax work present day here son hop climb father suffocate shadow son world capable falsely write long lose newly discover play poem claim find item willing dupe greedy father young aspire journalist journalist homely sister inexpert expert greedy publisher willingly gullible public even take young man keep much counsel finally let much soon enough cat hoax reveal really hoax begin retell historical fact totally make hoax answer leave imagination sound excite nearly throw completely unnecessary description sexual molestation abandon child sick terrible sex scandal make clergy history molest child disgust wanton act irresponsible author want otherwise fun sort thing belong memoir suffer note begin give fair warn biography work fiction invent character change life family sake larger narrative object fictionalized biography long credibly fill detail speech incident depart far know deliberately contradict actually happen credibly invent speech incident daily life depiction relationship life well document ditto invents connection historical warrant case scholar date give run directly counter know fact trouble reader irritate considerably reduce appreciation tale atmosphere literary scene late century knowledgeably convey usual skill light give good picture principal character brother parent father bookseller collector historical memorabilia close time mentally disturb driven mad attend old father lose mind talk completely inconsequential control old sister devote work make invent bond claim discover hoard shakespearean manuscript include hitherto unknown play forge fool father historical fact expose forgery many others believe authenticity spoiler refer top review already know forgery read take charm enthusiasm many reader already know dreadful deed commit yet surprise produce trigger final chapter contains deliberate conflict historical fact artistic reason make scholar historic find combination delve life year ago irresistible combination author take true event forgery letter poems play brings perpetrator early entertain thing try inhabit mind people literally seem everyday speech perception easily quote line sitcom commercial necessarily scholar child shopkeeper clerk ambition intelligence intensity think able raise environment pace story never slacken first old maid destine care senile father brother clerk company dream glory literary critic essayist childhood close share love language intellectual conversation due restriction era work go drink friend several night week find boisterous reasonably literate crew pal respect small article able place literary publication meet rather bait ambitious possibly genius son bookseller begin share series piece letter poem forge declared scholar genuine present greatest forgery entire play play produce meet derision close night perhaps public sens really forgery unravel life unravel impress father test literary skill glory money reason father pursue verification ultimate failure author deft job sketch scene leave get everything want want hear crony witty foolish time want try produce do front inmate asylum want mary fall love play poetry together year want achieve ambition literary critic clunker visit father make pair cleric scholars become crucial deception please newly find work secret cleric describe own black foundling boy former slave molest night dumb unnecessary detail cleric boy appear so author go way make insult care speculative character especially likable enthral literary fiction historical scribe renowned british novelist biographer author hook reader discovery new dramatic script unknown literary romantic late nineteenth century give fictitious account make acquaintance young bookseller claim find yet unknown work enthusiasm skepticism follow make story captivate author tell upfront situation purely fictitious real historical figure support ambiance literary environment time event however incorporation character provide solid ground perform literary march name lead live plot unfolds foray world reader get chance take close look life blanket ennui unanimity large literary figure businessmen deal name signifies boom people dormancy turn good ruin point illustrate cogently prove skilled instead historical situation manifest show history create make credible however title call critical thought question relevance remain dominant character story precedes attention character development end make story say definitely memorable creation lover literary fiction", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Mary Lamb is confined by the restrictions of domesticity: her father is losing his mind, her mother watchful and hostile. The great solace of her life is her brother Charles, an aspiring writer. It is no surprise when Mary falls for the bookseller’s son, antiquarian William Ireland, from whom Charles has purchased a book. But this is no ordinary book — it once belonged to William Shakespeare himself. And William Ireland with his green eyes and red hair is no ordinary young man.\r\n\r\nIn The Lambs of London, Peter Ackroyd brilliantly creates an urban world of scholars and entrepreneurs, a world in which a clever son will stop at nothing to impress his showman father, and no one knows quite what to believe. Ingenious and vividly alive, The Lambs of London is a poignant, gripping novel of betrayal and deceit.", "asin": "0701177446", "rank": "11121843", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51xr3-pkQeL.jpg", "country": "England", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}