{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": -27.4689682, "ratings": {"num_ratings": 1, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "I first read 'Pig City' seven or eight years ago, before a career in journalism had revealed itself as a path of interest. In hindsight, perhaps reading this book was one of the beacons that pointed me in that direction, as Andrew Stafford's command of language and storytelling abilities are both enviable and inspiring. His task here is an ambitious one: to chart three decades of Brisbane's musical and cultural history in the context of its political machinations. Stylistically, it's written as a narrative with occasional passages of oral history, where Stafford blocks out key quotes from artists and individuals. This is an intelligent editorial decision and it helps to drive the reader's interest and engagement: rather than relying on the narrator's reconstruction of events, we're instead shown history through the eyes of those who were there.This is the tenth anniversary edition of the book, published earlier this year, and Stafford's new author note in the opening pages makes for eerie reading in light of Queensland's recent political history. \"'Pig City' was also meant as a triumphant, culture-driven coming-of-age story – we weren't supposed to be back here,\" Stafford writes. Certainly, reading accounts of the state's quasi-fascist regime under Joh Bjelke-Petersen's conservative government decades ago draws modern political decisions into sharp focus. History is not kind to Joh, and I don't think that Queenslanders will look back fondly on the current conservative reign, either. The genius of 'Pig City', however, is that by giving equal airtime to music and politics, Stafford is able to educate readers in two fields that don't often overlap. The book is a true classic; a must-read for anyone who calls Queensland home, or has designs on doing so."}]}, "authors": ["Andrew Stafford"], "isbn": "0702253332", "longitude": 153.0234991, "periods": ["1900s", "Recent Releases"], "title": "Pig City: From the Saints to Savage Garden", "word_cloud": "first year ago career journalism reveal path interest hindsight perhaps read beacon point direction command language storytelling ability enviable inspire task ambitious chart decade musical cultural history context political machination stylistically write narrative occasional passage oral history block key quote artists individual intelligent editorial decision help drive interest engagement rather rely narrator reconstruction event instead show history eye tenth anniversary edition publish earlier year new author note opening page make eerie read light recent political history also mean triumphant story suppose back write read account state regime conservative government decade draw modern political decision sharp focus kind think queen slanders look back fondly current conservative reign genius however give equal airtime music politics able educate reader field often overlap true classic anyone call home design", "genres": ["History", "Politics", "Music"], "summary": "From cult heroes the Saints and the Go-Betweens to national icons Powderfinger and international stars Savage Garden, Brisbane has produced more than its share of great bands. But behind the music lay a ghost city of malice and corruption. Pressed under the thumb of the Bjelke-Petersen government and its toughest enforcers—the police—Brisbane’s musicians, radio announcers, and political activists braved ignorance, harassment, and often violence to be heard. This updated, 10th anniversary edition features a scathing new introduction by the author, assessing the changing shape of Brisbane, its music, and troubling developments since the return of the state of Queensland to conservative governance.", "asin": "0702253332", "rank": "4660096", "city": "Brisbane", "image": "https://images-na.ssl-images-amazon.com/images/I/512j2O8GcYL.jpg", "country": "Australia", "story_arc": ["Tragedy", "Things only get worse"]}