{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 13, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Took me a few chapters to get into the world of these characters and their rhythms but once I did I loved it and was really pulled along by the compelling story, the snappy dialogue and humour. (It also helped when I found the glossary of Aboriginal words sprinkled throughout at the back.) So much to admire in this and it feels like being invited in on a special journey. It's so challenging to write a novel that engages actively with complex and important political issues - such as Native Title, care of the land, cultural differences, the continuing legacy and impact of the invasion, what non-indigenous people can receive, learn and contribute, etc etc. Melissa Lucashenko handles it all with amazing skill and heart and a light deft touch. Recommended."}, {"review_sentiment": 3.0, "review_text": "Really enjoyed the writing for most of the novel, the last few chapters tended to be too drawn out."}, {"review_sentiment": 3.0, "review_text": "Single mother, Jo Breen, doesn’t have an easy life, especially not after purchasing a farm through her divorce settlement. The farm’s rundown, her moody thirteen-year-old daughter is less than cooperative, and maintaining the grounds at a local cemetery doesn’t pay the bills. But Jo’s proud of her land, her Aboriginal heritage, and she plans to make something of it and her life. The appearance of a good-looking man named TwoBoy Johnson, who’s battling for Native Title rights, adds both excitement and frustration for Jo. Meanwhile, unsettling signs and strange voices from the land itself make Jo question her connection to the past and her future as the stakes for all of them might be higher than she thought.There’s a lot to like about this award-winning novel. The characters’ voices are strong, their beliefs, choices, and conflicts are well portrayed.  The descriptions of the land are so detailed defined that I felt as if I was there. Thankfully, a glossary of terms at the back of the book helped with the jargon, although not all of the words were there, so I had to guess at some.I didn’t like the way the story lagged in places, though. There’d be moments of tension or conflict or even tragedy, then things would calm down for many pages of not much happening. Jo’s lifestyle is such that she spends a lot of time alone, which makes much of the book an inner monologue narrative. This isn’t a bad thing, but rather too much of a good thing. Although I learned a lot from this book, I didn’t find it as engaging as I’d hoped it would be."}, {"review_sentiment": 5.0, "review_text": "Interesting and original characters, absorbing plot, significant issues and written in fresh, gutsy language that reflects a refreshingly different and important world view."}, {"review_sentiment": 4.0, "review_text": "The main character rang true.  I knew her and all her mates.  Wonderful to read the languages and English written as it is spoken.  Greta story and I loved the ending."}, {"review_sentiment": 5.0, "review_text": "Excellent product"}, {"review_sentiment": 1.0, "review_text": "I didn't like it. I found the characters unappealing and their motivatin difficult to understand"}, {"review_sentiment": 4.0, "review_text": "Took me a while, but I got there in the end. I had read a few reviews of this book and wondered what to expect. At first I found it very convoluted and confusing, after finishing it I wondered why it took me so long to get into the rhythm of the book. I had to reread the first few chapters a couple of time and then it rolled along nicely for me. The language and lingo I just had to set aside and to accept what I thought the meanings were and that helped. I got to enjoy the Characters more and more as the book developed. By the time I had closed the book for the last time I was truly engaged and that surprised me as it had taken so long to get into it and initally I found the Characters abrasive. At the end of the book I loved them all, well mostly all. A very good read."}, {"review_sentiment": 1.0, "review_text": "Not my most favourite novel."}, {"review_sentiment": 3.0, "review_text": "Nice story and makes you more aware of the aboriginal loving of the land and their feeling of \"family\"."}]}, "authors": ["Melissa Lucashenko"], "isbn": "0702239194", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Mullumbimby", "word_cloud": "took chapter get world character rhythms love really pull compel story snappy dialogue humor also help find glossary word sprinkle back so much admire feel invite special journey challenge write engages actively complex important political issue care land cultural difference continue legacy impact invasion people receive learn contribute handle amaze skill heart light deft touch recommend really enjoy write last chapter tend drawn mother easy life especially purchase farm divorce settlement farm rundown moody daughter le cooperative maintain ground local cemetery pay bill proud land heritage plan make something life appearance man name battle right add excitement frustration meanwhile unsettle sign strange voice land question connection future stake higher lot character voice strong belief choice conflict well description land detail define felt glossary term back help jargon word guess way story lag place moment tension conflict even tragedy thing many page much happen lifestyle spends lot time alone make much inner monologue narrative bad thing rather much good thing learn lot find engage hop interest original character absorb plot significant issue write fresh gutsy language reflect refreshingly different important world view main character rang true know mate languages write spoken story love end excellent product like find character unappealing motivation difficult understand took get end review wondered expect first find convolute confuse finish wonder take long get rhythm reread first chapter couple time roll along nicely language lingo set aside think meaning help get enjoy develop time close last time truly engage surprised take long initially find abrasive end love well mostly good not story make aware aboriginal loving land feel family", "genres": ["Fiction & Literature"], "summary": "When Jo Breen uses her divorce settlement to buy a neglected property in the Byron Bay hinterland, she is hoping for a tree change, and a blossoming connection to the land of her Aboriginal ancestors. What she discovers instead is sharp dissent from her teenage daughter, trouble brewing from unimpressed white neighbors, and a looming Native Title war between the local Bundjalung families. \r\n\r\nWhen Jo unexpectedly finds love on one side of the Native Title divide she quickly learns that living on country is only part of the recipe for the Good Life. \r\n\r\nTold with dark humor and a sharp, satirical eye, Mullumbimby is a modern novel about romantic love and cultural warfare set against an ancient land.\r\n\r\nLucashenko's first book Steam Pigs won the l998 Dobbie Award for Women’s Fiction and was shortlisted for the l999 New South Wales Premier’s fiction award.", "asin": "0702239194", "rank": "2568543", "city": "Byron Bay", "image": "https://images-na.ssl-images-amazon.com/images/I/41CgUKYmsJL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}