{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 17, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "I never tire of looking at the beautifully composed images. It's a stunning testament to one of my favorite cities."}, {"review_sentiment": 5.0, "review_text": "A WONDERFUL book.  Beautiful photographs, fascinating text, and a very interesting potpourri of buildings that most people never see the inside of.  Most were new to me, and I have both lived in London and visited every year for probably 40 years.  This is a must have if you're interested in architecture, interior design, London, 19th and 20th century history, the list goes on.  Buy it!"}, {"review_sentiment": 5.0, "review_text": "We have made several visits to London and the pictures in this book are a great addition to our knowledge about the city."}, {"review_sentiment": 5.0, "review_text": "Superb book. My aunt loved the photos and accompanying text. It reminded her of the happy times she spent in London and gave her new insights into this historical city."}, {"review_sentiment": 4.0, "review_text": "Extremely gorgeous book with a great level of detail. Beautiful photography and a truly original premise."}, {"review_sentiment": 5.0, "review_text": "Peter Dazeley and Mark Daly's UNSEEN LONDON should be catnip for lovers of the 'Good Old City.' Filled with marvelous photographs of interiors of various London landmarks, it's a wonderful, appealing photo-guide to over 50 architectural treasures found in that city.A  2014 Frances Lincoln Ltd Publishers release, UNSEEN LONDON tops off at 304 pages. Cleverly arranged into subjects entitled 'Hidden Levers,' 'Law and Order,' 'Body and Soul' and 'The Square Mile,' the book spotlights sites such as Tower Bridge, Alexandra Palace, the Daily Express Building, Drury Lane's Theatre Royal, the formerly top-secret 'Paddock Bunker,' Thames Barrier, Big Ben, Henry VIII's wine cellar, Chelsea's Royal Hospital, BBC Television Centre, Queen's Club, Freemasons' Hall, Midland Bank, AIR Studios, HM Prison Wandsworth, Horse Guards and Hyde Park Barracks, Kidderpore Reservoir, Whitechapel Bell Foundry, London Palladium and so on. Each site rates a two- to eight-page write-up with  nicely-done color photographs and descriptive text by Daly.UNSEEN LONDON makes for a fascinating travel guide. What wandering tourist hasn't passed 10 Downing Street and wondered what lay behind that imposing door? Or the Abbey Road Studios or the Old Bailey? You can leaf through it page-by-page or just jump in at any random spot and find some fascinating history to read about and gaze upon. I really enjoyed this book! Highly recommended. Palladium, etc."}, {"review_sentiment": 5.0, "review_text": "Having had the pleasure of working together with Peter Dazeley on this excellent book which brings together some of the best kept secrets in London. I was constantly wowed with how little I \"really\" knew London.  Dazeleys stunning photographs capture the amazing real detail of some exquisite and lost locations and interiors. The accompanying text covers in fascinating detail the history of each of the locations, and the conservation of these can now be enjoyed in the richness of the images in this book. This would make an exceptional gift for anyone who `Loves London'."}, {"review_sentiment": 5.0, "review_text": "Stunning photos and great stories about the most fantastic city in the world. Peter Dazeley's photographically tribute to his hometown is breathtaking."}, {"review_sentiment": 5.0, "review_text": "I am going to enjoy this book for a long time.  The photography is beautiful."}, {"review_sentiment": 5.0, "review_text": "This was a Christmas present for my wife, a HUGE Anglophile.  It is a wonderful book - great photographs of places not normally seen when touring London.  Beautifully photographed and with an informative (but not intrusive) text, I'd recommend it for anyone who has enjoyed London."}]}, "authors": ["Mark Daly"], "isbn": "071123907X", "longitude": -0.12574, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Unseen London", "word_cloud": "never tire look beautifully compose image stun testament favorite city photograph fascinate text interesting potpourri building people never see inside most new live visit year probably year interested architecture interior design century history list go make several visit picture great addition knowledge city aunt love photo accompany text remind happy time spent give new insight historical city extremely gorgeous great level detail photography truly original premise catnip lover marvelous photograph interior various landmark wonderful appeal architectural treasure find france release top page cleverly arrange subject entitle lever spotlight sit formerly wine cellar site rate color photograph descriptive text make fascinate wander tourist pass wonder lay impose door leaf jump random spot find fascinating history gaze really enjoy recommend etc have pleasure work together excellent bring together best kept secret constantly wow little really know stun photograph capture amaze real detail exquisite lose location interior accompany text cover fascinate detail history location conservation enjoy richness image exceptional gift anyone stun photo great story fantastic city world photographically tribute hometown breathtaking go enjoy long time photography beautiful present wife wonderful great photograph place normally see tour photograph informative intrusive text recommend anyone enjoy", "genres": ["Art & Architecture", "History", "Urbanism", "Photography"], "summary": "From Tower Bridge to Battersea Power Station, Big Ben to the Old Bailey, embark on a thrilling tour of the hidden interiors of some of London's most iconic buildings. \r\n\r\nCelebrated photographer Peter Dazeley takes you deep into the boiler room of the city's infrastructure, into the changing rooms of our greatest temples of sport, into the heart of the Establishment, and behind the scenes at the most opulent buildings in the Square Mile. Photographs of these extraordinary buildings – some derelict, but many still working – are accompanied by the story of how each of these places was created, how they are used, and what they reveal about the currents of power flowing through the city. \r\n\r\nSee a glimpse of London behind closed doors with this unique guide to the city's buildings, revised and updated for 2017 to include the royal palaces of Hampton Court, the Tower of London and the Inigo Jones Banqueting Hall at Palace of Whitehall, and the Royal Courts of Justice, Supreme Court and Bow Street Magistrates Court.", "asin": "071123907X", "rank": "265688", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/615LqysfK6L.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}