{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 14, "rating": 4.9, "reviews": [{"review_sentiment": 5.0, "review_text": "haven't read it yet..saw the documentary though and that was fascinating.."}, {"review_sentiment": 5.0, "review_text": "I really really liked it.  It was recommended by someone whose opinion I trusted."}, {"review_sentiment": 5.0, "review_text": "A strange and somewhat mystical adventure comes to light...interesting true story...well written"}, {"review_sentiment": 5.0, "review_text": "By the time you arrive at page 72, you'd better fasten your seat belts for a bumpy ride. I've read thousands of True Crime books and Bios and very few were as gripping and fascinating as this book, only about 200 pages. The personalities are evocative of people you have known in your life, I'm sure. There are even those on our national scene who are reminiscent of the type of individuals who are born with the innate ability to suck all of the oxygen out of a room, a city, a people -- a nation even."}, {"review_sentiment": 5.0, "review_text": "Going to the Galapagos? Been there? You need to read this crazy story!!!"}, {"review_sentiment": 5.0, "review_text": "As one raised in Galapagos, when I heard that Treherne had written this book, I was skeptical...after all..we islanders knew the story and many before him had tried to unwind the tangled tale of intrigue and failed.  After reading the book and becoming his friend, I had to climb down off my high horse.  The author writes with  compassion, wit and understanding of human strength, frailty, mental instability and (for an \"outsider\") shows remarkable insight into  the struggles early settlers faced before the world discovered our thorny paradise.  Well done John, you are sadly missed.  Johanna Angermeyer  author  of  My Father's Island"}, {"review_sentiment": 5.0, "review_text": "I have the original hardback copy of this book and it is an excellent recounting of Dore Strauch's original memoir, and adds quite a bit of scholarly research as well. Reading this book along with the recently republished \"Satan Came To Eden (available now on Amazon in print and kindle) is a real treat, because you get to view the story from many angles. It's a juicy tale and Traherne makes it even more compelling. He didn't solve the \"mystery\" but he certainly spared no effort to dig as deeply as he could into it.Unfortunately, just as Satan Came To Eden comes into print, this book goes OUT of print---darn! We'll have to try and do something about that.Satan Came to Eden: A Survivor's Account of the \"Galapagos Affair\""}, {"review_sentiment": 4.0, "review_text": "Just came back from the Galapagos Islands so it was very interesting knowing the places mentioned in the book. I wish I had read it before going. It is an intriguing and true story."}, {"review_sentiment": 5.0, "review_text": "love this book, true story and well-researched , anyone who has been to the Galapagos or is planning to go should definitely read this book"}, {"review_sentiment": 5.0, "review_text": "We were going to the Galapagos and wanted the dirt on this murder.  It was a great book demanding my attention during the entire book. It does not tell you who actually did it.  When we visited the island it comes alive because of this book."}]}, "authors": ["John Treherne"], "isbn": "0712668233", "longitude": 0.0, "periods": ["1900s"], "title": "The Galapagos Affair", "word_cloud": "documentary really really like recommend someone opinion trust strange somewhat mystical adventure come light interest true story well write time arrive page better fasten seat belt ride thousand true grip fascinate page personality evocative people know life sure even national scene reminiscent type individual bear innate ability suck oxygen room city people nation even go need crazy story raise hear write skeptical islander know story many try unwind tangled tale intrigue fail read become friend climb high horse author write compassion wit understand human strength frailty mental instability outsider show remarkable insight struggle early settler face world discover thorny paradise well do sadly miss author original hardback copy excellent recount original memoir add quite bit scholarly research well along recently republish available print kindle real treat get view story many angle juicy tale make even compel mystery certainly spar effort dig deeply come print go print try something just come back interest know place mention wish go intrigue true story true story anyone planning go definitely go want dirt murder great demand attention entire tell actually visited island come alive", "genres": ["Travel Writing", "True Crime"], "summary": "Over half-a-century ago fanciful and exotic stories began to appear in the world's press about settlers on the remote Galapagos island of Floreana. The tales were of nudism, free love communes, stainless steel dentures - a latter-day Garden of Eden. \r\n\r\nBut the truth was even stranger. Friedrich Ritter, an eccentric German intellectual, and his long-suffering companion Dora Strauch, were the first arrivals. Once established, they were soon joined by others. Most bizarre and dangerous was the self-styled Baroness Wagner-Bosquet. She ruled her three young male lovers with a riding crop, a pearl-handled revolver and insatiable sexual demands - terrorising other settlers. Her mysterious disappearance and the discovery of unidentified bodies on a nearby island perplexed the world. Now The Galapagos Affair unravels the whole incredible story.", "asin": "0712668233", "rank": "532758", "city": "Galápagos Islands", "image": "https://images-na.ssl-images-amazon.com/images/I/517Xkj8uv6L.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}