{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 5, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "Rhyll McMaster knows how to rivet her readers' attention. The opening scene in Feather Man depicts Sooky, the pre-adolescent protagonist, being molested by Lionel, the creepy pedophile next door. It's no accident that this is our introduction to Sooky, because it's this abuse that shapes Sooky's entire story - her adult behavior, her relationships with men, her sense of self-worth.The story is narrated by Sooky, looking back on her childhood in dusty suburban Brisbane, where she is neglected by disinterested parents and pawned off on Lionel (dubbed \"Feather Man\" by the girl because of his brood of hens), an elderly neighbor with a bedridden wife. Despite feeling ashamed of the sexual abuse, she also craves his attention because it is the only time she is made to feel special. Her mother is a stereotypical shrill harridan and her father, whom she dotes on, is a vaguely disinterested adulterer.As Sooky matures, McMaster gives the reader glimpses into the great divide between how she views herself and how the world perceives her. As a young adult, she becomes a rather prolific artist and begins to find modest success. But she doesn't seem to express any particular passion for her art and then blithely abandons it for marriage to a rival artist - Lionel's equally creepy son Redmond. And yet her work, which is described in detail, sounds arresting and unique. Outwardly, Sooky, like her artwork, displays the brash bravado of a rebel, but inside she isn't particularly impressed with herself, frequently deferring to the whims of the mediocre men in her life. In her own mind, she is secondary to them, so much so that even in her own life story the chapters are entitled Lionel, Peter, Redmond and Paul.I found this one a tough go in parts. The main character has an almost laissez faire attitude about her own best interests; there is little rage or self-pity and, for a reader, it feels a bit maddening. Yet there's enough oddball humor to keep the proceedings afloat. One particularly memorable scene involves Sooky inadvertently lighting her veil on fire at her wedding reception, causing a sensation and landing her in the paper - only to be met with outrage by her husband for upstaging him, no less.McMaster is a wonderful writer. She evokes a very tangible sense of place - from the stifling backwater of Brisbane to the grotty bohemia of the London art world. Plus all of the secondary characters are nuanced and believable. But Sooky is certainly her masterwork. In her, McMaster has created a difficult, contradictory, infuriating, funny and admirable protagonist. Truly one of most believable characters I've come across in fiction."}, {"review_sentiment": 4.0, "review_text": "This is the story of a girl nicknamed Sooky.  While readers can work out her real name, it isn't actually used in the text until nearly the end of the book.  This use of a nickname is in many ways the key to the story.Who is Sooky?Sooky is largely defined through a series of relationships.  Growing up in the suburban Brisbane of the 1950s, her childhood is defined by an abusive relationship with a male neighbour, her hero worship of his son and a sense of alienation as her parents reject each other and Sooky herself. Sooky's sense of self is battered and wounded by the time she travels to London in the 1970s.  Sooky makes some questionable decisions and at times exhibits appalling judgement.  Yet it is difficult not to feel at least some sympathy for her as she strives to find her own way in a world that has not generally been supportive and where many seek to stifle her individuality.`It is always a mistake to show your throat to the snarling teeth.'Rhyll McMaster is an accomplished poet.  This is her first novel and while the world it creates is a dark place, it is full of evocative imagery and humour.  It is not a light read but it is a rewarding one. Those of us, who grew up in the 1950s and 1960s (especially in suburban Australia) will recognise many of the descriptions of household life.Jennifer Cameron-Smith"}, {"review_sentiment": 4.0, "review_text": "Feather Man, by Rhyll McMaster, is the coming of age story of Sooky, an only child who lives in Brisbane, Australia with parents who seem to be too distracted with fighting their own demons - and each other - to pay much attention to Sooky.  Her parents are inattentive and generally impatient and as a result, she spends a lot of time with the new neighbor, Lionel.  A strange, unhealthy relationship develops between Sooky and the elderly Lionel.  Despite the fact that her mother encourages her to spend time with Lionel and his wife, Sooky eventually pretty much ceases contact with them.Sooky's parents divorce, leaving her mother bitter and disillusioned and her father unavailable when he moves away to live with another woman.  In high school, Sooky becomes increasingly interested in painting, and a true creative talent emerges.  Whether it is because of her unhealthy relationship with her parents, or what happened with Lionel, or some combination of both, Sooky seems to drift through life in a fog of emotional disquiet and unhappiness.  She has trouble forming healthy relationships.Sooky eventually falls in love with Lionel's son, Redmond and follows him to London.  By now it is the 1970's.  Her relationship with Redmond plays out against the backdrop of the London art scene.  He does not treat her well and Sooky struggles to keep a balance between placating the demanding man she thinks she loves, and pursuing the only thing that has ever made her truly happy - her art.McMaster is an amazing writer.  Her prose is pitch-perfect - in the whole of this book, there is not an extraneous word.  This story has a very substantial feel, due primarily to McMaster's painstaking character development.  From the first page, the reader is truly inside Sooky's head, and comes to know her intimately.  I wanted so badly for everything to turn out well for her, for her to overcome her past, to be happy.Despite the fact that Sooky disliked her mother quite intensely, I found her to be somehow endearing.  Yes, her mothering skills were somewhat lacking, she was distant, negative, even harsh.  I felt that much of her personality was attributable to the times - it was the 1950's and there wasn't much a woman could do if she found herself in a bad marriage, except grumble and complain.  I must say, much of the grumbling and complaining was downright hilarious.Sooky reviled everything about her mother, to a fault; at times it seemed extreme and unwarranted.  I wanted her to set aside her resentment toward her mother, and see that under that harsh veneer was a woman who cared about her and could have been Sooky's ally in a lonely world.This is not a light or particularly fast-paced read.  But if you're looking for a book with real substance and excellent character development I think you'll enjoy this.  If you liked Behind the Scenes at the Museum, by Kate Atkinson, I'm sure you'll like Feather Man - the novels feel very similar.  They are both coming of age stories featuring complex main characters and a strong focus on the complexities and significance of the mother-daughter relationship."}, {"review_sentiment": 4.0, "review_text": "Feather Man, by Rhyll McMaster, is a classic coming of age story.  The narrator of the story is Sooky, an only child who lives in Brisbane, Australia.  As a child, she is ignored by her parents, and sexually abused by the old man next door.  She grows up yearning for someone to love and value her.  Repeatedly, she turns to the people who abuse her, hoping that if she is good enough, they will love her.  She keeps fighting for strength to overcome her demons and her past abuse.  Because of her difficult childhood, Sooky struggles in her adult relationships with men.  They are self-destructive and abusive.  She eventually finds art and painting a solace.Rhyll McMaster is an amazing writer.  The character of Sooky is someone with whom we can all identify with.  We not only feel her pain but also her emotional detachment, which is a result of her past abuse.  There is much for discussion here, especially with the compexities of the father-daughter relationship.  The ending of Feather Man would also allow for a wonderful book club debate.  This is not a light or particularly fast-paced read.  But, if you're looking for a book with real substance and excellent character development, I think you'll enjoy Feather Man."}, {"review_sentiment": 4.0, "review_text": "Rhyll McMaster's first novel is the turbulent coming of age story of Sooky, a young girl who lives in Brisbane, Australia at the start of her narration. Not long into the novel, she recounts an instance of sexual abuse at the hands of her adult neighbor, family friend, and amateur chicken farmer, Lionel, which sets the tone for the types of unhealthy and abusive relationships she will encounter throughout her life. Sooky's quarrelsome parents are blind to the instances of abuse, and as their interaction with their daughter increasingly consists of ignoring or berating her, Lionel's abuse morphs into welcome attention in the young girl's mind. When Sooky intimates that she \"suffered people-burnout at an early age,\" it is not difficult to see why.As she matures and eventually relocates to England in hopes of becoming a professional artist, Sooky struggles in nearly all of her relationships, particularly those that include men. Although she is often the victim in such relationships, Sooky's sympathetic situation does not absolve her from perpetuating unhealthy alliances. She comes to believe that \"simple pleasures are for inferior people,\" and seems determined to break ties with any benevolent figure in her life. After encountering no shortage of narcissistic, manipulative characters, Sooky herself has acquired these traits and manages to shun seemingly successful relationships while pining over Lionel's equally troublesome son, Redmond.Although Sooky is plagued by an inordinate number of volatile, abusive situations, McMaster imbues the novel with a dry humor that can induce actual laughter despite the largely bleak subject matter. It is occasionally difficult to sympathize with Sooky, and her decisions can be frustrating, but she is an intelligent, reflective character who is self-deprecating and witty. While she may be guilty of some of the behavior she abhors in others, Sooky's actions are often a painful reminder of the abuse she endured. Early in the story, McMaster writes that Lionel robbed Sooky of the \"mundane, unexamined happiness of ordinary life,\" and despite her faults, one hopes that Sooky, having mastered the art of examining her life, finds some inkling of happiness even when she doubts that she wants it for herself."}]}, "authors": ["Rhyll McMaster"], "isbn": "0714531480", "longitude": -0.12574, "periods": ["1900s", "Recent Releases"], "title": "Feather Man", "word_cloud": "know rivet reader attention opening scene depict protagonist molest creepy pedophile next door accident introduction abuse shape entire story adult behavior relationship men sense story narrate look back childhood dusty suburban neglect disinterested parent pawn dub girl brood hen elderly neighbor bedridden wife feeling ashamed sexual abuse also crave attention time make feel special mother stereotypical shrill harridan father dotes vaguely disinterested matures give glimpse great divide view world perceive young adult become rather prolific artist begin modest success seem express particular passion art blithely abandon marriage rival artist equally creepy son yet work describe detail sound arrest unique outwardly artwork display brash bravado rebel particularly impress frequently defer whim mediocre men life mind secondary much even life story chapter entitle find tough go part main character almost laissez afire attitude best interest little rage feel bite maddening enough oddball humor proceeding afloat particularly memorable scene involve inadvertently light veil fire wed reception cause sensation land paper meet outrage husband upstage wonderful writer evoke tangible sense place stifle backwater grotty bohemia art world secondary character nuanced believable certainly masterwork create difficult contradictory infuriate funny admirable protagonist believable character come fiction story girl nickname reader work real name actually use text nearly end use nickname many way key largely define series relationship grow suburban childhood define abusive relationship male neighbor hero worship son sense alienation parent reject sense self batter wound time travel make questionable decision time exhibit appal judgment yet difficult feel least sympathy strives find way world generally supportive many seek stifle always show snarl teeth accomplish poet first world create dark place full evocative imagery humor light reward grow especially suburban recognize many description household come age story child live parent seem distract fight demon pay much attention parent inattentive generally impatient result spend lot time new neighbor strange unhealthy relationship develop elderly fact mother encourage spend time wife eventually pretty much cease contact parent divorce leave mother bitter disillusion father unavailable move away live woman high school become increasingly interested paint true creative talent emerge unhealthy relationship parent happen combination seem drift life fog emotional disquiet unhappiness trouble form healthy eventually fall love son follow relationship play backdrop art scene well struggle balance placate demand think love pursue thing ever make truly happy amazing writer prose whole extraneous word story substantial feel due primarily painstaking character development first page truly inside head come know intimately want badly everything turn well past fact dislike quite intensely find somehow endear mother skill somewhat lack distant negative even harsh felt much personality attributable time much woman bad marriage grumble complain much grumble complain downright revile everything mother fault time seem extreme unwarranted want set aside resentment mother see harsh veneer woman care ally lonely light particularly look real substance excellent character development think enjoy like sure novel feel similar come age story feature complex main character strong focus complexity significance relationship classic come age story narrator story child live child ignore parent sexually abuse old next door grow yearn someone love value repeatedly turn people hop good enough keep fight strength overcome demon abuse difficult childhood struggle adult relationship men abusive eventually find art paint amazing writer character someone identify feel pain also emotional detachment result abuse much discussion especially complexities relationship end also wonderful club debate light particularly look real substance excellent character development think first turbulent come age story young girl live narration not long recount instance sexual abuse hand adult neighbor family friend amateur farmer set tone type unhealthy abusive relationship encounter life quarrelsome parent instance abuse interaction daughter increasingly consist ignore berate abuse morphs welcome attention young girl mind intimate suffer early age difficult see mature eventually relocate hop become professional artist struggle nearly relationship particularly include men often victim relationship sympathetic situation perpetuate unhealthy alliance come believe simple pleasure inferior people seem determined break tie benevolent figure life encounter shortage narcissistic manipulative character acquire trait manages shun seemingly successful relationship pin equally troublesome son plague inordinate number volatile abusive situation imbues dry humor actual laughter largely bleak subject matter occasionally difficult decision frustrate intelligent reflective character witty guilty behavior abhors others action often painful reminder abuse endure story write rob mundane examine happiness ordinary life fault hop master examine life find inkling happiness even doubt want", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Set in Brisbane during the stultifying 1950s, this account of the betrayal of love throws us into the disordered world of Sookie, a young artist. As she transits warily to the London of the 'swinging' 70s, she comes up against those who would try to steal her very identity. Intelligent, mordantly funny, it is dark comedy with edges.\r\n\r\n\"Brilliant, a fantastic achievement, full of the most terrific portraits.\" Rodney Hall", "asin": "0714531480", "rank": "6981342", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51n7RWGlWCL.jpg", "country": "England", "story_arc": ["Tragedy", "Things only get worse"]}