{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 8, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "fabulous book!"}, {"review_sentiment": 4.0, "review_text": "It's more pictures than words, but a nice quick book to spur interest on this fantastic architect."}, {"review_sentiment": 5.0, "review_text": "The product shipped well. No damage. It was exactly what I was looking for, good pics and some light information"}, {"review_sentiment": 1.0, "review_text": "One must have the book in hands to review! To please do send it, then I will gladly part with my opinion"}, {"review_sentiment": 5.0, "review_text": "This small book is a great realisation of the spirit contained within the architecture of Luis Barragan. If one thing can be said, it allows us to see what Luis saw, and not necessarily what he did, the theme of which defined a quote that was included in the book. Rene Burri has done a great job of allowing us to see what Luis saw and give us an introduction to the essential nature of his architecture. It is a book whose simplicity allows the characteristics of poetry and beauty to be conveyed in a decidedly rich manner without the need for an overabundance of photographs. Barragan seemed to be more concerned about the spirit of his architecture than the architecture itself and this book cetainly conveys that. Top Stuff!"}, {"review_sentiment": 3.0, "review_text": "This is a short, quirky little book, that reads more like a short book of poetry than a book on architecture or on the great architect luis barragan.  It does have a few enticing pictures of his works and a few lines that offer insights into barragan's character.  But it's hardly a definitive or essential work.  Barragan fanatics probably want it for the collection. Fans but non-fanatics should look elsewhere."}, {"review_sentiment": 4.0, "review_text": "There are some very beautiful photographs and thought abstactions from the master, but this is not specifically an architectural peice of literature, as I expected it to be.  It does capture some intriguing spacial  conditions, but the artistic context appears in more of photographical  context."}, {"review_sentiment": 5.0, "review_text": "If you are interested in works by Mexican architects, like the recent AIA award winner Legorreta, this book is a must-have. It's filled with beautiful photographs of Barragan's works. The book is an artwork by  itself. Phaidon scores again!"}]}, "authors": ["Rene Burri"], "isbn": "0714839604", "longitude": -99.1333416, "periods": ["1900s"], "title": "Luis Barragan", "word_cloud": "fabulous picture word nice quick spur interest fantastic architect product ship well damage exactly look good pic light information review gladly part opinion small great realization spirit contain architecture thing say allow see saw necessarily theme defined quote include do great job allow see saw introduction essential nature architecture simplicity allow characteristic poetry beauty convey decidedly rich manner need overabundance photograph seem concerned spirit architecture architecture certainly convey short quirky little read short poetry architecture great architect entice picture work line offer insight character hardly definitive essential work fanatic probably want collection fan look elsewhere beautiful photograph think abstraction master specifically architectural pace literature expect capture intrigue spacial condition artistic context appear photo graphical context interested work mexican architect recent award winner fill beautiful photograph work artwork score", "genres": ["Essay", "Biography", "Art & Architecture"], "summary": "One of the key figures in modern architecture, Luis Barragan's (1902-88) influence has travelled far beyond his Mexican homeland, culminating in his reception of architecture's most prestigious award, the Pritzker Prize, in 1980. His architecture represents a strongly personal vision. \r\n\r\nInspired by the vernacular style of his native country, his passion for Moorish architecture and desire for spiritual beauty and harmony with nature, he set about creating serenity and enchantment in his buildings and gardens. \r\n\r\nPhotographer Rene Burri visited Barragan and photographed his work on several trips to Mexico in the 1960s and 70s. Here Burri pays tribute to his friend, reflecting the spirit of the man, capturing the essence of his architecture, and creating the sense of peace and contemplation that is at the heart of his work.", "asin": "0714839604", "rank": "684401", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/51d0Vwf-cZL.jpg", "country": "Mexico", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}