{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 80, "rating": 4.5, "reviews": [{"review_sentiment": 3.0, "review_text": "a bit too long drawn out , story hard to follow"}, {"review_sentiment": 5.0, "review_text": "Fantastic book well worth the read"}, {"review_sentiment": 4.0, "review_text": "I liked the way the way characters were revealed and developed throughout the story. I also liked how their lives and stories intertwined. I gave the rating I did because not only did I like it, but I would read again and won't hesitate to recommend it."}, {"review_sentiment": 5.0, "review_text": "This is the story of the constant battle of the worker to survive in any major city. \"The poor will always be with us.\" Acceptance of this cruel exploitation is brought vividly and unsparingly to life in Dublin when Larkin dared to get a living wage for the poor.A masterpiece that will break your heart yet fill it with love for those who lived and died with honor."}, {"review_sentiment": 5.0, "review_text": "Strumpet City is an amazing book. Reading it in preparation for my first trip to Ireland, I already had a pretty good idea of the time period and the struggles of the Irish people in the early twentieth century. This book, however, brought those stories to life in a way that no non-fiction account could ever do. I'll leave the plot summary to other reviewers (and it's a fantastic plot, by the way). What has stayed with me most are the characters, all portrayed in such a realistic way as to make me deeply care about them, even now, a week after I finished the book. From the highest stations of life to the lowest, these characters (to borrow from \"It's a Wonderful Life\") do most of the working and paying and living and dying in the city of Dublin, which, incidentally, is every bit as much a character as Fitz or Rashers. Walking the streets of Dublin for the first time, I found myself looking at the multitudes and yet seeing the individuals. Who is wealthy? Who is poor? Who struggles with her faith? Who is ashamed of his life? And perhaps the greatest achievement of James Plunkett is that you don't have to know anything at all about Dublin, or the Great Lock-Out of 1913. These are \"real\" people, if fictional representations, and their struggles are shared by people everywhere. I sobbed on the plane ride home as I finished the final chapters. I will never forget Strumpet City. I don't want to."}, {"review_sentiment": 4.0, "review_text": "very deep"}, {"review_sentiment": 3.0, "review_text": "Very good account of the times then."}, {"review_sentiment": 3.0, "review_text": "Maybe I didn'the read the description carefully rnough, because I wasn'the expecting a torn and partly missing cover.  Book seems to be in good enough shape."}, {"review_sentiment": 5.0, "review_text": "Fantastic read very true to the lives and attitudes of the time. Charactors are very real."}, {"review_sentiment": 5.0, "review_text": "Excellent!"}]}, "authors": ["James Plunkett"], "isbn": "0717156109", "longitude": -6.2602732, "periods": ["1900s"], "title": "Strumpet City", "word_cloud": "bit long drawn story hard follow well like way way character reveal develop story also like life story intertwine give rating like recommend story constant battle worker survive major poor always cruel exploitation bring vividly unsparingly life dare living wage masterpiece break heart yet fill live died honor amaze read preparation first trip already pretty good idea time period struggle irish people early twentieth century however bring story life way account ever leave plot summary reviewer fantastic plot way stay character portray realistic way make deeply care even week finish highest station life lowest character borrow work pay live die incidentally bit much character street first time find look multitude yet see individual wealthy poor struggle faith ashamed life perhaps achievement know anything real people fictional representation struggle share people everywhere sob plane ride home finish final chapter never forget want deep very good account time maybe description carefully enough expect tear partly miss cover seem good enough shape fantastic true life attitude time character real excellent", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "One of the best Irish novels of the twentieth century and an enduring classic. Set in Dublin during the Lockout of 1913, it is a panoramic novel of city life. It embraces a wide range of social millieux, from the miseries of the tenements to the cultivated, bourgeois Bradshaws. \r\n\r\nIt introduces a memorable cast of characters: the main protagonist, Fitz, a model of the hard-working, loyal and abused trade unionist; the isolated, well-meaning and ineffectual Fr O'Connor; the wretched and destitute Rashers Tierney. In the background hovers the enormous shadow of Jim Larkin, Plunkett's real-life hero. The novel's popularity derives from its realism and its naturalistic presentation of traumatic historical events. There are clear heroes and villains. \r\n\r\nThe book is informed by a sense of moral outrage at the treatment of the locked out trade unionists, the indifference and evasion of the city's clergy and middle class and the squalor and degradation of the tenement slums.", "asin": "0717156109", "rank": "657023", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/511kOGZR8nL.jpg", "country": "Ireland", "story_arc": ["Tragedy", "Things only get worse"]}