{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "In the summer of 1999 the then 46-year old Michael Jacobs, a life-long lover of Spain, was back in the country looking for a place at short notice which he and three English friends in Seville might rent for the month of August and where he might concentrate on translating a play by Lope de Vega.  The only place which was available was a house in the small and remote village of Frailes, in the province of Jaen.  Jacobs took it sight unseen.  When he got there, he found the scenery absolutely ravishing and as yet undiscovered by the tourist industry: a villager told him that he was the first foreigner ever to have stayed in Frailes.  Initially, he found village itself physically lacking in character, but he quickly discovered that its people were warm and friendly, and we have vivid descriptions of them.  They take him to their heart, eat and drink with him, quickly realizing that he is as convivial as they are.  It is not long before he shares their feeling that Frailes and its neighbourhood are very special, and groups of them take him to explore  its countryside and buildings. The latter are described in excessive detail, perhaps justified because he is always shown every nook and cranny, even the smallest or most intimate of rooms.  He learns about the tradition of faith-healing in the village and the veneration of its most famous practitioner, the late Santo Custodio who had died in 1961,  and he comes to feel that there was something truly magical - indeed spiritual - about the atmosphere there, and he has a mystical feeling that he had been destined to go of Frailes.  He has very little time  on his own to do his translation, but when he does, the difficulties he had had in translating the subtle and difficult text dissolve - it was almost as if the play was writing itself.  When the month is over and he has to leave Frailes, he is determined to return.And within a short time, he does, this time renting for a much longer period a room incongruously above a disco which functioned, at maximum volume, into the early hours of the morning on weekend evenings.  But Jacobs had always been one for bars and the nightlife, and so he simply joined in and made more friends there. He continues to respond to them, old and new, with as much empathy - also when he notes weaknesses or failures - as he did before, but in the account of his daily life the sense of discovery is no longer as strong, and it may not always be as interesting for the reader as it was for him.  He researches the history of Frailes which once bade fair to become a spa, but is now run down, impoverished, and losing its younger generation to neighbouring towns.  His standing in the community is strengthened by a beneficent  “miracle” that has apparently been wrought by him.There was more. Michael Jacobs had a group of artistic and intellectual friends in Granada.  Singing the praises of Frailes to them one day, they decided to visit the village, in a group of course; and not only once: they would foregather - sixty of them on one occasion - for meals in the garden of the village patriarch, Jacobs’ tireless friend and guide to all things Frailesque, known as El Sereno; they became known as “the Frailes Group”.  “Under Maiquel Jacqob” wote a local journalist, “Frailes is becoming a lively centre of intellectual gatherings”.He returns for a third stay. Now he takes an active part in the agricultural work of the village.  He overcomes his urban squeamishness  when it comes to slaughtering pigs and the gory business of turning the carcases into sausages, black puddings etc.  He helps, inexpertly, with the difficult task of harvesting olives and sees the process of making the olive oil for which the province of Jaen is famous and which is the mainstay of the Frailes economy.The older Fraileros remembered with nostalgia a cinema in the village that had had to close in the early 1970s. In particular, they all remembered a film that was at that time considered extremely erotic and the famous  star who had figured in it.  The empty building, dusty and dilapidated though it now was, still retained its art deco interior.  Jacobs conceived the idea of reopening it - for a one-off occasion! - to show this ancient film and getting the sexy star, a good thirty years older now but still a huge draw, to attend the occasion.  The account of how this came to pass, against all the odds - and at its climax massively covered by the frenetic media which were so out of tune with the normal life of Frailes -  takes up many nerve-racking and vivid pages.After the departure of the media circus, “the unchanging rhythms of the seasons reasserted themselves”,  but Frailes did not sink back into its previous obscurity: “rarely a week passed without some television reporter coming to film either El Sereno or me, or, preferably the two of us together.  We had become a double act, like Laurel and Hardy.”On his fourth visit to Frailes, Michael Jacobs bought a house in the village, which now became his principal home.(Michael Jacobs died in 2014.  To the end he kept a picture of the Santo Custodio in his wallet.)"}, {"review_sentiment": 4.0, "review_text": "An English writer lands in an obscure village in the mountains of Andalucía, and to his surprise, finds himself increasingly swept up in the charm of the characters of the village and their way of life as he researches the town's mysterious `healers' whose fame had spread to even Australia. The story is told with warmth and humor as the author finds himself increasingly involved in the lives of his new friends and in keeping the hamlet from slipping into obscurity.  When he organizes an \"event\" to bring visitors to the town, things turn hilarious as the plans careen from spectacular to chaos and the results are hilarious.  This is a wonderful book for anyone with an interest in discovering a taste of the real Spain and Spanish rural way of life."}]}, "authors": ["Michael Jacobs"], "isbn": "0719561736", "longitude": 0.0, "periods": ["2000s"], "title": "The Factory of Light: Tales from My Andalucian Village", "word_cloud": "summer old lover back country look place short notice friend month translate place available house small remote province take sight unseen get find scenery absolutely ravish yet undiscovered tourist industry villager tell first foreigner ever stay find physically lack character quickly discover people warm friendly vivid description take heart eat drink quickly realize convivial long share feel neighborhood special group take explore countryside building latter describe excessive detail perhaps justify always show nook cranny even smallest intimate room learn tradition veneration famous practitioner late die come something truly magical indeed spiritual atmosphere mystical feeling destine little time translation difficulty translate subtle difficult text dissolve almost write month leave frailest determine short time time rent much longer period room incongruously disco function maximum volume early hour morning weekend evening always bar nightlife simply join make friend continue old new much empathy also note weakness failure account daily life sense discovery longer strong always research history bid fair become spa run impoverish lose younger generation neighbor town stand community strengthen beneficent miracle apparently work group artistic intellectual friend praise day decide visit group course occasion meal garden patriarch tireless friend guide thing know become known local journalist become lively center intellectual gathering return third stay now take active part agricultural work overcome urban squeamishness come slaughter pig gory business turn carcass sausages black pudding help inexpertly difficult task harvest olive see process make olive oil province famous mainstay older remember nostalgia cinema close early particular remember film time consider extremely erotic famous star figure empty building dusty dilapidate still retain art decor interior conceive idea reopen occasion show ancient film get sexy star good thirty year older still huge draw attend occasion account come pas odds climax massively cover frenetic medium tune normal life take many vivid departure medium circus unchanging rhythm season reassert back previous obscurity rarely week pass television reporter come film preferably together become double act fourth visit buy house become principal home die kept picture wallet english writer land obscure mountain surprise find increasingly swept charm character way life research town mysterious fame spread even story tell warmth humor author find increasingly involve live new friend keep hamlet slip obscurity organizes event bring visitor town thing turn hilarious plan careen spectacular chaos result hilarious wonderful anyone interest discover taste real spanish rural way life", "genres": ["Memoir", "Travel Writing"], "summary": "Searching for a house to rent in 1999, Michael Jacobs was offered one in the Andalucian olive-growing community of Frailes. This was a place where the modern world enjoyed a strange co-existence with a virgin Andalucia ruled by a dynasty of saintly healers. It was not long before he decided to take up more permanent residence above the Discoteca Oh!\r\n\r\nAs he shared in each season's special events, Michael's life became increasingly tied up with this village threatened by drought, unemployment, and decreasing population. He was taken under the wing of El Sereno, an elderly Romeo, while his friendship with the village social worker Merce - a woman who held court in a bar situated inside a cave - led him deeper into a miraculous world. Miracles were needed to save the place; and miracles began happening. With his dream of inviting a legendary Spanish actress to the village's abandoned Art Deco cinema, the truly unimaginable occurred, and the name of Frailes became known even to Hollywood.", "asin": "0719561736", "rank": "1708522", "city": "Andalucia", "image": "https://images-na.ssl-images-amazon.com/images/I/51fbv30W2OL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}