{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 1, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "At the end of World War I, as the victors were dividing the defeated Ottoman Empire, the Kurds were promised a homeland. Their dream was almost within their grasp--they would have their own country. But the Turkish leader, Kemal Ataturk, also had a dream---to prevent his homeland from being destroyed by foreign powers and to protect the new Republic of Turkey. Historical events shape future generations, and, in The Lost Word Oya Baydar portrays how the lost dream molded the lives of a complex network of Kurdish people.It is the Kurdish women in The Lost Word who are the strongest characters. They lose their fathers, husbands, brothers, and sons when they go to the mountains to fight to protect their families and villages. Sometimes it is the Turks they are fighting, but they also fight Iranians, Syrians, Saddam Hussein's troops, and Iraqi forces--their own countrymen.. The men fight and many die but it is the women who care for the young and the elderly and endure the atrocities of war. The men in The Lost Word remind me of a line from Shelly's poem, Ode to the West Wind: \"I fall upon the thorns of life. I bleed.\"  It is difficult to develop much empathy for a man-- a successful, respected writer experiencing writer's block--who turns his back on his only son and deceives his wife by having  an affair.It is a mistake to view the main challenge facing the Kurds as a Turkish/Kurdish conflict.  Now, the Kurds are holding onto a part of their dream--Kurdistan--and they are fighting ISIS to protect it. ."}]}, "authors": ["Oya Baydar"], "isbn": "0720613477", "longitude": 28.9651646, "periods": ["1900s"], "title": "The Lost Word", "word_cloud": "end victors divide defeat promise dream almost grasp country turkish leader also dream prevent homeland destroy foreign power protect new event shape future generation portray dream mold life complex network woman strongest character lose father husband brother son go mountain fight protect family village sometimes fight also fight troop force men fight many die woman care young elderly endure atrocity war men remind line poem fall thorn life bleed difficult much empathy man successful respected writer experience writer block turn back son deceives wife mistake view main challenge facing conflict now hold part dream fighting protect", "genres": ["Fiction & Literature", "Mystery & Suspense", "Politics"], "summary": "One of the most acclaimed and powerful novels of modern Turkey is set across Europe, but retains the Turkish-Kurdish conflict at its heart\r\n \r\nA mixture of thriller, love story, political, and psycho-philosophical novel, this is a sobering, coruscating introduction to the potentially explosive situation that exists between the Kurds and the Turkish state. \r\n\r\nA bestselling author suffering from writer&#039;s block witnesses the accidental shooting of a young Kurdish woman who loses the baby she is carrying. He becomes involved with her and the two families caught in the fallout of the Turkish-Kurdish conflict, eventually finding a true understanding of the situation and rediscovering his own creativity with a new moral certainty, stripped of any ideology or prejudice. But there are many gripping perspectives to this vital and ultimately uplifting story from one of Turkey&#039;s most acclaimed writers, now translated into English for the first time.", "asin": "0720613477", "rank": "4124021", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/41yTceo6AoL.jpg", "country": "Turkey", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}