{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 59.9132694, "ratings": {"num_ratings": 34, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Loved the book. Told my wife and she read it and loved it. Told my mom and she read it in eight hours and loved talking to her about it. It is now with friends who 's mother and daughter will be reading it.."}, {"review_sentiment": 5.0, "review_text": "This short novel contains some of the greatest prose-poetry I havre read. The images are real and surreal at once and the words flow so naturally that I hated to read it in two sittings rather than one.The subjects are death ,depression, and most prominently love of several human varieties along with recovery and redemption.  I think this book could and should be the basis of an opera."}, {"review_sentiment": 4.0, "review_text": "If I actually wrote out all of the highlights I have made in the book, I'd be listing almost the entire book herein. While I at first thought that it was going to be a quick read, after I got into it and realized that every statement really potentially meant something, or something different than I was thinking it meant, I had to slow down to take it all in, lingering over the prose and re-reading particular phrases. So may metaphors and things left unsaid, left to the reader's imagination. Beautiful, eerie, sad, and hopeful are all descriptions that come to mind."}, {"review_sentiment": 5.0, "review_text": "This is a very delicately written beautiful story about the intensity of childhood friendships set in the frozen landscape of Norway. It really gets under your skin."}, {"review_sentiment": 2.0, "review_text": "Meh. I had big expectations based on the other reviews and was disappointed. I can not see what all the fuss is about. I did read it until the end, and didn't feel like my time was completely wasted, but still felt like there really wasn't much actual substance."}, {"review_sentiment": 4.0, "review_text": "A short (176 p) and intensely strange book by Nobel candidate Vesaas. Like nothing else I've ever read, I can't exactly say I enjoyed it, but I will never forget it, and as I read it I became increasingly aware of its literary 'credentials.' This would make a prime candidate as a set text for students, with its deceptively simple writing and short sentences containing a wealth of hidden meanings to be drawn out.The main character, Siss, is an 11-year old schoolgirl in 1960s Norway. There is a new, strange, solitary girl, Unn, at their school, and the book opens with Siss finally being invited to her home (\"I'm sure to find out something. I've been waiting for it all the autumn...I don't know why\".)(spoiler alert) And there is indeed something in Unn's background - \"the other\" - but neither Siss nor the reader ever finds out what. Murder? Child abuse? Unn has come to live with her quiet, distant aunt since her mother died of an illness. Her father is absent, though she has a photo of him. Unn can't talk easily, the conversation is stilted ... and just as it seems to be going somewhere, Siss makes a hasty retreat home....And never sees Unn again, as the troubled girl plays truant and goes exploring in a nearby frozen waterfall, the 'ice palace' of the title, Poetical descriptions abound; Siss withdraws from her normal life, stops mixing with her former friends, standing apart by the school wall as Unn used to do. She can't talk to her parents and feels bound to a promise she makes the absent Unn to remember her forever, even to making a solitary exploration of the ice palace:\"Siss's feelings were in tumult up there on the tall, intricate dome of ice. She let herself slide along gulleys and down into fissures and came out onto a shelf some way down and facing the sun and the falls. She was in tumult on account of the place. She climbed down a hollow of transparent, solid ice. The sun shone on it and sparkled in hundreds of different patterns.She screamed as she did so: for there was Unn! Straight in front of her, looking out through the ice wall.In a flash she thought she saw Unn, deep in the ice.\"But spring comes, her friends still seek her company, there's a boy she likes, and the palace, which features throughout, is finally melting... \"Now the palace, with all its secrets, goes into the waterfall. There is a violent struggle and then it has gone.\"Representative of the end of childhood? Moving on from death to continue facing life? There is a wealth of material here for the reader to consider, and it's a very unique book, although I can't say I really want to read any more of Vesaas' work."}, {"review_sentiment": 5.0, "review_text": "This was one of my favorite books many years ago. I picked it up again and it still is. Stunning writing, beautiful nature descriptions. I was freezing cold just imagining the settings."}, {"review_sentiment": 5.0, "review_text": "A great read. I sat down and read it in one evening!  It's one of the assigned reading books from a class I'm taking. It definitely highlights things about human relationships."}, {"review_sentiment": 4.0, "review_text": "Very interesting writing style of a short encounter between two classmates and what happens when one shows up missing the Next day. This is not a suspenseful book or crime novel. Nothing nefarious happens. Just how one young girl deals with a loss. It isn't emotional though, either. That's why the style is so interesting."}, {"review_sentiment": 5.0, "review_text": "Let me preface by saying that I have never before written a review for a book on Amazon. This was simply because it seems like everything that could be said about a novel has already been said. Also, everyone deserves to be able to interpret the book without any preconceived notions or expectations. But when it came to this book I knew that I had to leave a review, just because I hope it can convince someone who is on the fence about reading this book to take the plunge.Never before has a novel affected me so deeply. Plain and simple. The  beautiful prose, a mixture of poetry and stream-of-consciousness of a preteen girl, describes each crevice and rivulet of the ice palace with such detail that at some points the reader may no longer know whether they are exploring  a frozen waterfall in late autumn, or if they are turning their gaze inward toward secret thoughts and unconscious fears that the ice has long ago hidden. The beautiful and simple premise of the novel- that a single night should be able to change the perspective on one's entire life is something that is so universally true and elegant.I don't think I can say much more about this book without becoming repetitive but I urge you to download or pick up a copy. I can promise that you won't regret it. It's a short and easy read, but I guarantee that you won't be satisfied after simply one time.  Enjoy!"}]}, "authors": ["Tarjei Vesaas"], "isbn": "0720613299", "longitude": 10.7391112, "periods": ["1900s"], "title": "The Ice Palace", "word_cloud": "love wife love mom hour love talk friends mother daughter read short contain greatest have image real surreal word flow naturally hat sitting rather subject death depression prominently love several human variety recovery redemption think basis actually write highlight make list almost entire herein first think go quick get realize statement really potentially meant something something different think meant slow linger prose particular phrase so thing leave unsaid left imagination eerie sad hopeful description come mind delicately write beautiful story intensity childhood friendship set frozen landscape really get skin big expectation base review disappoint see fuss end time completely waste still felt really much actual substance short p intensely strange candidate nothing else ever exactly enjoy never forget become increasingly aware literary prime candidate set text student deceptively simple write short sentence contain wealth hidden meaning draw main character old schoolgirl new strange solitary girl school open finally invite home sure something wait autumn know spoiler alert indeed something ever find come live quiet distant aunt mother die illness father absent photo easily conversation stilted seem go somewhere make hasty retreat home never see trouble girl play truant go explore nearby frozen waterfall title description abound withdraws normal life stop mix former friend stand apart school wall use parent feel promise make absent remember forever even make solitary exploration feeling tumult tall intricate dome let gullet fissure come shelf way face sun fall tumult account place climb hollow transparent solid sun shone sparkle hundred different scream front look flash think saw deep spring come friend still seek company boy like feature finally melt now secret go waterfall violent struggle go representative end childhood death continue face life wealth material consider unique really want work favorite many year ago pick still stun write beautiful nature description freeze cold imagining setting great sit even assign read class take definitely highlight thing human relationship very interesting write style short encounter classmate happen show miss next day suspenseful crime nefarious happen young girl deal loss emotional style interest preface say never write review simply seem everything say already say also everyone deserve able interpret preconceived notion expectation come know leave review hope convince someone fence read affected deeply simple beautiful prose mixture poetry preteen girl describes crevice rivulet detail point longer explore frozen waterfall late autumn turn gaze inward secret thought unconscious fear long ago hide beautiful simple premise single night able change perspective entire life something universally true think say much become repetitive urge download pick copy promise short easy guarantee satisfy simply time", "genres": ["Fiction & Literature"], "summary": "A new edition of what is commonly seen as the legendary Norwegian writer's masterpiece, this story tells the tale of Siss and Unn, two friends who have only spent one evening in each other's company. But so profound is this evening between them that when Unn inexplicably disappears, Siss's world is shattered. \r\n\r\nSiss's struggle with her fidelity to the memory of her friend and Unn's fatal exploration of the strange, terrifyingly beautiful frozen waterfall that is the \"Ice Palace\" are described in prose of a lyrical economy that ranks among the most memorable achievements of modern literature.", "asin": "0720613299", "rank": "360224", "city": "Oslo", "image": "https://images-na.ssl-images-amazon.com/images/I/41tsHVdQ92L.jpg", "country": "Norway", "story_arc": ["Tragedy", "Things only get worse"]}