{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 12, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Finally finished. The author has just the right amount of cynicism to tell the story correctly. Easy to follow a very complex campaign and how the different beach heads on the peninsula each failed. The terrain he describes and some of the photos make the impossibility of the task assigned clear even if  there was not so much incompetence by the Brass. The only thing that went well in the whole campaign was the withdrawal. Book could have used more maps. Since the entire battle was fought within twenty miles, scale would not have been a problem."}, {"review_sentiment": 5.0, "review_text": "A great read, not concentrating on ones own nation alone. Well done."}, {"review_sentiment": 5.0, "review_text": "Excellent book!  Good read with great information."}, {"review_sentiment": 4.0, "review_text": "Author's journalistic style provides an insightful and engaging read ..Well researched ,Carlyon cleverly  juxtaposes the pathos and failings of the Gallipoli campaign with the historical background of the ancient landscape..the futility and brutality of the campaign is made very evident .."}, {"review_sentiment": 5.0, "review_text": "Stunning in detail, the dairies and letters of the warriors brought this war and era to present time for me."}, {"review_sentiment": 5.0, "review_text": "The subject of Gallipoli is never out of mind in Australia and there is a constant stream of books examining aspects of the battle. Les Carlyon's 2001 effort is an important modern overview that looks at all aspects of the flawed campaign. This includes Churchill's original thought bubble, the disastrous mix of commanders, the Turks, the battles and the telling effect of the terrain.The original plan, to aid Russia by attacking the Turks, while seemingly having some merit, is shown by Carlyon to have been deeply flawed. The main trouble was that there was no clear consensus on exactly how to achieve the objective. This resulted in innumerable blunders that cost thousands of lives. The initial naval attack gave the Turks ample warning to prepare for the land invasion. Successes on that day were allowed to slip away, failure was reinforced. Throughout there was poor organisation, poor logistics and poor central command. Hamilton's job was compounded by poor directions from London and a lack of proper staff support. He then failed to control the battle, allowing some appalling commanders to fritter away the lives of thousands - all for no gain. It seems that regardless of the action, the absolute wrong man was put in charge of it. The mistakes were by no means confined to the British either, with several Australian commanders failing their responsibilities to their men. Hamilton then compounded everything by failing to deal honestly with his superiors. Rarely have ordinary soldiers been so poorly served.Carlyon has a very cynical and sarcastic tone. He writes very pithily of the failed commanders, their agendas, petulance's and fantasies. Sure, they were fighting a world war for the first time but the continuance of failed tactics, attack after attack was absolutely inexcusable. The Turks did not help matters by being heroic and competently lead. They made mistakes too but they had some margin for error. The make-it-up as you go along British approach needed everything to go right and they didn't have the people or the luck. They certainly had brave soldiers and there were some remarkable achievements, like Lone Pine. But the disasters of The Nek, Suvla Bay and Krithia were more typical. They were the awful consequences of the prevailing incompetence and arrogance. Sadly for many of the survivors, there was even worse to come in the trenches of the Western Front.Carlyon has done an excellent job in revealing the key personalities and their often dysfunctional relationships with each other. Accordingly, he draws heavily on the writings by and about the commanders.  There is certainly a good selection of recollections by ordinary soldiers and it is especially good to read some by British troops. For all Gallipoli's ongoing resonance in Australia, it is often forgotten that France and Britain suffered even worse losses. Carlyon gives due weight to these other participants but there certainly is a focus on how the events impacted the Australians. Though quite familiar with the campaign, I found that there was much to learn, particularly concerning Chunuk Bair. Carlyon's critical tone is quite warranted and indeed refreshing, considering the usual approach of historians to veil personal opinions. He also has a great ability to say a thing with clarity.This is an important update on this seminal battle. It is extensive, insightful and very readable. It makes you want to shout at the blunderers but also grieve for the many young men whose lives were so tragically wasted. An excellent choice if you are looking to learn more for the Anzac centenary."}, {"review_sentiment": 5.0, "review_text": "After a new raft of Gallipoli books this is the best yet.Especially scores well on dividinbg thje campaigns on the Peninsula into understandable sections.Did not miss out on the French effort I brought this to the battlefield tours in Feb 2013"}, {"review_sentiment": 3.0, "review_text": "Naturally I have not read the book as yet - having only arrived today, 6th May, however I was disappointed with the poor packaging that left the book in a very used condition.  I had paid full price for the book and expected a \"as new\" book.  Packaging needs to be improved.  Never happened before via Amazon but I think this came from elsewhere."}, {"review_sentiment": 1.0, "review_text": "A new version at a much higher price than existing secondhand copies has been published, claiming to be a new edition.And yet so far it's impossible to find ANYWHERE, ANYTHING about how this new \"edition\" (as distinct from REPRINT) is any different.Publishers need to be HONEST."}, {"review_sentiment": 5.0, "review_text": "I was given this book as a gift by my son.  When starting out reading this comprehensive book I was feeling \"gallipoli'd out\" and had not intended buying another book on the subject.  I have read quite a lot about Gallipoli and the first world war.  There are inumerable books that tell the story from the individual (aussie)soldier's perspective, others that maintain a focus on strategy, tactics and political aspects.  In many many cases these books focus very intently on the Australian and New Zealand elements (ANZACs)and neglect the broader contexts that aid a more balanced understanding of the events.  What is spectacular about Les Carlyon's work is the even handed treatment of every player in the drama, it gives a balanced perspective on so many levels.  It is a book of reconciliation, though maybe this would only be apparent to Australians and New Zealanders for whom the pain of the losses in WW1 still resonate, and for whom the battles in the Dardanelles hold particular national significance, even mythology.  Carlyon is masterful at blending his personal description of the battlefields as they are today and the impressions one (he) has when exploring them, with the personal experience of the soldiers on both the allied and turkish sides, and the bigger picture strategic and political aspects.  The personal experience of the commanders at every level and the social and political contexts in which they were moulded and in which they functioned is not neglected. Carlyon's present day descriptions do not dominate, they merely form something of a \"breather\" between the military detail. The style of writing is very engaging and the book on the whole is extremely accessible for a broad audience.This is an absolutely magnificent book on it's subject."}]}, "authors": ["Les Carlyon"], "isbn": "0732911281", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Gallipoli", "word_cloud": "finally finish author right amount cynicism tell story correctly complex campaign different beach head fail terrain describe photo make impossibility task assign clear even much incompetence thing go well whole campaign withdrawal use map entire battle fought twenty mile scale problem great concentrating one nation alone well do excellent great information journalistic style provide insightful engage research cleverly juxtaposes pathos failing campaign historical background ancient futility brutality campaign make evident stun detail dairy letter warrior bring war era present time subject never mind constant stream examine aspect battle effort important modern overview look aspect flaw campaign include original think bubble disastrous mix commander turks battle tell effect original plan aid attack seemingly merit show deeply flaw main trouble clear consensus exactly achieve objective result innumerable blunder cost thousand live initial naval attack give ample warning prepare land invasion day allow failure reinforce poor organization poor logistics poor central command job compound poor direction lack proper staff support fail control battle allow appal commander fritter away live thousand gain seem regardless action absolute wrong man put charge mistake mean confine several australian commander fail responsibility men compound everything fail deal honestly superior rarely ordinary soldier poorly cynical sarcastic tone write pithily fail commander agenda petulance fantasy fight world war first time continuance fail tactic attack absolutely inexcusable help matter heroic competently lead make mistake error go british approach need everything right people luck certainly brave soldier remarkable achievement disasters typical awful consequence prevail incompetence arrogance sadly many survivor even worse come trench western do excellent job reveal key personality often dysfunctional relationship accordingly draw heavily write commander certainly good selection recollection ordinary soldier especially good british troop ongoing resonance often forget suffer even worse loss give due weight participant certainly focus event impacted quite familiar campaign find much learn particularly concern critical tone quite warrant indeed refresh consider usual approach historian veil personal opinion also great ability say thing important update seminal battle extensive insightful readable make want shout blunderer also grieve many young men life tragically waste excellent choice look learn centenary new raft best score well dividing the campaign understandable miss french effort bring battlefield tour naturally yet arrive today however disappoint poor packaging leave used condition pay full price expect new need improve never happen think come elsewhere new version much higher price exist secondhand copy publish claim new yet far impossible find new edition distinct need give gift son start read comprehensive feel intend buying subject quite lot first world war numerable tell story individual aussie soldier perspective others maintain strategy tactic political aspect many many case focus intently australian elements neglect broader context aid balance understanding event spectacular even hand treatment player drama give balance perspective many level reconciliation maybe pain loss still resonate battle hold particular national significance even mythology masterful blend personal description battlefield today impressions explore personal experience soldier ally turkish side bigger picture strategic political aspect personal experience commander level social political context mold function neglected present day description dominate merely form something breather military detail style write engage whole extremely accessible broad absolutely magnificent subject", "genres": ["History", "Politics", "WWI"], "summary": "This account of the Gallipoli campaign of 1915 brings an epic tragedy to life. As well as taking the reader into the trenches to witness the fear, courage and humour of the soldiers who fought there, describing their experiences, whether Australian, British, New Zealand, French or Turkish, it examines those who led them: the generals and politicians - some brilliant, some ruthless, some hopelessly incompetent - who held the lives of tens of thousands of young men in their hands. \r\n\r\nFrom the grand military and political strategies to the squalor of the front line, it is a haunting insight into the realities of war. The struggle for the Gallipoli Peninsula was dominated by the terrain as much as by men and steel, and here the battlefields come alive as the author guides the reader through them, evoking the landscape. \r\n\r\nUsing an intimate knowledge of Gallipoli itself (his researches also took him to the UK, France, Australia and New Zealand), together with storytelling and scholarship, Les Carlyon has written an immediate account of one of modern history's defining moments.\r\n\r\nLes Carlyon, was the editor of the Melbourne Age, and is one of Australia's most respected journalists. ", "asin": "B002QREBVY", "rank": "16616705", "city": "Gallipoli", "image": "", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}