{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 5, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "A very good book."}, {"review_sentiment": 5.0, "review_text": "A great book about Austin, Texas."}, {"review_sentiment": 5.0, "review_text": "As the words to the song say, this is the consummate Austin history book.  Whether you are a new Austinite like myself, or an oldtimer, this book is sure to please as do all the books in the Images of America series.With it's proliferation of great photos old and new, you will surely find something of interest.  There are pictures of schools and hotels of the past with descriptions below, stores from their original inception to their closings (or burnings down!), and pictures (look at those long skirts) and horse and buggies that will amaze you.  This is primarily a pictorial history of Austin; it is anything but dry.  Rather, it gives insight into the people, places and things that formed Austin to be the exciting Capital city that it is.  One thing I did notice was that women played an early important role in this State!Highly recommended!"}, {"review_sentiment": 5.0, "review_text": "My son asked for this book for Christmas. We all looked at it and really enjoyed it . Others wanted a copy too !"}, {"review_sentiment": 2.0, "review_text": "Austin  (TX)  (Scenes of America)This product is far below the usual standards for titles from the Scenes of America series, with the book itself being half the size of a normal book in the series. This book should not have been issued--it is more a personal scrapbook than a worthy history.Apparently, the authors had access to only a few friends from a few families in order to obtain photos for the book. Missing are photos of many important and well known public buildings, grand old homes (some with historical markers, like the world-renowned Bremond block) and other interesting architecture in the city. For starters, I would suggest the authors do actual research in the Austin Public Library archives and review, for starters, the wonderful \"Waterloo Scrapbook\" series for excellent photos and actual local history from a variety of neighborhoods and perspectives.  There are many other published books that are sources for important photographs and historical details available in the state archives as well."}]}, "authors": ["Karen Thompson", "Kathy Howell"], "isbn": "0738508322", "longitude": -97.7436995, "periods": ["1800s", "1900s"], "title": "Austin, Texas", "word_cloud": "good great word song say consummate history new old timer sure please proliferation great photo old new surely find something interest picture school hotel description store original inception closing burning picture look long skirt horse buggy amaze primarily pictorial history anything dry give insight people place thing form exciting city thing notice woman play early important role recommend son ask look really enjoy want copy product far usual standard title series half size normal series issue personal scrapbook worthy author access friend family order photo miss photo many important well know public building grand old home historical marker block interesting architecture city starter author actual research archive review starter wonderful series excellent photo actual local history variety neighborhood perspectives many publish source important photograph historical detail available state archive well", "genres": ["History"], "summary": "When General Sam Houston's Texas army defeated Mexican General Santa Anna at the Battle of San Jacinto on April 21, 1836, the Republic of Texas was born. Austin, located on the banks of the Colorado River, was laid out as the capital city in 1839, and has remained the capital since statehood in 1846. Featured here in over 200 vintage photographs is the history of this independent city, and the people who made it what it is today. \r\n\r\nLand agent Stephen F. Austin brought the first Anglo settlers to the Spanish territory in 1821 and guided them until independence in 1836. Seen here are the images that capture the spirit of those original pioneers and their achievements, including the French Legation, the construction of the capitol, and the Texas governor's mansion, the oldest governor's residence west of the Mississippi. \r\n\r\nAlso pictured are the familiar faces of Austin's long history, including Austin's first mayor, Edwin Waller, and past governor Alan Shivers.", "asin": "0738508322", "rank": "932797", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/519UhnyqMQL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}