{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 1452, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "Okay, I'll admit to not being too impressed with one of our greatest authors in this particular book....I guess the whole point he was trying to get across was the aimless lives of some of the wealthier members of \"the lost generation\". I liked \"The Old Man and the Sea\" much better. I might read it again to see if I missed anything."}, {"review_sentiment": 3.0, "review_text": "Or even twenty.I appreciate Hemingway’s spare prose especially after reading Faulkner, Woolf, Joyce, H. James.Like the novel Moby Dick, The Sun Also Rises is marred by featuring mistreatment of animals that today we find distasteful.  The alcoholism is unpretty.  The nasty remarks and objectification of Jews is representative of the vulgarity of the characters (not Hemingway).  Again, unpretty and much more than unpretty considering what was to happen to my people in only a few more years.I think that the impact of the novel, as with so many others of the times, is weakened by the necessity of writing within the censorship and obscenity rules of the times.  It makes it seem unrealistic to contemporary ears—young people don’t talk in such sanitized ways.I don’t like bull fighting (I’ve been to a bull fight in Mexico).  I think getting drunk is vulgar.  Ugly remarks about Jews are common in great literature but always seem petty and out of place to our ears now.I know this is a well-loved novel, but not by me."}, {"review_sentiment": 2.0, "review_text": "I haven’t got it yet.  Why not?"}, {"review_sentiment": 2.0, "review_text": "Several months ago I determined I'd read the hemmingway works I'd somehow previously overlooked. This first of his works was saved for the last because it received so much praise. I conclude that if you've read one of his works you can stop there. If this work left out the repetitive drinking episodes the 251 pages could have been pared in half. Maybe that's why the drinking scenes were not pared down...there was essentially no plot to speak of otherwise. As I read this work, the famous Seinfeld episode kept popping into my head where George and Jerry met with TV producers and told them their show was about nothing. I'm glad I got it from the library. This is a book about nothing. Oh there is one line stolen by Dr. Suess on page 84 Mike said to Brett \" where did you get that hat?\"  \"Chap bought it for me, do you like it?\" \"It's a dreadful hat, do get a good hat\"."}, {"review_sentiment": 4.0, "review_text": "Easy read. Classic Hemingway. Would read again."}, {"review_sentiment": 3.0, "review_text": "The value of this book is to give an appreciation of Hemingway's writing style and his ability to describe events and situations.  In that sense it is superb.But it helps to know--one needs to know-- that this is more a journal or stream-of-consciousness thought than a novel. The characters are interesting and the scenes are captivating, but, as a story, as a book, it goes nowhere.  No real plot, just a telling of some of Hemingway's interesting experiences.Still, it's Hemingway.  That alone makes it worth reading."}, {"review_sentiment": 4.0, "review_text": "The Sun Also Rises has some of the best character development of any book that I have ever read. In many ways, this is the de facto standard of how an author should bring the reader into the the mindset of what the character is all about. Ernest Hemingway writes a fantastic stunted love story between two people who can never be in love. I think what I liked about it most was the struggle. I knew it would never work between them, but I still wanted them to try to make it work.This book was st in the 1920's and this made it a bit hard to relate to, but I still enjoyed it. Overall, it is a great and powerful read."}, {"review_sentiment": 2.0, "review_text": "Enjoyable read, that is, if one finds a ten mile hike through two feet of snow entertaining."}, {"review_sentiment": 2.0, "review_text": "I usually love classic books more than anyone, but this one just didn't do it for me. Hemingway writes dialogue in a way where he doesn't specify which character is speaking for quite a while, so I got very confused with the dialogue and couldn't keep track of who was saying what. The story also didn't draw me in as I would have liked, but I wouldn't say I hated it."}, {"review_sentiment": 2.0, "review_text": "Not my favorite Hemingway bookk."}]}, "authors": ["Ernest Hemingway"], "isbn": "0743297334", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Sun Also Rises", "word_cloud": "admit impressed greatest author particular guess whole point try aimless life wealthier member lose generation like much better miss anything even spare prose especially read mar feature mistreatment animal today find distasteful alcoholism nasty remark objectification representative vulgarity character pretty much consider happen people think impact many others time weaken necessity write censorship obscenity rule time make seem unrealistic contemporary people talk sanitize bull fighting bull fight think get drunk vulgar remark common great literature always seem petty place ear know get yet several month determine hemming way work somehow previously overlook first work save last receive much praise conclude work work leave repetitive drinking episode page half drinking scene par essentially plot speak otherwise work famous episode keep pop head meet tv producer tell show nothing glad get library nothing line steal page say buy dreadful hat good hat value give appreciation write style ability describe event situation sense help need know journal think character interest scene captivate story go nowhere real plot tell interest alone make worth read best character development ever many way standard author bring mindset character write fantastic stunt love story people never love think like struggle know never still want try make st make bit hard relate still enjoy great powerful enjoyable find ten mile hike foot snow entertain usually love classic anyone write dialogue way specify character speak quite get confused dialogue track say story draw like hat not favorite book", "genres": ["Fiction & Literature"], "summary": "The quintessential novel of the Lost Generation, The Sun Also Rises is one of Ernest Hemingway&#039;s masterpieces and a classic example of his spare but powerful writing style. \r\n\r\nA poignant look at the disillusionment and angst of the post-World War I generation, the novel introduces two of Hemingway&#039;s most unforgettable characters: Jake Barnes and Lady Brett Ashley. The story follows the flamboyant Brett and the hapless Jake as they journey from the wild nightlife of 1920s Paris to the brutal bullfighting rings of Spain with a motley group of expatriates. It is an age of moral bankruptcy, spiritual dissolution, unrealized love, and vanishing illusions. \r\n\r\nFirst published in 1926, The Sun Also Rises helped to establish Hemingway as one of the greatest writers of the twentieth century.", "asin": "0743297334", "rank": "4279", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51lmTfDL9fL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}