{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 90, "rating": 3.8, "reviews": [{"review_sentiment": 1.0, "review_text": "Hated it!"}, {"review_sentiment": 5.0, "review_text": "D. Rules!"}, {"review_sentiment": 3.0, "review_text": "Found the writing style choppy not an easy read. I found myself reading things multiple times."}, {"review_sentiment": 5.0, "review_text": "I always like noir books with a psychiatrist main character. In this one it is Eldon Chance. He is also a neurologist. He is beset from multiple directions. One pressure cooker experience is that his soon to be ex places high demands from him in their divorce. The book is set in the ultra expensive San Francisco so just housing costs alone are a crippling \"extra\" to take on for two.Then there is his job. He evaluates a lot of very strange and messy cases. As if that isn't trying enough, in walks a beautiful woman married to a homicide detective as a patient. He becomes obsessed with her.Then he meets a multi skilled veteran who helps him make extra money on the side with some dubious ventures into antique furniture. The moral compass dips with this venture. But the veteran has a lot of other life skills which Chance lacks.There are many interesting and creative twists and turns.This was also made into a quite good tv adaptation in 2016, called Chance and starring Hugh Laurie. It was quite good too."}, {"review_sentiment": 3.0, "review_text": "I purchased this novel after watching the Netflix series hoping that the book would expand on the story, bring more life to the characters and add something to a great, well written story.  Unfortunately it appears that script writers for Netflix copied the novel, almost word for word.  The Novel had nothing extra to add, which is a rarity when to comes to novels turned to movies/series.  Overall a great story, but if your expecting more than what Netflix has provided, you will be disappointed."}, {"review_sentiment": 5.0, "review_text": "Dark,twisty thriller with literary style."}, {"review_sentiment": 2.0, "review_text": "I had high hopes for this book described as \"Raymond Chandler-esque\" -- PUH-leeze!  Not remotely in the same league as Chandler.  Story packed with fillers that really were superfluous; writing style was juvenile.  I kept reading to see how he'd end the \"main\" story -- even that was disappointing."}, {"review_sentiment": 5.0, "review_text": "SPOILERS: at the start of the novel, doctor chance is wasting his life evaluating those with brain damage and writing reports that typically support whatever the lawyers that pay him prefer. he undertakes to rescue a beautiful woman from her abusive husband. he gets support and guidance from old friends, including his secretary, a janitor/photographer,  and a nurse at the hospital; and from new friends like big d, something of a giant special-ops samurai, and big d's antique dealer boss, carl. by the end of the book, chance is taking charge of his life, he has charisma, and he has values: for example, he defies the lawyers who hired him to declare an old doc incompetent to manage money. he declares the old guy competent.a contemporary existential novel about going from alienated to engaged, about finding meaning and values, and acting on them.oh, and it's a thriller and a romance, too!i admit that i, too, was skeptical at first. unlike, say, 'tijuana straits,' which starts with a bang, this is not the easiest novel to get into.  it follows chance's point of view so closely that i felt at first distanced by all the intellectualization and doubt. i hung in there becuase his previous novels are so great. indeed, the ambience wakes up right along with chance; and the last 50 pages become, like our doctor hero, very very lively and engaging. nunn just nails the ending.(don't waste your time on the tv series. very disappointing. doubles the violence and takes away all of chance's humanity and makes him creepy - and makes the woman creepy, too)."}, {"review_sentiment": 5.0, "review_text": "I loved this novel.  I like a psychological thriller, and this novel kept me on the edge of my seat.  The plot of this book was well developed.  There were times that as the reader you could predict what might happen, and you were right; but just as many occurrences where you were caught by total surprise.  I enjoy a healthy amount of both because there is enough surprise to keep you engaged, but enough predictability to keep you from getting confused."}, {"review_sentiment": 5.0, "review_text": "intricate plot, graphic violence good story"}]}, "authors": ["Kem Nunn"], "isbn": "0743289293", "longitude": -122.4192363, "periods": ["2000s", "Recent Releases"], "title": "Chance: A Novel", "word_cloud": "hat rule write style choppy easy find read thing multiple time always nor psychiatrist main character chance also neurologist beset multiple direction pressure cooker experience soon ex place high demand divorce set ultra expensive housing cost alone cripple extra job evaluate lot strange messy case try enough walk beautiful woman marry homicide detective patient become obsessed meet multi skilled veteran help make extra money side dubious venture antique furniture moral compass dip venture veteran lot life skill many interest creative twist also make quite good tv adaptation call star quite good purchase watch series hop story bring life character add something great well write story unfortunately appear script writer copy almost word word nothing extra add rarity come novel turn overall great story expect provide disappointed twisty thriller literary style high hope describe not remotely league pack filler really superfluous write style juvenile keep read see end main story even disappointing spoiler start doctor chance waste life evaluate brain damage write report typically lawyer pay prefer undertakes rescue beautiful woman abusive husband get support guidance old friend include secretary nurse hospital new friend big something giant samurai big antique dealer carl end chance take charge life charisma value example defies lawyer hire declare old doc incompetent manage money declare old guy contemporary existential go alienate engaged find mean value act thriller romance admit skeptical first say strait start bang easiest get follow chance point view closely felt first distance intellectualization doubt hung because previous novel great indeed ambiance wake right along chance last page become doctor hero lively engage nun nail end waste time tv series disappointing double violence take away chance humanity make creepy make woman creepy love like psychological thriller keep edge seat plot well develop time right many occurrence catch total surprise enjoy healthy amount enough surprise engage enough predictability get confused intricate plot graphic violence good story", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "From Los Angeles Times Book Prize winner Kem Nunn and “principal heir to the tradition of Raymond Chandler and Nathanael West” (The Washington Post)—an intense psychological suspense novel about a San Francisco neuropsychiatrist who becomes sexually involved with a woman suffering from multiple personality disorder, whose pathological ex-husband is an Oakland homicide detective.\r\n\r\nA dark tale involving psychiatric mystery, sexual obsession, fractured identities, and terrifyingly realistic violence—Chance is set amid the back streets of California’s Bay Area, far from the cleansing breezes of the ocean. Dr. Eldon Chance, a neuropsychiatrist, is a man primed for spectacular ruin. Into Dr. Chance’s blighted life walks Jaclyn Blackstone, the abused, attractive wife of an Oakland homicide detective, a violent and jealous man. Jaclyn appears to be suffering from a dissociative identity disorder. In time, Chance will fall into bed with her—or is it with her alter ego, the voracious and volatile Jackie Black? The not-so-good doctor, despite his professional training, isn’t quite sure—and thereby hangs his fascination with her. Meanwhile, Chance also meets a young man named D, a self-styled, streetwise philosopher skilled in the art of the blade. It is around this trio of unique and dangerous individuals that long guarded secrets begin to unravel, obsessions grow, and the doctor’s carefully arranged life comes to the brink of implosion.\r\n\r\nAmid San Francisco’s fluid, ever-shifting fog, in the cool, gray city of love, Dr. Chance will at last be forced to live up to his name. Chance is a twisted, harrowing, and impossible-to-put-down head trip through the fun house of fate, mesmerizing until the very last page.", "asin": "0743289293", "rank": "840645", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51aKnke4woL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}