{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 223, "rating": 3.4, "reviews": [{"review_sentiment": 2.0, "review_text": "The book was recommended to me by a friend...I can't say that the style of writing is within my realm of liking. The characters are not very interesting nor is the plot.Lacking in many forms."}, {"review_sentiment": 5.0, "review_text": "In a sense a foundation work for those who are reading contemporary literature. She is not overrated."}, {"review_sentiment": 4.0, "review_text": "Ali weaves a subtle narrative that explodes like Nazneen's life. Racism, disillusionment, free will vs predestination -- Ali tackles some huge topics without breaking a sweat.This is one of the few books I've read twice. I'll admit, the first time I read it I just didn't get it. But the second time I took my time, and discovered the little details of how well told this story is. Nazneen basically never got to be a teenager...and out of nowhere she explodes and blooms and embraces life in a way her husband and fate never would allow. Hasina is the patron saint of getting kicked around and never truly giving up hope. And even the husband Chanu is a complex character -- for all of his faults and genuinely pigheaded behavior, he's kinda stuck in a trap of expectations.The very last scene is overbearingly cornball and nearly derails the whole darn enterprise, but I get why it's there. Still was such a silly way to end a very moving and serious novel."}, {"review_sentiment": 5.0, "review_text": "Well written book.  It was assigned for reading in my class.  I probably didn't have to read the whole thing, but it was quite interesting."}, {"review_sentiment": 4.0, "review_text": "Thank you very much the book was in great shape and I enjoyed the reading.  Amazon your outstanding!"}, {"review_sentiment": 4.0, "review_text": "A best-seller in England, this book made me want to celebrate the indomitable human spirit and explore the immigrant experience. It’s another book that triumphs the strength of powerful women and how they get that way.  It’s depressing, it’s beautiful, and you should not miss it. It’s as colorful as a sari, as bitter as a cup of tea with the teabag left in too long."}, {"review_sentiment": 4.0, "review_text": "Excellent debut novel. Explores themes of belonging and assimilation."}, {"review_sentiment": 3.0, "review_text": "good but slow and a bit ponderous."}, {"review_sentiment": 4.0, "review_text": "Fascinating novel which relates to events that really took place. It explains the wishes and disappointments of migrants."}, {"review_sentiment": 2.0, "review_text": "I wanted to like this book but just couldn't. It seemed to take forever to get where it was going and even at the end I had to questionwhat so many pages had achieved."}]}, "authors": ["Monica Ali"], "isbn": "0743243315", "longitude": -0.12574, "periods": ["1900s"], "title": "Brick Lane: A Novel", "word_cloud": "recommended friend style write realm like character interest many form sense foundation work read contemporary literature overrate weave subtle narrative explodes life disillusionment free v predestination tackle huge topic break twice admit first time get second time take time discover little detail well tell story basically never get teenager nowhere explode bloom embrace life way husband fate never patron saint get kick never truly give hope even complex character fault genuinely pigheaded behavior stick trap last scene overbearingly cornball nearly derails whole darn enterprise get still silly way end move serious well write assign read class probably whole thing quite interesting thank much great shape enjoy read outstanding make want celebrate indomitable human spirit explore immigrant experience triumph strength powerful woman get way depress beautiful miss colorful sari bitter cup tea teabag leave long excellent debut theme belong assimilation good slow bit ponderous fascinate relate event really take place explain wish disappointment migrant want like seem forever get go even question what many page achieve", "genres": ["Fiction & Literature"], "summary": "“A book you won’t be able to put down. A Bangladeshi immigrant in London is torn between the kind, tedious older husband with whom she has an arranged marriage (and children) and the fiery political activist she lusts after. A novel that’s multi-continental, richly detailed and elegantly crafted.” —Curtis Sittenfeld, author of Sisterland\r\n\r\nAfter an arranged marriage to Chanu, a man twenty years older, Nazneen is taken to London, leaving her home and heart in the Bangladeshi village where she was born. Her new world is full of mysteries. How can she cross the road without being hit by a car (an operation akin to dodging raindrops in the monsoon)? What is the secret of her bullying neighbor Mrs. Islam? What is a Hell's Angel? And how must she comfort the naïve and disillusioned Chanu?\r\n\r\nAs a good Muslim girl, Nazneen struggles to not question why things happen. She submits, as she must, to Fate and devotes herself to her husband and daughters. Yet to her amazement, she begins an affair with a handsome young radical, and her erotic awakening throws her old certainties into chaos.\r\n\r\nMonica Ali’s splendid novel is about journeys both external and internal, where the marvelous and the terrifying spiral together.", "asin": "0743243315", "rank": "110176", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51W6004JQML.jpg", "country": "England", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}