{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 124, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book about the history of Florida."}, {"review_sentiment": 1.0, "review_text": "If you want to read a FABULOUS historical fiction on Florida and the Everglades read , A LAND REMEMBERED by Patrick D. Smith. THE SWAMP was factual but did not go over well with  our book club of 40."}, {"review_sentiment": 5.0, "review_text": "I learned of this book after finding the author on Politico and Twitter and appreciating his writing. This is a terrific book, thoroughly researched  and written with sharp, vivid journalistic language (i.e., not dry). It's a page turner, with lots to say about nature, history and politics. The story it tells is wide-ranging, gripping, and ultimately tragic, and the message could not be more urgent. Most highly recommended!"}, {"review_sentiment": 5.0, "review_text": "Great book. I wish I had read it while I was touring in the Everglades. The history and facts are just astounding. I would like to think that this would wake up some folks and help save what is left."}, {"review_sentiment": 5.0, "review_text": "Very interesting read on the Everglades."}, {"review_sentiment": 4.0, "review_text": "Current policies (2017) seem to worsen the Everglades already doomed future, but there is always hope! Long live to the Everglades!"}, {"review_sentiment": 5.0, "review_text": "I read and enjoyed this book - every page of it!  Just don't get in a hurry to consume it as you would a work of fiction.  It was recommended to me by residents of the area and their enthusiasm for it compelled me to order it. I hope some day to meet this author and congratulate him on the excellence of his unbiased and comprehensive coverage of the subject of the everglades."}, {"review_sentiment": 4.0, "review_text": "A good read for full or part time residents interested in your environs."}, {"review_sentiment": 4.0, "review_text": "It was a good overview of the history of the Everglades since Florida's founding and the problems it still faces"}, {"review_sentiment": 5.0, "review_text": "Best book I ever read! It reads like a Ken Burns documentary. It's worth reading a few times. Lots of facts and it's sad to see how greed and corruption played a part to ruin our fragile and unique Everglades."}]}, "authors": ["Michael Grunwald"], "isbn": "0743251075", "longitude": -80.1936589, "periods": ["1900s", "2000s", "Recent Releases"], "title": "The Swamp: The Everglades, Florida, and the Politics of Paradise", "word_cloud": "history want historical fiction factual go well club learn find author appreciate write terrific thoroughly research write sharp vivid journalistic language dry turner lot say nature history story tell grip ultimately tragic message most highly recommended wish tour history facts astound folk help leave very interesting everglades current policy seem worsen already doom future always hope live everglades enjoy page hurry consume fiction recommend resident area enthusiasm compel order hope day author congratulate excellence unbiased comprehensive coverage subject everglades good full part time resident interested environs good overview history founding problem still face best ever read documentary worth read time facts sad see greed corruption play part ruin fragile unique", "genres": ["History", "Science & Nature", "Politics"], "summary": "The Everglades was once reviled as a liquid wasteland, and Americans dreamed of draining it. Now it is revered as a national treasure, and Americans have launched the largest environmental project in history to try to save it.\r\n\r\nThe Swamp is the stunning story of the destruction and possible resurrection of the Everglades, the saga of man's abuse of nature in southern Florida and his unprecedented efforts to make amends. Michael Grunwald, a prize-winning national reporter for The Washington Post, takes readers on a riveting journey from the Ice Ages to the present, illuminating the natural, social and political history of one of America's most beguiling but least understood patches of land.\r\n\r\nThe Everglades was America's last frontier, a wild country long after the West was won. Grunwald chronicles how a series of visionaries tried to drain and “reclaim” it, and how Mother Nature refused to bend to their will; in the most harrowing tale, a 1928 hurricane drowned 2,500 people in the Everglades. But the Army Corps of Engineers finally tamed the beast with levees and canals, converting half the Everglades into sprawling suburbs and sugar plantations. And though the southern Everglades was preserved as a national park, it soon deteriorated into an ecological mess. The River of Grass stopped flowing, and 90 percent of its wading birds vanished.\r\n\r\nNow America wants its swamp back. Grunwald shows how a new breed of visionaries transformed Everglades politics, producing the $8 billion rescue plan. That plan is already the blueprint for a new worldwide era of ecosystem restoration. And this book is a cautionary tale for that era. Through gripping narrative and dogged reporting, Grunwald shows how the Everglades is still threatened by the same hubris, greed and well-intentioned folly that led to its decline.", "asin": "0743251075", "rank": "46702", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51ktuzJvlPL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}