{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 497, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "A fascinating historical fiction on End Roman Republic times...all the major characters of that time make an appearance and the writer clearly did much research on the topic. What can get a bit dry at times is the typical political scheming which you begin to expect and assume; especially if you are familiar with Roman history of this particular time. Great read though and worth purchasing."}, {"review_sentiment": 5.0, "review_text": "Great read"}, {"review_sentiment": 5.0, "review_text": "I found this historical fiction novel fascinating enough to buy and buy  #2 in the trilogy with plans to buy #3.  The more I listened about one of the great politicians of the Roman Empire, Marcus Cicero, known as one of the greatest orators of all time, I the more I thought that no matter how fast we can travel and how many fancy toys and gadgets we can buy, humans haven’t evolved at all. The politics, manipulation, backstabbing that Marcus Cicero dealt with and had to survive is no different from world politics today and especially as rotten as Washington DC with Donald Trump in the White House and the GOP controlling both Houses of Congress, the U.S. Supreme Court, and the presidency.  Corruption and bribery ruled the Roman Empire and it still rules the United States today. Rome was ruled by the rich and powerful by fooling and manipulating Roman citizens just like the U.S. is ruled today.  I bought my copy of this novel from Half Price Books"}, {"review_sentiment": 5.0, "review_text": "Quite Enjoyable, with lots of historic tidbits tossed in."}, {"review_sentiment": 4.0, "review_text": "I liked Imperium a lot. it gives the reader great insight as to how the Roman system was run. it wasn't an absolute page turner but I found it to be a good friend to relax with."}, {"review_sentiment": 5.0, "review_text": "Great read!"}, {"review_sentiment": 4.0, "review_text": "Well written with interesting insights and conclusions."}, {"review_sentiment": 5.0, "review_text": "You might be wondering, should I read Robert Harris’s “Imperium” or should I read Colleen McCullough’s “First Man in Rome”?  Or maybe you have already decided to read both books, but you are wondering which one to read first.  Both of them are first-rate books of historical fiction.Colleen McCullough’s book is the initial book of a seven-volume series.  It is 750 pages, meticulously-researched, and very scholarly.  The book’s action covers the period from 110 BCE to 100 BCE.  You will come away from this erudite novel feeling much smarter than before, and much more knowledgeable about Marius, Sulla and the politics and political machinations of the Late Republic.  It will stand the test of time and will surely be read by students of the Classics for decades.  As a book that brings to life the Roman world, I cannot imagine that it could ever be surpassed.Robert Harris’s book is the initial book of a three-volume series.  It is 300 pages, also assiduously-researched and covers the life and times of Cicero, specifically the period from 79 BCE to 64 BCE.  (The later years of his life are covered in books two and three of the series.)  Harris's book is refreshingly written in the first person, relatively unusual for historical fiction.  It is part detective story, part courtroom drama and part political intrigue.  The narrative is electrifying, the style is fast-paced, and starting from the very first page I had a difficult time putting the book down.Which one should you read first, Harris or McCullough?  A true “Buridan’s donkey” dilemma!"}, {"review_sentiment": 5.0, "review_text": "Gripping"}, {"review_sentiment": 5.0, "review_text": "Great read!  I've enjoyed Robert Harris' work."}]}, "authors": ["Robert Harris"], "isbn": "0743498666", "longitude": 12.4829321, "periods": ["0-500s"], "title": "Imperium: A Novel of Ancient Rome", "word_cloud": "fascinating historical fiction time major character time make appearance writer clearly much research topic bit dry time typical political scheming begin expect especially familiar history particular time worth purchasing great find historical fiction fascinate enough buy trilogy plan buy listen great politician know greatest orator time think matter fast travel many fancy toy gadget buy human evolve politics manipulation backstabbing deal survive different world politics today especially rotten control presidency bribery rule still rule today rule rich powerful fool manipulate citizen rule today buy copy quite enjoyable lot historic tidbit toss like lot give great insight system absolute page turner find good friend relax great well write interesting insight conclusion wonder maybe already decide wonder first historical initial series page scholarly action cover period come away erudite feeling much smarter much knowledgeable politics political machination test time surely student decade brings life world imagine ever initial series page also cover life time specifically period later year life cover series refreshingly write first person relatively unusual historical fiction part detective story part courtroom drama part political intrigue narrative electrifying style start first page difficult time put first true donkey dilemma grip enjoy work", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "Ancient Rome"], "summary": "From the bestselling author of Fatherland and Pompeii, comes the first novel of a trilogy about the struggle for power in ancient Rome.\r\n\r\nIn his “most accomplished work to date” (Los Angeles Times), master of historical fiction Robert Harris lures readers back in time to the compelling life of Roman Senator Marcus Cicero. The re-creation of a vanished biography written by his household slave and righthand man, Tiro, Imperium follows Cicero’s extraordinary struggle to attain supreme power in Rome.\r\n\r\nOn a cold November morning, Tiro opens the door to find a terrified, bedraggled stranger begging for help. Once a Sicilian aristocrat, the man was robbed by the corrupt Roman governor, Verres, who is now trying to convict him under false pretenses and sentence him to a violent death. The man claims that only the great senator Marcus Cicero, one of Rome’s most ambitious lawyers and spellbinding orators, can bring him justice in a crooked society manipulated by the villainous governor. But for Cicero, it is a chance to prove himself worthy of absolute power. \r\n\r\nWhat follows is one of the most gripping courtroom dramas in history, and the beginning of a quest for political glory by a man who fought his way to the top using only his voice—defeating the most daunting figures in Roman history.", "asin": "0743498666", "rank": "52423", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51WftDWNXLL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}