{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 6451, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "good"}, {"review_sentiment": 5.0, "review_text": "Purchased as gift."}, {"review_sentiment": 5.0, "review_text": "Great book!"}, {"review_sentiment": 1.0, "review_text": "Book was in great condition. I jut hate the book that’s all"}, {"review_sentiment": 1.0, "review_text": "No me gustó para nada el libro! Me pareció aburrido y sin sentido! NO lo recomiendo!Definitivamente no es lo que me decían que es!"}, {"review_sentiment": 5.0, "review_text": "Great classic!"}, {"review_sentiment": 5.0, "review_text": "Great read!"}, {"review_sentiment": 5.0, "review_text": "Great, thanks"}, {"review_sentiment": 4.0, "review_text": "(contains some details possibly considered as spoilers)  The Great Gatsby by F. Scott Fitzgerald is a very well written American classic novel. This fine piece of literature is worth the read. My review of this book is four stars. The Great Gatsby is the first F. Scott Fitzgerald book I have read, and it has made an impression on me. This book has caused me to look into more novels written by him.  The Great Gatsby was published in April of 1925, almost 93 years ago. Yet this book is still read and praised in school and libraries across America. And even had several movies dedicated to it. Fitzgerald's style is mostly realistic fiction. He often approaches the darker, less glamorous aspects of human lifestyles in the 1920s, issues prevalent in today’s time worldwide. Like alcoholism, marital issues, scandal, and the effects of wealth.  The book details the later life of a wealthy man who goes by the name Jay Gatsby through the eyes of the narrator Nick Carraway. Who moves to the West Egg, a place in Long Island, New York. Nick happens to be Jay’s neighbor and soon discovers Jay is in love with his cousin Daisy. But Daisy so happens to be married to Tom Buchanan. Causing a fervid love triangle. A common plot we see in books today. The way the book is told makes it original with another character in the story narrating about the main character. The story is authentic and was geographically accurate.  Another reason I enjoyed the book was the well thought out characters. While there is no significant character development, the characters have very different personalities from one another. Since the characters have very distinct natures relating to them can be a challenge.  After I finished the book, I discovered a moral. That money can’t buy your dream of true love. Since Jay couldn’t marry Daisy, he became wealthy and thought to woo her with extravagant parties. But his money couldn’t buy him a future with Daisy. I recommend this book to people who have a soft spot for an American classic, tragic love story. Or if you're interested in something new, this is the novel for you as well. This is a nice read that will not take much of your time and will leave you pondering of what could have been."}, {"review_sentiment": 3.0, "review_text": "The product is good.  What I have a problem with is the shipping, it was supposed to arrive on a Saturday and it was scanned by the carrier delivered that day at 2ish pm.  And nothing, it was actually delivered until the next day."}]}, "authors": ["F. Scott Fitzgerald"], "isbn": "0743273567", "longitude": 0.0, "periods": ["1900s"], "title": "The Great Gatsby", "word_cloud": "good purchase gift condition jut hate gust para dada e pareció burrito sin sentido lo recommend es lo we deccan we e classic thanks contains detail possibly consider spoiler well write american classic fine piece literature review star first make impression cause look novel write publish almost year ago yet still praised school library even several movie dedicate style mostly realistic fiction often approach darker le glamorous aspect human lifestyle issue prevalent today time alcoholism marital issue scandal effect wealth detail later life wealthy man go name eye narrator move place happen neighbor soon discovers love cousin happen married fervid love triangle common plot see today way tell make original character story narrate main character story authentic geographically accurate reason enjoy well think character significant character development character different personality character distinct nature relate challenge finish discover moral money dream true love become wealthy thought woo extravagant party money buy future recommend people soft spot american classic tragic love story interested something new well nice much time leave pondering product good problem shipping suppose arrive scan carrier deliver day pm nothing actually deliver next day", "genres": ["Fiction & Literature"], "summary": "F. Scott Fitzgerald&#039;s classic novel of the Jazz Age.\r\n\r\nIn The Great Gatsby, F. Scott Fitzgerald captures the flamboyance, the carelessness and the cruelty of the wealthy during America&#039;s Jazz Age.\r\n\r\nThe Great Gatsby lives mysteriously in a luxurious Long Island mansion, playing lavish host to hundreds of people. And yet no one seems to know him or how he became so rich. He is rumoured to be everything from a German spy to a war hero. People clamour for invitations to his wild parties. But Jay Gatsby doesn&#039;t heed them. He cares for one person alone - Daisy Buchanan, the woman he has waited for all his life. Little does he know that his infatuation will lead to tragedy and end in murder.\r\n", "asin": "0743273567", "rank": "467", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51khWutZqCL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}