{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 270, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Nothing but the facts. Fast delivery. Thanks. Good find"}, {"review_sentiment": 5.0, "review_text": "While everyone wants to make history clear-cut and simple, the fact is that it is anything but simple, and even beyond extremely complex.The main thing that we all need to keep firmly in mind is that both Germany and Japan were controlled by people intent on world domination, and with hatred for the U.S. particularly, as a free, Capitalistic government, which was anathema to their attitude of how to obtain what you want from other nations - namely, taking it by force, and killing as many of the resisters as necessary to do it.Being a nation of free people, who had only fairly recently lost a great many sons and brothers and husbands in a previous European war, we definitely did not want to do it all over again, and provide fresh meat for the grinder of war in Europe.And so, Roosevelt was faced with a monumental problem:  How to alert the U.S. population to the very real dangers of Hitler and Hirohito, which they steadfastly refused to confront, in spite of the fact that both Germany and Japan were slaughtering millions of people already.The predominant anti-war attitude in the U.S. was that we didn't want to get involved, never mind that England was on the verge of being totally annihilated.The anti-war fever was so pervasive, he couldn't even get the congress to go along with beefing up our defense situation, which was worse than pathetic: We had an Army about as big as Ethiopia's, and practiced war games by dropping bags of flour out of a biplane, trying to hit a pickup truck with a stovepipe sticking out of the back, to simulate a tank.Our soldiers drilled with wooden sticks, instead of rifles.Our Navy was about half the size of Japan's, and their ships were all bigger than ours, and more modern.We foolishly believed that the Atlantic and Pacific Oceans sheltered us from any personal danger, and we were not about to commit our precious men and treasure to preserve Great Britain, even though they were on the very brink of complete collapse.Another thing that we often forget to consider is that we were coming off of a decade of pure economic deprivation, due to the Great Depression, which had devastated the financial situation of virtually every American worker - who was actually a worker in name only, because he couldn't find a job to earn any money.So an oppressive feeling of quiet desperation, added to the ominous thoughts of the likely approach of war, definitely colored the outlook of every American during that time.My personal belief is that FDR knew full well, far in advance, of exactly what Japan's intentions were, but probably had no idea that they were capable of inflicting anything like as much damage as they ultimately did do.Being a former Navy man, and a loyal American, the last thing he would want to do would be to put any American sailor or soldier in danger, but keeping the secret of our penetration of the Japanese code was paramount.The big question, which I have never seen explored: Was it actually an act of extremely fortunate happenstance that our aircraft carriers just happened to be away from the scene of the carnage, and were preserved to strike back later?The biggest mitigating factor in Roosevelt's favor was just that it is inconceivable that he would deliberately sacrifice the very means we had to defend ourselves - namely, our Navy ships - to assure that we kept the secret of having broken the Japanese code.And if the carriers being out of the picture was really just a fluke, and they might have also been docked at Pearl Harbor when the attack occurred, we would have been literally finished before we could even get started.To all appearances, it seems that they were aware that Pearl Harbor was definitely the target, but they could only hope that the attack was not too severe, and that we could withstand it fairly easily.Surely, nobody expected that any attack would be as massive as it turned out to be, and that it would result in virtually destroying our entire fleet.Monday morning quarterbacking is very easy to do, and also very tempting - inasmuch as we know all the answers, whereas before the fact, we wouldn't even know precisely which questions to ask.The bottom line seems to be that we had to induce Japan to make the first move, but we had absolutely no idea that they would strike so viciously, and efficiently, and almost succeed in doing what their intention was to do:  Deal us a death blow in the first strike.After reading several different accounts of what actually happened on Dec 7, 1941, it would appear that there was more than enough information received that would definitely spotlight Pearl Harbor, and the only question was how severe the attack would be.In a worst-case scenario, if they did launch an all-out attack, it would appear that the battleships - all of which were already either obsolete or obsolescent - were to be sacrificed, but that the carriers were either accounted for in far away locations, or were sent on missions designed to get them away from the scene of the devastation.And that is exactly what they did.  Except it was far worse than a \"worst-case scenario.\"They not only attacked Pearl Harbor, they also attacked Guam.  And Midway.  And the Philippines, Shanghai, Hong Kong, North Borneo, Dutch East Indies, Malaya, Thailand, and Wake Island.Who could have possibly known all this was coming, and have been able to do anything about it?We could not acknowledge that we knew of Japan's intentions, because to do so would be to betray the fact that we had broken their code.Besides, we were in no position to challenge them, and especially while we were still officially not at war, and wouldn't be until their had been an outbreak of hostilities, initiated by them.And so we were between  rock and a hard place.Just as at Midway, 6 months later, Lady Luck would play a big role in our fortunes of war:  The Japanese didn't attack the oil supplies or repair facilities at Peal Harbor, and we got supremely lucky in the timing of the arrival of our dive bombers at Midway.On both occasions, we were very fortunate, to say the least.What we always have to keep in mind was that Japan was extremely secretive, and we had very little intelligence as to what they had in the way of battleships and carriers.Even the advanced performance of the Zeroes seemed to come as a complete surprise, even though it shouldn't have - because Japan had already been savaging China for a couple of years, and the capabilities of the Zeroes should have been apparent, if in fact anybody had been paying attention.But it appears that the first showing of the Zero was at Coral Sea, which was after the China action, but just before Midway, so maybe they were brand new, and this was their first appearance.At any rate, we were just becoming aware of the abilities of the Zero, which nobody expected.It's hard to imagine today, in this era of virtually instant communication, but it was a completely different world in 1941.  Even radio - which we think of as being extremely ancient and old-fashioned - was a relatively new invention at that time.It wasn't really \"radio,\" as we think of radio today; it was the dit-dit-dot, or Morse code; the telegrapher's code, which had been around for a long time - but transmitted by radio signal - without the wiresTV wouldn't even exist for another decade, and the intelligence and electronics communications networks had yet to be formed.The modern, instant communications that we take for granted today, which permit easy cooperation between navy ships, or army units, for example, existed only in a science-fiction writer's mind.In fact, even radio was so new in 1941 that Japan had virtually no radio communication between ships, or between planes of their carriers and the carrier itself.  Even the few ships that did have radio, it was very rudimentary, and unreliable, and they didn't nave much trust in it.Communication between ships was almost all visual:  They primarily used semaphores, or flag-waving, of which they had a large variety of various flags, all sending different messages.  They had to be close enough to each other to be able to see, through binoculars, what was being sent.  They also used signal lights, or flashing lamps, sending Morse code signals.There was no such thing as long-range radar, or direction finding GPS systems.Some of these things were only just at that time first being introduced, and the U.S. was probably a forerunner of a lot of the electronic intelligence systems, which got better as each month passed, and new technologies were introduced.But the big thing to always remember is that we were at peace, with a Navy that was second-rate to Japan, and an almost non-existent Army.Japan, meanwhile, was already on a completely armed and active war footing, and just chomping at the bit to deal us a death blow.And the ominous part of the picture was that they had the horses, and we didn't.We had to virtually tiptoe around, dancing to the tune Japan was calling, because the people of the U.S. were very wary of spending any money for military preparedness - because they didn't want any part of another war, and they seemed to think that wishing it away would make it go away.Both Germany and Japan were already fully armed, and in the daily business of brutally killing millions of people, and the U.S. sat complacently by, determined to pretend that we were somehow immune from any harm.Even just gearing up our vast industrial potential to produce war materiel was hamstrung by getting enough agreement in the congress to do what we needed to do, to be even competitive at all in any kind of war footing.Meanwhile, Germany and Japan were both running hard and fast, to completely dominate the world.And so, even though we had strong indications that they were planning an attack, we had no possible way of knowing exactly where they might strike, or how intensely.In any event, even in the carrier scenario, we were woefully undermanned and outgunned in virtually every department of naval power, not only in the number and size of our battleships compared to Japan, but also the same dismal ratio with the carrier situation.This was in addition to having aircraft which were all drastically inferior to the vaunted Zero, which spelled out the hopelessness of our position.Given the overwhelming strength of both Germany and Japan, and the aggressiveness with which they were both pursuing their goal of world domination, the U.S. was the only hope for freedom.Great Britain was all but finished; broke, and low on manpower.The American people were the biggest enemy that the U.S.A. had, because every way Roosevelt tried to turn, he was met with \"no.\"Only a highly confident and very skilled man in the driver's seat could have guided this country out of the quagmire of defeat, and into the sunlight of victory.But while it was catastrophic for us to have lost not only the men, but the battleships that were sunk or ruined, the only possible saving grace of the whole situation turned out to be - although it had not been shown prior to this precise time period, which was only months away in the future - that the battleship had become almost totally anachronistic and outdated, and the carrier's time was definitely upon us.Which we were only to discover in the upcoming months and weeks, with the action at Midway.One thing that stacked the deck against any possibility of victory for the U.S. was the fact that our torpedoes, which the torpedo planes carried to attack the Japanese ships, were defective, and either completely missed the target or did not explode - which we didn't learn until after the fact, and after all our torpedo plane pilots were dead.Any way you look at it, we were in a very vulnerable position.  From the perspective of military preparedness, we were toast, for all practical purposes.Of course, with the Pearl Harbor attack, Japan had already given us the first, very rude lesson in the superiority of the carrier, which we were later to confirm, in spades, at Midway.This was definitely a \"do or die\" exercise, by our outmanned and outgunned Navy fleet.  We had to shoot as if every bomb and every bullet counted - because it did.If one wanted to question whether the disaster at Pearl Harbor was worth our not tipping our hand about breaking the Japanese code, it all paid off in one fell swoop:  One frantic afternoon at Midway, and everything fell into place, and the balance of power switched - dramatically - from Rising Sun to Good Old U.S.A.I find it deliciously ironic that what they did to us at Pearl Harbor, where their intention was to completely obliterate our naval capability, we turned around and did to them - much more completely and effectively than they had done to us - which in essence sealed their fate at that moment, even if they, and even we, did not know it at the time.They call it the \"Miracle At Midway,\" and there is almost no other way to describe it.  By all rights, we should not have won.  We were outmanned and outgunned, and should have been easily defeated - but that's not the way it turned out.What actually did happen is that we sunk four of their carriers - all four, that they had sent to wipe out the \"pesky American carriers\" once and for all, and shot down all of their planes - 248 of them.Just to add the whipped cream topping - with maybe even a cherry on top - this all happened with our existing forces - the ones that were totally outmanned and outgunned by Japan - and did not depend on what ultimately happened in the future:  We did gear up for massive arms production, and designed and built planes that put the illustrious Zero to shame, and flooded the oceans with glorious carriers, subs, and all manner of other naval vessels, and proceeded to dominate the Pacific, and completely rid the Atlantic of Hitler's cowardly U-boats, and return the citizens of the earth to sanity and decency.Huda thunket?  This shouldn't have happened, but it did.This made a serious dent in the \"superior Japanese Navy\" picture, and went a long way toward \"leveling the playing field.\"In fact, this was the beginning of a downward spiral for Japan, because their Navy was everything to them, since they were an island nation, and the sea was their natural environment - which they were very comfortable with, and thought that they had mastered.To add to the irony, just remember that at Pearl Harbor we were \"asleep at the switch,\" both literally and figuratively, it being early on Sunday morning, when we were mostly still in bed, with our ammunition in the storage bins under lock and key, and the Japanese sucker-punched us almost to total elimination, while what we did to them at Midway was under full combat conditions on both sides.But even then, they were in the midst of another sneak-attack, and we just beat them to the punch.Not that Midway was the end of the Pacific war, by any stretch of the imagination, but at least you could safely say that it was the beginning of the end.Just the sheer size and number of ships manned by Japan should have told us immediately that we were totally outclassed, which we had allowed ourselves to sink to, given the mind-set of the American population.Maybe people thought that if you were sufficiently anti-war, just avoiding building up any sort of defensive capability would insulate you against ever needing it.That's called \"head-in-the-sand syndrome.\"  Ostriches do that.And so, although probably every word in this book is absolutely true, that doesn't cause me to regard Roosevelt as a bad guy, or a traitor, or anything but a very brilliant leader, who was faced with an impossible set of circumstances, and who somehow was able to orchestrate it all into a victorious ending, even though the cost was incredibly high.And this all coming from a man who couldn't even get up out of his chair.But we persevered, and, thank God, we prevailed.Just think about the alternative:  We could have lost even more people, and we might have lost not only the war, but our country as well.Not only was that scenario possible, it was precisely what Japan - and Hitler - had in mind."}, {"review_sentiment": 5.0, "review_text": "An excellent book that thoroughly documents that FDR knew the attack was coming and chose to let it happen in order to achieve his strategic objective of getting the US into the War.  It will be hard to take for readers who look simplistically at Pearl Harbor as an isolated event.  These people will say that if FDR could have saved a few thousand American lives, a a cost of perhaps millions of non-American lives, or even hundreds of thousands of American lives if the US had entered the War a few years later, then he should have alerted the island's defenders.  FDR was not that stupid.  He was able to think strategically.  In this case, he did the right thing. In the case of 9/11, the US government tried to think strategically and create a \"new Pearl Harbor,\" but their motives were pure evil."}, {"review_sentiment": 3.0, "review_text": "Sad if true."}, {"review_sentiment": 5.0, "review_text": "The author presents an unbiased and very well researched and documented  case that FDR adopted policies well in advance of Pearl Harbor to corner Japan into making a first strike. With the majority of the American people not wanting anything to do with a war in Europe, FDR and his advisors needed a way to enter the war to stop the Axis powers before it was too late. The evidence, in my opinion, clearly shows America pushed Japan into making a first strike, and that many in our government knew days if not weeks before that it was going to be the Fleet at Pearl.  How can you get your country to go to war when they are opposed to it, but you as President and your advisors believe it is critical to American security, and that of the free world, to stop the Axis before it is too late?"}, {"review_sentiment": 5.0, "review_text": "WOW!!"}, {"review_sentiment": 5.0, "review_text": "...a scary look at some of the lies we've been told over the past ~75 years!"}, {"review_sentiment": 5.0, "review_text": "Cool Thanks!"}, {"review_sentiment": 1.0, "review_text": "An interesting book? Yes. Historically accurate? No way. This work is another great example of someone adding 2 plus 2 and getting a bushel of potatoes. There are far better publications that uncover the facts that Stinnett so terribly misuses in this revisionist abortion."}, {"review_sentiment": 3.0, "review_text": "Day of DeceitTo the many uninformed the Japanese attack on Pearl Harbor was a devastating surprise. To those knowledgeable, it was not. Robert B. Stinnett  claims that the US Government carefully orchestrated a series of moves to create this attack. Historians learned that some knowledge or warnings of this were known in advance. Dusko Popov’s 1972 book tells how he and Ian Fleming visited J. Edgar Hoover in July 1941 to tell of Axis interest in the defenses of Pearl Harbor. The author served in the Navy under Lieutenant George Bush, and earned ten battle stars and a Presidential Unit Citation. After he retired as a photographer and journalist in 1986, he devoted his time to research and writing this book.Appendix A has Lieutenant Commander Arthur McCollum’s proposed eight actions of October 7, 1940 designed to provoke Japan into attacking. Allying with Britain, Holland, and China; sending heavy cruisers and submarines to the Orient; keeping the fleet in Hawaii; refuse selling oil to Japan; and a trade embargo with Japan. Stinnett does not question America’s entry into the war, or even the manipulation to force the Japanese attack. He just wanted to reveal what actually happened; a scoop by a reporter. During 1941 a Japanese spy surveyed Pearl Harbor as a target. His last message on December 6 said it was ready for a surprise attack (p.85). All the time he was watched by Naval Intelligence! The FBI wiretapped the telephones of the Japanese consulate (p.86). But Admiral Kimmel was not informed (p.95). In August 1941 this spy established grid coordinates to prepare for the attack. Their transmissions were intercepted and decoded (p.99). Yet Admiral Kimmel and General Short were not informed (p.107). Did a Rear Admiral leave his ship Saturday to be safe at home Sunday (p.111)?In early November 1941 Ambassador Joseph Grew warned that Japan decided on war with America (pp.143 4). After Admiral Kimmel ordered a search for Japanese forces north of Hawaii, the White House countermanded his order (p.145). This book is so rich in details that is can’t be easily summarized here. Except to note that if Kimmel and Short were kept in the loop, the attack on Pearl Harbor would not have been a surprise. The imperialist conflicts between Japan and Britain, China, and Holland spread like a forest fire. But “the United States desires that Japan commit the first overt act” (p.282). The ‘Epilogue’ summarizes this book.This book is refuted by the investigation held in 1945 by Henry Clausen, a Major then Colonel, who was a trial lawyer in civilian life. He found that the original Pearl Harbor investigation was flawed since the military withheld Top Secret information. The truth is that Admiral Kimmel and General Short were derelict in duty, information was withheld or ignored so the military was not prepared for the attack in spite of warnings from Washington. Republican Congressmen revealed the breaking of the Purple Code in an attempt to blame President F. D. Roosevelt and General Marshall! Read the book “Pearl Harbor Final Judgment” for the details.“The Wrath To Come” is the title of an E. Phillips Oppenheim novel written in 1926. Reflecting the politics of that time, this novel suggested a plan for a Japanese attack on Pearl Harbor, and attacks by Germany and Russia along the Atlantic seaboard. But this is fiction."}]}, "authors": ["Robert Stinnett"], "isbn": "0743201299", "longitude": -157.8556764, "periods": ["1900s"], "title": "Day Of Deceit: The Truth About FDR and Pearl Harbor", "word_cloud": "nothing fact delivery find everyone want history simple fact anything simple even extremely main thing need firmly control people intent world domination hatred particularly free capitalistic government anathema attitude want nation namely take force kill many resister necessary nation free people fairly recently lose great many son brother husband previous european war definitely want provide fresh meat grinder war face monumental problem alert population real danger steadfastly refuse confront spite fact slaughter million people predominant attitude want get involve never mind verge totally fever pervasive even congress beef defense situation worse pathetic army big practice war game drop bag flour biplane try hit pickup truck stovepipe stick simulate soldier drill wooden stick instead half size ship bigger foolishly believe shelter personal danger commit precious men treasure even brink complete thing often forget come decade pure economic deprivation due devastate financial situation virtually american worker actually worker name job earn oppressive feeling quiet desperation add ominous thought likely approach war definitely color outlook american personal belief know full well far advance exactly intention probably idea capable inflict anything much damage ultimately former man loyal american last thing sailor soldier danger keep secret penetration japanese code big question never see explore actually act extremely fortunate happenstance aircraft carrier happen scene carnage preserve strike back later biggest mitigating factor favor inconceivable deliberately mean defend namely ship assure keep secret broken japanese carrier picture really fluke also attack occur literally even appearance seem aware definitely target severe fairly nobody expected attack turn virtually destroy entire morning quarterbacking easy also tempt inasmuch know answer whereas fact even precisely question bottom line seem induce make first move absolutely idea viciously efficiently almost intention death blow first read several different account actually happen enough information receive definitely question severe attack launch attack battleship already either obsolete obsolescent sacrifice carrier account far away location send mission design away scene exactly far worse scenario attack also attack possibly come able anything intention fact broken position challenge especially still officially war hostility initiate rock hard month later big role fortune war japanese attack oil supply repair facility get supremely lucky time arrival dive bomber occasion fortunate say always mind extremely secretive little intelligence way battleship advance performance seem come complete surprise even already savage couple year capabilities apparent fact anybody pay appear first show action maybe brand new first rate become aware ability nobody hard imagine today era virtually instant communication completely different world even radio think extremely ancient relatively new invention really radio think radio today code telegrapher code long time transmit radio signal wires tv even decade intelligence electronics communication network yet modern instant communication take grant today permit easy cooperation navy ship army unit example exist writer fact even radio new virtually radio communication ship plan carrier carrier even ship radio rudimentary unreliable nave much trust ship almost primarily use semaphore large variety various flag send different message close enough able see binoculars send also use signal light flash lamp send code thing radar direction find thing time first introduce probably forerunner lot electronic intelligence system get better month pass new technology big thing always peace almost meanwhile already completely arm active war foot chomp bit deal death ominous part picture horse virtually tiptoe dance tune call people wary spending money military preparedness want part war seem think wish away already fully arm daily business brutally kill million people sit complacently determine pretend somehow immune gear vast industrial potential produce war materiel hamstrung get enough agreement congress need even competitive kind war run hard fast completely even strong indication plan attack possible way know exactly event even carrier scenario woefully undermanned outgunned virtually department naval power number size battleship compare also dismal ratio carrier addition aircraft drastically inferior vaunt spell hopelessness overwhelming strength aggressiveness pursue goal world domination hope finish broke low american people biggest enemy way try turn meet only highly confident skilled man driver seat country quagmire defeat sunlight catastrophic lose men battleship sunk ruin possible save grace whole situation turn show prior precise time period month future battleship become almost totally anachronistic outdated carrier time definitely discover upcoming month week action thing stack deck possibility victory fact torpedo torpedo plane carry attack japanese ship defective completely miss target explode learn fact plane pilot way look vulnerable position perspective military preparedness toast practical course attack already give first rude lesson superiority carrier later confirm spade definitely die exercise out manned outgunned fleet shoot bomb bullet count want question disaster tip hand break japanese code pay fell frantic afternoon everything fell place balance power switch dramatically rise good find deliciously ironic intention completely obliterate naval capability turn around much completely effectively do sealed fate moment even even know call almost way describe right out manned outgunned easily defeat way turn actually happen carrier send wipe pesky american carrier shot plane add whipped cream top maybe even cherry top happen exist force one totally out manned outgunned depend ultimately happened future gear massive arm production design build plane put illustrious shame flood ocean glorious carrier sub manner naval vessel proceed dominate completely rid cowardly return citizen earth sanity thunk happen make serious dent superior japanese picture go long way level play field fact begin downward spiral everything island nation sea natural environment comfortable think add irony asleep literally figuratively early morning mostly still bed ammunition storage bin lock key japanese almost total elimination full combat condition even midst beat end war stretch imagination least safely begin sheer size number ship man tell immediately totally outclassed allow sink give american people think sufficiently avoid build sort defensive capability ever need call syndrome probably word absolutely true cause regard bad guy traitor anything brilliant leader face impossible set circumstance somehow able orchestrate victorious end even cost incredibly come man even persevered thank think even people lose war country scenario possible precisely mind excellent thoroughly document know come chose let order achieve strategic objective get hard take reader look simplistically isolate event people say thousand live cost perhaps million life even hundred thousand american life enter year later alert island defender stupid able think strategically case right thing case government try think strategically create new motives pure evil true author present unbiased well research document case adopt policy well advance corner make first strike majority american people want anything war adviser need way enter war stop power late evidence opinion clearly show push make first many government know day week go country war oppose adviser believe critical security free world stop late wow scary look lie tell year cool thanks interesting accurate way work great example someone add get bushel potato far better publication uncover fact terribly misuse revisionist abortion many uninformed japanese attack devastate surprise claim carefully orchestrate series move create attack learn knowledge warning know advance tell visit tell interest defense author serve earn ten battle star presidential retire photographer journalist devote time research write propose action design provoke attack send heavy cruiser submarine keep fleet refuse selling oil trade embargo question entry war even manipulation force japanese attack want reveal actually happen scoop reporter japanese spy survey last message say ready surprise attack time watch wiretapped telephone japanese consulate inform spy establish grid coordinate prepare transmission intercept decode yet inform leave ship safe home early warn decide war order search japanese force north countermand order rich detail easily summarize note keep loop attack imperialist conflict spread forest fire desire commit first overt act summarizes refute investigation hold trial lawyer civilian life find original investigation flaw military withheld information derelict duty information withheld ignore military prepared attack spite warning reveal break attempt blame title write reflect politics time suggest plan japanese attack attack seaboard fiction", "genres": ["History", "WWII"], "summary": "In Day of Deceit, Robert Stinnett delivers the definitive final chapter on America's greatest secret and our worst military disaster.\r\n\r\nDrawing on twenty years of research and access to scores of previously classified documents, Stinnett proves that Pearl Harbor was not an accident, a mere failure of American intelligence, or a brilliant Japanese military coup. \r\n\r\nBy showing that ample warning of the attack was on FDR's desk and, furthermore, that a plan to push Japan into war was initiated at the highest levels of the U.S. government, he ends up profoundly altering our understanding of one of the most significant events in American history.\r\n\r\n\"It is difficult, after reading this copiously documented book, not to wonder about previously unchallenged assumptions about Pearl Harbor.\" The New York Times \r\n", "asin": "0743201299", "rank": "72052", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/518mogsxTiL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}