{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 31.2253441, "ratings": {"num_ratings": 120, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "The war adventures of this British boy from Shanghai are not only gripping and a fascinating read, they also appear as very authentic. It is also very positive that his story is not black and white; The Japanese are not all evil, nor are the Chinese, Brits and Americans all angels. During the chaos of liberation there is a lot of setling of accounts, and in the end, after a lot of bloodshed a happy end of sorts."}, {"review_sentiment": 5.0, "review_text": "Great read, highly recommended. AAAA++++"}, {"review_sentiment": 4.0, "review_text": "good book and movie love it"}, {"review_sentiment": 4.0, "review_text": "An amazing true story of childhood in China during WWII. The writing is wonderful--vivid and descriptive without ever falling back on trite phrases. Gruesome at times--not for kids."}, {"review_sentiment": 5.0, "review_text": "I watched the movie when I was a child and I was in love with it, so I wanted my daughter to read the book and experience it"}, {"review_sentiment": 4.0, "review_text": "I saw the movie first, so my take on the book was...tainted.  That said, it was fun to read the actual facts and events.  Of course, J.G. Ballard went on to write some interesting novels, but, as a young English boy in Shanghai, 1940, he lived the experiences of this book.  Of course, I pictured a young Christian Bale as Jim, and John Malkovich as Basie.  Now, I'm going to watch the movie again to see how Spielberg adapted the book."}, {"review_sentiment": 4.0, "review_text": "Read this while traveling in Japan. Some of Ballard's metaphors and similes are forced."}, {"review_sentiment": 5.0, "review_text": "The sense of place and time are unblinkingly captured.  The hair-trigger mindset of the boy is perfectly captured. Survival, in this book, is everything; it is the only thing.  This is a grand, desperate, beautifully crafted story."}, {"review_sentiment": 3.0, "review_text": "The movie was better than the book, but the movie wasn't so hot either.  This could have been an interesting book -- Shanghai during the war -- but it never went anyplace.  You know, today this happened;  the next day this happened; and so on and so on.  So, it's the story of a kid \"coming of age\" in a Japanese prison camp.  Big deal.  I've read more than a few \"coming of age\" books as well as prison camp books and this doesn't rate very high.  And the main character, Jim, strikes me as a real pain-in-the-ass kid.  His \"coming of age\" takes him from about eleven to, oh, let's say 12...I kept getting the feeling I was missing something but by the time I got to the end of the book (and the movie)  I realized I wasn't missing anything.  I'm sure the book was authentic, but at no time did it spike my emotions or provide me with any real suspense.  After reading the other reviews, I simply have to say that this book is overrated."}, {"review_sentiment": 5.0, "review_text": "Empire du Soleil c'est une aventure formidable, cette histoire-nouvelle de JG Ballard, basée sur ses memoires de Shanghai comme un jeune homme imprisonné pour les japonais au cours de la deuxième guerre mondiale.Actually I ordered Empire of the Sun in English, but was shipped the French version by mistake (although the image for the English version still shows Empire du Soleil), and the book seller promptly refunded my payment."}]}, "authors": ["J. G. Ballard"], "isbn": "0743265238", "longitude": 121.4888922, "periods": ["1900s"], "title": "Empire of the Sun", "word_cloud": "war adventure british boy grip fascinate also appear authentic also positive story black white japanese evil chinese brit angel chaos liberation lot settle account end lot bloodshed happy end sort highly recommend good movie love amazing true story childhood write wonderful vivid descriptive ever fall trite phrase time kid watch movie child love want daughter experience saw movie first say fun actual facts event course go write interesting novel young boy live experience course picture young now go watch movie see adapt travel metaphor simile force sense place time unblinkingly capture mindset boy perfectly capture everything thing grand desperate beautifully craft story movie better movie hot war never go know today happen next day happen story kid come age japanese prison camp deal come age well prison camp rate high main character strike real come age take eleven oh let say keep get feel miss something time get end movie realize miss anything sure authentic time spike emotion provide real suspense read review simply say overrate dew rune venture formidable bette base sir tie memory comm un jejune home pour lech japonais au cur guerre order ship french version image english version still show dew seller promptly refund payment", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "The classic, award-winning novel, made famous by Steven Spielberg’s film, tells of a young boy’s struggle to survive World War II in China.\r\n\r\nJim is separated from his parents in a world at war. To survive, he must find a strength greater than all the events that surround him.\r\n\r\nShanghai, 1941—a city aflame from the fateful torch of Pearl Harbor. In streets full of chaos and corpses, a young British boy searches in vain for his parents. Imprisoned in a Japanese concentration camp, he is witness to the fierce white flash of Nagasaki, as the bomb bellows the end of the war...and the dawn of a blighted world.\r\n\r\nBallard’s enduring novel of war and deprivation, internment camps and death marches, and starvation and survival is an honest coming-of-age tale set in a world thrown utterly out of joint.\r\n\r\n\"An outstanding novel...a classic adventure story.\" The New York Times", "asin": "0743265238", "rank": "103198", "city": "Shanghai", "image": "https://images-na.ssl-images-amazon.com/images/I/41GmFP2zSFL.jpg", "country": "China", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}