{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 101, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Mr. Woodward's and Mr. Bernstein's 'The Final Days' is solid reporting. It was nice to see them also give credit to the others who helped in the book's creation. Published in 1976, the book remains fixed upon describing mostly behind-the-scene actions of President Nixon and key players and avoids giving too much dialogue from the Watergate hearings.In the first 260 pages, it recounts what occurred soon after H.R. Haldeman and John Ehrlichman had been fired and up until July 24, 1974. From that point, it takes the following days on an individual basis until August 9, 1974 when Nixon resigns. It only uses court and congressional hearings' material to help clarify discrepancies between what was said and what actually happened because of President Nixon's actions.The pressure President Nixon was under because of his and his henchmen's actions was immense. The book also shows how his predicament affected his staff and family. At its core, the work is about President Nixon's ego versus the rule of law. There were ongoing concerns about President Nixon's physical and mental health due to the strain. Watergate came to consume much of the White House's energy. The book shows such things as how the indefatigable Alexander Haig successfully held the place together; the egomaniac, Henry Kissinger, constantly posturing for his own personal objectives; how the president's close relationship with Press Secretary Ron Ziegler gave the 35-year-old a great deal of influence; Nixon's unethical manipulations of his attorneys in an effort to save his neck; and, of course, the shenanigans involving the tapes. Thankfully, the book includes a list of the players and their titles for easy reference.I read 'The Final Days' back in the early eighties. It felt like a good time to revisit the book because of special counsel Robert Mueller's current investigation into Trump campaign's collusion with Russia during the 2016 presidential race. I have great concerns while reading the thing because the brain-dead ill-mannered cockatoo who's currently president is much less intelligent or emotionally mature than President Nixon was during his worst days. Our 37th president could have made matters much worse and sent our country into a prolonged Constitutional crisis. When Nixon refused to turn over to the Senate investigation his Oval Office tapes, Tricky Dick's approval rating was at 38 percent. When he left office it was 24 percent. Trump's is currently at 38 percent. Think of all the unethical bombastic lies the egomaniac utters even in one week and add to that his constant erratic nature. I'm soiling my underwear just thinking of what the nimrod will do if Mr. Mueller finds solid dirt on him. 'The Final Days' gave me a feel of what might happen. I need to stock up on Rolaids."}, {"review_sentiment": 4.0, "review_text": "This book contains an amazing amount of detail, but it is a different kind of detail than one might expect. It involves primarily the extremely detailed decision making processes of the various individuals involved in releasing the previously secret tapes made by President Nixon of conversations he had concerning Watergate.The people involved approached the release of the tapes from every possible perspective and tried to anticipate every politically-relevant consequence. Dozens of different officials, lawyers, political figures and others analyzed memos, memos about memos, notes, diaries, recordings and transcripts -- multiple layers and formats of data which they referred to over and over again in reaching their decisions.Some people may find this sort of account tedious, but I followed along in anticipation of the next step. I found myself condemning obviously false steps by some officials while questioning my own substituted judgement at other times. In reading about the decision making processes involved in this book, I learned a great deal about the character and intellect of the persons involved, but also about decision making generally.Watergate is fascinating -- it was the most serious American constitutional crisis since the Civil War (so far) and one of the great triumphs of our political system. This book presents what I presume to be a unique view of Watergate and I am very happy that I read it. The book also presents detailed character studies of various individuals (primarily Nixon, his advisers and his attorneys) and is worth reading for that reason alone.I also commend the authors for including a list of relevant persons at the beginning of the book -- a list to which I constantly referred."}, {"review_sentiment": 4.0, "review_text": "Amazing account of Nixon’s last few months in office."}, {"review_sentiment": 5.0, "review_text": "For those of us already familiar with the facts of Watergate, this riveting account fleshes them out by taking us day by day through the scandal's events and in the process bringing the players to life. We get to know the principals as rounded, complex men and women whose conflicted loyalties both impeded and facilitated the inevitable resignation of the most mysterious and complex character of all, Richard Nixon. Written like a thriller, with Al Haig as the pivotal protagonist, the book portrays Nixon's descent from stubborn determination to solitary brooding to complete collapse as he is overtaken by events and the betrayal of colleagues. For this reader, the book's most interesting aspect was its sympathetic portrayal of people I thought were scoundrels, Patrick Buchanan for one. For those who are interested in a three-dimensional accounting of Watergate, this book is a must-read."}, {"review_sentiment": 5.0, "review_text": "This book, in many ways, is better than All The President's Men. It gives the same intimate, fly-on-the-wall account of Nixon and his inner circle from the events at the end of ATPM up until he leaves the White House. If you're looking for the blue print of modern history as it may repeat itself, look no further. A fantastic read."}, {"review_sentiment": 4.0, "review_text": "Reading this history by Woodward and Bernstein (whom I have great respect!) brings back so many memories.  I can recall exactly where I was on that October Saturday evening when the \"Saturday night massacre was reported.  The book was a great read up until the last 100 or so pages.  Then it became an absolute drag!  It seemed as though someone (lawyers, Haig, family members or politicians) where changing there minds as to whether Nixon should resign or take the issue to the senate EVERY OTHER PARAGRAPH!!  PLEASE!  The rhythm of the story and writing went from interesting to boring!  The last few \"chapters\" or \"days\" (as they are identified in the book seem like \"YEARS\".  GEEZ, didn't the editors tell these two gifted writers to cut-to-the-chase!  I get the writing technique of interesting details that enhance the story but this LEAPED from being interesting to \"watching grass grow\"!!  Considering the authors, I was disappointed.  If someone, like myself, knows the history (i.e Nixon praying with Kissinger, talking with paintings in the White House, etc) I wouldn't bother with this book.  There are no real surprises, just a LONG, strung-out rendition of a painful time in the countries history.  The one idea that occurred to me as I was reading this and watching the news is that HISTORY REPEATING ITSELF!  Woodward and Bernstein may have another book on their hands!"}, {"review_sentiment": 5.0, "review_text": "A fantastic, insightful book! Absolutely recommend, it goes far beyond All the Pres Men and other books associated with Nixon and watergate. What and exciting time to be a journalist and break the biggest news story, Woodward and Bernstein the original power duo!"}, {"review_sentiment": 5.0, "review_text": "The certainty ascribed to events surround Watergate over ensuing decades masks the very tenuous circumstances of the time. Americans throughout the political spectrum managed to do the right thing for the country even if this was also a matter of political expediency. Woodward and Bernstein admit their own failures at times to resist the temptation of overreach. An extraordinary, frightening and imperfect American epic.(As an aside, the glimpse into the Nixon circle, the man himself, his families and associates adds valuable depth and an anchoring humanity, good and bad)."}, {"review_sentiment": 5.0, "review_text": "excellent reading."}, {"review_sentiment": 5.0, "review_text": "A good book to learn a piece of history"}]}, "authors": ["Bob Woodward", "Carl Bernstein"], "isbn": "0743274067", "longitude": -77.0366456, "periods": ["1900s"], "title": "The Final Days", "word_cloud": "solid report nice see also credit others help creation remain fix describe mostly action key player avoid give much dialogue first page recount occur soon fire point take follow individual basis resign use court congressional hearing material help discrepancy say actually happen pressure henchman action immense also show predicament affect staff family core work ego versus rule law ongoing concern physical mental health due strain come consume much energy show thing indefatigable successfully hold place together egomaniac constantly posture personal objective president close relationship give great deal influence unethical manipulation attorney effort save neck course shenanigan involve tape thankfully include list player title easy back early eighty felt good time special counsel current investigation campaign collusion presidential race great concern read thing cockatoo currently president much le intelligent emotionally mature worst president matter much worse sent country prolong crisis refuse turn investigation tape approval rating percent left office percent currently percent unethical bombastic lie egomaniac utters even week add constant erratic nature soil underwear think nimrod find solid dirt give feel need stock rolaids contain amazing amount detail different kind detail one involve primarily extremely detailed decision making process various individual involve release previously secret tape make conversation concern people involve approached release tape possible perspective try anticipate consequence different official lawyer political figure others analyze memo memo memo note diary recording transcript multiple layer format data refer reach people sort account tedious follow anticipation step find condemn obviously false step official question substitute judgment time read decision making process involve learn great deal character intellect person involve also decision make fascinate serious american constitutional crisis far great political system present presume unique view happy also present detailed character study various individual primarily adviser attorney worth read reason also commend author include list relevant person begin list constantly refer amaze account last month office already familiar fact rivet account flesh take day day scandal event process bring player life get know principal round complex men woman conflicted loyalty impede facilitate inevitable resignation mysterious complex character thriller pivotal protagonist portrays descent stubborn determination solitary brooding complete collapse overtaken event betrayal colleague interest aspect sympathetic portrayal people think scoundrel interested accounting many way better give intimate account inner circle event end leave look blue print modern history fantastic read history great respect brings back many memory recall exactly even night massacre report great last page then become absolute drag seem someone lawyer family member politician change mind resign issue senate rhythm story write go interest bore last chapter identify seem editor tell gifted writer get write technique interest detail enhance story interest watch grass grow consider author disappoint someone know history praying talk painting etc real surprise rendition painful time country history idea occur read watch news hand fantastic insightful absolutely go far associate exciting time journalist break biggest news story original power duo certainty ascribe event surround ensue decade mask tenuous circumstance time political spectrum manage right thing country even also matter political expediency admit failure time resist temptation extraordinary frightening imperfect american epic aside glimpse circle man family associate add valuable depth anchor humanity good bad excellent reading good learn piece history", "genres": ["History", "Politics", "Journalism"], "summary": "The Final Days is the classic, behind-the-scenes account of Richard Nixon’s dramatic last months as president. Moment by moment, Bernstein and Woodward portray the taut, post-Watergate White House as Nixon, his family, his staff, and many members of Congress strained desperately to prevent his inevitable resignation. \r\n\r\nThis brilliant book reveals the ordeal of Nixon’s fall from office—one of the gravest crises in presidential history.\r\n\r\n\"Unprecedented...Mr. Nixon emerges as a tragic figure weathering a catastrophic ordeal...and weathering it with considerable courage and dignity.\" The New York Times", "asin": "0743274067", "rank": "79044", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51h1ez2WHfL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}