{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 8, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Book was just as described."}, {"review_sentiment": 5.0, "review_text": "My history book group read this book and it was well received. Interesting inside look of the period."}, {"review_sentiment": 5.0, "review_text": "Engaging text, laced with evocative photographs.  Really captures both the subtlty of personalities involved and also the ambience of the latter years of the 1800s and turn into the 20th century.  Many parallels to political life today, which is both a comfort (since the country has so far survived) and depressing (nothing much has changed).  As a literary form, the group biography is a challenge Patricia O'Toole easily meets."}, {"review_sentiment": 5.0, "review_text": "A great book that makes each of the members of the Five of Hearts come alive for the reader ."}, {"review_sentiment": 5.0, "review_text": "Much, much better than the title"}, {"review_sentiment": 5.0, "review_text": "I had a marvelous review of this book which I carried around from one bookstore to another in a list of books I'd buy if I could find them at hand in these stores.  It wasn't until someone gave me a computer and I realized what AMAZON was.  What magic..right at hand.  I buy used copies for a few dollars.  I bought a hard cover copy of The Five of Hearts, used, in beautiful shape and it is one of the prizes in my bookshelf.  A great book. It didn't quite read itself, you must keep at it.  Wonderful story of Henry Adams and his wife, Clover and three other friends, the five.  Plenty of good history, recent enough, if you are in your 80's you'll actually have known them. It keeps informing me, backgrounding me in current events. I noticed that Gore Vidal has been buried next to Clover in Oak Creek Cemetary, Washington,DC. She is under the tombstone known for its statuary as GRIEF. A famous work that Vidal always admired."}, {"review_sentiment": 3.0, "review_text": "This book is good for the story of Henry Adams and Clarence King and John Hay which I became interested in after seeing them frequently mentioned in Theodore Roosevelt biographies, but fans of TR will be troubled by some of the out of place criticisms of him, as in the authors next book \"When Trumpets Call\" she has a decided animosity towards him, like when she criticizes him for for not \"facilitating genius\" when being painted by John Singer Sargent like John Hay did, a man of \"refined tastes\" and about \"whining\"  about time taken from his daily fencing matches. I don't know what her problem is but she clearly doesn't understand TR at all."}, {"review_sentiment": 5.0, "review_text": "The republication of this fine 1990 volume in a convenient paper edition can only be a matter of joy to students of Henry Adams.  This is one of the first books I read about HA, and it has proven to be also one of the most valuable.  The focus of the volume is on five individuals who constituted Adams' inner circle after he moved to Washington and came together around 1880.  Those being John Hay, former secretary to Lincoln, and eventually Secretary of State, Clara Hay, Clarence King, a prominent geologist, and Henry and Clover Adams.  But these folks are only the beginning, as the author also incorporates into her discussion such individuals as Edith Wharton, Henry James, John LeFarge, H.H. Richardson, several presidents, and of course Augustus Saint-Gaudens who eventually crafted the remarkable memorial to Clover Adams situated in Rock Creek cemetery. Many fine illustrations are incorporated, including a number of photographs taken by Clover.  One learns a great deal about how Adams lived, worked, conspired and interacted with prominent and challenging individuals. One's understanding of HA is less then complete unless this book has been savored."}]}, "authors": ["Patricia O'Toole"], "isbn": "0743288238", "longitude": -77.0366456, "periods": ["1800s", "1900s", "Recent Releases"], "title": "The Five of Hearts: An Intimate Portrait of Henry Adams and His Friends, 1880-1918", "word_cloud": "describe history group well receive inside look period engage text lace evocative photograph capture subtly personality involve also ambiance latter year turn century many parallel political life today comfort country far survive depress nothing much change literary form group biography challenge easily meet great make member heart come alive much much better title marvelous review carry bookstore list buy hand store someone give computer realize hand buy used copy dollar buy hard cover copy heart use beautiful shape prize great quite story wife friend good history recent enough actually know keep inform back grounding current event notice bury next tombstone known statuary famous work always admire good story become interested see frequently mention biography fan trouble place criticism author decide animosity towards criticizes facilitate genius paint man refine taste whine time take daily fence match know problem clearly understand republication fine volume convenient paper edition matter joy student first proven also valuable focus volume individual constitute inner circle move come together former secretary eventually prominent geologist folk begin author also incorporate discussion individual several president course eventually craft remarkable memorial situate cemetery many fine illustration incorporate include number photograph take learn great deal live work conspired interacted prominent challenge individual understand complete savor", "genres": ["Biography", "History"], "summary": "The Five of Hearts, who first gathered in Washington in the Gilded Age, included Henry Adams, historian and scion of America's first political dynasty; his wife, Clover, gifted photographer and tragic victim of depression; John Hay, ambassador and secretary of state; his wife, Clara, a Midwestern heiress; and Clarence King, pioneering geologist, entrepreneur, and man of mystery. They knew every president from Abraham Lincoln to Theodore Roosevelt and befriended Henry James, Mark Twain, Edith Wharton, and a host of other illustrious figures on both sides of the Atlantic.\r\n\r\n\"Fascinating. . . A new perception of America during a period of erupting violence, as the tensions between private and political moralities became more anguished.\" The New York Times ", "asin": "0743288238", "rank": "920730", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51LOX5IiUhL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}