{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 466, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book to read about!!"}, {"review_sentiment": 5.0, "review_text": "Great book. I sw the movie and it's nothing like the book the movie should have been more like the book. What happens in the book tells a great story and Hollywood missed out adding and mixing up details in the book. I am army ms not a marine and still loved the book. Took me back to my time in the sandbox"}, {"review_sentiment": 5.0, "review_text": "Great book! Loved it! Enjoyed reading what life is like in the Marine Corps.No fluff...just details."}, {"review_sentiment": 4.0, "review_text": "Swofford's unflinching description of his own demons as well as that of becoming and being a Marine ring true. The novel is written with an economy of language which says more than many books twice it's length. There seem to be no false notes and no bravado. Any young woman or man considering joining the military might be well-served by giving \"Jarhead\" a read."}, {"review_sentiment": 1.0, "review_text": "As a career Marine and Desert Storm veteran, I instantly recognized Mr. Swofford as one of the lazy, smart-assed, crybaby ten percent on which ninety percent of leadership's energy and resources must be spent.  Although the writing is overblown and bombastic, it does clearly communicate the author's magnificent level of concern for his own conflicted, unlikeable self.  Of mild interest is the tremendous level of angst he generates at having done...essentially nothing.A self-important non-story."}, {"review_sentiment": 4.0, "review_text": "This is the book that gave birth to the movie Jarhead. The movie is one of the few that strongly follows the book. If you enjoy the movie you will enjoy the book.I know to most war veterans seem mysterious if you haven't served. Why do they talk in such admiration about their war days years ago. This book will help you understand that experience. It paints an excellent picture of what it is like to be a soldier or marine in conflict. The book communicates in vivid terms what it is like. You get a sense of the frustrations, motivation, joys, horrors that come with a deployment. The book  really shows how being a veteran changes people. That brotherhood one experiences in a unit makes an impact on people that changes them. The author also goes into stuff which isn't in the movie. This additional information will further help the reader understand motivations. He does a good job talking about the challenges at home too, unfaithful spouses, parents, relatives, etc... The most important part of the book is it is just an entertaining read."}, {"review_sentiment": 5.0, "review_text": "Life changer."}, {"review_sentiment": 3.0, "review_text": "Seemed to be a very whiny story that didn't really sit well with me."}, {"review_sentiment": 5.0, "review_text": "Great read"}, {"review_sentiment": 5.0, "review_text": "Incredible story. I really enjoyed getting inside the head of a Marine like this. I plan on rereading this regularly"}]}, "authors": ["Anthony Swofford"], "isbn": "0743244915", "longitude": 0.0, "periods": ["1900s"], "title": "Jarhead: A Marine's Chronicle of the Gulf War and Other Battles", "word_cloud": "great sw movie nothing movie happen tell great story miss add mix detail army m marine still love time sandbox read life fluff detail unflinching description demon well become ring true write economy language say many twice length seem false note young woman man consider join military give career veteran instantly recognize lazy crybaby percent ninety percent leadership energy resource write bombastic clearly communicate author magnificent level concern conflict unlikable self mild interest tremendous level angst generate do essentially give birth movie movie strongly follow enjoy movie enjoy know veteran seem mysterious serve talk admiration day year ago help experience paint excellent picture soldier marine conflict communicates vivid term get sense frustration motivation joy horror come deployment really show veteran change people brotherhood experience unit make impact people change author also go stuff movie additional information help motivation good job talk challenge home unfaithful spouse parent relative etc important part entertain changer whiny story really sit well great incredible story really enjoy get inside head plan reread regularly", "genres": ["Memoir"], "summary": "When the Marines were sent to Saudi Arabia for Operation Desert Storm, Anthony Swofford was there, with a hundred-pound pack on his shoulders and a sniper's rifle in his hands. This is his scorching memoir of life on and off the battlefield.\r\n\r\n\"A searing contribution to the literature of combat.\" The New York Times", "asin": "0743244915", "rank": "249516", "city": "Saudi Arabia", "image": "https://images-na.ssl-images-amazon.com/images/I/51NsQ660xqL.jpg", "country": "Kuwait", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}