{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": -26.205, "ratings": {"num_ratings": 525, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Very moving book.  I would recommend this book to anyone interested in South African history."}, {"review_sentiment": 5.0, "review_text": "a must read classic that reveals so much humanity on multiple levels"}, {"review_sentiment": 5.0, "review_text": "This was a fantastic book and a great story. I absolutely loved it."}, {"review_sentiment": 4.0, "review_text": "Written in the 1940s, this is a tale of a changing South Africa - where apartheid exists and where the Black and White populations are poles apart, but where some Blacks are challenging the status quo, some violently. And where some Whites see their country's failings and are trying to do better, while others hang on to power, albeit increasingly fearfully.A poor country parson travels to Johannesberg to fech home his ailing sister. While there he tries to find his son, who moved to the city but has lost touch. What he finds is far worse than he could have expected...This novel really works because the characters are all so plausible. Such a story could easily 'take the side' of one race or the other: the 'Natives', oppressed, longsuffering - or violent, immoral. The Whites - cruel, racist - or victims . In actual fact, we see the flaws - and good side; and difficulties - of each. There are no easy answers, though it finishes on a hopeful note.Beautifully written."}, {"review_sentiment": 5.0, "review_text": "Heartbreaking, partly because of the glimmer of hope during that time and the great disappointment of what came shortly after (with the institution of apartheid)."}, {"review_sentiment": 5.0, "review_text": "good book"}, {"review_sentiment": 5.0, "review_text": "Incredibly moving story plus unique narrative style."}, {"review_sentiment": 4.0, "review_text": "Although this book is known for its poetic prose, this was not what finally hooked me.  I felt it started slowly and I somewhat begrudgingly continued to read.  I am glad that I did as the loose endings and indeed the message itself became more clear only in the later thirds of the book.  I am glad that I continued to read and by the end could not put it down without finishing it."}, {"review_sentiment": 5.0, "review_text": "A beautifully written story about how two fathers lives are brought together by a tragedy. There is humanity and a great compassion throughout their story. Never has the English language been written with such gentility and elegance."}, {"review_sentiment": 4.0, "review_text": "A landmark in South African literature, Cry, the Beloved Country is often found on high school reading lists and deservedly so. This paints the picture of the South African apartheid while telling an epic and beautiful story of a man trying to reconcile with his child, and set right what has been set wrong. Essential."}]}, "authors": ["Alan Paton"], "isbn": "0743262174", "longitude": 28.049722, "periods": ["1900s"], "title": "Cry, the Beloved Country", "word_cloud": "very move anyone interested south african history reveals much humanity multiple level fantastic great story absolutely love tale change apartheid exist population pole apart challenge status quo violently see failing try better others hang power increasingly poor parson travel fete home ail sister try find son move city lose touch find far worse really work character plausible such story easily race oppress long suffering violent immoral cruel racist victim actual fact flaw good side difficulty easy answer finish hopeful write heartbreaking partly glimmer hope time great disappointment come shortly institution apartheid good incredibly move story unique narrative style know poetic prose finally hook felt start slowly somewhat begrudgingly continue glad loose ending indeed message become clear later third glad continue end finish beautifully write story father life bring together tragedy humanity great compassion story language write gentility elegance landmark south african literature often find high school reading list deservedly paint picture south african apartheid tell epic beautiful story man try reconcile child set right set wrong essential", "genres": ["Fiction & Literature"], "summary": "Cry, the Beloved Country, the most famous and important novel in South Africa’s history, was an immediate worldwide bestseller in 1948. Alan Paton’s impassioned novel about a black man’s country under white man’s law is a work of searing beauty.\r\n\r\nCry, the beloved country, for the unborn child that is the inheritor of our fear. Let him not love the earth too deeply. Let him not laugh too gladly when the water runs through his fingers, nor stand too silent when the setting sun makes red the veld with fire. Let him not be too moved when the birds of his land are singing, nor give too much of his heart to a mountain or valley. For fear will rob him of all if he gives too much.\r\n\r\nThe eminent literary critic Lewis Gannett wrote, “We have had many novels from statesmen and reformers, almost all bad; many novels from poets, almost all thin. In Alan Paton’s Cry, the Beloved Country the statesman, the poet and the novelist meet in a unique harmony.”\r\n\r\nCry, the Beloved Country is the deeply moving story of the Zulu pastor Stephen Kumalo and his son, Absalom, set against the background of a land and a people riven by racial injustice. Remarkable for its lyricism, unforgettable for character and incident, Cry, the Beloved Country is a classic work of love and hope, courage and endurance, born of the dignity of man.", "asin": "0743262174", "rank": "16388", "city": "Johannesburg", "image": "https://images-na.ssl-images-amazon.com/images/I/51iV%2B9ssK9L.jpg", "country": "RSA", "story_arc": ["Tragedy", "Things only get worse"]}