{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 38, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "I enjoy her stories"}, {"review_sentiment": 4.0, "review_text": "Johnston is fairly new to me and I have learned to really enjoy her works."}, {"review_sentiment": 5.0, "review_text": "This book was a little confusing at first but once I got the two families untangled, I loved it. I am looking forward to the next one."}, {"review_sentiment": 5.0, "review_text": "Mom was excited to get this"}, {"review_sentiment": 5.0, "review_text": "Same"}, {"review_sentiment": 5.0, "review_text": "Very good , The characters are very good."}, {"review_sentiment": 5.0, "review_text": "great read"}, {"review_sentiment": 5.0, "review_text": "This book was really good. I could hardly put it down. I love joan johnston novels. And I have been readin this series from the beginning starting with the sisters if the lone star state. Its a really good series. I love how all her books are connected over time. When I read this book I didnt know that there were some other books before this because when I was reading it I felt like I had missed something..so the order for this series in case anyone was wondering like I was is; the cowboy, the texan, the loner, the price, the rivals, the next mrs. Blackthorne, a stangers game and shattered."}, {"review_sentiment": 5.0, "review_text": "Great book.  Love Joan Johnston's books.  Always look forward to the next one."}, {"review_sentiment": 5.0, "review_text": "I liked this story.  I like to read about the Blackthorn family, back to back stories to see the whole family picture."}]}, "authors": ["Joan Johnston"], "isbn": "0743454413", "longitude": -97.7436995, "periods": ["2000s"], "title": "The Next Mrs. Blackthorne", "word_cloud": "enjoy story fairly new learn really enjoy work little confuse first get family untangle love look forward one excite get same very good character good great really good hardly love joan johnston novel read series begin start sister star state really good series love connected time dint know read felt miss order series case anyone wonder cowboy texan loner price rival stranger game shatter forward one like story like family back back story see whole family picture", "genres": ["Fiction & Literature", "Romance"], "summary": "Book 6/14 in the Bitter Creek Series\r\n\r\nA lavish summer wedding is being planned at Bitter Creek ranch. In one month, Clay Blackthorne will wed socialite Jocelyn Montrose. But when she hears stirrings of a corporate takeover by the family's archrival, North Grayhawk, Jocelyn covertly heads to North's ranch to offer a valuable commodity -- herself -- if North will call off his plans. Striking a deal to spend the summer with the steely, seductive North, Jocelyn fails to see that her sacrifice to protect the man she loves may have dire consequences.\r\n\r\nStunned by his fiancee's rejection, Clay, a newly appointed federal judge, begins presiding over an incendiary terrorism trial, which brings him face to face with his first love, Libby Grayhawk. As tensions mount, forces beyond Clay's control threaten the women most precious to him in the past and the present. And only in a daring act of sacrifice will he know which woman will become the next Mrs. Blackthorne.", "asin": "B000MATAVS", "rank": "1638463", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/411OqxXcHSL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}