{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 406, "rating": 4.2, "reviews": [{"review_sentiment": 2.0, "review_text": "Boring.  Somewhere there must be better books about Cuba."}, {"review_sentiment": 5.0, "review_text": "I recently read a review of Eire's new book and decided to read this first.  I have read a few accounts of Castro's revolution (no capital R intentionally) but this is the most poetic. As a child, roughly the same age as the author,  I was aware of what was happening in Cuba but by reading this book I got a better understanding of how individual lives were changed forever and dramatically changed."}, {"review_sentiment": 3.0, "review_text": "Great story but could have used more editing. In my Book Club of 40 plus, we all agreed that at times he was very wordy."}, {"review_sentiment": 5.0, "review_text": "I have read hundreds of books in my lifetime, never have I enjoyed one more than this.So well written, laugh out loud funny at times, and heartbreakingly sad at others.Carlos Eire, takes you back in time to the Pre-Castro Havana that once was. You revisit it with him, he makes you feel it, smell it, taste it. You are there with him on this beautiful ride.Thank Mr. Eire, for writing this novel/autobiography. My parents were born in Havana, I was as well, but I left at the age of five, therefore, only know it through my parents stories. You brought it home. You touched my heart. I absolutely loved it. It's a masterpiece... Truly."}, {"review_sentiment": 3.0, "review_text": "Some of this book is beautifully written.  It gives more of an insight to pre-revolution wealthy Cuban life style than the plight of the under privileged masses.  Very disturbing/depressing. Hard to plow through."}, {"review_sentiment": 3.0, "review_text": "Haven't finished this book yet.  Was hoping it would tell you more about Cuba but it rambles on."}, {"review_sentiment": 5.0, "review_text": "As a tourist in Cuba in 2016 , I was anxious to read about the \"Peter Pan\" children who came to the U.S. at the time of the revolution.  This was a totally readable, realistic and enjoyable tale.  Any American who visits Cuba now will be enlightened by Carlos Eire's story of his separation from his Cuban family and his integration into Yankee culture."}, {"review_sentiment": 3.0, "review_text": "Could get interested."}, {"review_sentiment": 5.0, "review_text": "Brilliant!  Well written, hysterically funny, yet tragic story told through the eyes of a 11 year old. I listened to this on audible, which probably made it more relatable considering hearing the many cuban translations is so much more real than simply reading them. Highly recommend listening to this on audible."}, {"review_sentiment": 3.0, "review_text": "A very odd book.  A bit too long and too much detail regarding the poor chameleons and other reptiles he maliciously killed.  Not a sympathetic portrait of himself!  He was a totally spoiled, hateful child and product of a corrupt immoral system.  Bravo for Fidel!  I can understand the need for revolution in Cuba clearly now."}]}, "authors": ["Carlos Eire"], "isbn": "0743246411", "longitude": -82.3658671, "periods": ["1900s"], "title": "Waiting for Snow in Havana: Confessions of a Cuban Boy", "word_cloud": "bore recently review new decide first account castro revolution capital intentionally poetic child roughly age author aware happen reading get better understand individual life change forever dramatically change story use edit agree time wordy hundreds lifetime never enjoy well write laugh loud funny time heartbreakingly sad take back time revisit make feel smell beautiful eire write parent bear well leave age therefore know parent story bring home touch heart absolutely love masterpiece truly beautifully write give insight wealthy life style plight privilege mass very plow finish yet hop ramble tourist anxious child come time revolution totally readable realistic enjoyable tale any american visit enlighten story separation family integration culture interested write hysterically funny yet tragic story tell eye year old listen audible probably make repeatable consider hear many translation much real simply read listen audible bit long much detail regard poor chameleon reptiles maliciously kill not sympathetic portrait totally spoil hateful child product corrupt immoral system understand revolution clearly", "genres": ["Memoir"], "summary": "“Have mercy on me, Lord, I am Cuban.” In 1962, Carlos Eire was one of 14,000 children airlifted out of Havana—exiled from his family, his country, and his own childhood by Fidel Castro’s revolution. Winner of the National Book Award, this stunning memoir is a vibrant and evocative look at Latin America from a child’s unforgettable experience.\r\n\r\nWaiting for Snow in Havana is both an exorcism and an ode to a paradise lost. For the Cuba of Carlos’s youth—with its lizards and turquoise seas and sun-drenched siestas—becomes an island of condemnation once a cigar-smoking guerrilla named Fidel Castro ousts President Batista on January 1, 1959. Suddenly the music in the streets sounds like gunfire. Christmas is made illegal, political dissent leads to imprisonment, and too many of Carlos’s friends are leaving Cuba for a place as far away and unthinkable as the United States. Carlos will end up there, too, and fulfill his mother’s dreams by becoming a modern American man—even if his soul remains in the country he left behind.\r\n\r\nNarrated with the urgency of a confession, Waiting for Snow in Havana is a eulogy for a native land and a loving testament to the collective spirit of Cubans everywhere.", "asin": "0743246411", "rank": "26214", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51rCPc7dnFL.jpg", "country": "Cuba", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}