{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 36, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Such a urbanely written and informative book.  Great resource."}, {"review_sentiment": 4.0, "review_text": "This is an interesting book being part history of Brazil and part autobiography.The author divides his book into 3 a) early history starting with slavery and the Potruguese colonisation b)current history with rebellions and strife and c)personaal experiances.He illustrates the glaring differences of rich,poor,carnival and corruption all of which rule the country.There is a first chronology from c1000BC with the arrival of indigenous people to 2003 when 140 slaves were released.An essential book for travellers to Brazil  but it has a fatal flaw as it has no index."}, {"review_sentiment": 2.0, "review_text": "I am generally a fan of Peter Robb. But I found this book too unstructured. The anecdotes of daily life in the history of Brazil's development were of themselves interesting and well written, as always, but I wasn't sure what they added up to. Clearly the theme was extreme corruption and racism but I didn't have any sense at the end of the day of the 'patterns' of how that corruption developed. Perhaps that's the job of the historian rather than documentary novelist, which is how I see Peter's work : dealing in historical facts but with a narrative joining them. The narrative does not depart into the realms of historical fiction - that's not his genre - but must constitute an organising framework. I think that framework was missing this time."}, {"review_sentiment": 5.0, "review_text": "If you want to know Brazil..this is the book to read...in terms of history, culture, politics, sexuality...its there. Highly recommended...a total eye-opener into day-to-day life of Brasilians...and easy to read...keeps you wanting more and more and more."}, {"review_sentiment": 5.0, "review_text": "History can be seen through the eyes of someone that lives throughout the harsh times of Brazil's political and economical changes. A death of brazil is a book that relates the history with life experiences, anecdotes and real people's perspective of life. If you want to learn about history without getting bored with history dates and memorizing names, this book will teach you history like no other book. VERY INTERESTING and deliberating, the author's narrations about the incidents are AMAZING!!!!!"}, {"review_sentiment": 5.0, "review_text": "book in good conditions :)"}, {"review_sentiment": 4.0, "review_text": "I'm reading this book to help get prepared for a trip to Brazil. Really loving it. Very evocative writing. Poetic at times. Informative at every turn."}, {"review_sentiment": 5.0, "review_text": "Great read. Best way to understand this complicated and dynamic country that will be very influential for the next century."}, {"review_sentiment": 5.0, "review_text": "Engaging, entertaining and sometimes hilarious back-stories of Brazilian history.  The author, a journalist, uses a feature-story style to the Brazilian story, from pre-history to Lula's election in 2003.  Easy to absorb, this overview of Brazilian history and culture gave me the grounding I needed before my first trip to Brazil.  And don't let the author's magazine-story style fool you.  He's done his homework and his research.  The characters, including presidents and kings, soccer stars and generals, really existed and howevercrazy their soap-opera antics may sound, this is Brazil.  A really good introduction to this society, it's history, it's people and it's culture.  Highly recommended if you're going to Brazil, and like me, prefer not to read history in a textbook."}, {"review_sentiment": 5.0, "review_text": "Peter does a marvelous job in depicting Brazil. Everytime he spoke about the landscape or simply their way of life it's like I could picture it right before my eyes. This is a great story if one wants to read about Brazil, from the past, present and future."}]}, "authors": ["Peter Robb"], "isbn": "0747573166", "longitude": 0.0, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s"], "title": "A Death in Brazil: A Book of Omissions", "word_cloud": "such urbanely write informative resource interesting part history part author divide early history start slavery portuguese colonization current history rebellion strife c personal illustrate glare difference rich poor carnival corruption rule first chronology arrival indigenous people slave essential traveler fatal flaw index generally fan find unstructured anecdote daily life history development interest well write always sure add clearly theme extreme corruption racism sense end day corruption develop perhaps job historian rather documentary novelist see work deal historical fact narrative join narrative depart historical fiction genre organize framework think missing time want know term history culture politics sexuality recommend total life easy keep want history see eye someone live harsh time political economical change brazil relate history life experience anecdotes real people perspective life want learn history get bored history date memorize name teach history deliberate author narration incident amaze good condition read help prepared trip love very evocative writing time turn way understand complicate dynamic country influential next century engage entertain sometimes hilarious brazilian history author journalist use style brazilian story election absorb overview brazilian history culture give ground need first trip author style fool do homework research character include president king soccer star general really exist however crazy antic really good introduction society history people culture recommend go prefer history textbook marvelous job depict speak landscape simply way life right eye great story want past present future", "genres": ["Memoir", "History", "Travel Writing"], "summary": "The story of an encounter with one of the world’s greatest and strangest countries. Combining travel, history, culture and his own memories of twenty years of Brazilian life, Robb delves into the past and present of a baroque country, writing about Brazil’s centuries of slavery and the vibrant but disturbed society that slavery left behind. \r\n\r\nEven today, Brazil is a nation of almost unimaginable distance between its rich and its poor, a place of extraordinary levels of crime and violence, but also one of the most beautiful and seductive places on earth. Using the art, food, and the books of Brazil’s great writer, Machado de Assis, Robb takes us on a journey into a sensual and frightening world. \r\n\r\nPower, murder, greed, ambition, sexual drama and family jealousy mirror the TV soap operas watched by a hundred million Brazilians every night, stories whose only structure is desire and whose only resolution is death.", "asin": "0747573166", "rank": "716422", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/510sGEzxSrL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}