{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 11, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "You’ll need all the lights on when you read this and even then the room will be dark. This is dark and then some. There is a lot of layers to this - great portrayals of historical figures, a horrific murder, a hanging, a trial and all this with a musical backdrop and an insight into the music halls of the 1800sThere’s mentions of the Ratcliffe Highway murders, references to Jack the Ripper but this Limehouse Golem is quite something else. The story and the  mystery of this creature unfurls like a snake, then there is silence and stillness and then BAM the snake strikesI enjoyed the mix of fact, fiction and myth and tales of what might be lurking in the dank London streets. If the book is this good I can’t wait to see the film but I saw the book play out in my mind and it’s  a dark world out there.It reads more like something written in Mary Shelley’s day - and there’s plenty of Frankenstein- esque moments in this book."}, {"review_sentiment": 4.0, "review_text": "Dan Leno and the Limehouse Golem was a dark, twisted tale set back in Victorian London in the wake of the Ratcliffe Highway murders. Peter Ackroyd has done an excellent job in his research to plot his murder mystery around real people and events.Dan Leno has a strong plot that is well balanced with device and references. Thomas de Quincey’s work is mentioned several times, and notable personalities like Karl Marx, George Gissing, and Dan Leno are integrated into the plot as characters rather than abstractions.The brooding and grotesque setting of Victorian London was well established. The events and context were appropriate to the plot and advanced my visualization of the dark, smoggy, and dirty streets and theatres of London.The character development was good—especially Elizabeth Cree: a Victorian woman whose history of victimization in many respects makes her stronger. She is in control of her personhood, her image, and her prosperity for much of her life. She overcomes adversity and faces challenges head-on. This balance of struggle and resistance makes her a believable Victorian woman, but also one who I could sympathize with. Dan Leno and John Cree were also consistent and believable primary characters.Pacing was strong, and the breakdown of chapters by the shifting first-person perspectives of the lead characters was both exciting and fun weaving all their stories together. But suspense was lacking. I expect suspense in a strong murder mystery—something that leaves some mystery right up to the end of the story—but there was really only one mystery to solve and that became apparent about mid-way through the book. However, because our murderer is a serial killer, there was some mystery in not knowing how or when they would strike again, and Ackroyd did keep the plot developing in the latter half of the book. There was just a lack of surprise. Events were either predictable, or just made sense without adding any shock value or major twists in the plot.I would recommend this story, especially so to murder mystery or historical fiction fans. I would also recommend this story to people who have read Peter Ackroyd’s work before, because I believe this is one of his best. The only reason I did not give this a 4-star rating is because I do not see myself picking it up to read for a second time. Overall, I definitely enjoyed this read."}, {"review_sentiment": 5.0, "review_text": "My husband bought this for me, I have been looking for it for ages.  It is an excellent and smartly written book.  Ackroyd uses historical figures to intertwine with fictional and non fictional characters, adding them all together on a stage of murder and confusion.  I am hoping that the movie version will live up to this book.  It's one of a kind and it stays with the reader days after you close the book.  I highly recommend this book!Chessica"}, {"review_sentiment": 1.0, "review_text": "I bought this book for my husband, and he read it but didn't care for it.  He would have preferred a biography or autobiography of Dan Leno."}, {"review_sentiment": 5.0, "review_text": "Many in our group enjoyed the author's `Hawksmoor'. This novel was written nine years later and follows many of the same themes and fascinations, one might almost say obsessions.This is a kaleidoscope of fragments which builds up the story by extracts from a (made up) diary, a trial transcript and the main character's early history.  It begins at both ends and works towards the solution in the middle. There are surprises at the end of chapters, little hints all along so you wonder why a suspected a murderer reads Tennyson to his wife,  but it is not until you get to the end that they sink in so it maybe worth reading the book a second time to appreciate its clever crafting. No linear narrative here then, just like Ackroyd's other London books.These fragments come from all over the place and the author makes sense of them, just as we try to make sense out of the many events which make up out lives. One important fragment, woven into the story, is the main character, Lambeth Marsh Lizzie (Elizabeth Cree after her marriage) who is reminiscent of the title of W. Somerset Maugham's novel, Liza of Lambeth. Maybe Ackroyd based his character on her because there are parallels: both are young women who have gone astray; both are the only child of a religious, hypocritical mother who mistreats them; both oppose their mother's will; and both have lived all their childhood in poverty in Lambeth approximately in the same period. Both novels, deal with popular theatre influencing the lives and behaviour of the urban masses. Leno says, \"We never do dirty - but double-entendres.\"Typically post-modern, the novel muses on the self. Who am I? Are we a consistent, integrated person or am I a series of different selves, reacting to the different people I meet, as it were a selection of stage personas. Poststructuralists tend to see the 'self' not as a fixed unity but more like a flux or a process which adapts to different situations and discourses it encounters. Elizabeth Cree does six acts a night, moving from theatre to theatre. She can be a girl, boy, man or woman. And Dan Leno \"played so many parts that he hardly had time to be himself. And yet, somehow, he was always himself. He was the Indian squaw, the waiter, the milkmaid, or the train driver, but it was always Dan conjuring people out of thin air. .....suddenly he was the sour-faced spinster on the look-out for a man.\" This Dan Leno is the master of masks and poses,  \"He is endless\" (But the real Dan Leno had a mental breakdown - his character(s) disintegrated.)Where do we and the people in the book get our `characters' from? Dan Leno wished to \"understand the conditions which had, in a sense, created him\"  He reads The Memoirs of Joseph Grimaldi as well as Thomas De Quincey's essay on the famous clown, identified with him and saw parallels between Grimaldi's and his own life. He, as it were, becomes him: when he lays sick and dying he repeats, word for word, Grimaldi's farewell speech, \"while those around his deathbed believed he was delirious.\"  So Ackroyd emphasizes that we are products of our culture, and no more than that.  Our thoughts, dreams, and behaviour reflect our cultural and textual experience. We are what we read; everything we do or say has its complex origins in textual or cultural sources. \"Sometimes I believe that I am made of ink and paper\", says Karl Marx.Ackroyd's interest in literary criticism is reflected here. Most of the characters are involved with texts, either reading, writing or stage acting. His characters read De Quincey's essays. Karl Marx takes down from the shelf Dialogues of Three Templars on Political Economy by Thomas De Quincey, Dan Leno reads De Quincey's essay on pantomime, 'Laugh, Scream and Speech'. George Gissing writes his first public essay, 'Romanticism and Crime', and extols Thomas De Quincey's impassionate prose. Most obviously, Thomas De Quincey's essay \"On Murder Considered as One of the Fine Arts\", an essay which evokes a sinister London, \"a city of footsteps and flaring lights, of houses packed close together, of lacrymose alleys and false doors.\" is surely where the author borrowed the crime plot, the ominous atmosphere of approaching doom; narrating from the murderer's point of view, the access to the killer's disturbed mind, the parallels between murder and acting, and the theatrical imagery which depicts the murderer very much like an artist in crime. Ackroyd even goes so far as to use the same setting (two houses on the Ratcliffe Highway, East London) and the same method of murder (the use of a mallet and a razor to crush the victims' skulls and cut their throats).The story, like the masks we wear in life, are all borrowed. John Cree plans to write a novel about urban poverty and \"the crime and disease which it engendered\" He does not go to the streets to collect his material but, instead, his first place of study is the Reading Room of the British Museum. \"He had reserved a copy of Plumstead's History of the London Poor and Molton's A Few Sighs From Hell. Both books were concerned with the life of the indigent and the vagrant in the capital, and for that reason they were of especial interest to him.\" So too, Ackroyd imitates the work of others: Dickens, Gaskell or George Gissing.Where is integration to be found? The Reading Room of the British Museum becomes a place of almost mystical quality in this novel, the meeting point between various texts and discourses; this is where the roots of all the events in the book derive from; this is a giant library which can \"be said to have affected the course of human history\". For George Gissing, who shares the author's sense of place and identification of a spiritual home. Gissing lived 'in the valley of the shadow of books'.However, close to the centre of spirituality comes the occult, another of Ackroyd's interests. Black and white go hand in hand.  Occult shops are to be found near the British Museum. And Gissing wonders about the invention of the calculating machine that may be draining away life, with souls trapped within it, maybe prefiguring computers and the alternative `reality' of the online persona in social networking sites as an evasion of `real life'?For a gay author, there are only two gay characters, the detective and his engineer boyfriend.There are some strange terms used to describe people, probably commonly use at that time: Romanist, Hebrew.Elizabeth's childhood was spent in a house where the wallpaper was pages from the bible. Her Bible references are accurate, like Dot Cotton in East Enders. Her death bed confession shows her feistiness: \"And I will fry eternally? I am surprised at you, father, for such childish notions. I cannot think of hell as some fish-shop. ....A sole may be fried, too.\", but also her mixing up of reality with pretence. She regarded the Mass as `such fun', rather like the music hall where she had spent most of her working life.So everything about us is created. But we should beware what we create. It could be a Frankenstein or a golem."}, {"review_sentiment": 4.0, "review_text": "Elizabeth Cree is hanged at the beginning of this book for the murder of her husband, but was she guilty?We are then taken into the Victorian world of theatre and gross murder.Ackroyd writes about London superbly and he has managed to combine this with a good crime novel, some wonderfully horrible writing here."}, {"review_sentiment": 5.0, "review_text": "Dan Leno And The Limehouse Golem is quite simply a masterpiece. Every aspect of the novel is remarkable. It's a whodunit, though it suggests a couple of credible suspects right at the start. It even convicts its central character to death by hanging before we have even got to know her. Clearly things are not going to be obvious. The novel is also a study in character, especially that of its central actor, Lambeth Marsh Lizzie, later Mrs Elizabeth Cree. It's also an evocation of London in the late nineteenth century, complete with colours, smells, vistas and perspectives.  It's a highly literary work, ever conscious of its place beside the genres it skirts. Overall, it's a wonderful example of how form can be used as inventively as plot to create a story.The novel has a series of interlocking stands. In one our anti-heroine, Lizzie, is accused of the murder of John Cree, her husband. In another, John Cree's diary reveals certain secrets that not only he would have wanted to hide. In a third strand, we learn of Lambeth Marsh Lizzie's past, how she came to a life in the theatre and how she met her husband. A fourth strand follows the career of Dan Leno, a music hall player, worshipper of the silent clown Grimaldi and mentor of Lizzie's stage life. And in a fifth strand we see how, in a great city like London, our paths inevitably cross those of great thinkers, writers, artists and, of course, history itself. Peter Ackroyd thus has his characters cross the paths of a writer, George Gissing, and a thinker of note, one Karl Marx, as they tramp the streets of Limehouse after a day at the library.As usual, sex has a lot to do with the relationships in the book. It is usually on top, but here it also comes underneath and sometimes on the side of events. Mrs Cree is accused of poisoning her husband. Their married life has been far from conventional, but are its inadequacies the motive for a series of brutal killings of prostitutes and others in the Limehouse area? As a result of the curious placement of certain trophies, the killings are attributed in the popular mind to a golem, a mythical creature made of clay that can change it shape at will. Karl Marx examines the Jewish myths surrounding the subject. Others steer clear of the subject.Lizzie continues on the stage until she meets her husband. She learns much stagecraft from Dan Leno and eventually resolves to help her husband to complete the play over which he has unsuccessfully laboured. When the book's plot resolves, we are surprised, but then everything makes such perfect sense. And in a real piece of insight, Peter Ackroyd likens the mass murderer to Romaticism perfected, the ultimate triumph of individualism. There is much to stimulate the mind in this thriller.A reader of this review might suspect that Dan leno And The Limehouse Golem is a difficult read, a book whose diverse strands never converge. But quite the contrary is true: it comes together in a wonderful, fast-flowing manner to a resolution that is both highly theatrical yet thoroughly credible. Read it many times."}, {"review_sentiment": 3.0, "review_text": "Peter Ackroyd is a great writer.  His seemless mixture of styles, techniques, a brooding sense of place and time jumps creates some of the best fiction being written today. However, that being said, I find that this novel left me out and did not engage or make me care about any of the  characters. The same complaint has been made about Stanley Kubrick's  movies.  I can appreciate the master's touch, but it is sometimes too cold."}, {"review_sentiment": 4.0, "review_text": "The concept of time folding in and repeating itself, retracing ones own steps, spreads throughout this book. Starting with a woman lead to the gallows, her last words \"Here we go again\", echo strangely.An  excellent read, funny, scary, tragic, enthralling. Recommended."}, {"review_sentiment": 4.0, "review_text": "An excellent twisting novel that leads the reader further in to understand the depths of the characters minds. I loved the academic references and the almost parallel stories that work in partnership. I will have to read it again..soon"}]}, "authors": ["Peter Ackroyd"], "isbn": "0749385359", "longitude": -0.12574, "periods": ["1800s"], "title": "Dan Leno Limehouse Golem Cook Pro", "word_cloud": "need light even room dark dark lot layer great portrayal historical figure horrific murder hang trial musical backdrop insight music halls mention murder reference quite something else story mystery creature snake silence stillness snake strikes i enjoy mix fact fiction myth tale lurk dank street good wait see film saw play mind dark world read something write day plenty esque moment dark twist tale set victorian wake murder do excellent job research plot murder mystery real people strong plot well balanced device reference work mention several time notable personality integrate plot character rather brood grotesque set victorian well establish event context appropriate plot advance visualization dark smoggy dirty street theaters character development woman history victimization many respect make stronger control person hood image prosperity much life overcome adversity face challenge balance struggle resistance make believable victorian woman also also consistent believable primary strong breakdown chapter shift perspective lead character excite fun weave story together suspense lacking expect suspense strong murder leave mystery right end really mystery solve become apparent however murderer serial killer mystery know plot develop latter half lack surprise event predictable make sense add shock value major twist story especially murder mystery historical fiction fan also story people work believe best reason give rating see pick second time definitely enjoy husband buy look age excellent smartly write use historical figure intertwine fictional non fictional character add together stage murder confusion hop movie version live kind stay day close highly recommend buy husband care biography autobiography many group enjoy author write year later follow many theme fascination almost kaleidoscope fragment build story extract make diary trial transcript main character early history begin end work towards solution middle surprise end chapter little hint wonder suspect murderer read wife get end sink maybe worth read second time appreciate clever craft linear narrative fragment come place author make sense make sense many event make live important fragment woven story main character marriage reminiscent title base character parallel young woman go astray child religious hypocritical mother mistreats oppose mother live childhood poverty approximately period novel deal popular theater influence life behavior urban mass say never dirty muse be consistent integrated person series different self react different people meet selection stage persona post structuralists tend fixed unity flux process adapts different situation discourse encounter act night move theater girl boy man woman play many part hardly time yet somehow always indian squaw waiter milkmaid train driver always conjure people thin air spinster man master mask pose endless real mental breakdown character disintegrate people get wish understand condition sense create read well essay famous clown identify saw parallel life become lay sick die repeat word word farewell speech deathbed believe delirious emphasize product culture thought behavior reflect cultural textual experience everything say complex origin textual cultural source sometimes believe make ink paper say interest literary criticism reflect most character involve text either read write stage act character essay take shelf read essay pantomime write first public essay extol compassionate prose obviously essay murder essay evokes sinister city footstep flare light house pack close together lachrymose alley false door surely author borrow crime plot ominous atmosphere approach doom narrate point view access killer disturb mind parallel murder act theatrical imagery depict murderer much artist crime even go far use set house method murder use mallet razor crush victim skulls cut throat story mask wear life borrow plan write urban poverty crime disease engender street collect material instead first place study reserve copy concern life indigent vagrant capital reason especial interest so imitates work others integration find become place almost mystical quality meeting point various text discourse root event derive giant library say affected course human history share author sense place identification spiritual home live valley shadow close center spirituality come ackroyd interest white go hand hand shop find wonder invention calculate machine life soul trap maybe prefigure computer alternative online persona social networking site evasion life gay author gay character detective engineer strange term use describe people probably commonly use time childhood spent house wallpaper page bible bible reference accurate death bed confession show feistiness fry eternally surprise father childish notion think hell sole also mix reality pretense regard fun rather music hall spend work everything create beware create hang begin murder husband guilty take victorian world theater gross write superbly manage combine good crime wonderfully horrible writing quite simply masterpiece aspect remarkable whodunit suggests couple credible suspect right start even convict central character death hang even get know thing go obvious also study character especially central actor later also evocation late nineteenth century complete color smell vistas perspectives highly literary work ever conscious place beside genre skirt overall wonderful example form use inventively plot create series interlock stand accuse murder husband diary reveals certain secret want third strand learn past come life theater meet fourth strand follow career music hall player silent clown mentor stage life fifth strand see great city path inevitably cross great thinker writer artist course history thus character cross path writer thinker note tramp street day usual sex lot relationship usually top also come underneath sometimes side event accuse poison married life far conventional inadequacy motive series brutal killing prostitute others area result curious placement certain trophy killing attribute popular mind mythical creature make clay change shape examine jewish myth surround subject steer clear continue stage meet husband learn much stagecraft eventually resolve help complete play unsuccessfully labor plot resolve surprise everything make perfect sense real piece insight liken mass murderer perfect ultimate triumph individualism much stimulate mind review difficult diverse strand never converge quite contrary true come together wonderful manner resolution highly theatrical yet thoroughly credible many time great writer seamless mixture style technique brood sense place time jump create best fiction write today however say find left engage make care character complaint make movie appreciate master touch sometimes cold concept time fold repeat retrace one step spread start woman lead gallows last word here go echo excellent funny scary tragic enthralling recommend excellent twisting lead understand depth character mind love academic reference almost parallel story work partnership", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "As Elizabeth Cree sits every day in a courtroom, on trial for the murder of her husband, the story moves from courthouse to music hall to the back alleys of Limehouse, the notorious district of Victorian London, teeming with the poorest of the poor, the most violent of criminals and helpless preyed upon immigrants, following the trail of slaughter laid by the Golem, an almost mythical predecessor of Jack the Ripper.\r\n   \r\nFact and fiction blend effortlessly as Dan Leno, king of the music-hall comedians is dragged unwittingly into the investigation of one of London’s most notorious murders. When Karl Marx and George Gissing are connected to the same crime the possibilities are endless.", "asin": "0749385359", "rank": "9695373", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/415WVM8VCJL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}