{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 107, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Good quality, nothing to add and nothing to take."}, {"review_sentiment": 4.0, "review_text": "I picked up this book because it contains one of my favorite quotes. In fact, I even chose it as a reading at my wedding (with a few omissions).\"Love is a temporary madness, it erupts like volcanoes and then subsides. And when it subsides you have to make a decision. You have to work out whether your roots have so entwined together that it is inconceivable that you should ever part. Because this is what love is. Love is not breathlessness, it is not excitement, it is not the promulgation of promises of eternal passion, it is not the desire to mate every second minute of the day, it is not lying awake at night imagining that he is kissing every cranny of your body. No, don't blush, I am telling you some truths. That is just being \"in love\", which any fool can do. Love itself is what is left over when being in love has burned away, and this is both an art and a fortunate accident. Your mother and I had it, we had roots that grew towards each other underground, and when all the pretty blossom had fallen from our branches we found that we were one tree and not two.\"I had high hopes that the rest of the book would contain passages as beautiful as this one, and I was not disappointed. Louis de Bernieres is a language artist. There is a chapter titled, \"How like a Woman is a Mandolin,\" and it is striking. I encourage you to find it and read it. The characters are also beautiful, especially Carlo, a closeted but passionate gay soldier who leads a full but tragic life in distant, dutiful service to those he loves.Captain Corelli's Mandolin is a World War II novel, but it is atypical in that it's set in Cephalonia, Greece, during its Italian occupation. It is less about Jewish persecution and concentration camps, and more about how war disrupts and changes lives, no matter who they are or where they live. However, I must say that I'm disappointed that the back cover description of this book focuses on Captain Corelli. The book is really not about him, or about men. The book is really about Pelagia. It is told from a feminine perspective about a strong, smart woman who is equal parts romantic and feminist.It took me a long time to finish this book, but that was because the language and subject matter is so dense. It reads a lot like a classic novel, in fact. I'll also add that the last 150 pages or so moved much more quickly than the first 350. Really, it was a beautiful reading experience. It may be interesting to let this one ruminate and re-read in a year or so to see what more I get out of it."}, {"review_sentiment": 5.0, "review_text": "A well written and easy to read novel with an interesting story line narrated from different perspectives."}, {"review_sentiment": 4.0, "review_text": "Requested gift?"}, {"review_sentiment": 5.0, "review_text": "Beautifully written. One of the books that lived with me afterwards."}, {"review_sentiment": 4.0, "review_text": "An excellently written, but somewhat dark account of a love affair during WW2."}, {"review_sentiment": 5.0, "review_text": "Reader - bear with it ... takes a long time for the plot to be resolved.  Worth it, though!"}, {"review_sentiment": 5.0, "review_text": "Most enjoyable --- except for ending which falls flat"}, {"review_sentiment": 4.0, "review_text": "A great read capturing the folly and tragedy of war.  Written with great skill."}, {"review_sentiment": 5.0, "review_text": "I love this book. I have read it many times & will read it many more. It's my favourite book to give as a gift to a friend."}]}, "authors": ["Louis de Bernieres"], "isbn": "0749397543", "longitude": 0.0, "periods": ["1900s"], "title": "CAPTAIN CORELLI'S MANDOLIN", "word_cloud": "good quality nothing nothing pick contains favorite quote fact even choose read wed omission temporary madness erupts volcano subsides subsides make decision work root entwine together inconceivable ever part love breathlessness excitement promulgation promise eternal passion desire mate second minute day lie night imagine kiss cranny body blush tell truth love fool leave love burn away art fortunate accident mother root grow towards underground pretty blossom fall branch find tree high hope passage disappoint language artist chapter title strike encourage character also beautiful especially closet passionate gay soldier lead full tragic life distant dutiful service atypical set italian occupation le jewish persecution concentration camp war disrupts change life matter live however disappoint back cover description focus really men really tell feminine perspective strong smart woman equal part romantic take long time finish language subject matter dense read lot classic fact also add last page move much quickly first really beautiful read experience interest ruminate year see get well write easy interesting story line narrate different perspective request gift beautifully write live afterwards excellently write somewhat dark account love affair bear take long time plot resolve most enjoyable end fall flat great capturing folly tragedy war great skill love many time many favorite give gift friend", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "Extravagant, inventive, emotionally sweeping, Captain Corelli's Mandolin is the story of a timeless place that one day wakes up to find itself in the jaws of history. The place is the Greek island of Cephallonia, where gods once dabbled in the affairs of men and the local saint periodically rises from his sarcophagus to cure the mad. Then the tide of World War II rolls onto the island's shores in the form of the conquering Italian army.\r\n\r\nCaught in the occupation are Pelagia, a willful, beautiful young woman, and the two suitors vying for her love: Mandras, a gentle fisherman turned ruthless guerilla, and the charming, mandolin-playing Captain Corelli, a reluctant officer of the Italian garrison on the island. Rich with loyalties and betrayals, and set against a landscape where the factual blends seamlessly with the fantastic, Captain Corelli's Mandolin is a passionate novel as rich in ideas as it is genuinely moving.", "asin": "0749397543", "rank": "918113", "city": "Cephalonia", "image": "https://images-na.ssl-images-amazon.com/images/I/61OBUpEB5cL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}