{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 17, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Good story"}, {"review_sentiment": 5.0, "review_text": "yay"}, {"review_sentiment": 4.0, "review_text": "I was introduced to \"Absolute Beginners\" in the early 1980's through my admiration of Paul Weller, the lead singer and songwriter of The Jam, one of the greatest British rock bands of all time. The bands single of the same name remains one of my favorite tracks, and decades later, I finally got around to reading this novel. Much like Paul Weller, the late author Colin MacInnes, writes in a style so full of British slang and mannerisms, that you feel you really are in London in 1959 as you fall in love with this book and its cast of colorful characters. The story takes you on a fast paced trip through London, where you meet many interesting people, get a feel of different neighborhoods and an understanding of family, race, culture and class issues that are a part of human nature today. If you want to read a great story and feel the inspiration of youth, buy this book and spread the spirit of Absolute Beginners everywhere!"}, {"review_sentiment": 1.0, "review_text": "Totally stupid book.  Characters are more shallow than . . . well, than in any other book I've ever read.  It's such a waste of time."}, {"review_sentiment": 4.0, "review_text": "A piece of History that few of us ever knew happened. Mr McInnes's writing easily lends itself to visualization if the events. I also saw the movie but it was far different than the book. I believe I enjoyed the book more than a little bit more."}, {"review_sentiment": 4.0, "review_text": "I got it because I wanted the feel of old London.  You definitely get that here, but the time is maybe a little too remote."}, {"review_sentiment": 3.0, "review_text": "An interesting novel on the Dandy lifestyle and how it has progressed in the modern era."}, {"review_sentiment": 4.0, "review_text": "A book of its time tells the story of the beginning of the teenage phenomenon in England in the 1950s.  It deals with social issues such as the race riots which occurred in London in the 50s.  Written in the teenage/beatnik language of the times.  There are two main characters the 19 year old hip narrator and the city of London itself."}, {"review_sentiment": 2.0, "review_text": "The first half of the book I found particularly boring & with very little happening. There was little or no plot. The second half fares better. I found the way the main \"cat\" spoke was both unrealistic & pretentious for a teenager. (or absolute beginner) Heck even the term \"absolute beginner\" is a pretentious pile of bollocks. After reading this book I have little motivation to see the film. Whilst the ending is pretty good I can't really recommend it considering that there are so many great books out there to read. It's almost as if the author was trying too hard to be arty, intellectual & profound.2.5 stars - Avoid."}, {"review_sentiment": 5.0, "review_text": "MacInnes captures perfectly the atmosphere and energy of late 50s London. His writing has energy and wit. This book is more than fifty years old, but sounds more vibrant than then majority of contemporary writers. Don't be influenced by Julien Temple's lackluster movie. Check out the source."}]}, "authors": ["Colin MacInnes"], "isbn": "0749009985", "longitude": -0.12574, "periods": ["1900s"], "title": "Absolute Beginners", "word_cloud": "good story ya introduce early admiration lead singer songwriter greatest british rock band time band single name remain favorite track decades later finally get read much late author write style full slang mannerism feel really fall love cast colorful character story take fast paced trip meet many interest people get different neighborhood understand family race culture class issue part human nature today want great story feel inspiration youth buy spread spirit everywhere totally stupid character shallow well ever waste time piece ever know happen write easily lend visualization event also saw movie far different believe enjoy little bit get want feel old definitely time maybe little remote interesting lifestyle progress modern era time tell story begin teenage phenomenon deal social issue race riot occur language time main character year old hip narrator city first half find particularly boring little happen little plot second half fare better find way main cat speak unrealistic pretentious teenager beginner even term beginner pretentious pile bollock read little motivation see film end pretty good really consider many great almost try hard arty intellectual star avoid machine capture perfectly atmosphere energy late write energy wit fifty year old sound vibrant majority contemporary writer do influence lackluster movie source", "genres": ["Fiction & Literature"], "summary": "London, 1958. Smoky jazz clubs, coffee bars and hip hang-outs. The young and the restless were creating a world as different as they dared from England's green and pleasant land. \r\n\r\nFollow our young photographer as he records a young teenager's life in the capital - sex, drugs and rock'n'roll; the era of the first race riots and the lead up to the swinging sixties. \r\n\r\nA twentieth-century cult classic, Absolute Beginners paints a vivid picture of a changing society with insight and sensitivity.", "asin": "0749009985", "rank": "203258", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/61quMPTIhUL.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}