{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 2, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Having lived through the turmoil and upheaval that characterized Ghana in the late 70s and early 80's this book made me gasp, smile and shake my head in recognition and despair , so vividly accurate was the author's depiction of life during that period - from the chaos and ridiculous randomness of coups, the food shortages, the sights and smells of Accra, the disillusionment of post independence right down to the peculiar passive aggressive behaviors of the locals. Beautifully written story , totally true to its setting , evoking bittersweet nostalgia for one of the most challenging periods in Ghana's recent past."}, {"review_sentiment": 5.0, "review_text": "Interesting reading about the challenges and impressions of 4 foreign spouses in Ghana trying to make a good life for themselves and the family."}]}, "authors": ["Marilyn Heward Mills"], "isbn": "0751538140", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Association of Foreign Spouses", "word_cloud": "have live turmoil upheaval characterize late early make gasp smile shake head recognition despair vividly accurate author depiction life period chaos ridiculous randomness coup food shortage sight smell disillusionment post independence right peculiar passive aggressive behavior local write story totally true set evoke bittersweet nostalgia challenge period recent past interest reading challenge impression try good life family", "genres": ["Fiction & Literature", "Mystery & Suspense", "Women's Fiction"], "summary": "Marriage to a handsome Ghanaian architect has brought Eva far from the quiet English countryside. Alfred had made it sound heavenly but the hardship drained her of vitality and the foreign culture bewildered her. But Eva has her friends - Dahlia, Yelena and Margrit - all of them strangers in a foreign land, who rely on each other to fill the gaps left by distant relatives.\r\n\r\nWhen a sudden coup unnerves everyone, and Eva's relationship with Alfred begins to unravel, The Association of Foreign Spouses discover that there are dark sides to their lives and that they must scheme and deceive to protect themselves and their families.\r\n\r\nSet in Ghana in the turbulent eighties, The Association of Foreign Spouses is a story of a group of women who live in a land that at times defeats them, amongst people who often disappoint and baffle them. Yet through their trials and hardships, the women support each other, unified by their foreignness, as ultimately, they are wooed by this strange place that they come to call 'home'.", "asin": "0751538140", "rank": "2823420", "city": "Ghana", "image": "https://images-na.ssl-images-amazon.com/images/I/51XKYpjBR8L.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}