{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 5, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Is Harry on the boat? Yes he most certainly is!  This book, not for the prim and proper, encaptures all the thrills and spills of a young persons holiday abroad.  The storyline, or lack of, only adds to the overall flavour of the book.The book focuses on the lives of some holiday reps that are currently working in Ibiza.  The detailing of their activities is superb and really captivates the reader.  Colin Butt's portrayal of young people and what they get up to on their holiday is spot on.  He is a realistic writer, who is definitely in tune with a young person's mind.  He knows what people go on holiday for and how they plan to get it.The story, although slightly non-existent in places, still manages to keep the reader enthralled and waiting to find out what happens next.  His descriptions of sexual activity are vivid and at times comical.  His terminology for such activities are fantastic and had me in stitches!I thoroughly enjoyed reading this whilst I myself was on holiday.  It made the perfect read whilst sitting by the pool! A thoroughly enjoyable read if you want something light-hearted, entertaining and X-rated!"}, {"review_sentiment": 3.0, "review_text": "I thought Colin Butts book describing life as a rep on Ibiza was enjoyable and havn't yet seen the film but on the strength of this book, would make it a date."}, {"review_sentiment": 5.0, "review_text": "This book is brillinat. A brillinat laugh and a true insight to teh life of a rep in ibiza! I thought the book was well written and well portrayed! Also the whole book is based on true storys non of it is made up stuff that the author thought of!I have recently watched the Movie which was full of laughs but not nearly as good as this book!my advice ...order this book now!"}, {"review_sentiment": 5.0, "review_text": "I only have one thing to say:Go buy this book.It is one of the funniest things I have ever read. I was a rep last season, and the book tells the thruth... Seen from a mans perspective......Anyway, wicked, brilliant, excellent, fantastic book.... Made we want to go back for another season, cause I really miss it!!!!!"}, {"review_sentiment": 5.0, "review_text": "It's easy to dismiss this novel as summer trash.  And against more worthy titles it might be considered so.  Only the words \"critically acclaimed\" often mean something is dull and no-one bought it.  This book is fun.  The attention centres around Brad, a first year rep with Young, Free and Single.  Of course he has his fair share of sexual conquests, and there is the \"competition\" amongst the staff as to which rep is the most promiscuous.  It is set in Ibiza after all.  But it is by no means a dumb sex and sun novel.  Colin Butts has done an excellent job of filling us in on the characters, the shy Lorraine, the vain Mario.  All the time the plot ticks along, and there is a plot.  Back at head office there are financial irregularities about to be exposed, which conclude with the managers descending on the resort.  I read this book while in Gran Canaria and thoroughly enjoyed it."}]}, "authors": ["Colin Butts"], "isbn": "0752834584", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Is Harry on the Boat?", "word_cloud": "boat certainly prim proper enraptures thrill spill young person holiday abroad story line lack add overall flavor focus life holiday rep currently work detailing activity superb really captivate portrayal young people get holiday spot realistic writer definitely tune young person know people go holiday plan get story slightly place still manage enthralled wait find happen next description sexual activity vivid time comical terminology activity fantastic stitch thoroughly enjoy read whilst holiday make perfect whilst sit pool thoroughly enjoyable want something entertain think describe life rep enjoyable ha yet see film strength date brilliant brilliant laugh true insight the life rep ibiza think well write well portray also whole base true story non make stuff author think recently watch full laugh nearly good advice order thing say buy funniest thing ever rep last season tell truth seen man perspective wicked brilliant excellent fantastic want back season cause really easy dismiss summer trash worthy title consider only word critically acclaim often mean something dull buy fun attention center first year rep course fair share sexual conquest competition among st staff rep promiscuous set mean dumb sex sun do excellent job fill character shy vain time plot tick plot head office financial irregularity expose conclude manager descend resort thoroughly enjoy", "genres": ["Fiction & Literature", "Humour"], "summary": "The brilliantly funny cult novel about holiday reps in Ibiza.\r\n\r\nYou arrive at the airport to be greeted by a sun-tanned clipboard bearer, there to make your dream holiday come true. But behind the smiles, the badge and the suspect command of the native lingo, what really goes on? Are they a happy, celibate team working for the benefit of their clients, or are they at each other's throats to get their share of backhanders, drugs and sleeping with holidaymakers (or each other!)?\r\n\r\nExactly how low is resort manager Alison prepared to go to maximise her cash gains in her last season, and how low is first year rep and none-too-bright former male model Mario prepared to go to win the infamous \"Competition\"? Which reps will Alison get rid of? Shy Lorraine? Mickey, the first ever black rep? The clubbing mad and girl-crazy Scouse Greg? Or will it be Brad, as we follow him from bedroom to beach, stumbling across company business that he shouldn't?", "asin": "0752834584", "rank": "5188977", "city": "Ibiza", "image": "https://images-na.ssl-images-amazon.com/images/I/51gZdQvWIDL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}