{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 64, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I read Lynette's book when it first came out almost 10 years ago and really enjoyed it.  However, I have re-read it in the last few days because I am headed to Cuba to learn more about Cuba and its culture.  My re-read is has been so enjoyable because of the perspective she brings in a great story telling way and I am at a place where I am looking forward to experiencing the Cuban culture.  Lynette shares so many details and experiences with real Cuban families and Cubans she meets that you can't help but feel the camaraderie between everyone and yet Lynette shares the tough living conditions too.  She shares all these experiences from such a positive point of view that you have a smile on your face and can't wait to turn the page to her next adventure.  Her book is a breath of fresh air among the history and news articles I have been reading through to prepare me for my trip.  I encourage anyone that likes reading about adventures in an uplifting page turner type of book, The Handsomest Man in Cuba is a wonderful read."}, {"review_sentiment": 5.0, "review_text": "A witty, sharp, articulate book. Cyclists will be immediately attracted by the narrative of solo trip through Cuba, and on this ground alone the book is gripping. Still this is no more a book about cycling than The Old Man and the Sea is a book about fishing (without putting the author's prose in the same league as that of H, as pleasant as hers is). An obvious recommendation for cyclists and those interested in Cuba. Even more so to those who above all do not want to lead boring lives.[The review title is from a song in the book penned by its author.]"}, {"review_sentiment": 5.0, "review_text": "Entertaining, amusing, interesting and fun!"}, {"review_sentiment": 4.0, "review_text": "I took the Handsomest Man In Cuba as my reading companion while traveling and truly enjoyed the authors accounts of her travels through Cuba on a bike.  What I found most enjoyable was her completely honest accounting of her interaction with the Cuban nationals and other visitors that she met along the way.  Her own philosophy on spending and the (perceived) value of things in a country that has so little is a big part of the book but it is an interesting perspective.  It was a book about a culture, a way of traveling, and a way of living ones life where ever we find ourselves. It is an honest account of a single woman traveling alone in an impoverished country and doing it all by carrying EVERYTHING she needed on a bike and doing this for 3 months with out glamorizing or over dramatizing any of the events.  It was about the experiences themselves and those she encountered and places visited more then about her having these experiences and I found that refreshing.  It really is an interesting view on a society that not many Americans have had a chance to experience through the eyes of someone who loves meeting people, eating and bicycling.  It was a great travel companion."}, {"review_sentiment": 5.0, "review_text": "I stumbled on this book as it was a featured read at the Brooklyn Public Library. As an avid cyclist and bike-tourist wannabe, I grabbed it. A disclaimer: I have owned about three Bike Fridays, so I had an automatic affinity for the material. But Lynette Chang delivers the kind of intimate, scintillating, funny, and frankly astonishing look at a place that won't be the same once it is opened to American chain restaurants, and that symbol of colonial-branding mediocrity everywhere: Rock n' Roll Cafe. It helps that Chang is adventurous enough to try just about anything, and willing enough to endure the kind of overnight digs that I would much rather read about than do myself. Thus, like all good travel writing, what you get, as a reader, is the change to sit back, relax and enjoy someone else's wild ride! And wild it is. Read and enjoy!"}, {"review_sentiment": 5.0, "review_text": "From the very first lines of a Cuban Christmas throughout the rest of the book, Lynette Chiang takes the reader onto a special and unique tour of the república de Cuba- a Journey. Some may consider it is a one of a kind travel book, some bicycle aficionados may tell that it is a story that makes you want to ride your bike. The Handsomest man in Cuba is first and foremost a book about several stories wrapped up in an unforgettable journey told by a remarkable and irreproachable protagonist whom has the ability to make any reader thrive in their quest for adventure or escapade. The authenticity, sincerity and beauty of each of the stories rendered therein overpower any governmental or political moods and give a powerful message and a sophisticated, yet natural perspective, about the true meaning of life and happiness in this part of the world."}, {"review_sentiment": 5.0, "review_text": "I'm not really a fan of travel books, but I am a touring cyclist and Lynette Chiang's description of her solo bicycle trip around Cuba immediately drew me in.  She spends time with the real people of the country, away from official tourist sites, and gives a detailed description of their day-to-day lives.  There are colorful characters, a variety of food I've never heard of before, and numerous adventures -- both good and bad, mechanical and ethical -- that cyclists often encounter. There's also some lively musings on the contrasts between Cuba and more developed countries.  A fun read and a must for anyone thinking of traveling to Cuba -- by bike or otherwise."}, {"review_sentiment": 5.0, "review_text": "I found it difficult to put this book down and am now sad that I have finished it!  Lynette Chiang captures the reader's interest and emotions very early on in the book.The soul of the Cuban people came alive for me within the pages of this work and I consider the author to be, not only a talented writer, but, an adept anthropologist as well!I hope Lynette Chiang continues to give us more of her commentary about the people she meets in her travels!"}, {"review_sentiment": 5.0, "review_text": "The Handsomest Man in Cuba is a great read in large part because author Lynette Chiang is an engaging person to hang out in Cuba with.  She is loaded with inquisitiveness, pluck and adventure making it figuratively fun to go along on her ride.She also is a good with imagery. She writes as if the pen were a camera, using words to compose pictures of photographic-level clarity.I especially appreciated her frank ongoing internal dialogue about money and social largess. Is it fair that foreigners are so overcharged?  To what extant is she morally obligated to play \"fairy godmother\" (her term)?  How can she reconcile the bountiful generosity of an impoverished people while she worries about being down to her last couple thou?  She bravely grappled openly with these complex issues even if she sometimes came off stingy and self-seeking.At one point there was an ugly groping. Chiang, already impressive as a single woman traveling alone, issued a fusillade of vitriol to repel her attacker. Wow.  Bravo, sister. Bloody well done.In spite of everything that makes the book a great read, one thing really concerned me.  There was zero mention of the crushing U.S. embargo against Cuba or the relentless siege to undermine if not overthrow the government - the Bay of Pigs being the most famous example, if not the reportedly 638 CIA attempts to assassinate Fidel Castro.If this were strictly a human interest / travel book, I would not even raise the issue.  But often enough Chiang asserts political commentary, describing how people want to be able to make more money and get ahead in life.  With little historical context supplied, the implication is that the Cuban government is a one-dimensional bureaucracy that refuses to allow the poverty-stricken populace the opportunity to improve their lives through the fruits of capitalism.Within a narrow scope, that narrative makes sense.  But widen the lens. For over 40 years, U.S. sanctions makes illegal American trade with or travel to  Cuba and  isolates this little island by penalizing other countries who do so. The root of Cuba's poverty is not a government obsessed with controlling its people.  Rather, Cuba's poverty is the result of the longest-running trade blockade in modern history by the most powerful country in the world.If Chiang does not want to bring up these ugly politics, fine.  But the minute she opened that door, it was incumbent on her to correctly depict the political reality.  By failing to mention the U.S.'s pathological policy to strangle the Cuban revolution, she somewhat undermines all the goodwill her book engenders for Cuba and its people."}, {"review_sentiment": 5.0, "review_text": "I absolutely loved this book. I've read many travel books and cycling books but Lynette Chiang's keen eye and personality makes this book very special. I found myself re-reading paragraphs just to experience Lynette's delightful humor again. I loved her observations and commentary about Cuba, cycling, and people. It's like \"Eat Pray Love\" meets \"Into the Wild\"."}]}, "authors": ["Lynette Chiang"], "isbn": "0762743905", "longitude": -82.3658671, "periods": ["2000s", "Recent Releases"], "title": "The Handsomest Man in Cuba: An Escapade", "word_cloud": "lynette first come almost year ago really enjoy however last day head culture enjoyable perspective brings great story tell way place look forward experience culture share many detail experience real family meet camaraderie everyone yet share tough living condition share experience positive point view smile face turn page next adventure breath fresh air history news article read prepare trip encourage anyone like read adventure uplifting page turner wonderful witty sharp articulate cyclist immediately attract narrative solo trip ground alone grip still cycle fish put author prose league pleasant obvious recommendation cyclist interested want lead boring live review title song pen author entertain amuse interesting fun take read companion travel truly enjoyed author account travel find enjoyable completely honest accounting interaction national visitor meet along way philosophy spending perceive value thing country little big part interest perspective culture way travel way living one life ever honest account single woman travel alone impoverished country carry need bike month glamorize dramatize event experience encountered place visit experience find refresh really interesting view society many chance experience eye someone love meet people eat bicycle great travel companion stumble featured avid cyclist wannabe grab disclaimer own automatic affinity material delivers kind intimate scintillate funny frankly astonish look place open chain restaurant symbol mediocrity everywhere help adventurous enough try anything willing enough endure kind overnight dig much rather thus good travel write change sit back relax enjoy someone else wild ride wild enjoy first line rest take special unique tour replica kind travel bicycle aficionado story make want ride first foremost several story wrap unforgettable journey tell remarkable irreproachable protagonist ability make thrive quest adventure authenticity sincerity beauty story render therein overpower governmental political mood give powerful message sophisticate yet natural perspective true mean life happiness part world really fan travel tour cyclist description solo bicycle trip immediately draw spend time real people country away official tourist sit give detailed description life colorful character variety food never hear numerous adventure good bad mechanical ethical cyclist often encounter also lively musing contrast develop country fun anyone think travel bike otherwise find difficult sad finish capture interest emotion early soul people come alive page work consider author talented writer anthropologist well hope continue commentary people meet travel great large part author engage person hang load inquisitiveness pluck adventure make figuratively fun go along also good imagery write pen camera use word compose picture especially appreciate frank ongoing internal dialogue money social largess fair foreigner overcharge morally obligate play fairy godmother term reconcile bountiful generosity impoverish people worry last couple bravely grapple openly complex issue even sometimes come stingy point ugly grope already impressive single woman travel alone issue fusillade vitriol repel attacker sister well spite everything make great thing really concern mention crush embargo relentless siege undermine overthrow government famous example reportedly attempt assassinate strictly human interest travel even issue often enough assert political commentary describe people want able money get ahead life little historical context supply implication government bureaucracy refuse allow populace opportunity improve live fruit narrow scope narrative make sense widen lens year sanction make illegal american trade travel isolate little island penalize country root poverty government obsess control people poverty result trade blockade modern history powerful country want bring ugly politics fine minute open door incumbent correctly depict political reality fail mention pathological policy strangle revolution somewhat undermines goodwill engenders people absolutely love many travel cycle keen eye personality make special find paragraph experience delightful humor love observation commentary cycling people meet", "genres": ["Travel Writing"], "summary": "An engaging, witty account of the people, customs, food, and culture of Cuba framed by a fascinating approach to travel. With only a folding bicycle and a towable suitcase, Australian Lynette Chiang spent three months touring Cuba, eschewing tourist hotels and typical itineraries in favor of an unpredictable day-to-day existence among ordinary citizens. She discovered a people who, despite great privation, are warm, generous—and generally happy. Her narrative covers equally well the challenges of travel on two wheels and the surprises of life in the land of Fidel.", "asin": "0762743905", "rank": "995074", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51I2o%2BawN1L.jpg", "country": "Cuba", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}