{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 156, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Love this book! I have read it several times over! Very happy with my purchase!"}, {"review_sentiment": 5.0, "review_text": "loved the book!"}, {"review_sentiment": 5.0, "review_text": "One of my favorites! Read it so many times!"}, {"review_sentiment": 4.0, "review_text": "a little drawed out.  But its okay."}, {"review_sentiment": 5.0, "review_text": "Definitely a favorite of mine. Yes, I did get annoyed with the protagonist on occasion because she was so stubborn in her ways, but I understood where she was coming from and her struggle to stay moral in a place where morals seem inconsequential. Many of the errors/challenges Rachel made or faced came from inexperience and naiveté, which she would soon come to recognize and strived to problem solve in the best way she knew how. I don't have any scruples with the writing/characters themselves because I feel they are well written and designed to be flawed just like we all are; any frustration I have is with Rachel's inconsistency and mixed signals she sent regarding her love interest, which I feel is a very human, youthful mistake. In light of all that I've said, I enjoyed seeing the characters grow and appreciated how the author concluded the story. If you like this book or Romance/Historical Fiction in general, I strongly recommend Redeeming Love by Francine Rivers, or anything by Karen Witemeyer."}, {"review_sentiment": 3.0, "review_text": "The first part of the book was very disturbing but at the end I see a tremendous lesson was learned in thereby to be taught to others."}, {"review_sentiment": 5.0, "review_text": "I AM WONDERING IF THERE IS A CONTINUATION OF THIS STORY IN ANOTHER NOVEL.  I REALLY ENJOY YOUR NOVELS.I Would recommend your novels to friends and family"}, {"review_sentiment": 4.0, "review_text": "I enjoyed the story especially because it portrayed a time in San Francisco's history I was unfamiliar with."}, {"review_sentiment": 5.0, "review_text": "Great story"}, {"review_sentiment": 5.0, "review_text": "A great read; I didn't want it to end!"}]}, "authors": ["Deeanne Gist"], "isbn": "0764202855", "longitude": -122.4192363, "periods": ["1800s", "Recent Releases"], "title": "The Measure of a Lady: A Novel", "word_cloud": "several time very happy purchase love favorites many time little drawl okay definitely favorite mine get annoyed protagonist occasion stubborn way understand come struggle stay moral place moral seem inconsequential make face come inexperience naivete soon recognize strive problem solve best way know scruple feel well write design flaw frustration inconsistency mixed signal send regard love interest feel human youthful mistake light say enjoy see character grow appreciate author conclude story general strongly recommend redeem anything first part disturb end see tremendous lesson learn thereby taught others be wondering be continuation novel friend family enjoy story especially portrayed time history unfamiliar story great want end", "genres": ["Fiction & Literature", "Romance", "Historical Fiction"], "summary": "Rachel van Buren arrives in Gold Rush San Francisco with two wishes: to protect her younger siblings and to return east as soon as possible. \r\n\r\nBoth goals prove more difficult than she could imagine as her brother and sister are lured by the city's dangerous freedom and a missionary-turned-gambler stakes a claim on her heart. Rachel won't give up without a fight though, and soon all will learn an eloquent but humorous lesson about what truly makes a lady. \r\n\r\nSpeak Politely. Even when you're the only respectable woman around, protesting the decadence of a city lost to gold fever. Dress Modestly. Wear your sunbonnet at all times. Ensure nobody sees your work boots muddied by the San Francisco streets. Remain Devoted to Family. Protect your siblings from the lures of the city, even against their wishes. Stand Above Reproach. Most difficult when a wonderful man turns out to be a saloon owner. Rise Above Temptation. No, not even just a little kiss…. \r\n\r\nWhen these rules become increasingly difficult to uphold, can Rachel Van Buren remain a beacon of virtue in a city of vice?", "asin": "0764202855", "rank": "2230152", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51NT4EBVJ7L.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}