{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 11, "rating": 3.7, "reviews": [{"review_sentiment": 3.0, "review_text": "Gratuitous in its erotic language--and gross at that. Slow read"}, {"review_sentiment": 3.0, "review_text": "Despite the wonderful depth of a Breughel painting I found this novel tedious in its detail.  Of course, the emulation of its namesake begs for detail, however somehow the author irritated and lost me.  To finish was a relief and the sign-off sentence predictably dull."}, {"review_sentiment": 5.0, "review_text": "Brilliant. Offers a clear view of late medieval history, while still retaining plot twists and surprises around every corner."}, {"review_sentiment": 2.0, "review_text": "this is a very well written and researched biography of Peter Bruegel and his life and times.  the book also does an excellent job of explaining some of Bruegels more important paintings."}, {"review_sentiment": 5.0, "review_text": "Good novels about the lives of artists are hard to find.  I had never read Rudy Rucker but I want to read other books by him.  It is well written and envolves you from the first page."}, {"review_sentiment": 5.0, "review_text": "SF isn't my bag but this was and I searched RR again hoping he had written others about other artists."}, {"review_sentiment": 4.0, "review_text": "Rudy Rucker has managed to give some insight into the thought processes that created the wonderful works of this 16th century Flemish painter as well as exposing the reader to the hardships endured by the residents of the \"low countries\" during the merciless Spanish control of the Netherlands.Brugels early works give a birds-eye perspective of the subject matter as well as depicting religious events as if they were happening in the 16th century. It is my belief that M.C. Escher as well as Salvador Dali both capitalized on Brugels early vision.(See Escher's Tower of Babel as well as Ascending & Descending and several of Dali's works. All appear to have been inspired by Brugel's \"Fall of the Rebel Angels\".) Both of these men owe a large debt of gratitude to Brugel for his inspiration.Although this book is \"historical fiction\", the author has done such an exemplary job of providing a discerning and perceptive insight into Brugels life and times, it almost reads like a biograpy.If you enjoy history, art, and great storytelling this book is definitely for you!  4 1/2 stars!!!!"}, {"review_sentiment": 3.0, "review_text": "Rucker builds a series of chapters around particular paintings by Bruegel, in order to produce a biographical novel that is well-informed concerning the (known) historical details of Bruegel's life and the political and cultural history of the day.  The book offers a good way to get engaged with the period and with the paintings.  The writing is a bit clunky, and the novel works more because of the inherent interest of the artist and the period than by what the writer contributes.  I could easily have put the book down had other things been available, but as it was it served as a welcome companion during a day of many, many delayed flights and long layovers as I flew across the US."}, {"review_sentiment": 5.0, "review_text": "My husband and I both love this story of Peter Breugel's life.  The book was well researched and obviously written by someone with a life-long passion for Breugel the man, as well as his paintings.  It is a beautiful story.  My husband and I  both agree, we want to go to Europe and see his original paintings after reading this book."}, {"review_sentiment": 5.0, "review_text": "Not only is this book well-researched and documented but it is an easy read. The times of Europe in the l6th century are colorfully presented and the characterizations are believable. It's easy to get caught up in the intrigues. I'll now view  Peter Bruegel's works in a new light. Well-worth a read!"}]}, "authors": ["Rudy Rucker"], "isbn": "076530404X", "longitude": 12.4829321, "periods": ["1500s"], "title": "As Above, So Below: A Novel of Peter Bruegel", "word_cloud": "gratuitous erotic language gross wonderful depth painting find tedious detail course emulation namesake begs detail however somehow author irritated lose relief sentence predictably dull brilliant clear view late medieval history still retain plot twist surprise corner well write research biography life time also excellent job explain important painting good novel live artist hard find never want well write evolve first page bag search hop write others artist manage give insight thought process create wonderful work century painter well expose hardship endure resident low country merciless spanish control early work give perspective subject matter well depict religious event happen century belief well capitalize early vision well several work appear inspire men owe large debt gratitude historical fiction author do exemplary job provide discern perceptive insight life time almost read enjoy history art great storytelling definitely star build series chapter particular painting order produce biographical concern known historical detail life political cultural history day offer good way engaged period paint write bit clunky work inherent interest artist period writer contributes easily thing available serve welcome companion day many many delayed flight long layover fly husband love story life well research obviously write someone passion man well paint beautiful story husband agree want go see original painting read not document easy time century colorfully present characterization believable easy caught intrigue view work new light", "genres": ["Fiction & Literature", "Art & Architecture", "Historical Fiction", "Renaissance"], "summary": "Peter Bruegel's paintings---a peasant wedding in a barn, hunters in the snow, a rollicking street festival, and many others---have long defined our idea of everyday life in sixteenth- century Europe. They are classic icons of a time and place in much the same way as Norman Rockwell's depictions of twentieth-century America. We know relatively little about Bruegel, but after years of research, novelist Rudy Rucker has built upon the what is known and has created for us the life and world of a true master who never got old. \r\n\r\nIn sixteen chapters, each headed by a reproduction of one of the famous works, Rucker brings Bruegel's painter's progress and his colorful world to vibrant life, doing for Bruegel what the best-selling Girl with a Pearl Earring did for Vermeer. We follow the artist from the winding streets of Antwerp and Brussels to the glowing skies and decaying monuments of Rome and back. He and his friends, the cartographer Ortelius and Williblad Cheroo, an American Indian, are as vivid on the page as the multifarious denizens of Bruegel's unforgettable canvases.\r\n\r\nHere is a world of conflict, change, and discovery, a world where Carnival battles Lent every day, preserved for us in paint by the engaging genius you will meet in the pages of As Above So Below.", "asin": "076530404X", "rank": "1453716", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51MNDSttTkL.jpg", "country": "Italy", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}