{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 121, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "A great novel that gives a clear overview of Irish history.  There are a lot of groups and characters to keep track of."}, {"review_sentiment": 4.0, "review_text": "It was a good story about the start of the Irish rebellion that continued for many years to follow."}, {"review_sentiment": 1.0, "review_text": "Although I learned a lot in the pages I managed to endure, I abandoned it due to the clunky writing. Found more rewarding ways to cover the same material."}, {"review_sentiment": 5.0, "review_text": "This book gives insight into the Irish Rebellion that reads as if you were there."}, {"review_sentiment": 5.0, "review_text": "Research on the country and the people. That my grandparents were from."}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 5.0, "review_text": "Very eye-opening as to how the Brits treated their 'subjects.'  Scary to think we' have been in the same boat was it not for our Revolution.  God unite and save Ireland!"}, {"review_sentiment": 3.0, "review_text": "Too slow."}, {"review_sentiment": 4.0, "review_text": "We recently spent two weeks in Ireland. The last few days were in Dublin, including visiting the GPO and Kilmainham Gaol. We wanted to get some historical background with an audio book while we were driving around, and first started out with a general history of Ireland. But that was a difficult and dry listen. We then searched for some book more specifically about 1916, and stumbled on this book. It was exactly what we wanted: plenty of historical detail and atmosphere, but introduced at a slow pace, and giving life to the historical characters and the time. By the time we got to Dublin, we'd listened to more than half the book. The exhibits at the GPO, and the tour at the Gaol, then took on much more meaning to us than they might have otherwise.This is a book to describe the history, and not primarily just to entertain.The romance novel aspect was added fun, but wasn't our main attraction. The characters were clearly set up to intersect with the history. So if you're looking for bringing the history of the few years before 1916 alive, you'll enjoy this book."}, {"review_sentiment": 5.0, "review_text": "A thorough historic timeline blended with a well written fictional character base interacting with the pivotal historic figures of the Uprising of 1916 ..... A Great Selection for any reader who wants to understand Irish History while being transported to that time by cast of believable characters!"}]}, "authors": ["Morgan Llywelyn"], "isbn": "0765386143", "longitude": -6.2602732, "periods": ["1900s", "Recent Releases"], "title": "1916: A Novel of the Irish Rebellion", "word_cloud": "great give clear history lot group character keep track good story start continue many year follow learn lot page manage endure abandon due clunky write reward way cover material give insight read research country people grandparent great very treat boat unite save too slow recently spend week ireland last day include visit want historical background audio drive first start general history difficult dry listen search specifically stumble exactly want plenty historical detail atmosphere introduce slow pace give life historical character time time get listen exhibit tour take much mean history primarily romance aspect add fun main attraction character clearly set intersect history look bring history year alive enjoy thorough historic timeline blend well write fictional character base interact pivotal historic figure uprise want understand transport time cast believable character", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "At age fifteen, Ned Halloran lost both of his parents--and almost his own life--when the Titanic sank. Determined to keep what little he has, he returns to his homeland of Ireland and enrolls at Saint Edna's school in Dublin. Saint Edna's headmaster is the renowned scholar and poet, Patrick Pearse--who is soon to gain greater fame as a rebel and patriot. Ned becomes deeply involved with the growing revolution . . . and the sacrifices it will demand.\r\n\r\nThrough Ned's eyes, Morgan Llywelyn's 1916 examines the Irish fight for freedom--inspired by poets and schoolteachers, fueled by a desperate desire for independence, and played out in the historic streets of Dublin against the background of World War I. It is a story of the brave men and heroic women who, for a few unforgettable days, managed to hold out against the might of the British Empire.\r\n\r\nThe Irish Century Novels\r\n1916: A Novel of the Irish Rebellion\r\n1921: The Great Novel of the Irish Civil War\r\n1949: A Novel of the Irish Free State\r\n1972: A Novel of Ireland's Unfinished Revolution\r\n1999: A Novel of the Celtic Tiger and the Search for Peace", "asin": "0765386143", "rank": "251476", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51QHx2Gx5tL.jpg", "country": "Ireland", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}