{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 359, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "Excellent writing. Good suspense that makes you want to keep reading. would like to understand more of how the Blight turned people. Looking forward to the next one."}, {"review_sentiment": 5.0, "review_text": "What a fun escape! For steampunk lovers this is a must read.i can't wait to dig into the others in this series!!"}, {"review_sentiment": 4.0, "review_text": "I gave this book 4/5 stars because it just fell short for me. The story is an alternate universe tale set in zombie infested Seattle during the late 1800's.  A woman, Briar, travels from the safety of the Outskirts back across the protective wall into the unknown world of Seattle to search for her teen son. My favorite character was Briar and I think if the story had focused on Briar and her tremendous backstory, it would have been an outstanding book. Instead we got a whole lot of narrative about secondary characters who were interesting but nowhere near as great as Briar and her family. Too bad because I really wanted to only hear about Briar, her mad scientist husband who started the whole mess, and Briar's father who seemed like a Wyatt Earp type of character. I would recommend anyway because it was still an entertaining book."}, {"review_sentiment": 5.0, "review_text": "I absolutely loved this story.  And I'm an old dude.  I picked it up to satiate my new appetite for all things steampunk.  Those who complain about silly details need to chill out and just appreciate the overall storytelling.  Who freakin cares how long it actually takes for beans to cook?!?  I'll definitely check out the author's other works."}, {"review_sentiment": 5.0, "review_text": "Cherie Priest's backdrop for this alternative history/steampunk novel (the first in the series) is quite enjoyable.  I found the other books in the series to be similarly engaging as well."}, {"review_sentiment": 5.0, "review_text": "Boneshaker is a great read. It starts with an entertaining beggining that gets you hooked instantly. This book is ation packed and interesting, but I would not recommend  it to children under the age of 13, for it's use of swearing. Also because the plot may be hard to follow and understand for children. Yet I do suggest it to anyone who is persistent and patient enough to read it, for it is pretty long.  Some people don't like the beginning and quit right then and there, which,honestly, is stupid. Read the entire book before you judge it. One person said, ' It's so bad I could'nt get past 25% of the book.\"' How do you know it won't get better? In fact, it does get better. A lot better, in my opinion. So in conclusion, I think that you should give this book a try. Oh, if you're over 12, of course."}, {"review_sentiment": 5.0, "review_text": "I absolutely love this book and recommend it often to friends and family. The story is completely engrossing and you won't be able to put it down."}, {"review_sentiment": 3.0, "review_text": "Really wanted to like this book more. Characters and story were too predictable and the \"fog/mist\", if anything, took away from the story. It left little for your minds eye to imagine.It had a few points where I struggled to push through. It's not a bad book, but it's not awesome. I see a lot of potential from the writer though and will look for more of her books to give her a second chance."}, {"review_sentiment": 2.0, "review_text": "Stupid kid runs into zombie infested inner city, clueless parent follows. Adventures ensues. That's about it."}, {"review_sentiment": 4.0, "review_text": "A good steam punk story, well written. I enjoyed it, you will too."}]}, "authors": ["Cherie Priest"], "isbn": "0765318415", "longitude": -122.3300624, "periods": ["1800s", "Recent Releases"], "title": "Boneshaker", "word_cloud": "excellent write good suspense make want keep reading understand turn people look forward next one fun escape steampunk lover dig others series give star fell short story alternate universe tale set zombie infest late woman travel safety back protective wall unknown world search teen son favorite character think story focus tremendous backstory outstanding instead get whole lot narrative secondary character interest nowhere near great family bad really want hear mad scientist husband start whole mess father seem type character anyway still entertain absolutely love story old dude pick satiate new appetite thing steampunk complain silly detail need chill overall storytelling freak care long actually take bean cook definitely check author work backdrop alternative first series quite enjoyable find series similarly engage well great start entertain beg get hook instantly nation pack interesting child age use swearing also plot understand child suggest anyone persistent patient enough pretty long people begin quit right honestly stupid entire judge person say bad get past know better fact better lot better opinion conclusion think give try course absolutely love recommend often friends family story completely engross able really want story predictable anything take away story leave little mind eye point struggle push bad awesome see lot potential writer look give second chance stupid kid run zombie infested inner city clueless parent follow ensue good steam punk story well write enjoy", "genres": ["Fiction & Literature", "Historical Fiction", "Science Fiction"], "summary": "Book 1/6 in the Clockwork Century Series\r\n\r\nIn the early days of the Civil War, rumors of gold in the frozen Klondike brought hordes of newcomers to the Pacific Northwest. Anxious to compete, Russian prospectors commissioned inventor Leviticus Blue to create a great machine that could mine through Alaska's ice. Thus was Dr. Blue's Incredible Bone-Shaking Drill Engine born.\r\n\r\nBut on its first test run the Boneshaker went terribly awry, destroying several blocks of downtown Seattle and unearthing a subterranean vein of blight gas that turned anyone who breathed it into the living dead.\r\n\r\nNow it is sixteen years later, and a wall has been built to enclose the devastated and toxic city. Just beyond it lives Blue's widow, Briar Wilkes. Life is hard with a ruined reputation and a teenaged boy to support, but she and Ezekiel are managing. Until Ezekiel undertakes a secret crusade to rewrite history.\r\n\r\nHis quest will take him under the wall and into a city teeming with ravenous undead, air pirates, criminal overlords, and heavily armed refugees. And only Briar can bring him out alive.\r\n\r\n“Everything you'd want in such a volume and much more.... It's full of buckle and has swash to spare, and the characters are likable and the prose is fun. This is a hoot from start to finish, pure mad adventure.” Cory Doctorow", "asin": "B007YWEZNU", "rank": "4037562", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/31oqdqcxFpL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}