{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 49, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Six years after reading and still this book is with me, bubbling to the surface when I'm babbling on long car rides and inspiring me to try and explain why I'll never forget \"My Mother Was A Mountain, My Father Was A Washing Machine\" and the character borne of these wonderfully animate creatures. I'm overjoyed that a book like this can exist in our world, and even be linked to the mainstream world by the author's omnivoracity. I love Cory Doctorow's courage and his imagination, and this particular book stands the test of post-technological time, what a glorious gift for us all."}, {"review_sentiment": 5.0, "review_text": "Fantastic story - Doctorow is brilliant!"}, {"review_sentiment": 5.0, "review_text": "It starts out real good, a man is renovating his new home and the author is adding a boatload of details on how it is done. That's in itself is joyful as I am a sucker for renovation. Then he states something that you probably just think is a funny expression of his.A chapter later he says the same thing and adds another very curious observation. I just read along a bit nonplussed. Then another and I was totally hooked and.. Spooked in a fascinating way. It's all fabulous reading from that point.This was my first book by the author, I had read a novella before so I liked the way with words he had.After this... What a story, and what a strange man he must be. :-)"}, {"review_sentiment": 3.0, "review_text": "So this was pretty cool. Dark, creepy and completely absurd. The sex scene was hot even though (maybe because) he focused on her wings. The name changing thing was annoying at first but then got kinda fun. I think it was a good idea to make the main character a book lover because it immediately links the reader with the character (unless they're just a casual reader). The ending wasn't as satisfying as I wanted it to be but not terrible.This is the kind of thing I like to read once in a while to get out of reading the same kind of books (mostly fantasy and sci-fi) all the time. But since it didn't blow me away I probably won't read more by Doctorow unless the subject sounds really interesting."}, {"review_sentiment": 4.0, "review_text": "Just as its bifurcated title might suggest, Someone Comes to Town, Someone Leaves Town is really two books whose connection is never quite as clear or as strong as you might want. One of those tales is the story of Alan and Kurt, two kindred spirits working to establish a free wi-fi network in a small community in an effort to make a statement about the freedom of information and making a stand against major telecom corporations. It's obviously a story that's close to Doctorow's heart, and while it occasionally gets a little preachy, it's still a solid enough story about the building of communities and the way that rebellion and the freedom of information change with each generation. But that's not really the focus of Someone Comes to Town; what is the focus is Alan's unusual family. Here's a man whose father is a mountain, whose mother is a washing machine, and his brothers are an island, a dead man, and a series of Russian nesting dolls. And all of this is presented in the sort of accepting reality that, say, magic realism traffics in - until it runs into the other story of the novel. Someone Comes to Town can be frustrating at points, no question about it. The stories don't always mesh as well as I wish they did, the plotting feels incredibly unresolved by the end, and the writing becomes increasingly difficult as the book moves towards its end. And yet, for all of this, I was never less than fascinated by Doctorow's world and the characters he created. Though I got frustrated with the narrative dead-ends and some of the unneeded detours, Alan and his family make for a compelling story, and Doctorow fills the story with outcasts and loners who are every bit as interesting in their own way. Is it all a little oblique and cryptic? Without a doubt. But it's still inventive and fascinating, and I liked it all quite a bit in spite of my frustrations with it."}, {"review_sentiment": 1.0, "review_text": "No matter how cool Doctorow's blog articles etc are, I just can't get myself to read a book where so many stylistic liberties are taken. Okay, I can sort of try to pretend the whole mother-is-a-washing-machine and father-is-a-mountain thing is cool. I can sort of try to ignore the convoluted family tree. But for heaven's sake, stop referring to the characters with tons of names starting with the same initial. I know what you're trying to do. I don't like it. Did not finish, not sure if I'll ever revisit."}, {"review_sentiment": 4.0, "review_text": "Parts of this book are so well written that I had to force myself to put the book down and do something else.The story moves around and each segment sucks you in further.My only mild criticism is that the symbolism around one the characters and her relationships is so obvious I was literally embarassed at times while reading the book.The book iteslf is a great size to hold and read."}, {"review_sentiment": 2.0, "review_text": "At around fourteen, many of us feel like alienated weirdos. We can't communicate with our parents, our younger siblings are annoying, and our relationships with our age-peers constantly volley between friendship and hatred. All our emotions are magnified and weirdly distorted by constant surges of sex hormones we haven't really learned to cope with.Then over the next few years, you learn to cope with the hormones, and even though (like me) you might still be a weirdo, you don't feel so alienated. As Mark Twain said, \"When I was a boy of fourteen, my father was so ignorant I could hardly stand to have the old man around. But when I got to be twenty-one, I was astonished by how much he'd learned in seven years.\"In this volume, Doctorow takes a bunch of folks ranging from twenty-ish to forty-ish, injects them with metaphorical fourteen-year-old alienation drugs, gives a few of them supernatural reasons to actually be weirdos, and cuts them loose to play out a teen-angsty-mall-rat drama, except the mall is downtown Toronto.All the geeky sci-fi/fantasy fans I know are past the teen-alienation stage, but if I knew any, I'd happily buy this book for them. They'd read it and go, \"Oh, Bob, thank you so much! This book is the story of my life!\" So that's why I'm giving it two stars.But if you're old enough to have learned to cope with your hormones and don't feel alienated, and especially if you're married or otherwise have sex on a reasonably regular basis, it's all kind of \"Been there, done that, got the t-shirt, and boy am I glad I'm not there any more!\""}, {"review_sentiment": 4.0, "review_text": "Cory Doctorow's \"Someone comes to town...\" suffers from a case of split personality. On the one hand, it is a mysterious and engaging urban fantasy that takes several original characters and concepts and pits them against each other. It is refreshing to see how Doctorow takes so many elements of modern society and rearranges them to form something that is seemingly normal, but just odd enough to be macabre, disturbing, and enthralling. This part of the book is very good.On the other hand, there is the book's other personality, that of Doctorow's personal diatribe machine. He is known for his involvement in free information movements almost as much as for his books, and it is quite clear that Doctorow shoehorned one of his ideas (the need for the free flow of information via free, ubiquitous wi-fi) into the main plot. The problem is that this is feels out of place with regards to the rest of the novel, and the frequent changes between the bewitching main plot and the prattling about how awesome it would be to have free wi-fi all the time, are jarring. In some cases the plot comes to a complete and sudden halt while the main character goes off and builds wireless routers. And by sudden, I mean it; in one chapter, the protagonist is assaulted mentally and physically, and the following day he goes to do his wi-fi thing without even mentioning or thinking about what happened the night before.In conclusion, this book is very good, but it would do you well to skip all of the soapbox chapters on your first read-through and leave them for a later time. This book sometimes behaves as if it were two novels in one, and that is probably the best way to approach it."}, {"review_sentiment": 5.0, "review_text": "Someone Comes to Town, Someone Leaves TownFor me, a novel that changes the way we think about the world is a good novel, but one that changes the way we act--for good--is priceless. Here's what happened to me after reading Someone Comes to Town, Someone Leaves Town:Last year I moved into a nice rental here in Vancouver, and to make itaffordable I bought a cellphone with a data plan - no landline, nointernet, no cable - communications convergence for the frugal. Theapartment worked out great! One problem though, my wifi access over atethered jailbroken iphone sucked. Sadly, price and pride kept meplugging away, while all the locked access points in the vicinity seemedto righteously beam on.Around February I finished reading Cory Doctoro's novel, Someone Comes to Town, Someone Leaves Town. Whoa! This piece of storytelling about social change changed my world, and I suspect as a result will help many others as well!In the episode of 'unwiring' Kensington Market under the banner ofParasiteNet, I think Alan mentioned that if a person was borrowing internet access from someone down the hall they should offer their host five bucks amonth for their generosity. I thought that a pretty reasonablearrangement for steady signal - not easy though to track down the ownerin a dense neighbourhood. But my eyes were opened and I began to noticean unlocked access point showing up on my radar, then one day out ofdesperation, I connected to it. It was like biting into a big piece ofchocolate cake!I didn't think much more about finding and reimbursing the owner of thistreasure  island until I was listening to Nora Young talk about thelegalities of 'stealing' wifi on her show[...].That reminded me I need to find the owner of that hub and somehow comeup with an arrangement. We have a google-group for our building, so Iput out a message telling everyone that if they knew who owned theunprotected wireless hub that had started broadcasting in ourneighbourhood to let them know that I was going to donate $10 a month tothe foodbank for every month that I used their service. I then connectedto the Vancouver Foodbank and made my donation under the name of ... youguessed it, ParasiteNet.Three days later I received this:Hi Dave,\"LinkSys54g\" is our wireless access.Your idea is really nice,so feel free to use our internet access andmake a donation to a charity.Let's the kindness wrap the world !JennyAnd that's what I mean by fiction meets reality in a priceless jacket. I sincerely hope you get as much out of it as I did.-Dave}>"}]}, "authors": ["Cory Doctorow"], "isbn": "0765312808", "longitude": -79.387207, "periods": ["2000s"], "title": "Someone Comes to Town, Someone Leaves Town", "word_cloud": "year read still bubble surface babble long car ride inspire try explain never be be washing character borne wonderfully animate creature overjoy exist world even link mainstream world author omnivoracity love courage imagination particular stand test time glorious gift fantastic story brilliant start real good man renovate new home author add boatload detail do joyful sucker renovation then state something probably think funny expression chapter later say thing add curious observation along bit nonplussed then totally hook fascinate way fabulous read first author novella like way word story strange man so pretty cool creepy completely sex scene hot even maybe focus wing name change thing annoy first get kinda fun think good idea make main character lover immediately link character casual end satisfying want kind thing like read kind mostly fantasy time blow away probably subject sound really interest just bifurcate title really connection never quite clear strong tale story kindred spirit work free network small community effort make statement freedom information make stand major telecom corporation obviously story close heart occasionally get little preachy still solid enough story build community way rebellion freedom information change generation really focus unusual family here man father mountain mother wash machine brother island dead man series nesting doll present sort accept reality say magic realism traffic run story frustrating point question story always mesh well wish plot feel incredibly unresolved end write becomes increasingly difficult move towards end yet never le fascinated world character create get frustrated narrative unneeded detour family make compelling story fill story outcast loner bit interesting way be little oblique cryptic doubt still inventive fascinating like quite bit spite frustration matter cool blog article etc many stylistic liberty take sort pretend whole thing cool sort ignore convolute family tree heaven sake stop refer character ton name start initial know try like sure ever revisit part well write force put something story move segment suck mild criticism symbolism character relationships obvious literally embarrass time read itself great size hold around fourteen many feel alienate weirdo parent younger sibling annoy relationship constantly volley friendship hatred emotion magnify weirdly distort constant surge sex hormone really learn cope next year learn cope hormone even still feel alienate say boy fourteen father ignorant hardly old man get astonish much learn year volume take bunch folk range injects metaphorical alienation drug give supernatural reason actually weirdos cut loose play drama mall downtown geeky fan know past stage know happily buy go thank much story life give old enough learn cope hormone feel alienate especially married otherwise sex reasonably regular basis kind do get boy glad suffers case split personality hand mysterious engage urban fantasy take several original character concepts pit refresh see take many element modern society rearranges form something seemingly normal odd enough macabre disturb enthral part hand personality personal diatribe machine know involvement free information movement almost much quite clear shoehorn idea need free flow information free ubiquitous main plot problem feel place regard rest frequent change bewitch main plot prattle awesome free time jar case plot complete sudden halt main character go build wireless router sudden mean chapter protagonist assault mentally physically follow day go thing even mention think happen night conclusion good well soapbox chapter first leave later time sometimes behave novel probably best way approach change way think world good change way act good priceless here happen read last year move nice rental make it affordable buy cellphone data plan landline no internet cable communication convergence frugal work great problem wife access tether jail broken iphone suck price pride keep me plugging away lock access point vicinity seemed to righteously finish read piece storytelling social change change world suspect result help many others well episode banner ofparasitenet think mention person borrow internet access hall offer host buck month generosity think pretty reasonable arrangement steady signal easy track owner in dense neighborhood eye open begin notice an unlocked access point show radar day of desperation connect bite big piece of chocolate cake think much finding reimburse owner this treasure island listen talk the legalities wife show remind need owner hub somehow come up arrangement build message tell everyone know own the unprotected wireless hub start broadcast ourneighbourhood let go donate month tithe food bank month use service connected to make donation name you guessed day later receive wireless idea really nice feel free use internet access and make donation kindness wrap world mean fiction meet reality priceless jacket sincerely hope much", "genres": ["Fiction & Literature"], "summary": "Alan is a middle-aged entrepeneur in contemporary Toronto, who has devoted himself to fixing up a house in a bohemian neighborhood. This naturally brings him in contact with the house full of students and layabouts next door, including a young woman who, in a moment of stress, reveals to him that she has wings--wings, moreover, which grow back after each attempt to cut them off.\r\n\r\nAlan understands. He himself has a secret or two. His father is a mountain; his mother is a washing machine; and among his brothers are a set of Russian nesting dolls.\r\n\r\nNow two of the three nesting dolls, Edward and Frederick, are on his doorstep--well on their way to starvation, because their innermost member, George, has vanished. It appears that yet another brother, Davey, who Alan and his other siblings killed years ago, may have returned...bent on revenge.\r\n\r\nUnder such circumstances it seems only reasonable for Alan to involve himself with a visionary scheme to blanket Toronto with free wireless Internet connectivity, a conspiracy spearheaded by a brilliant technopunk who builds miracles of hardware from parts scavenged from the city's dumpsters. But Alan's past won't leave him alone--and Davey is only one of the powers gunning for him and all his friends.", "asin": "0765312808", "rank": "382621", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51-WWYzMUDL.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}