{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 522, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Amazing voicing, great protagonist, perfect setting! Overall an important read, something to remind us all of what is still important."}, {"review_sentiment": 4.0, "review_text": "I loved this book because it reminded me of middle school, which was the first time I read this book. Marcus fights against the DHS to save his home!! I also loved the relationship between him and Ange! Great book!"}, {"review_sentiment": 5.0, "review_text": "Great tale, excellently sourced (wrt tech), timely, and nice endnotes by people in the field of cryptography, etc."}, {"review_sentiment": 4.0, "review_text": "Bought this for my grandson who is now 14. He said he enjoyed it. I don't read this genre so can't say from my standpoint."}, {"review_sentiment": 5.0, "review_text": "Good Book, with nice audio quality"}, {"review_sentiment": 1.0, "review_text": "Ughhh Little Brother.  How I hated you.I'm not just trying to be a jerk about it, but the main character Marcus was exactly the type of person I despise.  I hate reading about characters like him with their \"F--- the government, don't trust anyone over 25, I do what I want\" attitude.  Especially the type that turn into pathetic worms at the slightest sight of danger.  There are situations in this book - bad situations, given - that Marcus handled so badlystill wanted Marcus & Co. to lose.  That's how unlikable they are.I very rarely get so annoyed by books I yell over the narrator.  But seriously.  This kid is stupid.  I could list all the stupid things he does, but that would spoil the book?  Everything works, though.  Because this is a YA Dystopia, so hey, happily ever afters for everyone!If you don't want to know every intimate detail about technology, you won't like this book.Doctrow wants to tell you about cryptography.  And networking.  And MY GOD EVERYTHING.  I actually have a decent handle on computer science already - at least to the extent he explains it - so not only was this really, really boring, but it started to feel a bit condescending.  There were instances when something was mentioned in the smallest frame of reference and then we'd get to sit through PAGES of explanation and back story.As if I didn't care little enough about the characters already, now the WRITING is boring.The plot is super unoriginal.Let me know if you're heard this before:  rebel kids skip school, get in trouble, and are blamed for a terrorist plot.  No?  Me neither!  Here's a closer look at the plot:  Angsty teens go to jail after bombing, are insolent and suspicious, get out of jail and start running around and building anarchy.  Sounds a little less original now.  Throw in a bunch of naive, self-serving adults and repeated references of the main character calling himself AND his girlfriend a \"horn dog\" and eventually my eyes start to hurt from how much they are rolling.Okay, guys, I just really didn't like this book?I get the point he is trying to get across about surveillance and control via tracking... and how too much government interference can be bad.  I've seen it referred to as a toned-down 1984... I'd disagree.  1984 is a slice, well thought out, and you eventually want to team up with Winston but not with Marcus?  Because Marcus is an ass.ALSO.  In the summary and the first couple chapters of the book, Doctrow puts SO MUCH EMPHASIS on the fact that Marcus' handle is w1n5t0n, i.e. \"Winston\" as in 1984.  FUN FACT.  This is totally irrelevant to the rest of the book and he drops that handle almost immediately.GAH.  Just... bleh.  I don't like this book, and I don't recommend it unless you're looking for something angry, political, sensational with REALLY AWKWARD teen sex scenes?  IF you are, enjoy.  All yours."}, {"review_sentiment": 5.0, "review_text": "My child loved this book and gives it five stars!"}, {"review_sentiment": 3.0, "review_text": "This book is Very poorly written...hard to fathom where all the accolades came from.  Must be an inside job.The tone is wrong at least 75% of the time.  It's always a tragedy when the writer takes their audience for fools..."}, {"review_sentiment": 5.0, "review_text": "Accessible read about the hacker mindset and the perils of belief in big data. Recommended for non geeks and geeks alike."}, {"review_sentiment": 4.0, "review_text": "As the title implies, Little Brother is something of a modern update to George Orwell's authoritarian surveillance classic 1984. But whereas Orwell was constructing his totalitarian state as a potential future that unchecked modern trends could eventually bring about, this novel feels like something that could easily happen today or tomorrow. It's the story of widespread government restrictions on the right to privacy following a terrorist attack on American soil, and of the teenagers who use their technology skills to lead a nonviolent resistance movement against the oppressive Homeland Security agents. Author Cory Doctorow manages to tell a good story while also sharing helpful tips about information security in an era of widespread government scrutiny. If you are at all worried about surveillance yourself, Little Brother is an informative read about possible safety practices -- and if you aren't worried, you might well be after reading it."}]}, "authors": ["Cory Doctorow"], "isbn": "0765323117", "longitude": -122.4192363, "periods": ["2000s", "Recent Releases"], "title": "Little Brother", "word_cloud": "amaze voice great protagonist perfect set overall important something still important love remind middle school first time fight save home also love relationship tale excellently source wet tech timely nice end notes people field cryptography etc grandson say enjoy genre standpoint good nice audio quality hat try jerk main character exactly type person despise hate read character government trust anyone want attitude type turn pathetic worm slightest sight danger situation bad situation give handle badly still want lose unlikable rarely get annoy yell narrator seriously kid stupid stupid thing work hey happily ever afters everyone want know intimate detail technology want cryptography networking actually decent handle computer science already least extent explains really really boring start feel bit condescend instance something mention smallest frame reference get sit explanation back care enough character already plot super know hear rebel kid skip school get trouble blame terrorist plot here closer look plot teen go jail bombing insolent suspicious get jail start run around build le original bunch naive adult repeat reference main character call horn dog eventually eye start much guy really get try surveillance control track much government interference bad see refer disagree slice well think eventually want team summary first couple chapter put so much fact handle totally irrelevant rest drop handle almost blah like recommend look something angry political sensational teen sex scene enjoy child love give star poorly write hard fathom accolade come tone wrong least time always tragedy writer take audience fool accessible hacker mindset peril belief big data recommend non geek geek alike title implies something modern update authoritarian surveillance classic whereas construct totalitarian state potential future unchecked modern trend eventually feel something easily today tomorrow story widespread government restriction right privacy follow terrorist attack american soil teenager use technology skill lead nonviolent resistance movement oppressive agent manage tell good story also share helpful tip information security era widespread government scrutiny worried surveillance informative possible safety practice worry well", "genres": ["Fiction & Literature", "Science & Nature"], "summary": "Marcus, a.k.a \"w1n5t0n,\" is only seventeen years old, but he figures he already knows how the system works–and how to work the system. Smart, fast, and wise to the ways of the networked world, he has no trouble outwitting his high school's intrusive but clumsy surveillance systems.\r\n\r\nBut his whole world changes when he and his friends find themselves caught in the aftermath of a major terrorist attack on San Francisco. In the wrong place at the wrong time, Marcus and his crew are apprehended by the Department of Homeland Security and whisked away to a secret prison where they're mercilessly interrogated for days.\r\n\r\nWhen the DHS finally releases them, Marcus discovers that his city has become a police state where every citizen is treated like a potential terrorist. He knows that no one will believe his story, which leaves him only one option: to take down the DHS himself.", "asin": "0765323117", "rank": "25208", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51vxTuaIWCL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}