{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 263, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a very good and thought provoking book. Would definitely recommend."}, {"review_sentiment": 2.0, "review_text": "The book starts with an interesting idea: aliens land on Earth, looking for \"God\". They have some very convincing data supporting the existence of a creator to the universe. Then the book goes on a tailspin, rehashing creationist/IDer talking points in a series of stale discussions between an alien paleontologist and her human, atheist, counter-part. The thing is, the author mentions new information known to the aliens, such as a theory of everything, data indicating multiple cycles of Big Bang/Big Crunch preceding the current one and even more astonishing, the temporal concordance of mass extinction events on multiple worlds. Yet, all the arguments are about the anthropic principle, fine-tune universe and irreducible complexity...Added to this, the author seems to have a weak grasp on the science he invokes (biology, genetics and quantum physics), misrepresenting what they mean and how they work.What a waste."}, {"review_sentiment": 5.0, "review_text": "Such an amazing book, that really makes you question the concepts of God, and our place in the universe. If you are interested in listening in on the fascinating conversations between a paleontologist and a friendly alien, this is a book for you!"}, {"review_sentiment": 5.0, "review_text": "One of the most thought provoking scifi books I have read. Highly imaginative conception of God. Highly recommend the audible version - narrator's quality matches the protagonist well."}, {"review_sentiment": 5.0, "review_text": "Thought provoking."}, {"review_sentiment": 5.0, "review_text": "Amazing book."}, {"review_sentiment": 3.0, "review_text": "\"It's Okay\" is the best ranking I could ever give a book by this author, and that's not an insult.  I don't think of Sawyer as a Light in the SF firmament, but he cranks out readable enough stuff.  Evidently though, this book upset some people, due to the subject matter.  I'm here to assure you, though, that atheist or believer, this book is harmless.  Whatever Sawyer's feelings on the subject of religion, his treatment of it is pretty superficial.  The theological arguments are unoriginal and flawed.  The \"science\" is speculative and the \"logic\" short-sighted.  Even given the specifics of the story, the conclusions drawn are dubious at best, still, that's no reason for anyone to take offense.  It's fiction, and nothing to get bent out of shape over."}, {"review_sentiment": 4.0, "review_text": "Is there a supreme being? Perhaps not the God some humans believe in? I enjoyed this novel where aliens visit Earth, two different races from different solar systems, who both believe in a supreme being/intelligence. The visitors explain that their home worlds have experienced the same cataclysmic events our planet has, at roughly the same time as Earth, thus proving the existence of an unknown intelligence with far reaching powers. At the end of the day it is fiction but a thought provoking read. I am an atheist btw. Just thought I would throw that in.Ray Smillie"}, {"review_sentiment": 5.0, "review_text": "A little too scientifically technical, but a great story and good debate on the existence of God."}, {"review_sentiment": 4.0, "review_text": "Some interesting points and ideas. Worth reading/listening to."}]}, "authors": ["Robert J. Sawyer"], "isbn": "0765322897", "longitude": -79.387207, "periods": ["2000s"], "title": "Calculating God", "word_cloud": "good thought provoke definitely start interest idea alien land look convince data support existence creator universe then go rehash talk point series stale discussion alien paleontologist human atheist thing author mention new information know alien theory everything data indicate multiple cycle crunch precede current even astonish temporal concordance mass extinction event multiple world argument anthropic principle universe irreducible complexity author seem weak grasp science invokes biology genetics quantum physic misrepresent mean waste such amazing really make question concept place universe interested listen fascinating conversation paleontologist friendly alien thought provoke scifi highly imaginative conception recommend audible version narrator quality match protagonist well provoke amaze rank ever author insult think firmament crank readable enough stuff upset people due subject matter assure atheist believer harmless feeling subject religion treatment pretty superficial theological argument unoriginal flaw science speculative logic even give specific story conclusion draw dubious best still reason anyone take offense fiction nothing bent shape be supreme perhaps human believe enjoy alien different race different solar system believe supreme visitor explain home world experience cataclysmic event roughly time thus prove existence unknown intelligence far reach power end day fiction think provoke atheist btw thought little scientifically technical great story good debate existence interesting point idea worth", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "An alien shuttle craft lands outside the Royal Ontario Museum in Toronto. A six-legged, two-armed alien emerges and says, in perfect English, \"Take me to a paleontologist.\"\r\n\r\nIn the distant past, Earth, the alien's home planet, and the home planet of another alien species, all experienced the same five cataclysmic events at the same time (one example: the meteor that wiped out the dinosaurs). Both alien races believe this proves the existence of God: i.e., he's obviously been playing with the evolution of life on each of these planets. From this provocative launch point, Sawyer tells a fast-paced, morally and intellectually challenging story of ambitious scope and touching humanity. \r\n\r\nCalculating God is SF on a grand scale.", "asin": "0765322897", "rank": "668876", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51KBq2bAFML.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}