{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 1384, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "I always appreciate Bill Bryson.  His books are as easy to read as a novel, yet they are informative - not just fluff to take our minds off our everyday lives."}, {"review_sentiment": 4.0, "review_text": "“In a Sunburned Country” is a delightful read, and worth your time if for no other reason than that many of us will probably never get to Australia except in books and film and this text gets us there in its own way.Bill Bryson has mixed anecdotal “small” history with modern travel, biological and geographical history of the continent of Australia in an amusing and mostly quick to read style that I found engaging. It was not a labor to pick up this book, and that is no small thing.Mr. Bryson is at times dismissive of people and some places, which I found a little jarring. However, if that is his honest reaction I should be glad for it. I also think his healthy ego comes thru from time to time. Nevertheless, these are rather small quibbles with what is otherwise a really interesting text.The writing is humorous, at times really insightful, and mostly always informative. “In a Sunburned Country” is worth a read because it will expand your worldview. And you will enjoy it to boot!"}, {"review_sentiment": 5.0, "review_text": "Ben Bernanke recommended this book to me. As with so many of his suggestions, it is a fun and informative read. I wish I had ventured outside Sydney on my one trip to Australia."}, {"review_sentiment": 3.0, "review_text": "Came in great quality, the book itself wasn't my cup of tea"}, {"review_sentiment": 4.0, "review_text": "Kept looking up things Bryson describes. Learned quite a bit. Enjoyable sort of a hammock read.  Solid non-fiction. Wow! Australia, then, eh?"}, {"review_sentiment": 5.0, "review_text": "Great read, especially when you are traveling to Australia."}, {"review_sentiment": 5.0, "review_text": "Terrific read."}, {"review_sentiment": 5.0, "review_text": "I am a paramedic, and I read 30-40 books a year, mostly fiction.  On a long transport I mentioned to a patient that I would be traveling to Australia in a few months.  My patient spent the next half hour extolling Bill Bryson's writing.  I had never heard of him but figured I would likely read at least one travel book, so why not.  Bill is one VERY SPECIAL writer.i actually read several passages to my wife,"}, {"review_sentiment": 5.0, "review_text": "Excellent insight into the Australian culture, history, development. A must read for anyone planning a trip there."}, {"review_sentiment": 5.0, "review_text": "I've wanted to visit Australia for a long time but it's not on the list anytime soon.  Bill Bryson's writing is hysterical and I enjoyed reading about his adventures in the country."}]}, "authors": ["Bill Bryson"], "isbn": "0767903862", "longitude": 151.2164539, "periods": ["2000s"], "title": "In a Sunburned Country", "word_cloud": "always appreciate easy yet informative fluff take mind everyday life delightful worth time reason many probably never film text get mixed anecdotal small history modern travel biological geographical history continent amuse mostly quick style find engage labor small time dismissive people place find little jarring however honest reaction glad also think healthy ego come thru time time rather small quibble otherwise really interest write humorous time really insightful mostly always informative worth expand worldview boot recommend many suggestion fun informative wish venture outside trip great quality cup tea look thing describes learn quite bit enjoyable sort hammock eh especially travel terrific paramedic year mostly fiction long transport mention patient travel month patient spend next half hour extol write never hear figure likely travel actually several passage wife excellent insight australian culture history development anyone planning trip want visit long time list anytime soon write hysterical enjoy read adventure", "genres": ["Travel Writing"], "summary": "A CLASSIC FROM THE NEW YORK TIMES BESTSELLING AUTHOR OF ONE SUMMER \r\n\r\nEvery time Bill Bryson walks out the door, memorable travel literature threatens to break out. His previous excursion along the Appalachian Trail resulted in the sublime national bestseller A Walk in the Woods. In A Sunburned Country is his report on what he found in an entirely different place: Australia, the country that doubles as a continent, and a place with the friendliest inhabitants, the hottest, driest weather, and the most peculiar and lethal wildlife to be found on the planet. The result is a deliciously funny, fact-filled, and adventurous performance by a writer who combines humor, wonder, and unflagging curiousity.\r\n\r\nDespite the fact that Australia harbors more things that can kill you in extremely nasty ways than anywhere else, including sharks, crocodiles, snakes, even riptides and deserts, Bill Bryson adores the place, and he takes his readers on a rollicking ride far beyond that beaten tourist path. Wherever he goes he finds Australians who are cheerful, extroverted, and unfailingly obliging, and these beaming products of land with clean, safe cities, cold beer, and constant sunshine fill the pages of this wonderful book. Australia is an immense and fortunate land, and it has found in Bill Bryson its perfect guide.", "asin": "0767903862", "rank": "10326", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51Fhd1OemrL.jpg", "country": "Australia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}