{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 103, "rating": 3.9, "reviews": [{"review_sentiment": 2.0, "review_text": "Fell in love with the poetic descriptions of San Miguel de Allende from the first page...until subsequent pages gave me more of the same; the author's voice staying strangely sterile and distant. It wasn't long before I disengaged, powering through to the end to pick up nuggets: the beauty of a Mayan poem, the kindness of Mexican strangers, a constitution that forbids foreigners from participating in politics. The take away for me after \"reading\" this book? Mexico is a grand place to visit, but you don't know anything about Mexican time until you own a home (fixer-upper) there."}, {"review_sentiment": 5.0, "review_text": "Read this book several years ago, loaned it to a friend and then it recently came back to me. What fun! as I was just thinking about SMA and possibly moving there! Love Tony Cohan's writing style, the beautiful descriptions and overall fluidity are like a magnificent, magical journey through Mexican time and space. Recommended reading for anyone interested in the colonial heartland."}, {"review_sentiment": 5.0, "review_text": "Even though it is an older book it was interesting and entertaining. It kind of had the attitude that the newcomers are ruining the town. But expats don' t seem to remember that they were newcomers too at one point and if they found paradise why shouldn't someone else. Still a good book to see the changes of the town and to see the challenges."}, {"review_sentiment": 5.0, "review_text": "Tony's writing brings to San Miguel on every level.  The cultural sense he puts on the pages is wonderful. Could not put it down."}, {"review_sentiment": 5.0, "review_text": "This isn't really a travel book about Mexico.  It's a romance novel novel where the love affair is between the author and Mexico.  They have their tiffs and their getting-to-know-you moments, but the attraction between them only grows.  It's about living in San Miguel de Allende, but it could be about most places in Mexico."}, {"review_sentiment": 1.0, "review_text": "I purchased this book because I am getting married in San Miguel de Allende. I was told it painted a beautiful picture of the town. However, it is written poorly. The author feels the need to describe everything visually but does not give you a real sense of the atmosphere or ambiance. After about 50 pages I stopped reading.The seller however shipped quickly and the book arrived in good condition."}, {"review_sentiment": 3.0, "review_text": "My wife and I read this book intently as we have much in common with the author. We both had lived on the east and the west coast, and had moved to interior Mexico in middle age. We had both undertaken extensive house renovations in Mexico, have a deep interest in art, and are earnestly attempting to become fluent in Spanish. We find ourselves agreeing with many of the good, but also many of the more thoughtful bad reviews of the book. We closely related to the author's experience with American visitors and house renovations (note the process of buying a house in Mexico is now much easier, and we had compassion for the issues he endured). Other logistical things about life in Mexico have also improved since the writing of this book - some, perhaps, at the expense of the genuine culture. We were, however, surprised at the author's extreme ignorance of Latin culture prior to moving to Mexico (despite his having lived in Los Angeles for years) and noted his tendency to ascribe all things Latin to Mexico. Our experience was different from his and his wife in that we found ourselves without the desire to consume anything once here - whereas he spends much time describing their many purchases. Absent from his many vivid descriptions are the things we appreciate most about living here: the refreshing lack of judgement one gets from the locals, the fact that kids will talk to you here, the unrelenting generosity of spirit from seemingly everyone. Part of the author's problem - I suspect - is that he was asked to write the book, in order to sell it, by an editor that had never lived here. Despite all this, he comes tantalizingly close to the heart of things, and I would not dissuade a person from reading this book. Like many open minded gringos he is attracted to the rich pageantry of life in Mexico, including its religious processions but, ultimately he admits, he and his wife have enveloped themselves in secularism, \"in a blanket that does not completely cover them.\" I was saddened, but not completely surprised, to learn the author and his wife later divorced and that he continued to \"bide his time between Mexico and Venice Beach, California.\" If you are considering moving to Mexico (or anyplace that is very different from where you are living now) you need to know that the place you are moving to is not going to change for you, nor will it conform to your initial idealization of it. The real problems you had prior to moving will remain - until you make the hard choice to change them yourself."}, {"review_sentiment": 4.0, "review_text": "Interesting look at the various aspects of the \"new Mexico\"."}, {"review_sentiment": 5.0, "review_text": "Love this book and this is the second copy I've bought after lending out the first one too many times."}, {"review_sentiment": 5.0, "review_text": "Tony Cohan’s On Mexican Time: A New Life in San Miguel is a book I return to regularly. I first read it between my first and second trips to San Miguel, and I’ve been a fan of his travel writing ever since. Although there are similarities with Peter Mayle’s wildly popular depiction of life in Provence, Cohan goes deeper into the Mexican psyche in a way that only comes with living, working, and managing a relationship among the locals over time. This is a treasure of a book that captures a way of life that one suspects is fleeting.On Mexican Time invites readers to become part of the dissonance that Cohen and his wife, Masako, experience after leaving Los Angeles for a short visit to San Miguel only to find that their future lie south of the border. Life wasn’t easier just calmer, more immediate, and more personal. Cohen recounts epic challenges encountered with great humor and appreciation that if anyone needed to change it was them not the Mexicans.Consider his description of their first tour of the building that would become their home: “Dust, grime, dead plants, roaches. We felt lost inside this neglected ruin, with its histories and tragedies and secrets moaning inside the walls. It was like coming upon a great, expiring animal.” Yet of these seeming ruins the house charges to life with an artistic flair and exceptional patience or…resignation. Things get done when they do.Cohen has an eye for local color but so much more. He appreciates the wealth of contrasts and hues, sounds and silences, and above all the richness of life once personal boundaries recede even a little. This book will always be on my bookshelf!Michael Helquist, author, MARIE EQUI: Radical Politics and Outlaw Passions"}]}, "authors": ["Tony Cohan"], "isbn": "0767903196", "longitude": 0.0, "periods": ["1900s"], "title": "On Mexican Time: A New Life in San Miguel", "word_cloud": "poetic description first page subsequent page give author voice stay strangely sterile distant long disengage power end pick nugget beauty poem kindness stranger constitution forbid foreigner participate politics take away read grand place visit know anything time home read several year ago loan friend recently come fun think possibly move write style beautiful description overall fluidity magnificent magical journey time space reading anyone interested colonial heartland even older interest entertain kind attitude newcomer ruin town expat seem newcomer point find someone else still good see change town see challenge write brings level cultural sense put page really travel love affair author tiffs moment attraction grow live purchase get married tell paint beautiful picture town however write poorly author feel need describe everything visually give real sense atmosphere ambiance page stop however shipped quickly arrive good condition wife intently much common author live east west coast move interior middle age undertake extensive house renovation deep interest art earnestly attempt become fluent spanish find agree many good also many thoughtful bad review closely related author experience american visitor house renovation note process buying house much easier compassion issue endure other logistical thing also improve write perhaps expense genuine culture however surprise author extreme ignorance latin culture prior move live year note tendency ascribe thing experience different wife find desire consume anything whereas spend much time describe many purchase many vivid description thing appreciate live refresh lack judgment get local fact kid talk unrelenting generosity spirit seemingly everyone author problem suspect ask write order sell editor never live come tantalizingly close heart thing person read many open mind gringo attract rich pageantry include religious procession ultimately admit wife envelop secularism blanket completely cover sadden completely surprised learn author wife later divorce continue bide time consider move anyplace different live need know place move go change initial idealization real problem prior move remain make hard choice change interest look various aspect second copy buy lend first many time return regularly first first second trip fan travel write ever similarity wildly popular depiction go deeper psyche way come live work manage relationship local time treasure capture way suspect invite reader become part dissonance wife experience leave short visit find future lie south border easier calmer immediate personal recount epic challenge encounter great humor appreciation anyone need change description first tour building home grime dead plant roach felt lose inside neglect ruin history tragedies secret moan wall come upon great expire seem ruin house charge artistic flair exceptional patience get do eye local color much appreciate wealth contrast hue sound silence richness personal boundary recede even little always bookshelf author passion", "genres": ["Memoir", "Travel Writing"], "summary": "An American writer and his wife find a new home—and a new lease on life—in the charming sixteenth-century hill town of San Miguel de Allende, Mexico.\r\n\r\nWhen Los Angeles novelist Tony Cohan and his artist wife, Masako, visited central Mexico one winter they fell under the spell of a place where the pace of life is leisurely, the cobblestone streets and sun-splashed plazas are enchanting, and the sights and sounds of daily fiestas fill the air. Awakened to needs they didn’t know they had, they returned to California, sold their house and cast off for a new life in San Miguel de Allende. \r\n\r\nOn Mexican Time is Cohan's evocatively written memoir of how he and his wife absorb the town's sensual ambiance, eventually find and refurbish a crumbling 250-year-old house, and become entwined in the endless drama of Mexican life. Brimming with mystery, joy, and hilarity, On Mexican Time is a stirring, seductive celebration of another way of life—a tale of Americans who, finding a home in Mexico, find themselves anew.", "asin": "B00A2P65GG", "rank": "1032090", "city": "San Miguel de Allende", "image": "https://images-na.ssl-images-amazon.com/images/I/31EemzsTbWL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}