{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 5, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "Every character in this book is multi dimensional, capable of both good  and evil.  Worth reading for the characters alone."}, {"review_sentiment": 5.0, "review_text": "The Alley Cat is a book that is altogether encouraging, discouraging, and a funny, poignant tale of learning to stand on your own two feet.I loved and hated each character, because their  good and bad traits were so  vividly described by Beauchemin. Monsieur Emile and Ratablavasky are by far  the two greatest characters created in Canadian Lit, if not Lit altogether.  What a great story.Modern-day Dostoevsky Beauchemin is! His writing is  filled with urban decay and human foibles, modernized and made funnier.  Read this!"}, {"review_sentiment": 5.0, "review_text": "From the first line of this novel you will be hooked. This book is passionate, compassionate, humorous, grotesque, bizarre and epic in every regard. The language zips along with wonderful ingenuity and the characters  are magnificent. An earlier reviewer mentioned two brilliant characters,  but there are many, many other memorable characters in this wonderful book.  Up until the last five pages of this very large novel, you are held  wondering how it will all end. A great novel worthy in tribute to such  luminous writers as Dickens or Thackery. You will roll on the floor  laughing, and you will hold your breath at some of the more tragic moments.  One of my favourite novels of all time. A great read."}, {"review_sentiment": 5.0, "review_text": "The Alley Cat is a book that is altogether encouraging, discouraging, and a funny, poignant tale of learning to stand on  your own two feet.  I loved and hated each character, because their good and bad traits were so vividly  described by Beauchemin. Monsieur Emile and Ratablavasky are by far the two  greatest characters created in Canadian Lit, if not Lit altogether.  What a  great story.  Modern-day Dostoevsky, Beauchemin is!  His writing is filled  with urban decay and human foibles, modernized and made funnier. Read  this!!!"}, {"review_sentiment": 5.0, "review_text": "If you have desire  to succeed in your life,  readthis book ,especially if you'r twenty-six years old"}]}, "authors": ["Yves Beauchemin"], "isbn": "0771093616", "longitude": -73.6103642, "periods": ["1900s"], "title": "The Alley Cat", "word_cloud": "character multi dimensional capable good evil read character alone altogether encourage discourage funny poignant tale learn stand love hat character good bad trait vividly describe far greatest character create canadian altogether great write filled urban decay human foible modernize make funnier read first line hook passionate compassionate humorous grotesque bizarre epic regard language zip along wonderful ingenuity character magnificent earlier reviewer mention brilliant character many many memorable character wonderful last page large hold wonder end great worthy tribute luminous writer dickens roll floor laughing hold breath tragic moment favorite novel time great altogether encourage discourage funny poignant tale learn stand foot love hated character good bad trait vividly describe far greatest character create canadian altogether great story write filled urban decay human foible modernize make funnier read desire life read this especially year old", "genres": ["Fiction & Literature"], "summary": "First published in Quebec in 1981, Beauchemin’s highly acclaimed comic masterpiece of storytelling follows in the tradition of the great novels of the 19th century.\r\n\r\nWhen Florent Boissonneault comes to the aid of an accident victim, his life changes forever. One onlooker, the powerful and sinister Egon Ratablavasky, comes to haunt his ambitions and dreams, lurking behind his every opportunity, success, and failure. Finally, obsessed by a need to free himself, Florent discovers how to fight back.", "asin": "0771093616", "rank": "4849758", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/41tj-fCKm7L.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}