{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 3, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "I couldn't put it down.  I highly suggest this book to anyone in their mid-twenties crisis, coming out of one, or remembering growing up and trying to navigate jobs, men and life.I read it in one night, stayed up all night and loved it.  You won't be sorry!"}, {"review_sentiment": 4.0, "review_text": "This is a fantastic book, but unfortunately the story fizzles out a bit near the end. I love the author's snarky narrative and laugh-out-loud sarcasm. However, I thought the book went spiraling off in too many different directions after a while, and the original pop culture themes were abandoned in favor of a more predictable personal crisis. Still, I did enjoy the book a lot, and I hope the author writes another book someday."}, {"review_sentiment": 5.0, "review_text": "I stumbled across this book while vacationing in Mexico.  I had such a great time reading it.  I finished it while spending a weekend with girlfriends and it is now making the rounds.  I read parts outloud that had my friends in stitches.  A bit Sex in The City...a bit David Sedaris.  I highly recommend it!"}]}, "authors": ["Katrina Onstad"], "isbn": "0771068972", "longitude": -79.387207, "periods": ["2000s"], "title": "How Happy to Be", "word_cloud": "highly suggest anyone crisis come remember grow try navigate job men night stay night love fantastic unfortunately story fizzle bit end love author snarky narrative sarcasm however think go spiral many different direction original pop culture theme abandon favor predictable personal crisis still enjoy lot hope author write someday stumble vacation great time read finish spend weekend girlfriend make round part out loud friend stitch bit bit highly recommend", "genres": ["Fiction & Literature"], "summary": "Sharp, urban, witty, wise — this sparkling debut is the thinking woman’s answer to chick lit Maxime is an entertainment writer at a flailing neo-con newspaper. She’s been dining out too long, literally and figuratively, on a culture of celebrity worship and empty punditry. She seeks refuge from her better judgment in endless parties, ritual substance abuse, and half-hearted attempts to get herself fired, but in a libertarian newsroom where outrageous spin is the easiest way to sell papers, her bad-girl behaviour just wins her more accolades.\r\n\r\nAlong this path of self-destruction, Max’s past, comic and poignant, keeps intruding: memories of her mother’s brutal death and her hippie father’s crippling breakdown; the reappearance of an aging vegan idealist who briefly played her stepmom on the West Coast commune where she came of age; tender realizations about the bad artist she was supposed to marry and a long-lost boyfriend who seems exotically sane. When a host of prior indiscretions finally catches up with her, Maxime realizes that any chance at happiness depends on uncovering, at last, her one true story.\r\n\r\nSet during the madness of the Toronto International Film Festival and weaving back and forth between Max’s commune past and her newsroom present, How Happy to Be portrays with razor-sharp insight and bittersweet wit a modern woman’s descent into — and eventual escape from — the deafening pop culture noise of the early twenty-first century. Intelligent, savvy, this novel marks the arrival of a remarkable new fiction talent.", "asin": "0771068972", "rank": "5377427", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51ABpcGvOYL.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}