{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 1, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "have a good experience. A great product it holds it sharpness and it's well balanced interest guards to blade and handle. The product itself feels smooth when I use it. Haven't had any issues with it. I would recommend it to anyone looking for a good product for a great price. will buy next time . fast . as a birthday gift to my husband"}]}, "authors": ["Patricia McHugh", "Alex Bozikovic"], "isbn": "0771059892", "longitude": -79.387207, "periods": ["1800s", "1900s", "2000s", "Recent Releases"], "title": "Toronto Architecture: A City Guide", "word_cloud": "good experience great product hold sharpness well balanced interest guard blade product feel use have issue anyone look good product great price next time fast birthday gift husband", "genres": ["Art & Architecture", "History", "Urbanism"], "summary": "Toronto has been hailed as “a city in the making” and “the city that works.” It’s an ongoing project: in recent years Canada’s largest city has experienced transformative, exciting change. But just what does contemporary Toronto look like? \r\n\r\nThis authoritative architectural guide, newly updated and expanded, leads readers on 26 walking tours—revealing the evolution of the place from a quiet Georgian town to a dynamic global city. More than 1,000 designs are featured: from modest Victorian houses to shimmering downtown towers and cultural landmarks. Over 300 photographs, 29 maps, a description of architectural styles, a glossary of architectural terms, and indexes of architects and buildings pilot readers through Toronto’s diverse cityscape. New sections illustrate the swiftly changing face of Toronto’s waterfront and design highlights across the region. \r\n\r\nOriginally written by architectural journalist Patricia McHugh and enhanced with new material and insights by Globe and Mail architecture critic Alex Bozikovic, this definitive guide offers a revealing exploration of Toronto’s past and future, for the city’s visitors and locals alike.", "asin": "0771059892", "rank": "901461", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51SiES5cUYL.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}