{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 47, "rating": 3.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Compelling novel of a Jewish man in Montreal."}, {"review_sentiment": 5.0, "review_text": "A book that transcends its Jewish setting, full of hum our, heartbreak, wisdom, and tradgey.  How to become a somebody and a nobody simply explained."}, {"review_sentiment": 1.0, "review_text": "There was really no character in the book with whom I felt like I could relate. Perhaps the girlfriend, but she was not a major enough character to have enough written about her to really get to know her. I read this as a book club book, and I wish I hadn't purchased  or wasted my time reading it. It was a generally not so good experience. I couldn't even take any lessons back from it, other than \"going by the seat of your pants and not making anything of you or anything you do is not likely to earn you points – ANY kind of points!\"I really didn't like the book."}, {"review_sentiment": 2.0, "review_text": "Can't seem to get into this one. Gonna try again later."}, {"review_sentiment": 1.0, "review_text": "could get into it"}, {"review_sentiment": 5.0, "review_text": "A great story about Montreal"}, {"review_sentiment": 1.0, "review_text": "I don't understand why this book is a favorite in Montreal. Had to force myself to finish it before my trip to Canada. Did not find the characters engaging at all."}, {"review_sentiment": 5.0, "review_text": "If you're looking for overlapping plots and literary pyrotechnics, you might want to try Richler's fiction after 1980 (i.e. Joshua Then and Now, Solomon Gursky Was Here, and Barney's Version), but for humour and a comparatively linear story, you can't do better than Duddy Kravitz, the novel that first made Richler famous. The story is clever: Duddy, marginalized and impoverished, working-class and academically challenged, with no mother and a \"dope\" for a father, graduates from high school without any prospects except slaving in his uncle Benjy's garment factory. However, while working as a waiter at a countryside resort he happens upon a lake and decides to buy it to have it developed. This is Duddy's ticket out of poverty and obscurity. With everyone against him, you can't help but root for him. But when it becomes clear that Duddy will do anything to achieve his dream, the question becomes: do you still support him and why? This is essentially a morality play back-dropped by absurdity and treachery. In between the laughs, it raises questions about social class, racism, and capitalism. It remains a Canadian classic.Troy Parfitt is the author of War Torn: Adventures in the Brave New Canada."}, {"review_sentiment": 1.0, "review_text": "The book was hard to follow and Duddy was a skag.  Only read it as a recommendation from Road Scholar to get background for Canada Trip to Ottawa, Montreal and Quebec City.  Wouldn't recommend it."}, {"review_sentiment": 3.0, "review_text": "Watch the movie. It's the reason Richard Dreyfuss almost quit acting, but it's amazing, and more attention-grabbing than the original novel. Especially that bris scene."}]}, "authors": ["Mordecai Richler"], "isbn": "077109972X", "longitude": -73.6103642, "periods": ["1900s"], "title": "The Apprenticeship of Duddy Kravitz", "word_cloud": "compel jewish man transcends jewish set full hum heartbreak wisdom somebody nobody simply explain really character felt perhaps girlfriend major enough character enough write really know club wish purchase wasted time read generally good experience even lesson back go seat pant make anything anything likely earn point kind point really seem later great story understand favorite force finish trip character engage look overlap plot literary pyrotechnic try fiction then now here comparatively linear story better first make famous story clever marginalize impoverish academically challenge mother dope father graduate high school prospect slave uncle garment factory however work waiter countryside resort happen lake decides buy develop ticket poverty obscurity everyone become clear anything achieve dream question become still essentially morality play absurdity treachery laugh raise question social class racism capitalism remain canadian author hard follow slag only recommendation movie reason almost quit act amaze original bros scene", "genres": ["Fiction & Literature", "Satire"], "summary": "The Apprenticeship of Duddy Kravitz is the novel that established Mordecai Richler as one of the world’s best comic writers. Growing up in the heart of Montreal’s Jewish ghetto, Duddy Kravitz is obsessed with his grandfather’s saying, “A man without land is nothing.” \r\n\r\nIn his relentless pursuit of property and his drive to become a somebody, he will wheel and deal, he will swindle and forge, he will even try making movies. And in spite of the setbacks he suffers, the sacrifices he must make along the way, Duddy never loses faith that his dream is worth the price he must pay. \r\n\r\nThis blistering satire traces the eventful coming-of-age of a cynical dreamer. Amoral, inventive, ruthless, and scheming, Duddy Kravitz is one of the most magnetic anti-heroes in literature, a man who learns the hard way that dreams are never exactly what they seem, even when they do come true.\r\n", "asin": "077109972X", "rank": "2438184", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/41ARrVELFUL.jpg", "country": "Canada", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}