{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 0, "rating": 0.0}, "authors": ["Shawn Micallef"], "isbn": "0771059329", "longitude": -79.387207, "periods": ["2000s", "Recent Releases"], "title": "Frontier City: Toronto on the Verge of Greatness", "word_cloud": "", "genres": ["Politics", "Urbanism"], "summary": "Toronto is emerging from an identity crisis into a glorious new era.\r\n\r\nIt began as a series of reports from the civic drama of the 2014 elections. But beyond the municipal circus, writer and commentator Shawn Micallef discovered the much bigger story of a city emerging into greatness. He walked and talked with candidates from all over Greater Toronto, and observed how they energized their communities, never shying away from the problems that exist within them -- poverty, violence, racism, and drugs -- but advocating solutions that bring people together. \r\n\r\nShawn Micallef introduces us to those fighting for a more inclusive vision of Toronto and reveals the promise and potential for a city that has been suffering through a severe identity crisis but is now on a steep upturn. Toronto, he says, is set fair to be a new urban model for cities all over the world. Micallef reveals Toronto in all its rich variety. It is hard, he says, to grasp the vast size and scope of Toronto until you spend a few hours walking through unfamiliar neighbourhoods. Each reveals another adjacent to it, and then another, and another. \r\n\r\nThe city goes on and on, into unheralded ravines and oblique views of the downtown skyline. Hiding in all that geography is not only great beauty, but a force for change that's been building for decades as people arrived here from every corner of the globe. \r\n\r\nFrontier City is a revelatory view of the Toronto of today and an inspiring vision of the Toronto of the near future.\r\n\r\n\"Cities are our future but they are also becoming more unequal and unaffordable. Combining on-the-ground reporting with an urbanist's eye for the big picture, Shawn Micallef takes a deep dive into his own Toronto to illuminate the opportunities and challenges facing its people and those of aspiring cities across the globe. A must read for builders of cities and anyone who lives in one.\" Richard Florida", "asin": "0771059329", "rank": "2106146", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/61kQpBZYtbL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}