{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 9, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Atuk is a Baffin Island artist, or sort of. He gets an invite to Toronto to read his poetry, which is awful, but which intellectuals applaud in an attempt at inclusion, or, in Canada speak, cultural nationalism. Atuk seems unsophisticated (favourite cocktail: vodka and carrot juice) and naïve in the extreme and some wish to take advantage, but he’s shrewder than most “southerners” realize and soon he’s got his relatives back home slaving in sweat shop to produce crummy sculptures that the left-wing decedents of European colonizers can buy to mitigate guilt. This is one of Richler’s funnier novels. It was published in 1963, but one wonders if it were published today if it’d be slammed by the discrimination police, but if everyone is equal then anybody can be – like Atuk is – corrupt. Five stars.Troy Parfitt is the author of War Torn: Adventures in the Brave New Canada"}, {"review_sentiment": 5.0, "review_text": "As political satire goes, this book is hard to beat. It paints a vivid picture of Canada in the 60s (it was published in 1963) yet manages to ring even truer today.  Hilariously brilliant."}, {"review_sentiment": 1.0, "review_text": "I'd heard good things about the book, including the urban legend about the movie that was never made because every person who read for it died.Nope, very lame. I grew up reading books in the 60's and recognize the Vonnegut/Heller style to which he aspired but it's just not worth reading. I gave up one third of the way through because, as short as the book is, 178 pages, LIFE is too short to waste on a book with no characters that held my interest."}, {"review_sentiment": 5.0, "review_text": "Biting satire and black humour characterize this short novella about an Inuit poet who leaves his remote community for a visit to the big city, Toronto. Having been discovered by a fur trader, his poem had reached such popularity among the city folks that they wanted to see the \"Eskimo\" from Baffin Bay in person. Atuk, however, finds urban life so rich, in many different ways, that he decides to stay. Initially he may come across as an innocent fool, easily exploited and controlled by his \"benefactors\", but he is a fast learner and soon joins the games and schemes successfully to his own advantage. Until...Published in 1963 when Richler was living in England, having left Canada in the 1950s, the story benefits from the author's physical and intellectual distance from his country.  It thrives on the caricature of a set of Canadians and their machinations. There are, among others, the Uber-Canadian tycoon, the undercover police officer searching for a American colonel who disappeared on Baffin Island while spying, and the investigative journalist who discovers truths mainly about herself. The powerful TV chat show host meddles in controversy and the nice professor has his own secrets.  The storyline cannot be revealed without giving too much away.  Suffice to say, that it is deliberately farcical and outlandish, yet fast moving and at times confusing enough to keep the reader intrigued.With Atuk Richler brings out the different political and social stereotypes of the day and, above all, takes Canadians to task over their self image and their national identity, their latent or conspicuous racism and bigotry, their consumerism, greed and tendency to admire all that is American. While written more than 40 years ago, his book has meaning beyond the historical. In addition is a fun read! [Friederike Knabe]["}, {"review_sentiment": 5.0, "review_text": "What a fabulous short novella! As a point of reference, I have read all of Richler's major works and a few of his early novellas. This was written near the beginning of his career and it is a masterful and brilliant satire on modern urban life. Atuk, a native or Eskimo as described in the book, is used as a metaphor for life in the materialistic urban world. Atuk takes advantage of his native culture to develop a commercial career exploiting the gullible. What has changed in four decades since Richler wrote this devastatingly funny book?I like Richler's work, but from my reading of his novels it is clear that Richler went through a number of writing phases. If anything his middle books have too much sex or are even obsessed with sex, while some of his later books such as Solomon Gursky are a bit too ambitious or overly complicated. The present work is from the early years and does not have his St. Urbain theme.Modecai Richler (1931 to 2001) grew up in Montreal and that city is the setting for many of his stories - but not all. Many of his novels are about Jews living in Canada and Britain post WWII. He is best known for his tales of life in and around St. Urbain Street. That is an area of three story buildings or walk up row houses located just east of the mountain in Montreal, and north of the commercial center of the city. At one time this was the center of Jewish immigrant life in Montreal.His break out novel wa Duddy Kravitz which is still a great read whether you have seen the movie or not. Still, I like his last book, Barney's Vision, which is his best written piece of work. The novel lacks the edge and drama of Duddy Kravitz but has things that make it better. This present short novel was written early in his career and it is brilliant.Without giving away the plot, it is about a native living on Baffin Island near the Artic who learns English, writes poems, and then is \"discovered\" and moves to Toronto, the financial and media center of Canada. Richler liked to attack Quebec \"nationalism\" and other pet topics of Canadians. Here he takes on \"the Canadian identity\" which he lampoons very successfully using Atuk and his fictional story. Underneath it all is a very universal story that applies to modern life on the planet.This is a great book."}, {"review_sentiment": 5.0, "review_text": "i just finished reading this book, and it amazing. It jumps back and forth between characters and situations, leaving you wondering what the heck is going on the whole time.  SLowly, connections are revealed, and you can't wait to see what will happen next.  After reading the last line i said out lou to my self \"What the ****\" it was great...i'm sick of reading books that are so straight forward that you don't even have to think when you read it. Highly recomended!!!!"}, {"review_sentiment": 4.0, "review_text": "Mordecai Richler's characteristic wit pleases once again with his fifth novel, THE INCOMPARABLE ATUK. ATUK is delightfully funny and intelligently satiric. The book satirizes Canadian cultural \"super-nationalism,\" but it the more widespread themes of identity, corruption, and reverse discrimination are also explored. ATUK is the novel immediately preceding COCKSURE, and it shows: In ATUK Richler satirizes political correctness and reverse discrimination almost as much as he does in COCKSURE. For that reason you don't have to be Canadian to enjoy this book. Also, if you know that Canadians don't all live in igloos and eat \"reindeer knuckle,\" it's hilarious to read a work by a Canadian author who plays with such misconceptions.  ATUK may be Richler's most overtly Canadian novel, but I think it's a book everone would be able to enjoy."}, {"review_sentiment": 5.0, "review_text": "Trying to order this! This is the book the \"Atuk Curse\" is based on. Supposedly this book was made into a script and was offered through out the years to several comedians who later died after reading the script- John Belushi, Sam Kinison, John Candy and Chris Farley..."}, {"review_sentiment": 5.0, "review_text": "I first read this book when I was 13 and I must have read it 20 times since...on a plane with \"A Confederacy of Dunces\"!"}]}, "authors": ["Mordecai Richler"], "isbn": "0771099738", "longitude": -79.387207, "periods": ["1900s"], "title": "The Incomparable Atuk", "word_cloud": "artist sort get invite poetry awful intellectual applaud attempt inclusion speak cultural nationalism seem unsophisticated favorite cocktail vodka carrot juice nave extreme wish take advantage shrewder southerner realize soon get relative back home slaving sweat shop produce crummy sculpture decedent european colonizer buy mitigate guilt funnier novel publish wonder publish today slam discrimination police everyone equal anybody corrupt author political satire go hard beat paint vivid picture publish yet manage ring even today brilliant hear good thing include urban legend movie never make person lame grow read recognize style aspire worth reading give third way short page short waste character hold interest bite satire black humor characterize short novella poet leave remote community visit big city discover fur trader poem reach popularity city folk want see person however find urban life rich many different way decide stay initially innocent fool easily exploit controlled benefactor fast learner soon join game scheme successfully living leave story benefit author physical intellectual distance country thrive caricature set machination others tycoon undercover police officer search american colonel disappear spy investigative journalist discovers truths mainly powerful tv show host meddles controversy nice professor secrets story line reveal give much away say deliberately farcical outlandish yet fast move time confuse enough keep bring different political social stereotype day take task image national identity latent conspicuous racism bigotry consumerism greed tendency admire write year ago mean historical addition fun fabulous short novella point reference major work early novellas write begin career masterful brilliant satire modern urban life native describe use metaphor life materialistic urban world take advantage native culture commercial career exploit gullible change decade write devastatingly funny like work reading novel clear go number writing phase anything middle much sex even obsess sex later bit ambitious overly complicate present work early year urban grow city set many story many novel jews live post best know tale life area story building walk row house locate east mountain north commercial center city time center immigrant life break wa still great see movie still like last best write piece work lack edge drama thing make better present short write early career give away plot native living learns write poem discover move financial medium center like nationalism pet topic here take canadian identity lampoon successfully use fictional story universal story applies modern life great finish reading amaze jump back forth character situation leave wonder heck go whole time connection reveal happen next read last line say lou self great sick reading straight forward even think recommend characteristic wit plea fifth delightfully funny intelligently satiric satirizes canadian cultural widespread theme identity corruption reverse discrimination also explore immediately precede show satirize political correctness reverse discrimination almost much reason canadian enjoy also know live igloo eat reindeer knuckle hilarious work canadian author play misconception overtly canadian think everyone able try order base supposedly make script offer year several comedian later die read first plane", "genres": ["Fiction & Literature", "Satire"], "summary": "Transplanted to Toronto from his native Baffin Island, Atuk the poet is an unlikely overnight success. Eagerly adapting to a society steeped in pretension, bigotry, and greed, Atuk soon abandons the literary life in favour of more lucrative – and hazardous – schemes.\r\n\r\nRichler’s hilarious and devastating satire lampoons the self-deceptions of “the Canadian identity” and derides the hypocrisy of a nation that seeks cultural independence by slavishly pursuing the American dream.", "asin": "0771099738", "rank": "1558359", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/41IGhhnPSWL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}