{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 40.4862174, "ratings": {"num_ratings": 1, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Fantastic book. Wish they were more interviews with people who lived through the occupation."}]}, "authors": ["Steven High"], "isbn": "0773537503", "longitude": -74.4518173, "periods": ["1900s", "Recent Releases"], "title": "Occupied St John's: A Social History of a City at War, 1939-1945", "word_cloud": "fantastic wish interview people live occupation", "genres": ["History", "WWII"], "summary": "In January 1941, the hulking twenty-one-thousand ton troopship Edmund B. Alexander docked in St John's Harbour, carrying a thousand American soldiers sent to join the thousands of Canadian troops protecting Newfoundland against attack by Germany. \r\n\r\nFrance had fallen, Great Britain was fighting for its survival, and Newfoundland – then a dominion of Britain – was North America’s first line of defence. Although the German invasion never came, St John’s found itself occupied by both Allied Canadian and American forces. \r\n\r\nOccupied St John’s reveals the profound impact that the war years had on the city’s inhabitants, thrown into a conflict where the “home front” was also the “war front.” Weaving together interviews with residents who lived through the upheaval as well as archival material, this collection reconstructs the memories of people coping with extraordinary circumstances. \r\n\r\nLavishly illustrated and engagingly written, Occupied St John’s is a remarkable look at the effects of the Second World War on the city, opening another chapter in Newfoundland’s fascinating history.\r\n", "asin": "0773537503", "rank": "6540729", "city": "New Brunswick", "image": "https://images-na.ssl-images-amazon.com/images/I/51LDPIOqxeL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}