{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 82, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "What could be more dazzling than being set in the Golden Age of Hollywood?  In “Platinum Doll,”  novelist Anne Girard gives us a most interesting account of one of the biggest stars of that era—Jean Harlow—indeed a “platinum doll” (while remembering this is fiction and not biography)!  It's the Roaring Twenties and 17-year-old Harlean Carpenter McGrew runs off to Beverly Hills with a song in her heart (silent, of course, as “talkies” aren’t quite the thing yet), chasing a dream—to escape her small Missouri town life and to become a Hollywood star!  She starts out with a lot of luck, too:  a rich husband. Once there, she  is accidentally discovered by a talent scout at the Brown Derby restaurant (who could have predicted!). She has immediate success, drawing attention to herself in Tinsel Town, where she is able to attend glamorous  parties, to meet “high society” and well connected friends there, as well as to showcase her considerable talent. Driven even more heavily by her domineering mother, Harlean’s ambition seems to know few boundaries.  She changes her name to Jean Harlow and the curtains rise rapidly for the young, beautiful, intelligent star to be. She also has a great desire to evolve from silent screen sensation to the  silver sound goddess.  While Girard tries hard not to make this a “tabloid style” novel, the reader can’t help but get caught up in the “stories” of the stars she includes in the story, from Clark Gable to Howard Hughes, Clara Bow, and Laurel and Hardy, among others.  Girard’s characterization gives us an insight into Miss Harlow who was fond of reading the Odyssey (for fun!); she had a fantastic memory as well as a very likeable (and complex) personality.  Of course, there’s the price to be paid and one of the early prices are her divorce, putting up with her over-bearing mother, and the fact that she dies from kidney failure at age 26!  Girard weaves the highs and lows throughout the story, which, actually, turns out to be not only a fun, fast read but very well written. She’s actually quite sympathetic to Jean, while not omitting the fact that Hollywood really can be a jungle, despite the glitter and glamour."}, {"review_sentiment": 5.0, "review_text": "Quick read about Jean Harlowe, really nice story about her life. Well thought out and easy to read."}, {"review_sentiment": 5.0, "review_text": "I so enjoyed reading about Jean Harlow's life.  The author was good in carrying the story along.  I was left wondering how she died at such a young age...Googled it-sorry to know that another young life left us so early."}, {"review_sentiment": 5.0, "review_text": "I great book to read"}, {"review_sentiment": 4.0, "review_text": "This is a somewhat fictionalized story of the 1930s movie star, Jean Harlow.  The story begins with Harlean Carpenter McGrew (she would later change her name to Jean Harlow), who is newly married to wealthy Charles McGrew.  There is quite a bit of focus also on her relationship with her domineering mother.  The story ends just short of her rise to movie stardom.At first I thought the writing style was a bit over the top, but it’s Hollywood and that cries for flash and fireworks and theatrical drama.  I actually grew to like the author’s writing style.  Though I only read a sample of this book, I placed it on my wish list so I can read the entire book later.The book cover is beautiful."}, {"review_sentiment": 2.0, "review_text": "Boring!  As a huge Harlow fan, this only covers the very beginning of her short life - no energy as we get closer to her success"}, {"review_sentiment": 2.0, "review_text": "As historical fiction, this novel fails miserably.  There are so many factual errors that it's clear the author didn't do even the most cursory research:  \"The Fun Factory\" was the moniker given to Mack Sennett's studio, NOT Hal Roach's; James Cagney wouldn't be at The Brown Derby in 1928 as he didn't arrive in Hollywood until 1930; Harlean wouldn't be wearing slacks in 1928, as they didn't come into fashion until the early 30s; etc.As fiction, it reads like a young adult novel; the characters, plot, and dialogue are all painfully contrived.  It is utterly absurd, in a Hollywood where the casting couch reigned supreme, that not one of the powerful men sexy Harlean meets on her way to stardom - real and fictional - even tries to get her into bed!  Girard spends an inordinate amount of time on Harlean and her husband's inconsequential breakups/makeups, and has a tendency to get lost in her own storylines (for example, on pg. 161 she says that Harlean's Aunt Jetty's lover left her after the death of their infant twins, then on pg. 249 Jetty says she'd still be with him if he \"hadn't gone and died on me.\").  To make matters worse, there are glaring grammatical errors (such as the use of the word \"bare\" for \"bear\") which says more about the editor than the author.For me, though, the biggest issue with this novel is that many reviewers posting in this forum think that by reading it they are learning about Harlow.  PLEASE!  So much misinformation and myth already swirl around Jean Harlow that we don't need any more!  If you want to learn about the real Jean Harlow, don't read FICTION like Platinum Doll; read the legitimate biographies Bombshell by David Stenn and Platinum Girl by Eve Golden."}, {"review_sentiment": 1.0, "review_text": "I couldn't read anymore after the author wrote the part about James Cagney walking into the Brown Derby in 1928, and Jean and her friend being so excited to see the \"Matinee Star.\" James Cagney wasn't even working in Hollywood until 1930 and he wants famous until 1931, do your research."}, {"review_sentiment": 5.0, "review_text": "Parts of this book were more interesting than others but that's part of what kept me lost in it. Good historical fiction feels real, and this book genuinely made me feel happy for Jean Harlow, or sad for her. A great work!"}, {"review_sentiment": 5.0, "review_text": "great book. arrived just as described in the ad and in a timely fashion. would recommend seller to all."}]}, "authors": ["Anne Girard"], "isbn": "0778318664", "longitude": -118.244476, "periods": ["1900s", "Recent Releases"], "title": "Platinum Doll", "word_cloud": "dazzle novelist give interest account biggest star remember fiction biography roar twenty run song heart silent course talkie quite thing yet chase escape small town life start lot luck rich husband accidentally discover talent scout restaurant immediate success draw attention able attend glamorous party meet high society well connect friend well considerable talent even heavily domineer harlan ambition seem know boundary change name curtain rise rapidly young beautiful intelligent star also great desire evolve silent screen sensation silver sound goddess try hard make tabloid style help caught story star include story others characterization give insight fond reading fun fantastic memory well likable complex personality course price pay early price put mother fact die kidney failure age weave high low story actually turn fun fast well write actually quite sympathetic omit fact really jungle glitter glamour quick really nice story life think easy enjoy read life author good carry story leave wonder die young age google know young life leave early great somewhat fictionalized story movie star story begin later name newly marry wealthy quite bit focus also relationship domineer story end short rise movie first think write style bit top cry flash firework theatrical drama actually grow author write style sample place wish list entire cover beautiful huge fan cover begin short life energy closer success historical fiction fail miserably many factual error clear author even cursory research moniker give studio arrive wear slack come fashion early fiction read young adult character plot dialogue painfully contrive utterly absurd cast couch reign supreme powerful men sexy meet way stardom real fictional even try get bed spend inordinate amount time husband inconsequential tendency lose story lines example pg say lover leave death infant twin pg say still go die matter worse glare grammatical error use word bare bear say editor biggest issue many reviewer post forum think read learn so much misinformation myth already swirl need want learn real legitimate biography anymore write part walk friend excite see even work want famous research part interest others part keep lost good historical fiction feel real genuinely make feel happy sad great work great arrive described ad timely fashion seller", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Set against the dazzling backdrop of Golden Age Hollywood, novelist Anne Girard tells the enchanting story of Jean Harlow, one of the most iconic stars in the history of film \r\n\r\nIt's the Roaring Twenties and seventeen-year-old Harlean Carpenter McGrew has run off to Beverly Hills. She's chasing a dream—to escape her small, Midwestern life and see her name in lights. \r\n\r\nIn California, Harlean has everything a girl could want—a rich husband, glamorous parties, socialite friends—except an outlet for her talent. But everything changes when a dare pushes her to embrace her true ambition—to be an actress on the silver screen. With her timeless beauty and striking shade of platinum-blond hair, Harlean becomes Jean Harlow. And as she's thrust into the limelight, Jean learns that this new world of opportunity comes with its own set of burdens. Torn between her family and her passion to perform, Jean is forced to confront the difficult truth—that fame comes at a price, if only she's willing to pay it. \r\n\r\nAmid a glittering cast of ingenues and Hollywood titans—Clara Bow, Clark Gable, Laurel and Hardy, Howard Hughes—Platinum Doll introduces us to the star who would shine brighter than them all.", "asin": "0778318664", "rank": "673213", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51r8qZJtBzL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}