{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 128, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "Easy read of early twentieth century Paris and young Eva a girl that fell for Picasso. Interesting descriptions of other artists and famous character of the times. A bit to sentimental for me but still worth reading."}, {"review_sentiment": 5.0, "review_text": "A piece of art history I never knew about, in fact,I knew very little about the life of Picasso. This is tender, poignant, and heartbreaking. I highly recommend this beautiful story."}, {"review_sentiment": 5.0, "review_text": "touching story of a young girl in Paris and the art world"}, {"review_sentiment": 5.0, "review_text": "I am a huge fan of books set in Paris and this one was no exception. Lovingly written and descriptive, it was a joy to meander the rue(s) during the Belle Epoch with Picasso, Gertrude Stein, and many of the famous creatives from that age. An amazing story about Picasso and his lover/wife Eva Gouel."}, {"review_sentiment": 2.0, "review_text": "To much going over the same story line!"}, {"review_sentiment": 5.0, "review_text": "Interesting look at the world of artists in good and bad times and of the strong women (madam Picasso especially) who worked alongside them."}, {"review_sentiment": 5.0, "review_text": "If you love Paris, especially during the Belle Epoch, this book is for you.  If you enjoy reading about the artists and their associates during this magical period, the book is a delightful read."}, {"review_sentiment": 5.0, "review_text": "A beautifully written story of two who were obviously soul mates.  Pablo became the man he was destined to be because of this great love--his Eva.  His art, kindness, and charitable acts were a tribute to her and what she inspired him to become as he accepted the imperfections of this world and life."}, {"review_sentiment": 3.0, "review_text": "Interesting topic. The size of the print, a drawback."}, {"review_sentiment": 5.0, "review_text": "Picasso has always been a mystery to me. I never understood his art as he transitioned from his realistic paintings to his cubism work. The book, although historical fiction, gave me an understanding of that. It truly unlocked the mystery for me.Picasso was not the the nasty person that I had thought him to be. He was filled with great passionate love for Eva, a woman, who seemed to be sent by God, for the noble purpose of getting to him understand love, it's fleeting beauty, and sad finiteness.Anne Girard has authored a wonderful story based on an important period in the life of Pablo Picasso."}]}, "authors": ["Anne Girard"], "isbn": "0778316351", "longitude": 2.3514992, "periods": ["1900s", "Recent Releases"], "title": "Madame Picasso", "word_cloud": "early twentieth century young girl fell description artists famous character time bit sentimental still worth read piece art history never know fact know little life tender poignant heartbreaking highly recommend beautiful story touch story young girl art world huge fan set exception write descriptive joy meander rue many famous creatives age amazing story much go story line interest look world artists good bad time strong woman madam especially work alongside love especially enjoy reading artist associate magical period delightful beautifully write story obviously soul mate become man destine great love art kindness charitable act tribute inspire become accepted imperfection world life interest topic size print drawback always mystery never understand art transition realistic painting cubism work historical fiction give understand truly unlocked mystery nasty person think fill great passionate love woman seem sent noble purpose get understand love fleet beauty sad author wonderful story base important period life", "genres": ["Fiction & Literature", "Art & Architecture", "Historical Fiction"], "summary": "Novelist Anne Girard brings to life the mesmerizing and untold story of Eva Gouel, the unforgettable woman who stole the heart of the greatest artist of our time  \r\n\r\nWhen Eva Gouel moves to Paris from the countryside, she is full of ambition and dreams of stardom. Though young and inexperienced, she manages to find work as a costumer at the famous Moulin Rouge, and it is here that she first catches the attention of Pablo Picasso, a rising star in the art world. \r\n\r\nA brilliant but eccentric artist, Picasso sets his sights on Eva, and Eva can't help but be drawn into his web. But what starts as a torrid affair soon evolves into what will become the first great love of Picasso's life.  \r\n\r\nWith sparkling insight and passion, Madame Picasso introduces us to a dazzling heroine, taking us from the salon of Gertrude Stein to the glamorous Moulin Rouge and inside the studio and heart of one of the most enigmatic and iconic artists of the twentieth century.", "asin": "0778316351", "rank": "955045", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/410LZWzaT7L.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}