{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 28, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "I picked this up from the library along with volume one and I almost regretted because I didn't enjoy the first book. The story here is better, but goes on a bit too long.The first part of this book involves a former Captain Marvel, Monica Rambeau, and a giant robot that rises out of the Gulf of Mexico. The relationship between the two women is well done. I don't know anything about Monica though, so I feel like part of their banter loses its impact. The most interesting portion is how it relates to the levees in New Orleans weakening and how the heroes are going to help fix them. Too bad that didn't take up more of the story.Once that wraps up, Carol returns to New York and is diagnosed with a sickness related to her alien DNA and she is forbidden to fly. This begins to tie things back to volume one. Again, there are characters presented that I'm not familiar with and that aren't introduced very well, so the importance of some of Carol's relationships is lost.The art splits between a realistic style and a cartoony style. I would have preferred a common style throughout the book. Either one would have been fine. The mix isn't terrible, but it is very noticeable when it does change. There are some cool scenes with the giant robot though."}, {"review_sentiment": 5.0, "review_text": "Look, I'll be honest, I have difficulty in hitting the word count on these reviews, but I really dug this comic and I think people should read it."}, {"review_sentiment": 5.0, "review_text": "A great chapter in the life of soon to be movie character, Carol Danvers"}, {"review_sentiment": 4.0, "review_text": "This volume has two stories. In the first Captain Marvel (aka Carol Danvers) is helping out a retired superhero friend named Monica investigate some missing boats in the Gulf of Mexico. Ships sailing out of New Orleans have been vanishing. Monica has found the spot where they sank but doesn't want to get in the water. So Carol puts on a scuba tank and finds more than just boats--planes dating back to World War II also populate this sunken graveyard. Like many a superhero story, this ends with a big battle between the two friends and a huge enemy. The best part of the story is the repartee between Carol and Monica, providing both humor and some character depth.The second story finds Carol with a medical issue. Carol's been having headaches (which she has blamed on calls from Tony Stark!) and has felt her power weakening. Her doctor tells Carol she has a lesion in her brain. So she can't fly, which is a hard thing for an ex-pilot who now has the Superman-like power to fly. Things get even harder when an old, air-born bad gal shows up to fight Captain Marvel. Sadly, the story isn't finished in this issue.The second story is much more interesting than the first. I like the idea that a superhero would have an everyday doctor. Oddly enough, the art is better in the first story. Happily, Carol doesn't don some skimpy swimsuit when scubaing down to the wreckage, she's in her regular superhero jump suit. The second story does not get visually exploitative, the art is just less polished than in the first."}, {"review_sentiment": 5.0, "review_text": "Good"}, {"review_sentiment": 5.0, "review_text": "Kelly Sue Deconnick can do no wrong. Check out her Pretty Deadly title for some great western magical realism!"}, {"review_sentiment": 3.0, "review_text": "Merits first. Covers are divided between Jamie McKelvie and Joe Quinones, so they're all gorgeous, and the best parts of the book. The interior art is all super cool, and totally unique. The dialogue is really very good! I believe the characters, I think they're funny, yeah, dialogue, whoo hoo!BUT, bro, this is one of the most boring, least interesting, confusing, half-explained Marvel NOW! books you could possibly be reading. DeConnick has done nothing to make me like the petulant, stubborn, mean-spirited, (and now very sick) titular character, and that's a bummer because I want to like her so bad. I really wish I had something better to say, but the whole time reading this, I was just grumpy and falling asleep because of how much this book fails to hold your interest. The fights are all throw-away matches, the plotting is meandery, with no discernible start middle or finish to the individual issues, and the ending is the least satisfying thing it could have been.This would be a two-star if the art and covers weren't so deng good, but for srs, the art is real yummy."}, {"review_sentiment": 5.0, "review_text": "Good song."}, {"review_sentiment": 3.0, "review_text": "This is a very good entry in a very good series. There are minor story issues, but nothing to ruin the experience. My only complaint with the book is the artwork. It looked like the artist learned to draw legs and feet from Rob Liefeld. This is absolutely NOT a commentary on the overall artwork of the Captain Marvel series, which wisely avoids oversexualization of the characters, but this volume is just plain ugly and unpleasant to look at."}, {"review_sentiment": 2.0, "review_text": "Not for me.  To start off I found the story ok and art was good.  Then it changed for the remainder of the book to what I can only call terrible art. Not just accepting its the style because the bodies and faces are ugly, awkward and not balanced. I am sorry I bought this and will not be so quick to purchase future books."}]}, "authors": ["Kelly Sue Deconnick", "Christopher Sebela"], "isbn": "0785165509", "longitude": -71.0595678, "periods": ["2000s", "Recent Releases"], "title": "Captain Marvel, Vol. 2: Down", "word_cloud": "pick library volume almost regret enjoy first story better go bit first part involve former giant robot rise relationship woman well do know anything feel part banter lose impact interesting portion relate levees weakening hero go help bad take wrap return diagnose sickness related alien forbid fly begin tie thing back volume character present familiar introduce well relationship art split realistic style cartoon style common style mix terrible noticeable change cool scene giant robot honest difficulty hit word count review really comic think people great chapter life soon movie character volume story first aka help retire superhero friend name miss boat sail vanish find spot sank want get water put scuba tank find boat plane date back also populate sunken graveyard many superhero story end big battle friend huge enemy best part story repartee provide humor character second story find medical issue headaches blame call felt power weaken doctor tell lesion brain hard thing power fly thing get even harder old bad gal show fight story finish second story much interest first like idea superhero doctor oddly enough art better first story skimpy swimsuit scubaing wreckage regular superhero jump suit second story visually exploitative art le polish first good wrong title great western magical realism merit first divide gorgeous best part interior art super cool totally unique dialogue really good believe character think funny yeah dialogue whew hew bro boring least interesting confuse possibly read do nothing make petulant stubborn sick titular character bummer want bad really something better whole time read grumpy fall asleep much fail hold interest fight match plot meander discernible start finish individual issue end least satisfying thing cover deng good r art real yummy good song good entry good series minor story issue nothing ruin experience complaint artwork look artist learn draw leg foot absolutely commentary overall artwork series wisely avoids oversexualization character volume plain ugly unpleasant look not find story ok art good then change remainder call terrible art not accept style body face ugly awkward balance sorry buy quick purchase future", "genres": ["Comics & Graphic Novels", "Fiction & Literature"], "summary": "In this second volume of collected issues, spanning issues 7-12, we watch Carol Danvers, born and bred in Boston, explore her bodily changes after being turned into a superhero. She interacts with her loved ones differently and her doctor insists that her neurology has been altered drastically. \r\n\r\nWhat’s a girl to do, if she’s the only one able to defend Boston while the Avengers are away, but her doctor has ordered her not to fly? To catch up on Marvel’s reimagining of Captain Marvel, and to meet her rowdy bunch of compatriots in the Banshee Squad, check out “Vol 1: In Pursuit of Flight,” as well.", "asin": "0785165509", "rank": "568982", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/51TcRRMcFQL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}