{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 12, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "This stellar collection of Gerber's \"Man-Thing\" presents stories that encourage introspection. Weighty topics like life after death, the nature of evil, the value of human existence; each story is packed with scenarios that force the reader to consider their own beliefs. Yet, easy to follow continuity and excellent artwork manage to keep entertainment and enjoyment as the main purpose.In other words, you'll have fun while thinking about key issues. This is what adult oriented comics should actually be, as too often \"adult\" means \"graphic sex\" these days. As much as I love standard super heroic fare, please know that \"Man-Thing\" is elevated and matured from that point. I cannot recommend this book enough!"}, {"review_sentiment": 5.0, "review_text": "Very good. I had been a fan of the comic when it first came out, but missed some of the stories, so this filled them in fo0r me."}, {"review_sentiment": 4.0, "review_text": "GREAT STUFF"}, {"review_sentiment": 4.0, "review_text": "I have never been into superhero comics. The only exception being when I read the first 40 original Spiderman issues collected in those out-of-print Barnes and Noble releases. So I find myself more attracted to manga and graphic novels with their more varied story genres represented. My father collected comics in the 70s, however, and I always remember being intrigued by the cover of  his copy of Man-Thing #1 when I found his collection packed away in the basement. I'd always been a fan of science fiction and Man-Thing just didn't look like a superhero. Fast forward almost twenty years and I purchased this volume on a whim. I was expecting something like a comic version of the Twilight Zone and I did sort of get that. Steve Gerber reminds me of Rod Serling's bizarre, surreal yet poignant writing in which he used extraordinary stories to highlight problems faced in the human condition. Gerber's best stories entertain while they make you think. My favorite stories from this collection are No Choice of Colors, A Question of Survival and The Old Die Young continued in The Gift of Death.I wanted to point out that while Mike Ploog would go on to do much of the art for Gerber's Man-Thing run, I much preferred Val Mayerik's character design for the Man-Thing. I much preferred Mayerik's hulking and three-tendriled version."}, {"review_sentiment": 5.0, "review_text": "The man-thing was always cool."}, {"review_sentiment": 5.0, "review_text": "Simply put ingenious. Nuff said."}, {"review_sentiment": 4.0, "review_text": "Most of these stories are hampered by the dreadful \"Marvel house scripting style\" which was prevalent at the time these comics were published. The last few stories, with art by Mike Ploog are a different story altogether. The last story is magnificent, with really outstanding coloring... Those Ploog stories make it all worthwhile. Val Mayerik and Steve Gerber never really clicked... more's the shame."}, {"review_sentiment": 5.0, "review_text": "Complete series with color. What's not to like"}, {"review_sentiment": 5.0, "review_text": "big fan of man-thing comics super cool much love thank you."}, {"review_sentiment": 5.0, "review_text": "I loved it! I wanted something different in the comic world and this is it."}]}, "authors": ["Steve Gerber", "Gerry Conway", "Roy Thomas"], "isbn": "0785199055", "longitude": -80.1936589, "periods": ["1900s"], "title": "Man-Thing by Steve Gerber: The Complete Collection Vol. 1", "word_cloud": "stellar present story introspection topic life death nature evil value human existence story pack scenario force consider belief easy follow continuity excellent artwork manage entertainment enjoyment main word fun think key issue adult orient comic actually often adult mean graphic sex day much love standard super heroic fare please elevate matured point recommend enough very good fan comic first come missed story fill great never superhero comic exception first original issue collect release so find attracted manga graphic novel vary story genre represent father collect comic however always remember intrigue cover copy find pack away basement always fan science fiction look superhero forward almost twenty year purchase volume whim expect something comic version sort remind bizarre surreal yet poignant writing use extraordinary story highlight problem face human condition best story entertain make favorite story continue want point much art much prefer character design much prefer hulk version always cool put ingenious say most story hamper dreadful house script style prevalent time comic publish last story art different story altogether last story magnificent really outstanding color story make worthwhile never really clicked shame series color big fan comic super cool much love thank love want something different comic world", "genres": ["Comics & Graphic Novels", "Fiction & Literature"], "summary": "Marvel's melancholy muck-monster, by the man who knows him best! With the Nexus of All Realities as the ultimate staging post, prepare for the wildest journeys of your life in this first volume of a complete collection of Steve Gerber's Man-Thing tales! Join the most startling swamp-creature of all in encounters with the Thing, sorcerers Dakimh and Jennifer Kale, and the most far-out fowl ever created, Howard the Duck! Plus existential angst, clashes with the modern world, and the death of a clown!", "asin": "0785199055", "rank": "775158", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/61RiHO8RaIL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}