{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 15, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "Not quite as convincing as other works but interesting for those of us who have witnessed the destruction of the Spanish coastal villages."}, {"review_sentiment": 4.0, "review_text": "An interesting read.  Even if it seems to wander a lot."}, {"review_sentiment": 5.0, "review_text": "This is one of the best books I've read in a long time. Norman Lewis is a fine writer, not well known in the US.  Around 1950, with little visible means of support, he spent parts of several years in a small fishing village somewhere south of Barcelona--working on fishing boats and chronicling a dying way of life. The villagers' culture, rituals, and beliefs were pre-modern to say the least, perhaps going back one or more millennia--but already in the early stages of being swept aside by the coming tidal wave of the seaside tourism industry. Those who fought against Franco's army have to keep a low profile, and guard secrets. Lewis is a wonderful storyteller and great painter of characters, with eyes and ears for the tragedies and comedies of life. Not to be missed are his descriptions of the \"cat village\" where he lived, full of non-church going fishermen and their families, who follow ancient pagan rituals and superstitions--versus the nearby \"dog village\" of stolid, God-fearing farmers who, of course, look down on the cat villagers while they also see their ancient culture slipping away.."}, {"review_sentiment": 5.0, "review_text": "Voices of the Old Sea by Norman Lewis is an account of his time in village of Farol on the Costa Brava in Spain during the 1950s. Lewis is the author of many travel books and was particularly fascinated by primitive cultures in the modern world. He wrote on Indonesia, tribes in India, and the effect of missionary work in Latin America. Lewis spends three summers in Farol and documents his time there. Usually it is fiction that requires you to suspend your disbelief; here it is non-fiction. The reader almost feels like he or she is in a Spanish version of Tortilla Flator Cannery Row.Farol is a town that struggles to make a living by fishing. Superstition abounds in the town. No leather was allowed anywhere the fishing fleet, which in itself is barely functional. Motorized boats have been cannibalized to the point that the few boats that run barely do. The boats are named with pagan references that government officials make the fishermen cover up and rename. Farol is a single commodity town and fishing in itself is at subsistence level. So important is the fishing that locals turn to a magician who can smell out the tuna. Animals are not killed unless there is good reason. A man shooting rats because they might carry the plague is told to stop and told once there is plague then the rats could be killed. Killing them for no reason would not be tolerated, but sending a message is different though. When dolphins are snagged in fishing nets, they are not killed; they are wounded and released to show the other dolphins what would happen to them if they decided to get snagged in the fisher's nets.Cats have the run of Farol, and it is know as the cat village. Sort is an adjoining town, known as the dog town. Sort is on its own hard times with the decline of the cork industry and relies on subsistence agriculture. The two villages have their own feud. Life is further complicated by Muga who want to bring tourism to the Farol. Villagers fear that the foreigners staring out at the water from the shore would ruin the fishing.Voices of the Old Sea is a fun read. It reads like fiction with nearly unbelievable events and characters so colorful that they seem they could they could only come from the authors imagination. Lewis' growing attachment to the village and the process of his acceptance makes for an interesting read. A very good book for all."}, {"review_sentiment": 5.0, "review_text": "The book is an absolute joy.  To tell you why, or even what it's about, would be to ruin the fun. It's a book you simply have to start and in which you relish each vignette; it's not a wildly exciting story, or something you'd miss a train stop because you couldn't put it down.Instead, it's simply a brilliant piece of writing; witty, smart, fun.  You go with Lewis and enjoy with him a strange, dark sense of humor that takes pleasure in the most wonderful things, and a world which no longer exists.It's also a book that is something of a secret joy; you can't really describe to others what is so great about it. I've known only a few other Lewis fans, and we all came to him in the same way: we found an old copy of a book of his somewhere in a free bin or a stack being thrown away.  Tattered cover with a page or two missing, we read the first one and then quickly got online to find everything by him we could.I've since given away multiple copies of this book, always with the same line: \"Just read it.\"  To say, \"it has this great scene about a cat town and a dog town\" or \"there is a stuffed dugong in the bar\" doesn't give the same effect as describing a scene from a great mystery or action novel.Instead, you start at the beginning, hesitantly, and by page three relish each sentence.  When you reach the end, you are sad, and wish it were longer.  There are very, VERY few books that I wish were longer.  This is one."}, {"review_sentiment": 5.0, "review_text": "I bought my first Norman Lewis book as a sale item on a rack (Tomb in Seville).  I have now read 4 of his globetrotting books and have enjoyed every one of them.  This one was right on the money though after recently visiting a few coastal towns in Spain I used his book to take me back to how it used to be from what it his now turned into."}, {"review_sentiment": 5.0, "review_text": "This is a sad story of tragic loss. Great reading or rather writing, of course, and obviously moving, but sad to be so fully and eloquently shown a way of life so rewarding, yet so tranquil in its simplicity, so totally destroyed by \"development\".  Farol; a simple fishing village in the old Spain, had the misfortune of being on that coast eventually exploited and destroyed as the \"Costa Brava\". The author, after a rather tough time in WWII sought out a retreat in the then isolated region just as it was identified by the Spanish government and local entrepreneurs as being \"suitable for substantial development as a holiday destination\". Which development, of course, not only destroyed the village, its daily life and annual cycles, but the whole culture of the inhabitants.Lewis painstakingly, over three seasonal domiciles, earned acceptance from the fisher-folk, carefully not to transgress local taboo - no leather on the boats -  he gained a grudging place, and was reluctantly given recognition, as an almost honorary local, even to his own \"beautifully wrecked\" chair outside the local bar. He sought a `sense of place' just at the time that it was torn from the villagers, and their age-old dependence on their local shamans and natural leaders.The story of that journey to acceptance and the all too rapid evaporation of the mores of such simple rustic values by the corruptions of development and tourism - headed mainly by a former bandit of this arid region with its villages of cat lovers contesting with the village of dog owners - is a fascinating read. As Cyril Connolly wrote ... \"Lewis is able to write about the back of a bus and make it interesting\"Here Lewis had a far more significant subject - a community in its still hopeful death throes in the path of `progress'."}, {"review_sentiment": 5.0, "review_text": "Although \"Naples, 44\" is often cited as Norman Lewis' best work (and is well worth reading), \"Voices of the Old Sea\" is saturated with all the best attributes of Lewis' writing, i.e., a keen descriptive eye, humor, and empathy with the people/culture described.  The setting, Mediterranean Spain ... the time, before the tourists came.  It's a fascinating look at a society that no longer exists ... with all it's quirks, eccentricities, traditions, and ways of viewing the world."}, {"review_sentiment": 5.0, "review_text": "This is truly great travel writing. Prior to the 1950s, Lewis visited the coast of Catalonia several times to get away from England and to experience more of the country he loved. His stories are gentle, respectful accounts of the people he met and the friendships he made. He gives the reader a special view of life in coastal Catalonia (now known as the Costa Brava) that existed before it was transformed into a hot European tourist destination.He also gives the reader a first-hand look into the transformation as it happened. The fishing stopped. Centuries old local customs and unusual traditions vanished in just in a few years. Traditions were replaced by expediency. The simple life was replaced by profit-seeking. Authentic life experiences were replaced by manufactured ones, mainly designed to meet the false expectations tourists had of Spain."}, {"review_sentiment": 5.0, "review_text": "Of course this is a wonderful book, easily gotten through, but whence the idea this is travel writing?It's one of several autobiographical books Lewis put out decades after his visits.  This one first appeared in 1984 recounting three seasons he spent in the late 1940s in a remote Spanish fishing village.Voices of the Old Sea is more like an ethnography, but by someone who writes like no social scientist - descriptively, ironically, and with some kind of love for the people he's studying.It's a primitive world Lewis remembers. You'll be shocked by his images of animal cruelty - bear baiting, dog starving, dolphin maiming.  But that is part of the whole package.Throughout, we get a sense of an unstoppable vanishing.  Farol and Sort, its sister village two miles away, are as different from each other as they are from the rest of Spain. In a little while, the hustlers and the tourists will discover them and we'll just have this book to record what's lost.Would it have hurt this publisher to include a map locating Farol and Sort in relation to Barcelona and Gerona?  We have no idea where they were or whether they exist anymore."}]}, "authors": ["Norman Lewis"], "isbn": "0786716908", "longitude": 2.1774322, "periods": ["1900s"], "title": "Voices of the Old Sea", "word_cloud": "not quite convince work interest witnessed destruction spanish coastal village interesting even seem wander lot best long time fine writer well know little visible mean support spend part several year small fishing village somewhere south work fish boat chronicle die way life villager culture ritual belief say least perhaps go millennium already early stage sweep aside come tidal wave seaside tourism industry fought army keep low profile guard secret wonderful storyteller great painter character eye ear tragedy comedy life not missed description cat village live full go fisherman family follow ancient pagan ritual superstition versus nearby dog village stolid farmer course look cat villager also see ancient culture slip account time village author many travel particularly fascinate primitive culture modern world write tribe effect missionary work spend summer document time fiction require suspend disbelief almost feel spanish version town struggle make live fishing abound town leather allow anywhere fish fleet barely functional boat cannibalize point boat run barely boat name pagan reference government official make fisherman rename single commodity town fish subsistence level important fishing local turn magician smell tuna kill good reason man shoot rat plague tell stop tell plague rat reason sending message different dolphin snag fish net kill wound release show dolphin decide get snag fisher cat village adjoin town know dog town hard time decline cork industry rely subsistence agriculture village feud complicate want bring tourism fear foreigner star water shore fun read fiction nearly unbelievable event character colorful seem author imagination grow attachment village process acceptance make interest good absolute joy even fun simply relish vignette wildly exciting story something miss train stop simply brilliant piece write witty smart fun go lewis enjoy strange dark sense humor take pleasure wonderful thing world longer also something secret joy really others great know lewis fan come way find copy somewhere free bin stack throw away cover page miss first quickly get online everything give multiple copy always line great scene cat town dog town stuff dugong bar give effect describe scene great mystery action start begin hesitantly relish sentence reach end sad wish longer very wish longer buy first sale item rack globetrotting enjoy right money recently visit coastal town use use turn sad story tragic loss read rather write course obviously move sad fully eloquently show way life reward yet tranquil simplicity totally destroy development simple fishing village misfortune coast eventually exploit destroyed author rather tough time seek retreat isolated region identify spanish government local entrepreneur suitable substantial development holiday destination development course destroyed village daily life annual cycle whole culture painstakingly seasonal domicile earn acceptance carefully transgress local taboo leather boat gain grudge place reluctantly give recognition almost honorary local even beautifully wreck chair outside local bar seek place time torn villager dependence local shaman natural story journey acceptance rapid evaporation more simple rustic value corruption development tourism head mainly former bandit arid region village cat lover contest village dog owner fascinate write able write back bus make interesting here far significant subject community still hopeful death throe path often cite best work well worth read saturate best attribute write keen descriptive eye humor empathy describe set time tourist come fascinate society longer exist quirk eccentricity tradition way view world truly great travel write visit coast several time get away experience country love story gentle respectful account people meet friendship make give special view life coastal know exist transformed hot european tourist also give transformation happen fishing stop local custom unusual tradition vanish year replace simple life replace life experience replace manufactured one mainly design meet false expectation tourist course wonderful easily gotten whence idea travel write several autobiographical put visit first appear recount season spend late remote spanish fishing ethnography someone write social scientist descriptively ironically kind love people primitive world remembers shock image animal cruelty bear bait dog starve dolphin maiming part whole get sense unstoppable vanish sister village mile away different rest little hustler tourist discover record hurt publisher include map locate relation idea exist anymore", "genres": ["Travel Writing"], "summary": "After World War II, Norman Lewis returned to Spain and settled in the remote fishing village of Farol, on what is now Costa Brava. Voices of the Old Sea describes his three successive summers in that almost medieval community where life revolved around the seasonal sardine catches, Alcade's bar, and satisfying feuds with neighboring villages. It's lucky Lewis was there when he was. Soon after, Spain was discovered by its neighbors in a more prosperous northern Europe, and the tourist tide that ensued flowed inexorably over the old ways of the town and its inhabitants.", "asin": "0786716908", "rank": "1288180", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51zXj4pJPQL.jpg", "country": "Spain", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}