{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 254, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Fascinating reading about one of the great magicians from the past.  Good reading about his life."}, {"review_sentiment": 5.0, "review_text": "Everything a historical novel should be plus more. The author grabs you into the world of early 20th century vaudeville magic and never lets go. The wealth of period detail is always entertaining, never overwhelming. The entire story is magical in the full literary sense.The greatest compliment I can give this book is that it is one of the rare few in which I never checked to see how many pages were left to read."}, {"review_sentiment": 5.0, "review_text": "Close enough to my childhood to extricate fine memories of my Grandfather Judge James Quinn who reined over this age. Thanks to you."}, {"review_sentiment": 2.0, "review_text": "Somewhere in these several hundreds of pages might lie a good novel.An editor is needed. More then ever here"}, {"review_sentiment": 5.0, "review_text": "I enjoyed this book when it was first published, and recently (spurred I think by its superb cover art) decided to give it another go. It is primarily a book of events rather than ideas, but even remembering how it ended I enjoyed it. The character of Charles Carter, the somewhat fictionalized early 20th century magician, is fully developed, even if those around him are not. We feel pain at his loss, we root for him to succeed. The world in which he lives feels entirely real, though Glen David Gold is in fact serving us a pastiche of history and plausible fiction. The magic acts that punctuate the book are uniformly beautiful, richly described and thrilling.The book's one great weakness is the fourth-act showdown with a murderous rival (who is conveniently in the pay of other unrelated adversaries of Charles Carter). After all the careful planning and skill that has characterized our protagonist to this point, the sprawling battle plays out largely by chance. The entire battle feels misplaced, like it comes from a different book, and the denouement to the fight was wasted opportunity.However the book is creative and fun to read and I'm giving it five stars."}, {"review_sentiment": 5.0, "review_text": "I don't read a lot of fiction, but I LOVE this novel. It enchanted me in a way almost no novel  ever has, and it will stick in my mind for a long time.  I saw a review that said the book was too long. I couldn't disagree more. I wish it were at least 2,000 pages long - I didn't want to leave Gold's world. There are quite a few characters, but Gold portrays them so distinctly that it is not hard to track them. And the characters are a bit part of what makes the novel so rich and interesting, along with the evocation of such a fascinating world.Of the novels I have read as an adult, there are very few I have loved more than this one.I won't write more because many other reviewers have described the novel better than I can."}, {"review_sentiment": 5.0, "review_text": "A really enjoyable read."}, {"review_sentiment": 5.0, "review_text": "This is one of the best books I've read in a long time.  Very entertaining."}, {"review_sentiment": 5.0, "review_text": "Thoroughly enjoyable. When our book club selected this book, I didn't think I would like it; but, I found that after the first few chapters, I couldn't put it down."}, {"review_sentiment": 5.0, "review_text": "I learned a bit more about magic and illusion than I ever wanted to know, but loved the book.  Beautifully written and peppered with wonderful snippets of history, language, customs and personalities of the period."}]}, "authors": ["Glen David Gold"], "isbn": "0786886323", "longitude": -122.4192363, "periods": ["1900s"], "title": "Carter Beats the Devil", "word_cloud": "fascinate read great magician past good reading life everything historical author grab world early century magic never let go wealth period detail always entertain never overwhelm entire story magical full literary greatest compliment give rare never check many page leave close enough childhood extricate fine memory rein age thanks somewhere several hundred page good editor need more ever enjoy first publish recently spur think superb cover art decide give go primarily event rather idea even remember end enjoy character somewhat fictionalize early century magician fully develop even feel pain loss root world live feel entirely real fact serve pastiche history plausible fiction magic act punctuate uniformly beautiful richly describe great weakness showdown murderous rival conveniently pay unrelated adversary careful planning skill characterize protagonist point sprawl battle play largely chance entire battle feel misplace come different denouement fight waste creative fun give star lot fiction love enchant way almost ever stick mind long time saw review say long wish least page long want leave world quite character portray distinctly hard track character bite part make rich interest evocation fascinate novel adult love many reviewer describe better really enjoyable best long time very entertaining thoroughly enjoyable club select think find first chapter learn bit magic illusion ever want know love beautifully write pepper wonderful snippet history language custom personality period", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Glen David Gold's literary debut dazzled critics and fans from coast to coast. Now Carter's center stage for a spectacular paperback . . .\r\n\r\nThe response to Glen David Gold's debut novel, Carter Beats the Devil, was extraordinary. He hypnotized us with his portrait of a 1920s magic-obsessed America and of Charles Carter--a.k.a. Carter the Great--a young master performer whose skill as an illusionist exceeded even that of the great Houdini. \r\n\r\nFilled with historical references that evoke the excesses and exuberance of Roaring Twenties pre-Depression America, Carter Beats the Devil is a complex and illuminating story of one man's journey through a magical and sometimes dangerous world, where illusion is everything.", "asin": "0786886323", "rank": "426422", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51n6ttIVCLL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}