{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 67, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "No Comment!"}, {"review_sentiment": 3.0, "review_text": "Serious meh.  The best of the books I could find to read about Ho Chi Minh after visiting Vietnam.  However, the namesake is so enigmatic that it is hard for the author to put meat in the book."}, {"review_sentiment": 5.0, "review_text": "Ho Chi MinhHate him or love him.  He had a goal and accomplished it.  Interesting read"}, {"review_sentiment": 4.0, "review_text": "I love the prices on Amazon. book worth the value"}, {"review_sentiment": 5.0, "review_text": "A biography everyone should read. The book describes the complex life of Ho Chi MInh. Almost as an aside, the author introduces us to Ho Chi Minh's relationship with the United States starting with the Treaty  of Versailles ending World War,I  his contracts with Americans in fighting the Japanese in World War II, and the eventual  failure  between the two countries starting with the withdrawal of the French in 1954."}, {"review_sentiment": 5.0, "review_text": "Brilliantly researched, comprehensive, and as well written and energized as a novel."}, {"review_sentiment": 4.0, "review_text": "This name evokes lots of emotions in the US.  I wanted to know who he was, and this book answered that question and gave me a great sense of the dreadful war and what it cost the Vietnamese.  We all know about US losses - they were minuscule relative to Vietnam."}, {"review_sentiment": 4.0, "review_text": "A most thorough distillation of a complex individual."}, {"review_sentiment": 5.0, "review_text": "Started reading this book before a trip to Southeast Asia; first stop Ho Chi Minh city. After traveling up the Mekong River and eventually making my way to Hanoi this book helped me understand much of the people's attitude and hardship I was observing.  This book was great preparation for me; long and sometimes very laden with details but some of those details had me more informed of this man than our guide. If you like details then you will enjoy this book; if you want to understand the Vietnamese culture this book is a must."}, {"review_sentiment": 3.0, "review_text": "Ok"}]}, "authors": ["William J. Duiker"], "isbn": "078688701X", "longitude": 0.0, "periods": ["1900s"], "title": "Ho Chi Minh: A Life", "word_cloud": "comment serious meh best visit however namesake enigmatic hard author put meat love goal accomplish love price value biography everyone describes complex author introduces relationship start end contract fight japanese eventual failure country start withdrawal french brilliantly research comprehensive well write energize name evoke lot emotion us want know answered question give great sense dreadful war cost vietnamese know u loss minuscule relative thorough distillation complex individual start reading trip first city travel eventually make way help much people attitude hardship observe great preparation long sometimes laden detail detail inform man guide detail enjoy want understand vietnamese culture ok", "genres": ["Biography", "History"], "summary": "The magisterial and authoritative biography of one of the towering and mysterious figures of the twentieth century.\r\n\r\nHo Chi Minh's epic life helped shape the twentieth century. But never before has he been the subject of a major biography. Now William Duiker has compiled an astonishing work of history that fills this immense void.\r\n\r\nA New York Times Notable Book and one of the Los Angeles Times Best Books of 2000\r\n\r\nTo grasp the complicated causes and consequences of the Vietnam War, one must understand the extraordinary life of Ho Chi Minh, the man generally recognized as the father of modern Vietnam. Duiker provides startling insights into Ho's true motivation, as well as into the Soviet and Chinese roles in the Vietnam War.", "asin": "078688701X", "rank": "460682", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/41YPpNu7ctL.jpg", "country": "Hanoi", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}