{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 429, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "This book is so good...It's so well written. Being an empath myself I found myself in awe of just how much so many of us from generation X kind of had the same stuff going on..whoever you are no matter what your personality type(or how old you are) this book is definitely amazing. Charles R. Cross is a hell of a writer & I read this in record time ( and continue to read it over..there is so much information - but with all of the imagery it doesn't even feel like a book..) Such a great biography."}, {"review_sentiment": 5.0, "review_text": "great book"}, {"review_sentiment": 5.0, "review_text": "Excellent value for money well recommend this cable. They are very long and the quality is very good. Arrived really quickly. They seem very durable and love the rope like wiring. They are very long even longer then i actually needed but they are perfect. Excellent quality cable at a very good price."}, {"review_sentiment": 5.0, "review_text": "Very good book"}, {"review_sentiment": 5.0, "review_text": ":)"}, {"review_sentiment": 3.0, "review_text": "Extremely interesting, but I can't help but feel liberties were most certainly taken with the facts."}, {"review_sentiment": 5.0, "review_text": "Excellent book, fast shipping, book arrived undamaged"}, {"review_sentiment": 4.0, "review_text": "Sent this as a gift to my daughter and she really liked it."}, {"review_sentiment": 1.0, "review_text": "I can't even.  Someone smart please reopen the case and use all the evidence to give this man the only thing this world can now give him: the truth about how his life ended"}, {"review_sentiment": 1.0, "review_text": "No surprises in this book...at least not pleasant ones. I actually like him less than I did before reading it."}]}, "authors": ["Charles R. Cross"], "isbn": "0786884029", "longitude": -122.3300624, "periods": ["1900s"], "title": "Heavier Than Heaven: A Biography of Kurt Cobain", "word_cloud": "good well write empathy find awe much many generation kind stuff go matter personality type old definitely amazing hell writer record time much information imagery even feel such great great excellent value money well recommend cable long quality good really quickly seem durable rope wire long even longer actually need perfect quality cable good price very good extremely interesting liberty certainly take fact excellent fast ship arrive undamaged gift daughter really like even smart please case use evidence give man thing world give truth life end surprise least pleasant one actually le read", "genres": ["Biography", "Music"], "summary": "It has been twenty years since Kurt Cobain died by his own hand in April 1994; it was an act of will that typified his short, angry, inspired life.\r\n\r\nVeteran music journalist Charles R. Cross fuses his intimate knowledge of the Seattle music scene with his deep compassion for his subject in this extraordinary story of artistic brilliance and the pain that extinguished it.\r\n\r\nBased on more than four hundred interviews; four years of research; exclusive access to Cobain's unpublished diaries, lyrics, and family photos; and a wealth of documentation, Heavier Than Heaven traces Cobain's life from his early days in a double-wide trailer outside of Aberdeen, Washington, to his rise to fame, success, and the adulation of a generation.\r\n\r\nCharles Cross has written a preface for this new edition, in which he recounts some of the events regarding Kurt Cobain and this book in the past two decades since his death.", "asin": "0786884029", "rank": "70553", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/518%2BD8lNDlL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}