{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 7, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Did you know that Chicago was built on a swamp? Or that Tokyo is the only major city that doesn't have a formal address system?? I didn't either until I read this book!!"}, {"review_sentiment": 3.0, "review_text": "A diverting small book that has a selection of information on some few cities in regards to the submerged backbone of cities, its channels of transport and utilities.  The work is far from complete and might have been served better by a more uniform presentation.  The segment on New York is the first and is quite limited in respect to anything other than water supplies, rail and subway transit.  Rome has a good deal concerning antiquities and sewer systems and very little on routing of electrical and support systems.  Paris is mostly geared to the Sewer system and its associated conduits for utilities, but has no mention of any archaeologic sites.  Certainly there must be something left of the Medieval Paris underground of note and indeed one only has to see the old walls in the basement of the Louvre to know that there is indeed some areas underground that have some past ruins.  The work is interesting, but so incomplete as to be of limited use other than general edification."}, {"review_sentiment": 3.0, "review_text": "I have always been interested in \"real-world\" engineering and technology, so I had high expectations for this book. I also love history, so I was hoping that it would talk about how and why the structures under cities came about, how they were used, and so on.The book tried to give technical and historical information on a dozen cites, but it only had about 20 pages per city to cover all of this. That just wasn't enough to do justice to either topic. Also, there were a lot of pictures, graphics, etc, which reduced the actual discussion still further.The graphics were maddening. They gave just enough info to whet your appetite, but they never went beyond the superficial. For instance, each city had a vertical graphic showing typical things beneath that city, but they were not detailed enough for me.I guess I would have preferred for the author to focus on just a couple of cities, and go into more detail about what lies beneath the. If you're looking for a \"gee whiz\" intro to the topic, this might be OK, but otherwise it was disappointing."}, {"review_sentiment": 5.0, "review_text": "This is a perfect book to get your inquisitive child, friend, cousin, great uncle twice removed, or anyone else. For all of the glamour that's put on bridges, skyscrapers, and parks - we typically completely ignore everything beneath the earth. This book takes the effort to show, both via illustration and photo, and describe what lies beneath our feet. From catacombs in Paris, to tectonic faults in San Francisco and Tokyo, it's thoroughly engaging.While not exactly a scholarly work, Marshall has done an excellent job researching - to the tune of 24 pages of references! The book goes through the undergrounds of a dozen or so cities around the world, describing what we could find underground and giving a little history lesson at the same time.Highly recommended for anyone interested in urban areas and development over time."}, {"review_sentiment": 5.0, "review_text": "I highly recommend this book to anyone curious about the history and underworkings of the great cities of the world.  It gave me a new appreciation for what goes in to the planning, creation and development of a major city."}, {"review_sentiment": 4.0, "review_text": "I almost started by stating this book isn't for the average reader. But, I'm an average reader, and frankly I found the information within it fascinating. Coincidentally I lived in N.Y.C., and have a little more experience with its underground infrastructure than just having been a straphanger (subway rider). Mr. Marshall has a no nonsense writing style, and his research has resulted in much interesting information regarding what's buried beneath our feet. The history of how, and why things got, and get buried in the first place makes the book all the more enlightening. Especially the consideration that things get buried as a result of debris that accumulates over time, and how history is lost, and then sometimes rediscovered in the process of modernization."}, {"review_sentiment": 5.0, "review_text": "A beautiful book, monumental piece of research, with clear and engaging prose and a great mix of maps, illustrations, capsule histories, lively facts, and timelines. If you ever stood over a manhole or at the dark edge of a subway tunnel and wondered, \"What's down there?\" then this book will tell you. Beneath the Metropolis describes what's underneath 12 world cities -- New York, Chicago, San Francisco, Mexico City, Paris, London, Rome, Cairo, Beijing, Tokyo, Moscow and Sydney. With pith and concision, Marshall details the infrastructure, the archeology and the geology. In Paris, we learn about the fossilized bones and the beautiful sewers and subways. In Rome, we tour the ancient ruins and rickety subway (did you know there was one?). In Beijing, we learn about the vast network of cold war tunnels that few visit. Marshall uses each city's underground to trace its history, politics and economics. It's a pleasure to learn how successful cities, like London or Paris, can take different approaches to infrastructure. As a fellow author and former Columbia classmate, I admire and envy Marshall's success in wrestling such a huge topic into a pleasurable masterpiece. Beneath the Metropolis is destined for many a reader's nightstand as well as planning and political offices and classrooms.--Christopher D. Ringwald, author of A Day Apart: How Jews, Christians, and Muslims Find Faith, Freedom, and Joy on the Sabbath (Oxford, 2007)"}]}, "authors": ["Alex Marshall"], "isbn": "0786718641", "longitude": 2.3514992, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases", "1500s", "500-1400s", "0-500s"], "title": "Beneath the Metropolis: The Secret Lives of Cities", "word_cloud": "build swamp major city formal address system either divert small selection information regard submerge backbone channel transport utility work far complete better uniform presentation segment first quite limited respect anything water supply rail subway transit good deal concern antiquity sewer system little routing electrical support system mostly gear system associate conduit utility mention archaeological site certainly something leave underground note indeed see old wall basement know indeed area past ruin work interest incomplete limit use general edification always interest engineering technology high expectation also love history hop structure come use tried give technical historical information dozen cite page city cover enough justice topic also lot picture graphic etc reduce actual discussion still graphic madden give enough info whet appetite never go superficial instance city vertical graphic show typical thing city detail enough guess author focus couple go detail lie look gee whiz intro topic otherwise disappointing perfect inquisitive child friend cousin great uncle twice remove anyone else glamour put bridge skyscraper park typically completely everything earth take effort show illustration photo describe lie foot catacomb tectonic fault thoroughly exactly scholarly work do excellent job research tune page reference go underground dozen world describing underground give little history lesson recommend anyone interested urban area development time highly recommend anyone curious history under workings great world give new appreciation go plan creation development major city almost start stating average average frankly find information fascinate live little experience underground infrastructure strap hanger subway rider nonsense write style research result much interesting information regard bury foot history thing get bury first place make enlighten consideration thing get bury result debris accumulates time history lose sometimes rediscovered process modernization beautiful monumental piece research clear engage prose great mix map illustration capsule history lively facts timeline ever stand manhole dark edge subway tunnel wonder describe underneath world pith concision detail infrastructure archaeology geology learn fossilize bone beautiful sewer subway tour ancient ruin rickety subway know learn vast network cold war tunnel visit use city underground trace history politics economics pleasure learn successful different approach infrastructure fellow author former classmate admire envy success wrestle huge topic pleasurable masterpiece destine many nightstand well plan political office author", "genres": ["History", "Urbanism"], "summary": "The pulse of great cities may be most palpable above ground, but it is below the busy streets where we can observe their rich archaeological history and the infrastructure that keeps them running. In The Secret Lives of Cities journalist Alex Marshall investigates how geological features, archaeological remnants of past civilizations, and layered networks transporting water, electricity, and people, have shaped these cities through centuries of political turbulence and advancements in engineering — and how they are determining the course of the cities' future.\r\n\r\nFrom the first-century catacombs of Rome, the New York subway system, and the swamps and ancient quays beneath London, to San Francisco's fault lines, the depleted aquifer below Mexico City, and Mao Tse-tung's extensive network of secret tunnels under Beijing, these subterranean environments offer a unique cross-section of a city's history and future.\r\n\r\nStunningly illustrated with colorful photographs, drawings, and maps, The Secret Lives of Cities reveals the hidden worlds beneath our feet, and charts the cities' development through centuries of forgotten history, political change, and technological innovation.", "asin": "0786718641", "rank": "1440837", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51WRQhwzPCL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}