{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 38, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Just moved here and trying to learn DC political history. It reminds a little of Gary Rivlin's Fire on the Prairie which chronicles a similar period in Chicago politics."}, {"review_sentiment": 5.0, "review_text": "If you want to know D.C., this is the best introduction"}, {"review_sentiment": 5.0, "review_text": "thank you, I cant wait to read this bookthanks seller"}, {"review_sentiment": 4.0, "review_text": "Great, informative, and entertaining read.The publisher really needs to have a copy editor fix all the minor mistakes in the book, though. It's embarrassing for the authors, who clearly put a lot of time and energy researching and writing this."}, {"review_sentiment": 5.0, "review_text": "As a native Washingtonian ( baby boom generation) I found this book historically interesting. It was on my 'to read' list for a long time.  I don't know how interesting this will be if one is not a native of Washington DC. however if you've an interest in the politics of DC and how it got to where it is now, the book is worth the read."}, {"review_sentiment": 4.0, "review_text": "Very informative"}, {"review_sentiment": 5.0, "review_text": "All are great"}, {"review_sentiment": 4.0, "review_text": "Born and raised in Washington DC, I didn't realize what was unfolding right in front of me!"}, {"review_sentiment": 5.0, "review_text": "Informative book about Washington, D. C., and its most famous (or infamous) mayor. It is unfortunate that Marion Barry succumbed to drug use, which eclipsed his outstanding record as a mayor of Washington, D. C. Under his administration the downtown area of Washington was built up. The books reveals the underhanding of D. C. politicians who were in office long before Barry was old enough to vote. It is a good book to have in one's personal library."}, {"review_sentiment": 4.0, "review_text": "This book is very well-written, thorough, and engaging, if a bit dry at times. Through covering most of DC's history, focusing mainly on Marion Barry the man and mayor, some important events and decisions are necessarily glossed over. Overall, though, an invaluable resource for anyone seeking to understand the DC political landscape.The Afterword describing the 20 years following the book's initial publication in 1993 is a nice addition, though not as detailed as previous eras covered. Ending in April 2014, just a few months before Marion Barry's death.One major complaint -- far too many spelling, typographical, and layout errors for such a respectable tome. The publisher needs to hire a better copyeditor to go through this edition line by line. Not sure if this problem is limited to the Kindle version or present in print as well."}]}, "authors": ["Harry S. Jaffe", "Tom Sherwood"], "isbn": "0786755938", "longitude": -77.0366456, "periods": ["1900s"], "title": "Dream City: Race, Power, and the Decline of Washington, D.C.", "word_cloud": "just move try learn political history remind little chronicle similar period politics want know best introduction thank cant wait book thanks seller informative entertaining publisher really need copy editor fix minor mistake embarrass author clearly put lot time energy research write native washingtonian baby boom generation find historically interest list long time know interest native however interest politics get worth very informative great raise realize unfold right front informative famous infamous mayor unfortunate succumb drug use eclipse outstanding record mayor administration area build reveals under handing politician office long old enough vote good personal library thorough engaging bit dry time cover history focus mainly man mayor important event decision necessarily gloss invaluable resource anyone seek understand political describe year follow initial publication nice addition detailed previous era cover month major complaint far many spell typographical layout error respectable tome publisher need hire better copy editor go edition line line not sure problem limit version present print well", "genres": ["History", "Politics", "Journalism"], "summary": "With a new afterword covering the two decades since its first publication, two of Washington, D.C.’s most respected journalists expose one of America’s most tragic ironies: how the nation’s capital, often a gleaming symbol of peace and hope, is the setting for vicious contradictions and devastating conflicts over race, class, and power. Jaffe and Sherwood have chillingly chronicled the descent of the District of Columbia—congressional hearings, gangland murders, the establishment of home rule and the inside story of Marion Barry’s enigmatic dynasty and disgrace. Now their afterword narrates the District’s transformation in the last twenty years. New residents have helped bring developments, restaurants, and businesses to reviving neighborhoods. \r\n\r\nThe authors cover the rise and fall of Mayors Adrian Fenty and Vince Gray, how new corruption charges are taking down politicians and businessmen, and how a fading Barry is still a player. The “city behind the monuments” remains flawed and polarized, but its revival is turning it into a distinct world capital—almost a dream city.\r\n\r\nHarry Jaffe has been a national editor at The Washingtonian magazine since 1990. Tom Sherwood is a reporter for NBC4 in Washington, specializing in politics and the District of Columbia government. ", "asin": "0786755938", "rank": "644428", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51AgphQR7BL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}