{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 16, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "This funny book is about Francie, a depressed twenty-year-old lesbian seeking life and love while working at the IHOP.http://nicolewbrown.blogspot.com/2016/09/the-ihop-papers-by-ali-liebegott.htmlI think there is an indisputable link between freaks and a bottomless coffee cup.-Ali Liebegott (The IHOP Papers p 7)I love Irene. I’ve never been so in love in my life. The kind of love where you believe if you can have the other person, everything will be perfect. Life will be fine. Every drop of pain scrubbed free from life’s ink.-Ali Liebegott (The IHOP Papers p 26)Everyone wants to be found, Goaty. The problem is sometimes we get so good at hiding we don’t even know we’re doing it anymore.-Ali Liebegott (The IHOP Papers p 150)The weirdest thing anyone has ever said to me while I was waitressing was from this man who used to come in and eat buckwheat pancakes and read Tai Chi books. He said, “Never cook rice while listening to rock music, because the negative energy from the rice will lodge in your lower chakras and cause mental anguish and sexual frustration.” I said, “Oh, I was sexually frustrated and mentally anguished long before I ever listened to rock music while cooking rice.” Who were these freaks—and if they were concerned with right livelihood and health, what were they doing eating at IHOP?-Ali Liebegott (The IHOP papers p 201)"}, {"review_sentiment": 5.0, "review_text": "This book is freaking fantastic. It's dark but funny. An elegy for a kind of San Francisco that I'm not sure exists anymore."}, {"review_sentiment": 4.0, "review_text": "3.5 starsF/F general lesbian fiction, some romance, New AdultThis is shelved as a romance but don't come here expecting anything truly romantic or formulaic as far as the romance genre goes.  This 20ish yr old lead is an unwashed and self-absorbed chain-smoking little troll who talks incessantly about suicide but, unfortunately, never follows through.  She prides herself in being both a cutter and a sober/AA train wreck and believes the only way into a woman's heart is to manipulate for sympathy and attention.  I almost tossed the novel after the opening pages and ultimately felt I was just too old to appreciate it or find anything \"cool\" about this pretentious mess.The novel is mostly about nothing.  It follows about a year in the life of aspiring writer/poet Francesca, a young lesbian virgin who becomes obsessed with her kooky-zen goddess-loving community college philosophy instructor and follows her from Southern California to San Francisco.  Here she gets a job as an IHOP waitress and spends a month living with her beloved loser-loving professor (and her professor's male and female lovers) in a hippie-style apartment they call Simplicity House until she gets her own place.  Here she is nicknamed \"Goaty\" because she has foul hygiene habits and smells like a goat.The story is written in first person narrative and reads like the angsty diary of a teenager entering young adulthood.  And because this narrator is only 20 and clearly doesn't know jack about life or love, she spends a whole lot of time talking about her IHOP uniform, random encounters, and frivolous, albeit witty and darkly humorous, digressions.  All the while swooning hopelessly over her elusive professor.  And her hot AA sponsor.  And some soap opera actress to boot.  Anyone unattainable, basically.  She's incapable of any real loyalty or commitment.  It is classified as fiction but it feels more like a memoir. Circa late 1980's, I'm guessing.  It's a patchwork of one's life observations hyped up to amuse and impress with a good eye for the absurd. She's also chronicling the whole absurdity as this very book during the course of the story.  This underlying author Agenda added some degree of pretentiousness and contrived melodrama that just kinda took the heart out of this one for me.Language-wise, this is a very talented author. It's what I truly enjoyed about the novel once I got over my initial impression that it was trying way too hard. I just wish she had a more positive and mature story to tell.  It just left me with mixed feelings about the book.  I'd of been much more impressed had a more solid and detailed landscape of the time period been drawn. And if the lead was more likable, I guess.  You're either going to love or hate this lead.  The romance here sucked ass.  It's all dysfunction, really.  The sex is pretty cringe-worthy and one-sided in most cases and there is no happy ending as far as the f/f love goes.  It's a character study, really, and would be more appropriately shelved as General Lesbian Fiction- NOT romance.  All the relationship drama was so over-the-top and more like reinforcing stereotypes of dyke-drama, bisexuals, and incestuous lezzie friendship circles.The \"real\" love story here is self(ish) love...  affirming her own self absorbed self importance and her grandiose destiny as a writer.  And screw women.  Something like that.  I mean... she is deflowered by her pen (god I hope that was a metaphor) and runs off into the sunset with her typewriter.  Really?  Too narcissistic and negative overall for my tastes. But I'm not gonna knock it too hard on the star rating because I can see how a certain audience would love it. Maybe every generation needs their train wreck lesbian stories... I grew up with enough of them to last a lifetime and now prefer happier stories myself.ps:  No ebook??  WTH...."}, {"review_sentiment": 5.0, "review_text": "There is nothing like this book out there, I love it.  I read this for the first time years ago, and it's funny, original, and Francesca is an endearing mess of a human being.  Case in point, the way she describes getting rid of her hymen is like nothing I've read before, I will laugh out loud at that for years to come.  It reads like a memoir because most likely it is, I could only dream of writing a memoir as amazing as this."}, {"review_sentiment": 3.0, "review_text": "This book was enjoyable to read especially for a book group and it was nice to pick up a novel in the main character is queer. That said, it was just too much to deal with the main character's issues. It seemed beyond believable to me, especially the amount of money she was able to save with such a low income. Overall not true to life or, at least, I hope not."}, {"review_sentiment": 5.0, "review_text": "The IHOP Papers is surprising and hilarious in that gritty, depressing, \"Tiny Furniture\" kind of way. I look forward to reading more works by Liebegott. (And I still think about this book whenever I catch myself admiring someone's collar bones.)"}, {"review_sentiment": 5.0, "review_text": "Funny, dark and complex, this book was a very enjoyable read. I was lucky enough to get to see parts of it read aloud by the author, which I recommend, if you get the opportunity. Her deadpan delivery adds even further layers to the book's creepy humor."}, {"review_sentiment": 5.0, "review_text": "Not every page-turned is one by virtue of having a conventional plot. Ali Liebegott wins the reader's devotion by simply being smarter, more honest, and funnier than anyone else. This is one of the best coming-of-age novels I have ever read in terms of what it offers on every page. The gentle transformation of the narrator from awkward, selfish, and aimless to slightly less awkward, slightly less awkward, and slightly less aimless is fantastically well done."}, {"review_sentiment": 3.0, "review_text": "I enjoy reading but this book had no plot whatsoever. Don't buy this book. If you want to read it read it online or sample it first using Google Books."}, {"review_sentiment": 2.0, "review_text": "If books came with a guarantee, I'd get my money back on this one. And I had really looked forward to reading it. I found it profound in many ways, but I totally couldn't relate to the angst or the characters. It was a chore for me to finish it. I realize it has won an award and it IS well written, but the main character was just too quirky and needy for me to relate to her. I'm glad some readers were able to laugh out loud, I felt sad in many ways, at the self-destructiveness, the isolation , the loneliness of the main character. And Irene left me cold as did most of the characters. May be I'm just too old for this type of fiction??"}]}, "authors": ["Ali Liebegott"], "isbn": "0786717947", "longitude": -122.4192363, "periods": ["2000s", "Recent Releases"], "title": "The IHOP Papers", "word_cloud": "funny depress lesbian seek life love work think indisputable link freak bottomless coffee p love never love life kind love believe person everything perfect fine drop pain scrub free life p want find problem sometimes good hide even know p weirdest thing anyone ever say waitress man use come eat buckwheat pancake say cook rice listen rock music negative energy rice lodge lower chakras cause mental anguish sexual say sexually frustrate mentally anguish long ever listen rock music cooking concern right livelihood health eat p freaking fantastic dark funny elegy kind sure exists anymore general lesbian fiction romance shelve romance come expect anything truly romantic formulaic far romance genre go yr old lead unwashed little troll talk incessantly suicide unfortunately never follow pride cutter train wreck believe way woman heart manipulate sympathy attention almost toss opening page ultimately felt old appreciate find anything cool pretentious mostly nothing follow year life aspire young lesbian virgin becomes obsess community college philosophy instructor follow here get job waitress spend month live beloved professor professor male female lover apartment call get place here nickname foul hygiene habit smell story write first person narrative read angst diary teenager enter young adulthood narrator clearly know jack life spend whole lot time talk uniform random encounter frivolous witty darkly humorous digression swoon hopelessly elusive professor hot sponsor soap opera actress boot unattainable basically incapable real loyalty commitment classify fiction feel memoir late guess life observation hype impress good eye also chronicle whole absurdity course story underlie author add degree pretentiousness contrive melodrama kinda take heart talented author truly enjoy get initial impression try way hard wish positive mature story leave mixed feeling much impress solid detailed landscape time period drawn lead likable guess go love hate lead romance suck as dysfunction really sex pretty case happy end far love go character study really appropriately relationship drama reinforce stereotype bisexual incestuous lizzie friendship real love story is affirm absorb self importance grandiose destiny writer screw woman something mean deflowered pen god hope metaphor run sunset typewriter narcissistic negative overall taste hon hard star rating see certain audience maybe generation need train wreck lesbian story grow enough last lifetime prefer happier story book nothing love first time year ago funny original endear mess human point way get rid hymen nothing laugh loud year come read memoir likely write memoir amaze enjoyable especially group nice pick main character queer say much deal main character issue seem believable especially money able save low income true life least hope surprise hilarious gritty depress tiny furniture kind way look forward read work still think catch admire someone collar bone dark complex enjoyable lucky enough get part author recommend opportunity deadpan delivery add even layer creepy humor not virtue conventional plot win devotion simply smarter honest funnier anyone else best novel ever term offer page gentle transformation narrator selfish aimless slightly le awkward slightly le awkward slightly le aimless fantastically well do enjoy read plot whatsoever want online sample first use come guarantee get money back really look forward reading find profound many way totally angst character chore finish realize award well write main character quirky needy relate glad reader able loud felt sad many way isolation loneliness main character leave cold character old type fiction", "genres": ["Fiction & Literature", "LGBT"], "summary": "Francesca, a disgruntled nineteen-year-old lesbian, tries desperately to pull together the pieces of her scattered life. This hilarioius, heartfelt novel opens with Francesca newly arrived in San Francisco. She has fled her hometown, where she rented her childhood room from the new family who moved in when her parents moved out. The new tenants happened to be her childhood babysitter and her alcoholic husband.\r\n\r\nBut Francesca's move to San Francisco is no mere coincidence. A lonely virgin searching for her sexual identity and obsessed with her philosophy teacher, Francesca has followed her professor, Irene, to California, where Irene has relocated to live with her young male lover and former student. Once in San Francisco, Francesca is forced to work at the local pancake house. Much to her dismay, she has to wear a ridiculous Heidi of the Alps uniform — which is almost as humiliating as serving the array of speed freaks and other graveyard shift misfits.\r\n\r\nSuicidal and euphoric, Francesca seeks solace in anything and anyone who might distract her from her unrequited love for Irene. More than a coming of age story, The IHOP Papers is a comic portrait of survival and self-discovery on the IHOP late shift.", "asin": "0786717947", "rank": "1428246", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51Ay9515jPL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}