{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 2, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Anthony Trollope outstanding novelist of 19th Century - wrote this 'travel guide' to West Indies.  His comments about the culture and different islands are just as previlant today as they were back then."}, {"review_sentiment": 3.0, "review_text": "In the late 1850s, British postal employee Anthony Trollope travelled though the Caribbean Islands and Central America on Official Business. In his free time he wrote a book about what he saw and what he thought about it. He undergoes the usual travel woes (terrible boats, worse food), and spends considerable time discussing the projected Nicaragua Canal (not worth the expense). But most interesting are his views on the recently emancipated blacks of the British colonies.Writing on the eve of the American Civil War, Trollope's feelings are ambiguous. As a Christian, he knows that emancipation was, in the abstract, a good thing. But he clearly feels that the days of slavery were the Good Old Days (he uses that actual phrase) when the islands were prosperous. The free blacks, to Trollope's annoyance, insist on working only enough to supply their own wants, which are relatively few. All this fertile land is going to waste for lack of labor because there's no way to force the blacks to work. (At this time in Britain, a worker could not quit his job without his employer's permission.)The issue for Trollope is not just economic. Idleness is a sin and a sign of barbarism. Of course you didn't see Trollope himself toiling away in the hot sun--or even in the cold rain, since it was widely believed that physical labor in the tropics was fatal to white people. It's a fascinating glimpse of mid-19th century racial attitudes, as long as you can keep your historical perspective. If you become angry because Trollope refuses to think like a 21st century liberal, you won't learn anything."}]}, "authors": ["Anthony Trollope"], "isbn": "0786706384", "longitude": -82.3658671, "periods": null, "title": "The West Indies and the Spanish Main", "word_cloud": "outstanding novelist write guide comment culture different island prevalent today back late british postal employee travel free time write saw think undergo usual travel woe terrible boat worse food spends considerable time discuss project worth expense interesting view recently emancipate black british eve feel ambiguous christian know emancipation abstract good thing clearly feel day slavery good use actual phrase islands prosperous free black trollope annoyance insist work enough supply want relatively fertile land go waste lack labor way force black work time worker job employer permission issue economic sin sign barbarism course see toil away hot sun even cold rain widely believe physical labor tropic fatal white people fascinate glimpse century racial attitude long keep historical perspective become angry refuse think century liberal anything", "genres": ["History", "Travel Writing", "Social & Cultural Studies"], "summary": "Coping with ill-iced claret, rotten walnuts, and withered apples, British Postal Service employee and successful Victorian novelist Anthony Trollope sailed aboard the Atrato from the English port of Southampton to Kingston, Jamaica, in November, 1858 to survey land and conclude treaties in the West Indies and Central America for the English government. In the course of his extended sojourn, he also wrote a book -- not about official business but rather about the islands he visited and the people he met; about breathtaking landscapes, exotic foods, the tropical climate, earthquakes, Panamanian railroads, Cuban cigars, racial hierarchies, and colonial customs.", "asin": "0786706384", "rank": "2663078", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/512WQN2HVPL.jpg", "country": "Cuba", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}