{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 4, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "This is a perfect gem. Watercolor sketches of the buildings of London are beautifully rendered. If you love London and architecture, this book is just what you need. I highly recommend this lovely book."}, {"review_sentiment": 5.0, "review_text": "Charming set of drawing of building both old and new, quaint and majestic, familiar and never before seen."}, {"review_sentiment": 5.0, "review_text": "This book is beautifully put together. A perfect little escape to London. I have a least 5 friends in mind who would love this book as a gift. A perfect coffee table book, and it's not to big so it won't take up the whole coffee table!"}, {"review_sentiment": 5.0, "review_text": "Such lovely memories of a city that was home for me 40 years ago and where I visit frequently  - makes me want to go soon! Fabulous images of great buildings!"}]}, "authors": ["James Gulliver Hancock"], "isbn": "0789331128", "longitude": -0.12574, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases"], "title": "All the Buildings in London: That I've Drawn So Far", "word_cloud": "perfect gem sketch beautifully render love architecture need highly recommend lovely charm set draw building old new quaint majestic familiar never see beautifully perfect little escape least friend mind gift perfect coffee table big whole coffee table such lovely memory city home year ago visit frequently make want soon fabulous image great", "genres": ["Art & Architecture", "History"], "summary": "The follow-up to the hugely popular All the Buildings in New York, this is a charmingly illustrated journey through London, one building at a time.\r\n\r\nAll the Buildings in London is a love letter to London, told through James Gulliver Hancock’s unique and charming drawings of the city’s diverse architectural styles and streetscapes. Hancock’s offbeat drawing style gives a sense of whimsical and delightful fun to his illustrations, while perfectly capturing each building’s architectural details. This unusual combination of the artistic and the technical presents London’s cityscape like never before.\r\n\r\nThe book includes such beloved iconic buildings as St. Paul’s Cathedral and Buckingham Palace; the latest modern landmarks, such as the Shard and the London Eye; celebrated cultural institutions, such as the British Museum and Tate Modern; and other notable attractions, such as Piccadilly Circus and Trafalgar Square, as well as the bridges and docks along the river Thames. Also featured are the everyday buildings that may not be famous but whose stylishness or eccentricity make up an important part of London and its architectural landscape.\r\n\r\nLondoners and tourists alike will savor this volume that uniquely celebrates the energy, spirit, and history of one of the greatest cities in the world.", "asin": "0789331128", "rank": "666048", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/618mVhODCIL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}