{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 37, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "This book is incredible. It's such a beautiful depiction of the variety and vitality of New York's architecture as seen through the lens of Hancock's unique and playful art style. You should listen to the 99% Invisible episode about this book if you enjoyed it! (Episode 92 - All The Buildings)"}, {"review_sentiment": 5.0, "review_text": "My grand daughter loved it"}, {"review_sentiment": 5.0, "review_text": "We saw this book while on vacation and didn't have time to purchase it so when we got home we bought it on Amazon for a great price.  It was a gift for our nephew who is a car designer and although he has never been to New York we thought he would admire the author's talent.  He was both awed and inspired by it.  It got such a rave review that we also purchased several more and sent them to friends who live in New York.  This book is very unique and well done.  Made us want to head to New York to use as a guide book to admire the artist's buildings."}, {"review_sentiment": 5.0, "review_text": "cute little book and interesting thing about nyc!"}, {"review_sentiment": 3.0, "review_text": "Felt to much like a child story book."}, {"review_sentiment": 2.0, "review_text": "Just sketches - was looking for old photos & desciptions"}, {"review_sentiment": 5.0, "review_text": "To those reviewers who also wanted information about the buildings as well - this is not that book. It is explained how the book came about, pure and simple. This book is a very personal view of New York architecture through an illustrator's eyes. A visitor, he lived in New York for a few years, gradually drawing the buildings which caught his eye. The buildings seem alive, they have personality and style - a visual feast. This is a special book for those who know and love New York. Apparently, the author has even had commissions to do individual New Yorkers' own dwellings."}, {"review_sentiment": 5.0, "review_text": "Was a gift to a New Yorker and he really liked it.  Nice Art."}, {"review_sentiment": 5.0, "review_text": "Great book!"}, {"review_sentiment": 1.0, "review_text": "Sounds terrific, if you read the reviews, so I bought it (sadly, like a sheep).Ridiculous heap of art looking like it was done by a 3rd grader. No addresses, no maps, just random. There went my hard earned cash, flushed down the toilet, and just think, I could have bought a Thanksgiving Feast for a homeless person! Sad, oh so sad......I feel used and abused, lied to and cajoled, hope crushed."}]}, "authors": ["James Gulliver Hancock"], "isbn": "0789324679", "longitude": 0.0, "periods": ["1900s", "2000s", "Recent Releases"], "title": "All the Buildings in New York: That I've Drawn So Far", "word_cloud": "incredible beautiful depiction variety vitality architecture see lens unique playful art style listen invisible episode enjoy grand daughter love saw vacation time purchase get home buy great price gift nephew car designer never thought author talent awe inspired get rave review also purchase several sent friend live unique well do make want head use guide admire artist cute little interesting thing nyc felt much child story just sketch look old photo description reviewer also want information well explain come pure simple personal view architecture illustrator eye visitor live year gradually draw catch eye seem alive personality style visual feast special author even commission individual dwelling gift really like great terrific review buy sadly like sheep heap art look do grader address map go hard earn cash flush toilet think homeless person sad feel use abused lie cajole hope crush", "genres": ["Art & Architecture", "History"], "summary": "A charmingly illustrated journey through New York City, neighborhood by neighborhood. All the Buildings in New York is a love letter to New York City, told through James Gulliver Hancock’s unique and charming drawings of the city’s diverse architectural styles and cityscape.\r\n\r\nHis buildings are colorful and chock full of fun and offbeat details, and this book is full of new discoveries as well as old chestnuts for anyone who loves the Big Apple. Organized by neighborhoods, the book features iconic New York buildings, such as the Empire State Building, Rockefeller Center, and Flatiron Building, as well as the everyday buildings that make up New York City—the boutique shops in SoHo, timeless brownstones in Brooklyn, and rows of busy markets in Chinatown.\r\n\r\nNew Yorkers and tourists alike will savor this one-of-a-kind volume that uniquely celebrates the energy and spirit of the city that never sleeps.", "asin": "0789324679", "rank": "106353", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/61IZV6og%2BCL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}