{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 21, "rating": 4.2, "reviews": [{"review_sentiment": 1.0, "review_text": "The book never interested me at all."}, {"review_sentiment": 4.0, "review_text": "Was a gift for my son going to Panama"}, {"review_sentiment": 5.0, "review_text": "I learned how the Panama hat industry works."}, {"review_sentiment": 5.0, "review_text": "When the country of Peru is mentioned, one imagines a peaceful scene of an Andean alpaca grazing along an Incan stone wall. When Ecuador is brought up, we imagine a rain forest panorama of frogs jumping off branches while butterflies mate in the background. When Colombia is mentioned, we envision a post-apocalyptic city full of overturned buses, being pillaged by men in ski masks. It is obvious which country any rational person would seek to avoid while searching for international romance.\"48,000,000 Colombians Can't Be Wrong\" is a true adventure story about a gringo who goes online to look for a girlfriend in Colombia and then hops on a flight to Colombia's capital in pursuit of a woman he has never seen in person.For more information on the book, please email the title, \"48,000,000 Million Colombians Can't Be Wrong.\""}, {"review_sentiment": 5.0, "review_text": "Product is described accurately and vendor service was very good."}, {"review_sentiment": 5.0, "review_text": "We just returned from visiting South America and I wanted to re-read this book. I read it a long time ago and really enjoyed it then."}, {"review_sentiment": 5.0, "review_text": "Good read for those who love straw hats. It traces the point of origin to retailers."}, {"review_sentiment": 4.0, "review_text": "I am headed off to Ecuador in a month so I thought it would be useful to learn a few things about the country. Miller's book provides an insightful guie by indirection. He is a detective on the trail of the somewhat elusive Panama hat (they are all made in Ecuador, not Panama). Following Miller around Ecuador in search of the hat - the straw, the weavers, the  Indio communities where the weavers live, the rural towns where buyers acquire the hat bodies from the Indios, the city of Cuenca where the hats are finished - introduced me to this varied country. Miller goes everywhere, and has a convenient map so readers can follow his footsteps. I read this book with a recent guide book in one hand, so I learned quite a bit as I read.Like so many books (and movies) this one is something of a Jewish story. (I think this is because so many writers and film makers, and those in their markets, are Jewish). After the Russian pogroms during and after WWI, and after the holocaust, some Jews migrated to South America - though very few to Ecuador. But those who did - perhaps not unsurprisingly - went into the local clothing industry and that industry happens to be panama hats. So in passing readers are treated to an interesting story about interesting and enterprising families."}, {"review_sentiment": 4.0, "review_text": "Miller has created an easy way to learn about the history and people of Ecuador.  As you follow his travels to various parts of the country, you learn to appreciate what life there is like."}, {"review_sentiment": 5.0, "review_text": "If you're interested in Ecuador this is a \"must read\" book. I really enjoyed the book. I like hats, too, but the book is even better for its Ecuadorian history and culture. A well written book of Ecuador, its culture and history. He writes in a nice and easy style. I was disappointed in Ecuador to see very few men wearing this hat and the book explains the history behind their aversion."}]}, "authors": ["Tom Miller"], "isbn": "0792263863", "longitude": 0.0, "periods": ["1900s"], "title": "The Panama Hat Trail", "word_cloud": "never interested gift son go learn industry work country mention imago peaceful scene alpaca graze along stone wall bring imagine rain forest panorama frog jump branch butterfly mate background mention envision city full overturn bus pillage men ski mask obvious country rational person avoid search international romance true adventure story gringo go online look girlfriend hop flight capital pursuit woman never see information please title product describe accurately vendor service good return visit want long time really enjoy good love straw hat trace point origin retailer head month think useful learn thing country provide insightful guise indirection detective somewhat elusive make follow search straw weaver community weaver live rural town buyer body city hat finish introduce varied country go everywhere convenient map reader follow footstep recent guide hand learn quite bit many movie something jewish story think many writer film maker market jewish russian pogrom holocaust migrate perhaps unsurprisingly go local clothing industry industry happen hat so pass reader treat interesting story interest enterprising family create easy way learn history people follow travel various part country learn appreciate life interested really enjoy like hat even better ecuadorian history culture well write culture history write nice easy style disappoint men wear explain history aversion", "genres": ["Travel Writing", "Humour"], "summary": "This 15th anniversary reissue of Miller’s travel classic follows the making and marketing of a single Panama hat. It’s a captivating story of cultures in collision, raw capitalism, and an exotic, humorous journey.\r\n\r\nThough offering perhaps more about Panama hats than the reader might ever want to know, this is a satisfying travel book that tells much else about Ecuador and its peoples. The growing, harvesting, and processing of straw, the weaving of it, the finishing of the hats, exportation, and all the bartering along the way is the glue that holds this book together. \r\n\r\nVisiting the countryside and towns such as Quito, Guayaquil, Lago Agrio, and Jipijapa (\"among the ugliest towns south of the equator\"), Miller tells us, among other things, about the Indians and their sad centuries-long plight, expatriates, illegal Ecuadorian emigration to the United States, precarious third-class Andean bus trips, the small Jewish community, and a wild and tragic Corpus Christi fiesta.", "asin": "0792263863", "rank": "1251060", "city": "Quito", "image": "https://images-na.ssl-images-amazon.com/images/I/51M96HFGH0L.jpg", "country": "Panama", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}