{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 2954, "rating": 4.9, "reviews": [{"review_sentiment": 5.0, "review_text": "good read"}, {"review_sentiment": 4.0, "review_text": " Oh my goodness, what an amazing story of friendship, love, and sacrifice. Jonathan Kis-Lev has done an outstanding job of connecting the reader with the characters. I have read books in the past based on true stories and books about the terrible events surrounding the Holocaust, but for me, this book captures such a feeling of being there in the moment and truly experiencing it like no other that I have read before.I loved how in the beginning of the book Kis-Lev takes the reader on a happy journey of getting to know these young ladies and their families. I got to see Maria and Helena start life so differently, but grow to love each other so much in spite of Maria being a Christian and Helena being a Jew. I loved spending holidays with their families and going to the beach and feeling that childlike excitement and fun.Then when it seemed that life couldn't get much better, the rug was ripped out from under me just as it was for these young ladies, and the war began. Oh my, I cried as poor Helena lost everything that she held dear. Her family was gone. Her home was gone. Now she was trapped in the ghetto and she was dying, not only physically, but also mentally, emotionally and spiritually as well. It so was hard for Maria to know that she was losing her one true friend. She had to do something before she lost Helena forever.Maria teaches us that true friendship requires complete sacrifice and laying down your own life for your friend. I learned so much from this book that I wasn't expecting to. Friendship isn't something to be taken lightly. It is real and it is valuable. My hats off to Jonathan Kis-Lev for capturing this beautiful true story and sharing it with us. This is the best book I have read in a very long time with its joys, its sorrows and ultimately...Hope."}, {"review_sentiment": 5.0, "review_text": "Truth, conviction, the best and worst of humanity displayed. To live a life that touches others should not just be a wartime effort. And the ten Booms' was their whole lives."}, {"review_sentiment": 1.0, "review_text": "This book is effectively a few paragraphs and the price not reflecting a few paragraphs. Classical example of click bait."}, {"review_sentiment": 1.0, "review_text": "Aside from the writing not being very good the story takes up only about half of the book. The rest is filler information. I would never read anything by this author again."}, {"review_sentiment": 5.0, "review_text": "Amazing story! I’m forever changed and grateful to be touched by this record of the love of God and miracles."}, {"review_sentiment": 3.0, "review_text": "This book would be 5 stars if it didn't end abruptly at the 48% mark on my Kindle. Yes, I paid $10 for essentially half a book and that aggravates me."}, {"review_sentiment": 5.0, "review_text": "This is a book of many faces. Some would say it is a  book about the holocaust. It certainly is that but that is not what the book was really about. So is it a book about a heroic family that puts their lives and freedom on the line to save the lives of jews. Yes, that did happened but that is not what the book was about. Was it about the incredible strength and resilience to survive the concentration camps of Hitler's Germany? Yes, they did that but it was not about that either.  Was it about forgiveness? Or the work done to help those that had been imprisoned heal and get their lives back?  It was all of these and none of these. It was about Faith. The faith of one family. The kind of Faith that produces the rest of the story. It was their faith and their love of God that was at the heart of all they did, all they survived, all they accomplished.  Faith. Love. And dedication to God's will for their lives."}, {"review_sentiment": 5.0, "review_text": "This is the most inspirational book I have ever read. I would recommend it to any reader; but, due to the graphic nature of some of her experiences, I recommend it to readers 16+."}, {"review_sentiment": 5.0, "review_text": "Wonderful listening experience."}]}, "authors": ["Corrie Ten Boom", "Elizabeth Sherrill", "John Sherrill"], "isbn": "0800794052", "longitude": 4.8936041, "periods": ["1900s"], "title": "The Hiding Place", "word_cloud": "good goodness amaze story friendship sacrifice do outstanding job connect character past base true story terrible event surround capture feel moment truly experience love begin take happy journey get know young lady family get see start life differently love much spite love spending holiday family go beach feel childlike excitement seem life much better rug rip young lady war begin cry poor lose everything hold dear family go home go now trap ghetto die physically also mentally emotionally spiritually well hard know lose true friend something lose teach true friendship require complete sacrifice lay life friend learn much expect something take lightly real valuable hat capture beautiful true story share best long time joy sorrow ultimately hope conviction best worst humanity display life touch others wartime effort whole life effectively paragraph price reflect paragraph classical example click bait aside write good story take rest filler information never anything author amazing story forever change grateful touched record love miracle abruptly mark pay essentially half aggravates many face holocaust certainly really heroic family put live freedom line save life jew happen incredible strength resilience survive concentration camp forgiveness work do help imprison heal get live none faith family kind produce rest story faith love heart survive accomplished dedication live inspirational ever due graphic nature experience recommend reader wonderful listening experience", "genres": ["Memoir", "History", "Religion", "WWII"], "summary": "\"Every experience God gives us . . . is the perfect preparation for the future only He can see.\" Corrie ten Boom\r\n\r\nCorrie ten Boom was a Dutch watchmaker who became a heroine of the Resistance, a survivor of Hitler's concentration camps, and one of the most remarkable evangelists of the twentieth century. In World War II she and her family risked their lives to help Jews and underground workers escape from the Nazis, and for their work they were tested in the infamous Nazi death camps. Only Corrie among her family survived to tell the story of how faith ultimately triumphs over evil.\r\n\r\nHere is the riveting account of how Corrie and her family were able to save many of God's chosen people. For 35 years millions have seen that there is no pit so deep that God's love is not deeper still. Now The Hiding Place, repackaged for a new generation of readers, continues to declare that God's love will overcome, heal, and restore.", "asin": "0800794052", "rank": "2653", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/51XFKp6q0-L.jpg", "country": "The Netherlands", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}