{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 518, "rating": 4.6, "reviews": [{"review_sentiment": 4.0, "review_text": "You know the outcome but the agonizing course of a frightful history is an emotional perspective that is only possible industry form. As close to an actual experience as can be found in historical writing."}, {"review_sentiment": 5.0, "review_text": "great product"}, {"review_sentiment": 5.0, "review_text": "I just finished rereading \"Rise and Fall of the Third Reich\" and I am enjoying reading the background that lead to the book."}, {"review_sentiment": 5.0, "review_text": "Excellent for giving insight into a journalist’s view of living through the run up to WWII and the first few years. How it felt to watch the world kow-tow to Hitler’s demands in hopes of avoiding violence. It shows the results of appeasement instead of confrontation of evil. Doesn’t touch on the Holocaust, probably because Shirer wasn’t personally involved in that horror. I’d like to get the next book in the two book series and see how that did or did evolve in his personal experience."}, {"review_sentiment": 1.0, "review_text": "While Berlin Diary was a wonderful memoir about a journalist being plunged into the chaos of WWII, End of a Berlin Diary is the self-absorbed nattering of a passionate but uninformed liberal.  This isn't about America, or Europe, War, or Peace - it is about one man's personal reaction to the end of war and the new shape of the world.  Narrow and uninteresting - I got two thirds through it and then put it down unfinished.Wildly different from Berlin Diary, which I would highly recommend to anyone."}, {"review_sentiment": 5.0, "review_text": "Excellent insight in this book , I highly recommend it ."}, {"review_sentiment": 3.0, "review_text": "Nothing like the justly famous \"Berlin Diary\" published in 1941.  This is something along the lines of a very early draft of his \"Rise and Fall of the Third Reich.\"  I found it interesting, but would recommend it only to fans.  I enjoyed (if that's the word) his same-day notes on what he found in Berlin when he visited in the October of 1945.  Folks living in basements, still digging out of the rubble.  His impression was that the Berliners were indeed very sad -- not because of what Germany had done, but because Germany lost.  In Nuremberg, he found that the man in the street, or anyway the local survivors of the bombing, shrugged off the war crimes trials as predictable propaganda."}, {"review_sentiment": 5.0, "review_text": "When I started reading this book I wasn't sure what to think, but it turned out to be very intriguing and difficult to put down.  Mr. Shirer's account of events in Europe leading up to WWII was fascinating."}, {"review_sentiment": 5.0, "review_text": "Any History lover and anyone who believes history repeats itself in political tactics should read this.........if you thought you knew how it all happened, you better read this........a great read"}, {"review_sentiment": 4.0, "review_text": "Essential for WW II history buffs, well written and extremly informative"}]}, "authors": ["William L. Shirer"], "isbn": "0801870569", "longitude": 13.3888599, "periods": ["1900s"], "title": "Berlin Diary: The Journal of a Foreign Correspondent, 1934-1941", "word_cloud": "know outcome agonizing course frightful history emotional perspective possible industry form close actual experience find historical writing great product finish reread enjoy read lead excellent give insight journalist view live first year felt watch world demand hop avoid violence show result appeasement instead confrontation evil touch probably personally involve horror like next series see evolve personal experience wonderful memoir journalist plunge chaos natter passionate uninformed liberal man personal reaction end war new shape world uninteresting get third put different highly anyone excellent insight highly recommend nothing justly famous publish something line early draft find interest fan enjoy word note find visit living basement still dig rubble impression indeed sad do lose find man street anyway local survivor bomb shrug war crime trial predictable propaganda start read sure think turn intriguing difficult put account event lead fascinating lover anyone believe history repeat political tactic think knew happen better great essential history buff well write extremely informative", "genres": ["Memoir", "History"], "summary": "A radio broadcaster and journalist for Edward R. Murrow at CBS, William Shirer was new to the world of broadcast journalism when he began keeping a diary while in Europe during the 1930s. It was in 1940, still a virtual unknown, that Shirer wondered whether his reminiscences of the collapse of the world around Nazi Germany could be of any interest or value as a book. \r\n\r\nShirer's Berlin Diary, which is considered the first full record of what was happening in Germany during the rise of the Third Reich, first appeared in 1941. The book was an instant success. But how did Shirer get such a valuable firsthand account? He had anonymous sources willing to speak with him, provided their identity remained protected and disguised so as to avoid retaliation from the Gestapo. Shirer recorded his and others' eyewitness views to the horror that Hitler was inflicting on his people in his effort to conquer Europe. Shirer continued his job as a foreign correspondent and radio reporter for CBS until Nazi press censors made it virtually impossible for him to do his job with any real accuracy. He left Europe, taking with him the invaluable, unforgettable (and horrific) contents of his Berlin Diary. \r\n\r\nBerlin Diary brings the reader as close as any reporter has ever been to Hitler and the rise of the Third Reich. Shirer's honest, lucid and passionate reporting of the brutality with which Hitler came to power and the immediate reactions of those who witnessed these events is for all time. \r\n\r\nABOUT THE AUTHOR \r\n\r\nWilliam Shirer (1904-1993) was originally a foreign correspondent for the Chicago Tribune and was the first journalist hired by Edward R. Murrow for what would become a team of journalists for CBS radio. Shirer distinguished himself and quickly became known for his broadcasts from Berlin during the rise of the Nazi dictatorship through the first year of World War II. Shirer was the first of \"Edward R. Murrow's Boys\"\u009d - broadcast journalists - who provided news coverage during World War II and afterward. It was Shirer who broadcast the first uncensored eyewitness account of the annexation of Austria. Shirer is best known for his books The Rise and Fall of the Third Reich which won the National Book Award and Berlin Diary.", "asin": "0801870569", "rank": "787841", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/51deCYuKVjL.jpg", "country": "Germany", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}