{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 10, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "thorough study, well documented."}, {"review_sentiment": 5.0, "review_text": "The Venetian Republic endured as the most democratic experiment in Europe from its founding around 1000 AD until it was compelled to surrender to Napoleon and the French in 1797.  It was a maritime Republic founded by boatmen, sailors, merchants and traders.  It had a powerful navy which dominated the Eastern Mediterranean for many years.  It eschewed the rule of hereditary monarchs in favor of the election of Doges by an aristocratic Council.  Venice preferred to be governed by elderly Doges such as Enrico Dandolo who was in his eighties when he led the Venetian contingent of the Fourth Crusade that sacked Byzantium in 1204.  This was a form of built-in term limits.Why should a Conservative in particular celebrate Venice?  The Venetian Republic was the world's first and longest lasting model of a free society with limited government and an exuberant capitalist spirit--the Venetian Republic was Conservative! Frederic Lane opens his Venice: a Maritime Republic by telling us that \"Venice stands out as a symbol of beauty, of wise government, and of communally controlled capitalism.  The distinctiveness of the environment in which the Venetians built gave an obviously unique quality to their city's charm.  Its watery setting contributed to an aristocratic tradition of liberty...After 1000 AD. they became a seagoing nation, sailing trading, and fighting in many parts of the Mediterranean and the rivers of souther Russia to the English Channel.  Finally, Venice became a city of craftsmen, functionaries, and a few aristocrats, a city renowned for its skills in handiwork, finance and government.\"\"Venice had no single written document like the Constitution of the United States embodying a basic law with which all other laws had to conform.  The nearest to it in early times was the doge's oath, the Promissione...We may speak of a Venetian Constitution, however, in the same way that we refer to the British constitution, although it is embodied in no single document but is found in scattered statutes and partly in customs long adhered to...The central organs of government formed a pyramid with the general assembly at its base and the doge at tis apex.  In between them were the Great Council, the forty and the Senate, and the Ducal Council.  Distrust of individual power made the Venetians depend on committees and councils.  Even in their judicial system, sentences were not imposed by an individual judge but by several judges acting together.\"Venice relied upon her naval power to quell piracy and to protect the flow of commerce.  Venice ruled the seas of the Eastern Mediterranean.  Venice also colonized outposts such as Crete and Rhodes.  The Arsenal in Venice was their naval storehouse and arms center.  The ship Amerigo Vespucci is a reminder of Venice's naval power and continues to be a training vessel for the cadets of today's Italian navy.Venetian-led naval forces defeated a large Turkish fleet on October 7, 1571 at the battle of Lepanto.  This decisive victory saved the Venetian holdings such as Crete and the Ionian islands and prevented the raiding of the Italian coast that would otherwise have followed.  This check on the expansion of Ottoman power has been widely acclaimed as one of the decisive battles of world history.Frederic Lane writes, \"the histories of the United States and of Venice are remarkably similar in one respect.  In the early history of both republics, the sea was a source of wealth contributing to the expansion of the rest of the economy...Venice, having used its ships and seamen to gain the lordship of the gulf, a colonial empire, and a leading place among centres of international trade, found later opportunities for growth in industry and finance.\"Typical Venetian homes included a showroom on the main floor for display of a merchant's wares.  There was no distinction between commercial and residential.The Bellini Cocktail.  No trip to Venice is complete with the enjoyment of a Bellini or two.  These were invented by Giuseppe Cipriani at Harry's Bar in the 1930's and named after the famous Venetian painter.  Here is how you make a Bellini cocktail.  Peel fresh white peaches and puree in blender.  Use a champagne flute.  Fill flute with about 2oz of peach puree.  Add 4 oz of chilled Prosecco.  Stir and you've got it!  Salute!If you like Venice, A Maritime Republic you my also enjoy America Invades: How We've Invaded or been Militarily Involved with almost Every Country on Earth by Kelly / Laycock and Italy Invades"}, {"review_sentiment": 5.0, "review_text": "Great book with lots of information and presented in clear and concise manner."}, {"review_sentiment": 5.0, "review_text": "I came to this book with a general interest in history and in the wonders of Venezia, and found the book to be a very satisfying look at the subject.  While many people would not consider this light reading, the book does not assume any special knowledge other than a general grade-school familiarity with history.  What I especially liked about Venice, A Maritime Republic, was the balance between the usual recital of classic political history - wars, rulers, and shifting borders - and vivid snapshots of the economics, culture, and personalities of Venetian history.  For instance, the book offers fascinating glimpses into the organization of a galleys for trade expeditions, encounters between Venezia and the Muslim world, the role of Venezia in medieval manufacturing, innovations in trade and book keeping, and Renaissance printing.  My main disappointment was architecture, which is perhaps Venezia's most lasting  achievement but whose development is not as well-described in the book as I had hoped.Where the book does touch on wars and politics, it gives just enough details to bring the story alive, as in the gripping account of the War of Chioggia, an episode I had never heard of before but which would make a fantastic movie.  The author makes very good choices for which topics to dwell on and which to summarize quickly.  The prose is unremarkable but effective, and the B&W; illustrations are interesting in themselves and well-integrated into the text (though as another review mentions some - but not all - of the illustrations are not very well reproduced in the paperback edition).  Though the illustrations are in shades of gray, reading this book allows one to enter a colorful world where the myth and reality of Venezia grow through time."}, {"review_sentiment": 3.0, "review_text": "It goes through the history of Venice from the early inhabitants escaping the barbarian invaders to the destruction of the republic from Napoleon."}, {"review_sentiment": 5.0, "review_text": "This is one of the two classic histories of Venice; the other that by Norwich.  As reference it is the superior volume.  I keep returning to it on a very wide variety of topics on Venice.  Thus, for instance, it does an excellent job of explaining the ownership and command structures, including the important and active role of common sailors aboard Venetian merchant ships.  If you want to understand why Venice is so important to the understanding of what makes some democracies much more successful than others, this is a must book."}, {"review_sentiment": 4.0, "review_text": "For someone with a serious interest in the development of the Venetian Empire on all fronts, this is a great and overwhelmingly informative book. Lane has done his homework, and casts light on all of the important corners of Venetian life--political, military, social, artistic, mercantile, etc.However, his assembly of this weatlh of information is a bit jagged, faltering especially in the books final third. He doesn't follow true chronology, but skips back and fourth between miniscule details from various centuries in the matter of a paragraph or two. This happens, too, in the great \"Paris: Biography of a City\" by Colin Jones, but he smartly groups these extrapolations out of the timeline into special subsections of his chapters. In Lane, though, it's very easy to find yourself lost at sea unless you really take your time. And lingering in his text can prove tedious, as the onslaught of dates and numbers for all order of minute detail (that could indeed prove very insightful in footnote form) that in the body of the text is more distracting than enlightening."}, {"review_sentiment": 4.0, "review_text": "In a time of absolute monarchies almost everywhere in Europe and Asia, Lane describes the history of an early republic, that managed to prosper for centuries. Nor was this the only anomaly of Venice. It had barely any land area, compared to many of its rivals like Constantinople. Of course, as the book explains, its most striking feature was the its placement in what was essentially a swamp, for defensive purposes.The book chronicles its rapid ascent and ingenuity in being flexible about trading with anyone. The many sea battles also attest to its continued vigilance. Readers might note the resemblences to Britain and its empire.The writing style is quite readable to a non-historian. Enhanced perhaps by a decision not to have footnotes. The illustrations are also well chosen."}, {"review_sentiment": 3.0, "review_text": "Lane's classic reference on Venice offers detailed coverage of the most important facet of the Venitian Empire--its maritime dominance. The prose is scholarly, yet still concise and readable. Compared to Lane, Norwich's weaker Venice book reads like a rambling travel log.However, the figures in this paperback edition of Lane are very poorly reproduced. The maps look like they were copied on a xerox machine, rendering the place names illegible. The photographs and depictions of period artwork are virtually unintelligible. Interested readers might be better served to seek out the hardcover edition."}, {"review_sentiment": 5.0, "review_text": "Frederic C. Lane's classic work is still the best general history on Venice.  The frontpiece chronology alone is an invaluable reference for the scholar or the engaged tourist.  The dean of Venice's historians, his work  ties the maritime, merchantile, and industrial basis that spured trade and  established the wealth of the Venetian republic to the city's cultural  manifestations in art and politics."}]}, "authors": ["Frederic Chapin Lane"], "isbn": "080181460X", "longitude": 12.3345898, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s", "500-1400s"], "title": "Venice, A Maritime Republic", "word_cloud": "thorough study well document endure democratic experiment found around compel surrender found boatman sailor merchant trader powerful navy dominated many year eschew rule hereditary monarch favor election aristocratic prefer govern elderly eighties lead venetian contingent sack form term particular celebrate world first longest last model free society limited government exuberant capitalist spirit open tell stand symbol beauty wise government communally control capitalism distinctiveness environment build give obviously unique quality city charm watery setting contribute aristocratic tradition liberty become seagoing nation sail trade fight many part river southern become city craftsman functionary aristocrats city renowned skill handiwork finance government single write document embody basic law law conform nearest early time doge venetian however way refer british constitution embodied single document find scattered statute partly custom long adhere central organ government form pyramid general assembly base doge tee apex forty individual power make venetian depend committee council even judicial system sentence impose individual judge several judge act together rely naval power quell piracy protect flow commerce rule sea also colonize outpost naval storehouse arm center ship reminder naval power continue train vessel cadet today italian naval force defeat large fleet battle decisive victory save venetian holding islands prevented raid italian coast otherwise check expansion power widely acclaim decisive battle world write history remarkably similar respect early history republic sea source wealth contribute expansion rest economy use ship seaman gain lordship gulf colonial empire leading place center international trade find later opportunity growth industry finance typical venetian home include showroom main floor display merchant war distinction commercial trip complete enjoyment invent name famous venetian painter here make cocktail fresh white peach puree blender champagne flute flute peach puree oz chill get like also enjoy invade militarily involve almost lot information present clear concise manner come general interest history wonder find satisfy look subject many people light reading assume special knowledge general familiarity history especially like balance usual recital classic political history war ruler shift border vivid snapshot economics culture personality venetian history instance offer fascinate glimpse organization galley trade expedition encounter world role medieval manufacturing innovation trade keep printing main disappointment architecture perhaps last achievement development touch war politics give enough detail bring story alive grip account episode never hear fantastic movie author make good choice topic dwell quickly prose unremarkable effective illustration interest text review mention illustration well reproduce paperback edition illustration shade gray reading allow enter colorful world myth reality grow time go history early inhabitant escape barbarian invader destruction classic history reference superior volume keep return wide variety topic instance excellent job explain ownership command structure include important active role common sailor venetian merchant ship want understand important understanding make democracy much successful others someone serious interest development front great overwhelmingly informative do homework cast light important corner venetian life political military social artistic mercantile assembly wealth information bit jag falter especially final third follow true chronology skip back fourth minuscule detail various century matter paragraph happen great smartly group extrapolation timeline special subsection chapter easy find lose sea really time linger text prove tedious onslaught date number order minute detail indeed insightful footnote form body text distract enlighten time absolute monarchy almost everywhere describe history early manage prosper century anomaly barely land area compare many rival course explains striking feature placement essentially swamp defensive chronicle rapid ascent ingenuity flexible trading anyone many sea battle also attest continue vigilance reader resemblance write style quite readable perhaps decision footnote illustration also well classic reference offer detailed coverage important facet dominance prose scholarly yet still readable read ramble travel figure paperback edition poorly reproduce map look copied machine render place name illegible photograph depiction period artwork virtually unintelligible interested reader better seek hardcover edition classic work still best general history front piece chronology alone invaluable reference scholar engage tourist dean historian work tie mercantile industrial basis spoored trade establish wealth city cultural manifestation art politics", "genres": ["Art & Architecture", "History", "Renaissance", "Politics"], "summary": "Combining engrossing detail and magisterial overview, \"Venice, A Maritime Republic\" traces the history of Venice from its origins in the sixth century through its rise and decline as the first modern empire of Europe. \"Among the many cities men have made, \" Frederic C. Lane Writes, \"Venice stands out as a symbol of beauty, of wise government, and of community controlled capitalism.\" \r\n\r\nDrawing on a lifetime of study and reflection, the author shows how that resplendent city came to have the institutions, the buildings, and the pattern of urban life that make it unique.\r\n\r\n\"Students now have an analysis of Venice's fortunes over the whole course of its independent history that they can trust... A crisp and clearly visualized narrative.\" Times Literary Supplement\r\n\r\n", "asin": "080181460X", "rank": "1073455", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51civtsw2WL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}