{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 29, "rating": 3.7, "reviews": [{"review_sentiment": 3.0, "review_text": "This book was a decent read, but it was fairly difficult if your French isn't completely up to par. Give it a try if you want a good challenge and a decent storyline."}, {"review_sentiment": 4.0, "review_text": "i dont even know what i was reading half the time but i think it was good?"}, {"review_sentiment": 5.0, "review_text": "One of my favorite works of surrealist writing."}, {"review_sentiment": 5.0, "review_text": "great gift"}, {"review_sentiment": 4.0, "review_text": "Unfortunately my French is not good enough to read this classic in its original version, instead I am reading this English translation, there exist two that were published (apparently a third unpublished), I am not sure right now which one it is; I find the first quarter very complicated and felt I am not getting the point what the author is actually trying to say until he gets to the narration meeting the star or the story, mythical \"Nadja\". I read the book together with a friend (also reading the English translation), who experienced the same. I am considering the option the translation is not very good, simply base don the fact that the book is a classic. The second part is interesting. The photographs are very low resolution due to the time they were taken, but still fascinating."}, {"review_sentiment": 3.0, "review_text": "I've never actually read Breton before, and I have a hard time knowing what to make of this. I tend to think of people who spearhead artistic movements and write 'manifestos' as urbane, jaded and sophisticated to the point of seeming almost inhuman.Breton's prose certainly winds itself through some dazzling conceptual mazes, but I think I was caught off guard by how mopey the book, about an infatuation Breton has with an unstable young woman, was on a basic level. I still enjoyed it, but I feel like I would really need to be submerged in Parisian intellectual life in the 1920's to fully appreciate it."}, {"review_sentiment": 4.0, "review_text": "Still waitign to read."}, {"review_sentiment": 1.0, "review_text": "Bought French version by mistake. Wold gI've English a 4 plus.."}, {"review_sentiment": 5.0, "review_text": "Thanks."}, {"review_sentiment": 5.0, "review_text": "Honest seller. Product exactly as promised. Great eBayer"}]}, "authors": ["André Breton"], "isbn": "0802150268", "longitude": 2.3514992, "periods": ["1900s"], "title": "Nadja", "word_cloud": "decent fairly difficult french completely par try want good challenge decent story line font even know read half time think good favorite work surrealist write great gift unfortunately french good enough classic original version instead read english translation exist publish apparently third unpublished sure right find first quarter complicate felt get point author actually try say get narration meeting star story mythical together friend also read translation experience consider option translation good simply base fact classic second part interest photograph low resolution due time take still fascinate never actually hard time know make tend think people spearhead artistic movement write urbane jade sophisticated point seem almost prose certainly wind dazzle conceptual maze think catch guard mopey infatuation unstable young woman basic level still enjoy feel really submerged intellectual life fully still version mistake gi thanks seller exactly promise bayer", "genres": ["Fiction & Literature"], "summary": "\"Nadja, \" originally published in France in 1928, is the first and perhaps best Surrealist romance ever written, a book which defined that movement's attitude toward everyday life.\r\n\r\nThe principal narrative is an account of the author's relationship with a girl in the city of Paris, the story of an obsessional presence haunting his life. The first-person narrative is supplemented by forty-four photographs which form an integral part of the work -- pictures of various \"surreal\" people, places, and objects which the author visits or is haunted by in Nadja's presence and which inspire him to mediate on their reality or lack of it. \r\n\r\n\"The Nadja of the book is a girl, but, like Bertrand Russell's definition of electricity as \"not so much a thing as a way things happen,\" Nadja is not so much a person as the way she makes people behave. She has been described as a state of mind, a feeling about reality, a kind of vision, and the reader sometimes wonders whether she exists at all. Yet it is Nadja who gives form and structure to the novel.", "asin": "0802150268", "rank": "138788", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41K0AFXM63L.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}