{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 1821, "rating": 4.1, "reviews": [{"review_sentiment": 1.0, "review_text": "I’ve never written an amazon review before, but I have also never before disagreed with amazon reviews so strongly (and clearly also with the Pulitzer committee). Maybe I am missing something. My biggest disappointment was that I got little sense of the Vietnamese experience of the war or the post war. The people who inhabit this book represent only the smallest, and not very typical, segment of the Vietnamese experience, nor do they ever inhabit any recognizable part of Vietnam during or after the war. Nor do they have much of any American experience except with charicatures (the department head, the congressman, the Auteur). In fact, with only a few exceptions most characters are nameless cartoons, the crepulent major, the grizzled major, the general, the commandant, the commissar, diminishing their humanity in much the same way the movie in the novel diminishes its Vietnamese participants. The only people besides the narrator’s childhood friends who achieve the status of having names are Sonny and Lana, the most Americanized Vietnamese in the story.  Beyond the not very convincing plot, I found it frequently over written and repetitive, never humorous, and generally a chore to read."}, {"review_sentiment": 1.0, "review_text": "wont let me return in horrible condition."}, {"review_sentiment": 1.0, "review_text": "hated it"}, {"review_sentiment": 5.0, "review_text": "So well crafted. Great interpretation of  the human condition. Although very personal and clearly a unique experience, the introspection and view of all societies and the history of nations and all humanity for that matter , made this work a must read. The tongue in cheek wordplay , humor as well as human tragedy made real and unreal , earn the 5 stars and then some!!!!"}, {"review_sentiment": 5.0, "review_text": "Really a must read for anyone interested who suffered through the Vietnam war."}, {"review_sentiment": 5.0, "review_text": "An excellent voice that made me befriend the book and hesitate to put it down in spite of the harsh narrative. Heartless often, it lays bare how exile makes us unrecognizable even to ourselves.I lived through a revolution and saw where promises went. You could label it, as the protagonist does, \"NOTHING\" \"NADA.\""}, {"review_sentiment": 2.0, "review_text": "Great story idea, and the opening 100 pages are fantastic... but by page 250, I was tempted to put it down and leave it there. The problem is that the prose is far, far too dense. Simple events or exchanges run on and on with the result being - for me at lest -  loss of interest in the story being told.I had to skim the last 150 pages as I simply wanted to finish the book - not out of excitement or anticipation, but out of sheer exhaustion from the weight of the words.And the entire section concerning the auteur and the shooting of an \"Apocalypse Now\" type film appears out of the blue and seems ridiculously far fetched - a device for obvious commentary and not for moving what had been an engrossing story forward."}, {"review_sentiment": 4.0, "review_text": "I’m tempted to give this novel 5 stars because of how it seems to bring all the major Vietnamese narratives during the war years together into one person.  The protagonist manages to embody the North Vietnam experience, the South Vietnam experience, the refugee experience, the military camp experience, and the reeducation experience.  Fitting all these different experiences into one character in a believable way is an amazing accomplishment.  As you might expect, the book is long, dense, and complex.  Viet Thang Nguyen is particularly good at exploring ideas about loyalty (to friends, family, and country).  The subject matter is often difficult and brutal, but there is plenty of humor to lighten the reading experience (a scene involving a raw squid comes to mind).Even though I respect this book and think it is a true masterpiece, I still can’t quite bring myself to give it 5 stars because the last few chapters were tedious and a bit heavy-handed, in my opinion.  I had to push myself to get to the end."}, {"review_sentiment": 5.0, "review_text": "I cannot stop thinking about this book even though its been more than two months I finished reading it. It is one of the best books I have ever read. It is not an easy-to-read one; the plot is complex and written in a complex way. The story is very real; written in a quirky funny way. I loved the details in the descriptions. And I loved the characters and reading their thoughts along with their voices."}, {"review_sentiment": 1.0, "review_text": "This book really needed an editor. It annoyingly doesn't use quotation marks, so it is sometimes confusing.  It is difficult to tell when the narrator is speaking and someone else has stopped."}]}, "authors": ["Viet Thanh Nguyen"], "isbn": "0802124941", "longitude": -118.244476, "periods": ["1900s", "Recent Releases"], "title": "The Sympathizer: A Novel", "word_cloud": "never write amazon review also never disagree amazon review strongly clearly also committee miss something biggest disappointment get little sense vietnamese experience war post war people inhabit represent smallest typical segment vietnamese experience ever inhabit recognizable part war much experience caricature department head congressman fact exception character nameless cartoon corpulent major grizzle major general commandant commissar diminish humanity much way movie diminish vietnamese participant people narrator childhood friend achieve status name story convincing plot find frequently write repetitive never humorous generally chore wont horrible condition hat so well crafted interpretation human condition personal clearly unique experience introspection view society history nation humanity matter make work tongue cheek wordplay humor well human tragedy make real unreal earn star really anyone interested suffer war excellent voice make befriend hesitate put spite harsh narrative often lay bare exile make unrecognizable even live revolution saw promise go protagonist story idea opening page fantastic page tempt put leave problem prose far far dense simple event exchange run result lest loss interest story skim last page simply want finish excitement anticipation sheer exhaustion weight entire section concern hauteur shoot now type film appear blue seem ridiculously far fetched device obvious commentary move engross story forward tempt give star seem bring major vietnamese narrative war year together person protagonist manage embody experience experience refugee experience military camp experience reeducation experience different experience character believable way amazing accomplishment long dense complex particularly good explore idea loyalty friend family country subject matter often difficult brutal plenty humor lighten read experience scene involve raw squid come respect true masterpiece still quite bring give star last chapter tedious opinion push end stop think even month finish read best ever plot complex write complex way story real write quirky funny way love detail description love character read thought voice really need editor annoyingly quotation mark sometimes confuse difficult tell narrator speak someone else stop", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "The winner of the 2016 Pulitzer Prize for Fiction, as well as five other awards, The Sympathizer is the breakthrough novel of the year. \r\n\r\nWith the pace and suspense of a thriller and prose that has been compared to Graham Greene and Saul Bellow, The Sympathizer is a sweeping epic of love and betrayal. \r\n\r\nThe narrator, a communist double agent, is a “man of two minds,” a half-French, half-Vietnamese army captain who arranges to come to America after the Fall of Saigon, and while building a new life with other Vietnamese refugees in Los Angeles is secretly reporting back to his communist superiors in Vietnam. \r\n\r\nThe Sympathizer is a blistering exploration of identity and America, a gripping espionage novel, and a powerful story of love and friendship.", "asin": "0802124941", "rank": "2449", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/518LdNuHDJL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}