{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 60, "rating": 3.9, "reviews": [{"review_sentiment": 2.0, "review_text": "If you're looking for a step-by-step itinerary (Begin at La Fenice, walk left through the Campo and you'll see xx...), this is NOT your guidebook. As another reviewer mentioned, it offers no succinct route info. You'll find yourself reading pages of commentary on the sites, as well as excerpts from the novels. We found it irritating, pretentious and unhelpful. As a literary read, this is a great volume. But if you're looking for Brunetti's Venice, you'd do just as well to blow up the end pages of the novels and wander on your own. These maps are badly reproduced and very difficult to read. I don't recommend this as anything but an arm chair read."}, {"review_sentiment": 3.0, "review_text": "This is one of the few occasions when a Kindle is not as good as a book because you can't switch back and forth between the maps and the descriptions and the maps are way too small anyway.  Nevertheless, the book is full of insights which make you wish to visit or, in my case, re-visit Venice even though many Venetian inhabitants dislike us being there.  That's the twist in this book.  Brunetti and his author obviously find the tourists annoying but this is a book which is encouraging us to walk through the city.  I got a mixed message."}, {"review_sentiment": 5.0, "review_text": "As always, the best read!"}, {"review_sentiment": 2.0, "review_text": "Interesting but only if you're a true Brunetti fan.  Maps are hard to read on cheap paper - ink too faint, and there should be a succint route at either the beginning or end  of each adventure.  It was too hard to figure out exactly where to go.  And the book is too heavy and clunky to carry around while actually strolling through Venice.  I think Brunetti would have pitched it into a canal.  If you're just looking for armchair ambience, it's fine."}, {"review_sentiment": 4.0, "review_text": "A bit broken up but interesting insights if you are going there."}, {"review_sentiment": 5.0, "review_text": "Reminds me of our stays in Venice and walking the streets, wish I had had this book and tours with me then"}, {"review_sentiment": 3.0, "review_text": "I love the Brunetti books, and this is a disappointment.  It might work as a guidebook if you were in Venice and walking the tours, but Sepeda offers little information in addition to the quotes from the novels.  Maybe it's good to have the novels' passages put together in one place, but they are very repetitive -- Brunetti is charming, but he tends to have the same thoughts over and over again about the tourists, the beauty of Venice, its fragile state, and its past glory.  (Much more interesting is how the various neighborhoods differ, but Sepeda doesn't elaborate much over Brunetti's observations that they are either familiar to him or strange.)  Having read the novels, I'd rather hear more about the various neighborhoods and campi and buildings than just Brunetti's predictable observations.  Yes, there are lots of other books on Venice, and of course it's the author's choice to neither quote them nor do more research herself, but this ends up being very thin on information.  And given the type of book this is, an index would be very helpful -- as well as one larger map that labels the neighborhoods, so the reader could refresh her sense of the overall geographic relationships."}, {"review_sentiment": 5.0, "review_text": "good read"}, {"review_sentiment": 1.0, "review_text": "Too repetitive.....Maybe it told me more than I need to know."}, {"review_sentiment": 5.0, "review_text": "very informative"}]}, "authors": ["Toni Sepeda"], "isbn": "0802144373", "longitude": 12.3345898, "periods": ["2000s", "Recent Releases"], "title": "Brunetti's Venice: Walks with the City’s Best-Loved Detective", "word_cloud": "look itinerary walk leave reviewer mention offer succinct route info find read page commentary site well excerpt find irritate pretentious unhelpful literary great volume look well end page novel wander map badly reproduce difficult recommend anything arm chair occasion good back forth map description map way small anyway full insight make wish visit case even many venetian inhabitant dislike twist author obviously find tourist annoy encourage walk city get mixed message always best interest true fan hard cheap paper ink faint succinct route begin end adventure hard figure exactly go heavy clunky carry actually stroll think canal look armchair ambiance fine bit broken interesting insight go stay walk street wish tour love disappointment guidebook walking tour offer little information addition quote novel maybe good novel passage put together place repetitive charm tends thought tourist beauty fragile state glory much interest various neighborhood differ elaborate much observation familiar strange novel rather hear various neighborhood camp building predictable observation yes lot course author choice quote research end thin information give type index well larger map label neighborhood sense overall geographic relationship good too repetitive tell need informative", "genres": ["Travel Writing", "Pop Culture"], "summary": "Follow Commissario Guido Brunetti, star of Donna Leon’s internationally best-selling mystery series, on over a dozen walks that highlight Venice’s churches, markets, bars, cafes, and palazzos\r\nIn Brunetti’s Venice, tourists and armchair travelers follow in the footsteps of Brunetti as he traverses the city he knows and loves. With his acute eye for change in his native city, his fascination with the past, his ear for language and his passion for food and drink, and his familiarity with the dark realities of crime and corruption, Brunetti is the perfect companion for any walk across La Serenissima.\r\n\r\nOver a dozen walks, encompassing all six regions of Venice as well as the lagoon, lead readers down calli, over canali, and through campi. Important locations from the best-selling novels are highlighted and major themes and characters are explored, all accompanied by poignant excerpts from the novels. This is a must-have companion book for any lover of Donna Leon’s wonderful mysteries.", "asin": "0802144373", "rank": "163205", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51OpTMslWTL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}