{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 60, "rating": 4.1, "reviews": [{"review_sentiment": 1.0, "review_text": "I found this book boring and of little use regarding history.  In fact I discarded it in a hotel room"}, {"review_sentiment": 2.0, "review_text": "My expectation was to read a book that addressed the contradictions of modern Spain. Historical references could have been more deeply analyzed and, while recognizing the importance of civil war, the writer could have deepened his analysis of the cultural diversity of the country.I found the writing fragmented looking like the author had put together a collection of previously written articles, and perhaps for that very reason, a lot of politics overlapping culture. For this reason, the book became rapidly outdated"}, {"review_sentiment": 5.0, "review_text": "Inciteful look at how Spain's past has created its present. Best book for anyone going to Spain."}, {"review_sentiment": 5.0, "review_text": "For those who are interested in the pre WW II wars between Fascism and Socialism/Communism. this book, though somewhat repetitive with other books on this subject, is a very good read. Do take the time for this book!"}, {"review_sentiment": 5.0, "review_text": "All good, thanks!"}, {"review_sentiment": 3.0, "review_text": "Too much political information"}, {"review_sentiment": 2.0, "review_text": "An interesting read if somewhat biased opinion of Spain."}, {"review_sentiment": 5.0, "review_text": "Deep analysis of the unresolved traumas of a civil war"}, {"review_sentiment": 4.0, "review_text": "History lesson"}, {"review_sentiment": 4.0, "review_text": "a real insight into the Franco days and the aftermath of \"forgetfulness2 and \"reinvention\" of a nation. Well written and harrowing in parts as the history is still recent. He's still very much revered in the older circles and still whispered about behind closed doors by those who still fear and mistrust the system. Brought to life by an excellent researcher who clearly loves his adopted country."}]}, "authors": ["Giles Tremlett"], "isbn": "0802716741", "longitude": 2.1774322, "periods": ["1900s", "Recent Releases"], "title": "Ghosts of Spain: Travels Through Spain and Its Silent Past", "word_cloud": "find bore little use regard history fact discard hotel room expectation address contradiction modern reference analyzed recognize importance civil war writer cultural diversity find write fragmented look author put together collection previously write article perhaps reason lot politics overlapping culture reason become rapidly outdated inciteful look create present anyone go interested per war somewhat repetitive subject good time good thanks too much political information interesting somewhat biased opinion deep analysis unresolved trauma civil war lesson real insight day aftermath reinvention nation write harrow part history still recent still much revere older circle still whisper closed door still fear mistrust system life excellent researcher clearly love adopted country", "genres": ["History", "Travel Writing", "Spanish Civil War"], "summary": "\"Part modern social history, part travelogue, Ghosts of Spain is held together by elegant first-person prose…an invaluable book…[that] has become something of a bible for those of us extranjeros who have chosen to live in Spain. A country finally facing its past could scarcely hope for a better, or more enamored, chronicler of its present.\"―Sarah Wildman, New York Times Book Review\r\n\r\nThe appearance, more than sixty years after the Spanish Civil War ended, of mass graves containing victims of Francisco Franco's death squads finally broke what Spaniards call \"the pact of forgetting\"―the unwritten understanding that their recent, painful past was best left unexplored.\r\n\r\nAt this charged moment, Giles Tremlett embarked on a journey around the country and through its history to discover why some of Europe's most voluble people have kept silent so long. In elegant and passionate prose, Tremlett unveils the tinderbox of disagreements that mark the country today.\r\n\r\nGhosts of Spain is a revelatory book about one of Europe's most exciting countries.", "asin": "0802716741", "rank": "83167", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51bp3W%2BhKiL.jpg", "country": "Spain", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}