{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 132, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent."}, {"review_sentiment": 5.0, "review_text": "Che did nothing wrong"}, {"review_sentiment": 5.0, "review_text": "Great, in depth, intricately researched book on Che. I thought it was pretty balanced; I saw the good and bad. Che was no saint, but he had profound compassion for the poor and underclasses and put his life on the line for his beliefs. But he also had a cruel, even brutal side. Certainly one of the last century's most fascinating characters."}, {"review_sentiment": 5.0, "review_text": "Great book I read it a couple of months ago, and really enjoyed it.  Anderson really did his research, in fact in doing so Che's body was found.This book will let you know more about the guy on all the T shirts and what he was about, very interesting book."}, {"review_sentiment": 5.0, "review_text": "a very detailed account of the famed guerilla from his childhood to his death. while following the protagonist's life, we also learn a great deal about history (the u.s.a. as well as cuba and the rest of latin america). quite surprising and informative."}, {"review_sentiment": 5.0, "review_text": "clear and through"}, {"review_sentiment": 2.0, "review_text": "Big book. Small print. Can't do."}, {"review_sentiment": 5.0, "review_text": "nice paper back edition, arrived on time. It is very engaging, can't stop reading it."}, {"review_sentiment": 1.0, "review_text": "No thanks. I'll not support the myth that this child rapist/murderer was some kind of a hero. Having been assassinated was exactly what he deserved."}, {"review_sentiment": 5.0, "review_text": "Next year is the 50th anniversary of Che's death. So it came in perfect time to think about ideals: they seem forgotten, up to a point they were mishandled; can they be picked up again?"}]}, "authors": ["Jon Lee Anderson"], "isbn": "080214411X", "longitude": -82.3658671, "periods": ["1900s", "Recent Releases"], "title": "Che Guevara: A Revolutionary Life", "word_cloud": "excellent nothing wrong depth intricately research think pretty balance saw good bad saint profound compassion poor underclass put line belief also cruel even brutal side last century fascinate character couple month ago really enjoy really research fact body let guy shirt interest detailed account famed guerrilla childhood death follow protagonist also learn great deal history well cuba latin quite surprising informative clear print nice paper back edition arrive time engage reading thanks support myth child kind hero assassinate exactly deserve next year anniversary death come perfect time think ideal seem forgotten point mishandle pick", "genres": ["Biography", "History", "Politics"], "summary": "Acclaimed around the world and a national best-seller, this is the definitive work on Che Guevara, the dashing rebel whose epic dream was to end poverty and injustice in Latin America and the developing world through armed revolution. Jon Lee Anderson’s biography traces Che’s extraordinary life, from his comfortable Argentine upbringing to the battlefields of the Cuban revolution, from the halls of power in Castro’s government to his failed campaign in the Congo and assassination in the Bolivian jungle.\r\n\r\nAnderson has had unprecedented access to the personal archives maintained by Guevara’s widow and carefully guarded Cuban government documents. He has conducted extensive interviews with Che’s comrades—some of whom speak here for the first time—and with the CIA men and Bolivian officers who hunted him down. Anderson broke the story of where Guevara’s body was buried, which led to the exhumation and state burial of the bones. Many of the details of Che’s life have long been cloaked in secrecy and intrigue. Meticulously researched and full of exclusive information, Che Guevara illuminates as never before this mythic figure who embodied the high-water mark of revolutionary communism as a force in history.\r\n\r\n“Superb . . . Mr. Anderson does a masterly job in evoking Che’s complex character, in separating the man from the myth . . .” The New York Times Book Review", "asin": "080214411X", "rank": "46106", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/514vLNBI2cL.jpg", "country": "Cuba", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}