{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 21.161829, "ratings": {"num_ratings": 20, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "Fascinating subject matter but the book attempts to cover too broad a scope, both in terms of time and diverse cultures. Would have appreciated a greater focus on intersections of the various European efforts to explore the region or some kind of narrative thru-line. If you thought Anderson's \"Lawrence in Arabia\" was well-done for that region, don't get your hopes up about this book -- it's more of a reference piece."}, {"review_sentiment": 4.0, "review_text": "I have mixed feelings about the book.  I bought this book to read about Caribbean history before visiting some of the islands.  I was hoping for a sense of what brought the islands to where they are today and what underlies their culture.  Unfortunately, the book was not well-suited for that purpose.The Good:  On the one hand, I absolutely commend the author for her knowledge of the topic and her research.  The book is amazingly well researched and the author's knowledge of the topic is impressive.  If you are looking for a vast collection of facts about the different islands, then this book will serve you well.The Bad:  On the other hand, the book lacks a usable narrative format to make the information presented useful.  It comes across a bit like someone listing everything they know rather than someone telling the story of the islands -- it is very linear.  For example, the book outlines the names of leaders and how the demographics of the islands changed (skipping from island to island), but it presents little in the way of what life was like, how the islands functioned politically or culturally, or any of the usual colorful events that make history so interesting.  There are also fascinating tantalizing moments, but the book doesn't exploit them.  For example, it mentions the Founding Fathers of America visiting the islands and getting their gunpowder through the islands, but the book doesn't address this on a personal level nor does it explain how this might have affected the history of the two regions.  This is too bad because I suspect this author has the knowledge to tell a much deeper, richer story than that normally presented in history courses.Again this is not a bad book. It is very informative and quite an impressive feat.  But it is a difficult read which may not provide what you are looking for if you are hoping for insight rather than facts."}, {"review_sentiment": 5.0, "review_text": "Great book by a great author."}, {"review_sentiment": 4.0, "review_text": "This book provides a brief history of most of the area in the Carib.  Which is what I was looking for.  Towards the end, history gives way to facts and figures and some opinion - not as interesting, but still worth the read.  Overall, I learned a few things about the area I hadn't known before."}, {"review_sentiment": 1.0, "review_text": "Dull,Dull,Dull"}, {"review_sentiment": 5.0, "review_text": "WITHOUT LEAVING THE CARIBBEAN, timely references are made to key TREATIES and interesting historic PERSONS with a swift aplomb that focus our attention on EMPIRE'S CROSSROADS, those fabulous destination islands with warp & woof ties to the ferment of five hundred years of  European History ( 14th through 19th century) without dropping a beat. One of those books you are at angst to put down."}, {"review_sentiment": 3.0, "review_text": "As other reviewers have indicated, Empire's Crossroads cover a huge, complex swath of history and geography. Unfortunately, it is generally poorly written and edited. I spotted a number of obvious errors. In fairness, there's a huge amount of material to cover; each chapter should be it's own book. The writing seems to be at a secondary school level with mostly material taken from numerous sources. Extensive research perhaps, but is this enough?It is an easy read, but I feel that there is much more to the stories of each island."}, {"review_sentiment": 5.0, "review_text": "Brilliant! Wonderful read!"}, {"review_sentiment": 3.0, "review_text": "Three and a half.  I gave up.  The material is really interesting and there is a lot to learn. For me however the scope was so broad (so many islands and European countries involved) and the time so vast (1492 to present) that I couldn't connect with anything with any depth - just lots and lots of facts about so many things which together give a broad brush of this fascinating area but provide no deep feeling for any particular time or place, leaving it a bit flat for me.  Try sugar in the blood I- that book focuses on the British colonization of Barbados and for me was more relatable."}, {"review_sentiment": 5.0, "review_text": "Such an amazing, entertaining and in depth read on everything that has happened in this important part of our history's world.  Gibson does such an amazing job in this book... I could read it again- and I did not want it to end. I hope she writes more books like this."}]}, "authors": ["Carrie Gibson"], "isbn": "0802126146", "longitude": -86.82505, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases", "1500s", "500-1400s"], "title": "Empire's Crossroads: A History of the Caribbean from Columbus to the Present Day", "word_cloud": "fascinate subject matter attempt cover broad scope term time diverse culture greater focus intersection various european effort explore region kind narrative think region get hop reference piece mix feeling buy visit island hop sense bring island today underlies culture unfortunately hand absolutely commend author knowledge topic research amazingly well researched author knowledge topic impressive look vast collection fact different island serve hand lack usable narrative format make information present useful come bit someone list everything know rather someone tell story island linear example outline name leader demographic island change skip island island present little way life island function politically culturally usual colorful event make interesting also fascinate tantalize moment exploit example mention found father visit island get gunpowder island address personal level explain region bad suspect author knowledge tell much richer story normally present bad informative quite impressive feat difficult look hop insight rather fact great author provide brief area look towards end give way fact figure opinion interest still overall learn thing area know leave timely reference make key interest historic swift aplomb focus attention fabulous destination island warp woof tie ferment year european century drop beat angst put reviewer indicate cover huge complex swath geography generally poorly write edit spot number obvious error fairness huge amount material cover chapter writing seem secondary school level mostly material take numerous source extensive research perhaps easy feel much story island half give material really interesting lot learn however scope broad many island european country involve time vast anything depth lot lot fact many thing together give broad brush fascinate area provide deep feeling particular time place leave bit flat sugar blood focus british colonization repeatable such amazing entertain depth everything happen important part world amaze job want end hope writes", "genres": ["History"], "summary": "Ever since Christopher Columbus stepped off the Santa Maria onto what is today San Salvador, in the Bahamas, and announced that he had arrived in the Orient, the Caribbean has been a stage for projected fantasies and competition between world powers. In Empire’s Crossroads, British American historian Carrie Gibson traces the story of this coveted area from the northern rim of South America up to Cuba, and from discovery through colonialism to today, offering a vivid, panoramic view of this complex region and its rich, important history.\r\n\r\nAfter that fateful landing in 1492, the British, French, Spanish, Portuguese, Dutch, Danish, and even the Swedes, Scots, and Germans sought their fortunes in the islands for the next two centuries. Some failed spectacularly: a poorly executed settlement in Panama led the Scots to lose their own independence to England. The Spaniards were the first to find prosperity, in Mexico but also along the islands. In Hispaniola, Cuba, and Puerto Rico, they built grandiose cathedrals and extracted shipfuls of gold and silver, which English, French, and Dutch pirates were happy to seize. But precious metals weren’t a sustainable export—the colonizers needed something that was, and they would need hordes of slaves to cultivate it.\r\n\r\nThe Caribbean’s first cash crop, one indigenous to the New World, was tobacco, and it, along with sugar, spurred expensive new addictions back in Europe. Gibson argues that immaterial exports were just as important. No other region of the world has experienced such a vibrant mixing of cultures, religions, and peoples—Africans, Europeans, Asians, and Amerindians created amazingly dynamic Creole societies that complicated traditional ideas about class and race. By the end of the eighteenth century, seventy thousand free blacks and mulattos lived in the British islands alone, and it was in the Caribbean that the world’s only successful slave revolt took place—sparking the meteoric rise of Napoleon’s black counterpart, Toussaint L’Ouverture, and the Haitian Revolution.\r\n\r\nThe Caribbean island of St. Eustatius had been the first to recognize the United States as a nation, but the Americans were soon vying for their own imperial stronghold in the West Indies, attempting to control Cuba and backing influential corporations, most notably United Fruit. In the twentieth century, most of the islands broke from the imperial traditions that had lorded over them for four centuries: this would be the explosive age of decolonization and “banana republics,” of racial riots and négritude, of Cold War politics and tourist crowds.\r\n\r\nAt every step of her expansive story, Gibson wields fascinating detail to combat the myths that have romanticized this region as one of uniform white sand beaches where the palm trees always sway. Evocatively written and featuring a whole cast of cosmopolitan characters, Empire’s Crossroads reinterprets five centuries of history that have been underappreciated for far too long.", "asin": "0802126146", "rank": "748416", "city": "Cancun", "image": "https://images-na.ssl-images-amazon.com/images/I/61sdXCVbHZL.jpg", "country": "Mexico", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}