{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 175, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "An enjoyable mystery with a very human and Italian outlook detective.  Not  Macho , but reasonable aspect.."}, {"review_sentiment": 5.0, "review_text": "one of my favorite authors"}, {"review_sentiment": 5.0, "review_text": "Dressed for Death is the third novel in Donna Leon’s long-running mystery series set in Venice, featuring Commissario Guido Brunetti.  On a hot August day, the body of a transvestite prostitute is found behind a slaughterhouse in a district outside of Venice, and Brunetti is assigned the case because all the police officers in the area have gone on vacation.  Brunetti accepts the case, even though he longs to join his wife Paola and teenage children Raffi and Chiara on their vacation in the mountains.  The victim’s face is damaged beyond recognition, so Brunetti asks the prostitutes in the area who it could be.  Soon he learns that the victim was not a prostitute, but one of Venice’s most prominent bankers.  As he investigates, Brunetti uncovers a scam involving illegally rented apartments and a charitable organization that was supposedly helping widows and orphans.  The dead man and his successor at the bank, as well as one of Venice’s most powerful lawyers, were involved.  But who was the actual murderer?  When Brunetti goes to meet with one of the transvestites, who has information to give him, someone tries to kill Brunetti, and a young police officer who was with him is killed.  Then Brunetti’s contact is found murdered.  Brunetti realizes he must find the murderer soon, or he will be the next victim.As always, Leon paints a vivid picture of life in Venice and makes the reader want to go there, in spite of all the crime that goes on.  Brunetti is a wonderful character, a decent man among all the corrupt officials, including his own boss, even though this particular book makes you feel sympathy even for Brunetti’s boss, Patta, because his wife has run off with a famous film director and he’s trying to get her to come back to him.  A delightful new character is introduced in this book: Signorina Elettra, the secretary to the police, who is a computer expert.  Since Brunetti’s wife Paola and the children are on vacation for much of the book, you don’t see as much of the interaction between Brunetti and Paola as you usually do, or as many of the mouth-watering meals that Paola cooks.  But in an early scene, she makes one of my favorite dishes, spaghetti with tuna and tomato sauce.  There is also a great scene in which Brunetti cooks pasta for himself and then sits down to read Tacitus’ Annals of Imperial Rome, making the comparison between the corruption in ancient Rome and in his own time.  Not to give away too much about the ending, but in this novel justice is served in a satisfying way.  This is not always the case with Leon’s books.  Sometimes the murderer will get off because of influential political connections.Since this book was written in the 1990s, readers should be aware that it contains some dated attitudes toward gay men and transgender people.  But Brunetti and Paola do not share those attitudes.  Also, several of Leon’s books have different titles in the British and American editions.  This novel is called The Anonymous Venetian in the British edition."}, {"review_sentiment": 5.0, "review_text": "Edge of your seat with humor."}, {"review_sentiment": 4.0, "review_text": "Donna Leon is dependably entertaining!"}, {"review_sentiment": 4.0, "review_text": "This is one of her earlier books.  And I wasn't able to find a hard-copy and have read most of her books.  I totally enjoy her political comments as well as becoming acquainted with the main characters and watching them \"age\" as she writes subsequent books."}, {"review_sentiment": 5.0, "review_text": "I like Leon's writing."}, {"review_sentiment": 4.0, "review_text": "I truly enjoy this series. I'm writing this review primarily to point out that some of her early books were published with different titles. If you are reading them in order as I am doing, you should visit fantasticfiction.com to match the titles, or else you may find yourself reading a story twice. It's too bad neither Amazon descriptions or Goodreads make note of the different titles, although Goodreads does copy my rating of this book to both titles. This book was also published as The Anonymous Venetian."}, {"review_sentiment": 5.0, "review_text": "To be brief: I love Commissario Brunetti and his colleagues. I also love the fact that I haven't found any of the many Brunetti mysteries I've read to be uncomfortably predictable or formulaic."}, {"review_sentiment": 5.0, "review_text": "This book is a well woven mystery."}]}, "authors": ["Donna Leon"], "isbn": "080214604X", "longitude": 12.3345898, "periods": ["1900s"], "title": "Dressed for Death: A Commissario Guido Brunetti Mystery", "word_cloud": "enjoyable human italian outlook detective not reasonable favorite author third series set feature hot day body transvestite prostitute find slaughterhouse district assign case police officer area go vacation accept case even longs join wife teenage child vacation mountains victim face damage recognition ask prostitute area learns prostitute prominent banker investigates uncovers scam involve illegally rent apartment charitable organization supposedly help widow orphan dead man successor bank well powerful lawyer involve actual murderer go transvestites information someone try kill young police officer kill then contact find murder realize murderer soon next always paint vivid picture life make want spite crime go wonderful character decent man corrupt official include bos even particular make feel sympathy even wife run famous film director try come delightful new character introduce secretary police computer expert wife child vacation much much interaction usually many meal cook early scene make favorite dish spaghetti tuna tomato sauce also great scene cook pasta sits make comparison corruption ancient time not away much end justice serve satisfying way always case influential political write reader aware contains date attitude gay men transgender people share attitude also several different title british american edition call edition seat humor dependably entertain earlier able find totally political comment well become acquaint main character watch age write subsequent like write truly enjoy series write primarily early publish different title reading order visit match title else read story twice bad description make note different title copy rating title also publish love colleague also love fact find many mystery uncomfortably predictable formulaic well woven", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 3/24 in the Commissario Brunetti Series\r\n\r\nVenetian Commissario Guido Brunetti’s hopes of escaping the sweltering heat of Venice in August for a refreshing family holiday in the mountains are dashed when a gruesome discovery is made in a field in Marghera—a body so badly beaten the face is completely unrecognizable. \r\n\r\nThe victim appears to be a transsexual prostitute. Brunetti searches Venice--including the red-light district--for someone who can identify the corpse, but he is met with a wall of silence. Then he receives a phone call promising tantalizing information, provided he meets with the caller under a bridge outside of town in the middle of the night.\r\n\r\nThis dangerous rendezvous leads to more senseless murders, but despite the danger, Brunetti remains determined to uncover the truth. Dressed for Death, the third novel in this international best-selling series is classic Brunetti.\r\n\r\n“[One of] the real charms of this series [is] the endearing character of Brunetti and his compassionate insights into the heart of Venice and the soul of its people. Here is a man so decent that he reads the Annals for bracing blasts of Tacitus’ ‘fierce, uncompromising morality,’ but so un-sanctimonious that he is perpetually on the lookout for ‘the ugliest Christ Child in Western art.’ Truly, a refreshing hero.” The New York Times ", "asin": "080214604X", "rank": "55382", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/511kFp-4kOL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}