{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 52.2319237, "ratings": {"num_ratings": 20, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "It is a powerful book, with some chapters that are absolutely lovely.  I would like to read more of his work."}, {"review_sentiment": 5.0, "review_text": "Excellent book, touching, human - a complex history of Warzaw, Poland (and Europe) in the horrendous treadmill of the last great war. In view of perpetrators, victims and bystanders It is right up there on the same shelf with Primo Levi and Jerzy Andrzejewski, Jotrge Semprun, Victor Frankl, Edgar Hilsenrath and a smal handful of others - a collage of fates during the occupation, unfolding the emotional destruction and the traumas, the cultural devastation in a very laconic, yet deeply compassionate way - one of the few books granting the chance to retrace the Zeitgeist of the time, its quirks and insanities - delving deep into tragic territory, still full of humour, stoic ease and great wisdom. Pretty wonderful - a real discovery.  If I could, I'd give it five times five stars."}, {"review_sentiment": 1.0, "review_text": "I got this book because of a good newspaper review. I did not like it at all."}, {"review_sentiment": 5.0, "review_text": "An amazing book - a true work of art - at once both poetic and realistic. Highly recommend it."}, {"review_sentiment": 4.0, "review_text": "nice read  into  what was going on  during the Hitler era"}, {"review_sentiment": 5.0, "review_text": "This is my all time favorite book. Not a good read for light entertainment. Definitely made me think. The names are hard to read, so I advise writing the character's names with a quick note as to who is who, and use the note as your bookmark. Seriously, though, best book I have ever read."}, {"review_sentiment": 5.0, "review_text": "A challenging literary read, with significant historical themes."}, {"review_sentiment": 5.0, "review_text": "Andrzej Szczypiorski adopts some interesting techniques in his moving novel covering three days during the Nazi occupation of Warsaw in WWII.  Anyone who knows their history will be aware of how brutal a time this was, but Szczypiorski who lived through it and would have witnessed atrocities and suffering of the grossest kind on a daily basis, lifts his gaze from the horror to write about the actions and inner lives of a diverse group of individuals over this short time.  He helps his reader hugely by revealing as he introduces his different characters, what became of them later.  This unusual approach achieves two things - it \"saves\" the reader from investing too much emotionally in each character and it shows how closely interlinked past and future really are.  Nor does Szczypiorski shy away from controversy or morally complex issues in presenting his full canvass of experience.  He has a Pole of German origin play the race card in intervening with the Gestapo with great courage to save a Jewish life, as well as a nun rescuing a Jewish boy and raising him Catholic with interesting consequences.  In this way he conveys a powerful message about the difference each individual can make by the choices they make in a moment."}, {"review_sentiment": 3.0, "review_text": "I was expecting so much more from this book. I found it hard to follow at times and the story line jumped around too much. I don't know if the translation from Polish to English was part of the problem or not. The story line itself could have been presented in a much easier way to follow."}, {"review_sentiment": 3.0, "review_text": "Meh. This book presents many very intriguing characters, but the author seems so wrapped up in his own ideas about Poles and the future of Poland that he seems to forget he is supposed to be telling a story here. There is no story. There is no suspense.You already know from the beginning that Mrs. Seidenman will be rescued, because it says so on the dust jacket. (And, contrary to what the dust jacket says, the rescue was not \"dramatic.\" It wasn't like they stormed the jail Bastille-style or anything like that. Her friends simply got a German man to go to the jail and say he knows her and she's not a Jew.) You already know she will survive the war and live to an old age. In fact, you already know the fate of every single character in the story before long, because whenever one is introduced the author immediately tells you what their life will be like later and how and when they will die. Sometimes this kind of thing can work -- Frederick Forsyth pulled it off beautifully in The Day of the Jackal, a stunning thriller about an assassination attempt that, from the first page, the reader knows was a failure. But Andrze Szczypiorski doesn't make it work here.Most of the book consists of various people from all walks of life, all connected in some way with Mrs. Seidenman, giving speeches. These are either internal or external monologues and they go on for pages. And much of this is interesting, even profound (especially the speech about how, no, you don't really want peace right now, the price of peace would be too high), but the fact is that while the characters are standing around philosophizing, nothing is happening and there is no plot to speak of.This book is good, perhaps, if you want to want know the history and social climate of Warsaw in 1943, but it is a piss-poor excuse for a novel."}]}, "authors": ["Andrzej Szczypiorski"], "isbn": "0802135021", "longitude": 21.0067265, "periods": ["1900s"], "title": "The Beautiful Mrs. Seidenman: A Novel", "word_cloud": "powerful chapter absolutely lovely work excellent touch human complex history horrendous treadmill last great war view perpetrator victim bystander right slam handful others collage fat occupation unfold emotional destruction cultural devastation laconic yet deeply compassionate way granting chance retrace time quirk inanity delve deep tragic territory still full humor stoic ease great wisdom wonderful real discovery time star get good newspaper review like amazing true work art poetic realistic recommend nice go era time favorite not good light entertainment definitely make think name hard advise write character name quick note use note bookmark best ever challenging literary significant historical theme adopt interest technique move cover day occupation know history aware brutal time live witnessed atrocity suffer grossest kind daily basis lift gaze horror write action inner life diverse group individual short time help hugely revealing introduces different character become later unusual approach achieve thing save invest much emotionally character show closely interlinked future really controversy morally complex issue present full canvas experience pole german origin play race card intervene great courage jewish life well nun rescue jewish boy raise interesting consequence way conveys powerful message difference individual make choice make moment expect much find hard follow time story line jump much know translation polish part problem story line much easier way present many intrigue character author seem wrapped idea future seem suppose tell story story already begin rescue say dust jacket contrary dust jacket say rescue dramatic storm jail anything friend simply get german man jail say know already know survive war live old age fact already fate single character story long one introduce author immediately tell life later die kind thing work pull beautifully stun thriller assassination attempt first page know failure make work consist various people walk life connect way give speech internal external monologue go page much interesting even profound especially speech really want peace right price peace fact character stand philosophize nothing happen plot speak good perhaps want want know history social climate excuse", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "WWII"], "summary": "In the Nazi-occupied Warsaw of 1943, Irma Seidenman, a young Jewish widow, possesses two attributes that can spell the difference between life and death: she has blue eyes and blond hair. With these, and a set of false papers, she has slipped out of the ghetto, passing as the wife of a Polish officer, until one day an informer spots her on the street and drags her off to the Gestapo. \r\n\r\nAt times a dark lament, at others a sly and sardonic thriller, The Beautiful Mrs. Seidenman is the story of the thirty-six hours that follow Irma's arrest and the events that lead to her dramatic rescue as the last of Warsaw's Jews are about to meet their deaths in the burning ghetto.", "asin": "0802135021", "rank": "1138740", "city": "Warsaw", "image": "https://images-na.ssl-images-amazon.com/images/I/51qlJii0ziL.jpg", "country": "Poland", "story_arc": ["Tragedy", "Things only get worse"]}