{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 259, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "ok"}, {"review_sentiment": 4.0, "review_text": "Very pleased."}, {"review_sentiment": 2.0, "review_text": "Overwrought and obtuse."}, {"review_sentiment": 5.0, "review_text": "Great read.  The author will take you on an extraordinary journey."}, {"review_sentiment": 5.0, "review_text": "Good read"}, {"review_sentiment": 5.0, "review_text": "Living life fully isn't about the comfort of routines, it's about exploring beyond your self-imposed boundaries of daily living, about letting go of presumptions, and learning to be curious in all encounters with others, and with yourself. It's about taking action even when the little voice in your head is urging you to stay complacent.  This book can take you on the journey that you envision, but have never allowed yourself to take."}, {"review_sentiment": 1.0, "review_text": "One of the most boring and absurd books I have ever read, terribly translated and with lots of mistakes. I really had to force myself to continue reading till the end...And I only did because I simply don't leave books unfinished. The pseudo-philosophical attempts and never-ending repetitions were unbearably pathetic."}, {"review_sentiment": 4.0, "review_text": "Brilliant prose."}, {"review_sentiment": 3.0, "review_text": "Interesting topic,  but a little tedious."}, {"review_sentiment": 3.0, "review_text": "This is an anathama, but I prefered the movie."}]}, "authors": ["Pascal Mercier"], "isbn": "0802143970", "longitude": -9.1365061, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Night Train to Lisbon: A Novel", "word_cloud": "ok very pleased obtuse author extraordinary journey good live life fully comfort routine explore boundary daily live let go presumption learn curious encounter others take action even little voice head urge stay complacent take journey envision never allow boring absurd ever terribly translate lot mistake really force continue reading till end simply unfinished attempt repetition unbearably pathetic prose interest topic little tedious anathema prefer movie", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Raimund Gregorius teaches classical languages at a Swiss lycée, and lives a life governed by routine. One day, a chance encounter with a Portuguese woman inspires him to question his life—and leads him to an extraordinary book that will open the possibility of changing it. \r\n\r\nInspired by the words of Amadeu de Prado, a doctor whose intelligence and magnetism left a mark on everyone who met him and whose principles led him into a confrontation with Salazar’s dictatorship, Gergorius boards a train to Lisbon. As Gregorius becomes fascinated with unlocking the mystery of who Prado was, an extraordinary tale unfolds. ", "asin": "0802143970", "rank": "65298", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/51kqe60luwL.jpg", "country": "Portugal", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}