{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 58, "rating": 3.2, "reviews": [{"review_sentiment": 1.0, "review_text": "I found Flanagan's story to be so depressing that I had difficulty even finishing the book.  It certainly doesn't make me want to visit Sydney."}, {"review_sentiment": 3.0, "review_text": "not as brilliant as his other book"}, {"review_sentiment": 2.0, "review_text": "Boring repetitive banal obvious. You can only stretch existential angst so far. Would have been good to have a story line"}, {"review_sentiment": 2.0, "review_text": "Reads like a dime store detective novel. Author is wallowing in existential angst. His other books are brilliant but don't recommend this one."}, {"review_sentiment": 2.0, "review_text": "Clever tale, but as a book the first two thirds are soooooo sloooow. I almost junked it several times. When the pace finally picked up in last quarter, quite enjoyed it"}, {"review_sentiment": 4.0, "review_text": "Great read! Excellent writing style. Very enjoyable!"}, {"review_sentiment": 1.0, "review_text": "Terrible. Got steadily worse all the way through"}, {"review_sentiment": 3.0, "review_text": "Interesting story but annoying always calling her \"the Doll\"."}, {"review_sentiment": 5.0, "review_text": "I first read Flanagan's - The Narrow Road to the Deep North - before he won the 2014 Man Booker Prize and was mesmerized by his writing. I didn't think I would be able to read a book on such a sorrowful subject, but I was pulled in and devoured the book. I can say the same about this book - The Unknown Terrorist. I did pick up this novel months ago and was put off by the explicit pole dancer's life, but I came back to it a couple of days ago and started again (from the beginning). I read it in two days. I know if you are attracted to his more fantastic and literary genre style, this book is not that. This is reality for many human beings on this planet (as off-putting as that can be in its grossness), but I truly came to care for the Doll. She became more real for me as this story unfolded and she transitioned from the Doll to Gina. Obviously, this book speaks volumes to the media-driven terrorist mentality with its pigeon-hole judgements set amidst real and imagined concerns. I think this would make a wonderful film and González Iñárritu immediately comes to mind as a worthy director."}, {"review_sentiment": 5.0, "review_text": "Brutal but all too believable and could easily happen in today's world and with today's media.  Should be required reading for anyone in the \"news\" business."}]}, "authors": ["Richard Flanagan"], "isbn": "0802118518", "longitude": 151.2164539, "periods": ["2000s", "Recent Releases"], "title": "The Unknown Terrorist: A Novel", "word_cloud": "find story depress difficulty even finish certainly make want visit brilliant repetitive banal obvious stretch existential angst far good story line read dime store detective wallow existential angst brilliant recommend tale first third soooooo sloooow almost junk several time pace finally pick last quarter quite enjoy excellent write style very enjoyable terrible steadily worse way interest story annoy always call first flanagan mesmerize write think able sorrowful subject pull devoured say pick month ago put explicit pole dancer life come back couple day ago start begin day know attract fantastic literary genre style reality many human being planet grossness truly come care become real story unfold transitioned speak volume terrorist mentality judgment set real imagined concern think wonderful film immediately come worthy director believable easily today world today medium read anyone news business", "genres": ["Fiction & Literature"], "summary": "From the internationally acclaimed author of Gould’s Book of Fish comes an astonishing new novel, a riveting portrayal of a society driven by fear. What would you do if you turned on the television and saw you were the most wanted terrorist in the country? Gina Davies is about to find out when, after a night spent with an attractive stranger, she becomes a prime suspect in the investigation of an attempted terrorist attack. \r\n\r\nIn The Unknown Terrorist , one of the most brilliant writers working in the English language today turns his attention to the most timely of subjects — what our leaders tell us about the threats against us, and how we cope with living in fear. Chilling, impossible to put down, and all too familiar, The Unknown Terrorist is a relentless tour de force that paints a devastating picture of a contemporary society gone haywire, where the ceaseless drumbeat of terror alert levels, newsbreaks, and fear of the unknown pushes a nation ever closer to the breaking point.", "asin": "0802118518", "rank": "1941727", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51ES0LJ1SgL.jpg", "country": "Australia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}