{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 9, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "This I gave as a gift to someone that wanted to learn about the sport. It is outstanding."}, {"review_sentiment": 5.0, "review_text": "It started slow and I almost put it down. I'm glad I didn't.The author provides a vivid and accurate portrayal of a young man's journey training to be a world-class rower while dealing with life's struggles at the beginning of WWII. I don't know if a non-rower would fully appreciate the frustrations, joy, satisfaction, and pain that are described perfectly throughout the story, but for me it brought back many memories. I miss being on the water."}, {"review_sentiment": 5.0, "review_text": "Upon opening 'On The Water', I found myself, within the span of four pages, already regretting that I only had 130 left to read.A magical tale of youth recalled and revisited, H.M. Van Den Brink's story of a young man captivated by the thought of joining a Dutch rowing team is at once compelling and unforgettable.Anton, the narrator, a slight, awkward boy in WW2 era Holland, enlists in training to compete with a local team. He meets and befriends David, who is friendly, self-confident, outgoing...seemingly all things that Anton is not capable of being.But on the water, these two are equal...finding themselves acting, thinking, and reacting as one person, when it comes to the sport they both love.Under the guidance of a slight eccentric coach, who dreams of sending them to into competition beyond their local endeavors, the boys develop a winning synchonicity in their sport, and in their friendship as well.Books such as this are rare and wondrous to find, though, typically, all too short. The tale weaves back and forth between the training and a re-visit by Anton several years later to the boathouse and river, long since abandoned, although most of the 'action' takes place in the past, in Anton's recollections.A gem of a book, thoroughly enjoyable from start to finish."}, {"review_sentiment": 5.0, "review_text": "Anton lives in a new neighbourhood near the Amstel river in Amsterdam in the 1930's. From his early childhood onwards, the river attracts him and when he is about 14 years' old he becomes a member of the rowing club on the other side of the Amstel. Anton is an outsider: the other member are from higher social classes, his father works in the public transport branch. He is also an outsider in other aspects: he observes the others and doubts himself.But then one day the eccentric Dr. Schneiderhahn chooses Anton and David for the coxless two. In Anton's view David is his very antipole: he is self-confident and outgoing. Slowly but surely the two boys become a perfect team. In the summer of 1939 they start competition rowing and they win one race after another. It becomes more and more apparent that they have a chance to participate in the 1940 Olympics in Finland. At the end of the year they promise each other to go on as a team in the next year.The book is written as a oppressive retrospective of Anton who finds himself on the pier of the derelict rowing club in 1944. the reader knows what has happened between 1939 and 1944 and the typically Jewish name David strongly suggests that history has not been kind to him. A beautiful book in sensitive prose."}, {"review_sentiment": 5.0, "review_text": "Anton lives in a new neighbourhood near the Amstel river in Amsterdam in the 1930's. From his early childhood onwards, the river attracts him and when he is about 14 years' old he becomes a member of the rowing club on the other side of the Amstel. Anton is an outsider: the other member are from higher social classes, his father works in the public transport branch. He is also an outsider in other aspects: he observes the others and doubts himself.But then one day the eccentric Dr. Schneiderhahn chooses anton and David for the coxless two. In Anton's view David is his very antipole: he is self-confident and outgoing. Slowly but surely the two boys become a perfect team. In the summer of 1939 they start competition rowing and they win one race after another. It becomes more and more apparent that they have a chance to participate in the 1940 Olympics in Finland. At the end of the year they promise each other to go on as a team in the next year.The book is written as a oppressive retrospective of Anton who finds himself on the pier of the derelict rowing club in 1944. the reader knows what has happened between 1939 and 1944 and the typically Jewish name David strongly suggests that history has not been kind to him. A beautiful book in sensitive prose."}, {"review_sentiment": 5.0, "review_text": "When an author can create a completely absorbing novel, peopled with finely tuned characters that stir us with tension and competition and longing, a novel that uses as its base a sport that few readers know enough about to connect, then that author has displayed credentials of an impressive talent.  ON THE WATER spends alomst every page in the preparation, practice and execution of a two man crew boat.  He gradually pulls us into that boat with an understanding of the rules of the game and the rigors of the men who row. Then, subtly and with great tenderness he unveils his two young men of polar diferences and weaves a story of the power of sporting competion and the greater power of finding a soulmate.  This bonding between lower class gentile Anton and upper class Jew David is engineered by a German Doctor in 1939.  This beautiful story of an exploration of place and love is set in the last summer before Hitler destroys Europe.  We are left to guess the fate of David while we discover the solitary wandering Anton who tells the story five years later along the banks of the river where they spent the most beautiful time of their lives.  This novel gleams with magical poetry and introduces an author  (and translator) who seems destined to find an important role in the 21st Century of literature.  Read this book!"}, {"review_sentiment": 5.0, "review_text": "This is a debut novel and a very fine one at that.  Hans Maarten van den Brink has written a lyric story of athleticism and the body, of a love of water and rowing, of how a young man grows to be a friend, a teammate, a champion.  The author is observant of nature, the body and humanity, he knows the challenge and joy of sports and can communicate that experience as far as it can be done even to the couch potato.  He has a sure choice for words and felicitous phrasing (the translator, Paul Vincent, deserves much credit and praise as well).  I look forward to reading more of him"}, {"review_sentiment": 5.0, "review_text": "This was a different type of story that really kept my attention from page one.  It takes place in Amsterdam, Holland in 1939 when two young oarsmen train under the guidance of an eccentric German coach in hopes of someday winning the Olympics.  Anton, who narrates the story, is from a working class family.  David, the other oarsmen in this two man boat with Anton, is an affluent & self-assured athletic young man.  The story in beautifully worded images describes the two young men as they become bonded together closer and closer through grueling practice sessions and training to later go on to winning many local races.  Anton's description of his obsessive desire to please and do everything perfect  for David is almost like a love story and indeed very homoerotic at times.  This story is told five years later by Anton as he revisits the now abandoned boathouse.  You can tell he is deeply emotional in his remembrances of a time that he describes as \"the best summer of his life.\"  You get the feeling this is the most important year of his whole life, too.  With World War II now exploding all around him as he remembers, you can feel his tragic lost of youth and happier times.I felt this was a sensitive and well-written work of literature.  There is so much feeling in Brink's writing about this friendship and the time they shared together.  I sincerely hope to read more from this Dutch writer in the near future.  Highly Recommended!"}, {"review_sentiment": 3.0, "review_text": "In 1939 in Amsterdam, two young men (Anton and David) train as rowers, led by a mysterious doctor, who dangles the possibility of the Olympics before them. Blending into the time five years later, Anton sees his city barren and reminisces about the golden time during his obsession with rowing, with the physicality of action, with his odd relationship with David and the doctor. For Anton, his entire world revolved around the water and what he was doing with David because of his lackluster family and world. This was his one time to dazzle, and it didn't last. This novella is an eloquent trip down one man's memory lane."}]}, "authors": ["H. M. van den Brink"], "isbn": "0802138950", "longitude": 4.8936041, "periods": ["1900s"], "title": "On the Water", "word_cloud": "give gift someone want learn sport outstanding start slow almost put glad author provide vivid accurate portrayal young man journey train rower deal life struggle begin know fully frustration joy satisfaction pain describe perfectly story bring back many memory miss open find span page already regret leave magical tale youth recall revisit story young man captivate thought join row team compel narrator slight awkward boy era enlist train local team meet befriend friendly outgo seemingly thing capable equal find act think react person come sport guidance slight eccentric coach dream send competition local endeavor boys win synchronicity sport friendship rare wondrous find typically tale weave back forth train several year later river long abandon take place gem thoroughly enjoyable start live new neighborhood river early childhood inwards river attract year old become member row club side outsider member higher social class father work public transport branch also outsider aspect observe others doubt day eccentric choose cox less view anti pole outgo surely boy become perfect team summer start competition row race become apparent chance participate end year promise go team next write oppressive retrospective find pier derelict row club know happen typically jewish name strongly suggest history kind beautiful sensitive prose live new neighborhood river early childhood inwards river attract year old become member row club side outsider member higher social class father work public transport branch also outsider aspect observe others doubt day eccentric choose anton cox less view anti pole outgo surely boy become perfect team summer start competition row race become apparent chance participate end year promise go team next write oppressive retrospective find pier derelict row club know happen typically jewish name strongly suggest history kind beautiful sensitive prose author create completely absorb people finely tuned character stir tension competition longing use base sport reader know enough connect author display credential impressive talent spend almost page preparation practice execution man crew boat gradually pull understand rule game rigor men row then subtly great tenderness unveils young men polar difference weave story power sport completion greater power find soulmate bond lower class gentile class engineer german beautiful story exploration place love set last summer destroy leave guess fate discover solitary wander tell story year later bank river spend beautiful time live gleam magical poetry introduces author translator seem destine find important role literature debut fine den write lyric story athleticism body love row young man grow friend teammate champion author observant nature body humanity know challenge joy sport communicate experience far do even couch potato sure choice word felicitous phrase translator deserve much credit praise well look forward read different type story really keep attention page take place young oarsman train guidance eccentric german coach hop someday win narrate story work class family oarsman man boat affluent athletic young man story beautifully word image describe young men bond together closer closer grueling practice session training later go win many local race description obsessive desire please everything perfect almost story indeed homoerotic time story tell year later revisits abandon tell deeply emotional remembrance time describe best summer life get feel important year whole life explode remembers feel tragic lose youth happier felt sensitive work literature much feeling write friendship time share together sincerely hope dutch writer future recommend young men train rower lead mysterious doctor dangles possibility time year later see city barren reminisce golden time obsession row physicality action relationship doctor entire world revolve lackluster family world time dazzle last novella eloquent trip man memory lane", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "A \"powerful tale of romantic regret\" (The Seattle Post-Intelligencer), Los Angeles Times Best Book of 2001, and finalist for the French Prix Medicis, On the Water tells the poignant story of Anton and David, two oarsmen trained by a mysterious German coach in the golden Amsterdam summer of 1939. Anton stands on the banks of his beloved river years later, on the wintry eve of Holland's liberation, and mourns a lost world. David, his Jewish teammate and quiet obsession from that magical summer, has disappeared, and the boathouse is now derelict and deserted. \r\n\r\nSpare, lyrical, and nuanced, On the Water is quietly enormous, capturing a moment so precise and exact it is as if caught in amber -- a rowing club in Amsterdam and two of its competitors from very different backgrounds, set against the backdrop of the oncoming war. \r\n\r\nThe menace of tragedy to come is subtly woven into the story of the two boys whose only concerns are practices, races, and themselves. In the end, all that is left for Anton is the memory of his supreme happiness that summer. \r\n\r\n\"...beautiful, vivid writing...van den Brink describes the grace, ecstasy, and agony of rowing, the miracle of its teamwork harmony.\" The Washington Post ", "asin": "0802138950", "rank": "842998", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/41NZ863AB7L.jpg", "country": "The Netherlands", "story_arc": ["Tragedy", "Things only get worse"]}