{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 25, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "The writing style is excellent.  The author wrote his sex experience with implicit descriptions, unlike those in hardcore books.  This is a good buy for those who want to start writing as a hobby."}, {"review_sentiment": 5.0, "review_text": "I'm more than a bit biased on the subject of Henry Miller but typical of any of his books, I couldn't put it down until the very end."}, {"review_sentiment": 4.0, "review_text": "Great read, albeit a little short!"}, {"review_sentiment": 3.0, "review_text": "If Henry Miller comes off looking slightly better in Quiet Days at Clichy than he did in any of his previous works, it's only due to the presence of his Clichy roommate Carl (based on Miller friend Alfred Perles), who is somehow even more reprehensible than Miller, no easy feat. But then, it would be difficult to find a bigger creep than Carl, who thinks nothing of raping a mentally challenged 15-year-old \"waif\" he picked up wandering around the streets for the fun of it and then keeping her around the house for more sex and also to do the dishes and laundry (including washing out the hymenal blood from his sheets because she was a virgin the first time he raped her and a commercial laundry might alert the cops). Fun-loving Carl also delights in yanking out his girlfriend breasts from her blouse to display them to his good buddy Miller...in front of her kids.Yes, that Carl, what a guy...Miller certainly thinks highly of him, probably because they are two of a kind (Miller himself has a few goes at their shared underage house concubine, though he claims he isn't really attracted to her). Perhaps the best indicator of Miller's attitude toward this serial child abuse is his admiration for the girl's mother and the French cop she brings along to fetch back her daughter because they decline to press charges after discovering that Carl and Miller (called \"Joey\" in the novel) are writers and thus shouldn't be held accountable for such trivial things as statutory rape (today, we call this the Roman Polanski defense).Contrast that with the reaction given Vladimir Nabokov's Lolita, which was published in Paris in 1955, a year before Quiet Days at Clichy. Lolita is clearly fiction but many people were nevertheless outraged by its seemingly sympathetic portrayal of a pedophile. I wonder how many of those people are equally outraged by the blasé attitude toward the sexual exploitation of a minor (and one with a mental handicap to boot) in Quiet Days in Clichy, especially since, unlike Lolita, Miller's book is based on real events. Or does the fact that Miller is a literary icon who wrote about his sexual escapades in clinical detail before it was cool (or legal, at least in the U.S.) give him a First Amendment Hero pass? Just askin'.As for Quiet Days in Clichy as a whole, I found it to be a better read than Miller's longer works of that same period (like the often tedious Plexus) because it rambles less. Miller also makes some feints toward humanizing himself here through a couple of incidents where he actually shows some compassion for another human being. On the other hand, the book wraps up with Miller and Carl teaming up to take advantage (sexually and financially) of a clearly drug-addled prostitute.Of course, no Miller work would be complete without the requisite shots at conventional mores, those values held by people too repressed to drink themselves into the gutter or diddle underage girls. A trip to Luxembourg prompts a diatribe about th epeople of that country being total squares interested only in living quiet, conventional lives, going to work, getting married and raising kids. What a bunch of perverts...Anyway, I have been slowly wading through the Miller oeuvre chronologically and while I continue to find him stylistically incandescent, the one-note subject matter does get wearing. Miller's first book, Tropic of Cancer, was a tour de force of stylistic pyrotechnics even if the main subject, Miller himself, came across as a first class A-hole. But at that point it was new and fascinating. By Quiet Days in Clichy, however, published some 20 years later, Miller hadn't progressed anywhere past that (yes, I know Clichy consists of two pieces Miller wrote back in 1940, but the same criticism could be leveled at early 1950s works like Plexus).It was still all about Henry Miller, tireless sex machine and struggling great writer. For him, it seems, there is no other subject..."}, {"review_sentiment": 5.0, "review_text": "Simply one of the best authors of the modern age. Sexual, vibrant, fast... Enough said... Its not quiet at all..."}, {"review_sentiment": 3.0, "review_text": "It is a not much to the story. I was hoping it was more biographical about his stay in Clichy."}, {"review_sentiment": 1.0, "review_text": "I am a street photographer and have been living, 4 to 6 months a year in Paris, for the past 35 years. I was hoping that this book would reflect on the café and street life in Clichy during the 1930s, but all it did was to show that Miller is a psychopath that likes to abuse women. Even when he writes about sex, he is an amateur writer. I think that his claim to fame was that his books where ban in the US."}, {"review_sentiment": 5.0, "review_text": "Miller is always a great read. Some aspects overlap his other writing, but still enjoyable. If you like honesty, humor, some deep thinking and scandalous behavior, buy all of his books."}, {"review_sentiment": 2.0, "review_text": "Henry Miller's short book set in 1940 Paris graphically describes the sexual escapades with various prostitutes by Miller, as \"Joey\" and Carl, his roommate.  Its two parts are indistinguishable in tone, boring characterization, plotlessness, animal urges and misogyny. Think of Joey and Carl as two goats roaming the Parisian back alleys picking up strays, fornicating, then moving on. Except for one small section in the second book as Joey ambles the Champ Elysees, these two goats could be in Berlin or London for all the reader knows.  With no sense of the convulsive and impending German conquest of Paris, no sense of the ambiance of this great \"City of Light,\" the small book is very limited and tells more about the vacuity of his life at this time and how he viewed women as objects for sex, pleasure and debasement."}, {"review_sentiment": 5.0, "review_text": "One of the best books every written.  Henry Miller has an ability to write philosophically laden passages mixed with his erotic escapades."}]}, "authors": ["Henry Miller"], "isbn": "080213016X", "longitude": 2.3514992, "periods": ["1900s"], "title": "Quiet Days in Clichy", "word_cloud": "writing style excellent author write sex experience implicit description hardcore good buy want start writing hobby bite biased subject typical albeit little short come look slightly better previous work due presence roommate base friend somehow even reprehensible easy feat difficult bigger creep think nothing rap mentally challenge waif pick wander around street fun keep house sex also dish laundry include wash hymnal blood sheet virgin first time rap commercial laundry cop also delight yank girlfriend breast display good buddy front guy certainly think highly probably kind go share underage house concubine claim really attract perhaps best indicator attitude serial child abuse admiration girl mother french cop brings fetch back daughter decline press charge discover call writer thus hold accountable trivial thing statutory rape today call defense reaction give publish year clearly fiction many people nevertheless outrage seemingly sympathetic portrayal pedophile wonder many people equally outrage blase attitude sexual exploitation minor mental handicap boot especially base real event fact literary icon write sexual escapade clinical detail cool legal least give pas whole find better longer work period often tedious ramble le also make feint humanize couple incident actually show compassion human hand wrap team advantage sexually financially clearly course work requisite shot conventional more value hold people repressed drink gutter diddle underage girl trip prompt diatribe ht people country total square interested living conventional life go work get married raise kid bunch pervert slowly wad chronologically continue stylistically incandescent subject matter get wear first stylistic pyrotechnic even main subject come first class point new fascinating however publish year later progress anywhere past yes know consist piece write criticism early work still tireless sex machine struggle great writer seem subject best author modern age vibrant fast say much story hop biographical stay street photographer living month year year hop cafe street life show psychopath like abuse woman even write sex amateur writer think claim fame ban always great aspect overlap write still enjoyable honesty humor deep thinking scandalous behavior buy short set graphically describe sexual escapade various prostitute part indistinguishable tone bore characterization spotlessness animal urge misogyny goat roam parisian back pick stray fornicate move small section second amble goat know sense convulsive impending german conquest sense ambiance great small limit tell vacuity life time view woman object sex pleasure debasement best write ability write philosophically laden passage mixed erotic escapade", "genres": ["Memoir"], "summary": "This tender and nostalgic work dates from the same period as Tropic of Cancer (1934). It is a celebration of love, art, and the Bohemian life at a time when the world was simpler and slower, and Miller an obscure, penniless young writer in Paris. \r\n\r\nWhether discussing the early days of his long friendship with Alfred Perles or his escapades at the Club Melody brothel, in Quiet Days in Clichy Miller describes a period that would shape his entire life and oeuvre.\r\n\r\n\"The only imaginative prose writer of the slightest value who has appeared among the English-speaking races for some years past.\" George Orwell", "asin": "080213016X", "rank": "845835", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41TwaXX3H9L.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}