{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 108, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Viet Thanh Nguyen really writes in a caliber like Waugh, Green, Dostoevsky, and Moehringer. He speaks truth, raw, and always compelling. I bought Refugees after completing his The Sympathizer. Few writers keep you glued to the page with a mix of storyline, philosophy, history, morality, and raw human emotion. Truth can be brutal and he delivers it. He is a fearless writer. Do NOT be put off by what could look like, before reading, a jaundiced ethnic point of view. Why? The writing is universal. His truths should scare the crap out of you and help you face reality with courage and a better perspective. This is one of those books you hate to end, when you read the reviews, the acknowledgements, the legal data, and the number of printings—hoping SWEET JESUS there is more to it."}, {"review_sentiment": 5.0, "review_text": "I first read the Sympathizer which was a labyrinthine journey in itself.  I'm impressed with Nguyen's breadth in being able to encompass so many different protagonists.  It was strange being pulled in and unceremoniously jerked out of reach story.  (Especially because, uh, at first I thought this was one larger novel that mixed in the different perspectives.. lol.  I had to read the two stories with the understanding they wouldn't be expanded on later).Anyway, short stories are really hard to write and each one was satisfying.  The themes are universal but there's always a tie back to Vietnam.  So well done."}, {"review_sentiment": 5.0, "review_text": "I'm not a big fan of the short story, but these captivated me.  Fans of Nguyen will not be disappointed."}, {"review_sentiment": 5.0, "review_text": "Great book"}, {"review_sentiment": 5.0, "review_text": "The audio book is great 👍"}, {"review_sentiment": 5.0, "review_text": "Reading this book brought so many memories of my own family. The stories they have told me of escaping war and their own struggles. It touch a nerve in me that I will never fully be able to comprehend what my family went through. Thanks for making me appreciate and grateful not only for what my family did but for all refugees who sacrificed their own lives & dreams for the betterment of their children."}, {"review_sentiment": 5.0, "review_text": "A beautiful collection of short stories about Vietnamese ex pats.  Really enjoyed it!"}, {"review_sentiment": 5.0, "review_text": "This is, quite possibly, the best collection of short stories I've ever read. My only complaint is that I'd get super interested and invested right as the story was ending. I often wanted more! But the writing is so good, and the topic is fascinating. Great collection all around."}, {"review_sentiment": 5.0, "review_text": "Surprising and original prose"}, {"review_sentiment": 5.0, "review_text": "It i clear why Viet won the Pulitzer, his writing continues to be great.  A good perspective on how refugees live and deal with the issues they face daily."}]}, "authors": ["Viet Thanh Nguyen"], "isbn": "0802126391", "longitude": -122.4192363, "periods": ["2000s", "Recent Releases"], "title": "The Refugees", "word_cloud": "really write caliber speak truth raw always compel buy complete writer keep glue page mix story line philosophy history morality raw human emotion brutal delivers fearless writer do reading jaundice ethnic point view writing universal truth crap help face reality courage better perspective hate end review acknowledgment legal data number first labyrinthine journey impress breadth able encompass many different protagonist strange pull unceremoniously jerked reach story first think larger mixed different lo story understand expand later short story really hard write satisfy theme universal always tie back well do big fan short story captivate fan disappoint great audio great read bring many memory family story tell escape war struggle touch nerve never fully able comprehend family go make appreciate grateful family sacrifice life dream betterment child beautiful collection short story vietnamese pat really enjoy quite possibly best collection short story ever complaint get super interested invest right story end often want write good topic fascinate collection surprise original prose clear write continue great good perspective live deal issue face daily", "genres": ["Fiction & Literature"], "summary": "Viet Thanh Nguyen's The Sympathizer was one of the most widely and highly praised novels of 2015, and the winner of the 2016 Pulitzer Prize for Fiction. Nguyen's next fiction book, The Refugees, is a collection of perfectly formed stories written over a period of twenty years, exploring questions of immigration, identity, love, and family.\r\n\r\nWith the coruscating gaze that informed The Sympathizer, in The Refugees Viet Thanh Nguyen gives voice to lives led between two worlds, the adopted homeland and the country of birth. \r\n\r\nFrom a young Vietnamese refugee who suffers profound culture shock when he comes to live with two gay men in San Francisco, to a woman whose husband is suffering from dementia and starts to confuse her for a former lover, to a girl living in Ho Chi Minh City whose older half-sister comes back from America having seemingly accomplished everything she never will, the stories are a captivating testament to the dreams and hardships of immigration. \r\n\r\nThe second piece of fiction by a major new voice in American letters, The Refugees is a beautifully written and sharply observed book about the aspirations of those who leave one country for another, and the relationships and desires for self-fulfillment that define our lives.\r\n", "asin": "0802126391", "rank": "6421", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51a2768yYbL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}