{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 2356, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "This is one of the strangest and funniest books I've ever read. The author has an incredibly unique style and it really captures a unique local feel of New Orleans. The book is a cult classic for a reason. Don't read it with high expectations -- just read it and appreciate it for its uniqueness. The main character in the book is like no other!"}, {"review_sentiment": 5.0, "review_text": "As a avid reader,this is one of my all -time favorites ! Mostly a non-fiction history buff; I picked this classic and I am glad I did. The writing style and description of the characters are second to none. One of a few books that I have read multiple times. There are some that don't like this book and I can't  imagine why...A masterpiece and MUST read !"}, {"review_sentiment": 5.0, "review_text": "I had read this on paper twice in the last 20years and it’s my favorite novel. Just finished the audiobook and really enjoyed the different accents and inflections and emotions expressed by the reader. It is still laugh out loud funny. Hard to believe this is the first novel with the skill of storytelling, character development and brevity woth which the dialogue and story is told. What a cast of characters. Hysterical."}, {"review_sentiment": 3.0, "review_text": "I had to put myself in another era and deal with the \"dunces\".  Could have lived without reading it."}, {"review_sentiment": 5.0, "review_text": "Bar none, the funniest novel ever written. Why Ignatius Riley hasn't been immortalized on the silver screen by now is a complete mystery to me. His character stands with the most endearing tragicomic heroes of literature and film, from Don Quixote to W.C Fields. Perhaps if a time like the 1970s in America comes along, it will be filmed. This is the only novel I have read more than once. And plan to read again. Don't hesitate to buy it now! Warning: you'll probably end up booking a flight to New Orleans."}, {"review_sentiment": 5.0, "review_text": "Ignatius Reilly is one of the greatest characters in modern lit, a fat Quixote of the later part of last century.  The story has several plots and sun-plots all tied beautifully together at the end.  Great book!!"}, {"review_sentiment": 5.0, "review_text": "read it 7 times.  probably will read 3 or more times before I die. Brilliantly funny.  It would be hard to write a book like this now and get it published.  Take political correctness.  Now take the total opposite.  Then multiple that by infinity and you have Confederacy of Dunces.  Must read."}, {"review_sentiment": 5.0, "review_text": "While I have not finished the book, I love it so far.  And reading through the cookbook at the same time.  Lots of fun"}, {"review_sentiment": 2.0, "review_text": "This is an awful book, I dont know why people like it,"}, {"review_sentiment": 4.0, "review_text": "Funny an well worth the effort. Especially good if you know New Orleans . Great comic characters all through the book"}]}, "authors": ["John Kennedy Toole"], "isbn": "0802130208", "longitude": -90.0701156, "periods": ["1900s"], "title": "A Confederacy of Dunces", "word_cloud": "strangest funniest ever author incredibly unique style really capture unique local feel cult classic reason high expectation appreciate main character avid favorites mostly history buff pick classic glad write style description character second none multiple time masterpiece paper twice last favorite finish audio book really enjoyed different accent inflection emotion express still loud funny believe first skill storytelling character development brevity quoth dialogue story tell cast character put era deal live read none funniest ever write immortalize silver screen complete mystery character stand endear tragicomic hero literature film perhaps time come along film probably end book flight greatest character modern lit fat later part last century story several plot tie beautifully together great time probably time die brilliantly funny write get publish political correctness now take total opposite then multiple infinity finish love far read cookbook time fun awful font know people well worth effort especially good know comic character", "genres": ["Fiction & Literature"], "summary": "A Confederacy of Dunces is a picaresque novel by American novelist John Kennedy Toole which appeared in 1980, eleven years after Toole's suicide. Published through the efforts of writer Walker Percy (who also contributed a foreword) and Toole's mother, the book became first a cult classic, then a mainstream success; it earned Toole a posthumous Pulitzer Prize for Fiction in 1981, and is now considered a canonical work of modern literature of the Southern United States.\r\n\r\nThe book's title refers to an epigraph from Jonathan Swift's essay Thoughts on Various Subjects, Moral and Diverting: \"When a true genius appears in the world, you may know him by this sign, that the dunces are all in confederacy against him.\" Its central character, Ignatius J. Reilly, is an educated but slothful 30-year-old man living with his mother in the Uptown neighborhood of early-1960s New Orleans who, in his quest for employment, has various adventures with colorful French Quarter characters. Toole wrote the novel in 1963 during his last few months in Puerto Rico.\r\n\r\nWikipedia", "asin": "0802130208", "rank": "5502", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51zP2kOP%2BCL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}