{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 4, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Great! Fast shipping,  great packaging and matched the description 100%!"}, {"review_sentiment": 2.0, "review_text": "I'm only half-way through - not really far enough along to consider my review valid - but reading In Another Place, Not Here is like reading a book written by my cat.  It's ignores every attempt I make to engage it. It refuses to recognize my existence.  A paragraph's opening will introduce something dramatic, like an immigration raid, or a violent threat, or a sexual assault, and then a few sentences later, within the same paragraph, without explaining who did what to whom and why, it'll just introduce something else mundane and unrelated, in a new time and place, and completely irrelevant to the plot, and continue at it for two pages.  It's like when your cat sidles up to your leg like it really wants to be pet, but then as soon as you bend down to pet it, it walks over to your garbage can and stares at it for twenty minutes.Also - and this is more so a pet peeve of mine - it really overuses pronouns.  With the text's many abrupt shifts in subject, time and place, the overuse of pronouns leaves you wondering who \"she\" is, and which people are included in \"their.\"  It sacrifices clarity for the sake of style."}, {"review_sentiment": 5.0, "review_text": "For readers unaccustomed to the Black Caribbean vernacular that begins Dionne Brand's 1996 novel In Another Place, Not Here--like me--there's a bit of an initial hurdle to leap over to sink into this book.  But trust me, it's worth it; and sink in you truly do. Brand is an exhilarating poet and although this is a novel, it's definitely a poet's novel. There is something--many things, in fact--deliciously seductive about the language, which rolls, rises, falls, and flows its way throughout the narrative like a river. The rhythm and feel of the words are seductive to the point that their meaning at times seems secondary and, in fact, purposely elusive--a quality that might be frustrating for some readers. If you can give yourself over to the novel, though, make yourself vulnerable in a way that one of the main characters Verlia struggles to throughout the book, In Another Place, Not Here is a really rewarding read....See the rest of my review on my website:[...]"}, {"review_sentiment": 3.0, "review_text": "I just finished reading this one for a class.  It is a very complex novel that I think would benefit from multiple readings.  The novel is extremely discriptive and tells the story of two women from different parts of the world and how their paths ultimately cross.  Brand's prose is intricately woven with a combination of confusion, wonder, and anger that emminates through fresh use of voice and perception.  The book illustrates the impact of the imperialism and the slave-trade in the Carribean and takes place in both the islands and Ontario.  I recomend this one but caution that it is a book that takes effort to really get into it."}]}, "authors": ["Dionne Brand"], "isbn": "0802136338", "longitude": 0.0, "periods": ["1900s"], "title": "In Another Place, Not Here", "word_cloud": "shipping great packaging match description really far enough review valid reading place read write cat ignore attempt make refuse existence paragraph open introduce something dramatic immigration raid violent threat sexual assault sentence later paragraph explain introduce something else mundane unrelated new time place completely irrelevant plot continue page cat sidles leg really want pet soon bend pet walk garbage star twenty pet peeve mine really overuse pronoun text many abrupt shift subject time place overuse pronouns leave wonder people include sacrifice clarity sake style reader unaccustomed vernacular begin place bit initial hurdle leap sink trust worth sink truly exhilarate poet definitely something many thing fact deliciously seductive language roll rise fall flow way narrative river rhythm feel word seductive point meaning time seem secondary fact purposely elusive quality frustrate reader give make vulnerable way main character struggle place really reward rest review website finish read class complex think multiple reading extremely descriptive tell story woman different part world paths ultimately cross prose intricately woven combination confusion wonder anger emminates fresh use voice perception illustrates impact imperialism take place island ontario recommend caution take effort really", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "Acclaimed by Adrienne Rich as \"fierce, sensuous . . . a work of great beauty and moral imagination,\" In Another Place, Not Here tells of two contemporary Caribbean women who find brief refuge in each other on an island in the midst of political uprising. Elizete, dreaming of running to another place to escape the harshness of her daily life on the island, meets Verlia, an urban woman in constant flight who has returned to her island birthplace with hopes of revolution. Their tumultuous story moves between city and island, past and future, fantasy and reality.", "asin": "0802136338", "rank": "1090223", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/51yxLi3IRmL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}