{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 3, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Every character is deeply flawed; every cup is cracked; every window is grimy; every spoon is greasy. The seaside resort is choked with fog and seaweed. When you look out at the resort you see a homeless man defecating by the dumpster. Welcome to Antunes’ Portugal. The story is set in the 1970’s shortly after Portugal’s Carnation Revolution, when the dictator, Salazar, was overthrown.Our main character is a teacher and a scholar who disappointed his father and his family by not going into the family business but into “the humanities” instead. That choice and his leftist leanings and leftist wife and later, girlfriend, shock his family’s conservative sentiments and seem to have been his downfall. And the story is about that downfall and its tragic end.The book title refers to one period in the man’s childhood when he actually adored his father and had conversations with him while on vacations at an old family farm. His father taught him about nature and “explained the birds to him.” All that is past; his father now is distant to him and doesn’t even remember those conversations that meant so much to his son. The father is only concerned with his mistress and is disconnected from his whole family.The contemporary narrative of the novel is interspersed with mock interviews with members of his family, his ex-wife and ex-girlfriend, looking back from much later in time, as if someone were writing a biography of the main character sometime in the future. The narrative is also interspersed with circus commentary and freak show characters who keep up a running sarcastic commentary on the main character’s actions and motives. His sister characterizes the main character best:: “…of all the people I’ve ever met he was the least prepared for life.”The protagonist comes to the resort to break up with his current girlfriend and she turns the tables on him leading up to the tragic ending. Like Antunes’ other works, such as Splendor of Portugal, which I have reviewed (the last thing you will find in that work is anything of splendor) there is a lot of psychological depth and local color of urban and rural Portugal. (In Splendor, the local color is of both Angola and Lisbon). But be forewarned, the local color is dulled by dirty gray streaks that are sticky to boot."}, {"review_sentiment": 5.0, "review_text": "This is a ironic tale of a ordinay fellow on a particular situation. The life of Rui is a very ordinary one, divorced and married again, college professor, communist or maybe not, an ordinay wife. Rich son married with a communist lower-class wife. Now he tries to change this. Get a new life but how?"}, {"review_sentiment": 4.0, "review_text": "As Rui S., 33 year old professor of political science and failed husband, son, and lover, looks back on his limited accomplishments, he contemplates his future and finds it particularly bleak. The son of a powerful and wealthy industrialist, Rui turned his back on the family business, studied  the liberal arts, and joined the Communist Party. He married Tucha, a  beautiful shrew, and fathered two children. We spend the entire book following a torrent  of memories that washes over and around and through glimpses of the  present. What distinguishes An Explanation of the Birds from other novels  of its type is the manner of the telling. Past and present inter-mingle on  the page with no markings or divisions acting as cues to the reader. Scenes  from the past share space with scenes from the present within the same  paragraph. It's a remarkable strategy that demands the reader remain ever  attentive, but the effect is mesmerizing and works in a manner reminiscent  of the magic realism of Garcia Marquez or Donoso. The novel is also  cynically critical of modern Portugal, and of politics in general. Rui S.  emerges as pathetic, his female companions as heartless, and his family as  emotionally vapid and effete. Not a pretty picture. It is a novel worth  reading for its brilliant technique, not necessarily for the warmth of its  characterizations."}]}, "authors": ["António Lobo Antunes"], "isbn": "0802134203", "longitude": -9.1365061, "periods": ["1900s"], "title": "An Explanation of the Birds", "word_cloud": "character deeply flaw cup crack window grimy spoon greasy seaside resort choke fog seaweed look resort see homeless man defecate dumpster story set shortly dictator main character teacher scholar disappoint father family go family business humanity instead choice leftist leaning leftist wife later girlfriend shock family conservative sentiment seem downfall story downfall tragic title refers period man childhood actually adore father conversation vacation old family farm father taught nature explain father distant even conversation much son father concern mistress disconnect whole contemporary narrative intersperse mock interview member family look back much later time someone write biography main character sometime future narrative also interspersed circus commentary freak show character keep run sarcastic commentary main character action motives sister characterize main character best people ever meet least prepared protagonist come resort break current girlfriend turn table lead tragic end work review last thing find work anything splendor lot psychological depth local color urban rural local color forewarn local color dull dirty gray streak sticky boot ironic tale ordinary fellow particular situation life ordinary divorce married college professor communist maybe ordinary wife son marry communist wife now try change new life year old professor political science fail husband son lover look back limited accomplishment contemplate future find particularly bleak son powerful wealthy industrialist turn family business study liberal art join marry beautiful shrew fathered child spend entire following torrent memory wash glimpse present distinguish novel type manner tell present page marking division act cue share space scene present paragraph remarkable strategy demand remain ever attentive effect mesmerize work manner reminiscent magic realism also cynically critical modern politics general emerge pathetic female companion heartless family emotionally vapid effete not pretty picture read brilliant technique necessarily warmth characterization", "genres": ["Fiction & Literature"], "summary": "A novel of dark, often bitter, humor and remembrance from Portuguese writer Antunes (Fado Alexandrino, 1990), whose hapless hero here represents all that's wrong with post-revolutionary Lisbon. \r\n\r\nBetween a Thursday and a Sunday, Rui S. - a 33-year-old political historian and the son of a leading industrialist who has rebelled against his bourgeois family - recalls his unhappy past and anticipates a different future. \r\n\r\nNothing has ever gone right for poor Rui. A failure in high school, expelled by the Communist Party for being too bourgeois, deserted by his first wife, and ignored by his second (a hard-line Communist and genuine member of the proletariat), Rui has only one happy memory to sustain him--talking about birds as a child with his father. \r\n\r\nAnd now that his mother is dying--while his philandering father is traveling as usual--Rui decides that he must somehow change his life, beginning with the upcoming weekend when he and his wife are away at a conference. At an appropriate moment he will tell her that he is going to leave her. Instead, the two end up at a run-down inn on the coast where the beach is home to hundreds of gulls--which, in turn, remind Rui of his one happy moment. Then, when his wife announces first that she's leaving him, Rui has no alternative but to do what he's already imagined. \r\n\r\nSurrounded by circling sea gulls, Rui ends his life--his one successful accomplishment. Antunes evokes a corrupt and dying world, infused with yearning for lost innocence, where even the food and weather are foul and where only suicide, however melodramatic, makes sense. \r\n\r\nA remarkable combination of angry satire and elegiac tenderness.", "asin": "0802134203", "rank": "2286602", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/71M86ZRXB4L.gif", "country": "Portugal", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}