{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 364, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "perfect"}, {"review_sentiment": 1.0, "review_text": "Very prejudiced. Very stereotyped. Who wants to read about Indians writing about drunk Indians. I liked The Thing They Carried better."}, {"review_sentiment": 5.0, "review_text": "An absolutely amazing novel. Alexie gives meaning to what it is to be a modern native warrior"}, {"review_sentiment": 5.0, "review_text": "At times touching, hilarious, and excruciatingly painful. This wit-filled collection has no shortage of entertainment and thought-provoking commentary on the experience of Native Americans on the reservation."}, {"review_sentiment": 5.0, "review_text": "He is awesome!"}, {"review_sentiment": 5.0, "review_text": "I am not American and I've discovered this book by chance. It is a magnificent piece of high-class literature. These short stories about joys and sorrows of Native Americans made me laugh and cry. I read it twice to grasp all the subtle  details to the fullest. Simply wonderful!"}, {"review_sentiment": 5.0, "review_text": "I mean, it's Alexie. Of course it is good."}, {"review_sentiment": 5.0, "review_text": "Simple yet full of everything life and love offer. Moving and a memory to those things in life like history and personality that  don't make sense to others. An explanation of being no matter your race or experience"}, {"review_sentiment": 5.0, "review_text": "Great book in good condition."}, {"review_sentiment": 5.0, "review_text": "This book is gorgeously written, witty and heartbreaking all at the same time."}]}, "authors": ["Sherman Alexie"], "isbn": "0802121993", "longitude": -122.3300624, "periods": ["1900s"], "title": "The Lone Ranger and Tonto Fistfight in Heaven", "word_cloud": "perfect very prejudiced stereotype want write drunk like carry better absolutely amazing give mean modern native warrior time touch hilarious excruciatingly painful collection shortage entertainment commentary experience reservation awesome american discover chance magnificent piece literature short story joy sorrow make cry twice grasp subtle detail fullest wonderful mean course good simple full everything life love offer move memory thing life history personality make sense others explanation matter race experience good condition gorgeously write witty heartbreaking time", "genres": ["Fiction & Literature"], "summary": "Sherman Alexie’s celebrated first collection, The Lone Ranger and Tonto Fistfight in Heaven, established its author as one of America’s most important and provocative voices. The basis for the award-winning movie Smoke Signals, it remains one of his best loved and widely praised books twenty years after its initial publication.\r\n\r\nVividly weaving memory, fantasy, and stark reality to paint a portrait of life in and around the Spokane Indian reservation, this book introduces some of Alexie’s most beloved characters, including Thomas Builds-the-Fire, the storyteller who no one seems to listen to, and his compatriot, Victor, the sports hero who turned into a recovering alcoholic. Now with an updated introduction from Alexie, these twenty-four tales are narrated by characters raised on humiliation and government-issue cheese, and yet they are filled with passion and affection, myth and charm. Against a backdrop of addiction, car accidents, laughter, and basketball, Alexie depicts the distances between men and women, Indians and whites, reservation Indians and urban Indians, and, most poetically, modern Indians and the traditions of the past.\r\n\r\n“Alexie’s prose startles and dazzles with unexpected, impossible-to-anticipate moves. These are cultural love stories, and we laugh on every page with a fist tight around our hearts.” The Boston Globe\r\n\r\n“Poetic and unremittingly honest . . . The Lone Ranger and Tonto Fistfight in Heaven is for the American Indian what Richard Wright’s Native Son was for the black American in 1940.” Chicago Tribune", "asin": "0802121993", "rank": "17219", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/51HiXEEugML.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}