{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 14, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "A great travel guide for Paris if you want to stalk Jack around some of the city! I did! Purchased this one for a gift. The additional novella, Pic, is a plus. JK was a masterful writer!"}, {"review_sentiment": 5.0, "review_text": "Pic!!! The Dancin' Man!!! I have read this book out loud to lovers since my late 20s - It's a children's book for adults."}, {"review_sentiment": 4.0, "review_text": "good"}, {"review_sentiment": 5.0, "review_text": "I bought this for a Jack Kerouac fan. This was the firsr of the two. It was enjoyed. Arrived wonderfully and was an good read. They recommend it."}, {"review_sentiment": 4.0, "review_text": "I reread this after many many years and it did not stand up to the test of time. It's probably me not Jack."}, {"review_sentiment": 4.0, "review_text": "I'm surprised by how many reviewers have focused on Satori in Paris and neglected much a discussion of Pic, which, to my mind, is EASILY the pick of the two in this great value pack (pun unintentional).It's the last novel that Jack would ever complete. Stylistically similar to Twain and starting off with a touch of the Faulknerian southern gothic novel to boot, the story ends up becoming an energy-charged tale of two brothers escaping hard times down South as they hit the road and travel to New York and the excitement of jazz and its endless number of bars.Satori in Paris, even though it has its great moments, is not an easy read. I don't mean in a high-brow sense or that Jack loses his reader through his spontaneous prose literary excursions and scatological pile-ups of words but it's hard to read because it was at the end of his life, where Jack seems effectively at the end of his emotional and literary tether, and he is in (gradual) self-destruct mode in which he continued to drink himself to death (as he is a Catholic and does not believe in suicide per se). Satori in Paris is not nearly as bad as it has been portrayed and does not deserve the scorn and derision of those in the anti-Kerouac crowd (who never 'got' him anyway, let's face it) and it does have its amusing parts like when Jack gets into a yelling competition with a train conductor over the correct French pronunciation of a word. (Jack was always proud of his French-Canadian heritage). Incidentally, I found it both funny and sad how Kerouac realizes in this instant that he is a 'lunatic'.He certainly knew how to put himself down...unfortunately. He once wrote 'put myself down and what have I got left?' - something heartbreakingly honest and melancholic (see Ann Charters' lectures at Naropa for more details).All in all, this is worth reading but especially because of that not-so-well-known gem after Satori in Paris - Pic.It is truly a joy to read and extremely vivid in its descriptions that I could have sworn that I had just watched a very interesting fast-paced movie rather than an actual book. In short (bref): sheer genius at the end of a great but tragic career.What is so fascinating about Pic as well is how different it is, stylistically speaking , from ANYTHING else Kerouac wrote. This also adds support to Ann Charters' claim that he 'could write anything he absolutely wanted to'. There are the certain definite Kerouackian hallmarks within (fast-paced jumping narrative, heavy emphasis on booze, travelling and saxophones etc.) but there's something magical about it too that I can't quite put my finger on - like Kerouac had tapped into a secret vein, a conduit if you will, back to the old South, a part of Old America, that does not exist any more.I think an interesting paper could be written comparing the first half of the novel with works by Twain and perhaps Faulkner while the second half sounds similar to The Horn by John Clellon Holmes (although I haven't read that book yet).Highly recommended, especially Pic which may just be Kerouac's short but final masterpiece that he left behind for the world."}, {"review_sentiment": 5.0, "review_text": "It helps to be a bit of a Kerouac fan to like this short book, and it helps if you've been to Paris as well I guess.  I liked it, and tho Jean-Louis Lebris de Kerouac was pretty wasted thru his whole trip here, he is funnier than hell!!!  The way he puts down the American businessman tourist, comments still on a coupla giggly schoolmarms from Iowa, how he gets offended that his French (real French, if olde-timey) and his bum demeanor are not quite what Parisians dig...  Kerouac by the end is sick of traipsing around France (and wants to get back to the American funny papers in St Pete!) but not before a beer and calvados soaked journey ostensibly to find his ancestry (he even admits he only ate one real meal while in Paris--hot dogs and saurkraut!).  This is a good book, we all know he died soon after, the fact that he even got this written after his trip is amazing."}, {"review_sentiment": 5.0, "review_text": "satori is kerouac being kerouac, the end of the Duluoz Legend, almost like he's just writing you letters. i wish there was a bit more to it, something to end it all, but alas it ends not with a bang but a whimper.pic, his last novel, is great, this is kerouac being mark twain and really shows his talent as a writer, that he can write about something other than himself. and ties into his Duluoz Legend in a cool sort of way too."}, {"review_sentiment": 2.0, "review_text": "I've read a lot of Kerouac's stuff and liked most of it. this, however, is truly pathetic, uninteresting and unnecessary. I guess if you for some reason need a portrait of the artist in decline... this is it.If you've never read him please dont start here. This is only for those who already love and know what jack was capable of- we're better prepared to forgive disappointments like these. If you're new to kerouac do yourself a favor and start with things like the dharma bums, on the road and subterraneans- there's a reason these are as popular as they are.It's nice and short, though.I also want to mention that this is my first review- I'm not in the habit of trashing great writers lesser works. I dont need my opinions heard or validated. I just want to steer fledgling beat readers away from what could be an instant kerouac dealbreaker."}, {"review_sentiment": 4.0, "review_text": "Straight from the hip[flask] of Kerouac, a simple tale about the search for his family's history, which means (like every Kerouac novel) it's not REALLY about that at all, but more about life in general.  I loved chapter two (which you can read all of through the link, above) because it sums up Kerouac's writing philosophy in an nutshell (a good starting point for anyone diving into his works for the first time).  Since we all know booze would kill Kerouac not too long after he wrote this novel, it's tough not to feel sorry for him as you read -- and, at least for me, wish I could go back and smack his drunk ass out of it -- but I guess that's what made him tick.  After reading Kerouac's vivid, rambling accounts of the most mundane events, one can't help but to find a greater appreciation for life and everything in it.  God bless him."}]}, "authors": ["Jack Kerouac"], "isbn": "0802130615", "longitude": 2.3514992, "periods": ["1900s"], "title": "Satori in Paris & Pic", "word_cloud": "great travel guide want stalk city purchase gift additional novella masterful writer loud lover late child adult good buy fan first enjoy wonderfully good recommend reread many many year stand test time probably surprise many reviewer focus neglect much discussion mind pick great value pack unintentional last ever similar start touch faulknerian southern gothic boot story end become tale brother escape hard time hit road travel excitement jazz endless number even great moment easy mean sense lose spontaneous prose literary excursion scatological word hard end life seem effectively end emotional literary tether gradual mode continue drink death believe suicide nearly bad portrayed deserve scorn derision crowd never anyway let face amuse part get yell competition train conductor correct french pronunciation word always proud heritage find funny sad realize instant certainly know unfortunately write get left something heartbreakingly honest melancholic see lecture detail worth read especially gem truly joy extremely vivid description watch interest movie rather actual short beef sheer genius end great tragic fascinating well different stylistically speak anything else write also add support claim write anything absolutely want certain definite hallmark jump narrative heavy emphasis booze travel saxophone something magical quite finger tap secret vein conduit back old part exist think interesting paper write compare first half work perhaps second half sound similar yet recommend especially short final masterpiece leave world help fan short help well guess like tho pretty waste thru whole trip funnier hell way put american businessman tourist comment still copula giggly schoolmarm get offend french real french bum demeanor quite dig end sick traipse want back american funny paper beer salvador soak journey ostensibly find ancestry even admit real meal hot dog sauerkraut good know die soon fact even get write trip amaze kerouac kerouac end almost write letter wish bit something end ala end bang last great kerouac mark twain really show talent writer write something tie cool sort way lot stuff like however truly pathetic uninteresting unnecessary guess reason need portrait artist decline never font start already jack capable better prepared forgive disappointment new kerouac favor start thing dharma bum road reason popular nice short also want mention first habit trash great writer lesser work font need opinion hear validate want steer fledgling beat reader away kerouac deal breaker hip flask simple tale search family history mean life general love chapter link sum write philosophy nutshell good start point anyone dive work first time know booze long write tough feel sorry least wish back smack drunk as guess make tick read vivid ramble account mundane event greater appreciation life everything bless", "genres": ["Memoir", "Fiction & Literature"], "summary": "Satori in Paris and Pic, two of Jack Kerouac's last novels, showcase the remarkable range and versatility of his mature talent. Satori in Paris is a rollicking autobiographical account of Kerouac's search for his heritage in France, and lands the author in his familiar milieu of seedy bars and all-night conversations. \r\n\r\nPic is Kerouac's final novel and one of his most unusual. Narrated by ten-year-old Pictorial Review Jackson in a North Carolina vernacular, the novel charts the adventures of Pic and his brother Slim as they travel from the rural South to Harlem in the 1940s.", "asin": "0802130615", "rank": "1103987", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51AD-7rpvZL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}