{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 11, "rating": 3.1, "reviews": [{"review_sentiment": 2.0, "review_text": "After following his career in song, I looked forward to his fiction. I did not find the main character interesting.. He was suicidal and very nearly is successful at doing himself away. The positive point is that Buarque de Holanda has a way of painting a long dream, which seems to be what he put on paper."}, {"review_sentiment": 4.0, "review_text": "Very inspirational and heart warming"}, {"review_sentiment": 3.0, "review_text": "This slim, lyrical novel by Brazilian songwriter and musician Chico Buarque was a bit of an enigma to me.  Although it begins in a relatively conventional manner, eventually it slips into a surreal, unreliable account that probes the relationship between identity and language.  Conceptually, that made the novel  more intriguing, but the final chapters seemed rushed - especially in relation to the leisurely pace of the beginning.  In that rather abrupt shift in both pace and purpose, I'm left feeling that I missed anything deeper that Mr. Buarque may have tried to communicate.  On its own terms, I still think the novel is more successful than not, but similar to the only work I've read of Roberto Bolaño (Monsieur Pain), it strikes me as too self-contained - not irrelevant, but not especially pertinent to anything outside of itself.Ghostwriter José Costa, on a flight from Istanbul to Rio de Janeiro, is unexpectedly detained in Budapest, where he becomes enamored with the Hungarian language.  It has such a siren-like draw on him, that when difficulties arise in his marriage, he chooses to return to Budapest rather than follow his wife to London for their annual vacation.  Immersing himself into the life and language of the country, he stays for months, finding a teacher as well as a lover.As I read up to this point, I resigned myself to the idea that I had picked up a competent yet pedestrian novel of a writer's mid-life crisis, and when José leaves Hungary to return to his wife and child in Brazil, I expected a conventional ending.  But here is where the story began to take on an odd shape.  As a ghostwriter, José's last assignment had been to invent a biography for a wealthy but unremarkable man, and his over-the-top efforts have turned the man into a celebrity; when he returns to Brazil, he finds his wife is having an affair with this man, one whom José had essentially written into existence.  Ironically, she is enamored with the man only because of José's words, something José had wanted for their entire marriage.  Incensed and infuriated that his wife is loving him vicariously through this other man, he again stomps off to Hungary.To summarize anymore will reveal too many of the charms of the novel - suffice it to say that eventually, we come to doubt the reality of everything that has come before, and if we accept the fact that José  can 'create' a man through his ghostwriting, then who has created José ?  The Publisher's Weekly review from the novel's product page has a nifty phrase (metatextual gimmick) to describe the ending, which seems pretty apt as the novel constricts around the reader's mind like a Chinese finger trap the more we try to wriggle through it.  Readers who delight in word games and literary paradoxes should find exactly what they are looking for in 'Budapest' - if they hang with it to the end.But I wonder as to whether it will have much broader appeal.  Readers who are interested in a more straight-forward narrative will likely be frustrated, and those who *do* enjoy literary games will probably be left puzzling over what it is that the exercise is designed to do.  In the end, it may best be described as a quirky vacation read, flawed yet lyrical and fun - but ultimately too intent on its circular track of internal logic for me to ever feel connected to it."}, {"review_sentiment": 4.0, "review_text": "This is a masterly-executed literary work with a well-constructed plot. There are no apparent flaws, the author apparently achieved everything he set to explore, except I could not stop thinking it should have a been a poem rather than a novel. Some reviewers criticize him for not giving enough Budapest-specific details but this is beside point as the novel is not about Budapest but about a particular human condition. It could as well have been set in an anonymous central European country.The 40 year old individual telling us his story is not in a great shape - half hartedly engaged in his work of writing on others' behalf, less than half heartedly committed to his family, and just seemingly having a problem thinking straight and behaving coherently. He seeks a refuge from his troubles in embracing a foreign language and - surprize - a foreign woman. Now, for all the respect for the objective qualities of the work, it is difficult to enjoy it without experiencing some sympathy for the story teller, and it is my problem that I found pretty much none for this middle-aged trouble-seeker engaging into actions rather more typical for teenagers. It was all the way like been in a forced company of an inebriated and delusional person slowly letting the glimpse of the true events emerge from his stream of conciousness. It was an enervating and rather unpleasant read but I found that I had to finish it anyway, reaching the happy end (if there can be any happy end for a hero in his state of mental facilities). The author was certainly right in making it relatively short and may have missed an opportunity to create a masterpiece by writing it is a poem, which as a poet he probably could.I wanted to mention that I started reading this book because it was one of the many praised by the late giant of modern literature Jose Saramago in his \"Notebook\". This one ultimately was worth knowing about, and I will continue exploring the others."}, {"review_sentiment": 2.0, "review_text": "Budapest:  a novel was my first introduction to author Chico Buarque of Brazil.  Apparently a world-renowned singer & composer (according to the book jacket info), this novel reads at times like a meandering tune.  A lot of activity is packed into this short book, but the chapters in which Jose, our Brazilian narrator talks of estranged wife, Vanda, are written in a befuddling stream-of-consciousness mode that is hard to fathom and follow at times.  Essentially, Jose--a frustrated ghost writer--suddenly opts to take a trip to Budapest and falls in love not only with the mysterious Kriska, but the Hungarian language itself (\"the only tongue the devil respects\").Kriska acts as a teacher of the Hungarian language to Jose, our anti-hero, but other than continually describing her \"white white shoulders,\" she comes across as a limp, poorly-developed character rather than the \"enchanting seductress\" as described in the book's promotional chatter.It's not the fault of the translator of the story;  Alison Entrekin should be commended for having endured and made sense of the stream-of-conscioussness prose in the various sections described above.Budapest:  a novel is a European story to be sure, and our narrator a seasoned traveller to boot.  There is an adequate amount of references to the local landmarks of Buda and Pest:  the Chain Bridge, Sugarloaf Mountain, et al...it would be a good read for those readers attempting to learn the Hungarian language, as it mentions the trials and tribulations of learning this most difficult of languages."}, {"review_sentiment": 5.0, "review_text": "I gave this book to my wife because Chico is the best songwriter ever and I wanted her to read something from him. She did some research in her homeland websites and found a Russian reviewer saying this book was the best ever-written. I agree with him. But you gotta understand that this book like a song, few commas, sometimes detailed, sometimes not, and he just keeps going, no stop. At one setence he is thinking how awesome would be to go back to Budapest from Rio de Janeiro, in the other he is in the airport in Hungary. And that's what makes it great, Chico is a musician, he doesn't have to explain anything, but you get it."}, {"review_sentiment": 1.0, "review_text": "This was our book club book last month, I chose it because I was raised in Budapest and was eager to read something that brought back good memories.  This selection didn't cut it by a long shot.  While there was some Hungarian interspersed throughout, the fact that the author failed to once step foot in such a magical city really showed.  Our book club rated this selection with 4 stars on a scale of 10 (10 being a best friend for life and 1 being a shameless waste of paper).  Our readers found the book confusing, sliding from dreams to reality and interchanging characters in the process.  The plot doesn't go anywhere and neither do the characters - a frustrating combination.  The agony was cut short by the fact that it was a quick read.  The artwork for the cover was well done, too bad the content between the two engaging covers didn't provide more structure and development.  Reading this was like watching a fringe foreign film with subtitles that jumps from place to place, character to character without any rhyme or reason.  When it ends you are left scratching your head wondering if you simply \"missed something.\"  In this case, you didn't."}, {"review_sentiment": 4.0, "review_text": "Women are the source of Jose Costa's inspiration, as he envelops himself in words, yet dreams of female comforts, enraptured by the sounds of language, even the brief snatches of Hungarian he has heard while on a stopover in Hungary. He writes about women, on women, inking their skin, arms, legs, torsos. One woman will only let him write backwards; she reads the words in the mirror, then washes them off so he can start over anew: \"Recently written words, with the same speed with which they had been written, ceased to belong to me.\" A ghostwriter in his native Rio, Costas is fascinated with language rather than writers, attuned to the fluidity of language, listening to tapes of those for whom he writes; ingesting their spirit, he flawlessly interprets their lives, those who receive acclaim for what they have not written.In a world where the famous masquerade as authors, their works are, in fact, created by men like Costas, bringing wealth and fame to the so-called authors. Costas takes inordinate pride in this ability, delighting in his private achievements, happy to perform this unique task. Life is fulfilling until he is confronted with the real meaning of such anonymity, his wife in awe of a book he has ghostwritten, but cannot claim. On impulse, he returns to Budapest, takes up with a language instructor, Kriska, who teaches him Hungarian, \"the only tongue the devil respects.\" Once more, language defines him, becomes his obsession, Kriska the source of his knowledge, the muse that feeds his dreams. Back and forth, between two countries, Costas can find purchase in neither, familiarity altered by whichever tongue he speaks, images wrought by his women, Vanda in Rio, Kriska in Budapest.Costas is conversant with loneliness, displacement and his own lack of identity, as though lost in a snow storm that obliterates all but the phrases that swirl through his brain. In a seamless narrative, Buarque transports his protagonist through two worlds, lost in a search for connection but isolated by his own proclivities. This is a shadow world, where talented men create for the inept, willing to market their words, caught up in the pure joy of writing. As each of his carefully constructed personas disintegrates, Costas must choose whether to hide among the clamoring voices of others, or to temporize and claim an opportunity for love. This man is sympathetic, brilliant, often sad, as he navigates the treacherous territory of self. Luan Gaines/ 2005."}, {"review_sentiment": 4.0, "review_text": "While refreshing, this novel does fall into the post-modern conceit of a writer writing whose work gets out of control and turns back against its progenitor. The twist, however, is the ghostwriting angle that Buarque inserts into a by now familiar plot, at least for anyone whose read experimental fiction of the past sixty or seventy years. Actually, I expected more of the Budapest sections, but much of this read takes place in Brasil. A dislocation that the cover art, reversing Rio and Budapest's tourist attractions with their pictorial referents, wittily prepares us for. The allure of alienation, of wishing to immerse ourselves into another tongue and place, comes out beautifully in the narrator's wish to wake up in a locale where he speaks a language everybody understands but himself!The characters he engages with, his wife Vanda, his stepson Joachim, his lover Kriska, her son Pisti, along with Costa's unctuous partner Alvaro and his antagonist of sorts Kasper Krabbe, make for entertaining if at times puzzling antagonists. Buarque wishes apparently to obliquely introduce and manipulate his supporting cast so they appear as elusive as, well, those with whom we come into contact in our everyday world. The combination of the surreal and the quotidian makes here for a satisfying, if somewhat predictable in its climax and resolution, story."}, {"review_sentiment": 4.0, "review_text": "José Costa is a Brazilian with a rather unusual job: he is a ghost writer. Mainly that means that he writes a book and gets paid for doing so, while someone else receives the credit for the job. Costa is married to a successful journalist, and has a son. He is neither terribly happy nor horribly unhappy, but he wants to change his routine. That is probably the reason why he accepts the invitation to the Anonymous Writers' Convention to be held at Istanbul. Costa goes there, and has a wonderful time, but something life-changing happens to him when his airplane somehow gets stranded in Budapest (Hungary) during his returning trip to Rio de Janeiro. He hears the Hungarian language, and feels the need to learn it, to understand what makes it so poetic...Unfortunately that isn't possible, and Costa has to return to Brazil, to his family and to his job. But he won't be able to forget his ardent wish to learn Hungarian, and will even mutter some of it in his sleep. Soon enough, José Costa knows that he is a man with a mission: he must return to Budapest and learn Hungarian, \"rumoured to be the only tongue in the world the devil respects.\". In that trip and in others that will come, Costa will find the meaning of Hungarian, of languages, and of words, and will rediscover the magic of his own language by forbidding himself to speak it for a long time (\"Perhaps it was possible to replace one language with another in my head, little by little, discarding a word for every word acquired. For a time, my head would be like a house undergoing renovations, with new words being hoisted up through one ear and the rubble being lowered down through the other\"). There will be another woman, and another boy, a possible family so similar to his own... All that, in Budapest, the yellow city in Hungary that will compete with Brazil and Rio de Janeiro for Costa's allegiance. Some questions stand out so much that even the reader will have to find an answer of his own. For instance, are we necessarily born into a language, or can we adopt the one that pleases us most?.\"Budapest\" is a strange book, somehow confusing at times, but also deeply engaging. The reader will be interested in Costa's life as he travels once and again between Rio de Janeiro and Budapest, but also on the many reflections on the nature of words, language, life, anonymity and fame that appear in this book. Of course, the author of \"Budapest\" is as peculiar as the book itself. Chico Buarque is a famous Brazilian artist, better known for his music than for his books. Notoriously press-shy, he might even see himself as a kind of José Costa, someone who wants to write just for the sake of it, not needing fame to be happy.Chico wrote this book without having visited Budapest, merely with the help of a dictionary and a tourist guide of that city. Disregarding that, the results were wonderful, something the reader will be able to appreciate even in \"Budapest\"'s translation to English. This translation cannot help but lose some of the charm that is intrinsic to the Portuguese language, despite being very good. All the same, it is as good as one can be, due to the fact that Buarque worked alongside the translator who did it, in order to help when some things had to be rewritten because \"They did not translate\".\"I'm an amateur\" said Chico Buarque in an interview about \"Budapest\". \"It's the same with songs. I'm not a professional. Yet somehow I manage to get away with it\". I think that in this case, as in many other occasions, Buarque is being overly modest. This book is well-worth reading, because it has an interesting plot and a great development of it. Those are the reasons why I recommend it to you  :)Belen Alcat"}]}, "authors": ["Chico Buarque"], "isbn": "0802142141", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Budapest: A Novel", "word_cloud": "follow career song look forward fiction find main character suicidal nearly successful away positive point way paint long dream seem put paper very inspirational heart warm slim lyrical brazilian songwriter musician bit enigma begin relatively conventional manner eventually slip surreal unreliable account probe relationship identity language make intrigue final chapter seem rushed especially relation leisurely pace begin rather abrupt shift pace purpose leave feel miss anything deeper communicate term still think successful similar work strike irrelevant especially pertinent anything outside flight unexpectedly detain becomes enamor hungarian language draw difficulty arise marriage chooses return rather follow wife annual vacation life language country stay month find teacher well point resign idea pick competent yet pedestrian writer crisis leave return wife child expect conventional end story begin odd shape ghostwriter last assignment invent biography wealthy unremarkable man effort turn man celebrity return find wife affair man essentially write existence enamor man word something want entire marriage incense infuriated wife love vicariously man stomp anymore reveal many charm suffice say eventually come doubt reality everything accept fact man ghostwrite create review product page nifty phrase meta textual gimmick describe end seem pretty apt constricts mind finger trap try wriggle delight word game literary paradox find exactly look hang wonder much broader appeal reader interested narrative likely frustrated enjoy literary game probably leave puzzling exercise design end described quirky vacation flaw yet lyrical fun ultimately intent circular track internal logic ever feel connect literary work plot apparent flaw author apparently achieve everything set explore think rather reviewer criticize give enough detail point particular human condition well anonymous central european year old individual tell story great shape half hartedly engage work write others behalf le half heatedly commit family seemingly problem think straight behave coherently seek refuge trouble embrace foreign language foreign woman now respect objective quality work difficult enjoy experience sympathy story teller problem find pretty much none engage action rather typical teenager way force company inebriate delusional person slowly let glimpse true event emerge stream consciousness enervate rather unpleasant find finish anyway reach happy end happy end hero state mental facility author certainly right make relatively short miss opportunity create masterpiece write poem poet probably want mention start read many praise late giant modern literature ultimately worth know continue explore others first introduction author singer composer accord jacket info read time meander lot activity pack short chapter brazilian narrator talk estrange wife write befuddle mode hard fathom follow time essentially frustrate ghost writer suddenly opts take trip fall love mysterious language tongue devil respect act teacher hungarian language continually describe white white shoulder come limp character rather enchant seductress describe promotional fault translator story commend endure make sense prose various section describe european story sure narrator season traveler boot adequate amount reference local landmark al good reader attempt learn hungarian language mention trial tribulation learn difficult language give wife best songwriter ever want something research homeland websites find russian reviewer say best agree get ta understand song comma sometimes detailed sometimes keep go sentence thinking awesome back airport make great musician explain anything club last month choose raise eager something bring back good memory selection cut long shot intersperse fact author fail step foot magical city really show club rat selection star scale best friend life shameless waste paper reader find confuse slide dream reality interchange character plot go anywhere neither character frustrate combination agony cut short fact artwork cover well do bad content engage cover provide structure development read watch fringe foreign film subtitle jump place place character character rhyme reason end leave scratch head wonder simply miss something case source inspiration envelop word yet dream female comfort enrapture sound language even brief snatch hungarian heard stopover write woman woman ink skin arm legs torso woman write backwards read word mirror wash start anew recently write word speed write cease ghostwriter native fascinate language rather writer attune fluidity language listen tape write ingest spirit flawlessly interpret life receive acclaim world famous masquerade author work fact create men bring wealth fame author take inordinate pride ability delight private achievement happy perform unique task fulfilling confront real meaning anonymity wife awe ghostwritten claim impulse return take language instructor teach tongue devil respect once language defines become obsession source knowledge muse feed dream back forth country find purchase familiarity alter tongue speaks image work woman conversant loneliness displacement lack identity lose snow storm obliterate phrase swirl brain seamless narrative transport protagonist world lose search connection isolate proclivity shadow world talented men create inept willing market word catch pure joy writing carefully construct persona disintegrate hide clamor voice others temporize claim opportunity love man sympathetic brilliant often sad navigates treacherous territory self refresh fall conceit writer write work get turn back progenitor twist however ghostwrite angle insert familiar plot least anyone experimental fiction sixty seventy year actually expect section much take place dislocation cover art reverse tourist attraction pictorial referent wittily prepare allure alienation wish immerse tongue place come beautifully narrator wish wake locale speaks language everybody understand character engage wife stepson lover son unctuous partner antagonist sort make entertain time puzzle antagonist wish apparently obliquely introduce manipulate support cast appear elusive well come contact everyday world combination surreal quotidian make satisfy somewhat predictable climax resolution story rather unusual job ghost writer mean write get pay someone else receive credit job marry successful journalist son terribly happy horribly unhappy want change routine probably reason accepts invitation anonymous hold go wonderful time something happen airplane somehow get stranded return trip hear hungarian language feel need learn understand make poetic possible return family job able ardent wish learn even mutter sleep enough know man mission learn rumor tongue world devil trip others come find mean hungarian language word rediscover magic language forbid long time perhaps possible language head little little discard word word acquire time head house undergo renovation new word hoist ear rubble lower woman boy possible family similar yellow city compete allegiance question stand much even answer instance necessarily born language please strange somehow confusing time also deeply engage interested life travel also many reflection nature word language life anonymity fame course author peculiar famous brazilian artist better know music notoriously even kind someone want write sake need fame write visited merely help dictionary tourist guide city result wonderful something able appreciate even translation translation help charm intrinsic portuguese language good good due fact work alongside translator order help thing rewrite translate amateur say interview songs professional somehow manage away think case many occasion barque overly modest reading interest plot great development reason recommend", "genres": ["Fiction & Literature"], "summary": "Perhaps Brazil’s most influential and beloved composer and musician, Chico Buarque is also a highly praised poet, playwright, and novelist. In Budapest, Buarque introduces the story of a ghostwriter who immerses himself in the Hungarian language. \r\n\r\nJosé Costa lives in Rio de Janeiro. Fated to remain in the shadows of his illustrious clients, Costa breaks free of this fate and spontaneously buys a ticket to Budapest. In the city by the Danube, he falls in love with a strangely enchanting woman named Kriska, who offers to teach him the Magyar language in the most intimate of ways. \r\n\r\nFirst, however, he must observe the old proverb “There is no life outside Hungary” and abandon his thoughts of samba, sunbathers on Ipanema, Sugarloaf Mountain, and his wife in Rio, to turn himself over to a strange, hallucinogenic world of pumpkin rolls, late-night discos in old Buda, endless bottles of Trojak wine, and, of course, Kriska, the willful seductress and disciplinarian who is as hard to fathom and tame as the language she speaks. \r\n\r\nBut what will become of José, now Zsoze, when his time in Budapest comes to an end and life as he knows it is turned upside down?", "asin": "B002ICN2L2", "rank": 0, "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/31lF3dG%2BkkL.jpg", "country": "Budapest", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}