{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 28, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "Do not let anyone under the age of 18 read this book. It is very graphic and at times very disturbing."}, {"review_sentiment": 5.0, "review_text": "A must read for Henry Miller fans. Not for prudes. Every type of sexuality known to man. Some only known to space men!"}, {"review_sentiment": 5.0, "review_text": "Henry Miller wrote this in the days when he needed to make a quick buck. This is not part of his mainstream work. It is, simply and explicitly, porn!  He got paid a dollar a page for writing this. Back then, before porn dvd's and the Internet, you could buy the basic, soft core mags, available at any news stand, or go to the porn store and get the \"hard stuff' (pun accidental but I like it) like the mags imported from Sweden and reel to reel porn movies (without sound!) . There were also paperback books, which were just an excuse for something \"dirty\" to read. The stories were written by men with very little talent as writers. It was just a way to make a few bucks. This is what Henry Miller has written here. A \"dirty\" book. Except that the man was talented as hell and couldn't help writing LITERATURE. This is Miller at his raunchiest and least reserved (if you could ever call him reserved). From the first page he gets you into the most outrageous sexual situations. It's all in here - and more!"}, {"review_sentiment": 5.0, "review_text": "When you stop and look, or read, you'll notice that Henry Miller writes sex (not about sex), it's not in a candid, matter of fact way. When he writes sex, things are blowing up, planets are falling out of orbit and crashing into each other...what is going on? This isn't erotica in any ordinary sense, this is Miller crashing through our culture. Is it perverted, obscene? Yes. Is it well written? Of course. Is it nuts? You better believe it! Only Romance of Lust, an Anonymously written book, comes close to the lustful zaniness of Under the Roofs of Paris, and even that falls short to Miller's talent. Highly recommended."}, {"review_sentiment": 5.0, "review_text": "The inspiration to all the erotica I'll ever write. This book is so good. Groundbreaking tone of voice."}, {"review_sentiment": 5.0, "review_text": "This is Miller's best book, with Miller doing what he did best, which is to write unabashedly about sex in all of its horny possibilities. I've read Tropic of Cancer and Tropic of Capricorn, along with bits and pieces of a few of his other books. Without fail, I found myself paging ahead looking for \"the good stuff.\" This is a book full of nothing but \"the good stuff.\"If you want to be brave and admit that you like Henry Miller because he was the greatest writer of smut in the history of the English language, then this is the book for you. If you want to disguise that fact with literary pretentiousness, then go ahead and read the rest."}, {"review_sentiment": 5.0, "review_text": "miller will always be a favorite of mine he was never a mainsteam author but what feeling and passion wierd guy"}, {"review_sentiment": 4.0, "review_text": "This book was different than what I normally read. I guess in the time the book was written, it was daily living in other countries. Not my idea of fiction or reality!"}, {"review_sentiment": 1.0, "review_text": "Graphic, sad sex - sad in the sense that they're usually drunk as all get out and no one seems to have any true feelings for anyone at least in what I read. I have a hard time with Miller's portrayal of women as just \"c__ts\" as he calls each and every one it seems. I kept an open mind as best that I could and read a good portion, but it was repetitive and crude.  He may be one of the greats, but this is not."}, {"review_sentiment": 5.0, "review_text": "The politically correct, and narrow-minded culture of \"offendedness\" that this country has become in the past few decades, will never understand our greatest author of the 20th century: Henry Miller. Maybe 2,000 years from now they will dig up our technilogically advanced, but culturally bankrupt society out of the ruins and champion Miller for what he was: the 20th century Shakespeare of the English language."}]}, "authors": ["Henry Miller"], "isbn": "0802131832", "longitude": 2.3514992, "periods": ["1900s"], "title": "Under the Roofs of Paris", "word_cloud": "anyone age graphic time disturb fan not prude type sexuality know man known space men write day need make quick buck part mainstream work simply explicitly get pay dollar page write porn dvd basic soft core mag available news stand go porn store hard stuff accidental like mag import reel reel porn movie sound also paperback something dirty story write men little talent writer way make buck write dirty man talented hell write raunchiest least reserve ever reserved first page get outrageous sexual situation stop look notice write sex sex candid matter fact way write sex thing blow planet fall orbit crash go erotica ordinary sense crashing culture be pervert obscene well write course nut better believe only write come close lustful zaniness even fall short talent recommend inspiration erotica ever good groundbreaking tone voice best best write unabashedly sex horny possibility tropic bit piece fail find page ahead look good stuff full nothing good stuff want brave admit greatest writer smut history language want disguise fact literary pretentiousness go ahead rest miller always favorite mine never mainstream author feel passion weird guy different normally guess time write daily live country not idea fiction reality sad sex sad sense usually drink seem true feeling anyone least hard time portrayal woman call seem keep open mind best portion repetitive crude great politically correct culture offhandedness country become past decade never understand greatest author century year dig technologically advance culturally bankrupt society ruin champion century language", "genres": ["Fiction & Literature", "Erotica"], "summary": "In 1941, Henry Miller, the author of Tropic of Cancer, was commissioned by a Los Angeles bookseller to write an erotic novel for a dollar a page. Under the Roofs of Paris (originally published as Opus Pistorum) is that book. \r\n\r\nHere one finds Miller’s characteristic candor, wit, self-mockery, and celebration of the good life. From Marcelle to Tania, to Alexandra, to Anna, and from the Left Bank to Pigalle, Miller sweeps us up in his odyssey in search of the perfect job, the perfect woman, and the perfect experience.", "asin": "0802131832", "rank": "1224684", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51XY1WSqBVL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}