{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 221, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Fabulous story teller."}, {"review_sentiment": 3.0, "review_text": "Ticks along at a merry pace."}, {"review_sentiment": 4.0, "review_text": "The title of this book is likely the nonstop duration you'll spend reading, spellbound by Meyer's deft ability to draw you in to an increasingly intense and layered plot. Not coy in its complexity, but respectful of its reader \"Thirteen Hours\" will have you tucked away in your reading nook reveling in a great story and, even better, your new fave author. Pick it up, fall in love."}, {"review_sentiment": 5.0, "review_text": "After 7 hrs I thought it must be all clear. But he got me hooked for the other 7 as well."}, {"review_sentiment": 5.0, "review_text": "Again inspector Benny doesn't disappoint. It's amazing how he can take in so much information from interviews and crime scenes and make sense of it all. This book litteraly has you running for your life up and down the streets of Capetown. Very well written with clear explanations of South Africa's many races. Fantastic book, quick paced, you won't be able to put it down until it's finished."}, {"review_sentiment": 5.0, "review_text": "Skillfully written suspense! Allways keeps you guessing as to what is next. You won't be able to put it down."}, {"review_sentiment": 2.0, "review_text": "Deon Meyer is one of my favourite authors."}, {"review_sentiment": 5.0, "review_text": "First time reader of Deon Meyer. The story kept me gripped from page 1. Loved being able to picture where it was all taking place."}, {"review_sentiment": 3.0, "review_text": "Very popular writer, as a SA living abroad I liked best him mentioning places that I recalled or words or mannerisms familiar to me. I felt that the plot was flawed with lots of holes but if you are not a picky reader you will enjoy this."}, {"review_sentiment": 5.0, "review_text": "A page turner with twists and turns until the very end. And even then, you want it to continue. A great crime novel."}]}, "authors": ["Deon Meyer"], "isbn": "0802145450", "longitude": 18.417396, "periods": ["2000s", "Recent Releases"], "title": "Thirteen Hours", "word_cloud": "fabulous story teller tick merry pace title likely nonstop duration spend read spellbound deft ability draw increasingly intense layer plot not coy complexity respectful tuck read nook revel great story even better new fave author fall love hr think get hook well inspector disappoint amaze much information interview crime scene make sense literally run life street very well write clear explanation many race quick pace able finish skillfully write suspense keep guess able favorite author first time story keep gripped page love able picture take place very popular writer live abroad like best mentioning place recall word mannerism familiar felt plot flaw lot hole picky enjoy page turner twist turn end even want continue great crime", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 2/5 in Benny Griessel\r\n\r\nFast-paced, powerful, tender and suspenseful, Thirteen Hours is a blisteringly good novel from one of the major crime writers on the world stage.\r\n\r\nSome would call Detective Benny Griessel a legend. Others would call him a drunk. Either way, he has trodden on too many toes over the years ever to reach the top of his profession, and now he must concentrate on staying sober and mentoring the next generation of crime fighters - from the many ethnic backgrounds that make up South Africa. \r\n\r\nBut when an American backpacker disappears in Capetown, panicked politicians know who they have to call: Benny has just thirteen hours to save the girl, save his career - and crack open a conspiracy which threatens the whole country.\r\n\r\n\"What makes this novel so outstanding is its setting... and Meyer's superlative talent for suspense... Above all though, this is a vigorous, exciting novel that combines memorable characters and plot with edge-of-the-seat suspense.\" The Sunday Times", "asin": "0802145450", "rank": "307633", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/51KbRKCPCML.jpg", "country": "RSA", "story_arc": ["Tragedy", "Things only get worse"]}