{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 149, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Brilliant author."}, {"review_sentiment": 5.0, "review_text": "You gotta read this guy. I read his \"Ten Little Indians\" before this book. Alexie's work has been a revelation to me, and I think his novels have taught me more about American INdians than any course I could take. Amazing."}, {"review_sentiment": 5.0, "review_text": "This was a really great book and was hard to put down. The main character, John Smith, was raised by a good family but he struggles throughout his life dealing with the fact that he is a Native man who was raised by Whites.  On top of his identity crises, John also starts to show signs of mental illness and soon starts to spiral out of control.Nobody knows who the Indian Killer is and Seattle is in a panic. Racial tensions are high as more and more White people are found gruesomely murdered throughout the city. Will John ever be caught?"}, {"review_sentiment": 4.0, "review_text": "Is Alexie a prophet? A couple aspects of the book seem prescient. The book is both funny and grim. It explains the pain of appropriation better than most. So many significant issues are raised in a way that may seem a bit heavy-handed, but likely necessary."}, {"review_sentiment": 5.0, "review_text": "An interesting read, I love the details of the wannabe Indians so true of how they act! Loved this book and cannot wait to read more of the authors books."}, {"review_sentiment": 4.0, "review_text": "bleak and terrifying but well written.  haven't really read anything quite like it."}, {"review_sentiment": 5.0, "review_text": "Killer writing from a killer author! Loved the ending. Ther is Magic in the skies writing. And I was really thrilled to see that he went into the mystery genre genre. As always he does a wonderful job with a new fresh spin on a old murder  mystery genre."}, {"review_sentiment": 5.0, "review_text": "Yes, I read Indian Killer by Sherman Alexie and loved it. I appreciated it because it educated me on the plight of the American Indian. Since I was a child, I thought about them every Thanksgiving. I have always viewed them as people just like everybody else. Reading his book has made me more appreciative of my writings ( Notes) and Video on Facebook, and my Video on Youtube.com entitled the Movement For Fairness...It is denied to anybody and everybody regardless of who they are to change the past. All anybody can do is work from that point on. I think we should Unite regardless of Religion, Religion Beliefs, Race, Creed, Color or Ethnic Background to help make Justice a Reality for all. We should all get involved in improving Racial Harmony, and making this a Fair place for everybody."}, {"review_sentiment": 5.0, "review_text": "Many Sherman Alexi books are funny. The Indian Killer had little humor, but plenty of intrigue and action. Who is the Indian Killer? Will he strike again? When?"}, {"review_sentiment": 2.0, "review_text": "I didn't like it and the writing needed editing."}]}, "authors": ["Sherman Alexie"], "isbn": "0802143571", "longitude": -122.3300624, "periods": ["1900s"], "title": "Indian Killer", "word_cloud": "author get ta guy ten little work revelation think novel taught american course really great hard put main character raise good family struggle life deal fact man raise white top identity crisis also start show sign mental illness soon start spiral know panic tension high people find gruesomely murder city ever catch be prophet couple aspect seem funny grim explain pain appropriation better so many significant issue raise way bit likely necessary interesting love detail wannabe true act wait author bleak terrify well write really anything quite write author love end sky write really thrill go mystery genre genre always wonderful job new fresh spin old murder mystery genre love appreciate educate plight american child think thanksgiving always view people everybody else make appreciative writing note entitle deny anybody everybody regardless change anybody work point think regardless help get involve improve racial make place everybody many funny little humor plenty intrigue action strike like write need editing", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "“Part thriller, part magical realism, and part social commentary, Indian Killer . . . lingers long past the final page.” Seattle Weekly\r\n\r\nA national best seller, Indian Killer is arguably Sherman Alexie’s most controversial book to date—a gritty, racially charged literary thriller that, over a decade after its first publication, remains an electrifying tale of alienation and justice. A serial murderer called the Indian Killer is terrorizing Seattle, hunting, scalping, and slaughtering white men. Motivated by rage and seeking retribution for his people’s violent history, his grizzly MO and skillful elusiveness both paralyze the city with fear and prompt an uprising of racial brutality. Out of the chaos emerges John Smith. Born to Indians but raised by white parents, Smith yearns for his lost heritage. As his embitterment with his dual life increases, Smith falls deeper into vengeful madness and quickly surfaces as the prime suspect. Tensions mount, and while Smith battles to allay the anger that engulfs him, the Indian Killer claims another life. \r\n\r\nWith acerbic wit and chilling page-turning intensity, Alexie takes an unflinching look at what nurtures rage within a race both colonized and marginalized by a society that neither values nor understands it.", "asin": "0802143571", "rank": "211972", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/61Bq-aXE0hL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}