{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 22.2793278, "ratings": {"num_ratings": 18, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "This was a book that our book club read. The second half of the book was better than the first half. While the book was narrated by a child I didn't believe that a child would have had those thoughts. I later learned that the book started out as a biography and then turned into a fictional novel. That explains the change about half way through the book. It wasn't bad but I think it could or should have been better. Our facilitator for the book club said that the author's second book was much better."}, {"review_sentiment": 5.0, "review_text": "A beautifully written and lyrical account of a young girl's coming-of-age in Hong Kong during the Vietnam War era. The story, littered with the flavors of the Hong Kong and imagined Vietnam landscapes, is filled with loss, failure, desperation, and heat,humidity, colors and smells of an exotic and, at times, dangerous location. The writing is so dreamy, the images so vivid that it's impossible not to get sucked down inside this hazy and unstable world. Narrated by Katie, the youngest sister, the sections between the two sisters are heartbreaking and wise, bittersweet and honest beyond Katie's years.But it is the writing that pulls the story forward. \"Kissing the deaf boy is like tasting the sea,\" Greenway writes. \"It's like forgiveness.\"And later, \"Even my mother's afraid. Afraid of Frankie's body, the raw, animal power of her daughter's want. Overwhelming. Devouring. So hungry, it excludes everything else.\"\"White Ghost Girls\" is a powerful and haunting read."}, {"review_sentiment": 5.0, "review_text": "very nice but sad book- Fast shipping"}, {"review_sentiment": 4.0, "review_text": "This is a lovely book, double-filtered through the eyes of a grown woman looking back and re-living the memories of a thirteen-year-old girl. Sometimes the action is literally underwater;  sometimes it only feels that way, as Kate and her sister Frankie move languorously through the thick, humid air of a Hong Kong summer. The relationships between Kate, her sister, their parents, their Chinese nanny, and others are seen as though through the limited awareness and understanding of a 13-year-old, but always shadowed by the grown-up Kate's awareness of what ultimately will happen. The book is short and not a word is wasted.  Why only four stars?  Because I wanted to know more about the grownup Kate, and how the events of this summer echoed down the canyons of her life.  We get a hint,  not enough. But maybe that's another book."}, {"review_sentiment": 4.0, "review_text": "I just finished reading this book for a bookclub and will read it again for the sheer beauty of the writing.  I am sure that we will hear more of Alice Greenway.  I enjoyed the exotic setting, the heat that permeates everything, the characters.  It could be a coming-of-age story but it is so much more."}, {"review_sentiment": 5.0, "review_text": "After finishing the book last night, I started re-reading it this morning -- first time I've done that.  A masterpiece."}, {"review_sentiment": 2.0, "review_text": "I found this story sad. This story was a quick read. I found the main character sincere and sweet. The relationship with the sisters was awkward. The parents were absent and completely obvious to there children ' s needs."}, {"review_sentiment": 4.0, "review_text": "Read it twice. I never have done that before but it was much better the second time. Very descriptive yet poignant."}, {"review_sentiment": 4.0, "review_text": "It is 1967 and Kate and Frankie are sisters from America, growing up in Hong Kong  while their father is a war photographer for Time Magazine.  The girl's mother, often overwhelmed with the war, and reality itself, seeks comfort in painting.  In her paintings she created an alternative \"now\" and she fully embraces it and wishes her daughters would too.The girls are watched mainly by their amah (a woman employed as a servant) and find it quite easy to escape beyond her attention, and do exploring of this world they live in on their own.  While swimming they find a floating body of a Chinese girl and at that point their innocence seems to take a turn.  As the summer progresses, Frankie becomes more reckless and an incident causes someone to die and younger sister Kate becomes the keeper of secrets.'  '  'Taking a deep breath, I have to honestly say it took me a couple of times to get going into this book.  While written in almost a poetic manner (page one was beautifully written), I found it to almost drone on and I was lost within the words - and not within the story.The book is told by younger sister Kate. Kate is 12.  The sisters left under so little supervision get into a lot of trouble, especially Frankie who lacks the parental attention she needs, starts to find it in the male friends of her fathers.  I found myself on one hand angry at their mother for being so absent, buried in her paintings while her daughters strayed into dangerous areas, and on the other hand taking pity on the woman who was obviously overwhelmed by all that had become of her dreams.While I never found the book riveting, in the end I have to say I am glad I read it.  My favorite part of this read was the incredible detailing.  Author Alice Greenway writes of a Hong Kong that I could see with vivid colors and descriptive smells that made me feel as thought I was standing outside the bakery myself peering in at two sisters, Kate and Frankie.A poetic type read that I am glad I picked up and finished.  In reality, a wonderful first novel."}, {"review_sentiment": 5.0, "review_text": "Strong characters, vivid descriptions of Hongkong scenes, good pacing - I still can't believe this is her first novel. I loved the book and would recommend it to anyone. It's a good book with a powerful ending that I still remember to this day."}]}, "authors": ["Alice Greenway"], "isbn": "0802170188", "longitude": 114.1628131, "periods": ["1900s", "Recent Releases"], "title": "White Ghost Girls", "word_cloud": "club second half better first half narrated child believe child later learn start biography turn fictional explain way bad think facilitator club say author second much better beautifully write lyrical account young girl era story litter flavor imagine landscape fill loss failure desperation heat humidity color smell exotic time dangerous location writing dreamy image vivid impossible get suck hazy unstable world youngest sister section sister heartbreaking wise bittersweet honest write pull story forward deaf boy taste sea write forgiveness later even mother afraid body raw animal power daughter want overwhelm hungry excludes everything else powerful haunting nice sad shipping lovely eye grow woman look memory girl action literally underwater sometimes feel way sister move languorously thick humid air summer relationship sister parent chinese nanny others see limited awareness understanding always shadow awareness ultimately happen short word waste star want know grownup event summer echoed canyon life get hint enough maybe finish read book club sheer beauty write sure hear enjoy exotic setting heat permeates everything character story much finish last night start morning first time do masterpiece find story sad story quick find main character sincere sweet relationship sister awkward parent absent completely obvious child need twice never do much better second time descriptive yet poignant sister grow father war photographer girl mother often overwhelm war reality seek comfort paint painting create alternative fully embrace wish daughter watch mainly aah woman employ servant quite easy escape attention explore world live swim find float body chinese girl point innocence seem take turn summer progress become reckless incident cause someone die younger sister become keeper secret deep breath honestly say take couple time get go write almost poetic manner page beautifully write find almost drone lose word told younger sister sister leave little supervision lot trouble especially lack parental attention need start find male friend father find hand angry mother absent bury painting daughter stray dangerous area hand take pity woman obviously overwhelm become never find rivet end say glad favorite part incredible detail write vivid color descriptive smell make feel thought stand outside bakery peer sister poetic type glad pick finish reality wonderful first strong character vivid description scene good pacing still first love anyone good powerful end still day", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Summer 1967. The turmoil of the Maoist revolution is spilling over into Hong Kong and causing unrest as war rages in neighboring Vietnam. White Ghost Girls is the story of Frankie and Kate, two American sisters living in a foreign land in a chaotic time. With their war-photographer father off in Vietnam, Marianne, their beautiful but remote mother, keeps the family close by. \r\n\r\nAlthough bound by a closeness of living overseas, the sisters could not be more different — Frankie pulses with curiosity and risk, while Kate is all eyes and ears. Marianne spends her days painting watercolors of the lush surroundings, leaving the girls largely unsupervised, while their Chinese nanny, Ah Bing, does her best to look after them. One day in a village market, they decide to explore — with tragic results. \r\n\r\nIn Alice Greenway’s exquisite gem of a novel, two girls tumble into their teenage years against an extraordinary backdrop both sensuous and dangerous. This astonishing literary debut is a tale of sacrifice and solidarity that gleams with the kind of intense, complicated love that only exists between sisters.", "asin": "0802170188", "rank": "1160843", "city": "Hong Kong", "image": "https://images-na.ssl-images-amazon.com/images/I/41oKYehb0yL.jpg", "country": "China", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}