{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 20, "rating": 3.3, "reviews": [{"review_sentiment": 2.0, "review_text": "Some of the language was poetic, but there is very little that happens. The novel didn't leave me with much and I wouldn't recommend."}, {"review_sentiment": 4.0, "review_text": "I felt a need to weigh in here. People are upset about its literary value because the protagonist isn't deeply developed, but I think she is simply the narrator and the main character here is the city of Berlin. One could read it on its surface and find a charming enough story that seems odd at times, or delve into the symbolism and appreciate the magic realism (or is it simply a metaphor for a city coming to grips with its past?). I read it twice -once before spending a month in Berlin and again after. I appreciated it a lot more the second time around.  This is certainly an ode to a fascinating city that I feel may not be fully appreciated by those who haven't experienced its wonder. That may sound pretentious, sorry, but like I said, I felt I got more out of the book after spending some time in Berlin."}, {"review_sentiment": 2.0, "review_text": "Strong characters, no plot"}, {"review_sentiment": 4.0, "review_text": "The writer's ability as a wordsmith is very evident. Her descriptions are very compelling. I wonder if her omission of description of the heroine of her story is a deliberate one, as I found it difficult to empathize with her. Perhaps the author does not choose to have her readers get any closer to the central actor in her story than the character chooses to allow anyone to get close to her. The chacter is obvious suffering from severe mental problems, and is coping as best she can."}, {"review_sentiment": 5.0, "review_text": "Berlin is one of my favorite cities--having spent several weeks there over the past two summers. And although I've never lived there--on some levels I could relate to Tatiana's experience. Aridjis' novel is engaging, unexpected, and rich in detail. Some readers may not appreciate the lack of a hard plot--but I thoroughly enjoyed delving into Tatiana's thoughts, her relationship with the relatively small number of Berliners in her life, and Tatiana's relationship with the city."}, {"review_sentiment": 5.0, "review_text": "I read this book when it first came out, but right about now I think I'm ready to retread it, as it's that kind of book! From childhood, when I get my hands on a juicy good book, I get sadder as I come to the end of it, wishing it would not be ending soon! This is that kind of book. Vivid detail, well narrated, a great way to go back to Berlin if you've been there before, or if you've never been there, read it before you go! The city itself is kind if a character in the book. Very poetic and well written. There is an eerie loneliness to the young natrator that is quite haunting and somehow perfecr for the Berlin setting...You'll finish it wondering when the author will come up with her next great work!"}, {"review_sentiment": 4.0, "review_text": "Beautiful prose with moments of great tenderness and imagination, summed up best by Anis Shivani in the Huffington Post:  \"Aridjis is in serious dialogue with any number of world literary traditions. It is a novel that couldn't be imagined without the ferocious expressionism of the Weimar years and the subdued modernism of Bernhard or Handke.\""}, {"review_sentiment": 2.0, "review_text": "After reading about the book and the young author I really wanted to like it.  But page by page I found myself veering from dumbfounded by the banality of her observations of such a strange and wondrous city as Berlin (whole passages read like a hip guide-book) to bored: the main character, an friendless foreigner with a lackluster life, is practically a non-entity- not a good choice unless you're Franz Kafka or Jerzy Kosinski and can instill such a person with an incredible inner monologue.  The plot has some surprising semi-surreal moments which, rather than draw the reader in, work instead to keep everything feeling very superficial.  It's obvious the author is struggling to fill space and there are too many throw-away minor plot elements (quick asides about failed friendships or life back in Mexico) which are neither funny nor insightful and ultimately interrupt the flow of the novel.  The entire book is, unfortunately, a very \"lite\" affair (the title is appropriate in this sense)."}, {"review_sentiment": 3.0, "review_text": "A slightly surrealistic novel about a young woman's stay in Berlin. Very well written, with only three characters. Some is clearly based on the author's own life. Fine book if you're okay with magical realism. If not, not."}, {"review_sentiment": 2.0, "review_text": "\"Book of Clouds\" is literary-lite, in the extreme.  It is written in a very pedestrian, seventh-grade reading level prose.  The story (such as it is)is simplistic and shallow, and almost completely lacking in literary invention.  I say almost, because it is not until the end of the novel that the reader encounters the only memorable and imaginative scene in the entire novel - an almost magical scene involving clouds.  Considering how highly educated the author is, the book is surprisingly benighted, and as such, only a notch above run-of-the-mill \"Chick Lit\".  This novel is not, I repeat, is not on a par with the likes of such truly literary writers as: Duras, or Elfriede Jelinek, or Nathalie Sarraute."}]}, "authors": ["Chloe Aridjis"], "isbn": "0802170560", "longitude": 13.3888599, "periods": ["1900s"], "title": "Book of Clouds", "word_cloud": "language poetic little happen leave much felt need weigh people upset literary value protagonist deeply develop think simply narrator main character city charming enough story seem odd time delve symbolism appreciate magic realism simply metaphor city come grip twice spend month appreciate lot second time certainly ode fascinate city feel fully experienced wonder pretentious sorry say felt get spend time strong character plot writer ability wordsmith evident description compel wonder omission description heroine story deliberate find difficult empathize perhaps author choose reader get closer central actor story character choose allow anyone get close chaster obvious suffer severe mental problem cop best favorite city spend several week summer never live level experience engaging unexpected rich detail reader hard plot thoroughly enjoyed delve thought relationship relatively small number life relationship city first come right think ready retread kind childhood get hand juicy good get sadder come end wishing end soon kind detail well narrated great way go back never go city kind character poetic well write eerie loneliness young narrator quite haunt somehow perfect setting finish wonder author come next great work prose moment great tenderness imagination sum best serious dialogue number world literary tradition ferocious expressionism year subdue modernism read young author really want page page find veer dumbfounded banality observation strange wondrous city whole passage hip bore main character friendless foreigner lackluster life practically good choice person incredible inner monologue plot surprising moment rather draw work instead everything feel superficial obvious author struggle fill space many minor plot element quick aside fail friendship life back funny insightful ultimately interrupt flow entire unfortunately lite affair title appropriate sense slightly surrealistic young woman well write character clearly base author life okay magical realism extreme write pedestrian read level prose story simplistic shallow almost completely lacking literary invention say almost end encounter memorable imaginative scene entire almost magical scene involve consider highly educate author surprisingly benight notch repeat par like truly literary writer", "genres": ["Fiction & Literature"], "summary": "Book of Clouds is a haunting, masterfully wrought debut novel about a young woman adrift in Berlin, where a string of fateful encounters leads to romance, violence, and revelation. \r\n\r\nHaving escaped her overbearing family a continent away, Tatiana settles in Berlin and cultivates solitude while distancing herself from the city’s past. Yet the phantoms of Berlin—seeping in through the floorboards of her apartment, lingering in the abandoned subterranea—are more alive to her than the people she passes on her daily walks. \r\n\r\nWhen she takes a job transcribing notes for the reclusive historian Doktor Weiss, her life in Berlin becomes more complex—and more perilous. Through Weiss, she meets Jonas, a meteorologist who, as a child in the GDR, took solace in the sky’s constant shape-shifting, an antidote to his grim and unyielding reality. As their three paths intersect and merge, the contours of all their worlds change, culminating in an act of violence that will leave none of them untouched. \r\n\r\nUnfolding with the strange, charged logic of a dream, Book of Clouds is a profound portrait of a city forever in flux, and of the myths we cling to in order to give shape to our lives.  ", "asin": "0802170560", "rank": "1045852", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/41hy5wphPWL.jpg", "country": "Germany", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}