{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 269, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Solid page turner set in an interesting international location."}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 5.0, "review_text": "I think it was my favorite so far."}, {"review_sentiment": 5.0, "review_text": "Love the author."}, {"review_sentiment": 4.0, "review_text": "Love the series"}, {"review_sentiment": 5.0, "review_text": "A admit to being a fan of Donna Leon's Brunetti books.  She combines the details of the story, descriptions of parts of the enchanting city of Venice, with great humor and elegance.  I wonder what the view of the Venice police are, of this series?  There you have the useless Alvise, the pompous fool, Patta and the ever philosyphising Vianello, and the enchanting Elettra.  Good stories with interesting characters and wonderful humor.  Not enough is said about how humorous Leon can be.  I often laugh out loud with her books.  Thanks Donna!"}, {"review_sentiment": 5.0, "review_text": "I like Leon's writing."}, {"review_sentiment": 5.0, "review_text": "Good read"}, {"review_sentiment": 5.0, "review_text": "Excellent! Well-written, \"family friendly,\" and I had difficulty putting it down."}, {"review_sentiment": 5.0, "review_text": "Donna Leon's stories are very good. What shines for me, though, is her descriptions, which range from the physical environment to the emotional/psychological experiences of her characters. I am going through highlighting her many passages that are examples of stellar writing."}]}, "authors": ["Donna Leon"], "isbn": "0802146023", "longitude": 12.3345898, "periods": ["1900s"], "title": "Death in a Strange Country: A Commissario Guido Brunetti Mystery", "word_cloud": "solid page turner set interesting international location great think favorite far author series admit fan combine detail story description part enchant city great humor elegance wonder view police series useless pompous fool ever philosophize enchant story interest character wonderful humor not enough say humorous often laugh loud like write good excellent family friendly difficulty put story good shin description range physical environment experience character go highlight many passage example stellar write", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 2/24 in the Commissario Brunetti Series\r\n\r\nEarly one morning Commissario Guido Brunetti of the Venice Police confronts a grisly sight when the body of a young man is fished out of a fetid canal. All the clues point to a violent mugging, but for Brunetti the motive of robbery seems altogether too convenient. When something is discovered in the victim’s apartment that suggests the existence of a high-level conspiracy, Brunetti becomes convinced that somebody is taking great pains to provide a ready-made solution to the crime.\r\n\r\nRich with atmosphere and marvelous plotting, Death in a Strange Country is a superb novel in Donna Leon’s chilling Venetian mystery series.\r\n\r\n“What makes Leon’s work especially unnerving is the sense that corruption is a continuing process. . . . The characters of Brunetti and his family continue to deepen throughout this series.” The Times (UK)", "asin": "0802146023", "rank": "84717", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/5136VNVH-vL.jpg", "country": "Italy", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}