{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 145, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Every once in a while you come acrossed a book that is so vastly superior to that which you normally read, that you know how hat you will read it again and again."}, {"review_sentiment": 5.0, "review_text": "Originally I ordered this book for a class and was dreading reading it.  But, as I read the story swallowed me whole and really made an impact.  This story is unlike so much I have read, I highly recommend this book for anyone and everyone.  I don't want to say too much about the plot because you need to read it to fully appreciate what happens and whats going on.  I will say this:  It is a story about Passion, love, infatuation, how people steal your heart and never give it back.  It is not a \"romance novel\" that you buy for 99 cents at a dollar store, its a very real story that is about all different kinds of love, not just romantic.  This story is historical fiction but written like fantasy.  Great characters and an amazing plot.  If I could read this again for the first time, I would."}, {"review_sentiment": 5.0, "review_text": "Brilliant. Deceptively light but ultimately so powerful."}, {"review_sentiment": 1.0, "review_text": "Longest 169(?) page book I have ever read!"}, {"review_sentiment": 5.0, "review_text": "Magical and romantic."}, {"review_sentiment": 5.0, "review_text": "Beautifully written. One of my favorite books. I love her use of language and imagery."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed this book. The writing was enchanting and the story really drew me in. I am glad I purchased it."}, {"review_sentiment": 1.0, "review_text": "Read as a book club selection, would not have chosen to read.  Now on to something I can enjoy! E. Stroud perhaps...."}, {"review_sentiment": 5.0, "review_text": "This book taught me to never get married 10/10"}, {"review_sentiment": 1.0, "review_text": "Not my type of book. I kept thinking is this really what happened in the 1700?"}]}, "authors": ["Jeanette Winterson"], "isbn": "0802135226", "longitude": 12.3345898, "periods": ["1800s"], "title": "The Passion", "word_cloud": "come cross vastly superior normally know hat originally order class dread read story swallow whole really make impact story much highly recommend anyone everyone want say much plot need fully appreciate happens go say story infatuation people steal heart never give romance buy cent dollar store real story different kind love romantic story historical fiction write fantasy character amaze plot time light ultimately powerful page ever magical romantic beautifully write favorite love use language imagery really enjoy write enchant story really draw glad purchase club selection now something enjoy shroud perhaps taught never married not type keep think really happen", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Jeanette Winterson’s novels have established her as one of the most important young writers in world literature. The Passion is perhaps her most highly acclaimed work, a modern classic that confirms her special claim on the novel. \r\n\r\nSet during the tumultuous years of the Napoleonic Wars, The Passion intertwines the destinies of two remarkable people: Henri, a simple French soldier, who follows Napoleon from glory to Russian ruin; and Villanelle, the red-haired, web-footed daughter of a Venetian boatman, whose husband has gambled away her heart. In Venice’s compound of carnival, chance, and darkness, the pair meet their singular destiny.\r\n\r\nIn her unique and mesmerizing voice, Winterson blends reality with fantasy, dream, and imagination to weave a hypnotic tale with stunning effects.", "asin": "0802135226", "rank": "168239", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51C4AbKRaHL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}