{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 306, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "Not a page turner but I still liked it. It read kinda dumb. I wouldn’t recommend thus book as there are plenty of better books that that I’ve connected with."}, {"review_sentiment": 5.0, "review_text": "amazing book"}, {"review_sentiment": 3.0, "review_text": "It really wasn't any special but I have read worse. The book was entertaining in a way, but not in the good way."}, {"review_sentiment": 3.0, "review_text": "Good book except for the ending. Author left you hanging."}, {"review_sentiment": 3.0, "review_text": "ok"}, {"review_sentiment": 3.0, "review_text": "Absorbing and intriguing; I was loving this memoir and then it abruptly ended!  Disappointed."}, {"review_sentiment": 4.0, "review_text": "I found myself immersed in the thoughts and emotions of the characters of this book and i found the story and experiences to be incredibly relatable, overall a great read"}, {"review_sentiment": 5.0, "review_text": "My son had to read this for high school---"}, {"review_sentiment": 5.0, "review_text": "What a great read, one of the best books of all time"}, {"review_sentiment": 5.0, "review_text": "GREAT BOOK.!"}]}, "authors": ["Tobias Wolff"], "isbn": "0802136680", "longitude": -122.3300624, "periods": ["1900s"], "title": "This Boy's Life: A Memoir", "word_cloud": "not page turner still like kinda dumb recommend thus plenty better connect amaze really special worse entertaining way good way good end leave hang ok absorb intrigue love abruptly end disappoint find immerse thought emotion character find story experience incredibly repeatable overall great son high school great best time great", "genres": ["Memoir"], "summary": "This unforgettable memoir, by one of our most gifted writers, introduces us to the young Toby Wolff, by turns tough and vulnerable, crafty and bumbling, and ultimately winning. \r\n\r\nSeparated by divorce from his father and brother, Toby and his mother are constantly on the move, yet they develop an extraordinarily close, almost telepathic relationship. \r\n\r\nAs Toby fights for identity and self-respect against the unrelenting hostility of a new stepfather, his experiences are at once poignant and comical, and Wolff does a masterful job of re-creating the frustrations and cruelties of adolescence. \r\n\r\nHis various schemes - running away to Alaska, forging checks, and stealing cars - lead eventually to an act of outrageous self-invention that releases him into a new world of possibility.", "asin": "0802136680", "rank": "23482", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/710PXCTCJ6L.gif", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}