{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 45, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "The best bio I’ve read about M.A. a must read for people interested in learning what and who M.A.was, don’t miss"}, {"review_sentiment": 4.0, "review_text": "Marie Antoinette is one of history’s most famous queens. Yet, Stefan Zweig’s classic biography of this queen tells us that if it was not for the French Revolution Marie Antoinette would most likely be forgotten in history. She would have been like many other French queens that came before her. Stefan Zweig also states that Marie Antoinette was neither a great woman nor a woman who deserved to be hated by the Revolution. Instead, Marie Antoinette was just an average woman who was thrust into the spotlight that the French Revolution cast upon her.  It is obvious that Stefan Zweig had no love for his subject. He portrays her faults and is very critical of her personality. Marie Antoinette is often portrayed as vain, selfish, and a scatterbrain. She enjoys dancing, card games, and plays. She was pretty, charming, and pleasure-seeking. He states that she was always in her own little circle of friends and never reached out to the aristocracy or the poor. This caused her dislike among the aristocracy and the poor. When the time came for the French Revolution. no one wanted to help her. In the French Revolution, she becomes heavily involved in politics and has good diplomacy skills. Despite her adept skills in politics, she was too late. Stefan Zweig has also portrayed Marie Antoinette as haughty. Yet, in the French Revolution, her haughtiness becomes her charm and her strength.  Overall, this was a very detailed biography on Marie Antoinette. While it is a biased biography, it gave me some insight into the people in Marie Antoinette’s life, especially her enemies. I got a better sense of which of her enemies were secret royalists and which were not. Even though Stefan Zweig wrote this biography in the 1930s, it is still mostly accurate. Most of the questions he debates about Marie Antoinette are still being discussed today. It is also very thorough and answers many questions about her life. The writing was very witty, engaging, and humorous at times. I found myself laughing at a couple of his passages. Therefore, Marie Antoinette: The Portrait of an Average Woman reads like a novel. Even though there were a few ideas about Marie Antoinette that I disagreed with, there was a lot of information to be enjoyed. Thus, I recommend this for any Marie Antoinette enthusiast. While Stefan Zweig’s description of Marie Antoinette can be off-putting for of her sympathizers, it is still a worthy read. You can still see why Marie Antoinette: The Portrait of an Average Woman is a beloved classic.(Note: I read an ARC copy of this book in courtesy of Edelweiss.)"}, {"review_sentiment": 5.0, "review_text": "I really enjoyed reading this book. There is a lot of importaint historical facts but you also get to read a lot of personal information about the royal family and what was going on in their heads during their highs and lows. Its more of a novel than a history book and takes you through Marie Antoinette's childhood, marriage, life at Versailles, imprisonment, executions, and ends with a brief insight into the life of her surviving child. This book really humanized the royal family members and you get to know them on a more personal level as opposed to just names in a history book."}, {"review_sentiment": 5.0, "review_text": "Best biography written by an excellent author!"}, {"review_sentiment": 5.0, "review_text": "I bought this as decor it is vintage looking and pretty i also love Marie Antoinette. The book is in French"}, {"review_sentiment": 4.0, "review_text": "A classic historical story which reads like a novel.  It is written by one of the best Austrian historians.  You really get to see the development of the young Marie Antoinette from a pampered princes to an aloof queen and ultimately to a wife and mother trying to save her family. Antoinette is one of the most misunderstood historical characters, this book brings her to life. I fell in love with the story the first time I read it and it only got better when I re-read it a decade later."}, {"review_sentiment": 5.0, "review_text": "Using to read along as I listen to the French version in Audible.  Great book, wonderful condition.  Happy purchaser!"}, {"review_sentiment": 5.0, "review_text": "The only biographie for Marie Antoinette one should consider. Long live Zweig."}, {"review_sentiment": 1.0, "review_text": "This book was a delight to read. Well researched and beautifully written itdoes a wonderful job revealing Marie Antoinette's character and her flaws.The biography gives a unique insight into the court life in France and Austriain the eighteenth century. Stefan Zweig was one of the great writers of thelast century and this book is a tribute to his genius."}, {"review_sentiment": 5.0, "review_text": "Stefan Zweig gives us his interpretation of one of the best known women in history and does so with great skill and expertise.He is criticised by the odd reviewer for taking the Freudian approach....for not giving an accurate account according to historical accounts etc but I disagree. In the postface, Zweig details the \"forgers\" of the times and how he has avoided any incredible documents.He discounts the infamous \"let them eat cake\" and the apology Marie Antoinette supposedly offered to her executioner for stepping on his foot on the scaffold as anecdotal at best and explains how he has attempted to avoid any heresay by consulting archives that were wholly credible.Any historian, or writer who attempts to portray a person who lived centuries in the past is subject to archival evidence and who is to say who has it right or wrong.It is knitpicking at the least to point out the minor discrepancies in this wonderful dialogue.Marie Antoinette comes to life in this biography and Zweig allows all her follies and disastrous decisions to paint her character as well as her goodness and courage, so that at the end we, the reader, can come to our own conclusions about this woman who made, and still continues to make, such a huge impact in history.Through the exchange of letters written by Marie Antoinette and her mother, Maria Theresa of Austria we discover what went through this child's mind during the early years of her reign.Yes....she was spoilt and narcissistic ........yes... she made terrible decisions in her youth. She was misguided and thoughtless and her mother, like all mothers attempted to warn her very young and badly equipped daughter of the disastrous path on which she was headed.However, nothing she did deserved the horror she had to undergo at the hands of the Revolutionists.The poignant last letter, written by Marie Antoinette to her sister-in-law only hours before her death, portrays a desolate and distraught human being expressing only love and understanding as she faced her own mortality.We will never know the absolute Marie Antoinette, but Zweig's biography will get as close as we can to knowing one of the most fascinating women in history.I felt deeply moved by this book and am finding it difficult to get on with my next reading experience as a result."}]}, "authors": ["Stefan Zweig"], "isbn": "0802139094", "longitude": 2.3514992, "periods": ["1700s", "1800s"], "title": "Marie Antoinette: The Portrait of an Average Woman", "word_cloud": "best bio people interested learn miss history famous queen classic biography queen tell french likely history many french queen come also state neither great deserve hated instead thrust spotlight french cast obvious love subject portray fault critical personality often portray vain selfish scatterbrain enjoy dance card game play pretty charm state always little circle friend never reach aristocracy poor cause dislike aristocracy poor time come french want help french become heavily involved politics good diplomacy skill adept skill politics late also portray haughty haughtiness become charm strength detail biography bias biography give insight people life especially enemies get better sense enemies secret royalist even write biography still mostly accurate most question debate still discuss today also answer many question life write witty engage humorous time find laugh couple passage therefore read even idea disagree lot information enjoy recommend enthusiast description sympathizer still worthy still beloved classic note arc copy courtesy really enjoy read lot important historical fact also get lot personal information royal family go head high low history take childhood marriage life imprisonment execution end brief insight life survive child really humanized royal family member get know personal level oppose name history best biography write excellent author buy decor vintage look pretty also love french classic historical story read write best austrian historian really see development young pamper prince aloof queen ultimately wife mother try save family misunderstood historical character bring life fell story first time get better decade later use listen french version wonderful condition purchaser biography consider live delight research beautifully write it does wonderful job reveal character biography give unique insight court life eighteenth century great writer the last century tribute genius give best know woman history great skill criticize odd reviewer take freudian approach give accurate account accord historical account etc disagree post face detail forger time avoid incredible discount infamous let eat apology supposedly offer executioner step foot scaffold anecdotal best explains attempt avoid hearsay consult archive wholly historian writer attempt portray person live century subject archival evidence say right nitpick least point minor discrepancy wonderful come life biography allow folly disastrous decision paint character well goodness courage end come conclusion make still continue huge impact exchange letter write mother go child mind early year spoil narcissistic make terrible decision youth misguide thoughtless mother mother attempt warn young badly equip daughter disastrous path nothing deserve horror undergo hand poignant last letter write hour death portrays desolate distraught human express love understanding face never know absolute biography get close know fascinating woman felt deeply move find difficult get next reading experience result", "genres": ["Biography", "History", "Politics"], "summary": "Life at the court of Louis XVI and Marie Antoinette has long captivated readers, drawn by accounts of the intrigues and pageantry that came to such a sudden and unexpected end. Stefan Zweig's Marie Antoinette: The Portrait of an Average Woman is a dramatic account of the guillotine's most famous victim, from the time when as a fourteen-year-old she took Versailles by storm, to her frustrations with her aloof husband, her passionate love affair with the Swedish Count von Fersen, and ultimately to the chaos of the French Revolution and the savagery of the Terror. \r\n\r\nAn impassioned narrative, Zweig's biography focuses on the human emotions of the participants and victims of the French Revolution, making it both an engrossingly compelling read and a sweeping and informative history. \r\n\r\n\"Certainly no one can arise unmoved from the reading of this powerful work.\" -- The New Republic \r\n\r\n\"Excellent biography.\" -- The New York Times", "asin": "0802139094", "rank": "176062", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/4138j-FtiOL.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}