{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 628, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Love this series. Really enjoy the humanness of the lead character and his interaction with family."}, {"review_sentiment": 5.0, "review_text": "Donna Leon never fails to write a gripping story blended with images of Venice and morsels of literature.  In this book, she adds the cherry on top of the whipped cream by interweaving the tale with the tragic story of Tosca."}, {"review_sentiment": 5.0, "review_text": "Excellant"}, {"review_sentiment": 4.0, "review_text": "I didn't like this quite as much as the few others I've read but still an enjoyable vacation book.I love the inspectors interactions with the office manager. How clear he is about her power and knowledge."}, {"review_sentiment": 3.0, "review_text": "Still a good story, but a little slower than others by this author."}, {"review_sentiment": 3.0, "review_text": "I enjoyed the style and the setting but found the plot quite weak"}, {"review_sentiment": 3.0, "review_text": "I always enjoy Leon's plot development. I do think this one dragged a little bit but understanding (at least I hope it's true!) some of the issues surrounding the production of any musical event kept my attention. I always enjoy hearing more about the Brunetti's and their circle of family/friends/colleagues. As part of the series I would recommend it."}, {"review_sentiment": 5.0, "review_text": "Recommend books one and two,  Death at La Venice and  Falling in love. Venice is the star here so long with Detective Brunetti, a well-drawn cbaracter."}, {"review_sentiment": 5.0, "review_text": "Always LOVE Donna Leon's books!!  This was a bit different from the others in the series, as this focused on only one situation.  Usually, she has a more story plots going on within the main story.  Since Ms. Leon is such a fan of opera, she gives insight into the performances, which most of us never would have a clue as to what goes on behind the curtain.  I'm getting near the end of the series - whatever am I gonna do when that happens????"}, {"review_sentiment": 5.0, "review_text": "I love Donna Leon books and this one does not disappoint."}]}, "authors": ["Donna Leon"], "isbn": "0802123538", "longitude": 12.3345898, "periods": ["1900s", "Recent Releases"], "title": "Falling in Love: A Commissario Guido Brunetti Mystery", "word_cloud": "series humanness lead character interaction family never fail write grip story blend image morsel literature add cherry top whip cream interweave tale tragic story excellent like quite much others still enjoyable vacation love inspector interaction office manager clear power knowledge still good story little slower others author enjoy style set find plot quite weak always enjoy plot development think drag little bit understanding least hope true issue surround production musical event keep attention always enjoy hear circle part series star long character always bit different others series focus situation story plot go main story fan opera give insight performance never go curtain get near end series hon happens love disappoint", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 24/24 in the Commissario Brunetti Series\r\n\r\nDonna Leon’s Death at La Fenice, the first novel in her beloved Commissario Guido Brunetti series, introduced readers to the glamorous and cutthroat world of opera and one of Italy’s finest living sopranos, Flavia Petrelli—then a suspect in the poisoning of a renowned German conductor. Years after Brunetti cleared her name and saved the life of her female American lover in Acqua Alta, Flavia has returned to Venice and La Fenice to sing the lead in Tosca, and Brunetti has tickets to an early performance.\r\n\r\nThe night he and his wife, Paola, attend, Flavia gives a stunning performance to a standing ovation. Back in her dressing room, she finds bouquets of yellow roses—too many roses. Every surface of the room is covered with them. An anonymous fan has been showering Flavia with these beautiful gifts in London, St. Petersburg, Amsterdam, and now, Venice, but she no longer feels flattered. A few nights later, invited by Brunetti to dine at his in-laws’ palazzo, Flavia confesses her alarm at these excessive displays of adoration. \r\n\r\nBrunetti promises to look into it. And when a talented young Venetian singer who has caught Flavia’s attention is savagely attacked, Brunetti begins to think that Flavia’s fears are justified in ways neither of them imagined. He must enter in the psyche of an obsessive fan before Flavia, or anyone else, comes to harm.\r\n\r\n“Donna Leon’s first love is opera. . . . So choosing Teatro La Fenice for the setting of Falling in Love, her latest mystery featuring the erudite and oh-so-sympathetic Commissario Guido Brunetti, makes this elegant novel something of a mash note to a longtime lover. . . . The audacious investigation, conducted by Brunetti’s confederate Signorina Elettra, into the psychology of stalkers is thorough and illuminating. But for opera buffs, going backstage at Teatro La Fenice is the real treat.” New York Times Book", "asin": "0802123538", "rank": "323070", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51EmmG3EazL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}