{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": -37.8142176, "ratings": {"num_ratings": 16, "rating": 3.8, "reviews": [{"review_sentiment": 2.0, "review_text": "There are few novels that I have started reading with greater expectations than Joan London’s The Good Parents.  It has had great reviews from readers and literary critics alike, and I was enchanted by The Golden Age.  So why was I so disappointed (and particularly why am I almost alone in this)?The story concerns a young woman Maya and her disappearance from her Melbourne flat.  Her parents Toni and Jacob are due to stay with her in Melbourne and their proposed reunion with their daughter turns into a search for Maya.Part of my difficulty is with the structure of the novel, and the difficulty this creates in identifying  with the characters.  Maya emerges as the protagonist in the first chapter, but almost immediately disappears, and only re-emerges towards the end.  We are introduced to her parents, and in long diversions their early lives are revealed.  This fragmentary style recurs throughout the novel, and one annoying habit of the writer is to subject the reader to several pages of “he said….” and “she said…” without a clue as to who they are and in what era they are saying it.  This style also makes much of the behaviour of the characters difficult to believe; for example, Toni’s behaviour when she apparently reverts to her hippie past does not ring true.  A chance meeting with a character from Toni’s past seems very contrived.The writing style is excellent, but unfortunately I found this book much less than the sum of its parts."}, {"review_sentiment": 5.0, "review_text": "This was the second of three Joan London books that I have read recently.  I am a convert.  Great development of characters and good sense of place, whether it be wheat belt Western Australia or inner city Melbourne"}, {"review_sentiment": 3.0, "review_text": "I found this book to be drawn out and a tiny bit tedious. I enjoy Joan London's writing but there was something about the plot which troubled me. I think it was the premise that this 18 year old girl would simply invite her parents to stay at her Melbourne flat then disappear with a man who had been clearly using her. The infatuation she seemed to have for her devious boss felt somewhat forced and unbelievable to me, paralleling of course, her own mother's experience with a similar sort of older man, Cy.Cy turns out to be quite useful in the end, but it's an end which is too long-winded in arriving. I even found myself skipping a few pages, something I wouldn't usually do if I'm enjoying a novel."}, {"review_sentiment": 5.0, "review_text": "Excellent! Enjoyed it so much, love all her books"}, {"review_sentiment": 3.0, "review_text": "It got me in, but jumps around a bit too much fro my liking. Too many character's names to keep up with."}, {"review_sentiment": 5.0, "review_text": "Everyone has his own story. It might be funny or frightening, instructive or entertaining. It might bore some and excite others. Telling a story well, so others can relate to it easily, is the duty of the writer. Stories about ordinary people are particularly difficult. When crafted with excellence, the characters hit highs and lows, have flaws and fortes. They face the challenge of surviving in a world that often is cruel and uncaring, nourishing within themselves a careful consideration for their own well being and the same for others. I’ve found a book that meets my qualifications and is a joy to read. “The Good Parents” by Joan London. It features a teen-aged daughter seeking to reach adulthood through the time-honored fashion—an older man—along with the turmoil experienced by her mother and father, aging semi-hippies. There’s a mystery, in fact several mysteries: will the daughter meet a terrible fate, and will a disreputable but powerful man in the mother’s past bring doom? The beauty of this book, however, is neither plot nor action. Rather, the intricate weaving of the inner thoughts, the external impacts, the complex relationships, of the characters make you read faster and faster, to track the lives of people who somehow seem as close as dear friends or beloved relatives. The main characters as well as the secondary ones upon whom only a few pages may be expended are as faceted and radiant and entrancing as a diamond. Through this treatise on one family’s lives, I grew to appreciate my own more. “The Good Parents” is truly an example of how ordinary people can have extraordinary lives."}, {"review_sentiment": 4.0, "review_text": "This is an interesting book. It describes the life of a young girl leaving her west Australian country town to live in the big city of Melbourne, Victoria. She has an affair with her married boss and goes missing. Her parents come looking for her. Along the way we discover interesting things about her parents' past, including her mother's first marriage to a crook, who later turns out to be something of a good guy, instrumental in getting their daughter back. Definitely worth reading."}, {"review_sentiment": 2.0, "review_text": "This was a book club book.The other reviews are good so I thought the book would be better, but I didn't like it at all.I wasn't interested in the characters and it jumped around so much.  Maybe you need to be British to enjoy it? I just didn't understand how parents go off to find themselves when their daughter is missing.I really just had to power through to finish it on time.I would not recommend it to anyone."}, {"review_sentiment": 4.0, "review_text": "Set in Australia, an interesting story although I had a little trouble keeping all the characters straight and in the right time frame.  Several children leave their parents behind as they look for a better or more exciting life.  In the end they interact with each other and the families who had been left behind."}, {"review_sentiment": 5.0, "review_text": "Joan London succeeds in creating an engrossing novel with vivid characters. A satisfying, surprising plot. I couldn't put it down. Although it takes place on another continent, I often felt close to the characters."}]}, "authors": ["Joan London"], "isbn": "0802170579", "longitude": 144.9631608, "periods": ["2000s", "Recent Releases"], "title": "The Good Parents", "word_cloud": "novel start read greater expectation great review reader literary critic enchant disappoint particularly almost alone story concern young woman disappearance flat due stay propose reunion daughter turn search difficulty structure difficulty create identify character emerges protagonist first chapter almost immediately disappear towards end introduce long diversion early live reveal fragmentary style recurs annoy habit writer subject several page clue era say style also make much behavior character difficult believe example behavior apparently revert hippie ring true chance meeting character past seem write style excellent unfortunately find much le sum part second recently convert development character sense place wheat belt inner city find drawn tiny bit tedious enjoy write something plot trouble think premise year old girl simply flat disappear man clearly use infatuation seem devious bos felt somewhat force unbelievable parallel course mother experience similar sort older man turn quite useful end end arriving even find skip page something usually enjoy excellent much love get jump bit much fro like many character name everyone story frighten instructive entertain excite others tell story well others relate easily duty writer ordinary people particularly difficult craft excellence character hit high low flaw fort face challenge survive world often cruel uncaring nourish careful consideration others find meet qualification joy feature daughter seek reach adulthood older turmoil experience mother father age mystery fact several mystery daughter meet terrible fate disreputable powerful man mother bring doom beauty however plot action intricate weave inner thought external impact complex relationship character make faster faster track live people somehow seem close dear friend beloved relatives main character well secondary one page faceted radiant entrance diamond treatise family live grow truly example ordinary people extraordinary life interest describes life young girl leave west australian country town live big city affair married bos go miss come look way interesting thing include mother first marriage crook later turn something guy instrumental get daughter back read club review think interested character jump around much understand find daughter really power finish anyone interest story little trouble keep character straight right time frame several child leave look better excite life end interact family leave succeed create engross vivid character a satisfy surprising plot take place continent often felt close character", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "A two-time winner of Australia’s prestigious The Age Book of the Year Award, Joan London’s debut novel, Gilgamesh, was published to rapturous acclaim both in her native Australia and in the United States. \r\n\r\nNow, London has delivered The Good Parents, a tender and compelling tale of mother love and the harrowing moment when a daughter spreads her wings and vanishes from her parents’ orbit. \r\n\r\nMaya de Jong is an eighteen-year-old country girl who moves to Melbourne and begins an affair with her new boss. When Maya’s parents, Toni and Jacob, arrive for a visit, Maya is gone—no one knows where. Maya, for reasons of her own, leaves haunting clues in late-night calls to her brother at home, carefully avoiding detection by the two people who love her most. \r\n\r\nUltimately, to find her daughter Toni will have to revisit a part of her past that she thought she had shut off forever—the closest she ever came to being a lost girl herself. \r\n\r\nThe Good Parents is at once utterly contemporary and a story as old as humanity itself: a stunning portrait of familial love and how far we can drift apart in the moments between the words we speak.", "asin": "0802170579", "rank": "2468892", "city": "Melbourne", "image": "https://images-na.ssl-images-amazon.com/images/I/41vhButG3-L.jpg", "country": "Australia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}