{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 42.8804219, "ratings": {"num_ratings": 5, "rating": 3.3, "reviews": [{"review_sentiment": 1.0, "review_text": "This book is a reprint of Day's 1948 \"Catholic Worker\" writings in her column \"On Pilgrimage.\" It is the usual mishmash of  her slanted personal anecdotes, fuzzy theological thinking, and Marxist apologia and language. Particularly egregious is her presenting \"Papa Marx\" and Lenin as secular saints in her April column: \"To see only the good, the Christ, in others! Perhaps if we thought of how Karl Marx was called 'Papa Marx' by all the children on the street, if we knew and remembered how he told fairy stories to his children, how he suffered hunger and poverty and pain, how he sat by the body of his dead child and had no money for coffin or funeral, perhaps such thoughts as these would make us love him and his followers....And there was Lenin. He hungered and thirsted and at times he had no fixed abode. Mme. Krupskaya, his widow, said that he loved to go into the peace of the pine woods and hunt mushrooms like old Mrs. Dew down at Easton did, and we with her one October. He lived one time in the slums of Paris, and he lived on horse meat when he had meat, and he started schools for the poor and the workers. 'He went about doing good.'\"Day informs us that Lenin (like Jesus Christ) \"went about doing good.\"  If only that were so and millions hadn't suffered from the terror and violence Lenin and his cohorts unleashed on the world (see \"The Black Book of Communism,\" available from amazon.com, for more details, including photos of brutally executed victims). The incoherence of Day's writing is a result of her unachievable aim to create a \"Christian communism\" out of Catholicism. Revealing her true view of the value of sainthood, Dorothy rightly said, \"Don't call me a saint, I don't want to be dismissed so easily.\" It is easy--and a wise saving of time--to dismiss this collection of her writings. A more comprehensive view of Day is provided in another book available on amazon.com, Dr. Carol Byrne's  2010 \"The Catholic Worker Movement (1933-1980): A Critical Analysis,\" with supplementary notes available on the blog \"Dorothy Day Another Way.\""}, {"review_sentiment": 5.0, "review_text": "This book, a journal of one year in Dorothy Day's life (1948), is so incredibly beautiful and powerful.  Day's spirituality, her deep sense of the sacred in all that she touched, her understanding of the lay apostolate, and of the dignity of marriage comes shining through in these pages.  As I read this book, I thought, \"If only more people had internalized what Day was saying here, the post-Vatican II crisis would have been much smaller in scope.\"  It is amazing how Day anticipated and lived out so much of what the Second Vatican Council called for.  Her profound sense of marriage and how the marriage relationship was an image for the Church and Christ, her understanding of divine friendship, and so many other things were before their time.In these pages it becomes clear that this woman was a saint.  She loved the poor, really loved the poor.  She lived with them.  She clothed the naked, fed the hungry, helped the lame, visited the prisoner.  She and her work were an embodiment of Matthew 25.  An incredible book, by an incredible woman.Also, Mark and Louise Zwick, who run the Houston Catholic Worker House, give a thorough and good introduction to the journal."}, {"review_sentiment": 5.0, "review_text": "If you wish to examine a life that truly sought to live in obedience to Christ, a life which took His words seriously in the midst of people who could only be nominally called \"Christian\", then this is the book for you.I am a convert to the Catholic Faith, and after I read this book, I found myself wishing that I could have known Dorothy and Peter in my younger days.  What a challenge to our complacent and self-centered Western idea of \"Christianity\" their lives presented to the world as they sought to truly live out the Gospel message of care for the downtrodden and most needy of the world -- those to whom the members of most churches won't give the time of day.This is a challenging read, and it is so because it jolts one out of the soft \"Christianity\" we have formed as a nest around us to keep us from experiencing any discomfort.  Christ's call to discipleship is just as demanding today through Dorothy Day as it was 2000 years ago to the first men and women who heard it.The book is divided into two parts: the first is commentary on Dorothy's life by Mark & Louise Zwick.  The second part is Dorothy's diary for a year, giving us a tremendous insight into the life and thinking of this woman, a convert herself, who took Jesus' words seriously in a world that fairly well ignores what He said about the poor.  It is no wonder that she made enemies in high places.  Her life was a rebuke to their plush lives of greed, deceit, and war for profit.And now, more than ever, we need our God to give us yet another Dorothy Day and Peter Maurin on the world stage.  In the midst of the vapid intellectual snobbery of Calvinists, the greed actuated doctrines of Charismania, the moral meltdown of the \"mainline churches\",  we need a multitude of such folks as Dorothy and Peter to call the world back to sanity.  I hope you will read this book and consider afresh the challenging message of self-giving love to which we are called by Christ."}, {"review_sentiment": 5.0, "review_text": "I would suggest this as the third book by Dorothy Day that you read-- after \"loaves and fishes\" and \"long lonliness\", however, the introduction to this book justifies the purchase for anyone. The introduction is lengthy (over 25 pages), and is written by two people that know the movement (they run Casa Juan is Houston). The book by Day is very touching.... but not an introduction to someone unfamiliar with her work. Often I suggest that someone new to Dorothy Day read the introduction, and then \"Loaves and Fishes\", and then returns to this book."}, {"review_sentiment": 5.0, "review_text": "Many of Dorothy Day's sabbaticals from the Catholic Worker houses are chronicled in \"On Pilgrimage,\" which was also the title of her long-running column in her monthly newspaper, The Catholic Worker. Ever the  journalist, Day would record the most minute aspects of her trips--usually  by bus and with a jar of instant coffee and prayer books in her small  bag--and give her newspaper readers insight into the social struggle in the  South, in Okie migrant camps or Indian reservations. Her compassion and  observer's eye didn't conflict; she wrote about injustice with passion, but  felt compelled to temper her anger at issues such as the mistreatment of  black tenant farmers. Her distinctly Catholic perspective on poverty  (indeed voluntary poverty was her lasting contribution to 20th century  Christianity) and suffering as well as her feisty personality are evident  in these essays detailing her trips. Even though efforts have begun toward  Dorothy Day's canonization, she will never be a plaster saint...not as long  as these warm and utterly realistic accounts are read. She comes across as  a committed Christian who believes in the essential dignity of every human  being, oppressed and oppressor alike. The only fault with her pilgrimage  essays is their essentially hurried nature. Dorothy Day could be careless  with punctuation and transitions in her efforts to get her thoughts on  paper. The essays when she's visiting her daughter and attempting to help  with the growing number of children are my favorites. Dorothy Day continues  to be one of my prime spiritual mentors, precisely because of homey,  faith-filled essays like those, where the grandchildren are climbing on her  lap and preventing her from writing. The real woman--warts, moments of  exhaustion and all--is in these pages."}]}, "authors": ["Mrs. Dorothy Day"], "isbn": "0802846297", "longitude": -8.5458608, "periods": ["1900s"], "title": "On Pilgrimage", "word_cloud": "reprint write column usual mishmash slant personal anecdote fuzzy theological thinking apologia language particularly egregious present secular saint column good others perhaps think call child street knew remember tell fairy story child suffer hunger poverty pain sit body dead child money coffin funeral perhaps thought follower hunger thirsted time fix abode widow say love peace pine wood hunt mushroom old live time slum live horse meat meat start school poor worker go good inform go good million suffer terror violence cohort unleash world see available detail include photo brutally execute victim incoherence write result achievable aim create christian communism true view value sainthood rightly say saint want dismiss easily easy save time dismiss collection write comprehensive view provide available supplementary note available blog journal year life incredibly beautiful powerful spirituality deep sense sacred touch understanding lay apostate dignity marriage come shin page think people internalize say crisis much smaller scope amazing anticipate live much call profound sense marriage marriage relationship image understand divine friendship many thing page becomes clear woman saint love poor really love poor live clothe naked fed hungry help visited prisoner work embodiment incredible incredible run thorough good introduction journal wish examine life truly seek live obedience life take word seriously midst people nominally convert find wish younger day challenge complacent western idea live present world seek truly live message care downtrodden needy world member church time challenge jolt soft form nest keep experience discomfort call discipleship demand today year ago first men woman heard divide part first commentary life second part diary year give tremendous insight life think woman convert take word seriously world fairly well ignore say poor wonder make enemy high place life rebuke plush live greed deceit war ever yet world stage midst vapid intellectual snobbery calvinist greed actuate doctrine moral meltdown mainline church need multitude folk call world back sanity hope afresh challenging message love call christ third loaves fish long loneliness however introduction justifies purchase anyone introduction lengthy page write people know movement touch introduction someone unfamiliar work suggest someone new introduction loaves return many sabbaticals house chronicle also title column monthly newspaper journalist minute aspect trip usually bus jar instant coffee prayer small bag give newspaper reader insight social struggle migrant camp indian reservation compassion eye conflict write injustice passion felt compelled anger issue mistreatment black tenant farmer distinctly perspective poverty indeed voluntary poverty last contribution century suffer well feisty personality evident essay detail trip even effort begin canonization never plaster saint long warm utterly realistic account come committed believe essential dignity human oppress oppressor fault essay essentially hurried nature punctuation transition effort get thought paper essay visit daughter attempt help grow number child favorites continue prime spiritual mentor precisely homey essay grandchild climb lap prevent write real woman warts moment exhaustion page", "genres": ["Memoir", "Religion", "Travel Writing"], "summary": "These diary entries written by Dorothy Day in 1948 provide an intimate look into Day's personal life as well as essential background for understanding the Catholic Worker movement, which she founded. In this book, Day writes about all facets of her life. \r\n\r\nYet whether describing her visits to her daughter's farm or the writings of the saints, a common theme emerges, namely, the gifts of God's love and our need to respond to them with personal and social transformation. \r\n\r\n", "asin": "0802846297", "rank": "16336", "city": "Santiago de Compostela", "image": "https://images-na.ssl-images-amazon.com/images/I/518fwXzQTNL.jpg", "country": "Spain", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}