{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 220, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "One of my favorite books and authors of all time. His style really holds up. This is a nice edition of what I think is his best work (closely followed by Naked Lunch)."}, {"review_sentiment": 5.0, "review_text": "great seller would purchase again"}, {"review_sentiment": 5.0, "review_text": "My introduction to Burroughs, and perhaps one of my favorite books of all time."}, {"review_sentiment": 5.0, "review_text": "This is a very interesting book. I did not know much about old time addicts before reading this book. I learned a lot about why people use opiates."}, {"review_sentiment": 5.0, "review_text": "It's Burrough's - What else can you say. Love it!!"}, {"review_sentiment": 3.0, "review_text": "Love this book. Never get tired of rereading it!"}, {"review_sentiment": 5.0, "review_text": "Love beat texts. Love first person narratives. Love reading about drugs. My kinda book."}, {"review_sentiment": 4.0, "review_text": "I bought this book a few years back and found it to be a very sad window into Burroughs drug use.He doesn't glorify junk but rather warns the reader of the control drugs can have on you a must read for anyone interested in 40s drug culture or a window into the timeless effects of addiction."}, {"review_sentiment": 5.0, "review_text": "My niece loved it!"}, {"review_sentiment": 5.0, "review_text": "A masterwork."}]}, "authors": ["William S. Burroughs"], "isbn": "0802120423", "longitude": 0.0, "periods": ["1900s"], "title": "Junky", "word_cloud": "favorite author time style really hold nice edition think best work closely follow lunch great seller introduction perhaps favorite time interesting know much old time addict read learn lot people use opiate else say tired rereading beat text first person narrative reading drug kinda buy year back find sad window drug glorify junk rather warn drug anyone interested drug culture window timeless effect addiction niece love masterwork", "genres": ["Fiction & Literature", "LGBT"], "summary": "Junk is not, like alcohol or a weed, a means to increased enjoyment of life. Junk is not a kick. It is a way of life.\r\n\r\nIn his debut novel, Junky, Burroughs fictionalized his experiences using and peddling heroin and other drugs in the 1950s into a work that reads like a field report from the underworld of post-war America. The Burroughs-like protagonist of the novel, Bill Lee, see-saws between periods of addiction and rehab, using a panoply of substances including heroin, cocaine, marijuana, paregoric (a weak tincture of opium) and goof balls (barbiturate), amongst others. \r\n\r\nFor this definitive edition, renowned Burroughs scholar Oliver Harris has gone back to archival typescripts to re-created the author's original text word by word. From the tenements of New York to the queer bars of New Orleans, Junky takes the reader into a world at once long-forgotten and still with us today. Burroughs’s first novel is a cult classic and a critical part of his oeuvre.", "asin": "0802120423", "rank": "57754", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/616nbkV0aFL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}