{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 36.1662859, "ratings": {"num_ratings": 79, "rating": 4.2, "reviews": [{"review_sentiment": 2.0, "review_text": "Damn paper sticky labels all over it that are impossible to get off without messing up the cover."}, {"review_sentiment": 5.0, "review_text": "Very absorbing and beautifully written. You feel the loneliness of the two main characters and can root for their happiness together."}, {"review_sentiment": 5.0, "review_text": "While the film certainly has its merits, it takes more of an abridged, kaleidoscopic view of the book. Some of the central ideas are lost in favor of prioritizing something akin to a love story. The unflinching realities of being an alcoholic and a prostitute, for instance, are merely sketched in. While the book spends the most time with Sera, in the film she is almost reduced to a supporting character; her reasons for being with Ben, once complex and open to interpretation, are now childlike and nebulous. And then there is the pimp, who in some ways is the fulcrum of the narrative, but goes just beyond making an appearance in the screenplay. The film succeeds in its own way, mainly based on its performances, but it is a different interpretation. Highly recommended reading."}, {"review_sentiment": 5.0, "review_text": "Excellent read."}, {"review_sentiment": 5.0, "review_text": "While the subject matter of a suicidal alcoholic and a Vegas prostitute may not be everyone's idea of enjoyable fiction, the journey of characters Ben and Sera were so fascinating that I was completely engrossed in the novel. Their narrative was so honest and full of heartfelt pain that I wasn't surprised to learn that O'Brien himself was an alcoholic before his suicide at age 34.O'Brien's writing style took a few pages to get used to, with his colorful vocabulary and what seemed like the occasional wonky sentence structure. What's more, instances in which flashbacks were demarcated with parentheses caused me a bit of confusion until I got used to them.Depressing, yet engrossing. If you're into that sort of thing. :)"}, {"review_sentiment": 1.0, "review_text": "I bought this thinking it was the original  novel by the late John O'Brien, it's NOT! its just the movie screenplay!  I don't know how to return a kindle product so I guess i am stuck with this crap.  So If it's the original novel you want, please know THIS IS NOT IT."}, {"review_sentiment": 5.0, "review_text": "This is just an amazing read. The way O'Brien delivers the goods is remarkable- each phrase and every nuance needs digested. This is simply one of my favorite books of all time, but make no mistake, it is grim, exposed and I can only guess the writers own dark life leaves an imprint which make it more believable and sad."}, {"review_sentiment": 5.0, "review_text": "Beautifully tragic look into a dying alcoholic. Amazing book."}, {"review_sentiment": 1.0, "review_text": "This is not the book"}, {"review_sentiment": 4.0, "review_text": "A deeply depressing story but it's saving grace is that the clutches of alcoholism are authentically portrayed. Even though this is a fantasy; the idea of an angelic prostitute being with a suicidal drunk, the question is really an existential one -  are they really free to choose their fate or are they truly trapped by their predicament?"}]}, "authors": ["John O'Brien"], "isbn": "0802134459", "longitude": -115.149225, "periods": ["1900s"], "title": "Leaving Las Vegas", "word_cloud": "paper sticky label impossible get mess cover very absorb beautifully write feel loneliness main character root happiness together film certainly merit take abridge kaleidoscopic view central idea lose favor prioritize something akin love story unflinching reality alcoholic prostitute instance merely sketch spends time film almost reduce supporting character reason complex open interpretation childlike nebulous pimp way fulcrum narrative go make appearance screenplay film succeed way mainly base performance different interpretation recommend reading excellent subject matter suicidal alcoholic prostitute everyone idea enjoyable fiction journey character fascinate completely engross narrative honest full heartfelt pain surprise learn alcoholic suicide age write style take page get use colorful vocabulary seem occasional wonky sentence structure instance flashback demarcate parenthesis cause bit confusion get use yet engross sort thing buy think original late movie screenplay know return kindle product guess stuck crap so original want please be amaze way delivers good phrase nuance need digest simply favorite time make mistake grim expose guess writer dark life leave imprint make believable sad tragic look die alcoholic deeply depress story save grace clutch alcoholism authentically portray even fantasy idea angelic prostitute suicidal drunk question really existential really free choose fate truly trap predicament", "genres": ["Fiction & Literature"], "summary": "Leaving Las Vegas, the first novel by John O'Brien, is a disturbing and emotionally wrenching story of a woman who embraces life and a man who rejects it, a powerful tale of hard luck and hard drinking and a relationship of tenderness and destruction. \r\n\r\nAn avowed alcoholic, Ben drinks away his family, friends, and, finally, his job. With deliberate resolve, he burns the remnants of his life and heads for Las Vegas to end it all in the last great binge of his hopeless life. \r\n\r\nOn the Strip, he picks up Sera, a prostitute, in what might have become another excess in his self-destructive jag. Instead, their chance meeting becomes a respite on the road to oblivion as they form a bond that is as mysterious as it is immutable. \r\n\r\nLeaving Las Vegas tells a powerful story of unconditional love between two disenfranchised souls who connect for a fleeting moment.", "asin": "B007CV58KC", "rank": 0, "city": "Las Vegas", "image": "https://images-na.ssl-images-amazon.com/images/I/41-ShEXlX2L.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}