{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 125, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "A great read as a South African"}, {"review_sentiment": 3.0, "review_text": "Too naive to catch the reader by surprise."}, {"review_sentiment": 4.0, "review_text": "The South African mystery/thriller writer who ALWAYS delivers a terrific adventure with a great muse/Cape Town detective to lead the way. I suggest you begin reading Mr. Meyer from the beginning so that you can grow into his recurring \"family\" and take the ride."}, {"review_sentiment": 3.0, "review_text": "Not up to his standard"}, {"review_sentiment": 5.0, "review_text": "excellent"}, {"review_sentiment": 5.0, "review_text": "Great book.  A classic.  The packaging and customer service were wonderful."}, {"review_sentiment": 4.0, "review_text": "Good read that follows Benny Griesels life. It is fast moving story that is well told and never boring with lots of suspense."}, {"review_sentiment": 4.0, "review_text": "We have come to enjoy Benny, so it was sad to see him fall off the wagon. But all true heroes prevail and so goes Benny."}, {"review_sentiment": 5.0, "review_text": "- a genius indeed -"}, {"review_sentiment": 5.0, "review_text": "Awesome.  Missed reading Deon Meyer and eagerly awaiting his next one. I would like to see a TV show  based on these characters"}]}, "authors": ["Deon Meyer"], "isbn": "0802124003", "longitude": 18.417396, "periods": ["2000s", "Recent Releases"], "title": "Icarus", "word_cloud": "great south african naive catch surprise south african writer delivers terrific adventure great detective lead way suggest begin read begin grow recur family ride not standard excellent classic packaging customer service wonderful good follow life fast move story well tell never bore lot suspense come enjoy sad see fall wagon true hero prevail go genius indeed miss read eagerly await next base character", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 5/5 in Benny Griessel\r\n\r\nSouth Africa’s preeminent crime fiction writer, Deon Meyer is internationally acclaimed for his razor’s-edge thrillers, unforgettable characters, and nuanced portrayals of contemporary life in his native country. The fifth pulse-pounder starring Captain Benny Griessel, a lead detective in South Africa’s priority crimes unit, delves into the country’s burgeoning tech and wine industries.\r\n\r\nA week before Christmas, a young photographer discovers a plastic-wrapped corpse amidst the sand dunes north of Cape Town. The only thing found on the corpse is a dead iPhone, but it doesn’t take long for the police to identify the body as that of Ernst Richter—the tech whiz behind MyAlibi, an internet service that provides unfaithful partners with sophisticated cover stories to hide an affair. Meanwhile, Benny Griessel is called to the scene of a multiple homicide involving a former colleague, and four years of sobriety are undone on the spot. He emerges from his drunken haze determined to quit the force, but the take-no-sass Major Mbali Kaleni, now his boss, wants Griessel on the Richter case. The high-profile murder has already been the subject of fierce media speculation, with questions swirling about the potential for motive: could the perpetrator be one of the countless jilted spouses? An aggrieved client?\r\n\r\nBefore the week is out, an unexpected connection to a storied family winery comes to light, and Griessel’s reputation is again on the line. Mounting towards a startling conclusion, Icarus is another exceptional novel from the “King of South African Crime.”\r\n\r\n“South African author Deon Meyer’s Benny Griessel series is one of the high points of contemporary crime fiction, and the fifth title, Icarus, is his best yet . . . [An] expertly engineered tale of sex, lies, and fraud.” The Guardian", "asin": "0802124003", "rank": "1182805", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/51hU5ZIxovL.jpg", "country": "RSA", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}