{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 21, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book and a great read! You’ll love it if you like crime and social issues all mixed in with a great story"}, {"review_sentiment": 3.0, "review_text": "great story hard to read and keep track of the characters."}, {"review_sentiment": 5.0, "review_text": "Better than the movie, much more detailed.."}, {"review_sentiment": 2.0, "review_text": "Ive read it on the original language and the story is just a mishmash. fragments sewed in no aparent order, all characters are about the same and the story goes nowhere but keeps spinning round...sorry but this was my impression of the book. The film is way better and so much more than a mere summary of the book .. I consider the book to be a very raw material for the film."}, {"review_sentiment": 5.0, "review_text": "This is the typical case of the book being better than the movie...and the movie was GOOD! I love a story with history and this book is just that. We are taken from Rocket's childhood and into young adulthood with a rich plot that is so riveting and unexpected you can hardly put the book down to do anything else in real life! Even if you've seen the movie, if you love to read, cop the book and see how much the movie leaves out that would have been awesome to see incorporated onto the screen.The action is intense and the emotion has depth that reaches far beyond the pages. It grips you even more when you truly realize that this book was someone's real-life experience. We take so much for granted...even our lives, and the underlying factor of this story is that the reason so many people experience a life like Rocket and his peers is because of the extent of the poverty they exist in. And overall excellent read and i reccomend it for anyone who loves a good story consisting of a mix of genres within it!"}, {"review_sentiment": 5.0, "review_text": "Book was great. Took over a month to ship though."}, {"review_sentiment": 5.0, "review_text": "Love the book just don't compare it to the movie. Better the 2nd or 3rd time around reading it since  it has so many characters."}, {"review_sentiment": 3.0, "review_text": "The story is incredible and you get a real sense for life as a gangster in the favela. I think the translation into English may have taken away from the experience. I found myself relating much of the story to HBOs The Wire, how these gangsters live by this surprisingly structured moral code amidst the chaos.Honestly, rent the movie and enjoy."}, {"review_sentiment": 2.0, "review_text": "Various stories are simultaneously being told by the author at once. This makes it a little difficult to follow, but also keeps you turning the pages (at least for a while). It was also suuuper graphic about sexual and violent things. In the end, it was too much for me, and I put it down. I did watch the movie in a university class, which was also very difficult for me to handle, and I had to turn away at times. I'm glad that the author is trying to show what happens in the favelas, and how bad things happen that change good people, but it made me sick to my stomach and broke my heart to see. Call me sensitive (or worse), but I really believe that we are all children of God -a human family- and we're not exactly taking care of each other very well. That's what broke my heart."}, {"review_sentiment": 4.0, "review_text": "Why did the author call this area \"City of God\" - I dont get it? I saw the movie and I dont believe it explains it there either. Strange choice of words for such a depressed area."}]}, "authors": ["Paulo Lins"], "isbn": "0802170102", "longitude": 0.0, "periods": ["1900s"], "title": "City of God: A Novel", "word_cloud": "great love crime social issue mixed great story great story hard track character movie much original language story mishmash fragment sew parent order character story go nowhere keep spin round sorry impression film way better much mere summary consider raw material film typical case better movie movie love story history take childhood young adulthood rich plot rivet unexpected hardly put anything else real life even see movie love cop see much movie leaf see incorporate action intense emotion depth reach far page grip even truly someone experience take much grant even live underlying factor story reason many people experience life peer extent poverty exist overall excellent recommend anyone love good story consist mix genre great month ship compare movie time read many character story incredible get real sense life gangster fa vela think translation take experience find relate much story gangster live surprisingly structure moral code midst rent movie enjoy various story simultaneously tell author make little difficult follow also keep turn page least also suuuper graphic sexual violent thing end much put watch movie university class also difficult handle turn away time glad author try show happen faves bad thing happen change good people make sick stomach break heart see sensitive worse really child human exactly take care well break heart author call area font saw movie font believe explain choice word depress area", "genres": ["Fiction & Literature"], "summary": "City of God is a gritty, gorgeous tour de force from one of Brazil’s most notorious slums. Cidade de Deus: a place where the streets are awash with narcotics, where violence can erupt at any moment over drugs, money, and love—but also a place where the samba beat rocks till dawn, where the women are the most beautiful on earth, and where one young man wants to escape his background and become a photographer. \r\n\r\nWhen City of God erupted on screens worldwide, it became one of the most critically and commercially successful foreign films of recent years. But few were aware of the story behind the film. Written by Paulo Lins, who grew up in the favela (shantytown) Cidade de Deus in Rio e Janeiro and who spent years researching its gang history, City of God began life as a coruscating, harrowing novelistic account of twenty years in the illicit pursuits of the youth gangs born from the favela. \r\n\r\nCity of God is a raw, powerful portrait of the countless millions of poor people all over the world.", "asin": "0802170102", "rank": "860687", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/51lXMg8oRVL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}