{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 3, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "I brought this for my sister and never read it. But she still has it and reads it til this day. Perfect gift for a woman who loves reading books like this one."}, {"review_sentiment": 4.0, "review_text": "A poetic account of six generations born from an act of rebellion and set free into the world, this novel begins on Trinidad as Marie Ursule plots a mass suicide of fellow slaves and ensures the escape of her \"vanity  and joy,\" little Bola.  Marie Ursule's descendants, born of Bola and  her lust for different men, dash off to disparate lives, which Brand  describes in separate, always lyrical, chapters.  Although Brand's  repetitive use of certain phrases can wear thin, she shows a brilliant  command of the emotional side of language. I would not recommend this book  to casual readers because its emphasis on language and theme, and not plot,  might disappoint them; however, this novel has much to offer serious and  attentive readers."}, {"review_sentiment": 4.0, "review_text": "I thought it was an amazing novel, very deep. I think Dionne Brand dwelled to much on simple situations in the plot, which at times made it boring, but overall extremely well written"}]}, "authors": ["Dionne Brand"], "isbn": "0802137237", "longitude": 0.0, "periods": ["1800s"], "title": "At the Full and Change of the Moon", "word_cloud": "bring sister never still read til day gift woman love read poetic account generation bear act rebellion set free world begin plot mass suicide fellow slave ensure escape vanity joy little descendant born different men dash disparate life describe separate always lyrical chapter repetitive use certain phrase wear thin show brilliant command emotional side language casual reader emphasis language theme plot however much offer serious attentive reader think amaze deep think swell much simple situation plot time make bore overall extremely well write", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Written with lyrical fire in a chorus of vividly rendered voices, Dionne Brand's second novel is an epic of the African diaspora across the globe.\r\n\r\nIt begins in 1824 on Trinidad, where Marie-Ursule, queen of a secret slave society called the Sans Peur Regiment, plots a mass suicide. The end of the Sans Peur is also the beginning of a new world, for Marie-Ursule cannot kill her young daughter, Bola -- who escapes to live free and bear a dynasty of descendants who spill out across the Caribbean, North America, and Europe.\r\n\r\nHaunted by a legacy of passion and oppression, the children of Bola pass through two world wars and into the confusion, estrangement, and violence of the late twentieth century.\r\n\r\n\"[Brand has] a lush and exuberant style that may put some readers in mind of Toni Morrison or Edwidge Danticat.\" The New York Times", "asin": "0802137237", "rank": "958480", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/41%2Bt6OuF5oL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}