{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 300, "rating": 3.1, "reviews": [{"review_sentiment": 3.0, "review_text": "good read"}, {"review_sentiment": 5.0, "review_text": "Excellent book. Better than some of her other works."}, {"review_sentiment": 1.0, "review_text": "Unnecessarily tortured and unnecessarily convoluted plot. Pour husband and men in the book."}, {"review_sentiment": 2.0, "review_text": "There is soooo much that is wrong with this book that  it would take me more time than I have the energy or impetus to expound upon.  I'm giving this two stars instead of one, because I was interested in the psychological aspect of the children feeling the need to  protect the mother.  If the book had stuck to character development, instead of trailing off into endless and totally confusing ruminations by the narrator, it might have been worthwhile. ( I do admit, however, that she made a good stab at Nugent).The narrator at times just seems very weird.  When she meets her sibling's three year old son for the first time, it is understandable that she might wish to hug the child.  But she wonders:  \"How I will steal or filch permission to rub my cheek along the skin of his back, and PLAY THE BONES OF HIS SPINE (what ????).  The book is chock full of strange sentences like this and that  is not good writing, sorry.The book might have been better if about a hundred pages were lopped off it."}, {"review_sentiment": 3.0, "review_text": "Anne Enright’s The Gathering won the 2007 Mann Booker prize, for the best original novel written in English and published in the UK. The story concerns a large Irish family that gathers to mourn the death of Liam, one of nine children in the Hagerty family. The story is told by one of them, Veronica, who is now an adult with children of her own. The novel consists of a series of short chapters in which Veronica reminisces about her family and relationships, interspersed with her trip to London to recover the body of Liam who committed suicide by drowning himself in the ocean. She starts with grandma Ada who meets one man, Nugent, but in the end marries another, Charlie. Her memory goes back and forth between Ada, Charlie and Nugent, her now dysfunctional marriage with her husband, Tom, her children, her parents, the other siblings, her college boyfriend, Michael Weiss and, of course, Liam. It is a sad story and Veronica is a sad person. The key event that she relates is that Liam was sexually abused when he was eight and she was seven. She witnessed the act but kept it a secret from the rest of the family.I think this novel will especially appeal to Irish people and married women who can identify with Veronica. However I am neither and thus found it hard to relate to what is really a depressing story. It is well written and Ms. Enright clearly deserved her award."}, {"review_sentiment": 5.0, "review_text": "She flings arrows to your heart. Blasphemy to your soul. Truth over lies over nightmares. It's what all dreams are made of when you are young, before you actually live. And then you have to. Live."}, {"review_sentiment": 5.0, "review_text": "Beautiful book. Reflections on generations of a family in Ireland upon the suicide of a sibling. Anne enright is a poet writing prose."}, {"review_sentiment": 1.0, "review_text": "I found it depressing"}, {"review_sentiment": 1.0, "review_text": "This book is depressing porn!  I hate it.  More so, because I happen to have lived in Broadstone and played on the CIE buses and climbed the big oak tree over the wall where I could see who was coming and going in my grandmother's house across the road.  I don't know or remember the type of people/scenes Enright writes about.  I have read halfway through the book, and have to give up on the rest of it.  It's just too awful.  Can I have my money back?????  Or, remove it from my Kindle library.  MaureenBridget"}, {"review_sentiment": 5.0, "review_text": "This is a fascinating book about a large Irish family and its troubles and happiness."}]}, "authors": ["Anne Enright"], "isbn": "0802170390", "longitude": -6.2602732, "periods": ["1900s", "Recent Releases"], "title": "The Gathering", "word_cloud": "good excellent work unnecessarily torture unnecessarily convolute plot husband men soot much wrong time energy impetus give star instead interested psychological aspect child feel need protect mother stick character development instead trail endless totally confusing rumination narrator admit however make good stab narrator time seem weird meet sibling year old son first time understandable hug child wonder steal filch permission rub cheek skin back chock full strange sentence good writing better hundred page lop best original write publish story concern large family gather mourn death child family story tell adult child consists series short chapter reminisces family relationship intersperse trip recover body commit suicide drown ocean start grandma meet man end marry memory go back forth dysfunctional marriage husband child parent sibling college boyfriend course sad story sad person key event relate sexually abuse witness act keep secret rest think especially appeal irish people married woman identify however neither thus find hard relate really depress story well write clearly deserve award fling arrow heart soul lie nightmare dream make young actually live live beautiful generation family suicide sibling en right poet write prose find depress depressing porn hate more happen live play bus climb big oak wall come go grandmother house road know type write halfway give rest awful money back library fascinating large family trouble happiness", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Anne Enright is a dazzling writer of international stature and one of Ireland’s most singular voices. Now she delivers The Gathering, a moving, evocative portrait of a large Irish family and a shot of fresh blood into the Irish literary tradition, combining the lyricism of the old with the shock of the new. \r\n\r\nThe nine surviving children of the Hegarty clan are gathering in Dublin for the wake of their wayward brother, Liam, drowned in the sea. His sister, Veronica, collects the body and keeps the dead man company, guarding the secret she shares with him—something that happened in their grandmother’s house in the winter of 1968. \r\n\r\nAs Enright traces the line of betrayal and redemption through three generations her distinctive intelligence twists the world a fraction and gives it back to us in a new and unforgettable light. \r\n\r\nThe Gathering is a daring, witty, and insightful family epic, clarified through Anne Enright’s unblinking eye. It is a novel about love and disappointment, about how memories warp and secrets fester, and how fate is written in the body, not in the stars.", "asin": "0802170390", "rank": "122634", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/41ago-KR06L.jpg", "country": "Ireland", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}