{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 14, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "There was way too much tech history and not enough for me to really believe everything written."}, {"review_sentiment": 5.0, "review_text": "Klima is the best contemporary Czech writer; funny, moving and always honest.  I recommend everyone read Judge on Trial and his Crazy Century."}, {"review_sentiment": 2.0, "review_text": "I found the writing style rather dry. I gave up after about half way through the book because I got bored."}, {"review_sentiment": 5.0, "review_text": "Quite informative for that period of Czech history"}, {"review_sentiment": 4.0, "review_text": "I had never heard of Ivan Klima until I heard him on an NPR interview recently when he was in Washington plugging the book.  The interview was fascinating and because I'm soon headed to a job in Prague, I felt I should check it out.I am well familiar with the evils and absurdities of communism, so I didn't find much that was surprising in Klima's memoir.  Nonetheless he is a compelling storyteller and caused me to wonder repeatedly if the world he was describing in communist Czechoslovakia - and the whole paradigm of creating a \"new socialist man\" - wasn't some big joke.  Unfortunately not, for those who lived under it.I give it four stars only because I felt that even at nearly 500 pages, the book seems a little short - perhaps too much lost in the abridgment from the much-longer Czech edition.  If you can read Czech, I would suggest getting that one on your next visit to Prague."}, {"review_sentiment": 4.0, "review_text": "I have read a few things about the Czech runner Emil Zatopek, and have been disappointed that I never learned about how he dealt with the Communist regime (from 1948-1989). Zatopek flourished as runner in the late-40's to early-50's, sympathized with the Prague Spring, and was internally exiled until 1989. This memoir by Klima has a lot to say about how he managed under communism. Not that it was necessarily like the way Zatopek managed, but there were probably similarities. Klima had a great desire to stay in his homeland, so despite having opportunities to leave, he remained. In fact he was teaching in the US in 1968-69, and still chose to return after the crackdown. He did belong to the communist party for a time in the 1950's, mostly naively. But mostly he managed to live in a kind of grey zone that allowed him to write but not collaborate. It wasn't until the last years of the communist regime that he became pretty strongly identified with the dissidents.Apparently Klima wrote a 2-volume memoir, of which this is an abridged 1-volume version. The publishers suggest they might publish the 2 volumes (in translation) at some point, but don't promise. I don't know what more there is, but the book under review ends in 1989 with the Velvet Revolution. It would be interesting to hear about his life since then. Though everyone is in favor of freedom, it has its downsides. E.g., writers under oppression have deep issues to write about. Freedom eliminates some of those issues, and can present a challenge to creativity. Also, we have a friend who is roughly my age who grew up in CZ and was in her 30's in 1989. She confessed to Kathy and me once that she had not been prepared to make life choices for herself, and found freedom rather difficult. So, it would be interesting to know Klima's experience of freedom, which he gained at age 58.Klima knew interesting people such as Havel and Kundera pretty well. Unfortunately he has little to say about them, beyond mentioning the times they intersect his life. But there are no personal accounts of them. That is perhaps understandable in the case of Kundera, since he is still alive, but you'd think he could share more about Havel. Perhaps there is some of this in the stuff that was edited out--but I doubt it, since that would have made good copy.In sum, this was good as far as it went, but there was a lot further I would have liked it to go."}, {"review_sentiment": 4.0, "review_text": "I was interested in reading this book because it happened as I was coming of age in the US.  Another reminder of how quickly life can change when people without morals are in power.  It also reconfirms the weakness and fear of humankind which I believe accounts for the misery former friends and colleagues can inflict on you when they feel threatened.  In the end, very few will stand up against tyranny."}, {"review_sentiment": 5.0, "review_text": "I gave up reading it as I got lost in the first 4 chapters.  I just am not math intelligent.  I tried to understand it but just didnt devote enough time to concentrate.  I think it is good."}, {"review_sentiment": 5.0, "review_text": "The only disappointing aspect of this book in my opinion is that parts of the autobiography were not translated.It reads well by a Central European who lived through the Holocaust (Theresienstadt), fascism and Communism. It sheds new light on The Prague Spring and remarkable flowering of Czech and Slovak film, literature and history."}, {"review_sentiment": 4.0, "review_text": "Mr Klima is a lively , witty but  also  a pragmatic  and honest storyteller.His writing is easily digested , and I look forward to entering his world every evening."}]}, "authors": ["Ivan Klíma"], "isbn": "0802121705", "longitude": 14.4212535, "periods": ["1900s"], "title": "My Crazy Century: A Memoir", "word_cloud": "way much tech history enough really everything write best contemporary writer funny move always honest recommend everyone find write style rather dry give way get bore quite informative period history never hear hear interview recently plug interview fascinate soon head job felt check well familiar evil absurdity communism find much surprising compel storyteller cause wonder repeatedly world describe communist whole paradigm create new socialist man big joke unfortunately live give star felt even nearly page seem little short perhaps much lose abridgment edition get next visit thing runner disappoint never learn dealt regime flourish runner sympathize internally exile lot say manage communism not necessarily way manage probably similarity great desire stay homeland opportunity leave remain fact teach still choose return crackdown belong communist party time mostly naively mostly manage live kind grey zone allow write collaborate last year communist regime become pretty strongly identify write abridge version publisher suggest volume translation point promise know end hear life everyone favor freedom downsides writer oppression deep issue write eliminate issue present challenge creativity also friend roughly age grow confess prepare life choice find freedom rather difficult experience freedom gain age know interesting people pretty well unfortunately little say mention time intersect life personal account perhaps understandable case still alive think share perhaps stuff edit doubt good sum good far go lot like interest reading happen come age reminder quickly life change people moral power also reconfirm weakness fear humankind believe account former friend colleague inflict feel threaten end stand tyranny give read get lose first chapter math intelligent try understand dint devote enough time concentrate think good disappointing aspect opinion part autobiography read well central european live fascism shed new light remarkable flower film literature history lively witty also pragmatic honest write easily digest look forward enter world evening", "genres": ["Memoir", "WWII", "Cold War", "Politics"], "summary": "In his intimate autobiography, spanning six decades that included war, totalitarianism, censorship, and the fight for democracy, acclaimed Czech writer Ivan Klíma reflects back on his remarkable life and this critical period of twentieth-century history.\r\n\r\nKlíma’s story begins in the 1930s on the outskirts of Prague where he grew up unaware of his concealed Jewish heritage. It came as a surprise when his family was transported to the Terezín concentration camp—and an even greater surprise when most of them survived. They returned home to a city in economic turmoil and falling into the grip of Communism. Against this tumultuous backdrop, Klíma discovered his love of literature and matured as a writer. \r\n\r\nBut as the regime further encroached on daily life, arresting his father and censoring his work, Klíma recognized the party for what it was: a deplorable, colossal lie. The true nature of oppression became clear to him and many of his peers, among them Josef Škvorecký, Milan Kundera, and Václav Havel. \r\n\r\nFrom the brief hope of freedom during the Prague Spring of 1968 to Charter 77 and the eventual collapse of the regime in 1989’s Velvet Revolution, Klíma’s revelatory account provides a profoundly rich personal and national history.", "asin": "0802121705", "rank": "128775", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51Q8d2Gzm2L.jpg", "country": "Czechia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}