{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 83, "rating": 3.9, "reviews": [{"review_sentiment": 3.0, "review_text": "Beautifully written, but a bit boring.The audible narration was excellent!I loved The Secret River but was disappointed in this book."}, {"review_sentiment": 3.0, "review_text": "It's OK.  I just couldn't get into it."}, {"review_sentiment": 2.0, "review_text": "The lead character is painfully meticulous and detailed and Kate has tried to do the same with the book. It was so painful that I gave up halfway through because it wasn't getting anywhere. It's a shame as I loved Secret River and its sequel but I couldn't recommend this."}, {"review_sentiment": 3.0, "review_text": "I thought it was a little slow in the beginning but worth hanging in there .I think Kate made a very good appraisal of the times ."}, {"review_sentiment": 3.0, "review_text": "OK"}, {"review_sentiment": 3.0, "review_text": "Easy to read.not as good as the secret river.Grenville researches well and her stories are very believable. Good character development  and realistically told."}, {"review_sentiment": 2.0, "review_text": "A bit disappointing and very slow."}, {"review_sentiment": 4.0, "review_text": "A very beautiful and sensitive description of the delicate relationship between the Lieutenant and the indigenous girl.  Fascinating to know that it is based on a true story and that the original language was used from the Lieutenant's notebooks.  An excellent book to read."}, {"review_sentiment": 3.0, "review_text": "I found it an interesting subject matter, but I did not find it a satisfying book to read. A lot of aboriginal \"words\" to read and a very big jump in imagination as to how he understood them. Last part of story where he ended in Batavia left me a little bewildered. A book that I was glad to finish."}, {"review_sentiment": 2.0, "review_text": "Started out well but the ending was really disappointing"}]}, "authors": ["Kate Grenville"], "isbn": "0802145035", "longitude": 151.2164539, "periods": ["1800s", "Recent Releases"], "title": "The Lieutenant", "word_cloud": "beautifully write bit audible narration excellent love disappoint lead character painfully meticulous detailed try painful give halfway get anywhere shame love sequel think little slow begin worth hang think make good appraisal time ok good secret research well story believable good character development realistically tell bit disappointing slow beautiful sensitive description delicate relationship indigenous girl fascinate know base true story original language use notebooks excellent find interest subject matter find satisfy lot aboriginal word big jump imagination understood last part story end leave little bewilder glad finish start well end really disappointing", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Shortlisted for the NSW, QLD and WA Premiers' Literary Awards, The Lieutenant is the profoundly moving tale of a young soldier's arrival in Australia on the First Fleet and the extraordinary friendship he develops with the local Aboriginal people.\r\nDaniel Rooke, soldier and astronomer, arrives in NSW in 1788. He sets up his observatory away from the main camp to begin the scientific work that he hopes will make him famous.\r\n\r\nAboriginal people soon start to visit his isolated promontory, and a child named Tagaran begins to teach him her language. A genuine friendship forms, and Rooke has almost forgotten he is a soldier when a man is fatally wounded in the fledgling colony. The lieutenant faces a decision that will define the course of his entire life.\r\n\r\nIn this profoundly moving novel Kate Grenville returns to the landscape of her much-loved bestseller The Secret River. Inspired by the notebooks of William Dawes, The Lieutenant is a compelling story about friendship and self-discovery by a writer at the peak of her powers.\r\n\r\n'The Lieutenant...has a potency and beauty that lingers in both the heart and mind's eye...an Australian novel that visits a part of Australian black-white history and finds a true heart of goodness there.' Sunday Telegraph", "asin": "0802145035", "rank": "1133237", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/41QO44jnp0L.jpg", "country": "Australia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}