{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 74, "rating": 3.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Larry Kramer details the lives of a group of gay men in NYC in the 70s - the good, bad, and ugly. Kramer does not hide anything and there are explicit scenes and scenes of drug use. The conflict between free sex and a relationship is an important theme. The Drag culture is also detailed. The book is of important historical significance and should be considered a classic in gay literature. Additionally, Kramer employs a writing style that runs fast and is packed with details, innuendos, and humor. A writing triumph and a cultural set piece. Still relevant."}, {"review_sentiment": 2.0, "review_text": "Too many characters and kinda all over the place writing wise. The sex scenes sounded like an adult movie come to life. Read  half of it and had to stop. The characters where too much and it got confusing. I have a lot of respect for the author."}, {"review_sentiment": 2.0, "review_text": "Great works of literature transcend their specific cultural context. \"Hamlet,\" for example, or \"Candide\" or \"Moby-Dick\" or \"The Canterbury Tales\" are still considered masterpieces that resonate with significance and artistic integrity hundreds of years after they were written. Perhaps it is trickier for a satire to preserve its accessibility or its appeal as time passes, since a satire often targets topical rather than timeless concerns. Brilliantly written and insightful satires, such as “A Modest Proposal” and \"Don Quixote,\" however, manage to remain relevant long after their heyday.Sadly, \"Faggots,\" which fancies itself a satire and has been hailed as a tour de force of modern queer literature, merits none of these distinctions. In truth, in can hardly be characterized as a novel at all, since it lacks most of the defining elements of the genre on a very fundamental level—for example, a well-constructed plot or complex and thoughtfully developed characters. The story, such as it is, consists of allegedly witty vignettes or set pieces strung together with little sense of coherence or narrative veracity and populated by an unnecessarily large cast of undeveloped flat characters. A generous reading might presume that Kramer is attempting a stream-of-consciousness style, but if that’s the case, his novelistic skill is not up to the task, since such a style requires profound psychological insight into the complex thought patterns of a character who provides narrative perspective.Upon its publication in 1978, \"Faggots\" sowed controversy due to its graphic depiction of gay sex, fetishes, drug use, incest, and other scandalous “perversities.” To be fair, as a depiction of pre-AIDS era gay culture in New York City, the novel retains great cultural value as an artifact of that specific historical moment. But it cannot be considered a work of literature. One suspects that there is good reason why Kramer, who penned the magnificent play (and later screenplay) The Normal Heart and contributed greatly to queer activism in the latter part of the 20th century, never wrote another novel."}, {"review_sentiment": 5.0, "review_text": "Fair accurate and honest portrayal of part of gay male society at the time."}, {"review_sentiment": 1.0, "review_text": "not enough but secks"}, {"review_sentiment": 5.0, "review_text": "The telling of a close knit group of friends in a time before AIDS Epidemic hit in New York City. Larry Kramer introduces individuals who relate to each us of as if we were intimate pals or lovers. The characters stories intertwine with relationships including sexual escapades and cheap tricks in a dark place we all desire if we were lucky enough to get caught with pants pulled down. I read reviews that some people thought Larry Kramer sold out because he was honest in his storytelling which was a brave act. Nothing in life is guaranteed but he wrote this a few years prior to the AIDS Crisis hit in full force. We remember what the good old days were even if we weren't born prior. You connect with some characters as a few others you become disgusted. Kramer writes honestly. A true documentation of that generation."}, {"review_sentiment": 5.0, "review_text": "There were a few points where I thought, \"well, this is a just a little too much\" and then I would start laughing out loud.  And I laughed out loud a lot. This book reminds me of Gore Vidal's novel \"Duluth\", which I also loved.  But there are other moments when Larry Kramer really discloses so much about what it means to be gay, the hardships, the pain and loneliness and the battle to love and be loved.  Fred, the main character, is a brave soul and I really, really liked him!  He's what I call a stand-up guy."}, {"review_sentiment": 5.0, "review_text": "Larry Kramer classic.  Had to have for my collection."}, {"review_sentiment": 4.0, "review_text": "This is a great novel about the rise and fall of the boy band Mumford and Sons. I give it a full ten out of ten stars for accurately predicting the dot com bubble and the stock market crash. The phantom is not a very good app either but as far as appetizers go i say get the poppers. Loaded cheddar poppers"}, {"review_sentiment": 3.0, "review_text": "Depressing.  As depressing as \"Boys in the Band\"?  Not sure, but certainly presents some of the worst of the characters of gay/queer men.  A period piece?  Sure, but not sure if the same is still going on in various dungeons, parties, woods.  The entire book is about a bunch or gang of 'queens', and I don't hang out with queens.  As I was watching the movie, 'Boys in the Band', at the age of 23, I found myself cringing and tearing up saying to myself:  \"Is this what I have to look forward to?\"  Total depressive thought.  This book is certainly a diatribe of Kramer talking like he really likes talking to himself and being the center of attention, so characteristic of so many 'queens' then and today.  If you're just starting to face your own form of queerness, this isn't the book to read.  Like \"Boys in the Band\", these characters are self-hating men.  The ending itself leaves no sense of hope for Lemish, the main character.  Like the addict, he will continue the pattern of discontent till he really hits rock bottom.  Then, hopefully someone will be around to help him off the ground."}]}, "authors": ["Larry Kramer", "Reynolds Price"], "isbn": "0802136915", "longitude": 0.0, "periods": ["1900s"], "title": "Faggots", "word_cloud": "detail live group gay men good bad ugly hide anything explicit scene scene drug use conflict free sex relationship important theme culture also detail important historical significance consider classic gay literature employ write style run fast pack detail innuendo humor write triumph cultural set piece still relevant too many character kinda place write sex scene sound adult movie come life half stop character much get confuse lot respect author work literature transcend specific cultural context example still consider masterpiece significance artistic integrity hundred year write perhaps trickier satire preserve accessibility appeal time pass satire often target topical rather timeless concern brilliantly write insightful satire however manage remain relevant long fancy satire hail tour force modern queer literature merit none distinction truth hardly characterize lack define element genre fundamental example plot complex thoughtfully developed character story consist allegedly witty vignette set piece together little sense coherence narrative veracity populate unnecessarily large cast undeveloped flat character a generous reading attempt style case novelist skill task style require profound psychological insight complex think pattern character provide narrative publication sow controversy due graphic depiction gay sex fetish drug use incest scandalous depiction era gay culture retain great cultural value artifact specific historical moment consider work literature suspect good reason pen magnificent play later screenplay contribute greatly queer activism latter part century never write accurate honest portrayal part gay male society time enough check tell close knit group friends time hit introduces individual relate intimate pal lovers character story intertwine relationship include sexual escapade cheap trick dark place desire lucky enough get caught pant pull review people think sell honest storytelling brave act life guarantee write year prior hit full force remember good old day even bear prior connect character others become disgusted write honestly true documentation generation point think well little much laugh loud laugh loud lot remind also love moment really disclose much mean gay hardship pain loneliness battle love love main character brave soul really really like call guy classic collection great rise fall boy band give full ten ten star accurately predict dot com bubble stock market crash phantom good app far appetizer go say get popper load cheddar popper depress depress not sure certainly present worst character men period piece sure sure still go various dungeon party woods entire bunch gang hang queen watch movie age find cringe tear say look forward depressive thought certainly diatribe talk really like talk center attention characteristic many today start face form queerness character men end leaf sense hope blemish main character addict continue pattern discontent till really hit rock bottom then hopefully someone around help ground", "genres": ["Fiction & Literature", "LGBT"], "summary": "Larry Kramer's Faggots has been in print since its original publication in 1978 and has become one of the best-selling novels about gay life ever written. The book is a fierce satire of the gay ghetto and a touching story of one man's desperate search for love there, and reading it today is a fascinating look at how much, and how little, has changed.", "asin": "0802136915", "rank": "156680", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41iypN-UZCL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}