{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 56, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "What a ride from poverty in Western Australia to poverty in Armenia and back again. The characters are rich and the story line wonderfully wild."}, {"review_sentiment": 5.0, "review_text": "I was browsing recently at the local used bookstore, and had the fortune of plucking this book randomly off the shelf.  The name \"Gilgamesh\" was the initial draw for me, as I had read \"The Epic of Gilgamesh\" in school.  The plot description- a young Australian girl and her infant son traveling to pre-WWII Soviet Armenia in search of the boy's father- was intriguing not only because of my love of all novels related to WWII, but also because the premise sounded unlike anything I had previously read.I will admit that this book started off slow for me, but I am so happy that I decided not to give up on it.  The story began to unfold in surprising and fascinating turns and, despite the fact that the concept may sound somewhat far-fetched, the author handled the evolution of the storyline and the characters in very authentic and believable ways.I have always felt that the true mark of a wonderful book is the ability to make the reader FEEL something for the characters.  Many times while reading this story I felt strong emotions; I felt the main character's hope, longing, despair, and relief keenly.  The story progressed steadily and closed neatly, while also leaving room for optimism and hope for the rest of the primary characters' lives.  I love books that are somewhat open-ended, as they cause you to think about the possibilities of the future for these characters that have grown dear.  I also learned a good deal about what life was like in rural Australia, as well as in Soviet Armenia.  It's always interesting to learn about the culture and customs of a foreign place.\"Gilgamesh\" is written in a somewhat sparse, non-flowery style that lends itself well to the landscape of the story.  The book was also a relatively short read at approximately 250 pages, which was a nice change from some of the 500-page tomes that I've been reading lately.  It is definitely a book that I will be recommending to all of my reader friends and family!"}, {"review_sentiment": 5.0, "review_text": "I have recently discovered Joan London and love her writing.  This is the third book of hers I have read within the last few months and have enjoyed them all"}, {"review_sentiment": 2.0, "review_text": "I was expecting more. Story line wAs not of particular interest."}, {"review_sentiment": 1.0, "review_text": "Ooohhh myyy Goddddd!! What a bore!! Do not, I mean do not confuse this for The Epic of Gilgamesh! It should be renamed \"Weird book of an knocked up Australian looking for the Daddy in Armenia\""}, {"review_sentiment": 5.0, "review_text": "I loved this book.while reading I drifting through all the locations and really enjoyed the journey. I really enjoyed the narration by Edith through her thoughts. The Characters were so interesting and the story so compelling.Edith and her mother for some reason seemed to weave into one person at times for me, there was something so similar about them but they became so different as they matured. The Mother fearful and that fear made her weaker while Edith became stronger in her fear. We didn’t get to hear to much about Frank, Edith’s Father but I liked him and felt Joan London managed to do a good job of capturing him.The book had a an underlying feeling of tragedy, but it never hit it, but kept me enthralled and reading on. What an interesting woman Edith was. She reminded me of The daughter of fortunes character Eliza taking off in chase of her lover. I actually have read a few books recently with the silly female who turns out strong and determined, loving and Kind. A very Feminist Character that I truly enjoy reading about.I  enjoyed all the Characters in this book.Leopold, he was a fascinating fat man, that in early photographs the sisters made fun of,  but in real life Edith realizes he is full of charm and interest, although Frances refuses to be hood winked by the guests and keeps herself at a distance. Although many years later softens enough to get hood winked by the religious group.There were so many interesting ideas and thoughts put forward in this novel. The book was wonderful and very well written slipping in ideas very cleverly"}, {"review_sentiment": 5.0, "review_text": "I loved this book, an excellent story made better by being familiar with the Western Australia South coast."}, {"review_sentiment": 4.0, "review_text": "This is an unusual story about the epic journey of life. Well written in a reserved almost plain style it allows you to travel with the characters without being weighed down with emotion.  Crossing continents and cultures, and dealing with cruel hardships it is ultimately a story of enduring love and kindness.  The characters feel deeply, both rebelling and accepting the journeys they are on.  Kindnesses in unexpected people and places reflect the random quality of love and life.  Is it a happy ending?  It is an ending full of hope, the beginning of another journey and truly satisfying."}, {"review_sentiment": 4.0, "review_text": "It's a riveting tale. I loved it from the beginning to the end.  The characters really grew on me. I esepciall yliekd the mythical bits about Gilgamesh."}, {"review_sentiment": 4.0, "review_text": "Well written @very good indeed"}]}, "authors": ["Joan London"], "isbn": "0802141218", "longitude": -0.12574, "periods": ["1900s", "Recent Releases"], "title": "Gilgamesh", "word_cloud": "poverty poverty back character rich story line wonderfully wild browse recently local use bookstore fortune pluck randomly shelf name initial draw school plot young girl infant son travel soviet search boy intrigue love novel relate also premise sound anything previously admit start slow happy decide story begin unfold surprising fascinating turn fact concept somewhat author handle evolution story line character authentic believable always felt true mark wonderful ability make something character many time read story felt strong emotion felt main character hope long despair relief keenly story progress steadily close neatly also leave room optimism hope rest primary character live love somewhat cause think possibility future character grown dear also learn good deal life rural well always interest learn culture custom foreign place write somewhat sparse style lend well landscape story also relatively short approximately page nice change tome read lately definitely recommend friend family recently discover love write third last month enjoy expect line wa particular interest my bore mean confuse rename knock australian look love read drift location really enjoy journey really enjoy narration thoughts interesting story mother reason seem weave person time something similar become different mature fearful fear make weaker become stronger fear get hear much like felt manage good job capture underlie feel tragedy never hit kept enthral read interest woman remind daughter fortune character take chase lover actually recently silly female turn strong determine love truly enjoy read enjoy character fascinate fat man early photograph sister make fun real life realize full charm interest refuse hood winked guest keep distance many year later soften enough get hood wink religious many interest idea thought put forward wonderful well write slip idea cleverly love excellent story make better familiar western coast unusual story epic journey life write reserve almost plain style allow travel character weighed emotion cross continent culture deal cruel hardship ultimately story endure love kindness character feel deeply rebel accept journey unexpected people place reflect random quality love life be happy end end full hope begin journey truly satisfy rivet tale love begin character really grow esepciall yliekd mythical bit well write good indeed", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "This is a magnificent book, a story of encounters and escapes, of friendship and love, of loss and acceptance. It is full of sparely depicted but fully fleshed characters and the wide sweep of history.\r\n\r\nIt is 1937. On a tiny farm in the town of Nunderup, in far southwestern Australia, seventeen-year-old Edith lives with her sister Frances and their mother, a beautiful woman who lives mostly in her own mind after the sudden death of Frances and Edith's father. One afternoon two men, Edith's cousin Leopold and his Armenian friend Aram, arrive-taking the long way home from an archaeological dig in Iraq. Among the tales they tell is the story of Gilgamesh, the legendary king of Uruk in ancient Mesopotamia. Gilgamesh's great journey of mourning after the death of his friend Enkidu, and his search for the secret of eternal life, is to resonate throughout Edith's life, opening up the possibility of a life beyond the hardscrabble farm life of her village. When they leave, Leopold to return to London and Aram to Armenia, the house feels suddenly empty and Edith misses them fervently.\r\n\r\nTwo years later, in 1939, Edith sets out on a journey of her own, bringing with her the young son she and Aram conceived, whom he does not know about. Motherhood has clarified Edith-she has become single-minded, unwilling to swerve from her path, no matter what social mores or practical limitations are put in her way. When she is sent to a birthing house to bear Jim, and believes they plan to adopt him out against her will, she sneaks out at dawn and takes him home. She raises him alone, under her sister's disapproving eye and despite the patronizing of Madge Tehoe, her employer at the Sea House hotel. When Madge's brother-in-law Ronnie comes to visit, he tells Edith how easy he has found it to make a life traveling around the world. She finds out how much she'd need to get started, and begins hoarding tips and quietly stealing small sums and useful objects from guests and the hotel.\r\n\r\nEdith believes that if she can get to Armenia, she and Aram will find each other. She catches a ship to London, where she gets to know Irina, Leopold's mother. Leopold himself is off at another dig. Irina tries to dissuade her from going to Armenia, but soon Edith boards the Orient Express in Paris for Armenia. On board, she and Jim are curiosities-a single woman and a toddler, traveling alone. A wealthy old man known only, famously, as Mr. Five Percent (for the five percent share he has in various aspects of Armenia's international trade), attempts to seduce her in his compartment, but she escapes and is befriended by Hagop, a textile trader who was made partially lame when his music school was bombed in a dispute between Armenian nationalists and the secret police. Hagop elects himself as Edith's traveling companion, negotiating her into Armenia despite her lack of a visa, and finding her transport and a place to stay in Yerevan, the capital. She moves into the apartment of a famous Armenian poet, an old blind woman known only as Tati, and becomes her caretaker. Hagop and his wife Nevart, a beautiful, caustic pianist embittered by the ending of her career and being put in a wheelchair by the same explosion in which Hagop was injured. Edith remains in Yerevan, enrolling Jim in school, working herself hard caring for Nevart and Tati, enjoying Hagop's companionship, and once sleeping with a nightclub owner named Manouk. Her responsibilities are eased when Nevart begins singing and playing piano at a hotel nightclub for an audience of Russian soldiers, and eventually moves into the hotel full-time. But in January 1943, things start to become more dangerous-Germany and Russia are locked in combat, and Yerevan is increasingly tense with informers and surveillance.\r\n\r\nIn the first months of 1944 Nevart kills herself, and simultaneously Hagop informs Edith and Jim they must leave, that they are no longer protected from the secret police. He picks them up on the street the afternoon of Nevart's funeral (they did not attend for fear of informers), and puts them in a car with Manouk's cousin, who drives them to the border. On the other side is Leopold. He takes them across Iraq to Syria, elaborating on the Gilgamesh story he had told Edith so many years before, and near Aleppo he installs them in the same orphanage Aram was taken to after his family was killed in the Turkish genocide. As Leopold's Jeep leaves the orphanage, there is an explosion, and Edith and Jim receive word that a British Jeep was blown up by a mine. Edith writes to Irina and receives no answer. They wait there, grieving and listening to news of D-Day and the Russian Front, until finally in April 1945, a year after their arrival in Aleppo, Edith and Jim catch a ride with an Australian transport of soldiers and begin the long journey home. They arrive a year and a half later.\r\n\r\nMuch has changed in Edith's years of travel. Her \"sin\" is no longer so glaring now that she has lived beyond iiiiiit, except in the eyes of Frances, who is flirting with fundamentalism. Jim, however, has an impossible time adjusting to what his mother calls \"home.\" His schoolmates call him a bastard and stare at his dark skin and hair, and Sir, his teacher, is an alcoholic autocrat who implies Jim is from \"barbarous climes.\" Frances fixes on him and is convinced Edith is being too soft, as Jim misses more and more school and becomes depressed. When Sir arrives to enroll Jim in a school for intractable boys in Perth, Edith is at work and Frances signs him over. Edith leaves to collect him as soon as she learns about it, enrolling him in a correspondence school at which he excels.\r\n\r\nJim grows up. Edith meets a man at the nursing home where she works, and his companionship proves a balm to Jim's loneliness and restless frustration. Frances meets a young widow named Lee, whose husband has left her alone on their farm, and the two begin working Lee's land together, and soon Frances is living there and they have become romantic partners as well. Ultimately, as Jim graduates from his school and must decide what to do next, he is waiting for some sort of sign as to what his destiny will be-something along the lines of the impetus that caused Edith to leave Australia, or the face of his father, Aram, he imagined in the foliage at the boarding school before Edith arrived to rescue him. Returning home from the failed attempt to visit Frances (who of course thinks manual labor on her and Lee's farm is the answer to Jim's malaise, by which Jim is infuriated), a letter from abroad is waiting on the table that will unlock Jim's future and the possibility that he will become a writer.\r\n\r\nA stunning novel which Good Reading called \"a small masterpiece,\" Gilgamesh examines what happens when we strike out into the world, and how, like the wandering king, we find our way home.", "asin": "0802141218", "rank": "1449308", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/413hf2biDIL.jpg", "country": "England", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}