{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "Part way through this closely observed, and ultimately depressing, novel, I began noticing an odd affinity for \"The Sun Also Rises\" which I had not read in decades.  Soon it became apparent that this was more than a passing similarity but rather a retelling of the story set in contemporary Trinidad during Carnival, complete with vivid descriptions of food, drink, and in this retelling, drugs, with Trini slang playing the role that Spanish did in the original, adding to the exotic color. (The Carnival setting for retelling the story also recalls Marcel Camus' \"Orfeo Negro.\")Having not read the original in a long time, I cannot remember how Hemingway captures the bacchanalian haze into which his protagonist descends, and I not sure if it was Antoni's writing, or my own jet-lag, but pretty soon the endless Caribs and joints did get hazy. This being the 21st century, the remake is more explicit than the original - the putative source of Jake/William's sexual difficulties is not left to the imagination, though the novel is sufficiently open-ended along many dimensions that one is left space to draw their own conclusions. Love does not conquer all, but it would be happy to think so."}]}, "authors": ["Robert Antoni"], "isbn": "0802170056", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Carnival", "word_cloud": "part way closely observe ultimately depress begin notice odd affinity also rise decade become apparent passing similarity rather retell story set contemporary complete vivid description food drink retell drug slang play role spanish original add exotic color set retell story also recall original long time remember capture bacchanalian haze protagonist descend sure write pretty soon endless joint get hazy century explicit original putative source sexual difficulty leave imagination sufficiently along many dimension leave space draw conclusion conquer", "genres": ["Fiction & Literature"], "summary": "Robert Antoni has established himself as one of the most innovative voices to emerge from the Caribbean and the Americas. His ambitious third novel, Carnival, takes us on an expedition that stretches from contemporary New York City to the glitter of Trinidadian Carnival, and deep into the island's mountainous interior. \r\n\r\nNarrator William Fletcher is an aspiring novelist who has come to New York to escape his affluent West Indian roots. A chance meeting in a Greenwich Village bar reunites him with two of his childhood companions: Laurence and the vivacious and stunning Rachel, William's first love. Together, the three make a liquor-soaked pledge to return \"home\" to Trinidad for Carnival. The festival starts with passion and pleasure, but the Carnival ecstasy slides into a fog of ganja, alcohol, and the endless calypso beat. \r\n\r\nAs William, Rachel, and Laurence journey to a remote area of the rainforest to \"cool down\" after the festival, the three hope for a secret paradise, hidden \"behind God's back,\" to begin anew. But even here the demons of history, prejudice, and hatred violently intrude, as the novel's startling conclusion forces them to face both the power-and impotence-of human resilience and human love.", "asin": "0802170056", "rank": "2588685", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41H8l-RQP-L.jpg", "country": "Trinidad and Tobago", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}