{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": -33.928992, "ratings": {"num_ratings": 160, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Love this story teller and on the third novel."}, {"review_sentiment": 5.0, "review_text": "Excellent whodunit!"}, {"review_sentiment": 5.0, "review_text": "So enjoyable and so very South African. An interesting novel well written with characters who are very believable. Looking forward to reading another of his books."}, {"review_sentiment": 5.0, "review_text": "I really like Deon Meyer's books.  I'm reading them in order and my  local library didn't have this in their collection either physical or electronic. This book came in very good condition."}, {"review_sentiment": 4.0, "review_text": "Fast moving and full of suspense. The main characters problems do not overshadow the story but gives a break in the story line. Very enjoyable read and really getting to know the main character and what he is going through."}, {"review_sentiment": 4.0, "review_text": "Enjoy his style of writing.  Definitely a few twists but very enjoyable."}, {"review_sentiment": 5.0, "review_text": "You can't put Deon Meyers books down. Gripping , yet so much amazing details, ... and every time something nice happens to Benny, life hits back"}, {"review_sentiment": 3.0, "review_text": "Not his best."}, {"review_sentiment": 5.0, "review_text": "Enjoy all his books"}, {"review_sentiment": 4.0, "review_text": "Entertaining"}]}, "authors": ["Deon Meyer"], "isbn": "0802121748", "longitude": 18.417396, "periods": ["2000s", "Recent Releases"], "title": "Seven Days", "word_cloud": "story teller third excellent whodunit so enjoyable interesting well write character believable look forward read really read order local library collection physical electronic come good condition fast move full suspense main character problem overshadow story give break story line enjoyable really get know main character go style write definitely twist enjoyable yet much amazing detail time something nice happen life hit back not best enjoy entertain", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 3/5 in Benny Griessel\r\n\r\n\"I'll shoot a policeman every day until you arrest the murderer of Hanneke Sloet.\"\r\n\r\nShortly after the South African Police Services receive this threatening email, a policeman is shot by a sniper and recovering alcoholic Benny Griessel is ordered to reopen the Sloet case.\r\n\r\nHanneke Sloet was a sensual and ambitious lawyer. At the time of her murder she was working on one of the biggest Black Empowerment deals in South African history. She was found dead in her luxury Cape Town apartment, a single stab wound to her chest.\r\n\r\nAfter forty days, the trail has gone cold. The first investigation could find no motive and no leads, only a set of nude photographs, an ex-boyfriend with a rock-solid alibi, conniving attorneys and financial double-dealing.\r\n\r\nBenny has to deal with immense pressure from his superiors, the media and the unfathomable sniper, whose emails keep coming and who won't stop shooting. And then there's Benny's love interest, former pop sensation Alexa Barnard, who is also trying to rebuild her life after the ravages of alcohol, and Benny has to make sure she stays sober for her comeback.\r\n\r\nAt the same time, Benny's feisty colleague, Captain Mbali Kaleni, is hunting the shooter, trying desperately to find what connects him to Hanneke Sloet.\r\n\r\nBoth Benny and Mbali are about to endure seven days of hell.", "asin": "0802121748", "rank": "1146860", "city": "Cape Town", "image": "https://images-na.ssl-images-amazon.com/images/I/518dAvyPLAL.jpg", "country": "RSA", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}