{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 159, "rating": 3.3, "reviews": [{"review_sentiment": 4.0, "review_text": "When I was finished, I couldn't tell if I liked the book or not. Too be honest it's hard not to get a bit lost in the long periods of mental rambling, but I guess that's the point after all. I'm glad I have read it though."}, {"review_sentiment": 5.0, "review_text": "Excellent reading. Having been to Ireland while studying 10 yrs at, Cambridge UK International summer school, was well aware of the goings on of  Trinity scholars (not much different than Cambridge and the \"Neo Pagans\"). Also, my Nana from the old sod, gave me quite a history of her home land so nothing in the book shocked me In fact found it quite believable, as well as enjoyable. Do understand the refusal of the Irish press to publish the book in the religious fervor of the time. Brendan Behan's autobiography is another book akin to Donleavy's. For those who enjoy biographies it will be another Irish escapade."}, {"review_sentiment": 1.0, "review_text": "This was billed as a comic masterpiece chronicling the doings of a presumably lovable scoundrel. It's nothing of the sort. The protagonist, Sebastian Dangerfield, is one of the most execrable characters I've ever \"met.\" A physically abusive and borderline insane drunk, a sociopath. I generally love dark characters, but Dangerfield has no redeeming qualities that I can identify. He beats his wife, he beats another woman, he attempts to murder his child. He gets drunk, launches incoherent soliloquys that are in no way amusing or insightful, and engages in \"escapades\" that are in essence prolonged bar fights. The other characters in the book serve no purpose other than to enable his behavior - the men by funding him and drinking with him, the women by having sex with him despite his psychological and physical abuse.I did finish the book, in part because Donleavy does have real literary talent, and in part because I couldn't believe a book that's survived this long could be this bad all the way through. This is, however, in no way an enjoyable book. Don't make the mistake I did of slogging through 338 pages of this garbage."}, {"review_sentiment": 3.0, "review_text": "It had all the extra-ordinary attributes that many reviewers had told me about, but by 30 pages into it I realized that I'd rather spend my time reading fiction that lifts me up or non-fiction that educates me. I also realized:  that's what I get for being 77 years old."}, {"review_sentiment": 3.0, "review_text": "A unique style of writing which is interesting and fun for a while.Characters all despicable. A major plot hoe."}, {"review_sentiment": 3.0, "review_text": "Best for someone who has some knowledge of Ireland and/or the British Isles.  Bawdy - not for prudes.  Difficult to relate to the main character, but maybe some people are that f***ed up."}, {"review_sentiment": 5.0, "review_text": "This is a great book. It has a sense of humor that fans of Don Quixote will appreciate without having to read 1600 pages. If you are a fan of tilting the occasional pint and always wished to visit Ireland this book's for you. Fans of Wimpy from the Popeye cartoons will also be able to relate to this book. Get this book, read it, laugh and share it with others. Your life will be improved."}, {"review_sentiment": 5.0, "review_text": "A true classic"}, {"review_sentiment": 4.0, "review_text": "Loved it. It is a fairly good piece of entertainment, both funny and maybe am the only one to found it so, weirdly moving. Mr.Smith somehow unfair loneliness touched me. After all, he is seeking for love. The way Donleavy writes it makes it quick in action, so, it is never boring. Shows one can have a fortune and feel inner sadness: because of loneliness? Found laughter and a sort of melancholy in the whole, very understandable. Some passages went fixed in my memory, such as the one of Smith throwing notes through his window while snowing, with his secretary in that bedroom. A singular man? Be sure he is. A remarkable work, as good as \"Fairy tale in New York\" and others. Really, love Donleavy and his unusual stories."}, {"review_sentiment": 5.0, "review_text": "I'm only part way through this book but it is totally hilarious. Painful at times. #99 on the Modern Libraries best to the century list."}]}, "authors": ["J. P. Donleavy"], "isbn": "0802144667", "longitude": -6.2602732, "periods": ["1900s"], "title": "The Ginger Man", "word_cloud": "finish like honest hard get bit lose long period mental ramble guess point glad excellent read have study yr summer school well aware going scholars much different also old sod give quite history home land nothing shock fact find quite believable well enjoyable irish press publish religious fervor time autobiography akin enjoy biography escapade bill comic masterpiece chronicle doings presumably lovable scoundrel nothing sort protagonist sebastian execrable character ever meet physically abusive borderline insane drunk sociopath generally love dark character redeem quality identify beat wife beat woman attempt murder child get drunk launch incoherent soliloquy way amuse insightful engages escapades essence prolong bar fight character serve purpose enable behavior men fund drink woman sex psychological physical finish part real literary talent part survive long bad way however way enjoyable slog page garbage attribute many reviewer tell page realize rather spend time reading fiction lift educate also realize get year old unique style write interesting fun major plot hoe someone knowledge prudes relate main character maybe people great sense humor fan appreciate page fan tilt occasional pint always wish visit cartoon also able relate share others life improve true classic love fairly good piece entertainment funny maybe find weirdly move somehow unfair loneliness touch seek love way write make quick action never boring show fortune feel inner sadness loneliness laughter sort melancholy whole understandable passage go fixed memory throw note snow secretary bedroom singular sure remarkable work good tale others really unusual story part way totally hilarious time best century list", "genres": ["Fiction & Literature"], "summary": "First published in Paris in 1955, and originally banned in the United States, J. P. Donleavy’s first novel is now recognized the world over as a masterpiece and a modern classic of the highest order. Set in Ireland just after World War II, The Ginger Man is J. P. Donleavy’s wildly funny, picaresque classic novel of the misadventures of Sebastian Dangerfield, a young American ne’er-do-well studying at Trinity College in Dublin. He barely has time for his studies and avoids bill collectors, makes love to almost anything in a skirt, and tries to survive without having to descend into the bottomless pit of steady work. Dangerfield’s appetite for women, liquor, and general roguishness is insatiable—and he satisfies it with endless charm.", "asin": "0802144667", "rank": "60329", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51QhBLDVTxL.jpg", "country": "Ireland", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}