{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 175, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "This was my first Penelope Lively book and I loved it."}, {"review_sentiment": 4.0, "review_text": "A solid piece of work about the pain of loss in WW II, the Egyptian campaign, and how it affects one's life. Brilliant and evocative, in style similar to The English Patient. Worth the time and effort of perusing a deeply personal narrative."}, {"review_sentiment": 4.0, "review_text": "Excellent writing, however I found the lead character Claudia portrayed with a horrible personality."}, {"review_sentiment": 3.0, "review_text": "The characters were so cold and unlikable, and they took themselves too seriously."}, {"review_sentiment": 5.0, "review_text": "Wonderful, compelling read"}, {"review_sentiment": 5.0, "review_text": "There are passages in this book that were so visceral and so outstanding that I highlighted them for future reference"}, {"review_sentiment": 4.0, "review_text": "Very clever"}, {"review_sentiment": 2.0, "review_text": "Clever but main character is too narcisstic and unlikable me for me to care much about her past or present life. Love this author but this book was not a favorite."}, {"review_sentiment": 2.0, "review_text": "This is the fourth Penelope Lively book I have read and my least favorite because I found the main character, Claudia repulsive as  a person and as a woman.  She's a rebeliousl, always argumentative, contrary, feeling superior always to everyone in her life, even on her death bed.  The only people she has loved in her life is her brother, Gordon and Tom, the tank commander she met in Egypt during WWII when she was a war correspondent.  She was almost likable in his company.Her attempts to write history (and the narrative goes in and out of the present) are not a chronological sequence of history but more of her opinions on historical events.  After a while, it sounds pretty self-serving and tedious.  The part of the book that is interesting, in fact, saves it is the romance with Tom, and the diary he leaves behind of his experiences at the front before he is killed.  His sister sends the diary to Claudia.  This prevents the book from becoming a total waste of time. I could hardly wait to finish it.  It's a departure for this author and I was very disappointed."}, {"review_sentiment": 5.0, "review_text": "completely satisfied and as described"}]}, "authors": ["Penelope Lively"], "isbn": "0802135331", "longitude": 31.243666, "periods": ["1900s"], "title": "Moon Tiger", "word_cloud": "first love solid piece work pain loss campaign affect life evocative style similar english time effort peruse deeply personal narrative excellent write however find lead character portray horrible personality character cold unlikable take seriously wonderful compelling passages visceral outstanding highlight future reference very clever main character narcissistic unlikable care much past present life author favorite fourth least favorite find main character repulsive person woman rebellious always argumentative contrary feeling superior always everyone life even death bed people love life brother tank commander meet war correspondent almost likable attempt write history narrative go present chronological sequence history opinion historical event sound pretty tedious part interest fact save romance diary leaf experience front kill sister send diary prevent become total waste time hardly departure author disappoint completely satisfied described", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "Penelope Lively's Booker Prize winning classic, Moon Tiger is a haunting story of loss and desire.\r\n\r\nClaudia Hampton - beautiful, famous, independent, dying.\r\n\r\nBut she remains defiant to the last, telling her nurses that she will write a 'history of the world . . . and in the process, my own'. And it is her story from a childhood just after the First World War through the Second and beyond. \r\n\r\nBut Claudia's life is entwined with others and she must allow those who knew her, loved her, the chance to speak, to put across their point of view. There is Gordon, brother and adversary; Jasper, her untrustworthy lover and father of Lisa, her cool conventional daughter; and then there is Tom, her one great love, found and lost in wartime Egypt.\r\n\r\n'Leaves its traces in the air long after you've put it away' Anne Tyler", "asin": "0802135331", "rank": "86035", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51UDyXPzRjL.jpg", "country": "Egypt", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}