{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 89, "rating": 3.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Still reading it, but so far... Marvelous!"}, {"review_sentiment": 3.0, "review_text": "not my taste"}, {"review_sentiment": 3.0, "review_text": "Hot for hippie 1960's smut. If you want to read something more cutting edge and graphically sweat inducing try Take Her to the Dark Side, by Anonymous. It has resurfaced from Europe, good stuff."}, {"review_sentiment": 1.0, "review_text": "Read enough to figure out what it was about. Tempted to read more, but thought better not to.  Would not recommend unless you feel the need to be stirred up by the sexual thoughts and  exploits of another.  This book was referred to by some writers in some  articles about writing that  I had been reading --  as having been  very influential to them as young men, so I thought I would read it to see why.  I had no idea what the book was about.  Didn't take long to see how reading such a book might profoundly affect a young man.  If I had read it when I was a young man or teenager it would surely have thrown gasoline on a fire that was already raging. Maybe every young man has lived his own version of this book to some extent.  As far as how studying this writing for technique might add to the toolbox of a writer, I surely do not know, but think that maybe subject matter can overwhelm and override such considerations -- maybe like a well written book on torture might be safely left off of one's  reading list."}, {"review_sentiment": 1.0, "review_text": "Lordy what a waste of ink and paper."}, {"review_sentiment": 5.0, "review_text": "One of the best author of thee 20th century"}, {"review_sentiment": 5.0, "review_text": "Most brilliant and compelling author I have ever come across. I read this in less than a month. Henry Miller was so advanced for his time."}, {"review_sentiment": 5.0, "review_text": "I keep coming back to this book; a cosmodemonic, sesquipedalian literary missile aimed right at the heart of hubris and delusion (including his own). It's staggering to think this novel was written before the outbreak of WWll."}, {"review_sentiment": 2.0, "review_text": "First Henry Miller book I've read.  Probably the last.  Unusual writing style.  Rambling, free-thinking, hard to follow.  Found myself anxious to finish."}, {"review_sentiment": 5.0, "review_text": "The story is in the late 20s and early 30's of past decade, but still, the narrative, the crudeness is so actual that really strikes anyone with a troubled soul  ... any human I guess"}]}, "authors": ["Henry Miller"], "isbn": "0802151825", "longitude": 0.0, "periods": ["1900s"], "title": "Tropic of Capricorn", "word_cloud": "still read far marvelous taste hippie smut want something cut edge graphically sweat inducing try take resurface good stuff enough figure think better feel need stir sexual thought exploit refer writer article write read influential young men think idea long see reading profoundly young man young man teenager surely gasoline fire already rag maybe young man live version extent far study write technique toolbox writer surely know think maybe subject matter overwhelm consideration maybe like well write torture safely reading list waste ink paper best author thee century most brilliant compelling author ever come less month advance time keep come back cosmodemonic sesquipedalian literary missile aim right heart hubris delusion include staggering think write outbreak probably last unusual writing style ramble hard follow anxious finish story late early past decade still narrative crudeness actual really strike anyone troubled soul human guess", "genres": ["Fiction & Literature"], "summary": "Banned in America for almost thirty years because of its explicit sexual content, this companion volume to Miller’s Tropic of Cancer chronicles his life in 1920s New York City. \r\n\r\nFamous for its frank portrayal of life in Brooklyn’s ethnic neighborhoods and Miller’s outrageous sexual exploits, The Tropic of Capricorn is now considered a cornerstone of modern literature.\r\n\r\n\"A superb entertainment that brings in jeremiads, casual lyrics, and sudden reaches toward the spiritual core of life . . .\" The New York Times Book Review\r\n\r\n\"Miller has once and for all blasted away the very foundation of human hypocrisy--moral, social, and political. . . . The grandest passages are the scenes of lovemaking. They join in a grand paean to all that is still joyous, healthy, happy, and affirmative.\" The Nation\r\n", "asin": "0802151825", "rank": "295937", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41HjkC88s%2BL.jpg", "country": "Brooklyn", "story_arc": ["Tragedy", "Things only get worse"]}