{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 13, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Everyone of Sallis's bug books is great."}, {"review_sentiment": 5.0, "review_text": "James Sallis takes us through the sweep of a man’s life as we follow New Orleans detective-turned-novelist Lew Griffin through four missing persons cases over a period of three decades.  The novel opens on a frightening scene in Lew’s early years when he killed a man and appeared to derive some sadistic satisfaction from it.  After that, there is little introspection in his first-person narrative, almost as if he is afraid to look too deeply into himself.  Lew and the people in his life have their triumphs and their setbacks.  Not everything that happens to them is bad.  Yet there is always a bleakness waiting to creep in, and even as life goes on all around him, it becomes increasingly clear that Griffin is a man who will always be alone, no matter who he is with.  This does not read like the first novel of a series and I am very interested to see how Sallis carries on from here."}, {"review_sentiment": 5.0, "review_text": "These books (the entire series) are the work of a master playing with the genre. Clear nods to Chandler by focusing more on an unforgettable character than on plot, but the interplay between the stories and the man are tighter. Our hero drinks and wisecracks but the drink and wisecracks don't hold him aloof from the horror and mayhem he encounters and instigates. They consume him. And 'wisecracks' is wrong. Lew Griffin's insights are too nuanced, poetic.In a nod to Queneau (haven't read him, but narrator-as-author references him quite a lot) he breaches the fourth (and fifth) walls with fluidity and pleasing effect: the dreamlike quality of a retrospective, self-aware, forgetful, reflexive, reconstructive, insights revealed in layers. Chapter 32 in Moth is a particular delight.They're brilliant, fun, playful, and among the most enjoyable books I've ever read.Make sure you read them in order as Amazon switches 2 and 3 (I think):1. The long-legged fly2. Moth3. Black hornet4. Eye of the cricket5. Bluebottle6. Ghost of a flea"}, {"review_sentiment": 5.0, "review_text": "recommended.  a nice slant on the hardboiled detective"}, {"review_sentiment": 1.0, "review_text": "The mention of Raymond Chandler and Ross Macdonald was enough to make me buy this book, but also the reason I rank it this low. When there is no comparison, mentioning these authors backfires. There probably are comparable authors but none come to mind."}, {"review_sentiment": 4.0, "review_text": "I'm surprised that this wonderful book has so few reviews on Amazon.  A sad, beaten-down detective with a good heart and a quick punch.  Fully fleshed out characters, including past and present lovers.  I felt like I was living in the seedy areas of New Orleans, sympathetic to the downtrodden and hating those that prey on them."}, {"review_sentiment": 4.0, "review_text": "\"In the darkness things always go away from you. Memory holds you down while regret and sorrow kick the hell out of you.  The only help you'll get is a few hard drinks and morning.\"This book is unlike any other detective novel I've read. You know how in all detective stories you get the sense that the case our hero is investigating is a stand-out case for him amongst all of his smaller, regular cases? That it's a a mystery that he'll probably remember forever and is worth dedicating a book to above the others? Well, The Long-Legged Fly focuses instead on those OTHER cases: the everyday ones, the day-to-day work. The book can barely be considered a novel; it's more of a series of short stories highlighting key times throughout different decades in Creole private detective (and part-time insurance strong-arm) Lew Griffin's life as an individual instead of just a hard-boiled dick. Even though the mysteries are fairly tame and inconsequential, each decade finds Lew as a different person, a complex man that finds himself and loses himself again, that evolves and transforms throughout the years, as any person would.  \"The world doesn't change, and mostly we don't either, we just go on looking into the same mirror, trying on different hats and expressions and new sets of vice, opinion, and prejudice; pretending, as children do, to see and feel things that are not there.\"It's also written by James Sallis, who is not only a crime novelist but also a poet, philosopher, and musician. He fills the book with sometimes drunken but always poignant ruminations on life, the blues, and classic literature. Although the book's structure makes it sometimes difficult to be engaged in the superficial story, the character of Lew Griffin is the star of the show, and it's fascinating watching him evolve. I really enjoyed this one. Sallis is a really gifted writer and I'm interesting in seeing where Griffin goes from here.  \"Maybe the best parts of our lives are always over. Maybe happiness, contentment, are things we only recollect through the filters of time, elusive ghosts forever behind us.\""}, {"review_sentiment": 2.0, "review_text": "no, i won't read any more of these. i love noir and detective fiction. this one brought nothing new to the table and did not hold my interest. it verged on metafiction. in the vernacular that means he was too much up his own rectum.i love chester himes and this author wrote a good biography of himes. but there is nothing particularly black about this hero. and what is black seems lifted from and explicitly credited to classic black authors and figures.the drunk detective shtick is becoming seriously tiresome. new orleans/drunk: james lee burke has done that to death. inability of loner detective to commit: yawn.wow. he speaks a few words of french, and next thing you know he is a PROFESSOR? ditto he gets a BA and he is a professor? speaking as a phd, i wish it were that easy.the book he is writing becomes the book you are reading..... this is not the kind of book i want to be reading."}, {"review_sentiment": 3.0, "review_text": "The Long-legged Fly is the debut of Lew Griffin, a tough black private eye in New Orleans. This book takes place over four different time periods and each one gives us a glimpse at the life of Griffin.It is a detective novel but not really a detective novel, as there is no crime solving going on, it is more a story of a man and his issues.The novel is not badly written at all and it does have moments of quality but I just feel that it was lacking a coherent storyline. Maybe the author was trying to be too brief (about 180 pages), but I found myself thinking that James Sallis is a quality writer but the book was quite ordinary."}, {"review_sentiment": 3.0, "review_text": "I liked it. Lew Griffin, private detective, is a damaged man. He is an alcoholic who has blackouts and has spent time in hospitals due to his drinking. But he is wise to the hard streets of New Orleans and a good detective. This is the first in the series and consists of three cases. Along the way we learn who Griffin is and some of the why that he is a damaged man, one thing being his son went missing while traveling and never was heard from again. It is definitely a good read."}]}, "authors": ["James Sallis"], "isbn": "0802776205", "longitude": -90.0701156, "periods": ["1900s"], "title": "The Long-Legged Fly", "word_cloud": "everyone bug great take man life follow miss person case period decades open frighten scene early year kill man appear derive sadistic satisfaction little introspection narrative almost afraid look deeply people life triumph setbacks not everything happen bad always bleakness wait even life go becomes increasingly clear man always alone matter first series interested see carry entire series work master play genre clear nod focus unforgettable character plot interplay story man hero drink wisecrack drink wisecrack hold aloof horror mayhem encounter instigate consume wrong insight nuanced nod reference quite lot breach fourth fifth wall fluidity please effect dreamlike quality retrospective forgetful reflexive reconstructive insight reveal layer particular brilliant fun playful enjoyable ever sure order switch think flea recommend nice slant hard boiled detective mention enough make buy also reason rank low comparison mention author backfire probably comparable author none come mind surprise wonderful review amazon sad detective good heart quick punch flesh character include past present lover felt live seedy area sympathetic downtrodden hating prey darkness thing always go away hold regret sorrow kick hell help hard drink morning detective know detective story get sense case hero investigate case among st smaller regular case mystery probably forever worth dedicate others well focus instead case everyday one work barely consider series short story highlight key time different decade private detective insurance life individual instead dick even mystery fairly tame inconsequential decade find different person complex man find lose evolves transforms year person world change mostly look mirror try different hat expressions new set vice opinion prejudice pretend child see feel thing also write crime novelist also poet philosopher musician fill sometimes drunken always poignant rumination life blue classic literature structure make sometimes difficult engage superficial story character star show fascinate watch evolve really enjoy really gift writer interest see go maybe best part live always maybe happiness contentment thing recollect filter time elusive ghost forever nor detective fiction brought nothing new table hold interest verge meta fiction vernacular mean much chester home author write good biography home nothing particularly black hero black seem lift explicitly credit classic black author drink detective shtick become seriously tiresome new james lee do death inability loner detective commit speak word french next thing know ditto get professor speak pd wish writing become read kind want reading debut tough black private eye take place different time period give glimpse life detective really detective crime solve go story man badly write moment quality feel lack coherent story line author try brief page find think quality writer quite ordinary like private detective damage man alcoholic spent time hospital due drinking hard street good detective first series consist case way learn damage man thing son go miss travel never hear definitely good", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Take a little James Lee Burke, a touch of Ross Macdonald, and a dash of Raymond Chandler, the conventions of the classic American detective story and the fine, thoughtful writing of an original new talent - and you still don't quite have The Long-Legged Fly. This is a smart, tough novel teeming with life and always on the verge of igniting from its own energy. \r\n\r\nIn steamy modern-day New Orleans, black private detective Lew Griffin has once again taken on a seemingly hopeless missing persons case. The trail takes him through the underbelly of the French Quarter with its bar girls, pimps, and tourist attractions. As his search leads to one violent dead end, and then another, Griffin is confronted with the prospect that his own life has come to resemble those he is attempting to find; he is becoming as lost as the frail identities he tries to recover. Waking in a hospital after an alcoholic binge, Griffin finds another chance in a nurse who comes to love him, but again he reverts to his old life in the mean streets among the predators and their prey. When his son vanishes, Griffin searches back through the tangles and tatters of his life, knowing that he must solve his personal mysteries before he can venture after the whereabouts of others. \r\n\r\nThe Long-Legged Fly is exciting, visceral entertainment that takes the reader into a corner of society where life is fought for as much as it is lived. James Sallis has written a compelling novel that succeeds both as detective fiction and worthy literature.", "asin": "0802776205", "rank": "1753513", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/517O-gG8BqL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}