{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 25, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "good value"}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "This is not over-rated at all,,,,I own all of Kerouac's work and though he does have excellent poems and prose outside this book, this is his Diamond of Poetry, so to say. Words are meant to be magical and this work of art has power beyond most others. I have to order a new copy because mine is falling apart. A message to all Kerouac collectors....before you buy \"Some of the Dharma\", \"Book of Blues\", or any other of his \"poem' books or abstract prose books such as \"Old Angel Midnight\", get this 1st. This book should be required reading in college with classes not only pertaining to writing, but mind expansion and words as tool for magic and transportation, A Must own"}, {"review_sentiment": 1.0, "review_text": "overrated"}, {"review_sentiment": 2.0, "review_text": "This was heavy reading. Too much buddhism to my taste. I have liked other poetry bu kerouac better."}, {"review_sentiment": 5.0, "review_text": "Classic, great condition A+++"}, {"review_sentiment": 5.0, "review_text": "Great book"}, {"review_sentiment": 5.0, "review_text": "Love this book!!  Kerouac at its finest!"}, {"review_sentiment": 5.0, "review_text": "Not a beatnikor a hipsterbut good rhythmshere bezamdobebiz jam.Actually, most of the time I had to set the words to hip-hop tunes to not feel my black turtleneck choking me while the sound of bongos drowned out my screams.But I guess it's a classic."}, {"review_sentiment": 5.0, "review_text": "Good poetry book. The response was quickly and the product came safe to my home, it was a good buy."}]}, "authors": ["Jack Kerouac"], "isbn": "0802130607", "longitude": -99.1333416, "periods": ["1900s"], "title": "Mexico City Blues: 242 Choruses", "word_cloud": "good value excellent work excellent poem prose say meant magical work art power others order new copy mine fall apart message collector buy poem abstract prose required reading college class pertain write mind expansion word tool magic transportation must overrate heavy reading much buddhism taste like poetry bu kerouac better classic great condition great finest not hipster but good rhythms here bezamdobebiz time set word tune feel black turtleneck choke sound bongo drown guess classic good poetry response quickly product come safe home good buy", "genres": ["Fiction & Literature", "Poetry"], "summary": "Kerouac's most important poem, Mexico City Blues, incorporates all the elements of his theory of spontaneous composition. Memories, fantasies, dreams, and surrealistic free association are all lyrically combined in the loose format of the blues to create an original and moving epic. \r\n\r\n\"I want to be considered a jazz poet blowing a long blues in an afternoon jam session on Sunday. I take 242 choruses; my ideas vary and sometimes roll from chorus to chorus or from halfway through a chorus to halfway into the next.\" \r\n\r\n\"A spontaneous bop prosody and original classic literature.\" Allen Ginsberg", "asin": "0802130607", "rank": "416345", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/41YIarKnKOL.jpg", "country": "Mexico", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}