{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 47.6038321, "ratings": {"num_ratings": 39, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Awesome book. So weird and fun. I look forward to reading more from Ryan Boudinot."}, {"review_sentiment": 3.0, "review_text": "It took a long time to get going in this book, understanding that there various timelines. When I finished I couldn't decide if I was satisfied or disappointed. Some will probably love all the metaphors and social commentary, and others will never get far enough to know they're there."}, {"review_sentiment": 5.0, "review_text": "This is really a disturbing, but sometimes humorous, look at a very believable dystopian future. Well written, takes a logical conclusion to some of our edgy technology, like, being able to grow human organs on mice and rabbits...... well there's a huge herd of lazy, stoopid and broke HUMANS that would probably be a wonderful garden for needed ( by the wealthy ) human body parts.......see a young, dysfunctional but chemically clean, woman with new penises growing from most of the free surface of her body..........well paid of course.If it can help us stop ( probably not ) well worth reading.Thanks"}, {"review_sentiment": 4.0, "review_text": "My ex-sister-in-law, herself an accomplished author, teaches a Sci-Fi course and this one is on her syllabus, It's a wild ride, full of fantasy sequences that might leave you scratching your head. Stick with the first fifty pages or so, and I think you'll really enjoy this work, because the many flights of fancy are firmly rooted in a strong, driving plot."}, {"review_sentiment": 1.0, "review_text": "Bizarre, poorly written. Author needs to go to a low residency (at least) mfa program."}, {"review_sentiment": 5.0, "review_text": "Ever changing, but constantly drawing you in.A smart trip into a blend of dystopia and fantasy.Don't read it too quickly..."}, {"review_sentiment": 2.0, "review_text": "Somehow some people are controlled by evil people with the a technology that allows other folks to store their memories for later reminiscing. Characters are developed with great detail and then pretty much forgotten, like those memories. And did I mention that there are clones and zombies? (I usually avoid any book with zombies, but they snuck in there near the end.)Kurt Vonnegut advises that writers \"give ... readers as much information as possible.... such ... that they could finish the story themselves, should cockroaches eat the last few pages.\" This book would have been better if the author had followed Vonnegut's advice. Though no insects devoured the book's ending, it still didn't add up for me."}, {"review_sentiment": 1.0, "review_text": "Incoherent and overly complicated.  don't get it."}, {"review_sentiment": 5.0, "review_text": "Couldn't put it down!  Best sci-fi I've read in years."}, {"review_sentiment": 2.0, "review_text": "A rag tag mess of a book I likely wouldn't have finished if I hadn't been stuck in an airport waiting for a delayed flight.  While it's a page turner, it's a bit like Dan Brown in that you're not really satisfied when you finish - nor do you recall the ending a few days later.  & how frustrating that the wild bits the summary references are truly only that - bits that get brought up and are *never* referenced again over the course of the story.  Might have been better suited as a series of short stories as this barely hangs together as it is."}]}, "authors": ["Ryan Boudinot"], "isbn": "0802170919", "longitude": -122.3300624, "periods": ["2000s", "Recent Releases"], "title": "Blueprints of the Afterlife", "word_cloud": "weird fun look forward read take long time go understand various timeline finish satisfy disappointed probably love metaphor social commentary others never get far enough know really disturb sometimes humorous look believable dystonia future write take logical conclusion technology able grow human organ mice rabbit well huge herd lazy stupid break probably garden need wealthy human body part young dysfunctional chemically clean woman new penis grow free surface body pay help probably well worth accomplished author teach course syllabus wild ride full fantasy sequence scratch head first fifty page think really enjoy work many flight fancy firmly root strong driving plot poorly write need go low residency least mfa program ever change constantly draw smart trip blend dystonia quickly somehow people control evil people technology allow folk store memory later reminisce develop great detail pretty much forgotten memory mention clone zombie usually avoid zombie snick near end advise writer give reader much information possible story cockroach eat last page author follow advice insect devour end still overly complicate get put year rag tag mess likely stuck airport wait delay flight page turner bit really satisfy finish recall end day later frustrate wild bit summary reference truly bit get bring referenced course story better suit series short story barely hang together", "genres": ["Fiction & Literature", "Satire"], "summary": "From the “wickedly talented” (Boston Globe) and “darkly funny” (New York Times Book Review) Ryan Boudinot, Blueprints of the Afterlife is a tour de force.\r\n\r\nIt is the Afterlife. The end of the world is a distant, distorted memory called “the Age of F***ed Up Shit.” A sentient glacier has wiped out most of North America. Medical care is supplied by open-source nanotechnology, and human nervous systems can be hacked.\r\n\r\nAbby Fogg is a film archivist with a niggling feeling that her life is not really her own. She may be right. Al Skinner is a former mercenary for the Boeing Army, who’s been dragging his war baggage behind him for nearly a century. Woo-jin Kan is a virtuoso dishwasher with the Hotel and Restaurant Management Olympics medals to prove it. Over them all hovers a mysterious man named Dirk Bickle, who sends all these characters to a full-scale replica of Manhattan under construction in Puget Sound. An ambitious novel that writes large the hopes and anxieties of our time—climate change, social strife, the depersonalization of the digital age—Blueprints of the Afterlife will establish Ryan Boudinot as an exceptional novelist of great daring.\r\n\r\n“A fierce literary imagination, building the kinds of worlds that William Gibson used to write before he discovered the present; it is warmed by the kind of offbeat, riffing humor that has suffused the works of Neal Stephenson and Gary Shteyngart, with Chuck Palahniuk’s cartoonish gore and Neil Gaiman’s creepy otherworlds blended in. . . . Duct-tape yourself to the front of this roller coaster and enjoy the ride.” The New York Times", "asin": "0802170919", "rank": "203484", "city": "Seattle", "image": "https://images-na.ssl-images-amazon.com/images/I/51YLBZdXSXL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}