{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 579, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "These books take you right into the heart of Venice and the world of Detective Brunetti. Wonderful series."}, {"review_sentiment": 5.0, "review_text": "This is one of my favorites in the Guido Brunetti series. It kept me guessing up till the end. Leon is a very skilled and inventive mystery writer and the fact that her series is set in Venice adds intrigue to the plots."}, {"review_sentiment": 5.0, "review_text": "Another great book by Donna Leon, now I have read eleven with fifteen to go. Thanks for offering a great selection of books."}, {"review_sentiment": 3.0, "review_text": "I usually like books with Brunetti but this book was slow and seemed somewhat disjointed to me."}, {"review_sentiment": 4.0, "review_text": "Another great mix of Family, Venice, and murder!"}, {"review_sentiment": 4.0, "review_text": "Enjoyed this great summer read especially after having spent time in Venice.  Looking forward to reading another book in the series"}, {"review_sentiment": 5.0, "review_text": "Donna Leon is a master at creating atmosphere. The book is Venice. And in this one she displays an understanding of and appreciation language that is a pleasure to read."}, {"review_sentiment": 5.0, "review_text": "Starting at #22 in a series is not ideal, but we had to start somewhere! We listened to the audio version and greatly enjoyed the narrator's voice and accent along with the glimpses of life in Venice, Italy! Now we have another author to add to listening list and are hoping to start a book #1!"}, {"review_sentiment": 5.0, "review_text": "Another winner!"}, {"review_sentiment": 5.0, "review_text": "I had no idea what the ramifications of the information were until almost the very end. Beautifully woven mystery that I would recommend."}]}, "authors": ["Donna Leon"], "isbn": "0802122426", "longitude": 12.3345898, "periods": ["2000s", "Recent Releases"], "title": "The Golden Egg", "word_cloud": "right heart world series favorites series keep guess till end skilled inventive mystery writer fact series set add intrigue plot great eleven fifteen go offering great selection usually like slow seem somewhat disjointed great mix murder great summer especially spent time forward read series master create atmosphere display understand appreciation language pleasure start series ideal start somewhere listen audio version greatly enjoy narrator voice accent glimpse life now author add listen list hop start winner idea ramification information almost woven mystery", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 22/24 in the Commissario Brunetti Series\r\n\r\nIn The Golden Egg, as the first leaves of autumn begin to fall, Vice Questore Patta asks Brunetti to look into a minor shop-keeping violation committed by the mayor’s future daughter-in-law. Brunetti has no interest in helping his boss amass political favors, but he has little choice but to comply. Then Brunetti’s wife, Paola, comes to him with a request of her own. The mentally handicapped man who worked at their dry cleaner has just died of a sleeping pill overdose, and Paola loathes the idea that he lived and died without anyone noticing him, or helping him.\r\n\r\nBrunetti begins to investigate the death and is surprised when he finds nothing on the man: no birth certificate, no passport, no driver’s license, no credit cards. As far as the Italian government is concerned, he never existed. Stranger still, the dead man’s mother refuses to speak to the police, and assures Brunetti that her son’s identification papers were stolen in a burglary. As secrets unravel, Brunetti suspects that the Lembos, an aristocratic family, might be somehow connected to the death. But why would anyone want this sweet, simple-minded man dead?\r\n\r\n“[An] unusually reflective detective story.” The New York Times", "asin": "0802122426", "rank": "171587", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51bBS4YgqZL.jpg", "country": "Italy", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}