{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 35.6828378, "ratings": {"num_ratings": 166, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Interesting story, I find similarities in my life."}, {"review_sentiment": 5.0, "review_text": "Great buy - highly recommend. Extremely insightful author, can't wait to read more by her."}, {"review_sentiment": 3.0, "review_text": "Not bad."}, {"review_sentiment": 5.0, "review_text": "This book contains two wonderful stories. Many authors try to tackle the subject of losing a loved one, but often focus in on one emotion that arises and block out everything else. Both stories (especially the eponymous tale) do an amazing job of running through all the emotions that can come into one's mind after losing a loved one. If you're going through tough times, this is THE novel I would recommend reading."}, {"review_sentiment": 4.0, "review_text": "A great little airport read.  I wish the characters were not eating quite so many dead animals, but on the other hand, I loved the Japanese culture in the story."}, {"review_sentiment": 4.0, "review_text": "Can cooking help you cope with the despondency you feel from loss? I’m not talking about wolfing down garlic mashed potatoes from a pan; I’m talking about a multi-course gourmet meal that you are willing to toss out if it’s not perfect and start all over again. That’s the theme of Kitchen. Our main character is a twentyish-woman who lost her father at an early age and then her mother. She went to live with grandparents but her grandfather died, and then her grandmother, and now she has no living relatives.She turns to her kitchen. But she is also invited to live with the family of a young man she has known since childhood. Now here’s a modern family: just two people, the young man and his mother. But did I tell you his father is his mother? Or, to phrase that more correctly, his mother is his father? It’s a transgender situation. The two young people are drawn to each other but then he is hit by loss. They grapple with trying to help each other, maybe love each other, or maybe just pity each other, and try to stop each other from jumping over the edge.This very short novel has a short story appended at the end: Moonlight Shadow. This story, also about loss, and it could be the same woman, takes us into magical realism. Maybe they do come back, at least to tell you they’re ok.I found the two stories very moving and fascinating to read. Translated from the Japanese."}, {"review_sentiment": 5.0, "review_text": "Very interesting read."}, {"review_sentiment": 5.0, "review_text": "Great book, loved the story."}, {"review_sentiment": 5.0, "review_text": "Nice book!"}, {"review_sentiment": 4.0, "review_text": "Mikage has faced unspeakable pain. As an orphan being raised by her grandmother, the girl finds comfort in the one place where happy memories were made, which is the kitchen. After her grandmother passes, Mikage finds herself scooped up by another not so traditional family, but one filled with all the things she needs, which is light and love.Told with courageous honesty, Yoshimoto holds nothing back when it comes to the painfully confusing process of grief. Although the subject is heavy, the author delivers her story with a surprising mix of humor and lightness. The characters are endearing and believable, their conflicts painfully relatable.I enjoyed this story very much and I recommend it for anybody wanting to step into the Japanese culture. The kitchen in this story provided us with a whole lot more than food."}]}, "authors": ["Banana Yoshimoto"], "isbn": "0802142443", "longitude": 139.7589667, "periods": ["2000s", "Recent Releases"], "title": "Kitchen", "word_cloud": "interest story find similarity life buy highly recommend extremely insightful author not bad contain wonderful story many author try tackle subject lose love often focus emotion arise block everything else story especially eponymous tale amazing job run emotion come mind lose love go tough time the reading great little airport wish character eat quite many dead animal hand love japanese culture story help despondency loss talk wolf garlic mash potato pan talk gourmet meal willing toss perfect start theme main character lose father early age mother go live grandparent grandfather die live turn also invite live family young man know childhood now modern family people young man mother tell father mother phrase correctly mother father transgender situation young people draw hit loss grapple try help maybe maybe pity try jump short short story append end story also loss woman take magical realism come back least tell find story move fascinate translate japanese very interesting love story nice mirage face unspeakable pain orphan raise grandmother girl find comfort place happy memory make grandmother pass find scoop traditional family fill thing need light courageous honesty hold nothing back come painfully confusing process grief subject heavy author delivers story surprising mix humor character endear believable conflict painfully enjoy story much recommend anybody want japanese culture story provide whole lot food", "genres": ["Fiction & Literature"], "summary": "With the publication of Kitchen, the dazzling English-language debut that is still her best-loved book, the literary world realized that Yoshimoto was a young writer of enduring talent whose work has quickly earned a place among the best of contemporary Japanese literature. \r\n\r\nKitchen is an enchantingly original book that juxtaposes two tales about mothers, love, tragedy, and the power of the kitchen and home in the lives of a pair of free-spirited young women in contemporary Japan. Mikage, the heroine, is an orphan raised by her grandmother, who has passed away. Grieving, Mikage is taken in by her friend Yoichi and his mother (who is really his cross-dressing father) Eriko. \r\n\r\nAs the three of them form an improvised family that soon weathers its own tragic losses, Yoshimoto spins a lovely, evocative tale with the kitchen and the comforts of home at its heart.\r\n\r\nIn a whimsical style that recalls the early Marguerite Duras, \"Kitchen\" and its companion story, \"Moonlight Shadow,\" are elegant tales whose seeming simplicity is the ruse of a very special writer whose voice echoes in the mind and the soul.\r\n\r\n“Ms. Yoshimoto’s writing is lucid, earnest and disarming . . . [It] seizes hold of the reader’s sympathy and refuses to let go.” The New York Times\r\n", "asin": "0802142443", "rank": "44655", "city": "Tokyo", "image": "https://images-na.ssl-images-amazon.com/images/I/41UDtUZnfYL.jpg", "country": "Japan", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}