{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 240, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "His name is little known in America but I still hear him mentioned while watching occasional documentaries on the world wars. His name is Stefan Zweig (1881-double suicide with his second wife in South America in 1942). Zweig was the second son of a millionaire Jewish businessman and lived in luxury in old Vienna. He attended school in the city and matriculated at the University of Vienna where he earned a doctorate in philosophy)In this memoir the famous playwright, novelist, journalist and social commentary returns us the halcyon days of the Hapsburg Empire (quiet at least on the surface!) Zweig served for a time in the Austrian military during World War II but spent most of his time as a librarian and war correspondent. He hated war and was a pacifist. He traveled widely in Europe to many nations including Great Britain, France, Belgium, Switzerland, Germany and his native Austria. He also visited the USA and India.  This vivid memoir gives first hand account of his friendship with such luminaries as Sigmund Freud; Richard Strauss the composer with whom he collaborated; Hugo Irish author James Joyce,. French author Romain Roland and many others in the literary and cultural forefront of European culture. He had to flee Vienna one step of the Nazis; in 1942 he and his wife committed suicide unable to live in the vanished world of old Europe.This is a well observed memoir which deserves to be read and cherished. Zweig was a great writer and a good man."}, {"review_sentiment": 5.0, "review_text": "Wonderful"}, {"review_sentiment": 2.0, "review_text": "I was swindled by the title of this book. I believed, as the title suggests, that the book would paint a nostalgic verbal picture of a colorful turn of the century Vienna and the final days of the Habsburg empire. I was thinking of waltzes, white-tie balls in baroque palaces, mustachioed literati sipping coffee in grand cafés, mutton chopped old Emperor Franz Josef and his mistress visiting the Prater in their carriage, that sort of thing. Sad to say, this book contains nothing of the sort. What I got instead was an extraordinarily tiresome, rambling, and repetitive autobiographical memoir. Stefan Zweig became an Austrian literary figure at a relatively young age. He was a successful and prolific novelist, poet and playwright. He wrote the libretto for one Richard Strauss opera and contributed to another. This memoir, written toward the end of his life, recalls in boastful and overly abundant detail his friendships with authors and artists prominent at the time (i.e. in the first three decades of the twentieth century) most of them now all but forgotten. Though known and active in the world of literature, Zweig remained a political innocent, a pacifist and so-called “one-worlder”, incapable of fully grasping the harsh realities of Nazism. In 1942, shortly after the publication of this memoir, he and his wife jointly committed suicide. Some 50 million civilians are believed to have been victims of World War II. Although Zweig and his wife died in Brazil, it would be fair to include them in the number."}, {"review_sentiment": 5.0, "review_text": "Amazing memoir!"}, {"review_sentiment": 5.0, "review_text": "It amazes the clarity of thought to describe the two major conflicts in Europe which ended in horrendous wars. Notable too that in the late thirties and being apolitical he describes the events that put Hitler in position and the mechanisms he used to dominate. Through the reading one cannot stop to compare the Nazi movement with the political turmoil our country, Amerikka, is suffering under Trump. Eerie!"}, {"review_sentiment": 3.0, "review_text": "The book portrays an interesting take on the time. However, I found it to be dry."}, {"review_sentiment": 5.0, "review_text": "This is the pre-suicide autobiography of accomplished Viennese writer Stefan Zweig, who lived through the final dissolution of the old Austrian Hapsburg dynasty and ended his life in 1943 before the end of WWII. The original was written in German, which must have been exceedingly difficult to translate adequately, given its complex thought-streams and complicated sentence structure. So first off, an admiring nod to the translator, Anthea Bell, who did a masterful job of conveying the heart and soul of this book to readers of the English language and supplying excellent background in her translator's note which opens the book.Zweig was a man of many faces -- brilliant, yes! and also exceptionally self-aware. The book opens with a fascinating account of his Jewish boyhood in Vienna, his early training in the rigorous and pedantic German schools, and builds to a climax as he reflects on his experiences as a disenfranchised member of the Jewish artistic community during and after the Nazi take-over in Germany and Austria.He was conscious of the deep changes that were undermining the old regime in his native Austria and in Europe, particularly the rise of fascist sympathizers in many places in Europe during his lifetime. The tension was palpable in his haunting descriptions of life on the edge of communal insanity as the Hitler machinery marched through Europe in the late 1930’s and struck down one basic human freedom after another. It was  an insidious and covert operation that became obvious to most only after-the-fact. All his books were ultimately banned by the Nazis and he fled the country and lived in exile for several years. He seems to have largely discounted his ultimate success as a major contributor to the historical record of his day while he was living through the process, chagrined that he could do nothing about it except to experience it deeply and shoulder his burden as a super-sensitive soul.In many ways, as I read through this rich and elegant exploration of his life and times in Vienna, Paris, Italy and America, I quietly sympathized with him at the loss of his beloved country to war and hate. I can almost hear his stark voice commenting here that he was much more rooted in literature and philosophy than he was in routine daily life, and that he expected his artistic and scholarly efforts, small as he may have viewed them, to affect or change the course of world history for the better. He had maximum refinement but lacked the common touch at a time when common people were rising and trying to upend the old regime in Austria and in so doing, opening themselves to the Nazi take-over. In light of his imminent suicide shortly after completing this book, it is fair to assume that he felt adrift on this  planet as a writer who could no longer grasp what went so terribly wrong all at once -- or how to amend it with all his worldly knowledge and massive literary skills.The realization that his past conditioning was no longer sufficient to sustain him must have been personally wrenching. In his mind, a new day was coming unbidden, and with it a profound shift in mores. In my own life, with the ascent of  Trumpism and its blatant disregard for human rights, it felt like deja vu to absorb this book, which is not only a shout-out to our collective past as scholars and thinkers, writers, musicians and artists of the sort who were at home in  pre- WWI Vienna, but also a potent reminder that a shift in culture can be ruthless and insane before the “new normal” becomes apparent. It is both a swan song and a warning – and that is primarily why our book club chose to experience this book together. As a sympathetic portrait of a man and a world in acute distress, it is helpful to read it while trying to live through the crude and unconscious political agendas of our own times. It sparked intense debates and fruitful discussion among our group. Take some time to read through it slowly and let it sink in -- it is a complex book of many layers and uncannily prescient."}, {"review_sentiment": 5.0, "review_text": "I thought the book, despite Zweig's self-pity (understandable in this case) was magnificent, magnificent in its details and in its ability to successfully convey the atmosphere before World War I and between the wars. The book includes marvelous portraits of famous and not-so-famous people, such as Rodin, Rilke, and Freud. His elitism is a bit cloying, but again, understandable -- and the descriptions and the wise observations make up for its flaws."}, {"review_sentiment": 5.0, "review_text": "A well-told, tragic story."}, {"review_sentiment": 5.0, "review_text": "An articulate, urbane, and insightful overview of Europe before and after World War I, and the  disintegration of the Belle Epoque society.  Zweig is an unequalled journalist for his humanity and breadth of understanding."}]}, "authors": ["Stefan Zweig"], "isbn": "0803226616", "longitude": 2.3514992, "periods": ["1900s"], "title": "The World of Yesterday", "word_cloud": "name little know still hear mention watch occasional documentary war name suicide second wife second son millionaire businessman live luxury old attend school city matriculate earn doctorate philosophy memoir famous playwright novelist journalist social commentary return halcyon day quiet least surface serve time austrian military spend time librarian war correspondent hat war pacifist travel widely many nation include native also visit vivid memoir give first hand account friendship luminaries composer collaborate author author many others literary cultural forefront european culture flee step wife commit suicide unable live vanish old well observed memoir deserves cherish great writer good man wonderful swindle title believe title suggests nostalgic verbal picture colorful turn century final day empire think waltz ball baroque palace mustachioed literati sip coffee grand cafe mutton chop old mistress visit carriage sort thing say contains nothing sort get instead extraordinarily tiresome ramble repetitive autobiographical memoir become austrian literary figure relatively young age successful prolific novelist poet playwright write opera contribute memoir write end life recall boastful overly abundant detail friendship author artist prominent time first decade twentieth century forget know active literature remain political innocent pacifist incapable fully grasp harsh reality shortly publication memoir wife jointly commit suicide civilian believe victim wife die number memoir amaze clarity think describe major conflict end horrendous war notable late thirty apolitical describes event put position mechanism use dominate read stop compare movement political turmoil country suffer portrays interest take time however find dry autobiography accomplish viennese writer live final dissolution old austrian dynasty end life end original write german exceedingly difficult translate adequately give complex complicate sentence structure first admire nod translator masterful job convey heart soul reader english language supply excellent background translator note open man many face brilliant yes also exceptionally open fascinate account jewish boyhood early train rigorous pedantic german school build climax reflect experience disenfranchise member artistic community conscious deep change undermine old regime native particularly rise fascist sympathizer many place lifetime tension palpable haunting description life edge communal insanity machinery march late strike basic human freedom insidious covert operation become obvious ultimately ban flee country live exile several year seem largely discount ultimate success major contributor historical record day live process chagrin nothing experience deeply shoulder burden many way rich elegant exploration life time quietly sympathize loss beloved country war hate almost hear stark voice comment much root literature philosophy routine daily life expect artistic scholarly effort small affect change course history better maximum refinement lack common touch time common people rise try upend old regime opening light imminent suicide shortly complete fair assume felt adrift planet writer go terribly wrong amend worldly knowledge massive literary realization conditioning longer sufficient sustain personally wrench mind new day come unbidden profound shift more life ascent blatant disregard human right felt deejay cu absorb collective past scholar thinkers writer musician artist sort home also potent reminder shift culture ruthless insane new normal becomes apparent swan song warn primarily chose experience together sympathetic portrait man acute distress helpful try live crude unconscious political agenda time spark intense debate fruitful discussion group time slowly let complex many layer uncannily prescient think understandable case magnificent magnificent detail ability successfully atmosphere war include marvelous portrait famous people elitism bit cloy understandable description wise observation make flaw tragic story articulate urbane insightful disintegration society unequaled journalist humanity breadth understanding", "genres": ["Memoir", "Essay"], "summary": "Written as both a recollection of the past and a warning for future generations, The World of Yesterday recalls the golden age of literary Vienna—its seeming permanence, its promise, and its devastating fall.\r\n\r\nSurrounded by the leading literary lights of the epoch, Stefan Zweig draws a vivid and intimate account of his life and travels through Vienna, Paris, Berlin, and London, touching on the very heart of European culture. His passionate, evocative prose paints a stunning portrait of an era that danced brilliantly on the edge of extinction.", "asin": "0803226616", "rank": "22977", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51Hx7r0j9DL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}