{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 18, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "The war from the view if a Vietnamese. Nguyen's writing is stunning in the speed of change and families torn apart during war. I watched Ken Burns \"Viet Nam\". This different perspective reminds us if we don't know our history, we are doomed to repeat it."}, {"review_sentiment": 5.0, "review_text": "This was purchased as a gift for my Dad and he loved it."}, {"review_sentiment": 5.0, "review_text": "I was mesmerizing with the life stories happened during the Vietnam war to the author's family. It displayed the cruelty of Vietnamese Communist invading the South Vietnam."}, {"review_sentiment": 5.0, "review_text": "Beautifully written and eye-opening."}, {"review_sentiment": 4.0, "review_text": "Great book. Left me wanting to read more about what happened next. Living through this from an American lens, married to a soldier who'd been forced to serve, it was fascinating to learn this family's side. We were as unkind, wasteful, and materialistic as he said. But as the book points out, it was a complicated era."}, {"review_sentiment": 5.0, "review_text": "The author appears on Anthony Bourdain's show (Parts Unknown, I think) when he was touring Hue in Vietnam. Mr. Nguyen mentioned his book about his family's story and I was so intrigued, I just had to read it! It's an incredible story! Worth the read if you enjoy this genre!"}, {"review_sentiment": 5.0, "review_text": "I just finished reading \"Where The Ashes Are\" and have not been able to stop thinking about it.  I am about the author's age, so it was fascinating to contrast his life of living the war in vietnam with my life of \"watching\" it on television or seeing photos in Life magazine.  Even though I was just a back seat observer to the horrors of that war, it is imprinted in my psyche.  It was surprising to me how emotional I felt for the people of Vietnam.  It felt like our tragedy, even though I didn't live it.  My history of the war was sketchy, and this book incented me to go back and study up.  I also saw the author on Anthony Bourdain's Vietnam segment.  Both the book and Bourdain's show have ignited a burning desire to visit Vietnam."}, {"review_sentiment": 4.0, "review_text": "i heard about this book  abd writer from anthony bourdain in vietnam. the book is very well written, evoked a lot of emotions, and raised a lot of questions, which i raiised with vietnamese friends. this invited discussions that gtratly broadened my understanding."}, {"review_sentiment": 5.0, "review_text": "I recommend this book highly!  A very good read.  I grew up during the Viet Nam era which effected family and friends.  It was very interesting to read this from the author's point of view."}, {"review_sentiment": 5.0, "review_text": "Being a Vietnam I was very impressed with this book."}]}, "authors": ["Qui Duc Nguyen"], "isbn": "0803226985", "longitude": 0.0, "periods": ["1900s"], "title": "Where the Ashes Are: The Odyssey of a Vietnamese Family", "word_cloud": "war view write stun speed change family tear apart war watch different perspective remind know history doom repeat purchase gift love mesmerize life story happen war author display cruelty invade beautifully write leave want happen next living american lens marry soldier force serve fascinate learn side unkind wasteful materialistic say point complicate era author appear show think tour mention story intrigue incredible story enjoy genre finish read able stop thinking author age fascinating contrast life live war vietnam life watch television see photo magazine even back seat observer horror war imprint psyche surprising emotional felt people felt tragedy even live history war sketchy invent back study also saw author segment show ignite burn desire visit heard bad writer anthony ordain vietnam well write evoke lot emotion raise lot question raise friend invited discussion gtratly broaden understand recommend highly good grow era effect friend interest author point view be impress", "genres": ["Memoir", "History"], "summary": "In 1968 Nguyen Qui Duc was nine years old, his father was a high-ranking civil servant in the South Vietnamese government, and his mother was a school principal. Then the Viet Cong launched their Tet offensive, and the Nguyen family’s comfortable life was destroyed. The author’s father was taken prisoner and marched up the Ho Chi Minh Trail.\r\n\r\nNorth Vietnam's highest-ranking civilian prisoner, he eventually spent twelve years in captivity, composing poems in his head to maintain his sanity. Nguyen himself escaped from Saigon as North Vietnamese tanks approached in 1975. He came of age as an American teenager, going to school dances and working at a Roy Rogers restaurant, yet yearning for the homeland and parents he had to leave behind. The author’s mother stayed in Vietnam to look after her mentally ill daughter. She endured poverty and “reeducation” until her husband was freed and the Nguyens could reunite.\r\n\r\nIntertwining these three stories, Where the Ashes Are shows us the Vietnam War through a child’s eyes, privation after a Communist takeover, and the struggle of new immigrants.\r\n\r\nThe author, who returned to Vietnam as an American reporter, provides a detailed portrait of the nation as it opened to the West in the early 1990s. Where the Ashes Are closes with Nguyen’s thoughts on being pulled between his adopted country and his homeland.", "asin": "0803226985", "rank": "483532", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51quZM%2BHcSL.jpg", "country": "Hanoi", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}