{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 3653, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "I eventually ended up enjoying the book somewhat. It was grueling to get through at some points, though. (Thanks to the magic of Goodreads, I can confirm it took me nearly two months to finish it.)Station Eleven would work better as a movie, with characters trimmed out. I ended up caring for any of them, though I eventually fell into the world. But holy FSM did it take a long time for me to get there."}, {"review_sentiment": 5.0, "review_text": "I’ve read many post apocalyptic novels, and this one is by far my favorite. I was surprised when my daughter recommended this to me as she would typically hate the entire premise. I see now why she loved it."}, {"review_sentiment": 4.0, "review_text": "A nice easy read for a vacation week.  Nice the way the author introduces the characters one at a time and back and forth through time."}, {"review_sentiment": 3.0, "review_text": "This is another entry into one of my pet genres, which I affectionately call \"books about books.\"  This one is nominally sci-fi as it is set in a post-apocalyptic world where high-tech civilization has collapsed and in the ensuing, increasingly wild mid-west, a troupe of actors and musicians travel from town to town, performing Shakespeare and symphonies.  King Lear figures prominently in the story.  A child actor from the opening King Lear performance serves as the main protagonist; the child from the actor playing King Lear in the opening performance serves as the main antagonist.  There are several interesting connections between the pre- and post-apocalyptic worlds that serve to entertain.  This won an award when it was published and was very well-received.  I found it on the light side, though fairly well-written.  It is not terribly challenging in style, vocabulary or plot but does gently pull you into the story arc in a surprisingly effective way.  Shakespeare resonates through this book, which I thoroughly enjoyed."}, {"review_sentiment": 5.0, "review_text": "I liked the non-linear story line, and how author wove the threads together. I also felt the characters were very interesting and compassionately drawn."}, {"review_sentiment": 5.0, "review_text": "This book is what it is to be human."}, {"review_sentiment": 1.0, "review_text": "Extremely ordinary book. If you are looking for a great post apocalyptic book, this is not it! Don't waste your money  Buy The Road or One Second After"}, {"review_sentiment": 1.0, "review_text": "It's a wannabe post apocalyptic novel.  Save your money."}, {"review_sentiment": 4.0, "review_text": "Well writtenGood character developmentKept my attention watching people live the optimism of \"survival is insufficient\"I suspect that's what I resonated with mostLife w its adversities is, no must be more than survivalAs always it's a disappointment when good authors can't complete a book without use of the F-bombAs profanity is the efforts of a weak mind to express itself, and because this is a good mind with rich vocabulary, then one wonders why the F word is necessaryThe book would have been even better without the profanity"}, {"review_sentiment": 5.0, "review_text": "Enjoyable but disturbing.  I suppose that's the point.  Love the characters and the pacing of the story.  Really well written."}]}, "authors": ["Emily St. John Mandel"], "isbn": "0804172447", "longitude": -79.387207, "periods": ["2000s", "Recent Releases"], "title": "Station Eleven", "word_cloud": "eventually end enjoy grueling point magic confirm take nearly month finish better movie character trim end care eventually fell world holy long time many post apocalyptic novel far favorite surprise daughter recommend typically entire premise see loved nice easy vacation week way author introduce character time back forth time entry pet genre affectionately call nominally set world civilization collapse ensue increasingly wild troupe actor musician travel town town perform symphony figure prominently story child actor open performance serf main protagonist child actor play open performance serf main antagonist several interesting connection world serve entertain award publish find light side fairly terribly challenge style vocabulary plot gently pull story arc surprisingly effective way resonate thoroughly enjoy like story line author weave together also felt character interest compassionately draw human extremely ordinary look great post apocalyptic waste money wannabe post apocalyptic money well written good character attention watch people live optimism survival insufficient suspect resonate most life w adversity always disappointment good author use profanity effort weak mind express good mind rich vocabulary one wonder word necessary the even profanity enjoyable disturb suppose point character pace story really well write", "genres": ["Fiction & Literature"], "summary": "Kirsten Raymonde will never forget the night Arthur Leander, the famous Hollywood actor, had a heart attack on stage during a production of King Lear. That was the night when a devastating flu pandemic arrived in the city, and within weeks, civilization as we know it came to an end.\r\n\r\nTwenty years later, Kirsten moves between the settlements of the altered world with a small troupe of actors and musicians. They call themselves The Traveling Symphony, and they have dedicated themselves to keeping the remnants of art and humanity alive. But when they arrive in St. Deborah by the Water, they encounter a violent prophet who will threaten the tiny band’s existence. And as the story takes off, moving back and forth in time, and vividly depicting life before and after the pandemic, the strange twist of fate that connects them all will be revealed.", "asin": "0804172447", "rank": "3247", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51-qQ2TbIPL.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}