{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 467, "rating": 3.2, "reviews": [{"review_sentiment": 4.0, "review_text": "Very long so be prepared. But I found it captivating to relive the NYC in the gritty 70s"}, {"review_sentiment": 1.0, "review_text": "Long, plodding, parts unreadable. I tried to continue thru it all but not worth the 900+ pages."}, {"review_sentiment": 5.0, "review_text": "One of the best modern writers of our time.  A captivating story weaving in and out of prose.  City on Fire is a little over 900 pages but it felt like a pamphlet.  The only negative is that I cannot comprehend how I am going to enjoy another book as much as this one, chasing the dragon."}, {"review_sentiment": 5.0, "review_text": "Loved it"}, {"review_sentiment": 3.0, "review_text": "Starts wonderfully, but drags on way too long, and by about two thirds of the way through I had lost interest. I like a long novel in general, but this one lost all momentum."}, {"review_sentiment": 1.0, "review_text": "I am 47 per cent through and  just can't  finish it.  Thought  it had potential as  oneof those epic novels that just seem too suck you in....but i can't even finish this.  The  multiple story lines  and  characters arent coming together for me.  Wish i could get my money back."}, {"review_sentiment": 3.0, "review_text": "The TAKES A LONG TIME TO GET GOING....NEEDED AN EDITOR"}, {"review_sentiment": 1.0, "review_text": "It would have been a solid three star book if it had been at least 400 pages shorter. Overall, just way waaaay WAAAAAAAAAAY too much background filler to support a story that never really delivers the goods. The detailed exploration of the characters would have been great if the story had been up to snuff. The setting is definitely intriguing, but the book just ends up feeling like a 12-hour long director's cut of The Royal Tenenbaums. I think authors (and screenwriters) are often confused into thinking that the children of the uber-wealthy are always interesting subjects. Many tales of idealistic offspring clashing with their rich, materialistic parents have been told. This one is just an extremely over-detailed one, that slogs alongside a pretty pedestrian (and often forgotten) plotline. By the time the book gets back on track and attempts to wrap-up said plot, I had pretty much ran out of gas in my attempt at caring. A good editor could have chopped this down into something that would have been at the very least okay, but this gigantic, bland tale of wealthy New Yorkers is a total snooze and an excruciating read that never seems to end."}, {"review_sentiment": 4.0, "review_text": "Great read about New York in 1970's.  Enjoyed it. only wish it was not quite so wordy. Over 900 page story, could have been told in 600 pages or less."}, {"review_sentiment": 5.0, "review_text": "love this book."}]}, "authors": ["Garth Risk Hallberg"], "isbn": "0804172951", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "City on Fire", "word_cloud": "very long prepared find captivate relive gritty long plod part unreadable try continue thru worth page best modern writer time captivate story weave prose little page felt pamphlet negative comprehend go much chasing dragon love start wonderfully drag way long third way lose interest like long general lose momentum per cent potential one of epic novel seem suck even multiple story line character rent come together money back star least page shorter overall way waaaay much filler support story never really deliver good detailed exploration character great story snuff setting definitely intriguing end feel long director cut think author screenwriter often confuse think child always interest subject many tale idealistic offspring clash rich materialistic parent tell extremely slogs pretty pedestrian often forget plot line time get back track attempt say plot pretty much ran gas attempt care good editor something okay gigantic bland tale wealthy total snooze excruciate never seem end great wish quite wordy page story page le love", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A New York Times Notable Book\r\n\r\nNew York City, 1976. Meet Regan and William Hamilton-Sweeney, estranged heirs to one of the city’s great fortunes; Keith and Mercer, the men who, for better or worse, love them; Charlie and Samantha, two suburban teenagers seduced by downtown’s punk scene; an obsessive magazine reporter and his idealistic neighbor—and the detective trying to figure out what any of them have to do with a shooting in Central Park on New Year’s Eve. \r\n       \r\nThe mystery, as it reverberates through families, friendships, and the corridors of power, will open up even the loneliest-seeming corners of the crowded city. And when the blackout of July 13, 1977, plunges this world into darkness, each of these lives will be changed forever. \r\n\r\nCity on Fire is an unforgettable novel about love and betrayal and forgiveness, about art and truth and rock ’n’ roll: about what people need from each other in order to live—and about what makes the living worth doing in the first place.", "asin": "0804172951", "rank": "108030", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51KUK1bMtRL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}