{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": -33.8548157, "ratings": {"num_ratings": 74, "rating": 2.6, "reviews": [{"review_sentiment": 4.0, "review_text": "Amnesia is the fourteenth novel by award-winning Australian novelist, Peter Carey. The Angel Worm: a virus that proves to be a security nightmare when it opens prisons around Australia. And worse still, infects the big parent security firm in the United States, attracting the ire of the CIA and other security entities. When the hacker is discovered to be a young Melbourne woman, journalist Felix Moore is surprised to find himself involved.Actress Celine Baillieux is desperate to prevent her daughter, Gaby’s extradition to the United States for unleashing said virus, and calls on her old Uni mate to write a biography that will exonerate this feisty young woman. Property developer, Woody Townes, the man who has extracted Felix from many a dire situation, is enlisted to facilitate matters.But is Felix, “the most controversial journalist of his age”, known for ruining reputations and manufacturing quotes (“He freely admitted that he not only made up quotes but had also been accused of making up quotes, ‘but never the quotes I actually made up.’”) the right person for the job?  It seems Felix has a fixation on the role of the United States in Australia’s politics: the “Battle of Brisbane” and the 1975 Dismissal feature prominently in the tale he constructs.Carey gathers together a diverse cast of characters, people the reader will recognise from everyday life: the Local Member intent of preserving image; the ageing actress isolated from her theatre milieu in a working-class suburb; the highly intelligent students able to run rings around security to further their cause; the property developer with a finger in many pies; petty crooks trying to make it big; and greenies determined to expose corporate cover-ups.Carey gives the reader plenty of humour, both in the dialogue between the characters and in the predicaments in which he places his protagonist. Felix is charmed, spoiled, kidnapped, isolated, forced to live rough and made to produce his manuscript with technology that is virtually obsolete (cassette tapes, paper and a typewriter, no less!). The back-cover blurb is quite misleading, as the story goes in a completely different direction. The pace could perhaps have been faster: occasionally, the story seemed to lose momentum. Nonetheless, an enjoyable read."}, {"review_sentiment": 2.0, "review_text": "If it wasn't written by Peter Carey, people wouldn't read it. Forgettable from my point of view. May be that's why it's called Amnesia."}, {"review_sentiment": 4.0, "review_text": "Peter Carey has delivered again. This book is essential reading and the story will prevent revisonism from forgetting the Brisbane battles. My \"Uncle Stan\" said that he learnt everything he knew about pricing and economics from standing in brothel lines in WWII in Brisbane and selling his spot to American servicemen trying to work out if your overall revenue would be greater selling your spot three from the door or four from the door and then rejoining the end of the line.Reading the review in the New York Times they have largely got it in contrast to \"Oliver and Parrot go to America\" where they missed the point completely \"If you dont have an aristocracy you will end up with Rap Music and america the way it is today\".Do yourself a favour and read both books - messerising syntheses of actual events to produce fiction.  Doing what fiction is all about - The big lie - Convincing us that there is meaning in life"}, {"review_sentiment": 3.0, "review_text": "Two young people of diverse backgrounds one together as they learn from one another and learn of serious environmental threats to their community.  They set about exposing it through hacking and a writer is also involved in the need for seeking the truth.  The descriptive passages about Australian flora and way of life are masterful and the background of politics in 1975 which is what the \"Amnesia\" refers to is enlightening. Risks are rampant and the young lady \" student \" the recipient of the gifted young man's knowledge lead  the reader on a not so merry but worthy chase."}, {"review_sentiment": 4.0, "review_text": "A page turner but a bit like reading a screen play rather than a suspense novel."}, {"review_sentiment": 4.0, "review_text": "I don’t think Peter Carey wrote his novel titled, Amnesia, for a vast audience. Most general readers are likely to lose patience at being confused, and only Australian readers will get his many local references. I liked the novel because I was enthralled by protagonist Felix Moore, and by his determination. I liked Carey’s riff on our intentional forgetfulness so that our lives can move on. The political shenanigans come across as universal to any location. The topic of malware brings an immediacy to contemporary experience. The prose illustrates Carey’s great writing skill, and fans of literary fiction will appreciate his talent as it is displayed in this novel.Rating: Four-star (I like it)"}, {"review_sentiment": 3.0, "review_text": "Usually love this writer, this is not his best. Try Thief."}, {"review_sentiment": 1.0, "review_text": "I read at least 60 books a year. Out of those 60 there are a handful that I don't finish. This was one of them. I honestly tried to give it a chance to get better, or at least interesting to no avail."}, {"review_sentiment": 2.0, "review_text": "The fine imagery and lambent prose Mr. Carey is capable of producing were wasted here. (I'm assuming his occasional grammatical mistake was deliberate; if not, then I'm once again disappointed by famous authors' difficulties in this area.) The plot, such as it was, sank like vinegar beneath oil and was just about as sour. I confess I quit around page 205, two-thirds of the way through, but I skimmed ahead and saw that further effort in slogging through the viscous story thread would generate little return. It was tolerable to be lectured for a paragraph or two that Australia, in Mr. Carey's eyes, is either a wholly owned subsidiary of the United States or its lackey, or both. But as this hobbyhorse became the stuff of dozens of pages rather than 500 words, I wished to be spared from what seemed to be verging on a screed."}, {"review_sentiment": 3.0, "review_text": "In Amnesia, Peter Carey blends a story of young Australian hackers with a powerful overlay of socialist politics. The result could have been outstanding, if only it weren’t so difficult to read.Amnesia is written in an elliptical style that’s clearly not intended to make things easy for the reader, and that’s only the beginning of the confusion. The novel is divided into two parts. In the first part, the first-person narrator is Felix Moore, one of Australia’s best-known journalists. Felix has just been convicted of libel in a high-profile trial where he was pitted against one of his favorite adversaries, a government minister. In Part Two, the narration is couched in the third person, although passages slip back into the first person, sometimes featuring Felix and other times featuring (separately) the mother and daughter who are two of the novel’s other principal characters. As I said, confusing.As though all that doesn’t make things sufficiently difficult for the reader, Carey liberally scatters Australian slang and obsolete British formulations throughout the text — words such as cobber, dobbin, pash, mestered, and sooled. If you know the meaning of these words and aren’t Australian, I’d wonder how you’ve been spending your time all these years.Admittedly, I have no patience for such things. If you’re prepared to brave your way through this novel, you might enjoy it immensely. The story that emerges at length is timely, engaging, and important.The amnesia of the title — Carey puts it as “The Great Amnesia of 1975″ in the text — refers to the media’s obfuscation and the public’s indifference to what he describes as the extra-constitutional ouster of Australia’s Labor government in that year, spearheaded, he claims, by the CIA.Carey’s protagonist, Felix Moore, is a belligerent socialist who constantly gets himself into trouble. His worldview is encapsulated in this way: “[S]he was born into the Anthropocene age and easily saw that the enemy was not one nation state but a cloud of companies, corporations, contractors, statutory bodies whose survival meant the degradation of water, air, soil, life itself.”Peter Carey, Australia’s most honored novelist, is a two-time winner of the Booker Prize, which could be either good or bad (but is usually bad), so far as I’m concerned. But it’s clear that the man can wordsmith with great skill. I just wish he would write more clearly. And, since he has lived in New York for the past twenty years, I would think he might dispense with all the Australian slang by now. And maybe he should pick up a copy of Strunk & White’s The Elements of Style to learn how to write more clearly."}]}, "authors": ["Peter Carey"], "isbn": "0804171327", "longitude": 151.2164539, "periods": ["1900s", "2000s", "Recent Releases"], "title": "Amnesia", "word_cloud": "fourteenth novelist virus prove security nightmare open prison worse still infect big parent security firm attract ire security entity hacker discover young woman journalist surprise desperate prevent daughter extradition unleash say virus call old mate write biography exonerate feisty young woman developer man extract many dire situation enlist facilitate controversial journalist age know ruin reputation manufacture quote freely admit make quote also accuse make quote never quote actually make right person job seem fixation role politics feature prominently tale gather together diverse cast character people recognize everyday life intent preserve image age actress isolate theater milieu suburb highly intelligent student able run ring security cause property developer finger many pie petty crook try make big greenfly determine expose corporate give plenty humor dialogue character predicament place protagonist charm spoil kidnap isolated force live rough make produce manuscript technology virtually obsolete cassette tape paper typewriter blurb quite misleading story go completely different direction pace perhaps occasionally story seem lose momentum enjoyable write people point view call deliver essential reading story prevent revisionism forget battle say learn everything know price economics stand brothel line sell spot american serviceman try work overall revenue greater sell spot door door rejoin review largely get contrast go miss point completely font aristocracy end america way today favor mesmerize synthesis actual event produce fiction fiction big lie mean life young people diverse background together learn learn serious environmental threat community set expose hack writer also involve seek descriptive passage australian flora way life masterful background politics refers enlighten rampant young lady student recipient gift young man knowledge lead merry worthy chase page turner bit read screen play rather suspense think write title vast audience most general reader likely lose patience confuse australian reader get many local reference like enthral protagonist determination like riff intentional forgetfulness life move political shenanigan come universal location topic malware bring immediacy contemporary experience prose illustrate great writing skill fan literary fiction appreciate talent display like usually love writer best thief least year handful finish honestly try give chance better least interesting avail fine imagery lambent prose capable produce waste assume occasional grammatical mistake deliberate disappoint famous author difficulty area plot sank vinegar beneath oil sour confess quit around page way skim ahead saw effort slog viscous story thread little return tolerable lectured paragraph eye wholly owned subsidiary lackey hobbyhorse become stuff dozen page rather word wish spar seem verge screed blend story young australian hacker powerful overlay socialist politics result outstanding difficult write elliptical style clearly intend make thing easy begin confusion divide part first part narrator journalists convict libel trial pit favorite adversary government minister narration couch third person passage slip back first person sometimes feature time feature separately mother daughter principal character say make thing sufficiently difficult liberally scatter australian slang obsolete british formulation text word cobber dobbin hasp meter soloed know meaning word australian wonder spend time patience thing prepare brave way immensely story emerge length timely engage title put text refers medium obfuscation public indifference describes ouster government year spearhead claim protagonist belligerent socialist constantly get trouble worldview encapsulate way bear age easily saw enemy nation state cloud company corporation contractor statutory body survival meant degradation water air soil life honor novelist winner either good bad usually bad far concerned clear man wordsmith great skill clearly lived past year australian slang maybe pick copy learn write clearly", "genres": ["Fiction & Literature", "Mystery & Suspense", "Politics"], "summary": "In this dark, suspenseful, and seriously funny novel, two-time Booker winner Peter Carey takes us to the place where the cyber underworld collides with international politics. \r\n\r\nWhen Gaby Baillieux, Australia’s most formidable hacker, releases the Angel Worm virus into her country’s prison system, cell doors are opened and inmates walk free. Since those prisons use American software, the doors in thousands of jails in the United States are opened as well. Is this an accident—or a declaration of cyber war? Does it have anything to do with the largely forgotten Battle of Brisbane between American and Australian forces in 1942? Or with the CIA-influenced coup in Australia in 1975?\r\n       \r\nDisgraced writer Felix Moore—known to himself as “our sole remaining left-wing journalist”—is determined to write Gaby’s biography in order to find the answers that could save her, his career, and perhaps his country. But how to get Gaby—on the run, scared, confused, and angry—to cooperate?\r\n\r\n“Nestled inside this brisk cyber caper is an aesthetically daring character study. . . . Carey imbues [the hacker’s] immersion in the world of coding and the Internet with a palpable, engrossing sense of joy and discovery.” The New Yorker", "asin": "0804171327", "rank": "1612549", "city": "Sydney", "image": "https://images-na.ssl-images-amazon.com/images/I/51NncIuzvAL.jpg", "country": "Australia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}