{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 26, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Seminal Weimar work. Energetic, imaginative work on the tragedy and the renaissance of Biberkopf. Great stuff."}, {"review_sentiment": 5.0, "review_text": "kinda need to read this again for a new perspective."}, {"review_sentiment": 5.0, "review_text": "sehr schon"}, {"review_sentiment": 3.0, "review_text": "Since Joyce's Ulysses is my favorite novel, and as I admire John Dos Passos' panoramic USA trilogy, I figured this 1929 epic, translated by Joyce's friend Alfred Jolas, would be great. Alfred Doblin's debts to both modernists is deep, as he tells the tale of ex-con Franz Biberkopf in Weimar Germany's central city. But the city does not come alive as vividly as I anticipated, and the protagonist, unlike Leopold Bloom, lacks the broad appeal that Joyce's everyman does. Less erudite than Joyce, less leftist than Dos Passos, Doblin places Bibi in a less politically charged atmosphere. As he's a pimp and thug, it's harder to care about the fate of this conniving man. His suffering leaves the reader more indifferent.For all the potential of a sexy thriller, the plot is not that engaging either. I perked up most when Bibi debated an elderly worker with anarchic sympathies, but this lasted only a few pages and dribbled out. You do see glimpses of others in this Berlin, but the editorial voice (a device I sometimes like a lot) here only tips the reader off to Bibi's fate, and that intervention distances the reader all the more.Some criticize the dated tough-guy pulp-speak of this novel as rendered by Jolas from a purportedly difficult to translate Berlin working-class dialect. I did not mind that tone, for it fit the gangster image of Capones and bootleggers from this same period in America, with a similar slangy, mocking dialogue. But the lack of suspense made the novel enervating. It's readable, sure, but outside of the passages where Doblin's omniscient narrator channels Job, Jeremiah, Revelation, and Genesis in a charged fashion at odds with the earthy characters and settings, it's not that surprising or engrossing."}, {"review_sentiment": 3.0, "review_text": "The book itself is simply amazing and I could not at all improve on the insightful review of Giordano Bruno below (or above) written in 2009. My big HOWEVER is that I think the Eugene Jolas translation from over seventy years ago is simply not very good. Your best bet is to purchase Anne Thompson's new translation which to my mind captures completely the allegedly \"untranslatable\" argot of Berlin lowlifes from the 1920's.It seems to be pretty much an amazon exclusive, available here. Mr. Bruno did not have this translation available at the time he wrote his piece.http://www.amazon.com/Berlin-Alexanderplatz-Alfred-D%C3%B6blin/dp/1494271451/ref=sr_1_1?s=books&ie;=UTF8&qid;=1430425784&sr;=1-1&keywords;=berlin+alexanderplatzHaving read both (well, honestly, I could only get through half the Jolas work), Ms. Thompson's is definitely worth the extra $$"}, {"review_sentiment": 3.0, "review_text": "does not appear to be a good translation."}, {"review_sentiment": 5.0, "review_text": "Yes, this is the German Ulysses.  Alfred Doblin really gets inside the heads of his characters, letting us see at least as much of what goes on inside their heads as outside.The point of his novel is best summed up on page 634: \"We know what we know, the price we paid was not low.\""}, {"review_sentiment": 5.0, "review_text": "This is a somewhat challenging but very rewarding book. A long book about a character that I started out hating, began to tolerate, but then finally came to have at least some empathy for. It's a book that surprises you. Most of the way, it seems as nihilistic as Franz and his buddies tend to be, but against all odds it ends up with a \"moral\". I see Franz as a parody of the Superman of Nietzsche--who is referenced once in the book. Franz always believes he can exert his will on life--until life and \"death\" exert their wills on him and show him how weak he always was by comparison. He then learns the hard, cocky man is a blind man because he pays no attention to others. To Doblin, it seems that empathy is strength while egotistic will is for cowards and frauds--like the \"self made man\" from Albania described by the Jews at the beginning. It's also a book which seems to celebrate the redemptive, cleansing power of guilt. The expression \"guilt is a useless emotion\" has no place here. Franz is only saved after his subconscious mind forces him to accept the pitiless hand of personal responsibility and the crushing guilt it can bring.It should be added that with all the poverty, death, and despair in this book, it can be wickedly funny. Doblin has a terrific wacky absurdist, self-referential sense of humor in this book that is pretty great.It's also amazing to read about \"swastika men\" in a book published in 1929 and prophetic predilections of the collapse of Germany through additional warfare."}, {"review_sentiment": 5.0, "review_text": "A true masterpiece of the Weimar era. Doblib's Berlin Alexanderplatz is a profoundly charged-allegorical representation of a nation undergoing pathological convulsions. It is the story of Franz Biberkopf, a man who has been released from jail (for manslaughter) and who is determined to live a moral life. But Franz will quickly find out that such a life is no longer possible in a world where gangsters and fascist hoodlums control everything, a world where the only sense of recognition available is through moral bondage. Döblin's prose is constantly in flux--by turns, the perspective of Berlin Alexanderplatz shifts from the voice of narrative omniscience, to internal (almost stream-of-consciousness) narration, and freely inserts itself into the consciousness of sustaining characters. Through the combination of rapidly alternating registers and perspectives, Döblin's prose is able to modulate between the descriptive, the allegorical, as well as the surreal. While officially classified as a work of \"expressionism,\" Berlin Alexanderplatz is nevertheless a remarkably prescient representation of the historical rise of National Socialism. An astonishing masterpiece-one of the major works of the century, beyond any doubt."}, {"review_sentiment": 4.0, "review_text": "Hace algún tiempo que leí la novela y recuerdo que fue un placer hacerlo. No es una obra excesivamente fácil y hay que acercarse a ella con atención y sin prisas. Pero es un esfuerzo que verdaderamente compensa."}]}, "authors": ["Alfred Doblin"], "isbn": "080446121X", "longitude": 13.3888599, "periods": ["1900s"], "title": "Berlin Alexanderplatz: The Story of Franz Biberkopf", "word_cloud": "seminal work imaginative work tragedy renaissance stuff kinda need new perspective seer scion favorite admire panoramic trilogy figure epic translate friend great debt modernist deep tell tale central city city come alive vividly anticipate protagonist lack broad appeal every man erudite leftist place le politically charge atmosphere pimp thug harder care fate connive man suffer leave potential sexy thriller plot engage perk debate elderly worker anarchic sympathy last page dribble see glimpse others editorial voice device sometimes lot tip fate intervention distance criticize date rendered purportedly difficult translate dialect mind tone fit gangster image bootlegger period similar slangy mock dialogue lack suspense make enervate readable sure passage omniscient narrator channel charge fashion odds earthy character setting surprise engross simply amazing insightful review write big think translation seventy year ago simply good best bet purchase new translation mind capture completely allegedly untranslatable argot lowlife seem pretty much exclusive available translation available time write ie id cir keywords well honestly half work definitely worth extra appear good translation yes german ulysses really get inside head character let least much go inside head point best summed page know know price pay low somewhat challenging reward long character start hat begin tolerate finally come least empathy surprise most way seem nihilistic buddy tend odds end moral see parody reference always believe exert life life death exert will show weak always comparison learn hard cocky man man pay attention others seem empathy strength egotistic coward frauds self make man describe begin also seem celebrate redemptive cleanse power guilt expression guilt useless emotion place save subconscious mind force accept pitiless hand personal responsibility crush guilt add poverty death despair wickedly funny terrific wacky absurdist sense humor pretty also amaze swastika men publish prophetic predilection collapse additional warfare true masterpiece era profoundly representation nation undergo pathological convulsion man release jail manslaughter determine live moral life quickly find life longer possible world gangster fascist hoodlum everything world sense recognition available moral bondage prose constantly flux turn perspective shift voice narrative omniscience internal almost narration freely insert consciousness sustain character combination rapidly alternate register perspective prose able modulate descriptive allegorical well surreal officially classified work expressionism nevertheless remarkably prescient representation historical rise astonishing major work century doubt algal tempo we lee la recuerdo we few un placer hacerlo e tuna obra excesivamente facile hay we acercarse ella con atención sin prism e un esfuerzo we verdaderamente compensate", "genres": ["Fiction & Literature", "Weimar Republic"], "summary": "Alfred Doblin (1878-1957) studied medicine in Berlin and specialized in the treatment of nervous diseases. Along with his experiences as a psychiatrist in the workers' quarter of Berlin, his writing was inspired by the work of Holderlin, Schopenhauer and Nietzsche and was first published in the literary magazine, Der Sturm.\r\n\r\nAssociated with the Expressionist literary movement in Germany, he is now recognized as on of the most important modern European novelists. Berlin Alexanderplatz is one of the masterpieces of modern European literature and the first German novel to adopt the technique of James Joyce.\r\n\r\nIt tells the story of Franz Biberkopf, who, on being released from prison, is confronted with the poverty, unemployment, crime and burgeoning Nazism of 1920s Germany. As Franz struggles to survive in this world, fate teases him with a little pleasure before cruelly turning on him.", "asin": "080446121X", "rank": "1132011", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/517Y4XJ3MJL.jpg", "country": "Germany", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}