{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 185, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "THRILLER... GOOD SERVICE"}, {"review_sentiment": 4.0, "review_text": "I pretty good book but not great."}, {"review_sentiment": 5.0, "review_text": "This is the first novel by Thomas Perry that I have read but it won't be the last . Very well written , great plot, good triumphs over evil , and the woman wins."}, {"review_sentiment": 4.0, "review_text": "It took me a little while to get into this book but it was well worth it!"}, {"review_sentiment": 2.0, "review_text": "Read \"The Old Man\" and enjoyed it, but this one never captured my interest."}, {"review_sentiment": 5.0, "review_text": "The first Jane Whitefield I have read. Thomas Perry is now one of my top five  mystery writers. Suspense builds throughout"}, {"review_sentiment": 3.0, "review_text": "There was too much detail. Not enough storyline in. Her escape was not believable to me.she killed him in the end and then what"}, {"review_sentiment": 5.0, "review_text": "this is actually my favorite in the series"}, {"review_sentiment": 4.0, "review_text": "This novel held my interest from start to finish. I will be reading more Jane Whitefield novels.  She's an interesting character with great history."}, {"review_sentiment": 2.0, "review_text": "Way to implausible for me.  The villains' amazing set of survival abilities and cunning vs. the heroines amazing ability to divine the villains tactics and escape tactics through literally hundreds, if not thousands of square miles in the remote New York Adirondacks stretched my believability limit to the breaking point. I appreciated the Indian historical references to a degree; they seemed tortuously long at some points so I skimmed through them,  and I also liked the geographical references and detail, but the rest was simply too unbelievable for me."}]}, "authors": ["Thomas Perry"], "isbn": "0804113874", "longitude": 0.0, "periods": ["1900s"], "title": "Vanishing Act (Jane Whitefield)", "word_cloud": "service pretty good great first last very well write great plot good triumph evil woman win take little get well worth enjoy never capture interest first top mystery writer build much detail not enough escape believable kill end actually favorite series hold interest start read novels interesting character great history implausible villain amazing set survival ability cunning heroine amaze ability divine villains tactic escape tactic literally hundred thousand square mile remote stretch believability limit break point appreciate indian historical reference degree seem tortuously long point skim also like geographical reference detail rest simply unbelievable", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 1/8 in the Jane Whitefield Series\r\n\r\n\"A Challenging, surprising thriller with many twists. \" The New York Times\r\n\r\nJane Whitefield is a Native American guide who leads people out of the wilderness--not the tree-filled variety but the kind created by enemies who want you dead. She is in the one-woman business of helping the desperate disappear. Thanks to her membership in the Wolf Clan of the Seneca tribe, she can fool any pursuer, cover any trail, and then provide her clients with new identities, complete with authentic paperwork. Jane knows all the tricks, ancient and modern; in fact, she has invented several of them herself.\r\n\r\nSo she is only mildly surprised to find an intruder waiting for her when she returns home one day. An ex-cop suspected of embezzling, John Felker wants Jane to do for him what she did for his buddy Harry Kemple: make him vanish. But as Jane opens a door out of the world for Felker, she walks into a trap that will take all her heritage and cunning to escape.... \r\n\r\n\"Thomas Perry keeps pulling fresh ideas and original characters out of thin air. The strong-willed heroine he introduces in Vanishing Act rates as one of his most singular creations.\" The New York Times \r\n", "asin": "0804113874", "rank": "161137", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51IMzOXIJKL.jpg", "country": "Vancouver", "story_arc": ["Tragedy", "Things only get worse"]}