{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 43.6044622, "ratings": {"num_ratings": 242, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Buyers Beware!!!Very good read but a very confusing situation:This book has two other titles so beware if you, like  me, want to read all the Bruno Books.I bought \"Death Undercover\" which is the same book and on the back cover of\"Death Undercover\" it reads that  Death Undercover was originally published under the title\"Children of War\"So there are 3 titles for the same book."}, {"review_sentiment": 4.0, "review_text": "MaintaIns usual quality.  Story Interestingly paced, well written using ordinary language level.  As always an unexpected twist...but believable."}, {"review_sentiment": 5.0, "review_text": "SUPER STORY !"}, {"review_sentiment": 4.0, "review_text": "Loved it. Hard to put it down."}, {"review_sentiment": 4.0, "review_text": "I like this series and am tempted to give it five stars instead of four, but I do get just a wee bit tired of the food and wine stuff and Bruno is starting to be just a little too perfect. Still, it's a pleasure and I recommend this book. You might want to start at the beginning and read them in order, though."}, {"review_sentiment": 4.0, "review_text": "Good, surprising resolution. The omnipresent romantic feelings are a nice diversion from the usual \"murder\" mystery."}, {"review_sentiment": 5.0, "review_text": "Love Jesé books"}, {"review_sentiment": 4.0, "review_text": "Walker provided a historical novel, based in rural France, containing a look at terrorism, France in WWI WWII, economic struggles, customs, psychology,  and romance.  The main characters were reasonably developed as was a perspective regarding autism.My attention was maintained through the novel."}, {"review_sentiment": 5.0, "review_text": "Just a wonderful series. Very evocative of the French countryside and the characters are highly engaging."}, {"review_sentiment": 3.0, "review_text": "I've been reading the Bruno series for the last six weeks, and have read - and enjoyed very much - all the books in order up to this one.  Were I reviewing the other books, I'd certainly give each of them five stars.  So why three stars for this one?Purely and simply, it is because of the unrealistic, contrived, unnecessary, and ultimately unbelievable romance at the end of the book between Bruno and an American FBI agent who is also a friend of Bruno's former love, Isabelle.  Why do I use the previous descriptors?  Because Bruno is both a humane man and one who learns from previous mistakes.  He would not be likely to do such a hurtful thing to his local lover, Pamela; nor would he get involved, after Isabelle, with another hard-charging, high-powered law enforcement professional.  If he was unlikely to entice Isabelle to St. Denis to marry him and have children, he'd be even less likely to do so with her American equivalent.  I didn't buy it, and for the first time in the entire series it made me think less of Bruno.It's not a deal-breaker, and I've still got three more Bruno books to read until I've caught up to the series.  But this one was a disappointment, and I hope for better things in the next episode."}]}, "authors": ["Martin Walker"], "isbn": "0804173427", "longitude": 1.4442469, "periods": ["2000s", "Recent Releases"], "title": "The Children Return", "word_cloud": "buyer very good confuse situation title beware want buy back cover read originally publish title title usual quality pace well write use ordinary language level always unexpected twist believable love put like series tempt give star instead get wee bit tire food wine stuff start little perfect still pleasure recommend start begin order good surprising resolution omnipresent romantic feeling nice diversion usual murder mystery provide historical base rural contain look terrorism economic struggle custom psychology romance main character reasonably develop perspective regard attention maintain just wonderful series evocative french countryside character highly engage read series last week enjoyed much order review certainly give star so star purely simply unrealistic contrive unnecessary ultimately unbelievable romance end agent also friend former love use previous descriptor humane man learn previous mistake likely hurtful thing local lover involved law enforcement professional unlikely entice marry even le likely american equivalent buy first time entire series make think le still get catch series disappointment hope better thing episode", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Bruno’s village of St. Denis has been called many things, but a hotbed of international intrigue has never been one of them . . .  until now. When an undercover agent is found murdered just as a prodigal son is set to return from a grim tour in the Middle East, the small town suddenly finds itself host to a determined global tribunal, threatening the usual cheer brought by St. Denis’s annual wine festival. \r\n\r\nWith clever twists and action aplenty, The Children Return is a journey to St. Denis that readers won’t soon forget.", "asin": "0804173427", "rank": "65676", "city": "Toulouse", "image": "https://images-na.ssl-images-amazon.com/images/I/51amMWyN6TL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}