{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 43.6044622, "ratings": {"num_ratings": 229, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "Bruno finds himself in an embarrassing dilemma by the end of this modestly exciting mystery; an ending slightly implausible but quick and deadly. The Bruno books are more about atmosphere, ambiance and the communal friendship of the Dordogne region of France; stories drenched in good food and wine, aptly described landscapes, and bursting with historical backdrops (in the case. the Franco Russian alliances in World War Two and after) and Bruno, his companions, the St. Denis town folk, his dog, horse and lovers."}, {"review_sentiment": 5.0, "review_text": "A great book.....but if you want to read the entire series........Buyer Beware!This book is also titled\"The Dying Season\"No warning anywhere that the book has had  two titles..."}, {"review_sentiment": 4.0, "review_text": "I know that Martin Walker is a big cheese in international politics, but I prefer it when he sticks to the French countryside. Still I've given this one four stars, despite the excursion into  Russian-French history and politics, because of his marvelous descriptions of that countryside and its food and its characters. You can't not like his Bruno series. Sometimes the plots are better, sometimes less successful, but the characters are always delightful and the coziness of his environment is addictive. I have never regretted submerging myself in his town of St Denis and vicariously enjoying its food and drink. I expect to go on reading him for several more years."}, {"review_sentiment": 3.0, "review_text": "Well, the Bruno formula is surviving, but the plot stretches are getting more and more incredible."}, {"review_sentiment": 3.0, "review_text": "This is the sixth Bruno novel I have read and the least satisfying. The recycled characters are starting to taste like reheated leftovers. Unlike some of the other reviewers, I can live with food porn, it's the plot that's become a moldy Swiss cheese. And where did the author get the idea that the Soviet Yak was the fastest propeller driven fighter of WW2, and why was that error even necessary?I have to agree with earlier reviewers  that the editors seemed to be asleep at the switch.The novel is a little like a soap opera or like an SNL satire of a soap opera.Despite my complaint I miss badass Isabelle.This one has soured me on Bruno for a while."}, {"review_sentiment": 5.0, "review_text": "Great fun, the ending is a bit contrived but that is a minor quibble."}, {"review_sentiment": 3.0, "review_text": "Love this series, as I resided in France and visited this region.  But not one of the better ones about policeman Brune."}, {"review_sentiment": 4.0, "review_text": "I am enjoying reading the \"Bruno books\" in order.  This one was as good as all the rest, but I am concerned that St. Denis is becoming a global battleground.  It is starting to seem like all the troubles of the world are focused right there.  I live in a small village in Washington state in sight of an international boundary and we don't seem to have that kind of intrigue taking place, which is to say plots in the novels are becoming unrealistic to say the least.  A question I would like to ask Bruno if I could, \"Are you blind?  If you want a wife and family, give Florence more than the time of day!!\""}, {"review_sentiment": 5.0, "review_text": "Great series!"}, {"review_sentiment": 5.0, "review_text": "The ending was a bit abrupt but a fun read. Can be readin an afternoon at the beach! Leads to wanting more."}]}, "authors": ["Martin Walker"], "isbn": "0804173516", "longitude": 1.4442469, "periods": ["2000s", "Recent Releases"], "title": "The Patriarch", "word_cloud": "find embarrass dilemma end modestly exciting mystery end slightly implausible quick deadly atmosphere ambiance communal friendship region story drench good food wine aptly describe landscape burst historical backdrop case alliances companion town folk dog horse lover great want entire series also title warn anywhere title know big cheese international politics prefer stick french countryside still give star excursion history politics marvelous description countryside food character series plot better sometimes le successful character always delightful coziness environment addictive never regret submerge town vicariously enjoy food drink expect reading several year well formula survive plot stretch get incredible sixth least satisfy recycled character start taste reheat leftover reviewer live food porn plot become moldy swiss cheese author get idea fastest propeller driven fighter error even necessary agree earlier reviewer editor seem asleep little soap opera satire soap complaint miss bad ass sour fun end bit contrive minor quibble series reside visited region better one policeman enjoy read order good rest concern become global battleground start seem trouble world focus right live small village state sight international boundary seem kind intrigue take place say plot novel become unrealistic say least question want wife family florence time day series end bit abrupt fun afternoon beach lead want", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Bruno Courrèges is thrilled when he receives an invitation to the lavish birthday celebration of his childhood hero, World War II flying ace Marco “the Patriarch” Desaix. But when the party ends in the death of one of Marco’s longtime friends, Gilbert, it turns into another day on the job for St. Denis's chief of police. \r\n\r\nAll signs point to a tragic accident, but Bruno isn’t so sure, for there is more to the Desaix family's lives and loyalties than meets the eye. There’s Victor, the Patriarch’s son and Gilbert's sometimes rival, and Victor’s seductive wife, Madeleine, whose roving eye intrigues Bruno even more than her fierce political ambitions. Not to mention the Patriarch himself—did his postwar Soviet ties intersect too closely with Gilbert’s career in Cold War intelligence? As Bruno’s entanglement with the Desaix family becomes more complicated, his inquiries into Gilbert’s life will become a deadly threat to his own.", "asin": "0804173516", "rank": "48668", "city": "Toulouse", "image": "https://images-na.ssl-images-amazon.com/images/I/51Ts-JBUGBL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}