{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 31, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Brilliant."}, {"review_sentiment": 5.0, "review_text": "An interesting novel. It is very character focused, with major themes of post-colonial identity in 20th century Egypt. Taking place in both England and Egypt, the book jumps around in time slowly revealing the origins of our main character."}, {"review_sentiment": 4.0, "review_text": "If you want likable characters and a complex plot, don’t read “Beer in the Snooker Club.” If you want to feel drunk on lofty thoughts and get tangled up in the simple lives of characters who have made themselves complex, go for it. “Beer” isn’t a traditional story: If you took out the dialog and Ram’s thoughts, the plot could be summed up in ten sentences. It is not what happens to the characters, but what they say and feel about it, that matters. I deeply dislike the hero, yet the author uses him to express profound ideas and thoughts. Sometimes, the world of “Beer in the Snooker Club” seems very far away, but at others, it seems all too close. The book is often very depressing, full of discontent and even despair, but at the same time it is generously thought-provoking."}, {"review_sentiment": 5.0, "review_text": "I was drawn to this book because of its relative obscurity. Who says to themselves, \"I really want to read a book about Egypt in the 1950s,\" unless you have some sort of tie to the area. But if you do ask yourself that question and discover this book, you'll likely be pleased with what you find.The book is charming and immersive. You get a good feel for the area and Ghali makes you feel right at home in his world. This was his only book, which is a bummer, but it's a delightfully entertaining tale.This is a good book for people in search of something that has a little quirk or is out of the ordinary. I really enjoyed my time with this book."}, {"review_sentiment": 4.0, "review_text": "For people knowledgeable on Egypt's history post WWII, this will be an easy story line to understand.  For those who do not like history, the plot will be confusing or not make any sense.The story is about three upper-class Egyptians who have been educated in England.  They speak English and live in a plush neighborhood of Cairo.  They have servants and drive nice cars.  Well, perhaps at one time they did, but the Suez Canal conflict really put a damper on a lot of Egyptians' lives.  It was a war fought by the lower-class.And this story deals a lot about class, minority status (the two male protagonists are Copts), and Egypt's treatment by England and Israel.  King Farouk had been dethroned in 1952 by his rebellious free officers, of whom the leader was General Neguib, who later resigned and placed Nasser in command. Colonel Gamal Abdel Nasser, who became the next leader of Egypt. Nasser nationalized the Suez Canal in 1956, much to the West's chagrin, and later that same year. Israel invaded the Suez Canal, with help from England and France. The canal was closed to shipping until 1957.  The conflict weakened England's influence over Egypt. Nassar was seen as a national hero to the Egyptians.  He was a Socialist who sought financial help by the Soviet Union, although he never let Egypt fall under the Soviet sphere.All these political events come up in this novel.  Anti-colonialism, anti-Imperialism, worker's rights, religious freedom, class conflict, sexism,  Jewish political strength, all make their appearance in this novel.  Religion as a major factor is absent.  Ghali's experience in England in his own life play a big role in the three major players. Egypt's youth is trying to build its own niche of the post WWII and Suez Canal crisis, yet being educated in England is still a coveted status only the wealthy can afford.  Waguih Ghali uses many incidents of his own life to bring life to these characters and by sending a message as well.  What he shows is an Egypt suffering from an identity crisis, furtively wanting its own identity and respect in the world without being subjugated to a second-class political power.The title of this book is an allegory to this struggle of Egypt's younger generation, and it plays well with smart dialogue and emotion.  My one complaint is that the French phrases that some of the Egyptians say are not translated into English.  Luckily for me, I understand basic French, but for those who do not, and for those who do not understand the political background of this novel, may be left confused and bored and not finish the book.This book was published in 1964 in English.  Yet the political message once again applies to today's Egyptians as they once again find themselves in civil war and a new identity among the Arab-Muslim world."}, {"review_sentiment": 4.0, "review_text": "Waguih Ghali's semi-autobiographical novel, originally published in 1964 or thereabouts, has charmed critics for decades, and deservedly so.  \"Snooker Club\" tells the story of Ram, a charming wastrel born to an aristocratic family of limited financial means who struggles to find his place in Nasser's Egypt.  An ugly comic novel, \"Snooker Club\" indicts European attitudes toward Egypt along with the Egyptians who seek to maintain their privileged status at the expense of their countrymen.I had to do a fair amount of reading to become familiar with Ghali's Egypt.  President Nasser had been a key player in the nationalistic coup that toppled Egypt's monarchy - the crown that had effectively ceded control of Egypt to Britain.  (I am sure I'm missing vast swaths of key information here.)  To say that Nasser did not care too much for the civil liberties of the Egyptian people is at best an understatement, but he was a strong voice for Egyptian nationalism.  And so it is no surprise that a young man such as Ram might wonder at his place in the world - there is much to admire, and even love, in Europe, but as an Egyptian the European lifestyle is not quite true.  But he is also the kind of man who is expected by his class to play croquet at the club and wile away his days drinking and splashing in the pool, served by countrymen who will never have his money or connections.  So Ram really isn't \"Egyptian,\" either.Ghali's novel is unsparing in its contempt and has been compared favorably to \"Catcher in the Rye.\"  I enjoyed Ghali's book more, but I can't say that I'm eager to dive back into this short novel - the withering humor takes its toll after a while.  I also need to do some reading about Egypt before re-reading this novel, as I owe it to Ghali to understand his world better than I currently do.Accordingly, I freely admit that I may revisit the novel to add a fifth star - I fear that my lack of knowledge caused a fair amount of this book to go over my head.  I strongly recommend it as an eye-opening read and an introduction to a part of the world that I should understand better.  That's pretty high praise for a novel."}, {"review_sentiment": 4.0, "review_text": "While there is some attempt by this book’s publisher to compare its protagonist Ram, to Holden Caulifield. While Ram does have a few character traits as Holden, such as a certain aimlessness, high intelligence, and a smart mouth, it seems like a poor comparison at best. Set it in the 1950’s, its certainly far removed from contemporary Egypt when a Coptic man can have a relationship with a Jewish woman, even if they can never get married. Ram, an educated, but unemployed middle/upper middle class Coptic Christian man is at a standstill. He can’t marry the woman he loves. He isn’t interested in working (or at least not very hard). His mother nags him for not having a job or a wife. We get some insight into what led him here and ay least a hint at the end that he may settle/settle down into a kind of respectable life.While I know a little about the time, I felt like if I knew much more, it would have helped. My review copy lacked the introduction, which might have helped. I’m glad this book is back in print and hope more new and old translations of other Egyptian writing will make it in the U.S. market, a place sorely lacking in translated work."}, {"review_sentiment": 5.0, "review_text": "Did you know that there’s an entire literary genre of the over-educated-under-ambitious characters? Ram Bey, the main character in Beer in the Snooker Club is one.  The story was written in 1964, and takes place right around the 50s when Britain had released its grip on Egypt from exploitation. King Farouk was dethroned and a democratically elected president Nasser would take over. Egypt clearly hadn’t rid of itself form the Turkish influence, let alone the British. Words like ‘Bey’ or  ‘Effendi’ are all words used in the book, and they are all superficial titles of respect. Well, superficial now, to me. Back then people took this stuff seriously. We’re all Americans now: first name only regardless of who you are.  Ram Bey should have come to America. The greatest capitalist system in the World with no real class hierarchy—a dream of socialism, which is what Ram Bey’s Jewish amore, Edna, tries to convert him to. Entangled in cultural crossroads and lost, this is a tragicomedy of circumstances in a vacuum left by exploitive forces."}, {"review_sentiment": 4.0, "review_text": "Beer in the Snooker Club is set in Egypt in the late 50s/early 60s, and is a reissue from 1964. It's semi-autobiographical, following along Ghali's life timeline, and Ram, the main character, has a background very similar to Ghali. He's a Copt (a Christian religion), born into a wealthy family (whose gains Ram considers to be ill-gotten), and educated in an English school. It's a juxaposition of many things: Egypt was (and remains) a primarily Muslim country, Ram never seemed to be able to get and hold a good job, and Egypt was undergoing a national pride revival and considered English-educated to be Anglophiles and viewed them somewhat suspiciously.It was an interesting read to me because the of http://www.amazon.com/The-Map-Love-A-Novel/dp/0385720114, one of my favorite books, also set in Egypt, but in the early 1900s and 1970s, from colonial rule to independence. Beer in the Snooker Club connects some of the timeframe and events between the two time periods.Ram's conflicts are quite clearly clearly delineated - and Ghali also uses some very sharp wit, excoriating some of the practices of the time. \"When an Englishman wants a new market for his adulterated goods, he sends a missionary to teach the natives the gospel of peace.\"Knowing that the author committed suicide not long after the book was released, Beer in the Snooker Club ends up being a somewhat tragic memorial to him."}, {"review_sentiment": 5.0, "review_text": "\"Beer in the Snooker Club\" by Waguih Ghali is a wonderful trip back to 1950's Cairo in this fabulous reissue. A book I had never heard of but adored the title and was intrigued by the local with its struggling Bohemian youth and the political figures of the day. It's a book that gives you an appreciation for events of those times that could never be recreated by writers of today. The flow is wonderful and takes you on a jolly jaunt back in time through the pages for a swift read you'll be delighted you picked up. And thrilled to have it been brought back to market!A surprising literary delight that should not be missed!"}]}, "authors": ["Waguih Ghali"], "isbn": "0804170746", "longitude": 31.243666, "periods": ["1900s"], "title": "Beer in the Snooker Club", "word_cloud": "brilliant interest character focus major theme identity century place jump time slowly reveal origin main character want likable character complex plot want feel drunk lofty thought get tangle simple life character make complex traditional story take dialog thought plot ten sentence happen character say feel matter deeply dislike hero yet author us express idea thought sometimes world seem far away others seem close often depressing full discontent even despair time generously draw relative obscurity say really want sort tie area ask question discover likely pleased charm immersive get good feel area make right home world bummer delightfully entertaining good people search something little quirk ordinary really enjoy time people knowledgeable history post easy story line understand history plot confuse story educate speak english live plush neighborhood servants drive nice car well perhaps time conflict really put lot live war fight story deal lot class minority status male protagonist treatment dethrone rebellious free officer leader later resign place command become next leader nationalize much chagrin later year invade help canal close ship conflict weaken influence see national hero seek financial help never soviet political event come worker right religious freedom class conflict sexism jewish political strength make appearance major factor absent experience life play big role major player youth try build niche post crisis yet educate still covet status wealthy afford use many incident life bring life character send message well show suffer identity crisis furtively want identity respect world subjugated political title allegory struggle younger generation play well smart dialogue emotion complaint french phrase egyptian say translate english understand basic french understand political background confused bored finish publish english yet political message applies today find civil war new identity world originally publish thereabouts charm critic decade deservedly tell story charming wastrel bear aristocratic family limit financial mean struggle find place ugly comic indict european attitude seek maintain privileged status expense fair amount read become familiar player nationalistic coup topple crown effectively cede control sure miss vast swath key information much civil liberty egyptian people best understatement strong voice egyptian nationalism surprise young man place world much admire even egyptian european lifestyle quite true also kind man expect class play croquet away day drink splash pool serve countryman never money connection so really egyptian unsparing contempt compare favorably enjoy eager dive back short withering humor take toll also need read owe understand world better currently freely admit fifth star fear lack knowledge cause fair amount go head strongly recommend introduction part world understand better pretty high praise attempt publisher compare protagonist character trait certain aimlessness high intelligence smart mouth seem poor comparison best set certainly far removed contemporary man relationship woman even never married educate unemployed middle class man standstill marry woman love interested work least hard mother nag job wife get insight lead ya least hint end kind respectable know little time felt know much review copy lack introduction glad back print hope new old translation egyptian write make market place sorely lack translate work entire literary genre character main character story write take place right around release grip exploitation dethrone democratically elect president clearly rid form turkish influence alone british word word use superficial title respect superficial people take stuff seriously first name regardless come greatest capitalist system real class dream socialism try convert entangled cultural crossroad lose tragicomedy circumstance vacuum leave exploitative force set late reissue follow life timeline main character similar religion bear wealthy family gain considers educate english school juxtaposition many thing remain primarily country never seem able get good job undergoing national pride revival consider view somewhat interesting http favorite also set early colonial rule independence connect time frame event time conflict quite clearly clearly delineate also use sharp wit excoriate practice time want new market adulterate good sends missionary teach native peace author commit suicide long release end somewhat tragic memorial wonderful trip back fabulous reissue never hear adored title intrigue local struggle bohemian youth political figure day give appreciation event time never recreate writer today flow wonderful take jolly back time page swift delight picked thrill bring market surprising literary delight miss", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "Set amidst the turbulence of 1950s Cairo, Beer in the Snooker Club is the story of Ram Bey, an over-educated, under-ambitious young Egyptian struggling to find out where he fits in. Ram’s favorite haunt is the fashionable Cairo Snooker Club, whose members strive to emulate English gentility; but his best friends are young intellectuals who devour the works of Sartre and engage in dangerous revolutionary activities to support Egyptian independence. \r\n\r\nBy turns biting and comic, Beer in the Snooker Club — the first and only book by Waguih Ghali — became a cult classic when it was first published and remains a timeless portrait of a loveable rogue coming of age in turbulent times.\r\n\r\n“Like The Catcher in the Rye in America, [Beer in the Snooker Club] articulated the identity crisis of a generation. . . . [The novel] presents uncanny parallels to today’s Egypt, where artists, intellectuals and youth at large are beginning to fashion a new cultural republic of sorts even as they also struggle to find their bearings.” The New York Times ", "asin": "0804170746", "rank": "219316", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51mTk5IiG5L.jpg", "country": "Egypt", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}