{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 36.1662859, "ratings": {"num_ratings": 3, "rating": 3.2, "reviews": [{"review_sentiment": 2.0, "review_text": "Its an OK read, sadly not what I had expected, after the reviews that I read."}, {"review_sentiment": 4.0, "review_text": "Pretty decent read. Most of the writings reitereated the \"Bugsy Siegel started Las Vegas\" story and then went in different directions. I found the article/story on segregation in Las Vegas particularly interesting as Vegas is pretty diverse today and I for some reason thought Vegas being the rebel town that it is avoided the racial tensions of the 60's.Each of the essays and stories reveal something you don't know about Vegas, but they also bring a sense of melancholy - Vegas isn't all giltter and glamour under the lights, even if you're a gangster's daughter, a comedian getting his big break, or a regular Joe."}, {"review_sentiment": 5.0, "review_text": "Seen through the eyes of some of America's best writers, these 26 pieces include a 1964 piece which Tom Wolf wrote for Esquire, an excerpt from Hunter S. Thompson's book, \"Fear and Loathing in Las Vegas\", a  diary of Noel Coward's Las Vegas gig and a 1952 article from the New Yorker  about atomic bomb testing when rooftop parties welcomed the flashes of  light in the desert.  There's a piece by John Gregory Dunne about the life  of an obscure comedian, a piece by Joan Didion about the marriage chapel  industry and lots of well written and interesting pieces about gambling and  the changes that have occurred in Las Vegas right up to 1993.My  favorites pieces by far though were the personal recollections of two women  who grew up there, both from very different backgrounds.Susan Berman,  growing up in the 1950s,  is the daughter of the mobster Dave Berman.  She  describes how her father taught her math by giving her a slot machine to  play with and the Sabbath meals that her grandmother used to prepare for  her father's Jewish gangster friends.Phyllis Barber also grew up during  the same period of time and recalls how her family woke early one morning  to drive out to see the atomic blasts and be part of history.  Church-going  religious Mormons, her mother disapproves when she joins the precision  marching dance team at Las Vegas High School. Later she has to make a  difficult choice between representing a casino in a parade and attending  church on a Sunday afternoon.I wished that some of these pieces could be  longer.  I would have liked to have delved deeper into some of the  articles, especially these personal recollection pieces.  But the tone of  the book is a lot like Las Vegas itself.  The lights keep flashing, the  cards keep being dealt and the roulette wheel keeps spinning.  All the  reader can do sit back and enjoy!"}]}, "authors": null, "isbn": "0805036709", "longitude": -115.149225, "periods": ["1900s"], "title": "Literary Las Vegas: The Best Writing About America's Most Fabulous City", "word_cloud": "sadly expect review pretty decent writing reiterate start story go different direction find segregation particularly interesting pretty diverse today reason think rebel town avoid racial tension essay story reveal something know also bring sense melancholy glitter glamour light even gangster daughter comedian get big break regular eye writer piece include piece write excerpt diary gig article atomic bomb test rooftop party welcome flash light desert piece life obscure comedian piece marriage chapel industry lot well write interesting piece gamble change occur right favorite piece far personal recollection woman grow different grow daughter mobster describe father taught math give slot machine play meal grandmother use prepare father jewish gangster also grow period time recall family wake early morning drive see atomic blast part history religious mother disapprove join precision march dance team make difficult choice represent casino parade attend church wish piece delved deeper article especially personal recollection piece tone lot light flashing card dealt roulette wheel keep spin sit enjoy", "genres": ["Essay", "Fiction & Literature"], "summary": "Literary Las Vegas brings together the best writings from this neon outpost in the desert. Ranging from the hilarious to the tragic, these pieces provide what Nick Tosches calls a \"Baedecker to the bizarre, a Virgil in shades, not only to the holy city but to the off-the-rack soul that we, one nation under Frankie's toup, so strangely and fatally share.\" \r\n\r\nThe essays and short stories in this collection reveal the glitz and history of a city that has gone from \"mobster and starlet hideaway, to haven of sin and vice, to its present incarnation as low-roller heaven\" and still remains the marriage capital of the U.S. As the editor notes, \"Who else but Las Vegas would make the A-bomb a picnic? An honest-to-God picnic.\" Believe it or not, tourists would travel to a local hilltop, with lunches provided by the casinos, to view the test blasting of the atomic bombs. There is plenty of more fascinating reading for those who love, hate, or never even thought much about this city. There are tales of lounge lizards, millionaires, showgirls, gangsters, gamblers, and businessmen from writers such as Joan Didion, Noel Coward, Hunter S. Thompson, and A. J. Liebling.\r\n\r\nIncisive, entertaining, and highly readable, Literary Las Vegas creates a unique anecdotal history about this one-of-a-kind place.\r\n", "asin": "0805036709", "rank": "2037613", "city": "Las Vegas", "image": "https://images-na.ssl-images-amazon.com/images/I/71FSX3VCQNL.gif", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}