{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 50, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "This is the best book I have read this year. A beautifully written collection of stories with Africa as the tie among the characters.  I could not put it down and am a little bit in mourning now that it is  done."}, {"review_sentiment": 5.0, "review_text": "This book takes one on a journey rich in African culture and experience, but in a more profound, universal sense, it resonates with a deep thrum of the inner and varied landscapes of the heart and the paths we choose therein"}, {"review_sentiment": 4.0, "review_text": "This collection of stories, woven together into a sprawling story of a community of African women, was both thought-provoking and easy to read in one sitting. The cast of characters, who meet at the Precious Brothers Beauty Salon in the Ivory Coast, have inspiring stories of forgiveness and heartbreak, reconciliation and the things they can never let go of. Susi Wyss uses her life experiences as a manager of health programs in Africa and exquisite writing to craft a memorable debut novel."}, {"review_sentiment": 5.0, "review_text": "Having lived for three years in West Africa, I always struggle with an appropriate response to people asking me, \"How was it?\"  After finishing Susi Wyss's book, I believe that she has done an incredible job of answering this question. I really do want to go out and buy a copy for every person who asks about my time on the continent. The author is a wonderful storyteller, and her ability to spin a number of continent-spanning stories into a single narrative leaves the reader with a sense that they have taken the time to read something worthwhile. The portrayals are interesting, accurate, heartfelt and well-researched-- and best of all, they never fall into the cliche assumptions that people can often make about \"Africa\". I can't wait to see what Susi Wyss comes out with next. Read this book and pass it on."}, {"review_sentiment": 5.0, "review_text": "This is a wonderful book. Each story is excellent, but together they make up a compelling novel about Janice, an American woman working in international development in Africa, and Adjoa, the woman whose life intersects with hers. There's an interesting cast of characters circulating here, and fascinating settings from around the continent (as well as a couple set in the U.S.)Highly recommended."}, {"review_sentiment": 5.0, "review_text": "Out of Africa . . . A GemBy Patricia SchultheisThis collection of nine interrelated short stories by Susi Wyss is a gem of a book that's as enjoyable for its warm-hearted narratives as it is for its insight into the complexities of modern-day Africa.  Centered on four women from diverse backgrounds and cultures whose live intersect and carom with each others', these stories maintain their focus on the day-to-day lives of their characters, while keeping larger, political issues in the background.  Under Wyss's deft hand, the slightest event ¯the lift of an eyebrow, a flock of butterflies, a child's wide-eyed stare -- can carry a world of meaning.  And can also invite the reader into a universe of greater understanding."}, {"review_sentiment": 5.0, "review_text": "This is a poignant and gripping work, more so because the author is seeing the continent from a unique perspective as both an outsider and an insider.  Don't miss this work - the characters will stay with you long after you close the book."}, {"review_sentiment": 5.0, "review_text": "Susi Wyss' collection of interrelated short stories provides a fascinating glimpse into African cultures that is simply not available to tourists or business travelers. The characters and situations are drawn with exquisite skill from the everyday lives of Africans and ex-pats. Ms. Wyss shares the insights she has accumulated through many years of living and working in Africa. The book is a pleasure to read and a welcome relief from the usual modern book fare of crime novels, spy thrillers, and the supernatural. It is highly recommended reading for anyone who has an interest in the complex and (to most of us) mysterious continent."}, {"review_sentiment": 4.0, "review_text": "Susi Wyss' THE CIVILIZED WORLD is everything I love about literary fiction: vivid prose that reads like poetry; memorable, multifaceted characters with whom you cheer and grieve; settings so alive you can feel the grit between your teeth; language that is both accessible and beautiful. A book with words that linger, creating a world marvelously alive to you.Told through a series of vignettes over many years, each leap finds us visiting Adjoa and Janice at another point in their storied lives. While other characters come and go, these two women -- one African; one American -- felt like the true main characters. They were the ones to whom I was emotionally bonded, and I couldn't help but feel Adjoa's hurts and frustrations. Her twin brother was someone I never \"clicked\" with, knowing he couldn't possibly be up to any good, but I cared for him because Adjoa did. She's a hardworking, tenacious and brave woman -- someone you can't help but like.The atmosphere of THE CIVILIZED WORLD is engrossing, and I'm a bit abashed to note that I knew (and know) little of Africa before reading this book. Though not exactly well-versed now, I'm more on my way -- and definitely intrigued. This peek at life in Ghana and Malawi is unvarnished. Wyss' work is described as \"influenced by her twenty-year career managing women's health programs in Africa, where she lived for more than eight years,\" and I felt like the character of Janice -- a white American -- could be an extension of the author. Janice was broken, a little bit jaded -- but ultimately someone I felt for. Her passages with Adjoa were my favorites.At just over 250 pages, THE CIVILIZED WORLD was a quick read that really got me thinking. Regardless of the differences that kept Adjoa and Janice separate, their bonds -- the need for love; the searching for acceptance; the grief for things that were and are not now -- was palpable. Though the extraneous characters didn't mesh as well for me, I loved Ophelia's obsession with offbeat African names (like \"Nobody\" and \"Comfort\"). By turns deeply sad and uplifting, the threads binding these characters were fascinating.Fans of literary fiction and those interested in Africa, female relationships, race relations and other dynamics will find a memorable, lyrical story in THE CIVILIZED WORLD."}, {"review_sentiment": 4.0, "review_text": "This was an easy book to enjoy and I really liked the device of having one story told as different bite-sized snippets. I particularly liked the strong, complex female characters that the story revolves around. It was also nice to read about \"normal\" life in Africa (as experienced by much all over the continent) written in such a strong, admittedly emphatic voice. Waiting for more by Ms. Wyss.."}]}, "authors": ["Susi Wyss"], "isbn": "0805093621", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "The Civilized World: A Novel in Stories", "word_cloud": "best year beautifully write collection tie character little bit mourn do take journey rich african culture experience profound universal sense resonate deep thrum inner vary landscape heart path choose therein collection weave together sprawl story community woman easy sit cast character meet precious brother inspire forgiveness heartbreak reconciliation thing never let use life experience manager health program exquisite write craft memorable debut have live year always struggle appropriate response people ask finish believe do incredible job answer question really want copy person asks time continent author wonderful storyteller ability spin number single narrative leaf sense take time something portrayal interest accurate heartfelt best never fall cliche assumption people often make come next pas wonderful story excellent together make compelling woman work international development woman life intersect interest cast character circulate fascinating setting continent well couple set recommend collection interrelate short gem enjoyable narrative insight complexity woman diverse background culture live intersect carom others maintain focus live character keep larger political issue background deft hand slightest event lift eyebrow flock butterfly child stare carry world meaning also invite universe greater understanding poignant gripping work author see continent unique perspective outsider insider work character stay long close collection interrelate short provide fascinate glimpse african culture simply available tourist business traveler character situation draw exquisite skill everyday live share insight accumulate many year live work pleasure welcome relief usual modern fare crime novel spy thriller supernatural highly recommend read anyone interest complex mysterious continent everything love literary fiction vivid prose read poetry memorable multifaceted character cheer grieve setting alive feel grit teeth language accessible beautiful word linger create world marvelously alive series vignettes many year leap find visit point storied life character come go woman felt true main character one emotionally bond hurt frustrations twin brother someone never click knowing possibly care hardworking tenacious brave woman someone engross bite abashed note know know little read exactly way definitely intrigue peek life unvarnished work describe influenced career manage woman health program live year felt character white author broken little bit jade ultimately someone felt passage page quick really got think difference keep separate bond need love search acceptance grief thing palpable extraneous character mesh well love obsession offbeat african name nobody turn deeply sad uplift thread bind character literary fiction interested female relationship race relation dynamic find memorable lyrical story easy enjoy really like device story tell different snippet particularly like strong complex female character story revolve also nice normal life experience much continent write strong admittedly emphatic voice wait", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "A glorious literary debut set in Africa about five unforgettable women--two of them haunted by a shared tragedy--whose lives intersect in unexpected and sometimes explosive ways\r\n\r\nWhen Adjoa leaves Ghana to find work in the Ivory Coast, she hopes that one day she'll return home to open a beauty parlor. Her dream comes true, though not before she suffers a devastating loss--one that will haunt her for years, and one that also deeply affects Janice, an American aid worker who no longer feels she has a place to call home. But the bustling Precious Brother Salon is not just the \"cleanest, friendliest, and most welcoming in the city.\" It's also where locals catch up on their gossip; where Comfort, an imperious busybody, can complain about her American daughter-in-law, Linda; and where Adjoa can get a fresh start on life--or so she thinks, until Janice moves to Ghana and unexpectedly stumbles upon the salon.\r\n \r\nAt once deeply moving and utterly charming, The Civilized World follows five women as they face meddling mothers-in-law, unfaithful partners, and the lingering aftereffects of racism, only to learn that their cultural differences are outweighed by their common bond as women. With vibrant prose, Susi Wyss explores what it means to need forgiveness--and what it means to forgive.\r\n\r\n“[Wyss] beautifully and effortlessly captures the essence of human connection, demonstrating that despite the cultural and personal differences that separate individuals, we are often related by common threads.” Library Journal", "asin": "B004GHN27Q", "rank": "1255146", "city": "Ghana", "image": "https://images-na.ssl-images-amazon.com/images/I/51wtOSD2xHL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}