{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 427, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Anyone who wants to join the military should read this book. A must read for everyone who thinks war is glorious!"}, {"review_sentiment": 4.0, "review_text": "This book was well written and gave me an insight into the Vietnam war and war in general that I never knew or understood.  Should be read by more people, especially people not familiar with the military."}, {"review_sentiment": 4.0, "review_text": "Can easily relate to complete change in range of emotions from embarking through tour and leaving"}, {"review_sentiment": 5.0, "review_text": "Excellent....."}, {"review_sentiment": 5.0, "review_text": "If you only read one book this is the one!"}, {"review_sentiment": 5.0, "review_text": "A great account of personal experiences in an unfortunate war."}, {"review_sentiment": 4.0, "review_text": "I read this book while I was going through Officer Candidate School during the summer of 1975.  I realize that it is a piece of of very good fiction but it does bring many memories of my time in the USMC.  I decided to read it again, this time on a Kindle.  I found the book to be a solid recollection of many memories, I do not know what was real and what was recreated from others memories."}, {"review_sentiment": 5.0, "review_text": "A blessed definitive book about the mortal sin Vietnam was. Mr Caputo was called. He came. He is among the counted.....but the Dead who and what were they:05/11/15 10:00 AM #5  EDIT  DELETEDavid BrownI ran across this…not quite sure where. Thought it was fitting.Nones of MarchI didn't come tovisit you this year,though I have beenfaithful since the springthat I first learned.No longer fleshyou have becomedeep letters etchedon polished stoneas dark as old blood,as cold as our Clevelandin January.This stone and late winterhave become ourmeeting place,not the boisterous,boundlessness,placelessness ofour sunlit youth.No more lazy afternoonsand celebratory evenings.Now we meet early,before the dawn,the way that soldiers do,cupping their cigarettesagainst the waiting eyes,before the day fillswith all that fills the days.Before birds begintheir morning song,while frost still glistens,I walk the ramp slowlyuntil I find your nameamong the others.Softly I press bare fingersinto those diamond hard letters,hoping my touch will resurrectyour easy laughter;knowing that it won'tno matter how gentle.Though I cannot hear your voiceI mark your presenceas sun rises, or rain falls,or wind blows off the lake.I tell you of the yearjust past, knowing thatsomehow you hear me.'Happy birthday'I say to the stone,and whisper of the phase of lifeon which you and Iare separately embarked.But this yearthere are new obligations.Instead mysterious granite,I will meet youon a Midwest hillside,just as early,just as convinced that,even without a memorial, you will be there in the mist.Me on my way to work,you held fast inwhat lies beyond,me waiting to hear againyour voice.You speakingwithout using words.From a friend,"}, {"review_sentiment": 5.0, "review_text": "I bought this book when it first came out while I was a junior in high school. I made a career out of the military and it went with me all over the world and I still have it.  It's one of my favorite books. Does anyone remember what happened when we left Vietnam? How many thousands were executed? Do we just let evil prevail? This book also reminds me  why I made the military a career."}, {"review_sentiment": 5.0, "review_text": "As a combat veteran it was difficult to read. At the end I found myself feeling tied in a knot. However it encouraged me to return to therapy. I give thanks for how it stirred me to once again seek help in healing the unseen wounds of war."}]}, "authors": ["Philip Caputo"], "isbn": "080504695X", "longitude": 0.0, "periods": ["1900s"], "title": "A Rumor of War", "word_cloud": "anyone want join military everyone think glorious well write give insight general never know understood people especially people familiar military easily complete change range emotion embark tour leave excellent one great account personal experience unfortunate go summer realize piece good fiction bring many memory time decide time find solid recollection many memory know real recreated others memory blessed definitive mortal sin call come count run quite sure to visit year been faithful spring that first longer flesh you become deep letter etched on polished stone dark old blood cold stone late winter have become our meeting place boisterous boundlessness four sunlit lazy afternoon sand celebratory meet early dawn way soldier cup cigarettes against wait eye day fills with fill bird begin their morning song frost still glisten walk ramp slowly until find name among press bare fingers into diamond hard letter hop touch resurrect your easy laughter know matter hear voice i mark presence sun rise rain fall wind blow year just past knowing that somehow hear say stone whisper phase life on separately year there new mysterious granite meet you on hillside early convince even memorial way work hold fast in what lie wait hear again your speaking without use friend buy first come junior high school make career military go world still favorite do anyone happen leave many thousand execute also remind make military career combat veteran difficult end find feel tie knot however encourage return therapy give thanks stir seek help heal unseen wound", "genres": ["Memoir"], "summary": "The classic Vietnam memoir, as relevant today as it was almost thirty years ago.\r\n\r\nIn March of 1965, Marine Lieutenent Philip J. Caputo landed at Da Nang with the first ground combat unit deployed to Vietnam. Sixteen months later, having served on the line in one of modern history's ugliest wars, he returned home―physically whole but emotionally wasted, his youthful idealism forever gone. \r\n\r\nA Rumor of War is more than one soldier's story. Upon its publication in 1977, it shattered America's indifference to the fate of the men sent to fight in the jungles of Vietnam. In the years since then, it has become not only a basic text on the Vietnam War but also a renowned classic in the literature of wars throughout history and, as Caputo explains, of \"the things men do in war and the things war does to men.\"\r\n\r\n\"A singular and marvelous work.\" New York Times\r\n\r\n“Caputo's troubled, searching meditations on the love and hate of war, on fear, and the ambivalent discord warfare can create in the hearts of decent men, are among the most eloquent I have read in modern literature.” William Styron, New York Review of Books", "asin": "080504695X", "rank": "210115", "city": "Ho Chi Minh City", "image": "https://images-na.ssl-images-amazon.com/images/I/51R3tuXonJL.jpg", "country": "Hanoi", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}