{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 6, "rating": 3.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Antoni overwhelmed the senses with many intimacies of island life and of women's beautiful and exclusive suffering. The fact that some parts of this novel were written by a white person or by a man was hard to believe.  Reading this novel was like dreaming about a past life."}, {"review_sentiment": 4.0, "review_text": "Antoni overwhelmed the senses with many intimacies of island life and of women's beautiful and exclusive suffering. The fact that some parts of this novel were written by a white person or by a man was hard to believe.  Reading this novel was like dreaming about a past life."}, {"review_sentiment": 5.0, "review_text": "Lil Grandsol lives alone in the decaying old house that is all that remains of her family's plantation wealth. Vel is the young woman who has come to replace the long-time house servant. Together, Lil and Vel battle their histories and personal demons in a poignant attempt to survive. Antoni's tale of two West Indian women, one black and one white, from different socio-economic backgrounds is a wonderful example of stepping out of oneself to write. Antoni, a male writer, did this so well that one can only attribute his artistic ability to the unique mastery of mental gender crossing. Rich in West Indian culture, with pages of perfectly rendered dialect, and one in which religion plays heavily, this novel weaves in and out of sexuality alternately confusing and intensifying the narrative.This is a novel about the power of women and connections, and it forcefully evokes the real emotions that go into unexpected and untraditional love. It is amazing that the book has not gotten more attention. Antoni is brilliant, and his book deserves to be a West Indian classic along the order of Jean Rhys' WIDE SARGASSO SEA."}, {"review_sentiment": 1.0, "review_text": "After finally completing \"Blessed,\" I found Antoni's relationship between Lilla and Vel quite contrived.  The beginning was confusing and it seemed as though the only reason why I continued to read  was to find out what happened to Lilla and Vel.  However, I didn't really  care if they overcame the religious and racial boundries set before them,  nor did I care for the characters themselves.  Finishing this book was more  of a mission than a pleasure."}, {"review_sentiment": 5.0, "review_text": "Robert Antoni's _Blessed_is_the_Fruit_ is one of the most lyrically  expressive and ingeniously experimental novels of the last 50 years.  As in  his first novel _Divina_Trace_, Antoni pays particular attention to the  structure of his novel.  _Blessed_ has the structure of a rosary with each  of the three main sections made up of 10 , or a decade, of sections.  This  is a particuarly appropriate image for a novelist whose 2 novels have  focused on the saving and damning power of religion, both formal and folk,  in Caribbean society.  At heart of _Blessed_ is a moving tale of the  crossing of racial and religious boundaries, of the birth of a new, yet  questionable, hope to a confused and struggling culture.  This novel has  been labeled confusing by one reader, but it is no more confusing than life  itself, and this novel is intricately structured to allow the reader to  fully appreciate the plight and joy of the two main characters."}, {"review_sentiment": 1.0, "review_text": "If you don't mind being confused in the beginning only to catch up towards the end, read this book.  The contect of the book was good however the presentation was poor.  The two women do manage to live together dispite their different stations in life."}]}, "authors": ["Robert Antoni"], "isbn": "0805049258", "longitude": 0.0, "periods": ["1900s"], "title": "Blessed Is the Fruit: A Novel", "word_cloud": "overwhelm sens many intimacy island life woman beautiful exclusive suffer fact part write white person man hard believe read dream past life overwhelm sens many intimacy island life woman beautiful exclusive suffer fact part write white person man hard believe read dream past life live alone decay old house remain family plantation wealth young woman house servant battle history personal demon poignant attempt survive tale indian woman black white different background wonderful example step write male writer well attribute artistic ability unique mastery mental gender cross indian culture page perfectly render dialect religion play heavily weave sexuality alternately confuse intensify power woman connection forcefully evoke real emotion go unexpected nontraditional love amaze gotten attention brilliant deserve indian classic order finally complete find relationship quite contrive beginning confuse seem reason continue find happen however really overcame religious racial boundary set care character finish mission pleasure lyrically expressive ingeniously experimental novel last year first pay particular attention structure structure rosary main section make decade section particularly appropriate image novelist novel focus save damn power religion formal folk society heart move tale cross racial religious boundary birth new yet questionable hope confuse struggle culture label confuse confuse life intricately structure allow fully appreciate plight joy main character mind confuse begin catch towards end context good however presentation poor woman manage live together dispute different station life", "genres": ["Fiction & Literature"], "summary": "Lilla is the white mistress of a once grand but now now rotting colonial mansion and Vel, her black servant. The two West Indian women, both 33 years of age, have lived in the same house for 10 years, but it is not until Lilla rescues Vel from a near-fatal abortion attempt, that the two really get to know each other. \r\n\r\nYoung Trinidadian author Robert Antoni weaves a brightly colored tapestry of life in the Caribbeana remarkable tale of family, myth, religionand language.", "asin": "0805049258", "rank": "4533445", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/5138QFYVYFL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}