{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 4, "rating": 3.6, "reviews": [{"review_sentiment": 2.0, "review_text": "big meh. Wanted to like this, but story goes nowhere, and honestly even the artwork is hard to follow."}, {"review_sentiment": 4.0, "review_text": "It's a good story, a bit wonky and loose, but really brings to the world the reality that we're all stuck out here, no matter where you are, no matter what country or who's in charge. And, that's very refreshing to read in literature, art."}, {"review_sentiment": 4.0, "review_text": "This book is my first foray into reading graphic novels. It's an interesting story that gives readers an insightinto the struggles of today's youth in modern day Egypt.My only real criticism is that the text is quite small, and even though I wear glasses for reading, I still also needa magnifying glass to be able to read the text."}, {"review_sentiment": 5.0, "review_text": "A vibrant, fast paced, down to earth graphic novel. An excellent example of the rebirth of Egyptian comic books in the long overdue mature graphic novels. Elshafee is a promising rising star of the genre - if he gets to write and draw in Egypt. The book was banned for the all too familiar excuse of offending public sensibilities. In reality, it was banned because of its critique of Mubarsk's Egypt. A young brilliant Egyptian software developer is pushed into bankruptcy by greedy corporations that grease the palns of corrupt government officials. As the narrative develops into what seems like a traditional thriller, we meet characters and walk in alleys, all connected to metro stops in Cairo - many of which are named after Egyptian political leaderd, including Nasser and Mubarak. The metro stops and events around them reflect not only the stigling corruption and injudtice of the early 2000s in Egypt, but, more importantly, reflect a dangerously rising rage among Egypt's youth, combined with a level of education and technological boom that later on characterized the Facebook and Twitter-led Egyptian revolution.Elshafee's black and white inks, racy dialogue, and rough characterization reveal a new talent worthy of attention in a sadly discouraged genretrying to grow in the Arab world."}]}, "authors": ["Magdy El Shafee"], "isbn": "0805094881", "longitude": 31.243666, "periods": ["2000s", "Recent Releases"], "title": "Metro: A Story of Cairo", "word_cloud": "big meh want go nowhere honestly even hard follow good bit wonky loose really bring world reality stick matter matter country charge refreshing literature art first foray read graphic novel interest give reader struggle today youth modern day real criticism quite small even wear glass read still also need magnify glass able text vibrant fast pace earth graphic excellent example rebirth egyptian comic long overdue mature graphic novel promise rise star genre get write draw ban familiar excuse offend public sensibility reality ban critique young brilliant egyptian software developer push bankruptcy greedy corporation grease plan corrupt government official narrative develops seem traditional thriller meet character walk alley connect metro stop many name egyptian political leader include metro stop event reflect stifle corruption injustice early importantly reflect dangerously rise rage youth combine level education technological boom later characterize egyptian black white ink racy dialogue rough characterization new talent worthy attention sadly discourage gen retrying grow world", "genres": ["Comics & Graphic Novels", "Fiction & Literature"], "summary": "When Shehab, a young software designer, runs afoul of a loan shark, all avenues of escape in Mubarak's corrupt, chaotic Egypt seem to be closed to him. Getting help from the bank is impossible without connections, and Shehab's uncle abroad wants nothing to do with his troubles. A powerful businessman offers assistance, but the next day Shehab sees him being stabbed in an alley―and the man's dying words suggest a conspiracy extending to the upper reaches of the regime.\r\n\r\nAngry and broke, Shehab enlists his friend Mustafa in a bank heist―and falls into a vortex of financial and political corruption. On the run with a case full of money and evidence of murder, the two careen through Cairo's metro system, evading the police and the thugs who are out in force to crush antigovernment protests. The only allies who can help get them out of this mess, the friends realize, are a blind shoe-shine man and a muckraking journalist.\r\n\r\nIn art as pulsing and immediate as Cairo itself, Magdy El Shafee has delivered a prescient portrait of a crumbling society and Egypt's coming eruption. A powerful story of young men with nothing left to lose, Metro sounds the cry for a better, freer future.\r\n\r\n“For proof of the power of comics, look no further than Metro... It is not hard to see why the dictatorship was alarmed by the novel. In a deft black-and-white portrait of Cairo and its neighborhoods, a thriller unfolds along the metro system, giving a powerful insight into why the revolution took place.” Newsweek", "asin": "0805094881", "rank": "652943", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51uAI89sgsL.jpg", "country": "Egypt", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}