{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 46.2017559, "ratings": {"num_ratings": 7, "rating": 3.4, "reviews": [{"review_sentiment": 4.0, "review_text": "April 20, w017Martin KerrA little empathy goes a long wayThe Little HotelBy Christina SteadText, Melbourne 2016 (© Christina Stead 1973) 209 pages, $A12.95Lisa Gorton’s The Hunted Months – introduction to the Text edition of Christina Stead’s likely final book The Little Hotel – more than adequately covers the contents and style of this short novel. Gorton is aware of the lack of environmental substance which has always featured in Stead’s work. Referring to the author’s note taking, the scraps of comments, conversations, ideas: ‘The landscapes went, and most of the weather, along with the ordinary narrative machinery of getting a character out of a room and down some stairs; so did the historic backdrop and the characters; backstories’. And so we have a hotel the Hotel Swiss-Touring. A cheap hotel, not a ‘pension’, overlooking a Swiss Lake leading to the French border where ‘Most of our guests are in bed by eleven, a middle-aged set.’ The story is told by the twenty-six year old owner Swiss German ‘Selda’ Bonnard who is married to Roger a poor would-be playboy Swiss French. They have a young son Oliver. Mme Bonnard carries the confidences of her guests and Italian, French and Swiss staff. It’s a hotel which in season caters for skiers and passing tourists and also puts up artistes and road companies of the local casino and nightclubs. But the motor car and better roads will soon see this ‘reclusive’ home for war-torn and former British empire colonialists, a mad Belgian Mayor, an old Princess, a racist American heiress and others an anachronism. The author takes the attitude and observations of Somerset Maugham, but Mme Bonnard is not always there to observe the detail. Thus we are dropped in and out of meetings and conversations, where the characters’ dialogues (third person) become the main features of the story. The novel runs (awkwardly like Balzac) without chapters and the first break comes at page 31. One wonders how the final pages will end. There is a build-up, but who will be the receiver of good or ill? Mme Bonnard sets the rules and makes her final observations. She’s an hotelier who for her age has matured much and continues on. The guests have their favourite staff and also mix occasionally with each other. The best examples come at outings to the local restaurants, followed by visit to nightclubs. Some guests want to impress, others sneer. They are suspicious of the English whose pound has plummeted and who lack style. Mr Wilkins a former rubber marketeer in Malaya and now sometime currency speculator is suspect. His ‘cousin’ the rich Eurasian Mrs Trollope gains some sympathy. ‘Mrs Trollope told me everything and I soon understood; yet you are always astonished at how people can muddle their lives.’ One of these outings involves the Blaises (a strange doctor and wife couple), the Palinosts and the Princess with her singing dog. It goes on for over fifteen per cent of novel. Mr Wilkins is paying (or rather his undeclared de facto). Virginia Woolf could scarcely do better. Stead has the measure of subtlety, observation and dialogue to breathe life into this amazing soirée. Serve the appropriate wines, food and have the guests talk about their estranged children and say outrageous things, the party takes on its own direction. All this in a part of Europe not altogether safe from the Russians, as the Cold War reaches a crescendo. This is a brief novel of Stead’s long time observations of people and events from several countries. She’s done an artful job in bringing us something entirely different from her usual lengthy opus.Martin Kerr has written seven novels and two volumes of short stories. His books, including New Guinea Patrol first published as a hardback in 1973, are available on Kindle or through his website."}, {"review_sentiment": 2.0, "review_text": "It is quirky but not good enough to recommend."}, {"review_sentiment": 2.0, "review_text": "I expected more.  I know, I'm a Hun.  But throughout my reading of the book, I had the impression it was a poor translation from German into English.  Excellent premise, a small hotel, post war Europe, refugees, but for me, there are better portrayals out there."}, {"review_sentiment": 3.0, "review_text": "3.5 starsThe Little Hotel is the tenth novel published by Australian author, Christina Stead. This edition is published under the Text Classics banner and sports a gorgeous colourful cover by the talented W H Chong, as well as an introduction by poet and author, Lisa Gorton. While it was not published until 1973, Stead began writing it, or some version of it, in the early 1950s, based on her diaries of her time in Europe with her partner, communist sympathiser, William Blake, in the fifties.Mme Selda Bonnard runs Hotel Swiss-Touring with her husband, Roger and their multi-cultural staff. Their guests are equally diverse, and Selda’s observations about them and of their interactions form the bulk of this novel. It’s just a few years after the end of World War Two, and Swiss-Touring is a cheap lake-shore hotel that caters to tourists as well as longer-term residents.Against a backdrop of paranoia about the possible Russian invasion and the difficulties of retrieving funds from their native lands, the hotel’s guests, past and present, are described in potted histories and anecdotes; their petty crises and domestic dramas are filled with snobbery, racism, jealousy and insecurity. Many of the guests are eccentric; one turns out to be crazy; others may even be dangerous.Stead evokes post-war Europe with consummate ease, firmly establishing the era with both her characters’ ideas, opinions and dilemmas, and the political and financial situation. This neat little volume will appeal to readers who enjoy historical fiction with a good dose of satire. Classic fiction from an award-winning Australian author."}, {"review_sentiment": 4.0, "review_text": "A strange one. Set in lausanne in a small pension style hotel, with an eclectic assortment of permanent or coming-going-coming residents from a variety of European backgrounds.Nothing really happens. They whinge about each other, reveal themselves, their prejudices, racisms, absurdities as they eat the horrible meals, interact with the hotel staff, or stroll around the lake.I read one academic feminist analysis which sees Stead as having created synedoches, wherin each character represents a social, economic, financial, political position of post-WW2 Europe, and noone was very nice. There was no Eleanor Roosevelt trying to intelligently steer a United Nations through! I don't know about all this. I don't think I have the patience to unravel its greater meanings, if there are any. Maybe it was a product of its times in that sense.Stead was a Marxist and she had also lived in Europe and elsewhere following men who didn't really appreciate her and took her for granted, like the only really sympathetic character, Mrs Trollope.I did really enjoy the wry and ironic tone, which reminded me in places of Trollope's masterpiece - the Barchester Chronicles - though no-one approached the odiousness of Obadiah Slope! Is that why Mrs Trollope was named thus? There were flashes of Jane Austenesque social satire as well. There is a series of grotesques who are very funny. So, synedoches aside, I enjoyed it."}, {"review_sentiment": 4.0, "review_text": "The book starts off a bit slow but the last half is wickedly funny.  Always perceptive, Christina Stead brings the bizarre life of a little hotel to the reader in a way that is impossible not to recognize if you have ever been there.  The restaurant scene in Chapter 5 is a tour de force only matched by the incredible chapter in The House of All Nations where the two couples have dinner.  I am going to read every one of her books."}, {"review_sentiment": 5.0, "review_text": "Though London’s Times Literary Supplement has placed Christina Stead in the company of Tolstoy, Dostoevsky, Ibsen, and Joyce, she still remains unknown to most readers in the United States, despite her deliciously twisted sense of humor, her pointed social satire, and her vividly depicted characters.  In this novel, set in a small hotel on Lake Geneva in the immediate aftermath of World War II, Stead introduces an assortment of bizarre guests currently living at the small Hotel Swiss-Touring. Though most of them are accustomed to more elegant accommodations, the twenty-six-year-old hotelkeeper, Selda Bonnard, and her slightly older husband Roger do their best to meet their guests’ needs.In this first person narrative, told by Selda Bonnard, the various guests at the hotel come alive for the reader.  One, who claims to be the Mayor of B in Belgium, appears to be certifiable, creating numbered documents about his stay in the hotel and traveling to “the clinic” daily for “injections” and shock treatments.  Mrs. Blaise, whose husband comes to visit every other weekend from Basel, claims to have millions of dollars and packets of jewels safely stowed in New York banks.  Mrs. Trollope, a dark woman from “the East,” lives with her “cousin,” Robert Wilkins, who is constantly following the exchange rates and suggesting that his “cousin” move her accounts out of England closer to him.  A strange English woman named Miss Abbey-Chillard, who appears to have almost no money, also appears to have serious health issues and demands special foods.These five permanent guests form the core of the novel, and as they reveal themselves through their conversations and interactions, they begin to resemble characters in a dramatic comedy of manners.  The hotel employees resent them and their frequently high-handed demands, and an undercurrent of cruelty by the employees toward the guests emerges.  The Mayor of B provides unintentional comic relief throughout, and when he begins to imitate the strip tease dancer who lives upstairs, his deep-seated problems become public.  Gradually, through the characters’ conversations, the reader learns the nature of the relationships among all the other characters, with most of the action eventually focused on the relationship of Mrs. Trollope and her “cousin,” Robert Wilkins.All of Stead’s characters are flawed, and since all are shown in intimate scenes in which they reveal themselves, at least to the reader, they inspire a kind of empathy – and even a pervading sadness – which does not often happen within social satire, which is usually characterized by sterotypes.  Even Mme. Bonnard, the hotel keeper, has her problems, and though she is the main unifying character, her inflexibility regarding aspects of the hotel management make her less than sympathetic, at some points.  The novel as a whole is elegant and consummately literary, building an intense, darkly humorous, and sometimes claustrophobic atmosphere as the characters try to live their straitened lives and survive to live another day in a changed world.  Christina Stead, a superb novelist who can easily hold her own with contemporaries Beryl Bainbridge, Fay Weldon, Penelope Lively, and Muriel Spark in England, and Thea Astley and Elizabeth Jolley in Australia, deserves much more recognition in the US."}]}, "authors": ["Christina Stead"], "isbn": "0805024123", "longitude": 6.1466014, "periods": ["1900s"], "title": "The Little Hotel: A Novel", "word_cloud": "empathy go long way the page introduction edition likely final adequately cover content style short aware lack environmental substance always feature work refer author note take scrap comment conversation ideas landscape go weather along ordinary narrative machinery get character room stairs historic backdrop character backstories hotel cheap hotel pension overlook swiss lead french border most guest bed eleven story tell year old owner swiss marry poor playboy young son carry confidence guest italian french swiss staff hotel season caters skier pass tourist also put artiste road company local casino nightclub motor car better road soon see reclusive home former british empire colonialist mad belgian old racist heiress others anachronism author take attitude observation always observe detail drop meeting conversation character dialogue third person become main feature story run awkwardly chapter first come wonder final page end receiver good ill set rule make final observation hotelier age mature much continue guest favorite staff also mix occasionally best example come outing local restaurant follow visit guest want impress others sneer suspicious pound plummet lack style former rubber marketeer sometime currency speculator cousin rich gain sympathy tell everything soon understand yet always astonish people muddle outing involve braises strange doctor wife couple sing dog go fifteen cent pay rather undeclared scarcely better stead measure subtlety observation dialogue breathe life amaze soiree appropriate wine food guest talk estranged child say outrageous thing party take direction part altogether safe reach crescendo brief long time observation people event several country do artful job bring something entirely different usual lengthy write novel volume short story include first publish hardback available website quirky good enough recommend expect know hun read impression poor translation small hotel post war refugees better portrayal stars the tenth publish australian author edition publish banner sport gorgeous colorful cover talented well introduction poet author publish begin write version early base diary time partner communist sympathizer run husband staff guest equally diverse observation interaction form year end cheap hotel caters tourist well paranoia possible russian invasion difficulty retrieve fund native land hotel guest past present described potted history anecdotes petty crisis domestic drama fill snobbery racism jealousy insecurity many guest eccentric turn crazy others even consummate ease firmly establish era character ideas opinion political financial situation neat volume appeal reader enjoy historical fiction good dose satire fiction author strange susanne small pension style hotel eclectic assortment permanent resident variety really happen whinge reveal prejudice racism absurdity eat horrible meal interact hotel staff stroll academic feminist analysis see create synedoches wherein character represent social economic financial political position noon nice try intelligently steer know think patience unravel greater meaning maybe product time also live elsewhere follow men really appreciate take grant really sympathetic character really wry ironic tone remind place masterpiece approached odiousness be name thus flash social satire well series grotesque funny so synedoches enjoy start bit slow last half wickedly funny perceptive bring bizarre life hotel way impossible recognize ever restaurant scene tour force match incredible chapter couple dinner go place company still remain unknown reader deliciously twist sense humor point social satire vividly depict character set small hotel immediate aftermath introduces assortment bizarre guest currently live small accustom elegant accommodation hotel keeper slightly older husband best meet guest first person narrative tell various guest hotel come alive claim appear certifiable create numbered document stay hotel travel clinic daily injection shock treatment husband come visit weekend claim million dollar packet jewel safely stow bank dark woman live cousin constantly follow exchange rate suggest cousin move account closer strange woman name appear almost money also appear serious health issue demand special permanent guest form core reveal conversation interaction begin resemble character dramatic comedy manner hotel employee resent frequently demand undercurrent cruelty employee guest emerge provide unintentional comic relief begin imitate strip tease dancer live upstairs problem become public character conversation learn nature relationship character action eventually focus relationship cousin character flaw show intimate scene reveal least inspire kind empathy even pervade sadness often social satire usually characterize stereotype even hotel keeper problem main unifying character inflexibility regard aspect hotel management make le sympathetic point whole elegant consummately literary building intense darkly humorous sometimes claustrophobic atmosphere character try live straiten life survive live day change world superb novelist easily contemporary deserve much recognition", "genres": ["Fiction & Literature", "WWII"], "summary": "At the Hotel Swiss-Touring, both the guests and the staff get tangled in intrigues and veiled confessions\r\n\r\n“If you knew what happens in the hotel every day!” Madame Bonnard, the eccentric and inquisitive owner of the Hotel Swiss-Touring—a third-rate Swiss hotel—knows her guests’ many secrets, things they wouldn’t tell their friends, family, or lawyers. They come from all over Europe in the wake of World War II, seeking refuge from their countries or their own bruised hearts. Madame Bonnard reigns over “Mayor of B” from Belgium, two guests posing as cousins, a doctor’s wife who is certain her husband is trying to slowly poison her, and Clara, a power-hungry staff member. \r\n\r\nBased on Stead’s experiences living in European hotels, The Little Hotel is a captivating portrait of what happens when strangers—and their desires, lies, and fears—live in close quarters.\r\n\r\n“While the fiction of James Joyce or D. H. Lawrence tended to become all the more deeply steeped in their Irishness or Englishness the farther from home they went, Stead used her mimic’s ability to immerse herself in whatever place she happened to be.” The New York Times", "asin": "0805024123", "rank": "3701253", "city": "Geneva", "image": "https://images-na.ssl-images-amazon.com/images/I/51BI51NjwFL.jpg", "country": "Switzerland", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}