{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 54, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Gorgeously done. Loved it. Very useful for research but also highly readable"}, {"review_sentiment": 4.0, "review_text": "\"The Historical Atlas of New York City\" by Eric Homberger is a well-written and well-illustrated history of the changes to Manhattan over the centuries.  This book focus almost exclusively on Manhattan, so if you are looking for information on the history of the other four boroughs, this is not the book for you--the title is a complete lie.  The maps and stories of the history of Manhattan in this book are interesting and describe events that are not well known.  Overall, this is a good book on Manhattan's history."}, {"review_sentiment": 5.0, "review_text": "A fun historical compilation.  As a native Brooklyn \"ite\" or whatever, interesting resource."}, {"review_sentiment": 4.0, "review_text": "satisfied"}, {"review_sentiment": 5.0, "review_text": "Good."}, {"review_sentiment": 5.0, "review_text": "After spending a long weekend in NYC (our hotel was 1 block from the Flatiron Building) I wanted a good history book for the city.  Came across this one by price and reviews.It has a TON of info going back to the original Western settlements, and showing how the city was torn down and re-drawn over and over again as it was built up.  A few of the \"major avenues\" go back hundreds of years, but the maps we know today really didn't get set till the 1780's.Very much liked the book."}, {"review_sentiment": 5.0, "review_text": "Good product, fast delivery."}, {"review_sentiment": 5.0, "review_text": "Tons of well thought out information and themes."}, {"review_sentiment": 5.0, "review_text": "Perfect. Fast shipping great price"}, {"review_sentiment": 5.0, "review_text": "very good quality. purchased for a christmas present. I'm pretty sure my family member will like it a lot. I look it inside and have very good material and photos. recommended!"}]}, "authors": ["Eric Homberger"], "isbn": "0805078428", "longitude": 0.0, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s"], "title": "The Historical Atlas of New York City: A Visual Celebration of 400 Years of New York City's History", "word_cloud": "gorgeously do love very useful research also highly readable change centuries focus almost exclusively look information borough title complete lie map story interesting describe event well know good fun compilation native tie interesting resource satisfied good spending long weekend hotel block want good city price info go back original western settlement show city tear build major avenue go back hundred map know today really set till much like good product fast delivery ton well think information theme shipping great price good quality purchase christmas present pretty sure family member lot look inside good material photo recommend", "genres": ["Art & Architecture", "History", "Social & Cultural Studies"], "summary": "The rich and eminently browsable visual guide to the history of New York, in an all-new \r\nsecond edition\r\n\r\nThe Historical Atlas of New York City, second edition, takes us, neighborhood by neighborhood, through four hundred years of Gotham's rich past, describing such crucial events as the city's initial settlement of 270 people in thirty log houses; John Jacob Astor's meteoric rise from humble fur trader to the richest, most powerful man in the city; and the fascinating ethnic mixture that is modern Queens. The full-color maps, charts, photographs, drawings, and mini-essays of this encyclopedic volume also trace the historical development and cultural relevance of such iconic New York thoroughfares as Fifth Avenue, Wall Street, Park Avenue, and Broadway. This thoroughly updated edition brings the Atlas up to the present, including three all-new two-page spreads on Rudolph Giuliani's New York, the revival of Forty-second Street, and the rebuilding of Ground Zero.\r\n\r\nA fascinating chronicle of the life of a metropolis, the handsome second edition of The Historical Atlas of New York City provides a vivid and unique perspective on the nation's cultural c", "asin": "0805078428", "rank": "358627", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51SiZEYbifL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}