{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 5, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "The word \"journal\" is part of this book's title, and it doesn't pretend to be anything else. After all, Paul Hoffman is a journalist. I've had the great good fortune to visit the Eternal City a few times, and reading Seasons is like taking another stroll along back streets and famous venues.  It brought back happy memories and also reminders that Rome is a huge, noisy metropolis that is difficult to traverse. Hoffman also highlights that fact that Rome is populated by, well, Romans, as well as millions of other Italians, and conveys a sense of what it is like to live an ordinary life in an extraordinary place. The city described by this author is modern and genuine, and Hoffman's essays are devoid of the self-congratulatory tone of many other travel writers. This book is real."}, {"review_sentiment": 5.0, "review_text": "As usual, before a trip to other country, I searched for a book that would give me a feel for the cities I visit, rather than a tour guide.  This book excelled in this task and made my visit to Rome even fuller and more enjoyable.  If you are looking for a book about Rome, its people, their habbits and a little glimpse into their rich history, this book is a rare find.  The pace is calm, the subjects are simple, but the experience is great."}, {"review_sentiment": 5.0, "review_text": "This is old-school journalism at its best.  Hofmann takes the year as it comes, and, journal style, writes a few sketches every month.  Having lived in Rome for thirty years, he knows a lot about it, and he draws on his wealth of information, memory, impressions, and connections to give vivid pictures of the holidays that roll around or reflections prompted by chance events. His range is delightful -- from the pope to Vespa-riding robbers, from diplomats to gypsies, from horse shows to opera, from the mafia to the gattare [stray cat feeders]. If he needs statistics, he knows how to get them and unobtrusively adds them. He is not coy about using addresses, so I read with a map.  I knew little about Rome when I began this book, but by the end I felt I knew where things were, what the flavor of the city is.  It's not a travel guide, it's deep background for a visit."}, {"review_sentiment": 4.0, "review_text": "Paul Hofmann writes about his hometown the way any native would, with equal parts admiration and frustration. Sure, he describes the great trattorie, touches on the sordid histories of Rome's luxury hotels, and is continually mesmerized by the city's ancient ruins. But, anecdotes about such topics as the irregularity of the postman's visits, motorino pollution, municipal strikes, and lousy restaurant service, make the book come alive. Thank god this isn't another tired, old, tourist piece about how great it is to live abroad (\"A Year in Provence,\" anyone?) Hofmann's grouping of chapters by month is also innovative and helpful to travelers who want to know what goes on in the city the REST of the year. The book tends to be a bit dull in some places, owing probably to the fact that Hofmann wrote this book in his 70s or 80s. He knows little about hip, modern Rome. Nevertheless, his \"diary\" makes for a good read and a good history lesson."}, {"review_sentiment": 3.0, "review_text": "The author prefaces his diary of day-to-day life in Rome with the comment that some of his journalist friends wished that they lived in Rome.  It struck me that his object then was to show that Rome was really just a  dull, hodunk kind of town, not really worth pining for, and that the  romantic perceptions of the tourist were all in their heads. (which is  probably true)So perhaps for this it is useful for those of us  tourists who thought it would be nice to live in Rome.  This book seems to  say we are just as well off staying in whatever dull place we already  inhabit.The selections from the reviews overstate his writing.  The  writing most often reminded me of the musings of a columnist in some small  town paper (it's definitely journalistic prose).  His ability to express  complexities seems limited.  Lots of exclamation points in the first half  of the book! (He tends to be bemused by certain aspects of life in Rome,  but often resorts to expressing this bemusement with exclamation points.)  At worst it struck me as pedestrian and irritatingly banal (but perhaps  this is because he chose to write of the banal aspects of life in Rome).The book is generally very topical, that is, current as of the late  '90s. Some recurring content are reports on the pope's health and the days  of Mussolini.  The latter I found interesting, the former I did not. He  also discusses the Etruscans here and there in a way that is insightful and  knowledgeable.On the whole, the book has a nice, low-key, meandering  style, which I found readable and pleasant enough to finish.  However, I  don't think the author put a great deal of effort or thought into its  content and design--it just follows the calendar year, like a diary.I  compare Hoffman's travel writing to that of Mathew Spender's Within  Tuscany, which is lighter, richer, with more content, and which shows a  remarkable facility with English that Hoffman's prose lacks."}]}, "authors": ["Paul Hofmann"], "isbn": "0805055975", "longitude": 12.4829321, "periods": ["1900s"], "title": "The Seasons of Rome: A Journal", "word_cloud": "word part title pretend anything else journalist great good fortune time read take stroll along back streets famous venue bring happy memory also reminders huge noisy metropolis difficult traverse also highlight fact populate well well million convey sense live ordinary life extraordinary place city describe author modern genuine essay tone many travel writer real usual trip country search feel city visit rather tour guide excel task make visit even fuller enjoyable look people habit little glimpse rich history rare find pace calm subject simple experience great journalism best take year come style write sketch month have live thirty year know lot draw wealth information memory impression connection give vivid picture holiday roll reflection prompt chance event range delightful pope robber diplomats gypsy horse show mafia gattare stray cat feeder need statistic know get unobtrusively add coy use address map know little begin end felt know thing flavor city travel guide deep background visit write hometown way native equal part admiration frustration describe great trattorie touch sordid history luxury hotel continually mesmerize city ancient ruin anecdotes topic irregularity postman visit motoring pollution municipal strike lousy restaurant service make come alive god tire old tourist piece great live abroad year anyone group chapter month also innovative helpful traveler want know go city year tends bite dull place owe probably fact write know little hip modern diary make good good history lesson author preface diary life comment journalist friend wish live strike object show really dull podunk kind town really worth pin romantic perception tourist head probably true so perhaps useful tourist think live seem say well stay dull place already selections review write writing often remind musing columnist small town paper definitely journalistic ability express complexity seem limited exclamation point first half tend bemused certain aspect life often resort express bemusement exclamation point worst struck pedestrian irritatingly banal perhaps chose write banal aspect life generally topical current late recur content report pope health day latter find interest former also discuss way insightful whole nice meander style find readable pleasant enough finish however think author put great deal effort think content design follow calendar year compare travel write lighter richer content show remarkable facility prose lack", "genres": ["Memoir", "Travel Writing"], "summary": "Delving into the daily life of a city that is in so many ways larger than life, Paul Hofmann steers us beyond the tourist board, revealing a fetish for Vatican gossip, the idiosyncrasies of the gattare (cat women who care for the city's stray cats), and the vagaries of the ever-volatile Roman government.\r\n\r\nAs he winds through Rome's ancient streets, we listen with him to the voices of the city, past and present, and we discover with him the intricacies and the beauty of Italy's finest city.", "asin": "0805055975", "rank": "1631058", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/41A6AXAWJZL.jpg", "country": "Italy", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}