{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 39.7391536, "ratings": {"num_ratings": 105, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "The Meadow was an unexpected jewel. A collection of perspectives ranging from beautiful prose to journal entries, it traverses the lives of some of the last US pioneers and their descendants in the high country of Wyoming/Colorado. Realistic dialogue, at times eliciting hearty laughs, it is not without its balance of pensiveness and tears."}, {"review_sentiment": 5.0, "review_text": "One of the best books I've ever read!  I'm recommending it to my American history book club!"}, {"review_sentiment": 5.0, "review_text": "A literary, lyrical human history of a meadow on the Colorado / Wyoming border, this semi-biographical story is gorgeous in every respect. One of my favorite books of all time it perfectly captures a sense of place and the personalities of the people who have lived there. Sweet and sad at turns it keeps me locked in from the first page to the last every time I read it."}, {"review_sentiment": 5.0, "review_text": "In his book “The Meadow”, James Galvin simultaneously creates his own world and describes the world around him. Part novel, part documentary-styled telling, the beautiful prose contained in this book invites us into the reality of what it is to live in the rural West, not some romanticized version of it. Through what can be described as both stream of consciousness and reading its history like looking through a photo album, Galvin tells the tale of a parcel of land and the many people who have experienced it firsthand, the many people who have contributed to it’s richness and whose lives have been enriched by it. For those who have been raised in rural areas, this book will hit home. For those less familiar, like myself, it will be an eye opener into what it’s actually like to live in the real West. A tale about man’s relationship with his environment, we get to see everything the rural life has to offer - from the beautiful countryside to the difficult winters, from the struggles the characters face every day to, ultimately, the people they are shaped into by these circumstances, “The Meadow” gives us an intimate insight into these experiences. One could say Lyle is the main character, as we read and come to know about this self-sufficient man and his neighbors, their humourous, yet sometimes lonesome and poignant experiences. Yet, these people are only the lenses through which we come to know the story. The real protagonist is in the title of the book: the meadow, the environment in which these men live, their relationship with it and, ultimately, how even though they inhabited the land, they did not possess it but were, instead, possessed by it. A beautifully written work, “The Meadow” will more than satisfy anyone who’s lived similar experiences or wishes to know more intimately about what it’s really like to live in the country."}, {"review_sentiment": 5.0, "review_text": "I've never finished a book just to go back to page 1 and re-read it right away, but that's exactly what I'm about to do. Beautiful book!"}, {"review_sentiment": 5.0, "review_text": "The Meadow is a great little book about some of the settlers of the Wyoming/ Colorado border are. It's a great book interested in history or settlers of that era."}, {"review_sentiment": 4.0, "review_text": "As a Wyoming native, Galvin's flowing narrative transported me to our windy plains,beautiful country, and harsh winters we experience. He very aptly depictedhis characters through their daily life and how their struggles shaped who they were."}, {"review_sentiment": 5.0, "review_text": "One of the great books about the American West. Everyone I've given a copy to has loved it. Low-key, subtle story telling that will completely suck you in."}, {"review_sentiment": 3.0, "review_text": "it brought back a lot of memories of growing up on a farm. Both good and bad memories."}, {"review_sentiment": 5.0, "review_text": "Spectacular. Somewhere between poetry and prose. The images linger."}]}, "authors": ["James Galvin"], "isbn": "0805027033", "longitude": -104.9847034, "periods": ["2000s", "Recent Releases"], "title": "The Meadow", "word_cloud": "unexpected jewel collection perspectives range beautiful prose journal entry traverse life last pioneer descendant high country dialogue time elicit hearty laugh balance pensiveness tear best ever recommend american history club literary lyrical human history border story gorgeous respect favorite time perfectly capture sense place personality people live sad turn keep lock first page last time simultaneously create world describes world part tell beautiful prose contain invite reality live rural romanticize version describe stream consciousness read history look photo album tell tale parcel land many people experience firsthand many people contribute richness life enrich raise rural area hit home le familiar eye opener actually live real tale man relationship environment everything rural life offer beautiful countryside difficult winter struggle character face day ultimately people shape circumstance give insight experience main character come know man neighbor humorous yet sometimes lonesome poignant experience yet people lenses come know story real protagonist title environment men live relationship ultimately even inhabited land posse instead possess beautifully write work satisfy anyone live similar experience wish know intimately really live country never finish back page right away exactly beautiful great little settler border great interested history settler era native flow narrative transport windy plain beautiful country harsh winter experience aptly depicted his character daily life struggle shape great american everyone give copy love subtle story tell completely suck bring lot memory grow farm good bad memory poetry prose image linger", "genres": ["Memoir", "Essay", "Science & Nature"], "summary": "In discrete disclosures joined with the intricacy of a spider's web, James Galvin depicts the hundred-year history of a meadow in the arid mountains of the Colorado/Wyoming border. \r\n\r\nGalvin describes the seasons, the weather, the wildlife, and the few people who do not possess but are themselves possessed by this terrain. In so doing he reveals an experience that is part of our heritage and mythology. \r\n\r\nFor Lyle, Ray, Clara, and App, the struggle to survive on an independent family ranch is a series of blameless failures and un-acclaimed successes that illuminate the Western character. The Meadow evokes a sense of place that can be achieved only by someone who knows it intimately.", "asin": "0805027033", "rank": "93104", "city": "Denver", "image": "https://images-na.ssl-images-amazon.com/images/I/41uwyXICaiL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}