{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 106, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "this man is sointeresting and this book is a good one"}, {"review_sentiment": 5.0, "review_text": "Lots of detail describing a life fully lived and then some!"}, {"review_sentiment": 5.0, "review_text": "package arrived safe and sound, thanks"}, {"review_sentiment": 5.0, "review_text": "Great read.  Very interesting..."}, {"review_sentiment": 4.0, "review_text": "Ever take a college course because it sounded so interesting and wild in the syllabus and when the time comes to start the actual class you immediately have buyer's remorse?Everyone loves Bob Marley.  And surely a 500-page book on Marley is going to be nothing but an amazing experience to learn every nook and cranny related to his life.  But you realize the author must've done so much research and had no many notes and interviews and tidbits and facts that he just figured he'd cram them into the book and no one would notice that Bob Marley wouldn't really appear until about page 100 and die a little past page 300.The rest is dense and plodding and felt like homework to get through all the aspects of religion and politics and the economy and... (you get the point, I think)The book is fascinating and you can't help but learn a lot about Bob Marley (who knew he lived in the United States and had a series of menial jobs before making it big?!) but I think the Marley doc from 2012 does just as good a job at a fraction of the time.\"Faith in Jah got Marley in touch with his conscience, and faith in himself set him on a course so unlikely and so edifying that no soul around the main remained unmoved by the dimensions and lessons of Bob's self-realization.\""}, {"review_sentiment": 5.0, "review_text": "Talk about surpassing my expectations! I went into this thinking Bob Marley's life would be covered from birth to death. But, it is so much more than that. I really enjoyed learning about his family and other things going on in Jamaica at the time. It was fascinating to learn where Marley came from, how he grew up, and how he ascended to fame. Amazing where he ended up compared to where he started.The author went somewhat into death, at the beginning, and at the end. It would have been helpful if it was all in one place. By the end of the book, I had forgotten most of the original details about Marley's death.I do think some things distracted the reader from the main story. Everything ties in, but pages about kings in Africa can distract and then the reader forgets where the original story started. Also, there is SO much detail included. Sometimes it seemed like details were included just to include them, like the street name of some random character that isn't part of the story. These don't take away from the story but could have been without.All-in-all, I would definitely recommend this book to anyone that wants to learn the story behind Marley and his family."}, {"review_sentiment": 5.0, "review_text": "I haven't read it, but my husband really likes it."}, {"review_sentiment": 4.0, "review_text": "In my opinion,  the author took too many liberties in his writing as a cultural outsider which caused him to misinterprete things, however, this book did help me understand Ras Tafari. I gave it four stars because it is interesting."}, {"review_sentiment": 5.0, "review_text": "I  love  it .Great"}, {"review_sentiment": 4.0, "review_text": "Not an easy read, but well worth the reading"}]}, "authors": ["Timothy White"], "isbn": "0805080864", "longitude": 0.0, "periods": ["1900s"], "title": "Catch a Fire: The Life of Bob Marley", "word_cloud": "man so interesting good detail describe fully live package arrive safe sound thanks great very interesting ever take college course sound interesting wild syllabus time come start actual class immediately buyer remorse love surely go nothing amazing experience learn nook cranny related author do much research many note interview tidbit fact figure cram really page die little past page rest dense plod felt homework get aspects religion politics economy get point think fascinating lot know live series menial job make big think doc good job fraction time get touch conscience faith set course unlikely edify soul around main remain unmoved dimension lesson talk surpass expectation go think birth death much really enjoy learn family thing go time fascinate learn come grow ascended fame end compare author go somewhat death begin end place end forget original detail think thing distract main story tie page king distract forgets original story start also so much detail include sometimes seem detail include include street name random character part story story definitely anyone want learn story family husband really like opinion author take many liberty write cultural outsider cause misinterpret thing however help give star interest love not easy well worth read", "genres": ["Biography", "Music"], "summary": "The classic biography of reggae legend Bob Marley, updated and revised for the twenty-fifth anniversary of his death.\r\n\r\nBob Marley left an indelible mark on modern music, both as a reggae pioneer and as an enduring cultural icon. Catch a Fire, now a classic of rock biography, delves into the life of the leader of a musical, spiritual, and political explosion that continues today.\r\n\r\nUnder the supervision of the author's widow and with the collaboration of a Marley expert, this fourth edition contains a wealth of new material on the Jamaican singer, songwriter and musician , including many revisions made by the author before his untimely death. An appendix to the new edition chronicles Marley's legacy in recent years, as well as the ongoing controversy over the possibility that Marley's remains might be exhumed from Nine Mile, Jamaica, and reburied in Addis Ababa, Ethiopia, where hundreds of Rastafarians live. The new edition also contains an expanded discography and is factually updated throughout.\r\n\r\n\"Probably the finest biography ever written about a popular musician.\" ―San Francisco Chronicle", "asin": "0805080864", "rank": "159524", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/41NwYJMfKTL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}