{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 207, "rating": 4.2, "reviews": [{"review_sentiment": 1.0, "review_text": "A good history lesson and how unexpected the attack was. Poor training on the radar equipment.  How everyone did not believe that bombing was happening."}, {"review_sentiment": 5.0, "review_text": "An excellent description of the Pearl Harbor attack.  Very easy to read and comprehend."}, {"review_sentiment": 4.0, "review_text": "A classic."}, {"review_sentiment": 4.0, "review_text": "Good individual short stories"}, {"review_sentiment": 5.0, "review_text": "This was the most thought provoking book about the Pearl Harbor Attack I've read. Detail was extremely well written.I would recommend this book to anyone interested in the \"Beginning of the United States entry into the war\"."}, {"review_sentiment": 4.0, "review_text": "This was a great read. There are things written here that you will not find in other books. The final quarter of the book is mostly acknowledgments and index."}, {"review_sentiment": 5.0, "review_text": "Great job of placing in context individual experiences. Informal but informative. Would recommend for anyone interested in World War II"}, {"review_sentiment": 5.0, "review_text": "Day of InfamyWalter Lord wrote several works of popular history. His “A Night to Remember” about the sinking of the ‘Titanic’ passenger ship was adapted to a movie. This 1957 book has a ‘Contents’ for its 12 chapters, ‘Facts About the Attack’, ‘Acknowledgments’, ‘List of Contributors’, and ‘Index’. Chapter I tells about the activities on Saturday night. The Japanese knew they had no hope of winning a war with America unless the US fleet in Hawaii was destroyed (Chapter II). They began their plans; they had to modify their torpedoes to work in shallow water. The carrier radio operators were changed to other ships so they would not be missed. [Did oscilloscopes detect this?] The attack fleet kept radio silence. In the early morning a strange submarine was seen (Chapter III).The carrier airplanes were readied for the attack (Chapter IV). An unknown submarine in the harbor was attacked. The Army radar station detected a huge flight of airplanes (Chapter V). People on the ground saw the many airplanes (Chapter VI). It was a regular Sunday morning for the Navy. Then they saw airplanes with a red ball showing. They were dropping bombs (Chapter VII). People thought it was a drill at first. Then the alarms went out. Sailors began to shoot back (Chapter VIII). There was no water pressure for the fire hoses. Some men were trapped below the water line! Many of the ships had inoperable guns or no ammunition. The sailors used what was available to shoot at the enemy attackers (Chapter IX). Some shot at US airplanes. The rush to Pearl Harbor created a traffic jam. Most of the explosions in Honolulu were caused by anti-aircraft shells. The attack ended at 10 AM (Chapter X). There were rumors of Japanese soldiers invading and parachutists landing, and other stories.After the attack a telegram from Washington warned General Short and Admiral Kimmel of an ultimatum from the Japanese to be delivered at 7:30 AM Honolulu time. The Japanese airplanes returned to their carriers, the ships returned to Japan. In Pearl Harbor many worked to rearm the ships and prepare for another attack (Chapter XI). There were attempts to rescue men trapped in ships. The Governor proclaimed martial law in preparation for the expected invasion. Civilians volunteered their services. Rumors continued about Japanese invaders (Chapter XII). [Don’t these reflect people’s fears?] Sentries fired at imagined enemies, but sometimes hit civilians or soldiers, even Navy airplanes coming in to land! Rumors about Japanese invaders continued. In Washington President Franklin D. Roosevelt asked Congress to declare war on the Japanese Empire. Isolationist politicians changed their positions; the country was united.One effect of the destruction of US airplanes was to replace old and obsolete units with the latest models. The lost battleships were not replaced, aircraft carriers were the new fighting ships. In 1942 production of automobiles stopped, factories turned to military production. Henry Kaiser mass-produced Liberty Ships. Rationing of food, clothing, and gasoline began. There were blackouts along the coast as a protection against submarines and to reduce electricity usage. The winning of the war made the US the premier power in the world. Colonial empires began to end with nations declaring independence. The number of military and civilian dead at Pearl Harbor was less than the 9/11 attack of 2001."}, {"review_sentiment": 5.0, "review_text": "Day of InfamyWalter Lord wrote several works of popular history. His “A Night to Remember” about the sinking of the ‘Titanic’ passenger ship was adapted to a movie. This 1957 book of 241 pages has a ‘Contents’ for its 12 chapters, ‘Facts About the Attack’, ‘Acknowledgments’, ‘List of Contributors’, and ‘Index’. This trade paperback is the Sixtieth-Anniversary Edition. Chapter I tells about the activities on Saturday night. The Japanese knew they had no hope of winning a war with America unless the US fleet in Hawaii was destroyed (Chapter II). They began their plans; they had to modify their torpedoes to work in shallow water. The carrier radio operators were changed to other ships so they would not be missed. [Did oscilloscopes detect this?] The attack fleet kept radio silence. In the early morning a strange submarine was seen (Chapter III).The carrier airplanes were readied for the attack (Chapter IV). An unknown submarine in the harbor was attacked. The Army radar station detected a huge flight of airplanes (Chapter V). People on the ground saw the many airplanes (Chapter VI). It was a regular Sunday morning for the Navy. Then they saw airplanes with a red ball showing. They were dropping bombs (Chapter VII). People thought it was a drill at first. Then the alarms went out. Sailors began to shoot back (Chapter VIII). There was no water pressure for the fire hoses. Some men were trapped below the water line! Many of the ships had inoperable guns or no ammunition. The sailors used what was available to shoot at the enemy attackers (Chapter IX). Some shot at US airplanes. The rush to Pearl Harbor created a traffic jam. Most of the explosions in Honolulu were caused by anti-aircraft shells. The attack ended at 10 AM (Chapter X). There were rumors of Japanese soldiers invading and parachutists landing, and other stories.After the attack a telegram from Washington warned General Short and Admiral Kimmel of an ultimatum from the Japanese to be delivered at 7:30 AM Honolulu time. The Japanese airplanes returned to their carriers, the ships returned to Japan. In Pearl Harbor many worked to rearm the ships and prepare for another attack (Chapter XI). There were attempts to rescue men trapped in ships. The Governor proclaimed martial law in preparation for the expected invasion. Civilians volunteered their services. Rumors continued about Japanese invaders (Chapter XII). [Don’t these reflect people’s fears?] Sentries fired at imagined enemies, but sometimes hit civilians or soldiers, even Navy airplanes coming in to land! Rumors about Japanese invaders continued. In Washington President Franklin D. Roosevelt asked Congress to declare war on the Japanese Empire. Isolationist politicians changed their positions; the country was united.One effect of the destruction of US airplanes was to replace old and obsolete units with the latest models. The lost battleships were not replaced, aircraft carriers were the new fighting ships. In 1942 production of automobiles stopped, factories turned to military production. Henry Kaiser mass-produced Liberty Ships. Rationing of food, clothing, and gasoline began. There were blackouts along the coast as a protection against submarines and to reduce electricity usage. The winning of the war made the US the premier power in the world. Colonial empires began to end with nations declaring independence. The number of military and civilian dead at Pearl Harbor was less than the 9/11 attack of 2001."}, {"review_sentiment": 5.0, "review_text": "This is a light history of Pearl Harbor told from the perspective of dozens of individuals from the US side who lived through the battle.  Although mostly focusing on those in the military, it also highlights some individuals.Lord is an excellent writer and the book will be entertaining and enjoyable to everyone except hard core history readers looking for something \"really new\" about Pearl Harbor.  The only (minor) complaint is the photos and illustrations will be difficult to see in ebook format unless you have a very large screen Kindle Fire or something similar.  The text works well and it has an active index if you wish to go back to a specific chapter."}]}, "authors": ["Walter Lord"], "isbn": "0805068031", "longitude": -157.8556764, "periods": ["1900s"], "title": "Day of Infamy: The Classic Account of the Bombing of Pearl Harbor", "word_cloud": "good history lesson unexpected attack training radar equipment everyone believe happen excellent description attack easy comprehend good individual short story think provoke extremely well anyone interested entry war great thing write find final quarter mostly acknowledgments index job place context individual experience informative anyone interested write several work popular history sink passenger ship adapt movie content chapter fact tell activity night japanese knew hope win war fleet destroy begin plan torpedo shallow water carrier radio operator change ship miss oscilloscope attack fleet keep radio silence early morning strange submarine see carrier airplane readied unknown submarine attack radar station detect huge flight airplane ground saw many airplane regular morning then saw airplane red ball show drop bomb think drill first then alarm go sailor begin shoot back water pressure fire hose men trap water line ship inoperable gun ammunition sailor use available shoot enemy attacker shoot airplanes rush create traffic jam explosion cause shell attack end rumor japanese soldier invade parachutist land attack telegram warn ultimatum japanese deliver time japanese airplane return carrier ship return many work rearm ship prepare attack chapter attempt rescue men trap ship proclaim martial law preparation expect invasion volunteer service continue japanese invader reflect people fear fire imagined enemy sometimes hit civilian soldier even airplane come land rumor japanese invader continue ask war politician change position country effect destruction airplanes old obsolete unit latest model lose battleship replace aircraft carrier new fight ship production automobile stop factory turn military production food clothing gasoline begin blackout coast protection submarine electricity win war make premier power world empires begin end nation declare independence number military civilian dead le attack write several work popular history sink passenger ship adapt movie page content chapter fact trade paperback tell activity night japanese knew hope win war fleet destroy begin plan torpedo shallow water carrier radio operator change ship miss oscilloscope attack fleet keep radio silence early morning strange submarine see carrier airplane readied unknown submarine attack radar station detect huge flight airplane ground saw many airplane regular morning then saw airplane red ball show drop bomb think drill first then alarm go sailor begin shoot back water pressure fire hose men trap water line ship inoperable gun ammunition sailor use available shoot enemy attacker shoot airplanes rush create traffic jam explosion cause shell attack end rumor japanese soldier invade parachutist land attack telegram warn ultimatum japanese deliver time japanese airplane return carrier ship return many work rearm ship prepare attack chapter attempt rescue men trap ship proclaim martial law preparation expect invasion volunteer service continue japanese invader reflect people fear fire imagined enemy sometimes hit civilian soldier even airplane come land rumor japanese invader continue ask war politician change position country effect destruction airplanes old obsolete unit latest model lose battleship replace aircraft carrier new fight ship production automobile stop factory turn military production food clothing gasoline begin blackout coast protection submarine electricity win war make premier power world empires begin end nation declare independence number military civilian dead le attack light history tell perspective dozen individual side live battle mostly focus military also highlight excellent writer entertain enjoyable everyone hard core history reader look something really new minor complaint photo illustration difficult see book format large screen something similar text work well active index wish back specific chapter", "genres": ["History", "WWII"], "summary": "A special 60th anniversary edition of the bestselling re-creation of the surprise attack on Pearl Harbor, by the author of A Night to Remember.\r\n\r\nSunday, December 7, 1941, was, as President Roosevelt said, \"a date which will live in infamy.\" Day of Infamy is a fascinating account of that unforgettable day's events. In brilliant detail Walter Lord traces the human drama of the great attack: the spies behind it; the Japanese pilots; the crews on the stricken warships; the men at the airfields and the bases; the Japanese pilot who captured an island single-handedly when he could not get back to his carrier; the generals, the sailors, the housewives, and the children who responded to the attack with anger, numbness, and magnificent courage.\r\n\r\nIn piecing together the saga of Pearl Harbor, Lord traveled over fourteen thousand miles and spoke or corresponded with over five hundred individuals who were there. He obtained exclusive interviews with members of the Japanese attacking force and spent hundreds of hours with the Americans who received the blow -- not just the admirals and generals, but enlisted men and families as well. \r\n\r\nHe visited each of the Hawaiian bases attacked and pored over maps, charts, letters, diaries, official files, newspapers, and some twenty-five thousand pages of testimony, discovering a wealth of information that had never before been revealed. \r\n\r\nDay of Infamy is an inspiring human document and the best account we have of one of the epic events in American history.", "asin": "0805068031", "rank": "163422", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/512tR-8ucFL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}