{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 234, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "Very Kafkaesque."}, {"review_sentiment": 3.0, "review_text": "As with most Kafka, it starts out as a brilliantly told tale, cleverly written and then degenerates into a rambling pointless rehashing that loses focus and contradicts the many good points brought at the beginning. I bought it as a companion to Albert Camus' wondrous \"Myth of Sisyphus\" at his suggestion and reference. Kafka's book serves its purpose in this regard."}, {"review_sentiment": 5.0, "review_text": "This was ordered for a college student.  It is exactly the book needed.  Thanks"}, {"review_sentiment": 5.0, "review_text": "Awsome"}, {"review_sentiment": 2.0, "review_text": "Love Kafka but wasn't a huge fan of this one. Felt it dragged and was too over the top to enjoy. It was a dreary read and wasn't overly engaging. I was happy when I finished."}, {"review_sentiment": 5.0, "review_text": "A remarkable preface, a powerful book"}, {"review_sentiment": 1.0, "review_text": "Translated by a machine. Horrible"}, {"review_sentiment": 5.0, "review_text": "Great book with a lot of underlying themes."}, {"review_sentiment": 3.0, "review_text": "Josef K. is a run-of-the-mill bank manager who is minding his own business when one day he is put under house arrest and told that he is to go on trial.  It is ambiguous as to whether he did anything naughty.  As he is not told the nature of his alleged crime, he does not know why he is being detained.Such are the opening pages of Kafka's THE TRIAL.  Given that he is not informed of what he is charged with, his trial emulates Judgment Day in the book of Revelation;  he must go over his entire life and defend every questionable action as he is unsure what the judiciary is \"looking for.\"  With the help of his father he hires a lawyer to defend him, but the defense counsel does little but muddy the waters even more than they were before.  The stress of being accused of a crime weighs on him and adversely affects his job performance > he comes off house arrest.  What is a poor banker to do?Anyone who has read anything by Kafka is not likely to be surprised that the storyline is bizarre and twisted.  This is a book which is mentioned quite a bit when it comes to 20th century literature and post-modern philosophical studies.  Unfortunately, I wanted to like it more than I really did.  It was a bit too fragmented for myself (it was unofficially unfinished @ the time of Kafka's death).  It is more of a thought experiment than a novel.  That said, it is a truly fascinating thought-experiment as it delves into the human psyche's conception of guilt.The novel stands alongside any of Sam Beckett's plays which are known as the theater-of-the-absurd genre.  More importantly, with the current chaos & confusion of the U.S. government with a lunatic in charge, the plot-line is more relatable than it has been in many yrs.  People who enjoy the current novel are admonished to also read 1984 (Signet Classics).  There are some dystopian parallels between Kafka & Orwell which we (unfortunately)  see bearing fruit in the present day."}, {"review_sentiment": 4.0, "review_text": "… as Bob Dylan once sang, in “Subterranean Homesick Blues.”I’ve read two of Kafka’s major works twice: The Metamorphosis and The Trial, and have reviewed both. Franz Kafka was a German Jewish writer who was born and raised in Prague, when it was part of the Austro-Hungarian Empire. He would die young, at the age of 40, in 1924, and like some other writers, he would die of tuberculosis. His world view was worse than mere “gloomy.” There is this nightmarish quality to his writing: the lone protagonist, with the last name of “K,” locked in a struggle with a bureaucracy were all the rules, and all the people who espouse them, are “non-Euclidian,” as it were… operating in a geometry very different from the one that we were taught in school. And even those rules are shifting, “contextually.” And “K” never wanted to be there to begin with! His books resonate, since I have not only been there, but am there. Rare is the writer, Machiavelli, for example, whose last name has been turned into a word in the English language. Kafka is in that elite club. He is Kafkaesque.Thanks to a fellow Amazon reviewer who urged me to also read this work, I have again experienced the nexus between real world experience and the absurdity and existential angst of fight “the system” of Mitteleuropa of a century ago. K. is a surveyor, and has been hired by The Count of the Castle. He arrives in the village near the Castle, expecting to assume his new position. He immediately encounters the hostility of the villagers, not aimed at him specifically, but rather because he is an outsider, who does not understand the system or the power arrangements. But does anyone?The plot has two primary threads, naturally entangled. Like “The Trial,” there is K.’s dealings with the nightmarish bureaucracy, filled with idiosyncratic characters, who have their “prerogatives.” Is the messenger more important than his boss? K.’s meeting with the Mayor, in bed, with gout, is a classic. The Mayor infers that K.’s actual hiring may not have been authorized, that the bureaucracy is working on the issue, and that it is the most “trivial” of cases before it. The Mayor manages to stir in some threat and menace. Typical of Kafka’s layered style, concerning the messenger Barnabas: “But what were they to pardon him for, they answered; no charge had been brought, at least none had been entered in the records, at any rate not in the records available for public lawyers.” They do, indeed, try to keep it all hidden. There is what is available to the public, and, again as Kafka says: “I found out quite a lot from the servants about how to get taken on at the Castle by getting round the public recruitment process, which is difficult, and takes years…”Unlike “The Trial,” there is K’s relationship with women, commencing with the barmaid, Frieda, who was once Klamm’s mistress, and quickly became K’s fiancée. Barnabas has a couple of daughters who may, or may not be interested in K., and then there is the landlady. Towards the end of the work, I thought that Kafka made some interesting observations about Frieda, and her barmaid replacement (for a while) Pepi, as well as their customers.Serendipity, and those female relationships, present K. with the opportunity to pull back the curtain, a la The Wizard of Oz and see how power is actually distributed. Or perhaps not, as is Kafka’s style. And is K.’s own file that single sheet of paper? Nothing can be certain. After all, they are masters at keeping it all hid!This work was unfinished at Kafka’s death. He wanted all his works destroyed. The world owes Max Brod a debt of gratitude because he disobeyed his friend’s wish. This novel ends in mid-sentence. I do think a good editor would have substantially reduced its wordiness, and seemingly irrelevant tangents, such as the relationship of Frieda and Pepi. For Kafka’s work, 4-stars; for my real-world experience, as in “The Trial,” the jury is still out."}]}, "authors": ["Franz Kafka"], "isbn": "0805209999", "longitude": 14.4212535, "periods": ["1900s"], "title": "The Trial", "word_cloud": "very start brilliantly tell tale cleverly write degenerate ramble pointless rehash loses focus contradicts many good point bring begin buy companion wondrous suggestion reference serve purpose regard order college student exactly need thanks awesome huge fan drag top enjoy dreary overly engage happy finish remarkable preface powerful translate machine lot underlie theme bank manager mind business day put house arrest tell go ambiguous anything naughty told nature allege crime know open page inform charge emulates entire life defend questionable action unsure judiciary look help father hire lawyer defend defense counsel little muddy water even stress accuse crime weighs adversely affect job performance come house arrest poor banker anything likely surprise story line bizarre twist mention quite bit come century literature philosophical study unfortunately want really bit fragment unofficially unfinished time death think experiment say truly fascinating delf human psyche conception stand alongside play know genre more importantly current chaos confusion government lunatic charge repeatable many yr enjoy current admonish also dystonia parallel unfortunately see bear fruit present day sing major work twice review german jewish writer bear raise part young age writer world view worse mere nightmarish quality write lone protagonist last name lock struggle bureaucracy rule people espouse operate geometry different taught school even rule shift never want resonate rare writer example last name turn word language elite club reviewer urge also work experience nexus real world experience absurdity existential angst fight system century ago surveyor hire arrive village expect assume new position immediately encounter hostility villager aim specifically rather outsider understand system power arrangement anyone plot primary thread naturally entangle dealing nightmarish bureaucracy fill idiosyncratic character be messenger important bos meeting bed gout classic infers actual hiring bureaucracy work issue trivial case manage stir threat menace layer style concern messenger pardon answer charge bring least none enter record rate record available public indeed try hidden available public say find quite lot servant get take get round public recruitment process difficult take relationship woman commence barmaid mistress quickly become couple daughter landlady end work think make interesting observation barmaid replacement well female relationship present opportunity pull back curtain see power actually distribute perhaps style file single sheet paper certain master keep hid work unfinished death want work destroy world owe debt gratitude disobey friend wish end think good editor substantially wordiness seemingly irrelevant tangent relationship work experience jury still", "genres": ["Fiction & Literature"], "summary": "Written in 1914, The Trial is one of the most important novels of the twentieth century: the terrifying tale of Josef K., a respectable bank officer who is suddenly and inexplicably arrested and must defend himself against a charge about which he can get no information. \r\n\r\nWhether read as an existential tale, a parable, or a prophecy of the excesses of modern bureaucracy wedded to the madness of totalitarianism, Kafka's nightmare has resonated with chilling truth for generations of readers. \r\n\r\nThis new edition is based upon the work of an international team of experts who have restored the text, the sequence of chapters, and their division to create a version that is as close as possible to the way the author left it.\r\n\r\nIn his brilliant translation, Breon Mitchell masterfully reproduces the distinctive poetics of Kafka's prose, revealing a novel that is as full of energy and power as it was when it was first written.", "asin": "0805209999", "rank": "33866", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51ue0qkIplL.jpg", "country": "Czechia", "story_arc": ["Tragedy", "Things only get worse"]}