{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 3, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Has been excelent"}, {"review_sentiment": 5.0, "review_text": "Venice, Italy has been a city of mystery, of hidden secrets, of scandals, and of the flowering of art, a city that has intrigued many philosophers and historians as that unique kingdom that floats on the sea, a city that has escaped the invasion of the the clutter of the world such as the automobile and industrial advances. Venice has produced some of the greatest artists of the world: in music (Gabrieli, Vivaldi, et al), painters (Bellini, Giorgione, Titian, Canaleto, Tintoretto, Veronese, Paladino et al), and writers of the past (Goldoni, Casanova) and of the recent past and present  - John Rushkin, Henry James, Thomas Mann, Marcel Proust, Nietzsche...and Harold Brodkey.  This small book MY VENICE  by Harold Brodkey treasure those aspects of Venice that make it so special.  The book is actually a series of excerpts from his writings (Profane Friendship, This Wild Darkness, Stories in an Almost Classical Mode, fragments from his lectures and other writings) joined with photographs by Giuseppe Bruno.  The result is a book or memoir honoring a city where Harold Brodkey was born and where he constantly returned to write and to live fully in the mists and vapors and mysteries that this floating city provides.Much of the book is devoted to first drafts of his manuscript for this last novel, 'Profane Friendship', and these fragments (thought by the editor and the author to dwell too much on describing the city rather than allow the novel to flow) are scattered with final pages of that novel and give us insight as to just how much this city meant to Brodkey.  The book was published in 1998, two years after Brodkey's death from AIDS, a fact that makes passages in this memoir even more poignant. He writes 'I am dying...Venice is dying...The century is dying...The imbecile certitudes of the last three-quarters-century are dying.  The best journalism of the last half-century has been leftist; which means that human nature was shown as innocent, as decent at the beginning and the end of each story.  A phantasmagoria, a piety, that idea - an abdication of reality, an infinite condescension toward anything less than absolute power.  Similarly, novels were fantastic - like spaceships that as a matter of course left this world.  The real was forbidden.'Nine 'chapters' of Harold Brodkey's writing are accompanied by exquisite photographs by Giuseppe Bruno of the canals, the sea vistas, the piazzas, the architectural treasures both in full view and in subtle fragments, and the sites of lonely benches along the canals that contribute to the the mood of this fine book.  The editor, Angela Praesant (in a translation by Elizabeth Gaffney) summarizes the production of this volume at the end of the book: 'Harold Brodkey evokes Venice as a state of mind; as a premonition of what might remain were Europe's ancient hatreds finally quelled; as an imaginary place where to live in the moment need not preclude an awareness of history.'  For those many admirers of the talent of Harold Brodkey this little book is a rare memento.  Grady Harp, January 10"}, {"review_sentiment": 3.0, "review_text": "A marvellously eying little book, with stunning black and white pictures by Giuseppe Bruno, a renowned Italian photographer.  The book consists of a compilation of frgaments from Harold Brodkey's books and essays, all dealing with Venice, soem of which seem to capture the Venetian atmosphere very well, in a beautiful, lyrical language. Some, however, are almost too lyrical and dense. Others remain too muc a fragment, rather than serving as stand-alone texts. In all, however, this is a beautiful tribute to Venice."}]}, "authors": ["Harold Brodkey"], "isbn": "0805048332", "longitude": 12.3345898, "periods": ["1900s"], "title": "My Venice", "word_cloud": "excellent city mystery hidden secret scandal flower art city intrigue many philosopher historian unique kingdom float sea city escape invasion clutter world automobile industrial advance produce greatest artist world music al painter al writer recent past present small treasure aspects make special actually series excerpt write fragment lecture writing join photograph result memoir honor city bear constantly return write live fully mist vapor mystery float city devote first draft manuscript last fragment think editor author dwell much describe city rather allow flow scatter final page give insight much city meant publish year death fact make passage even write die die century die imbecile certitude last die best journalism last leftist mean human nature show innocent decent begin end story phantasmagoria piety idea abdication reality infinite condescension anything absolute power novel fantastic spaceship matter course leave world real forbidden write accompany exquisite photograph canal sea vista piazzas architectural treasure full view subtle fragment sit lonely bench canal contribute mood fine editor translation summarize production volume end evoke state mind premonition ancient hatred finally quell imaginary place live moment awareness history many admirer talent little rare memento marvelously eye little stunning black white picture renowned italian consists compilation fragment essay deal sum seem capture atmosphere well beautiful lyrical language however almost lyrical dense remain cum fragment rather serve text however beautiful tribute", "genres": ["Memoir", "Essay", "Poetry"], "summary": "Harold Brodkey's haunting, lyrical portrait of his most beloved city.\r\n\r\nVenice is a separate country,\" Harold Brodkey wrote of the fabled city that became his literary muse. \"It floats at anchor inside its own will, among its domes and campanili, independent and exotic at its heart.\"The author's love of Venice--its churches and vaporetti, its capacity to bewilder and seduce--brought him back time and again to the shores of the Adriatic in search of fresh inspiration. \r\n\r\nBrodkey's Venice is marked by powerful contrasts: pride beside humility, the sacred alongside the profane, solemn tradition coexisting with exuberant mercantile optimism. \r\n\r\nIllustrated with eleven stunning black-and-white portraits by the legary Italian photographer Giuseppe Bruno, My Venice combines passages from several of Brodkey's great works with previously unpublished notes and essays to create a text as rich, subtle, and beguiling as the city itself.", "asin": "0805048332", "rank": "3472423", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/512YEX2NKCL.jpg", "country": "Italy", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}