{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 84, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "really amazing journey through the christian middle east"}, {"review_sentiment": 5.0, "review_text": "wonderful book"}, {"review_sentiment": 5.0, "review_text": "A fascinating story; it's written engagingly and provides an excellent overview of a significant period of history that is less than glossed over in school history classes."}, {"review_sentiment": 5.0, "review_text": "William Dalrymple is  great writer. This story of a journey of  through the entire Byzantium world, its history,geography and politics is compelling reading,Dalrymple  is writing about the dying civilisation of the eastern Christian world, falling beneath the might of Islam.The incidents, the brilliant pictures of places he visits and the people he meets, are  illuminating, most of it news to me.An extraordinary man, brave, hugely observant and objective. This is what reading is for."}, {"review_sentiment": 5.0, "review_text": "Searching for the church in the East? There is no better guide than William Dalrymple. Period."}, {"review_sentiment": 4.0, "review_text": "William Dalrymple’s a fearless reporter, a charming stylist and a sympathetic observer of a vanishing civilization—the ancient Christian communities of the Middle East from Mount Athos to Alexandria.  In “From the Holy Mountain,” he’s following in the footsteps of John Moschos, a 5th–6th c. Byzantine monk who wrote an account of the spiritual life of Syria, Palestine and Egypt in the years before the irruption of Islam that’s still read today.  Dalrymple’s observations on the more recent history of the region (through ’97), though focusing on the Orthodox and Maronite communities, provide a deeper understanding of its deadly sectarian rivalries than any current journalism; much of his journey would be impossible today. Entertaining and informative; highly recommended."}, {"review_sentiment": 5.0, "review_text": "A wonderful book and I recently re-read it a second time after many years. As fresh and never boring as re-reading the Sherlock Holmes stories.The author travels to the Christian communities in the middle-east, starting from Egypt and traveling to Turkey, Syria, Lebanon, etc. We view the region through the religion of Islam, yet these countries used to be pluralistic societies and had a sizeable population of Christians.The author describes the various ancient communities, the historical churches and the challenges faced by the Christian communities in an increasingly fundamentalist environment, and how they are fighting against odds to survive. This book was written much before the ISIS menace, so one can only hope that the communities survive this newer brutal onslaught. The photographs are well chosen as well, and the many black-and-white images go well with the historical nature of this book.The author travels the path used by John Moschos and his disciple. This kindled my curiosity about Moschos, and I immediately bought a copy of his classic \"The Spiritual Meadow\". There is nothing better than reading a well-written book, and jumping to the parent book which was its inspiration."}, {"review_sentiment": 4.0, "review_text": "Interesting tale"}, {"review_sentiment": 5.0, "review_text": "Too often we try to understand what is going on in the Middle East by looking to politics and governments.  William Dalrymple helps us to understand what is going on today by showing us the actual people of the region and their religions and how that has impacted what is going on.  Unlike us in the West who tend to put our faith in a box and drag it out on Sundays (maybe), these people's lives are deeply influenced by the faith they profess.  To be a Christian in lands where they are minorities is life threatening.  This has gone on since the dawn of Christianity.  We are always the remnant, the minority, until Christ comes again in glory.  We must continue to pray for all of these people, that peace will eventually come."}, {"review_sentiment": 4.0, "review_text": "William Dalrymple sets out with his backpack, pen and paper and a copy of the book 'The Spiritual Meadow' to travel to Turkey, Syria, Lebanon, Israel and Egypt over six months in 1994, to take a look at the Christian communities that live there and to see what has become of them and their heritage. The inspiration for the journey comes from the book he was carrying, which was written by John Moschos, a sixth century Byzantine monk, who did a somewhat similar journey and recorded his impressions in 'The Spiritual Meadow'. What Dalrymple finds turns out to be sad and heartbreaking and we get the picture of a gradual disappearance of Christian life in the Middle East. Persecution, discrimination and insecurity have driven most of them out, to emigrate to Brazil, US, UK, Australia and Canada. The ultimate irony for Dalrymple occurred when he wanted to meet some remaining Nestorian Christians in Syria.  He was told that the largest community of Nestorian Christians can be found in the suburb of Ealing in London!Given the problems in the Middle East nowadays, one would have assumed that the Christians of the region would be mainly threatened in their existence by Islamic Fundamentalism. But, Dalrymple's travels and experiences show that the reality is a lot more complicated than this. In fact, the problems faced by the Christians is quite diverse. Let us look at what the author says of the situation in each of the five countries that he visits.In Turkey, the Syrian Christians are caught in the crossfire between the rival nationalisms  and religion of the Turks and the Kurds. Both the ethnic groups see Christians as neither Turks nor Kurds and certainly not as co-religionists. In the past, during the First World War, starvation, deportation and massacre decimated the Suriani Christians in Turkey. The Armenian story is also heartbreaking, with whole villages having been massacred in early 20th century by the Turks. Dalrymple says that Armenian churches have steadily been destroyed and that there is an attempt to erase all traces of Armenians ever having existed in Turkey.In Lebanon, even though there are substantial number of Christians, the author blames the violent militancy of the Maronite Christians and their refusal to compromise with the Muslim majority for the ensuing civil war, which has resulted in mass emigration of Christians. This has contributed to the dimunition in the power of the Maronites themselves. In addition, there is the complication of Israel being a neighbor and the Muslims regarding the Christians as 'not Arabs'.In Israel, the author's account of Christians is a shocker. Since Israel is strongly backed by the West, which is pre-dominantly Christian, I would have thought that Christians as minorities would have it easier in the Jewish state. On the contrary, Dalrymple says that they are treated as second-class citizens and are viewed with suspicion and contempt by the Israeli authorities. In Jerusalem, the pressure on Armenian, Greek and Arab Christians to sell their land is continuous and unyielding. As a result, most Palestinian Christians, being well-educated, have emigrated to the West. They allege that Israel has been at work trying to diminish the Christian heritage in Jerusalem and promote the Jewish heritage of the city. In 1922, the old city of Jerusalem had a 52% Christian population. In 1994, when Dalrymple visits Jerusalem, it was 2.5%.In Egypt, the author finds that the Coptic Christians are threatened by the resurgence of Islamic fundamentalism. But they are also the largest Christian community in the Middle East and this helps a bit in their survival. In 1994, the threats were mostly limited to specific Cairo suburbs and some towns and villages in Upper Egypt. Today, with the rise of the Muslim Brotherhood, we see the insecurity of the Copts rising sharply.Finally, it is only in the much-maligned Syria that the author finds the Christian population looking happy and confident and in good numbers. Even here, they were insecure about the future when the Alawites eventually lose power and the Sunni majority assumes the mantle. Again, current events bear witness to such possibilities.Overall, contrary to popular imagination in the Islamic world, the picture that emerges is that Western countries are largely indifferent to the plight of these Eastern Christians and have lent them neither financial nor political support during all these decades of their decline. Even on the issue of emigration, perhaps the over-riding factor would have been their high levels of education and employability rather than affinity of religion.Readers of the book who are of Turkish or Israeli origin might not agree with the description of the treatment of Christian minorities in their countries. However, I feel that one should see this book NOT as an account of history but rather as a travelogue, where Dalrymple has recorded his impressions and conclusions based on his experiences during those six months. It must be said to Dalrymple's credit that he emphasizes the fact that relations between Christians and Muslims in the Middle East was quite healthy under the Ottoman Turkish Empire.The author's final conclusion now, however, is that he has seen the beginning of the end of Christians in the Middle East.A great travelogue!"}]}, "authors": ["William Dalrymple"], "isbn": "0805061770", "longitude": 28.9651646, "periods": ["1900s", "500-1400s"], "title": "From the Holy Mountain: A Journey among the Christians of the Middle East", "word_cloud": "really amazing christian wonderful fascinating story write engagingly provide excellent overview significant period history le glossed school history class great writer story entire world history geography politics compel read write die civilization eastern world fall beneath incident brilliant picture place visit people meet illuminate news extraordinary man brave hugely observant objective reading search church better guide fearless reporter charm stylist sympathetic observer vanish ancient christian community follow footstep write account spiritual life year irruption still today observation recent history region focus community provide understand deadly sectarian rivalry current journalism much today informative highly recommend wonderful recently second time many year fresh never bore author travel christian community start travel view region religion yet country use pluralistic society sizable population author describe various ancient community historical church challenge face christian community increasingly fundamentalist environment fight odds survive write much menace hope community survive newer brutal onslaught photograph well chosen well many image go well historical nature author travel path use disciple kindle curiosity immediately buy copy nothing better reading jump parent inspiration interest tale too often try understand go look politics government help go today show actual people region religion impact go tend put faith box drag maybe people live deeply influenced faith profess land minority life threaten go dawn always remnant minority come glory pray people peace eventually come set pen paper copy travel month take look christian community live see become heritage inspiration come carry write sixth century monk somewhat similar record impression find turn sad heartbreaking picture gradual disappearance life discrimination insecurity drive emigrate ultimate irony occur wanted meet remain nestorius tell largest community nestorius find suburb problem nowadays region mainly existence travel experience show reality lot complicate fact problem face quite diverse author say situation country syrian catch crossfire rival nationalism religion ethnic group see certainly past starvation deportation massacre decimate story also heartbreaking whole village massacre early century say armenian church steadily destroy attempt erase trace ever exist even substantial number author blame violent militancy refusal majority ensue civil war result mass emigration contribute diminution power addition complication neighbor regard author account shocker strongly back minority jewish state contrary say treat citizen view suspicion contempt authority pressure sell land continuous unyielding result palestinian emigrate allege work try diminish heritage promote heritage city old city population visit author find coptic threaten resurgence fundamentalism also largest community help survival threat mostly limit specific suburb town village see insecurity rise author find christian population look happy confident good number even insecure future eventually power majority assumes mantle current event bear witness contrary popular imagination world picture emerge western country largely indifferent plight lent financial political support decade decline even emigration perhaps factor high level education employ ability rather affinity origin description treatment christian minority country however feel see history rather travelogue record impression conclusion base experience month say credit emphasize fact relation quite healthy author final conclusion however see begin end great travelogue", "genres": ["History", "Travel Writing", "Ancient Civilizations"], "summary": "In 587 a.d., two monks set off on an extraordinary journey that would take them in an arc across the entire Byzantine world, from the shores of the Bosphorus to the sand dunes of Egypt. \r\n\r\nOn the way John Moschos and his pupil Sophronius the Sophist stayed in caves, monasteries, and remote hermitages, collecting the wisdom of the stylites and the desert fathers before their fragile world finally shattered under the great eruption of Islam. \r\n\r\nMore than a thousand years later, using Moschos&#039;s writings as his guide, William Dalrymple sets off to retrace their footsteps and composes \"an evensong for a dying civilization\" --Kirkus Reviews, starred review", "asin": "0805061770", "rank": "561422", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51CXVhQktrL.jpg", "country": "Turkey", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}