{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 11, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Love this book"}, {"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 4.0, "review_text": "I had to read this for a field experience class where we studied literature written by authors who were greatly influenced by life in New Orleans and life on the Mississippi River. We then took several tours through New Orleans. On those tours, our group was able to learn a little more and impressed the tour guides because we had already been exposed to much of the literary history of New Orleans during the Prohibition Era. It was fun to imagine one of the tales about Faulkner's game of rooftop tag during one of the wild parties that he and his roommate threw.  This book is an interesting look at the Famous Creoles of New Orleans!"}, {"review_sentiment": 5.0, "review_text": "Great encyclopedia of New Orleans Modernism. I thought it was just going to be more of a narrative all the way through, so I was surprised when it switched to individual profiles, but I think it's extremely valuable for scholars of American modernism."}, {"review_sentiment": 5.0, "review_text": "Virtually the only chronicle of the personalities: the artists, writers, philanthropists, photographers, preservationists, etc. and the times that led to saving the French Quarter. Wish there were more material but this was prepared from lectures given on the topic. I wish there were more but the book does point the way for others to continue. Finally, someone writes of the enormous contributions of William Ratliff Irby in saving many French Quarter landmarks and his part in the French Quarter Revival. This puts \"flesh & blood\" on those personalities responsible in that exciting time. Loved it!"}, {"review_sentiment": 5.0, "review_text": "John put the boogy in the story telling of 43 characters that comprise the picture he paints of the artistic movement that occurred in New Orleans in the 1920s. Like Paris, New Orleans was waiting for the next signficant opportunity to advance culture. John serves it up for us in Dixie Bohemia. Enchante Vieux Carre!"}, {"review_sentiment": 4.0, "review_text": "John Shelton Reed never disappoints. Here, one of the most perceptive observers of the South takes on the artistic circle of friends that formed around Sherwood Anderson, William Faulkner, and William Spratling in 1920s New Orleans. Worth reading for anyone interested in Southern history, New Orleans, or Southern literature. Almost gave this five stars, but honestly, I think some of Reed's other books are better."}, {"review_sentiment": 4.0, "review_text": "Overall a good read -  a window into the bohemian circles of 1920's French Quarter New Orleans. The author takes pains to show how the coming together of place and people allowed a unique art scene to flourish - if only briefly - in the aftermath of WWI in America's most European city. The scene included William Faulkner, Oliver LaFarge and a host of regional artists and writers. It's a brief, though well-written view into a vanished world. The only reason I didn't give it five stars was I thought it was a little too brief!"}, {"review_sentiment": 5.0, "review_text": "Excellent book! It was very interesting to me because I worked at the Times Picayune and knew some of the people and places mentioned in book."}, {"review_sentiment": 5.0, "review_text": "This riveting book tells the story of an amazing group of people -- writers, artists, jewelry designers, actors, journalists -- who coalesced into a community in the glory days of the 1920's.  Anyone who loves New Orleans, the Roaring Twenties, art, the theater, or literature will want to read this entertaining acccount."}]}, "authors": ["John Shelton Reed"], "isbn": "0807156108", "longitude": -90.0701156, "periods": ["1900s", "Recent Releases"], "title": "Dixie Bohemia: A French Quarter Circle in the 1920s (Walter Lynwood Fleming Lectures in Southern History)", "word_cloud": "great field experience class study literature write author greatly influence life life take several tour tour group able learn little impressed tour guide already expose much literary history fun imagine tales game rooftop tag wild party roommate interesting look encyclopedia think go narrative way surprise switch individual profile think extremely valuable scholar american modernism virtually chronicle personality artists writer philanthropist photographer preservationist etc time lead save material prepared give topic wish point way others continue finally someone write enormous contribution save many landmarks part put flesh blood personality responsible exciting time love put story tell character comprise picture paint artistic movement occur wait next significant opportunity advance culture serve never disappoint here perceptive observer take artistic friend form read anyone interested history literature give star honestly think better overall good window bohemian circle author take pain show come together place people allow unique art scene flourish briefly aftermath city scene include host regional artist writer brief view vanish world reason give star think little brief excellent interest work know people place mention rivet tell story amaze group people writer artist jewelry designer actor journalist coalesce community glory day love art theater literature want entertain account", "genres": ["Art & Architecture", "History"], "summary": "In the years following World War I, the New Orleans French Quarter attracted artists and writers with its low rents, faded charm, and colorful street life. By the 1920s Jackson Square had become the center of a vibrant if short-lived bohemia. A young William Faulkner and his roommate William Spratling, an artist who taught at Tulane University, resided among the \"artful and crafty ones of the French Quarter.\" In Dixie Bohemia John Shelton Reed introduces Faulkner's circle of friends -- ranging from the distinguished Sherwood Anderson to a gender-bending Mardi Gras costume designer -- and brings to life the people and places of New Orleans in the Jazz Age.\r\n\r\nReed begins with Faulkner and Spratling's self-published homage to their fellow bohemians, \"Sherwood Anderson and Other Famous Creoles.\" The book contained 43 sketches of New Orleans artists, by Spratling, with captions and a short introduction by Faulkner. The title served as a rather obscure joke: Sherwood was not a Creole and neither were most of the people featured. But with Reed's commentary, these profiles serve as an entry into the world of artists and writers that dined on Decatur Street, attended masked balls, and blatantly ignored the Prohibition Act. These men and women also helped to establish New Orleans institutions such as the Double Dealer literary magazine, the Arts and Crafts Club, and Le Petit Theatre. But unlike most bohemias, the one in New Orleans existed as a whites-only affair. Though some of the bohemians were relatively progressive, and many employed African American material in their own work, few of them knew or cared about what was going on across town among the city's black intellectuals and artists.\r\n\r\nThe positive developments from this French Quarter renaissance, however, attracted attention and visitors, inspiring the historic preservation and commercial revitalization that turned the area into a tourist destination. Predictably, this gentrification drove out many of the working artists and writers who had helped revive the area. As Reed points out, one resident who identified herself as an \"artist\" on the 1920 federal census gave her occupation in 1930 as \"saleslady, real estate,\" reflecting the decline of an active artistic class.\r\n\r\nA charming and insightful glimpse into an era, Dixie Bohemia describes the writers, artists, poseurs, and hangers-on in the New Orleans art scene of the 1920s and illuminates how this dazzling world faded as quickly as it began.", "asin": "0807156108", "rank": "1372361", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/4100poe4GdL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}