{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 3, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Extremely helpful in research concerning Tropicalia and its relationship to revolutionary behavior in the lusophone world."}, {"review_sentiment": 5.0, "review_text": "Prof. Christopher Dunn has written an impressive book about music and its role in the history and development of Brazilian Counterculture. \"Brutality Garden: Tropicalia and the Emergence of a Brazilian Counterculture\" begins by covering the history of Brazilian intellectual modernism (modernismo), focusing on the contributions of Oswald de Andrade and Mario de Andrade, as well as the early development of a progressive political impulse in early to mid 20th century Brazil. Two elements emerge early:  the growth of a 'orthodox' socialism in the arts and music, and a concern over the authenticity of Brasilian cultural production both for internal consumption and external export. Musically, this concern with authenticity focused on the dual phenomena of Carmen Miranda, and Bossa Nova, both of which carry either heavy non-Brazilian influences and uncomfortable racial stereotypes.Meanwhile, the progressive impulse is subverted in a right-wing military coup (supported and encouraged by the United States) which profoundly affects the Brazilian arts and the public. Television and Opera maintain a certain degree of freedom from censorship at first, but revolutionary socialism seems unable to articulate an effective resistance.Enter Caetano Veloso and Gilberto Gil. In this matrix of poltical and nationalistic uncertainty, and through the use of pastiche, dissassociative imagery, irony, parody, and a concern with the everyday frustrations of Brazilians, they  construct an insurgent music that gains a wide reach and audience, while mostly flying underneath the dictatorship's radar screen. Refusing the government's attempts to force a highly nationalistic concept of unity on the populace, Tropicalia uses deploys the benign imagery of tropical paradise, only to subvert them with references (sometimes overt, sometimes oblique by necessity) to social and political trauma. The more orthodox leftists, of course, criticize Tropicalia for not directly inciting the masses to act, and instead promoting escapism. Yet Tropicalia's moment in the sun is not only threaded in the past of Brazilian historical discourse on modernity, but serves to feed a growing countercultural movement in Brazilian culture throughout the late 1960s and 1970's. By foregrounding areas of Brazilian socio-economic underdevelopment, Afro-Brazilian religion (Macumba, Candomble), and the historical legacy of Portugese colonialism, Tropicalia stakes out a lasting ground, and a usable past for  Brazilian counterculture.The book is heavy on history,  and light on the explicit citation of theory, although its playful and trickster hermeneutic (well suited to its subject matter) is everywhere. Also playing a prominant role in the book is Candomble. Candomble religion plays an imporant role in the history of Tropicalia, and in the larger history of Brazilian metaphor and music. Candomble practices and practitioners occur in artistic discourses concerning the nature and center of Brazilian modernismo. Such as the 1971 painting \"Primeria missa no Brasili\" by Glauco Rodrigues, the song \"Batmacumba\" on \"Tropicalia , ou panis et circensis\" and on Os Mutandes first recording , Veloso's \"Triste Bahia,\" a 1970's pop revival with roots as early as the 1930's. but especially prescient with Gil Gilberto and Veloso, and Gal Costa's tour of \"Doces Barbaros\" in 1976. 1977 saw Veloso's album \"Bicho\" and Gilberto Gil's \"Refavela,\" both intimately concerned with Black consciousness and Candomble. Even as 1997 Gil's album \"Quanta\" wove discourses of the Internet with Orisha worship.A dense book that weaves from literary and painting analysis to economic development theory and musical hermeneutics--this is a carefully written and edited interdisciplinary work of Cultural History and American/Atlantic Studies.The author recommends the CD \"Tropicalia Essentials\" for use with the book. It is available on Amazon.comAfter reading the book , I would also suggest \"Tropicalia, ou panis et circensis\" -- the original release of which appears to have been a crystalizing moment in the Tropicalia movement."}, {"review_sentiment": 5.0, "review_text": "An outstanding history of the late -1960s surrealist-hippie rock movement known as \"tropicalia.\"  Although tons has already been written about Caetano Veloso, Gilberto Gil and the other heroes of the tropicalia scene in the Brazilian press and academia, it's been pretty slim pickings in the English-speaking world... up until now, that is!  Christopher Dunn, who co-edited \"Brazilian Popular Music & Globalization,\" skillfully combines hard academic research with a relatively light, conversational prose.  This is dense yet captivating material, as Dunn deftly explores the historical and philosophical connections to tropicalia -- an art movement that was originally conceived as cross-genre and multi-media -- and previous Brazilian movements such as modernismo, which was Brazil's homegrown 1920s variant of the \"futurist\" philosophy that swept through Europe in the early 20th Century.  Dunn also deftly tells the story of tropicalia's explosive growth as a subversive, psychedelic musical genre, and the harsh political repression it was met with by the dictatorship which held power from 1964 to 1985.  This is a vital book, of interest to the many newfound fans of this wild musical style, or to art historians tracking the worldwide path of dada-ism and surrealist art.  Highly recommended."}]}, "authors": ["Christopher Dunn"], "isbn": "0807849766", "longitude": 0.0, "periods": ["1900s"], "title": "Brutality Garden: Tropicalia and the Emergence of a Brazilian Counterculture", "word_cloud": "extremely helpful research concern relationship revolutionary behavior lusophone world write impressive music role history development begin cover history intellectual modernism modernism focus contribution well early development progressive political impulse early mid century element emerge early growth socialism art music concern authenticity cultural production internal consumption external export concern authenticity focus dual phenomenon carry heavy influence uncomfortable racial progressive impulse subvert military coup support encourage profoundly affect art public maintain certain degree freedom censorship first revolutionary socialism seem unable articulate effective political nationalistic uncertainty use pastiche dissassociative imagery irony parody concern everyday frustration construct insurgent music gain wide reach audience mostly fly underneath dictatorship radar screen refuse government attempt force highly nationalistic concept unity populace use deploy benign imagery tropical paradise subvert reference sometimes overt sometimes oblique necessity social political trauma orthodox leftist course criticize directly incite mass act instead promote escapism moment sun thread past historical discourse modernity serf fee grow counter cultural movement culture late foreground area underdevelopment religion historical legacy portuguese colonialism stake last ground usable past heavy history light explicit citation theory playful trickster hermeneutic well suit subject matter everywhere also play prominent role religion play important role history larger history metaphor music practice practitioner occur artistic discourse concern nature center modernism such painting miss song et circensis first record pop revival root early especially prescient tour saw album intimately concern consciousness even album wove discourse dense weave literary painting analysis economic development theory musical hermeneutics carefully write edit interdisciplinary work author recommend use available reading also pain et circensis original release appear crystallize moment movement outstanding history late rock movement know ton already write hero scene press academia pretty slim picking world skillfully combine hard academic research relatively light conversational prose dense yet captivate material deftly explore historical philosophical connection art movement originally conceive previous movement homegrown variant futurist philosophy sweep early also deftly tell story explosive growth subversive psychedelic musical genre harsh political repression meet dictatorship held power vital interest many newfound fan wild musical style art historians track worldwide path surrealist art recommend", "genres": ["History", "Politics", "Music"], "summary": "Focusing on a group of musicians from Bahia, an impoverished state in northeastern Brazil noted for its vibrant Afro-Brazilian culture, Christopher Dunn reveals how artists including Caetano Veloso, Gilberto Gil, Gal Costa, and Tom Ze created this movement together with the musical and poetic vanguards of Sao Paulo, Brazil's most modern and industrialized city.\r\n\r\nHe shows how the tropicalists selectively appropriated and parodied cultural practices from Brazil and abroad in order to expose the fissure between their nation's idealized image as a peaceful tropical \"garden\" and the daily brutality visited upon its citizens.", "asin": "0807849766", "rank": "479855", "city": "Sao Paolo", "image": "https://images-na.ssl-images-amazon.com/images/I/51k-Ozd2MqL.jpg", "country": "Salvador", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}