{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 17, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "I bought this book to supplement another book I had read, \"Death to All Puerto Ricans\".  This book reads more like an unbiased textbook, offering the reader an excellent history lesson on how the European nations and the United States impacted the island of Puerto Rico economically, socially, and politically.  The many U.S. acts such as the Foraker and Jones Acts explained in the American history books fail to mention how they directly affect the colonized territories.  You may need to have a supplemental reference close by if you are not familiar with some of the terms the author uses (colonos, hacendado, etc.)."}, {"review_sentiment": 5.0, "review_text": "Must read if you are puerto rican."}, {"review_sentiment": 5.0, "review_text": "It's taken me a few months to read the entire book, but it was worth it.  My parents left PR in 1945.  I turned one year old in Caracas, Venezuela, where we lived for the next 15 years.  As i was growing up, PR was gradually transformed into a mythical Bali-Hai, a paradise on earth.  Nothing critical was ever said about it. Both my parents were pro-independence. When we returned to PR and I got involved in both politics and the UPR protests of the 1960's, I saw my family be persecuted as a result.  I  left once more, moving to NYC permanently.  All of this is necessary to explain the impact this book has had on me.  If \"War Against All Puerto Ricans\" focused on  political persecution (my family included), \"Puerto Rico in the American Century\" provided me with that part of Puerto Rican history I never did learn academically.  Now I understand what my parents were not about to discuss : the reasons they left the island, first for Venezuela and then for the USA.  Now I have a true sense of the depths of betrayal the Puerto Rican people suffered not only at the hands of Empire but at the hands of the Empire's lackeys, from Muñoz Marín and Romero Barceló to  the current administration.  I found the \"Conclusions\" realistically disturbing. When all is said and done, PR may never be able to be completely free from its invaders. ."}, {"review_sentiment": 5.0, "review_text": "I came to the US from Puerto Rico at age ten.  During the past few years I read a few books about PR. because I felt Idid not knowmuch history about the island.  Puerto Rico in the American Century was very informative and I learned many details about the huistory of PR which I did not know.  I recommend this book to anyone that came to the US as a child and would like to learn about the history of the island, specificallyfrom 1898 to the millenium years."}, {"review_sentiment": 5.0, "review_text": "Glad I have the book!"}, {"review_sentiment": 5.0, "review_text": "Well-documented and comprehensive overview of 20th century Puerto Rico.An excellent complement to Ayala's AMERICAN SUGAR KINGDOM.Both books are highly recommended."}, {"review_sentiment": 5.0, "review_text": "Excellent and detailed summary of the events that shapped Puerto Rican culture, as well as its politics and its economic reality.  A \"must read\" if you want to understand the Puerto Rico of the XXI Century."}, {"review_sentiment": 5.0, "review_text": "As a graduate student of Puerto Rican history this book is a must."}, {"review_sentiment": 4.0, "review_text": "Igsits"}, {"review_sentiment": 5.0, "review_text": "Any person with interest in the Puerto Rican case can not ignore this book. Even if you find you do not agree with certain conclusions, it is without a doubt a must read. It is an essential addition to any reading list or library related to Puerto Rico. Also, its style makes it ideal for the scholar who has already been introduced to Puerto Rico as well as to the novice who is just starting to read about it. Highly recommended."}]}, "authors": ["César J. Ayala", "Rafael Bernabe"], "isbn": "0807859540", "longitude": 0.0, "periods": ["1800s", "1900s", "2000s"], "title": "Puerto Rico in the American Century: A History Since 1898", "word_cloud": "buy supplement death read unbiased textbook offering excellent lesson european nation impact island economically socially politically many act explain fail mention directly affect colonize territory supplemental reference close familiar term author use colon hacendado etc african take month entire worth parent leave turn year old live next year grow gradually transform mythical paradise earth critical ever say parent return get involved politics protest saw family persecute result leave move permanently necessary explain impact focus political persecution family include provide part never learn academically now understand parent reason island first now true sense depth betrayal rican people suffer hand hand lackey current administration find realistically disturb say do never able completely free invader come age ten past year pr felt know much island informative learn many detail history know recommend anyone come child learn island specifically from millennium year comprehensive overview century excellent complement highly recommend detail summary event shape rican culture well politics economic reality understand graduate student igsits person interest case ignore even find agree certain conclusion doubt essential addition read list library relate also style make ideal scholar already introduce well novice start recommend", "genres": ["History", "Social & Cultural Studies", "Politics"], "summary": "Offering a comprehensive overview of Puerto Rico's history and evolution since the installation of U.S. rule, Cesar Ayala and Rafael Bernabe connect the island's economic, political, cultural, and social past. Puerto Rico in the American Century explores Puerto Ricans in the diaspora as well as the island residents, who experience an unusual and daily conundrum: they consider themselves a distinct people but are part of the American political system; they have U.S. citizenship but are not represented in the U.S. Congress; and they live on land that is neither independent nor part of the United States. \r\n\r\nHighlighting both well-known and forgotten figures from Puerto Rican history, Ayala and Bernabe discuss a wide range of topics, including literary and cultural debates and social and labor struggles that previous histories have neglected. Although the island's political economy remains dependent on the United States, the authors also discuss Puerto Rico's situation in light of world economies. Ayala and Bernabe argue that the inability of Puerto Rico to shake its colonial legacy reveals the limits of free-market capitalism, a break from which would require a renewal of the long tradition of labor and social activism in Puerto Rico in connection with similar currents in the United States. ", "asin": "0807859540", "rank": "966518", "city": "Puerto Rico", "image": "https://images-na.ssl-images-amazon.com/images/I/418ZniKxxGL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}