{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": -27.4689682, "ratings": {"num_ratings": 5, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "A delightful story of a lovable rogue. It's moving through both its ups & downs."}, {"review_sentiment": 5.0, "review_text": "I bought this for a neighbor having read it about 35 years ago. I enjoyed it immensely back then and it has stood the test of time. A Brissie boy makes good!"}, {"review_sentiment": 5.0, "review_text": "In less than two-hundred pages, Malouf manages to capture the coming-of-age angst of the entire Australian post-war generation. Only Malouf could be telling the story of two youths and, virtually on the same page, effortlessly synthesize the realities of Australian experience with European philosophical themes, and connect them both to the whole tangled mess of our national identity. And yet for all its efficiency and high intent, 'Johnno' still reads like an affectionate and deeply-felt memoir, never shying away from the emotional, physical and sexual confusion of youth, nor from the contradictions inherent in what it means to be an 'Australian man'. But that's the genius of Malouf, and it's something we find him doing again and again: telling an apparently simple story about ordinary people, yet with this richly poetic, philosophical undercurrent which can suddenly reach up and pull you under. For Australian readers, this is a particularly important skill. Not only does Malouf deal with significant human issues, but he brings them home. He takes them out of the realm of abstract philosophy and makes them implicit in this place.  This makes his work at once deeply personal and resolutely public in the best sense: he has something to share with all of us, something important, and he shares it beautifully."}, {"review_sentiment": 5.0, "review_text": "It took me a while to get through Johnno, despite its less than 200 pages, but I must say I thoroughly enjoyed each page.  The slowness was more a function of my available time than of the novel's quality.  Johnno is a little gem, a wonderful chronicling of a young man's coming of age, and his relationship with Johnno, a slightly troubled young man, in Brisbane right after World War II.  David Malouf is a wonderful writer.  Each sentence is a work of art--but nothing is too precious, too anything.  It's an enjoyable book that I highly recommend."}, {"review_sentiment": 5.0, "review_text": "I read this book in 1997, having avoided studying it a dozen years earlier in school.  Since leaving school I had inexplicably held out on reading what is regarded as the best work of fiction set in and about my home town of Brisbane.  Once I started reading I could not stop.  In amongst the  beautiful prose and vivid description lies Johnno, a character we all know,  love, loathe, and long for.An excellent book.  As it turns out I'm glad  I held out until I was old enough to really appreciate David Malouf's  style, which is rich, evocative and so very (tempted to say 'real', but  this is fiction) believable."}]}, "authors": ["David Malouf"], "isbn": "0807609056", "longitude": 153.0234991, "periods": ["1900s"], "title": "Johnno: A Novel", "word_cloud": "delightful story lovable rogue move ups down buy neighbor year ago enjoy immensely back stood test time boy make good le page manage capture angst entire australian generation only tell story youth virtually page effortlessly synthesize reality australian experience european philosophical theme connect whole tangle mess national identity yet efficiency high intent still read affectionate memoir never shy away emotional physical sexual confusion youth contradiction inherent mean man genius something find tell apparently simple story ordinary people yet richly poetic philosophical undercurrent suddenly reach pull australian reader particularly important skill not deal significant human issue bring home take realm abstract philosophy make implicit place make work deeply personal resolutely public best sense something share something important share beautifully take le page thoroughly enjoy slowness function available time quality little gem wonderful chronicling young man come age relationship slightly trouble young man right wonderful writer sentence work art nothing precious anything enjoyable highly recommend avoid study dozen year earlier school leave school inexplicably hold read regard best work fiction set home town start read among st beautiful prose vivid description lie character know loathe long excellent turn glad hold old enough really style rich evocative tempt say fiction believable", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "Johnno is a semi-autobiographical novel written by Australian author David Malouf and was first published in 1975. It was Malouf's first novel.\r\n\r\nIt is an evocation of an Australian boyhood and early adulthood during the 1940s and 1950s. It recreates the sleazy tropical half-city that was wartime Brisbane and captures a generation locked in combat with the elusive Australian dream. ", "asin": "0807609056", "rank": "6142307", "city": "Brisbane", "image": "https://images-na.ssl-images-amazon.com/images/I/51RJ0LAYG0L.jpg", "country": "Australia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}