{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 52.3727598, "ratings": {"num_ratings": 12, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "Too much undrerlining."}, {"review_sentiment": 5.0, "review_text": "Cees Noteboom is one of the two best Dutch writers, ranking among the most important writers of fiction of our era. \"Rituals\" is perhaps his finest work, the translator the best of all those who have translated Dutch. As in \"Notes from the Unground\" (better title: \"Cries from Under the Floor\") by Dostoyesky, it is comprised of two very different halves which form a complete unity at completion. A character study, an obsession, a revelation of a culture combine to raise issues of identity, familial, cultural, and ancestoral The pivotal ritual is of a Japanese Tea ceremony rare in practice and revaltory in this book which can be appreciated at many levels while leading to philosophical and moral contemplation. The story moves smoothly, naturally increasing in tension into a dramatic and surpising end which in retrospect is inevitable No one will leave this book without new insights, perspectives, and resonnating images, ideas, and questions which will linger and illuminate the novel on reflaction."}, {"review_sentiment": 5.0, "review_text": "The novel reads like a cross between Perec's Things & A Man Asleep and Camus' Outsider. Beautifully written and quite comical for those of similar headspace, the novel also has some outstanding passages destined to bring a smile to the faces of the (non-devotedly) 'discontent'. It is a wonderful picture of late 20th Century man and shines as true literature in a literary world populated by Houellebecq drivel."}, {"review_sentiment": 4.0, "review_text": "I don't really know what to think about this short novel.The three main characters seem to have such different lives.Inni Wintrop, a poor boy from a rich Catholic family, inherits from his aunt a substantial sum that should have rightfully gone to his father. This allows him to drift through life, investing in stocks and seducing women. The book is divided into sections so we are allowed to see Inni in his 30's almost commit suicide when his wife leaves him for an Italian magazine photographer. But we are also allowed to see Inni in his 20's seducing and seduced by a serving girl and then in his 40's seducing and seduced by a girl he meets in a city park over a dead dove. These casual sexual encounters, along with dialogue with learned friends and art dealers, and checking in with this stock brokers seem to make up the ritual of Inni's life. His one strength is that he is captive of only a few compulsions and he whereas he is no great humanitarian or egoist, he at least does not hate mankind as does Arnold Taads or hate himself as does Philip Taads.Arnold Taads is an outdoorsman, world traveler, skier, mountain climber, philosopher, and hater of his fellow human beings. Though he twice refers to Spinoza, Taads' can not be said to follow Spinoza's philosophy. Taads has made nature his God and thus humanity becomes Evil. His dislike for humanity thus infects his own self perception and he eventually dies of exposure to snow, which appears to really be a suicide. Arnold seems obsessed with time and schedule, organizing his life around his physical and intellectual activities and his dog rather than human interactions.Then, 20 years later, we are introduced to an Indonesian man who is Arnold Taat's son with an Indonesian woman. Phillip Taats also has removed himself from humanity, exploring the contemplative life of a Zen monk in his barren apartment. Phillip has studied the great raku artists who developed vessels for the tea ceremony. He eventually buys a rare and beautiful vessel and performs a tea ceremony for his friend who owns an Asian antiquity gallery and for Immi. We then learn that Philip has committed suicide by drowning himself. When Bernard Roozenboom and Immi Wintrop enter his apartment, they find the vessel has been shattered.What in the world does all this mean, you may ask? For me this small parable has to do with connectedness to the human condition and the search for meaning. Both Arnold and Philip have divorced themselves from human interaction and particularly human commitment. They seek meaning in solitude, God exists in nature and esthetics but not in the human condition (where I personally think God resides).Well then, who is Immi?  He is a driftless soul with no external reason for existance other than to make love to women and spend his inheritance, yet he has one charm, one grace, one protection against the void - Immi is open to possibility and relationship. He hangs by a thread but he still survives."}, {"review_sentiment": 2.0, "review_text": "Unfortunately, there are many writers who have talent, but no subject to write about. So they turn to fashionable fads and the emptiness of life to create stories so absurd and pointless that the reader (unless he or she shares that same emptiness) leaves out totally... well, empty. The only reason I'm giving this book two stars is because, as I said, Noteboom can write, and because there are several clever and even bright sentences in the book. The subject seems to be the Death of God in modern life, and it is an interesting one, only the author should have written a philosophical essay instead of a narrative.Inni Wintrop is a lonely man totally estranged from his family. One day an aunt arrives and introduces him to an ex-lover, a man also estranged from his family and from the world. This man has a very cheap, infantile, Greenpeace-like anti-human environmental \"philosophy\". This man has replaced God with Nature and a neurotical daily schedule. Years later, Inni meets the man's son,  an Indonesian who pathetically follows each and every oriental New Age philosophy (until he commits suicide).In the first chapter, entitled \"Interlude\", the author tells us the story of how Inni lost his wife, because he got to bed with other women and never paid any attention to her (strange, so, that she leaves him).That's the book, disconnected clever musings about how God doesn't exist and how lonely we are in this cold world. No character is deep or likable in the least, there is no plot nor conflict nor anything but the repulsive contemplation of people with nothing to do but gaze at their navels and look for stupid rituals to supplant God. None of them even have real jobs."}, {"review_sentiment": 5.0, "review_text": "This book gives you something to chew on on every level. The prose is good, (the English translation can not capture some of the idiosyncrasies of Dutch, but is very good overall) right from its opening sentence \"The day Inni Wintrop committed suicide, Philips shares stood ...\" All of the characters in the book are memorable and wonderfully sketched. (As an introverted person, I'm always amused by the walk through the woods scene. Taats asks Inni a question which spurs a two-page train of thought, but he answers only in a mono-syllable.) And it goes up to the structure of the book: the first of the 3 parts is called \"Intermezzo\". Plenty of ideas here."}, {"review_sentiment": 5.0, "review_text": "This book is also in my top five books of all time.  I did a search under the keyword \"rituals\" and it did not pop up (I had to find it a backwards way), and I had a moment of profound sadness thinking that this  most wonderful book could be out of print. \"Rituals\" truly does  inspire me.  I haven't read it in four years, but it still is one of the  best books I've ever read.  I loved the intoxication of love and the  meaning of life search of the main character.  What can induce you to get  off of the floor and live?  I've wondered that many times in my life, and  Inni (the main character) explores what REALLY matters - if anything.  It's  not to say that this book is a dour questing life meaning book - rather it  is a rich, bravado, humorous, cleansing book that has many many rewards.  The part of this book that I often think about (and I hope this wouldn't be  a spoiler) is the correlation of Inni's mad, chaotic city (Amsterdam if I  remember correctly) with monks in Japan.  Very funny and important book.  I  almost feel akin to all the other reviewers who have read this as if we're  in a special club."}, {"review_sentiment": 5.0, "review_text": "This small splendid book is full of ideas. Which is the main one? What is this novel about? A Bildungsroman.An import of human sexuality. An up-to-date evolution of Nietzsche's concept of \"the death of  God\". A fate of art in modern  society. A trip through time - the  fifties, sixties, seventies... Confronted with soullessness of official  religion Inni Wintrop, a protagonist of the book, Arnold and Philip Taads,  two other main characters of the novel, lost their belief in God, but in  cold emptiness and animosity of godless world they created their own  rituals. Arnold Taads designed a ritual of strict time regulations of  loneliness where even his former lover was not permitted to come in when  she  had appeared ten minutes before appointed time. Philip Taads turned to  Japanese cults \"stemmed from a culture and a tradition that were not  his and could never become his\". He devised his own East considering  the real Japan a spoiled one. They both started with dislike to the milieu  which inevitably turned into hatred pointed towards the whole world  including themselves. These self-made rituals helped them only in one  occassion - to commit suicides in conspicious but rather stagy style. For  Inni Wintrop women became his religion. In incessant love-making he lost  something very important that makes Love. His sexual promiscuous rituals  destroyed his marriage and put him on the verge of death in unsuccessful  suicide. The tragic fate of Arnold and Philip Taads, his own meaningless  life showed Inni fallaciousness of universal hatred but he still have no  answers to the crucial questions of human existence in godless world. I  recommend this book to everyone - the beautiful and sad novel of wise Dutch  author Cees Nooteboom."}, {"review_sentiment": 5.0, "review_text": "This small splendid book is full of ideas. Which is the main one? What is this novel about? A Bildungsroman. An import of human sexuality. An up-to-date evolution of Nietzsche's concept of \"the death of God\". A fate of art in modern society. A trip through time - the fifties, sixties, seventies... Confronted with soullessness of official religion Inni Wintrop, a protagonist of the book, Arnold and Philip Taads, two other main characters of the novel, lost their belief in God, but in cold emptiness and animosity of godless world they created their own rituals. Arnold Taads designed a ritual of strict time regulations of loneliness where even his former lover was not permitted to come in when she had appeared ten minutes before appointed time. Philip Taads turned to Japanese cults \"stemmed from a culture and a tradition that were not his and could never become his\". He devised his own East considering the real Japan a spoiled one. They both started with dislike to the milieu which inevitably turned into hatred pointed towards the whole world including themselves. This self-made rituals helped them only in one occasion - to commit suicides in conspicuous but rather stagy style. For Inni Wintrop women became his religion. In incessant love-making he lost something very important that makes Love. His sexual promiscuous rituals destroyed his marriage and put him on the verge of death in unsuccessful suicide. The tragic fate of Arnold and Philip Taads, his own meaningless life showed Inni fallaciousness of universal hatred but he still had no answers to the crucial questions of human existence in godless world. I recommend this book to everyone - the beautiful and sad novel of wise Dutch author Cees Nooteboom."}, {"review_sentiment": 5.0, "review_text": "I first heard of this book on the happyrobot.net site.  This wonderful book starts with a selfish but valid love and ends with understanding of the world.  I absolutely count this book in my favorites.  I love the  imagery, the setting, everything. My very favorite image that I retained is  that of the buddhist monk juxtaposed with modern Amsterdam.  Sheer beauty."}]}, "authors": ["Cees Nooteboom"], "isbn": "0807110817", "longitude": 4.8936041, "periods": ["1900s"], "title": "Rituals", "word_cloud": "too much underlining cere best dutch writer rank important writer fiction era perhaps finest work translator best translated dutch note better title comprise different half form complete unity completion character study obsession revelation culture combine raise issue identity familial cultural pivotal ritual japanese ceremony rare practice revaltory appreciate many level lead philosophical moral contemplation story move smoothly naturally increase tension dramatic surprise end retrospect inevitable one leave new insight perspectives resonate image idea question linger illuminate reflation read cross things write quite comical similar head space also outstanding passage destine bring smile face wonderful picture late man shin true literature literary world populate drivel really know think short main character seem different poor boy rich family inherits aunt substantial sum rightfully go father allow drift life invest stock seduce woman divided section allow almost commit suicide wife leave italian magazine photographer also allow seduce seduce serve girl seduce seduce girl meet city park dead casual sexual encounter dialogue learn friend art dealer check stock broker seem make ritual life strength captive compulsion whereas great humanitarian egoist least hate mankind outdoors man world traveler skier mountain climber philosopher hater fellow human being twice refers say follow philosophy make nature thus humanity become dislike humanity thus infect self perception eventually die exposure snow appear really suicide seem obsessed time schedule organize life around physical intellectual activity dog rather human year later introduce indonesian man son woman also remove humanity explore contemplative life monk barren apartment study great rake artist develop vessel tea ceremony eventually buy rare beautiful vessel performs tea ceremony friend own asian antiquity gallery learn commit suicide drown apartment vessel world mean small parable connectedness human condition search mean divorce human interaction particularly human commitment seek mean solitude exist nature aesthetic human condition personally think reside drift less soul external reason existence make love woman spend inheritance yet charm grace protection void open possibility relationship hang thread still survive unfortunately many writer talent subject write turn fashionable fad emptiness life create story absurd pointless share emptiness leave totally well reason give star say write several clever even bright sentence subject seem modern life interest author write philosophical essay instead lonely man totally estrange family day aunt arrive introduces man also estrange family world man cheap infantile environmental philosophy man replace neurotically daily schedule year later meet man son pathetically follow oriental philosophy commits suicide first chapter entitle author tell story lose wife get bed woman never pay attention strange leave disconnect clever musing exist lonely cold world character deep likable least plot conflict anything repulsive contemplation people nothing gaze navel look stupid supplant even real job give something chew level prose good translation capture idiosyncrasy dutch good overall right opening sentence day commit suicide share stand character memorable wonderfully sketch introverted person always amuse walk wood scene ask question spur train thought answer go structure first part call idea also top time search keyword pop find backwards way moment profound sadness think wonderful truly inspire year still best ever love intoxication love mean life search main character induce floor live wonder many time life main character explores matter anything say dour quest life mean rather rich bravado humorous cleanse many many reward part often think hope correlation mad chaotic city remember correctly monk funny important almost feel akin reviewer special club small splendid full idea main import human sexuality evolution concept death fate art modern society trip time fifty sixty seventy soullessness official religion protagonist main character lose belief cold emptiness animosity godless world create design ritual strict time regulation loneliness even former lover permit come appear ten minute appoint time turn japanese cult stem culture tradition never devise consider real spoil start dislike milieu inevitably turn hatred pointed towards whole world include help occasion commit suicides conspicuous rather stagy style woman become religion incessant lose something important make sexual promiscuous destroy marriage put verge death unsuccessful suicide tragic fate meaningless life show salaciousness universal hatred still answer crucial question human existence godless world recommend everyone beautiful sad wise author small splendid full idea main import human sexuality evolution concept death fate art modern society trip time fifty sixty seventy soullessness official religion protagonist main character lose belief cold emptiness animosity godless world create design ritual strict time regulation loneliness even former lover permit come appear ten minute appoint time turn japanese cult stem culture tradition never devise consider real spoil start dislike milieu inevitably turn hatred pointed towards whole world include help occasion commit suicides conspicuous rather stagy style woman become religion incessant lose something important make sexual promiscuous destroy marriage put verge death unsuccessful suicide tragic fate meaningless life show salaciousness universal hatred still answer crucial question human existence godless world recommend everyone beautiful sad wise author first hear site wonderful start selfish valid love end understanding world absolutely count favorite love imagery set everything favorite image retain buddhist monk juxtapose modern beauty", "genres": ["Fiction & Literature"], "summary": "A man of independent means oddly suited to survival amid the chaos of modern life, Inni Wintrop is a committed dabbler, content to casually wander the streets of Amsterdam, follow the dips and rises of the stock exchange and commodities market, speculate in art and love, and write a newspaper horoscope column. But his inconsistencies are interrupted when he meets two men who are the epitome of order and regulation.", "asin": "0807110817", "rank": "2101933", "city": "Amsterdam", "image": "https://images-na.ssl-images-amazon.com/images/I/11BDGHD1Z8L.jpg", "country": "The Netherlands", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}