{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 69, "rating": 4.7, "reviews": [{"review_sentiment": 3.0, "review_text": "The substance of this book deserves 5 stars or a bit more; my review and star-rating are specifically about the 2015 complete edition translated by Richard Howard and Annette Lavers (H&L;).I first read this book in French more than 35 years ago, in my 20s. My French wasn't so good, and my progress was slow, but the book nonetheless struck me as funny and wonderfully off-kilter. The prose style was playful, but also clear. It didn't hurt that the historical era Barthes was talking about wasn't so far removed from my own awareness (I was born during the period when the articles were written). His way of looking at everything precisely, but from an unorthodox perspective and with a sense of ironic humor, had a deep influence on my own writing when I started writing a magazine column a few decades later. More recently, it's also influenced my teaching.I came to this translation thinking of assigning some essays as reading for college students in a business program. It didn't take long to ditch that idea: this translation would make it too tough for most of them to share my enthusiasm. The historical distance of the subject matter wasn't the problem -- some annotations and illustrations could help with that. In fact, one of the benefits of this edition is a small insert of illustrations to help the 21st Century reader visualize what Barthes was writing about. Many essays also have a short introductory footnote on their first page, providing historical context. The real problem is with the tone of the translation -- it makes Barthes sound insufferably pretentious and fussy. If you've ever been to a university party where some middle-aged professor is getting carried away with the sound of his own voice, it's a bit like that. If I'd begun with this version instead of the original, I'm sure I'd have gotten impatient with it about a third of the way through.Given how shaky my French was when I read the book the first time, I wondered whether maybe this translation captured the essence of Barthes, to which I'd been insensitive earlier. I've read a lot more French since then, including some dull and pretentious stuff. But when I checked now, Barthes still isn't that. Despite occasional flourishes (but precise ones), his vocabulary is mostly pretty clear -- which is how I managed to make it all the way through so many years ago. His sentences are long and full of clauses, but they have a rhythm lacking here.One particular issue I noticed from a random comparison is that the translators often distort the syntax that gave structure and poise to the French original. Here is an example from one of the more political essays, \"The Cruise of the 'Batory',\" contrasting the magazine Le Figaro's coverage of a 1955 French cruise taking tourists to visit the USSR with that of the refusal of some French soldiers to fight in Algeria. According to the magazine, the cruise had given the Russians a glimpse of a sort of cheerful anarchy and individualism among the disorderly French. Barthes's original essay ends as follows:« Lorsque quatre cents rappelés de l’armée de l’Air ont refusé, un dimanche, de partir pour l’Afrique de Nord, _Le Figaro_ n’ a plus parlé d’anarchie sympathique et d’individualisme enviable : comme il ne s’agissait plus ici de musée ou de métro, mais bien de gros sous coloniaux, le “désordre” n’était plus, tout d’un coup, le fait d’une glorieuse vertu gauloise, mais le produit artificiel de quelques “meneurs” ; ile n’était plus prestigieux mais _lamentable_, et la _monumentale indiscipline_ des Français, louée tout a l’heure de clins d’oeil loustics et vaniteux, est devenue sur la route d’Algerie, trahison honteuse. _Le Figaro_ connait bien sa bourgeoisie: la liberté en vitrine, à titre décoratif, mais l’Ordre chex soi, à titre constitutif. »Here is the translation in this edition:“When four hundred Air Force veterans, called up for North African service, refused to serve one Sunday, _Le Figaro_ no longer spoke of the sympathetic anarchy and enviable individualism of the French: no longer any question here of museum or metro, but rather of colonial investments and big money; whereupon ‘disorder’ was no longer the phenomenon of a glorious Gallic virtue but the artificial product of a few ‘agents’; it was no longer glamorous but _lamentable_ and the _monumental lack of discipline_ of the French, formerly praised with so many waggish and self-satisfied winks, has become, on the road to Algeria, a shameful treason. _Le Figaro_ knows its bourgeoisie: freedom out front, on display, but Order back home, a constitutive necessity.” (@148)A few observations about this translation:(a) In the first sentence of the passage Barthes strings together three sentences into one - but each clause is a complete sentence. One translation strategy might have been to punctuate the passage differently as two or three distinct sentences. Instead H&L; retain the one-sentence structure but make the flow choppier by subdividing into into four chained clauses, including two sentence fragments (“no longer any question here …” and “whereupon…”). In doing so, they also make it hard for the reader to see the causal relationship between the topics of those two fragments. Compare a translation of Barthes’s middle clause roughly as follows: “as it was no longer a matter of museum or metro, but of big colonial bucks, ‘disorder’ suddenly wasn’t the result of a glorious Gallic virtue but the manufactured product of a few ‘agents’”.(b) H&L; insert formal and lengthy words where they weren’t present in the original: e.g., “whereupon” rather than “suddenly” for ‘tout a l’heure,’ “a constitutive necessity” for the adjective ‘constitutif,’ “phenomenon” rather than “result” for ‘fait,’ and “colonial investments and big money” for the intentionally coarse ‘gros sous coloniaux’ (as in “big colonial bucks,” “colonial big money” or something similar).(c) In the last sentence, H&L; erase Barthes’s balanced contrast of freedom and order as reflected in the parallel syntax of the concluding clauses. They also downplay his irony by omitting the adverb “bien” (‘well’), and ignoring the bourgeois resonances of “vitrine,” connoting a shop window.  Something closer to the sense of Barthes’s last sentence might be: “_Le Figaro_ knows its bourgeoisie well: freedom on display in the shop window, as decoration, but Order at home, as foundation.”All in all, the translators’ choices make Barthes seem much more pompous and distant from the reader than he really was; and in passages like the one just quoted, they also downplay his political engagement.Many reviewers here on Amazon managed to enjoy this book despite the problems I've described. If you don't read French, don't let my review discourage you from picking up this book. But if you get frustrated with it, please remember that in the original it's a much more elegant, humorous and brilliant read than comes across from this version."}, {"review_sentiment": 5.0, "review_text": "such a fun book to read. its a little weird at first but as I started to look into the different reasons why he wrote about certain topics it really made me think and have some interesting convos with people."}, {"review_sentiment": 5.0, "review_text": "\"For the very end of myths is to immobilize the world: they must suggest and mimic a universal order which has fixated once and for all the hierarchy of possessions. Thus, everyday and everywhere, man is stopped by myths, referred by them to this motionless prototype which lives in his place, stifles him in the manner of a huge internal parasite, and assigns to his activity the narrow limits within which he is allowed to suffer without upsetting the world: bourgeois pseudophysis is in the fullest sense a prohibition for man against inventing himself.\" - *Mythologies*, \"Myth Today\"Roland Barthes is one of the legendary figures of 20th century intellectualism, but his early *Mythologies* was until recently not much more than a legend to English readers. The book consists of fifty-three short essays on the \"material culture\" of 50s France and the structure of its interpretation in the French media, with a long \"theoretical\" essay, \"Myth Today\", appended. When the original English translation came out in 1972, nearly half of the short pieces were expurged. This was at the beginning of the \"theory\" craze in English-speaking countries, and it might have been felt that essays on already-dated aspects of French life might stifle appreciation of Barthes' semiological pronunciamentos. The decision by Hill and Wang to present the entire work in a new translation is to be deeply appreciated; Barthes distinguishes himself from other \"foggy froggies\" in the exquisite pointillism of his writing on topics as mundane as detergent or plastic.Really, at this stage of his career Barthes resembled nobody outside *l'Hexagone* more than Adorno, and even does the dismal German one better in a political pungency visible on every other page: in 1957 France was in the process of being divested of its colonies, and confronted domestically with one M. Poujade, a know-nothing political populist trying to rally small businessmen against 'the swamp'. (Barthes was clearly not beholden to a \"party line\" but he came up with many good lines himself; \"politically committed\" people who have reflexively dismissed him as an effete aesthete have to see what he does with the material of everyday oppression which Althusser handled far more \"mechanically\".) Furthermore, those who bemoan Criticism Today have not much to blame him for, as any time 'high culture' comes up in the book it is handled in a supernaturally deft manner. For. every. single. literato."}, {"review_sentiment": 5.0, "review_text": "Where has he been all my life?  Wow!"}, {"review_sentiment": 5.0, "review_text": "Camera Lucida was the first thing I read by Barthes and that was a long time ago. Got through it but I don't remember it being fun. \"Mythologies\" is a different story, short essays on a variety of topics and how those topics are mythologised. It's really fun and at times enternatining, also still very relevant."}, {"review_sentiment": 5.0, "review_text": "With a minimum of words, Barthes illuminates politics, cuisine -- indeed ourselves -- to the reader. His writing is commanding yet accessible. A wonderful place to start with this great mind."}, {"review_sentiment": 5.0, "review_text": "necessity"}, {"review_sentiment": 5.0, "review_text": "Amazing author. This book opened my mind to a new style of writing, while drastically improving my own. Very sophisticated."}, {"review_sentiment": 5.0, "review_text": "Excellent book. Package arrived in great shape. Many thanks!"}, {"review_sentiment": 5.0, "review_text": "Fast shipping and great product!"}]}, "authors": ["Roland Barthes"], "isbn": "0809071940", "longitude": 2.3514992, "periods": ["1900s"], "title": "Mythologies", "word_cloud": "substance deserve star bit review specifically complete edition translate first french year good progress slow nonetheless strike funny wonderfully prose style playful also clear hurt historical era talk far remove awareness bear period article write way look everything precisely unorthodox perspective sense ironic humor deep influence write start write magazine column decade later more recently also influence come translation think assign essay read college student business program long ditch idea translation tough share enthusiasm historical distance subject matter problem annotation illustration fact benefit edition small insert illustration help write essay also short introductory footnote first page provide historical context real problem tone translation make sound insufferably pretentious fussy ever university party professor get carry away sound voice bit begin version instead original sure get impatient third way shaky french first time wonder maybe translation capture essence insensitive earlier lot french include dull pretentious stuff check still occasional flourish precise one vocabulary mostly pretty clear manage way many year sentence long full clause rhythm lack particular issue notice random comparison translator often distort syntax give structure poise french original here example political essay contrast magazine coverage french cruise take tourist visit refusal french soldier fight accord magazine cruise give glimpse sort cheerful anarchy individualism disorderly french original essay end follow quatre cent rappel un dimanche l parlor anarchic sympathique individualism enviable comm il ne agissait is sou colonial le désordre n un coup le fiat rune glorious vert gauloise maid le product artificial queue meneurs lie n prestigious maid et la eds louse tout l here clinch oil acoustic et vaniteux est revenue sir route trahison chanteuse contain bin sa bourgeoisie la l sex sou tire constitutif here translation edition hundred veteran call north service refuse longer speak sympathetic anarchy enviable individualism longer question museum metro rather colonial investment big money whereupon disorder longer phenomenon glorious virtue artificial product agent longer glamorous lack french formerly praise many waggish wink become road shameful treason know bourgeoisie freedom front display back home constitutive observation translation first sentence passage string together sentence clause complete sentence translation strategy passage differently distinct sentence instead retain structure make flow choppier subdivide chained clause include sentence fragment longer question also hard see causal relationship topic fragment translation middle clause roughly follow longer matter museum metro big colonial buck disorder suddenly result glorious virtue manufacture product agent b insert formal lengthy word present original whereupon rather suddenly l here constitutive necessity adjective constitutif phenomenon rather result fiat colonial investment big money intentionally coarse gross sou colonial big colonial buck colonial big money something similar c last sentence erase balance contrast freedom order reflect parallel syntax conclude clause also downplay irony omit adverb bin well ignore bourgeois resonance vitrine connote shop window closer sense last sentence bourgeoisie well freedom display shop window decoration home translator choice make seem much pompous distant really passages quote also political reviewer amazon manage enjoy problem describe french let pick frustrated please original much elegant humorous brilliant come version fun little weird first start look different reason write certain topic really make think interesting convoy people end myth immobilize world mimic universal order fixate hierarchy possession thus everyday everywhere man stop myth refer motionless prototype live place stifle manner huge internal parasite assigns activity narrow limit allow suffer upsetting world bourgeois pseudophysis fullest sense prohibition man invent legendary figure century intellectualism early recently much legend english reader consists short essay material culture structure interpretation french medium long theoretical essay append original english translation come nearly half short piece expunge beginning theory craze country essay aspect french life appreciation semiological pronunciamentos decision present entire work new translation deeply appreciated distinguishes foggy froggings exquisite pointillism write topic mundane detergent stage career resemble nobody even dismal better political pungency visible page process divest colony confront domestically political populist try rally small businessmen swamp clearly behold party line come many good line politically commit people reflexively dismiss effete aesthete see material everyday oppression handle far mechanically bemoan much blame time culture come handle supernaturally deft manner single literati life camera first thing long time remember fun different story short essay variety topic topic mythologize really fun time entertain also still relevant minimum word illuminate politics cuisine indeed write command yet accessible wonderful place start great mind necessity amaze author open mind new style write drastically improve very sophisticated excellent arrive great shape many thanks fast ship great product", "genres": ["Essay", "Politics"], "summary": "\"No denunciation without its proper instrument of close analysis,\" Roland Barthes wrote in his preface to Mythologies. There is no more proper instrument of analysis of our contemporary myths than this book―one of the most significant works in French theory, and one that has transformed the way readers and philosophers view the world around them.\r\n\r\nOur age is a triumph of codification. We own devices that bring the world to the command of our fingertips. We have access to boundless information and prodigious quantities of stuff. We decide to like or not, to believe or not, to buy or not. We pick and choose. We think we are free. Yet all around us, in pop culture, politics, mainstream media, and advertising, there are codes and symbols that govern our choices. They are the fabrications of consumer society. They express myths of success, well-being, or happiness. As Barthes sees it, these myths must be carefully deciphered, and debunked.\r\n\r\nWhat Barthes discerned in mass media, the fashion of plastic, and the politics of postcolonial France applies with equal force to today's social networks, the iPhone, and the images of 9/11. This new edition of Mythologies, complete and beautifully rendered by the Pulitzer Prize–winning poet, critic, and translator Richard Howard, is a consecration of Barthes's classic―a lesson in clairvoyance that is more relevant now than ever.", "asin": "0809071940", "rank": "22520", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51%2B0ANBVQQL.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}