{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 18.4801972, "ratings": {"num_ratings": 45, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "This book is several years old now, but is still the best history of the Dominican - Haitian divide."}, {"review_sentiment": 4.0, "review_text": "Interesting book about the history of race religions between Haiti / dr"}, {"review_sentiment": 5.0, "review_text": "East vs West---Or a real life Westside story. The author did a superb job enhancing the two countries history as well as explaining how one country relied on the other for goods and services....Her background warrants why she writes so well on such a niche subject, a minuscule island with two countries.  Michele used the strength of the Cock, to represent the many. She enhances the metaphor of cockfights to allow us the reader to see how societies still love to show power over another, a Machiavellian style still alive today. The ring, is the battle field. Like the Romans, the cocks wage war against another civilization. She also brings to the top the city of New York--How three countries forge into one. A terrific book, on a topic I was very unfamiliar with."}, {"review_sentiment": 5.0, "review_text": "Very informative and clearly written"}, {"review_sentiment": 5.0, "review_text": "Excellent! Well written account of the \"original sin\" (slavery) and its consequences on those two countries with two cultures/two histories (Spanish and French/African) bound together by geography - one island. Unfortunately, these two peoples are bound in a never ending struggle to change  the unchangeable - geography.I wonder if Bartolome de las Casas, the Spanish Catholic Priest who brought in the Africans to the Hispaniola as slaves to \"save\" the original inhabitants, the Tainos, anticipated the mess he created."}, {"review_sentiment": 5.0, "review_text": "Eye opening. I always wondered why Dominicans were so ashamed of their African Ancestry. Ty for showing the complexity. I think they are a bunch of nationalist crybabies."}, {"review_sentiment": 5.0, "review_text": "This insightful book serves as my Cliff Notes for the history and issues of Hispaniola.  Understanding Haiti and the Dominican Republic is no easy task, but Michele has made the topic accessible and comprehensible."}, {"review_sentiment": 4.0, "review_text": "The book arrived ahead of schedule and with only minimal signs of wear, including occasional highlighter marks. It was an excellent value!"}, {"review_sentiment": 2.0, "review_text": "Slow read, informative"}, {"review_sentiment": 4.0, "review_text": "Great read and great insight.  The history of the island of Hispaniola is incredibly complex.  I appreciate the writer's non-biased approach to the story.  Definitely recommend."}]}, "authors": ["Michele Wucker"], "isbn": "0809097133", "longitude": -69.942111, "periods": ["2000s"], "title": "Why the Cocks Fight: Dominicans, Haitians, and the Struggle for Hispaniola", "word_cloud": "several year old still best history divide interest history race religion rd v real life story author superb job enhance country history well explain country rely good service background warrant write well niche subject minuscule island country use strength represent many enhance metaphor cockfight allow society still show power machiavellian style still alive today ring battle field wage war civilization also bring top city country forge terrific topic unfamiliar very informative clearly write write account original sin slavery consequence country history spanish together geography island unfortunately people never end change unchangeable wonder bring slave save original inhabitant anticipate mess create opening always wonder ashamed african show complexity think bunch nationalist crybaby insightful serve cliff history issue easy task make topic accessible comprehensible arrived ahead schedule minimal sign include occasional highlighter mark excellent value informative great insight history island incredibly complex appreciate writer approach story recommend", "genres": ["History", "Social & Cultural Studies"], "summary": "Like two roosters in a fighting arena, Haiti and the Dominican Republic are encircled by barriers of geography and poverty. They co-inhabit the Caribbean island of Hispaniola, but their histories are as deeply divided as their cultures: one French-speaking and black, one Spanish-speaking and mulatto. Yet, despite their antagonism, the two countries share a national symbol in the rooster--and a fundamental activity and favorite sport in the cockfight. In this book, Michele Wucker asks: \"If the symbols that dominate a culture accurately express a nation's character, what kind of a country draws so heavily on images of cockfighting and roosters, birds bred to be aggressive? What does it mean when not one but two countries that are neighbors choose these symbols? Why do the cocks fight, and why do humans watch and glorify them?\"\r\n\r\nWucker studies the cockfight ritual in considerable detail, focusing as much on the customs and histories of these two nations as on their contemporary lifestyles and politics. Her well-cited and comprehensive volume also explores the relations of each nation toward the United States, which twice invaded both Haiti (in 1915 and 1994) and the Dominican Republic (in 1916 and 1965) during the twentieth century. Just as the owners of gamecocks contrive battles between their birds as a way of playing out human conflicts, Wucker argues, Haitian and Dominican leaders often stir up nationalist disputes and exaggerate their cultural and racial differences as a way of deflecting other kinds of turmoil. Thus Why the Cocks Fight highlights the factors in Caribbean history that still affect Hispaniola today, including the often contradictory policies of the U.S.\r\n\r\n“A complex exploration of the cultural divide between Haiti and the Dominican Republic. Wucker . . . weaves together five centuries of tragic conflict with a subtle picture of the island today.” The New York Times Book Review", "asin": "0809097133", "rank": "348136", "city": "Santo Domingo", "image": "https://images-na.ssl-images-amazon.com/images/I/51OwUy2GkvL.jpg", "country": "D.R.", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}