{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 13, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "If you know anything about Mendelssohn he was indeed born a Jew but his father converted his family to the Lutheran faith early in Mendelssohn's life. His grave is marked by a Christian cross. Is this confusion part of the story?"}, {"review_sentiment": 3.0, "review_text": "Jiri Weil, a concentration camp survivor and a former Communist, was a well known writer in Central Europe post war. “Mendelssohn Is On The Roof,” copyrighted after his death in 1959 and translated to English in 1991, is a series of fictional intertwined cameos of life under the Nazis for Jews and Czechs in Prague and Czechoslovakia during the Nazi occupation from 1938 through 1942.The title derives from a half comedic attempt by Germany’s Reich Protestor, Reinhold Heydrich, to have the musically challenged municipal workers of Prague remove the part Jewish composer Felix Mendelsssohn’s statue from the roof of the then newly named “German House of Art.” While Heydrich’s assassination in May 1942 is played out in vivid detail, this short book is about the iron-fisted control the Nazi occupation apparatus held over the Czechs and the Jews of Prague in managing their “terminal” existence, the seizure and theft of Jewish property, the failed attempts at disguise and artifice,  and,  the deception of collaboration with the SS or Gestapo.The writing is poetic and poignant but the story wanders at times ending as always in stories like these in deep sadness at the consuming reality of this evil."}, {"review_sentiment": 5.0, "review_text": "Jiri Weil was a prominent Czech writer.  He was Jewish and had been a Communist although his critical writings about life in Soviet Russia during the 1930s caused him to fall out of favor with the Party.  Aware of the dangers he as a high profile  individual would face  in Nazi occupied Prague, he went into hiding and survived WWII.  He could only have done so with courageous friends risking their lives to support and protect him.  As a result he would have been very familiar with the horrors of daily life in his homeland and the stories he has written for this slim volume reflect that reality in powerful ways.  Weil uses various techniques to capture the many different ways in which the Nazis stamped the new order on the former Czechoslovakia and what it meant for ordinary people, Jewish and gentile. He captures both the banality and sadism of the inner workings of the final solution using various techniques including satire to convey its all embracing complexity and brutality.  The result is both moving and memorable."}, {"review_sentiment": 3.0, "review_text": "This book was mentioned in HHhH (which I thoroughly enjoyed) and deals with the Nazi \"protectorate\" of Czechoslovakia.  In order to make his point on how the occupation affected a variety of people,  the author introduces many characters who are only slightly related to each other.  Yes, it was a terrible time, but I think a novel should create more involvement with the characters and their lives."}, {"review_sentiment": 5.0, "review_text": "I really didn't like the author's other book, and so I hesitated to try this one, but I figured, what the heck, the title's great, let's give it a go. I'm really glad I did! I think this book gets a great feel for the atmosphere of chaos, uncertainty and fear in the Holocaust, and you see the lives of the characters (there are a lot of them, many of them not connected to each other) spin around each other and occasionally intersect, and you hold your breath as each person's story comes to its inevitable ending. In this way the book reminded me a lot of the wonderful Every Man Dies Alone.The only fault I find is that I had a hard time keeping track of all those many characters, and sometimes when their stories would be dropped for awhile and then picked up again, I would have forgotten what was going on before. But it didn't bother me too much."}, {"review_sentiment": 5.0, "review_text": "The novel begins in Nazi-occupied Prague, soon after the invasion of Russia.  There are the nine months when \"the Butcher of Prague\", Reinhardt Heydrich, as Deputy Reich Protector of Bohemia and Moravia, ruled with naked terror.  He saw Bohemia as an ancient German land, had utter contempt for the Czechs and was one of the main architects of the \"Final Solution\": the Jews were already herded into ghettoes; Theresienstadt had already been turned into a holding area from which many Jews were sent to the gas chambers of Auschwitz.  Weil has Heydrich regret that in his present position he could only organize the liquidation of the Jews instead of being able, as before, to participate personally in the violence.  After Heydrich was assassinated, the terror intensified even more.The book portrays the brutality and bureaucracy of the regime; the infighting within the different Nazi authorities; how the Nazis terrify each other almost as much as they terrify the people of Prague, as when an order given by Heydrich could not be immediately carried out.  One of these orders had been to remove the statue of Mendelssohn from the roof of the Prague Academy of Music when none of his underlings knew which of the many statues was that of Mendelssohn.  Such situations are farcical; but we are left in no doubt that there was never anything funny in the outcome, as we follow the precarious lives of several Jews and Czechs.  Many have perforce to collaborate with the Germans and even take some pride in it; others reproach themselves bitterly; a few courageously engage in resistance.  As the book progresses, it becomes darker and darker as the farcical elements are left behind.  We move to Theresienstadt, where the Germans forced Jews to select other Jews to do terrible things to yet other Jews.  And the suffering, there and in Prague, continues right up to the time, in the last pages, when the Soviets drive the Germans out of Czechoslovakia.  Some of the Nazis' victims had gone to their deaths bravely, knowing that, though they would not live to see it, the Germans would surely be defeated.Weil wrote not only as a Jew, but also as a lover of Czechoslovakia."}, {"review_sentiment": 5.0, "review_text": "\"Mendelssohn is On the Roof\" is a worthwhile read that follows the lives of persons (young and old, male and female on both 'sides' of the conflict) impacted by the Nazi 'invasion' of Prague and the country. At times, it is a 'danse macabre' as individuals endeavour to lead 'normal' lives under Nazi occupation. But, ever and always, death hovers about the people - we, the reader, can never shake this reality, and neither can the people whose lives we follow. At times, it is somewhat confusing in what 'locale' the story is taking place. However, this is a story that is well worth the effort it takes to read it. The reader will be moved by the poignancy of the people's struggle and, ultimately, by their resolve to not lose hope even in the face of death."}, {"review_sentiment": 4.0, "review_text": "The main problem with this work is the confusing nature of the storyline. Weil clearly has the grandest of ambitions, and it is obvious that he is a capable, strong writer. The ideas for a remarkable story are certainly there, as is the character development - from the Jewish families, Nazi officials, and Czech citizens. The subtle nuances of each individual struggling to survive in Nazi-occupied Prague bring striking humanity to the most inhuman times; Weil manages to portray each individual character as complex, driven by myriad desires and emotions.There are heavy allusions made towards certain members of the Nazi party - clearly Speer and Heydrich play substantial roles, though they are never really mentioned by name, only by behaviors, physical descriptions, and commentary on their positions in the Czechoslovakian Protectorate. The Czech characters are human, and trying to bump along and maintain their livelihood in light of the occupation.In many ways, the complexities of the characters is reflective of contemporary postmodern literature. For a subject matter that is frequently a magnet for absolutist thought and behavior (one side being \"all bad,\" the other side being \"all good\"), Weil deals thoughtfully and provocatively with the two 'sides' to the Nazi occupation. Neither side is portrayed absolutely: there are moments of kindness on both sides of the conflict. The complexity, however, can become an overriding theme in character development - a behavior not uncommon in 'Mendelssohn is on the Roof' - and prevents true character depth from developing throughout the story.Some of my favorite writing of the book is included when one of the Nazi leaders (presumed, and heavily implied to be, Reinhardt Heydrich) thinks about the importation of German cultural behavior to Prague. The juxtaposition of his thoughts on Beethoven during the purges of the Nazi party members are remarkable, despite being basically absurd.Weil's poetic descriptions of the beautiful city (which I have loved so well) are fitting and appropriate: they avoid heavy handedness, while still grasping at the deeply emotional connection many feel with the beauty, and cultural traditions of, Prague.'Mendelssohn is on the Roof' becomes frustrating because clearly Weil has an excellent story idea. The Nazi occupation of Prague is not nearly as frequently discussed or explored through literature and history as many other aspects of World War II, so Weil successfully avoids cliche and triteness; he is able to bring a fresh outlook to a subject that has been, to some extent, overplayed and wrought with rigid intellectual and emotional behavior.Weil is obviously confident in his ability to create a remarkable foundation for a story (he is extremely successful), but doesn't excercise control over how, precisely, to incorporate underlying themes and character leitmotifs to effectivelly *tell* the story.Throughout the novel, it's evident that the author is straddling the line between trying to create a magical realist story (a la M. Kundera's tradition) and telling a linear, simple story of survival amongst Prague's residents. Either methodology would have worked equally well, but the indecision about literary methodology - which carries through to the end of the book - sporadically outshines the story's incredible potential as a masterpiece.Overall, the work is quite excellent, but not without its flaws. Much like the characters of 'Mendelssohn is on the Roof,' the storytelling itself is courageously ambitious. However, Weil's storytelling wavers without a decisive literary behavior"}, {"review_sentiment": 5.0, "review_text": "There isn't a \"plot\" per se. The book is a series of scenes involving a host of Jews, Czechs and Nazis in the Czech Republic during WW@ as the Nazis empty Prague of the Jews. The book is both darkly comic and deeply tragic. It is the best book about the holocaust I've read since it covers the sort of day-to-day lives of the Jews before the camps and also the very effortless translation. It is a quick and easy read but filled with a lot of poignant moments. In particualr what it does well is puts the reader into the mind and thought process of Jews who were victimized by the Nazis not just as victims but also as accomplices.If there is a short coming, it is that Weil uses a lot of the Nazi nomenclature for places and groups and titles for people so readers without a strong knowledge of the Holocaust might be confused by the byzantine number of Nazi offices and organizations (this BTW is a real stregnth of the book for those familar with the system since it highlights how fragmented and fuedal the Nazi state was)."}, {"review_sentiment": 5.0, "review_text": "This book is amazing in its realism and emotion. The symbolism takes time to understand but when you do the book takes you to another level. The courage of the Jews and Czech people is heartening and brings another diminsion to what is commonly thought about when you think of WW2. An excellent book that I encourage everyone to read."}]}, "authors": ["Jiri Weil"], "isbn": "0810116863", "longitude": 14.4212535, "periods": ["1900s"], "title": "Mendelssohn Is on the Roof", "word_cloud": "know anything indeed bear father convert family faith early life grave mark cross confusion part story concentration camp survivor former well known writer post war copyright death translate english series fictional intertwine cameo life occupation title derive comedic attempt musically challenge municipal worker part composer statue newly name german assassination play vivid detail short control occupation apparatus hold manage terminal existence seizure theft property fail attempt artifice deception collaboration write poetic poignant story wanders time end always story deep sadness consume reality evil prominent writer critical writing life soviet cause fall favor danger high profile individual occupied go hide survive do courageous friend risk life support protect result familiar horror daily life homeland story write slim volume reflect reality powerful way wei use various technique capture many different way stamp new order former meant ordinary people jewish gentile capture banality sadism inner working final solution use various technique include satire convey embrace complexity brutality result move memorable mention thoroughly enjoy deal protectorate order make point occupation affect variety people author introduces many character slightly relate terrible time think create involvement character life really author hesitate figure heck title great let really glad think get great feel atmosphere chaos uncertainty fear see live character lot many connect spin occasionally intersect hold breath person story come inevitable end way remind lot wonderful man die fault find hard time keep track many character sometimes story picked go bother much begin soon invasion month rule naked terror saw ancient land utter contempt main architect already herd ghetto already turn hold area many send gas chamber regret present position liquidation instead able participate personally violence assassinate terror intensify even portrays brutality bureaucracy regime infighting different authority terrify almost much terrify people order give immediately order statue none underling know many statue such situation farcical leave doubt never anything funny outcome follow precarious life several perforce collaborate even pride others reproach bitterly courageously engage resistance progress become darker darker farcical element leave move force select terrible thing yet suffer continue right time last page drive victim go death bravely know though see surely write also lover worthwhile follow live person young old male female conflict impact country time macabre individual endeavor lead life nazi occupation ever always death hovers people never shake reality people life follow time somewhat confuse story take place however story well worth effort take moved poignancy people struggle ultimately resolve lose hope even face death main problem work confuse nature story line clearly grandest ambition obvious capable strong writer idea remarkable story certainly character development jewish family official citizens subtle nuance individual struggle survive bring strike humanity inhuman time manage portray individual character complex driven myriad desire heavy allusion make towards certain member party clearly play substantial role never really mention name behavior physical description commentary position czechoslovakian character human try bump along maintain livelihood light many way complexity character reflective contemporary postmodern literature subject matter frequently magnet absolutist think behavior side bad side good deal thoughtfully provocatively nazi occupation side portray absolutely moment side conflict complexity however become overriding theme character development behavior uncommon prevents true character depth develop favorite writing include leader presume heavily imply think importation german cultural behavior juxtaposition thought purge party member remarkable basically poetic description beautiful city love well fit appropriate avoid heavy handedness still grasp deeply emotional connection many feel beauty cultural tradition become frustrate clearly excellent story idea occupation nearly frequently discuss explored literature history many aspect successfully avoid cliche triteness able bring fresh outlook subject extent overplay wrought rigid intellectual emotional obviously confident ability create remarkable foundation story extremely successful exercise control precisely incorporate underlying theme character leitmotifs effectively evident author straddle line try create magical realist story la tradition tell linear simple story survival among st resident methodology equally well indecision literary methodology carry end sporadically outshines story incredible potential work quite excellent flaw much character storytelling courageously ambitious however storytelling waver decisive literary behavior plot series scenes involve host empty darkly comic deeply tragic best holocaust cover sort live camp also effortless translation quick easy fill lot poignant moment particular well put mind thought process victimize victim also short come use lot nomenclature place group title people reader strong knowledge confuse number office organization real strength familiar system highlight fragment feudal state amazing realism emotion symbolism take time understand take level courage people hearten bring dimension commonly think think excellent encourage everyone", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "Julius Schlesinger, aspiring SS officer, has received orders to remove from the roof of Prague's concert hall the statue of the Jewish composer Felix Mendelssohn. But which of the figures adorning the roof is the Jew? Remembering his course on racial science, Schlesinger instructs his men to pull down the statue with the biggest nose. Only as the statue they have carefully chosen begins to topple does he recognize that it is not Mendelssohn; it is Richard Wagner.\r\n\r\nThus begins a story of disarming simplicity that traces the transformation of ordinary lives in Nazi-occupied Prague. Death abetted by the petty malevolence of Nazi functionaries wins all the battles but ultimately loses the war, defeated by the fragile flowering of courage and defiance.", "asin": "0810116863", "rank": "1007690", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/71C0XRH6PTL.gif", "country": "Czechia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}