{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 43.8519774, "ratings": {"num_ratings": 28, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "A book that should have won the Nobel Prize for literature, an epic poem in the form of a novel with a story that resonates for our time of morally compelling events."}, {"review_sentiment": 5.0, "review_text": "Only the best book ever! If you want to read something from the Balkans, this is the book."}, {"review_sentiment": 5.0, "review_text": "Incredible, powerful"}, {"review_sentiment": 5.0, "review_text": "This historical novel set in Ottoman Bosnia is a masterpiece. Despite the fact that the psychological analysis is sometimes heavy, overall it is still a very dynamic thriller. It is as well a great book to understand the internal conflicts of the Bosnian society, between the east and the west that they were caught."}, {"review_sentiment": 4.0, "review_text": "This Book is by no means an easy book to read for an American. I took an Eastern European culture course and this book was a required reading. I found the writing style just hard to read, and comprehend."}, {"review_sentiment": 5.0, "review_text": "Nice to read reviews of this book and find out Balkan wars continue in the cyberspace long after they ended in the 1990s. The background of this novel is WWII and Selmovic family involvement in the Tito's Partisan guerrillas. Mehmed Selimovic and his brother fought with the guerrillas and his brother achieved the rank of Major  Upon liberation of their hometown of Tuzla in North-East Bosnia in 1945 his brother was stationed there.There he received the news that his  wife had been liberated from the Axes forces imprisonment and borrowed some furniture from the military storage to furnish his dwelling for their reunion He was accused of theft, brought before court-martial, found guilty and promptly executed.Selimovic struggled with this family tragedy for 20 years before he penned this book. exploring the morals of rebelling against the authority in face of injustice."}, {"review_sentiment": 5.0, "review_text": "I have read this novel several times. Beautifully constructed sentences. I would love it if Amazon would provide it as an Audiobook."}, {"review_sentiment": 5.0, "review_text": "I'm not sure what to say about this book here because I feel like trying to give a comprehensive review will simply be glaringly inadequate.  All I can really say is that this book is beautiful.  It is tragic without ever being cliche.  The text is almost poetic.  It has a compelling plot but retains philosophical profundity.  It is dense.  There is no denying that.  But is is well worth it."}, {"review_sentiment": 5.0, "review_text": "At school it was compulsory to read it together with Andrić's Bridge Over The Drina. We had thirty-three hours on Andrić as opposed to three on Dostoevsky. I was a young blood then and I \"stood up\" for my beliefs - at home. I read anything else but Death And The Dervish and Ivo Andrić. Until I \"discovered\" America. God, why everything happens here? It is where I read The Dervish for the first time - in English. Eventually, visiting a cousin in Canada I stumbled upon an original version, and I stood there like an empty-handed dream-catcher. My own language helped me read between the lines of this master-piece, and it was the first time I realized how far I had come."}, {"review_sentiment": 5.0, "review_text": "This is truly one of the best novels in former state of Yugoslavia. The writer carefully introduced characters into the story and it needs some time to catch all of them, but once that happens, the novel flows exciting as a thriller. In my opinion, it's worth reading more than once."}]}, "authors": ["Mesa Selimovic"], "isbn": "0810112973", "longitude": 18.3866868, "periods": ["1700s"], "title": "Death and the Dervish", "word_cloud": "literature epic poem form story resonates time morally compelling event only best ever want something balkan incredible powerful historical set fact psychological analysis sometimes heavy overall still dynamic thriller well great understand internal conflict bosnian society east west catch mean easy american take eastern european culture course require reading find write style hard comprehend nice review find balkan war continue cyberspace long end background family involvement guerrilla brother fight guerrilla brother achieve rank liberation hometown brother station receive news wife liberate force imprisonment borrow furniture military storage furnish dwelling reunion accuse theft brought find guilty promptly struggle family tragedy year pen explore moral rebel authority face injustice several time beautifully construct sentence sure say feel try give comprehensive review simply glaringly inadequate really say beautiful tragic ever cliche text almost poetic compel plot retain philosophical profundity dense deny well worth school compulsory together hour oppose young blood stand belief home anything else discover everything happen first time visit cousin stumble original version stand language help line first time realize far come truly best novel former state yugoslavia writer carefully introduce character story need time catch happen flow excite thriller opinion read", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Sheikh Nuruddin is a dervish at a Sarajevo monastery in the eighteenth century during the Turkish occupation. When his brother is arrested, he descends into the Kafkaesque world of the Turkish authorities in order to find out what has happened. As he does so, he begins to question his relations with society as a whole and, eventually, his life choices in general. \r\n\r\nHugely successful when published in the 1960s, Death and the Dervish appears here in its first English translation.", "asin": "0810112973", "rank": "146263", "city": "Sarajevo", "image": "https://images-na.ssl-images-amazon.com/images/I/41E23SKN68L.jpg", "country": "Bosnia and Herzegovina", "story_arc": ["Tragedy", "Things only get worse"]}