{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.2551338, "ratings": {"num_ratings": 7, "rating": 3.1, "reviews": [{"review_sentiment": 1.0, "review_text": "Did not interest me.  I had a hard time finishing it."}, {"review_sentiment": 5.0, "review_text": "In HOURGLASS, Danilo Kis describes the experiences of E.S., a 53 year-old Serbian Jew in March and April of 1942. E.S. lives on borrowed money, has a toxic family life, and has problems with his legal papers, which necessitates the indignities and dangers of travel.  In HOURGLASS, the hapless E.S. seeks to restore order to his muddled life. As he does so, he worries that he, a retired and not robust former railroad employee, may soon be called back to work, even though he is gripped by forebodings and his coat prominently displays a yellow Star of David. Meanwhile, the backdrop for his trials and tribulations is the death or disappearance of scores of his Jewish friends and much of his community.Many people think the story Kis tells in HOURGLASS is masterful. My paperback, for example, has a back-of-the-book blurb from John Bayley, who wrote in \"The New York Review of Books\": \"Probably no other novelist has succeeded better than Kis in making a densely stylistic pattern out of such a nightmare, conveying with gruesome but also aesthetically beautiful effect the interrelation in such a life... of the quotidian and the apocalyptic, the combination of the sense of trivia with the sense of doom.\"Kis divides the story of E.S. into 67 units, with most combining to form chapters. His chapters then sort into three distinct narrative approaches. For example, Chapter 2, \"Travel Scenes\", has six units that, together, convey mundanity--that is, what E.S. sees as he looks out a window in a shack and watches a woman deliver documents in a snow storm. Meanwhile, Chapter 3, \"Notes of a Madman\", has seven units, several exploring bitter ironies, other refuting these same ironies. Then, Chapter 4, \"Criminal Investigation\", has three units, all of them written in an overbearing prosecutorial Q&A; format. In chapters using this style, a bad-cop interrogator works relentlessly to ascertain the actions and state of mind of E.S. as he attempts to restore order in his helter-skelter and fraught life.Overall, Kis uses his \"Notes of a Madman\" approach the least frequently. The reason, I suppose, is that chapters of bitter ruminations about existence are nearly redundant when the \"Travel Scene\" chapters convey the nightmarish mundanity in E.S.'s life and the \"Criminal Investigation\" chapters show its oppression by the state.Nonetheless, I would say that the \"Criminal Investigation\" chapters--one is a single unit and 49 pages--can be fascinating but also tedious. This is surely Kis's intent, as he puts the reader into the experience as the government interrogates an innocent citizen and seeks some insidious plot amid harmless domestic details and social associations.  In focus and execution, these chapters are not unlike Kis's A TOMB FOR BORIS DAVIDOVICH, in which the subject is the psychologies interlaced in authoritarian societies.Kis shows great range in HOURGLASS, particularly in his \"Travel Scene\" chapters. In unit 62, for example, Kis is hilarious as he discusses the pros and cons of E.S's sometimes crapulous behavior. But usually these chapters are a mixture of the banal and lurid. IMHO, the best is unit 34, in which E.S. and a friend, playing a game of chess, try to recall all of their mutual acquaintances who have died or disappeared since the run-up to, and start of, the war.HOURGLASS is a challenging book and there were moments when this reader's mind wandered. Regardless, rounded up to five stars and recommended."}, {"review_sentiment": 5.0, "review_text": "Danilo Kis's Hourglass fulfills what the historian Hayden White described as the most proximate capture of the historical event of the Holocaust, the narrative art of literature.  Kis recreates the life of a Hungarian Jew whose life is interrupted by his arrest and detention, but which has begun to unravel because of the limited trust that pervades what had been his normal milieu in a Hungary of assimilated Jews.  The phenomenological rigor that opens and continues throughout the novel enables us to experience the disruption of reason that injures our own thought processes.  Perhaps death is not the worst experience, rather a gradual loss of the normal imposed from without. At times, when a normal conversation with a friend is possible for an hour or so, it is as if one is given the richest gift of a lifetime, only to see it disappear as the day progresses. There is not in my experience a book or other account that so provides the 'lived experience' of Jews in this time.Mark E. Blum, Professor of History, University of Louisville."}, {"review_sentiment": 3.0, "review_text": "The \"catechetic rhetoric\" of the question & answer exchanges throughout the Criminal Investigation segments make for never less than fascinating reading. They evoke not only Kafka but Joyce in his Ithaca chapter of Ulysses; the omniscient and patiently probing inquisitor, here, finally gets \"ES\" to admit his weariness, but the rare entry of the interrogated into the set-up only enhances its blended horror and suspense.This ambitious novel, in its other modes of transmission, \"Diary of a Madman,\" and Travel Scenes, intersperse with the Criminal Investigation sections. These, to me, recall many other Central European fictional post-war attempts to plumb the heart of mid-20c darkness. It is not to fault Kis for doing well what he does here, but these portions lack the excitement of the interrogative modes, and by comparison languish on the page in their comparative introspection and wandering reveries.As a whole, the novel works best in Bloomsian asides, such as ES thinking about how to see the world through glasses that imitate the curvature of a dog's eyes, the weariness of fecundity, or the closing pages in which the Garden of Eden, the stages of man's life, the battle against nothingness so characteristic of Jewish secularised mentality, and the link to Kis' own forebears becomes clearly visible behind the novelistic scaffolding of the previous 250 pages, which read quickly for a subject so dense."}, {"review_sentiment": 3.0, "review_text": "This is a difficult read which I tended to race as I neared the end.  Which is not to say it does not have an aggregate of power awaiting the more patient and attentive reader. It raised questions in me, such as Why Literature? which I answered myself in my head as I read(in the manner of parts of the book itself) as follows: because literature reminds us that no matter how horrible our individual circumstances there is ALWAYs someone worse off and it puts one's own miserable and petty life in perspective( see p. 77)  It also has a bitter humour: when notified that her husband had heroically laid down his life for the first Hungarian Regiment of Hussars, the wife immediately consulted a fashion magazine and chose a black dress in the latest style (winter 1941-42) see P.67).  He also provides information on how we can dedtermine why the world is doomed to destruction - look into our own hearts, (see p.129).  Call it post-modern.  Call it difficult. But do not call it an easy read."}, {"review_sentiment": 5.0, "review_text": "If Franz Kafka's Joseph K. had lived in the early 1940's and been  ordered to wear a yellow star in Czechoslovakia, he would have  resembled a character known only as E. S. in this story of  wartime Hungary by Danilo Kis. The trial of  an individual and his family at the hands of a vague and hidden  totalitarian force are described with growing horror and gallows  humor in ''Hourglass,'' a chilling novel in which time is running  out for a marked man riding along the tracks of mortification.  One of the trains he takes eventually must lead to a concentration  camp. But the journal of the final months of his life is told with  such authority in this imaginatively constructed story that the  doomed character appears to be in command of his own destiny.  ''Hourglass,'' translated from the Serbo-Croatian by Ralph  Manheim, is evidently rooted in firsthand family experiences.  The reader is informed that a letter attributed to E. S. in the novel  is based on an actual letter written by Kis's father two years  before his death in Auschwitz. But the universal elements in the  story - the attempt to carry on the everyday routine of life and the  disbelief in an official policy of genocide - offer a parable about  the extermination of the Jews by the Third Reich and its  collaborative governments in occupied Europe. Trains were  essential for the Third Reich to fulfill the quotas for the  Holocaust, and trains play an essential part in the novel. At one  point, the narrator sees himself, with trembling hands, gathering  up his papers in his seat in the first-class carriage and stuffing  them into his briefcase along with bottled beer and  smoked-herring sandwiches. The author then transforms an  ordinary train ride into an act of terror: ''Who was standing  beside him at that moment? A young blond conductor, who was  aiming his nickel-plated ticket punch like a revolver at the star on  his chest.''  The interrogation of the narrator is bizarre. It shows the police  mentality at work in a police state anywhere. The narrator is  questioned about a piano in his home. The line of questioning  goes: Can the piano be used to send signals? Where in the room  is the piano? Can you describe what it looks like? Why was an  open score on the music stand? How do you account for the fact  that the piano was open and that someone had been practicing so  early in the morning? Inevitably, the answers to dumb questions  sound somehow suspicious and lead to more questions.  The nameless E. S. wonders how he can avenge himself against  the armed police. He indulges in a small act of defiance for his  own self-respect: ''Several times he had blown his nose into a  newspaper with the Fuhrer's picture on it. Was he conscious of  the danger he was courting? Definitely. He always folded the  paper as small as possible before throwing it into dense  brambles or the river, thus doing away with the corpus delicti of  his insane and dangerous act.'' There are deliberate breaks in  style as the author shifts back and forth in chapters that are  labeled ''Travel Scenes,'' ''Notes of a Madman,'' ''Criminal  Investigation'' and ''A Witness Interrogated.'' The year 1942 is a  crazy time in the Danube Valley for the first-person narrator. He  is trying to maintain a semblance of sanity while composing a  letter to his sister that forms the spine of the story. If there is a  theme in the novel, it is summed up in the last sentence of that  letter:  ''P. S. It is better to be among the persecuted than among the  persecutors.''  ''Hourglass'' owes a debt to ''The Trial'' by Kafka. In the  narrator's musings, Kafka is cited: ''Everything that is possible  happens; only what happens is possible.'' What distinguishes  Kis's novel is its authorial independence. A conventional  narrative structure is ignored; it is the author's musings and  diversions that magically build suspense. Some paragraphs run  on for pages, others suddenly break into short questions and  answers between the omnipotent state and its helpless victims.  Kis forces the reader to work for him, to pay attention. That he  succeeds is a rare achievement..."}, {"review_sentiment": 5.0, "review_text": "Kis's novel is one of the most important in the entire Eastern-european literature. It gives an incradible picture of a desintegrating mind, following, in a way the steps of Youce and Woolf, but still making a step  towards postmodernism"}]}, "authors": ["Danilo Kis"], "isbn": "0810115131", "longitude": 19.8451756, "periods": ["1900s"], "title": "Hourglass", "word_cloud": "did interest hard time finish describe experience serbian live borrow money toxic family life problem legal paper necessitates indignity danger travel hapless seek restore order muddle life worry retire robust former railroad employee soon work even gripped foreboding coat prominently display yellow meanwhile backdrop trial tribulation death disappearance score jewish friend much people think story tell masterful paperback example blurb write novelist succeed better make densely stylistic pattern nightmare convey gruesome also aesthetically beautiful effect interrelation life quotidian apocalyptic combination sense trivia sense doom divide story unit combine form chapter chapter sort distinct narrative approach example unit together convey mundanity see look window shack watch woman deliver document snow storm meanwhile unit several explore bitter irony refute irony then unit write overbear prosecutorial format chapter use style interrogator work relentlessly ascertain action state mind attempt restore order fraught use approach least frequently reason suppose chapter bitter rumination existence nearly redundant chapter convey nightmarish mundanity life chapter show oppression chapters single unit page fascinate also tedious surely intent put experience government interrogates innocent citizen seek insidious plot harmless domestic detail social association focus execution chapter subject psychology interlace authoritarian show great range particularly chapter unit example hilarious discus pros con sometimes scrupulous behavior usually chapter mixture banal lurid best unit friend play game chess try recall mutual acquaintance die disappeared start challenge moment mind wander round star recommend fulfill historian describe proximate capture historical event narrative art literature recreate life hungarian life interrupt arrest detention begin unravel limited trust pervades normal milieu assimilate phenomenological rigor open continue enables experience disruption reason injures think process perhaps death worst experience rather gradual loss normal impose time normal conversation friend possible hour give richest gift lifetime see disappear day progress experience account provide experience catechetic rhetoric question answer exchange segment make never le fascinate read evoke chapter omniscient patiently probe inquisitor finally get admit weariness rare entry interrogate enhances blend horror ambitious mode transmission section recall many central european fictional attempt plumb heart darkness fault well portion lack excitement interrogative mode comparison languish page comparative introspection wander whole work best bloomsian aside think see world glass imitate curvature dog eye weariness fecundity closing page stag man life battle nothingness characteristic secularize mentality link forebears become clearly visible novelist scaffold previous page quickly subject dense difficult tend race near end say aggregate power await patient attentive raise question literature answer head manner part follow literature remind matter horrible individual circumstance someone worse put miserable petty life perspective see also bitter humor notify husband heroically laid life first hungarian wife immediately consult fashion magazine chose black dress latest style winter see also provide information determine world doom destruction look heart see difficult call easy live early order yellow star character know story wartime trial individual family hand vague hidden totalitarian force describe grow horror gallows humor chilling time run marked man rid along track mortification train take eventually concentration camp journal final month life tell authority imaginatively construct story doom character appear command destiny translate evidently root firsthand family experience informed letter attribute base actual letter write year death universal element story attempt carry everyday routine life disbelief official policy genocide offer parable extermination collaborative government occupy essential fulfill quota train play essential part point narrator see tremble hand gather paper seat carriage stuff briefcase along bottle beer sandwich author transform ordinary train ride act terror stand beside moment young blond conductor aim ticket punch revolver star chest interrogation narrator show police mentality work police state anywhere narrator question piano home line question go piano use send signal room piano look open score music account fact piano open someone practice early morning answer dumb question somehow suspicious lead question nameless wonder avenge armed police indulge small act defiance time blow nose newspaper picture conscious danger court definitely always fold paper small possible throw dense bramble river thus away corpus delicti insane dangerous act deliberate break style author shift back forth chapter label interrogate year crazy time narrator try maintain semblance sanity compose letter sister form spine story theme sum last sentence letter better persecute persecutor owe debt narrator musing cite possible happens happen possible distinguish authorial independence conventional narrative structure ignore author musing diversion magically build suspense paragraph run page others suddenly short question answer omnipotent state helpless victim force work attention succeed rare achievement important entire literature give incredible picture disintegrate mind follow way step you're still make step towards postmodernism", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "Particularly fascinating in this difficult and demanding novel, regarded by many as the late author's finest, is Kis's agile re-creation of the multi-ethnic culture of the border territory between Hungary and Yugoslavia. \r\n\r\nSet in 1942, the novel describes in rich, Kafka-esque terms the external and internal worlds of a railway clerk called E.S. whose quotidian concerns include antagonism toward his well-to-do sister Netty, quarrels with her son George about a piece of jointly owned property, and futile, indignant inquiries to the authorities about why his pension has been reduced. \r\n\r\nBut Kis uses this \"life\" of a victim as a counterpoint to his second story line, which matter of factly reveals an exploding, horrific world in which Jews are murdered in countless mundane or outlandish ways, commit suicide, or simply disappear while the general population goes mad. \r\n\r\nThe novel is fleshed out by a series of questions and answers elicited by an ominous, unseen person who interrogates E.S. A final \"letter\" reveals that the preceding text is a manuscript, written by E.S., meant to be \"a bourgeois horror story,\" a telling summation of this ultimately rewarding novel. \r\n\r\nOf all Danilo Kis's books, HOURGLASS, the account of the final months in one man's life before he is sent to a concentration camp, is generally considered his masterpiece. \r\n\r\n\"A finely sustained, complex fictional performance. It is full of pain and rage and gusto and joy of living, at once side-splitting and a heartbreaker\". The Washington Post", "asin": "0810115131", "rank": "1331645", "city": "Novi Sad", "image": "https://images-na.ssl-images-amazon.com/images/I/41BZ7FWWMAL.jpg", "country": "Serbia", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}