{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 25, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "It’s 1938, the time of the Spanish Civil War. Fascism under Franco of Spain is creeping into neighboring Portugal as well under its dictator Salazar. A kosher meat shop the main character frequents is vandalized by fascist thugs.Pereira, our main character, is a journalist having his mid-life crisis. His wife died a few years ago and he regrets that they never had children. He’s aging, lonely, overweight. He writes about art and literature and seems so disconnected from the political winds that a couple of friends, one a priest, tell him “stop living in another world; go out and see what’s happening all around you.” At night he tells his wife’s photo about his day and asks her opinion about things.Kind of accidentally he starts to get politically active in a big way. He hires a young man as an assistant who is assisting anti-fascist forces in Spain and trying to recruit Portuguese to fight. He has a beautiful girlfriend and a male friend who makes fake passports. The journalist reads the political writings of the assistant which he knows he can’t publish because of Portuguese censorship. But he starts helping them out by giving them money and housing them when they are running from the law. He sees the son he did not have in the idealistic young man and the beautiful, daring girlfriend doesn’t hurt the cause either. Inevitably, one night the Portuguese secret police come knocking and turn his world upside down.I liked this passage: “Philosophy appears to concern itself only with the truth, but perhaps expresses only fantasies, while literature appears to concern itself only with fantasies, but perhaps it expresses the truth.”And this response from his friend, the priest, after Pereira says he wants to make confession the next time he visits: “You don’t need to, replied Father Antonio, first make sure you commit some sin and then come to me, don’t make me waste my time for nothing.”I liked the way the heavy duty political theme was interspersed with humor, mostly about Pereira’s struggles with his weight and diet. Every day he is challenged to get up stairs and hills, yet eats rich omelets and drinks eight glasses of lemonade that is half sugar. He goes to spas for thalassotherapy (seawater and seaweed treatments) as if he expects the weight to simply dissolve. The spa directors believe in working with his mind as well as his body despite resistance from Pereira. “Pretty soon you’ll start talking to your wife’s photograph,” he is told. Of course we know Pereira already does.The book has an interesting background. “Pereira declares” is a mantra throughout the book, usually at chapter endings. But the book has also been translated into English as “Declares Pereira” and “Pereira Maintains.” The author is Italian and the book is translated from the Italian but he loved Portuguese culture, lived for periods in Portugal, and died there. He was famous in Italy for translations of Portuguese works into Italian, especially the work of Fernando Pessoa. This book was made into an Italian movie. It’s fairly short (135 pages) and held my attention all the way through. My thanks to Ian of Scotland for recommending this book to me."}, {"review_sentiment": 3.0, "review_text": "Interesting book-hard to catch on to at first but then it grabs you. Worth reading- suggest it to all you history buffs."}, {"review_sentiment": 5.0, "review_text": "This plot is set in Portugal, during a dictatorship, coinciding w the Spanish Civil War. Pereira is an elderly widower, who writes the cultural page of a local newspaper. He has never been involved in politics, but somehow gets dragged into making a statement via ai professional relationship with a young writer. The story is told as if being dictated in a legal declaration of events, where Pereira is the accused of an unknown crime. Pereira is pushed to take sides by his ethical values, almost against himself - a priorly average man, w no political interest. As a writer, he translates French literature, and although the pieces he translates -Balzac's stories- might have been written many years before, in another generation, they still prove to be true when applied to the onset of Nazi Germany invading France. Which gets Pereira in trouble, as Portugal is starting to side w the forces of fascism. The book was made into a movie, acting Marcello Mastroiani. Easy read, w Kafkaest tones. I had read it in Spanish translation many years before."}, {"review_sentiment": 5.0, "review_text": "Pereira has settled his life once for all. His work: a journalist in charge of the literary section of a newspaper from Lisbon in which he translates French tales not at all on harmony with the Director wishes: French ideas were not compatible with the strong influence and help given by Germany to Franco and Salazar. His family life: a widower who uses to speak to his wife's photograph several times a day; no children, no friends except Father Antonio with whom he chats when some problem grieves his mind, specially the question of death, his obsession, as well as the resurrection of the body he doesn't accept because his is too fat and tired. With the waiter attending the restaurant where he has lunch, he discusses politics in spite of his lack of interest: his paper is independent and apolitical and the Salazar dictatorship doesn't hurt his feelings...until one day, after hiring a recently graduated young man, his life begins to change very slowly but firmly, toward a direction he never thought he would reach. Little by little his conscience awoke.  In 1995, Antonio Tabucchi, completely astonished, saw the multitude shouting in the streets against Berlusconi, brandishing \"Pereira declares\" which turned to be the book symbol of the left opposition. \"A fat Portuguese became an Italian hero\", the author summed up, smiling."}, {"review_sentiment": 5.0, "review_text": "I have expressed my enthusiasm for this book elsewhere on this site, but under the title Pereira Maintains. In fact, it is the same book by the same author and the same translator.  Pereira Declares is an edition published by New Directions, the American publisher, whereas Pereira Maintains is published by Canongate in Great Britain.However, the differences, though few in number, do not stop there, and they are rather important.Patrick Creagh is the translator for both editions, and Pereira Maintains is his revised version of Pereira Declares, which appeared about 15 years earlier in the U.S.  However, I have compared both editions and the only difference which I noticed was the title. Yet since it appears as a constantly used phrase in slightly varying forms throughout the entire novel, I guess you you say that this is an important revision.At this point, you may say there isn't enough variation between the two editions to make one preferable to the other, but I would caution potential readers about one other difference. Pereira Declares is printed in fairly small type which seems squeezed into a book of only 136 pages. Pereira Maintains has much more generous-sized print spread out over 195 pages.  If you are reading this book on paper, Pereira Maintains is much more attractive and reader-friendly.In either edition, it's a novel well worth reading, in an excellent translation (as I explained in my review), but I much preferred reading it in the Canongate version."}, {"review_sentiment": 2.0, "review_text": "It moved rather slow & did not have much to say. If you are interested in pre-wwII portugal, you may like it."}, {"review_sentiment": 5.0, "review_text": "\"Pereira Declares\" is an intense burst of writing dealing with oppression and the suppression of free speech.  Taking place in pre-WWII fascist Portugal, the story centers around a small time journalist named Pereira who, despite his every inclination, becomes involved with a small time revolutionary fighting the overwhelming tide of fascism.  Acting out of the simplest human kindness, Pereira aides the rebel despite his reluctance to get involved with the politics that he knows will only lead him to trouble.  Once his eyes are opened, however, to the censorship that is going on, Pereira begins to take chances himself, at first small, and then life-changing, as he discovers truth in the great writers of the past and becomes inspired to affect change himself.  With all that is happening in the world today- the Arab Spring, the Occupy Movement across the United States- \"Pereira Declares\" is a strong statement in support of free speech and standing up for what one believes is right.  The names and dates may be different, but Antonio Tabucchi has written a portrait of one seemingly ineffectual Portuguese man that has a lot to say about what is going on in the world today."}, {"review_sentiment": 5.0, "review_text": "What an ever more vivid tapestry of World War II-era Europe modern writers continue to create. Whether it's because of Robert Wilson (A Small Death in Lisbon), Alan Furst, Marcel Aymé (Uranus), Giorgio Bassani (Il giardino dei Finzi-Contini), José Saramago (O ano da morte de Ricardo Reis) or Antonio Tabucchi, I feel ever more engrossed in an era I'd given little thought to until I started reading such authors.Pereira Declares is a portrait in miniature, and it reminds me that you don't have to evoke sweeping historical panoramas to write effectively on grand themes like the spread of fascism over 1930s Europe. (Of course, Alan Furst has already shown that in spades.) It's the spare, elegant story of a once-prominent reporter now relegated to obscurity as the culture-page editor for a second-rate Lisbon newspaper. He becomes entangled with the resistance against the dictatorship of António de Oliveira Salazar, Portugal's counterpart to Generalísimo Francisco Franco of Spain.It would seem implausible that Pereira should see fit to take up with the feckless and foolish resistance follower Monteiro Rossi--the reader senses looming disaster almost from the novella's beginning--but Tabucchi convinces at least this reader that Pereira did so because he's a sentimentalist like Casablanca's Rick Blaine rather than a pragmatist like Captain Renault.The translator did an excellent job of translating Tabucchi's idiosyncratic style, which, like José Saramago's but less extremely, relies on run-on sentences and an absence of quotation marks. A couple of times he renders a place name from Italian directly into something not quite Portuguese (A Dolorosa comes out as La Dolorosa, the Graça neighborhood as La Graça), and Tabucchi may have mistyped the Cais do Sodré as the Cais de Sodré, and, conversely, Póvoa de Varzim as Póvoa do Varzim. Obviously these are trivial things and I notice them only because I'm a translator myself."}, {"review_sentiment": 3.0, "review_text": "Kaplan declares that he read an article quoting some writers he admired who recommended Tabucchi's Pereira Declares.  One writer said that he was in awe of Tabucchi's simple, but high impact prose.  The reviews on Amazon were also full of praise for the book.  With such a recommendation, Kaplan declares that he ordered Pereira Declares via the most wonderful inter-library loan.  When the book arrived, he found that the book was short, really a novella.Kaplan declares that the first thing anyone reading the book will notice is the \"tic\" \"Pereira declares\" scattered through the prose.  He was not sure what the point of this was.  Perhaps it was meant to indicate that Pereira was bearing witness to the fascist Salizar government in Portugal.  This is suggested by the subtitle: \"A Testimony\".  Kaplan declares that he decided to write this review in this odd style to give the reader a feeling for the prose in Pereira Declares.The story in Pereira Declares is set in the hot Portuguese summer.  In keeping with the setting, Kaplan declares that he found the story, although short, languid and meandering.  The main character, Pereira, seems to be directed by subconscious motivations, drifting toward the final plot culmination.  Perhaps the style lost a lot in translation, Kaplan declares.  While he speaks and reads a little Italian, he read the book in english translation.  What ever the case, the style is not particularly compelling and Kaplan declares that he does not understand the esteem in which Tabucchi is held.  The book was tedious and it was difficult to care about any of the characters.  Kaplan declares that he was glad that he did not spend money on this book and he is, once again, grateful for inter-library loan."}, {"review_sentiment": 5.0, "review_text": "Fear of speaking out at work is a manifestation of larger political and social forces than simply a dysfunctional administration at one's place of work. If we assess our working life as part of a system we will begin to see where repression comes from and we can begin to develop a philosophical, ethical and political framework to overcome fear. Certain kinds of governments unleash and empower the petty dictator within some bureaucrats. Without a larger world view than our cubicle in our office in our building we can easily be made to feel threatened, marginalized or isolated when we speak up for what we deem is right action. And there is nothing good about being threatened, marginalized or isolated. Through reading and literature we gain the best understanding of how a government sets the tone for repression that eventually becomes fear to speak at work.Pereira, a journalist in Lisbon (1938), slowly realizes that by acceding to government censors in the choice of books he reviews that his culture is being compromised:\"Well then, said the editor-in-chief, I really didn't expect this latest thing. What latest thing?, asked Pereira, That panegyric on France, said the editor-in-chief, has caused a lot of offence in high places. What panegyric on France? asked Pereira totally bewildered. Come now Pereira ! exclaimed the editor-in-chief, you published a story by Alphonse Daudet about the Franco-Prussian War which ended with the phrase, \" `Vive la France!\". [p. 109].I used _Pereira Declares_ as in a speech and article, WORKPLACE SPEECH IN LIBRARIES,_Progressive Librarian_ no31 6-16 Summ 2008.--It adds context when reading _Pereira Declares_ [__Sostiene Pereira] to know the writers and literature. Also, good to read on.Luigi Pirandello(1867-1936).Ludwig Feuerbach (1804-1872)Federico García Lorca. La casa de Bernarda Alba (1936). [He was executed, shot by Falange militia on August 19, 1936], (1898-1936).Georges Bernanos.Journal d'un curé de campagne; Grand Prix du Roman (1936). (1888-1948).François Mauriac \"for the deep spiritual insight and the artistic intensity with which he has in his novels penetrated the drama of human life.\" (1885 - 1970).Fernando Pessoa (1888-1935).Guy de Maupassant. Bel Ami .(1885). Le Horla. (1887). (1850-1893).T.E. Lawrence. (1888-1935).Thomas Mann. (1875-1955.)Rainer Maria Rilke (1875-1926).Honoré de Balzac. Honorine (1843). (1799-1850).Friedrich Wilhelm Nietzsche. (1844-1900).Giambattista Vico. (1668-1774).Georg Wilhelm Friedrich Hegel. (1770-1831).Karl Marx, 1818-1883.Alphonse Daudet. Le petit Chose (1868). Contes du Lundi(1873).'La Derniere Classe.' L'Arlésienne (1872).(1840-1897).Aquilino Gomes Ribeiro.[He was involved in the opposition to António de Oliveira Salazar and the Estado Novo, whose government tried to censor or ban several of his books.] (1885-1963).Bernardo Marques. (1898-1962).Théodule Ribot. (1839-1916).Pierre Marie Félix Janet.(1859-1947).Jacques Maritain. 1882-1973.Vladimir Mayakovsky. (1893-1930.)Sergei Mikhailovich Eisenstein. (1898-1948).Made into the last film with  Marcello Mastroianni."}]}, "authors": ["Antonio Tabucchi"], "isbn": "0811213587", "longitude": -9.1365061, "periods": null, "title": "Pereira Declares: A Testimony", "word_cloud": "time spanish creep neighboring well dictator kosher meat shop main character frequents vandalized fascist main character journalist crisis wife die year ago regret never child age lonely write art literature seem disconnected political wind couple friend priest tell living world go happen around night tell wife photo day ask opinion accidentally start politically active big way hire young man assistant assist force try recruit portuguese fight beautiful girlfriend male friend make fake passport journalist read political writing assistant know publish portuguese censorship start help give money housing run law see son idealistic young man beautiful dare girlfriend hurt cause inevitably night secret police come knock turn world upside like passage philosophy appear concern truth perhaps express fantasy literature appear concern fantasy perhaps express response friend priest say want confession next time visit need reply first sure commit sin come waste time like way heavy duty political theme intersperse humor mostly struggle weight diet day challenge stair hill yet eat rich omelet drink glass lemonade half sugar go spa thalassotherapy seawater seaweed treatment expect weight simply spa director believe work mind well resistance soon start talk wife photograph tell course know already interest background declare mantra usually chapter ending also translate english author italian translate italian love portuguese culture live period die famous translation work especially work make italian movie fairly short page hold attention way thanks recommend interest catch first grab worth suggest history buff plot set dictatorship coincide w spanish elderly widower write cultural page local newspaper never involve politics somehow get dragged make statement ai professional relationship young writer story tell dictated legal declaration event accuse unknown crime push side ethical value almost priory average man w political interest writer translate french literature piece translates write many year generation still true apply onset invade get trouble start side w force fascism make movie act w tone spanish translation many year settle life work journalist charge literary section newspaper translate french tale harmony wish idea compatible strong influence help give family life widower use speak wife photograph several time day child friends chat problem grief mind specially question death obsession well resurrection body fat tire waiter attend restaurant lunch discuss politics spite lack interest paper independent apolitical dictatorship hurt feeling day hire recently graduate young man life begin change slowly firmly direction never think little little conscience awoke completely astonish saw multitude shout street brandish declares turn symbol leave opposition fat become italian hero author sum smile express enthusiasm elsewhere site title fact author translator edition publish publisher whereas publish difference number stop rather translator edition maintains revise version appear year earlier however compare edition difference notice title yet appear constantly use phrase slightly vary form entire guess say important point enough variation edition make preferable potential reader difference print fairly small type seem squeeze page much print spread page reading paper much attractive edition well worth read excellent translation explain review much prefer read version move rather slow much say interested portugal intense burst write deal oppression suppression free speech take place fascist story center small time journalist name inclination become involve small time revolutionary fight overwhelming tide fascism simplest human kindness aide rebel reluctance get involve politics know lead trouble once eye open however censorship go begin chance first small discovers truth great writer becomes inspired affect change happen world strong statement support free speech stand believe right name date different write portrait seemingly ineffectual man lot say go world today ever vivid tapestry modern writer continue giardino die anew da more feel ever engross era give little thought start read portrait miniature remind evoke sweeping historical panorama effectively grand theme spread fascism course already show spade spare elegant story reporter relegate obscurity editor newspaper become entangled resistance dictatorship counterpart implausible see fit feckless foolish resistance follower sense loom disaster almost novella begin convinces least sentimentalist rather pragmatist translator excellent job translate idiosyncratic style le extremely rely sentence quotation mark couple time render place name directly something quite portuguese come neighborhood conversely trivial thing notice translator declare article quote writer admire recommended declare writer say awe simple high impact prose review also full praise recommendation declare order wonderful loan arrive find short really declare first thing anyone read notice tic declares scatter prose sure point perhaps meant indicate bearing witness fascist government suggest declare decide write review odd style give feel prose story set hot portuguese summer keep set declare find story short languid meander main character seem direct subconscious motivation drift final plot culmination perhaps style lose lot translation declare speaks read little italian english translation ever case style particularly compelling declare understand esteem hold tedious difficult care character declare glad money grateful loan fear speak work manifestation larger political social force simply dysfunctional administration place work ass work life part system repression come begin philosophical ethical political framework overcome fear kind government unleash empower petty dictator bureaucrat larger world view cubicle office building easily make feel threatened marginalize isolated speak deem right action nothing good threaten marginalize isolate reading literature gain understanding government set tone repression eventually become fear speak journalist slowly realize acceding government censor choice review culture compromise say really expect latest thing latest thing ask panegyric say cause lot offense high place panegyric ask totally bewilder exclaim publish story end phrase la use speech article add context reading know writer literature also good execute shot militia cur deep spiritual insight artistic intensity novel penetrate drama human life pest dew involve opposition government try censor ban several last film", "genres": ["Fiction & Literature"], "summary": "\"One of the most intriguing and appealing character studies in recent European fiction, and easily the best work of Tabucchi's to have appeared in English translation.\"―Kirkus Reviews\r\n\r\nDr. Pereira is an aging, overweight journalist who has failed to notice the menacing cloud of fascism over Salazarist Portugal, until one day he meets an aspiring young writer and anti-fascist. Breaking out of his apolitical torpor, Pereira reluctantly rises to heroism.", "asin": "0811213587", "rank": "454904", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/41-EaGVyHXL.jpg", "country": "Portugal", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}