{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 9, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "A great novella!"}, {"review_sentiment": 4.0, "review_text": "This book suplies a very rich mix of portuguese culture, Lisbon City and a strugle of a narator to find meanings in his subconcient. The author takes the reader in a journey thoug Lisbon and at the same time in a journey to his memories, doubts and feelings, meeting people from his past, and characters that represent parts of him self, like the \"seller of stories\". All of wich is seasoned by the narrators love of the food of Portugal. Finally he gets to confront some realy important characters in his unconcient and ends up arguing whiht who we can supose to be Fernando Pessoa -a poet- or Sigmund Freud -a Psychiatrist- Reading this book gives me the feeling that the best things in life are the simple things, not meaning that all the rest must not be dealt with. If you like stories abuot the inside world of characters, you wil ask yourself how could so much be put in few pages, and at the same time be a special 'travel giude` to Lisbon."}, {"review_sentiment": 3.0, "review_text": "Antonio Tabucchi (born in 1943 in Pisa)  was Italian cultural consul in Lisbon, lives there half the year, and teaches Portuguese Literature at the University of Siena the other half of the year. I greatly admire his 1994 novel \"Periera Declares\" won the Aristeion European Literature Prize.Tabucchi wrote the novella \"Requiem,\" subtitled \"A Hallucination,\" in Portuguese. It involves a reverie-filled day by an aging writer not unlike Tabucchi that involves visiting a graveyard, a bordello, a crumbling mansion on the Caiscais coast, and culminates in a meal with the ghost of a poet who can only be Fernando Pessoa, the towering figure of 20th-century literature whom Tabucchi has translated and written about (with his Portuguese wife).The text of \"Requiem\" occupies only 90 pages (plus three pages providing detail on the many Portuguese dishes mentioned in the text). I don't regret the small amount of time I spent reading the book, though \"Periera Declares,\" which I can heartily recommend for characterization, plotting, and subject matter."}, {"review_sentiment": 2.0, "review_text": "\"Requiem\" is Antonio Tabucchi's praise for Lisbon. It describes the journey of one man through the Portugalise city, where he meets some people, dead and alive, in the otherwise deserted city.The peculiarity of the character is the fact that he has lost his superego, with the consequences of his id, the subconscious fludding his contious mind, hence makim him live in a sort of dreamworld. And from that world come the dead of his past.The book is slightly semi-artistic, and it's message is left to be speculated about. And even if the basic premise of the story is intriquing, it fails to measure up to the potential it contains.A short, nice read, wich doesn't offer anything to think about."}, {"review_sentiment": 5.0, "review_text": "The lightness of Tabucchi's Requiem makes it a very easy book to like. It helps to be at least a little bit familiar with the Portugese poet and author Fernando Pessoa who is the figure Tabucchi is to meet. The novella is very short (107 pages but lots of chapters so lots of white space and big print) and really more on the amusing than philosophical side. The little conversations read like little asides but soon one realizes that is what the book is, a little aside. There are some amusing references made about modern literature that could very well apply to the book we are reading and also a very interesting reference to a story written that later came true(a kind of mini meditation on how fact and fiction mimic each other or follow the same laws, the same could be said for life and dreams) but the book purposely stays on the surface of things. Food is the real center of the book. That is the most substantial and sustaining ritual at the heart of life, at least that apsect of life that is most real it seems to Tabucchi. So the books pages pass, each meeting a chance for conversations and most of the conversations are just small talk. Kind of like life. It is clear the events are all dreamed and so Tabucchi is free to talk to both friends and relations living and dead. But they say the same kinds of things to each other in the dream world that they did in real life. And the dream world is little different than the real world. That is the charm of the book. Life is a dream, so eat."}, {"review_sentiment": 5.0, "review_text": "The lightness of Tabucchi's Requiem makes it a very easy book to like. It helps to be at least a little bit familiar with the Portugese poet and author Fernando Pessoa who is the figure Tabucchi is to meet. The novella is very short (107 pages but lots of chapters so lots of white space and big print) and really more on the amusing than philosophical side. The little conversations read like little asides but soon one realizes that is what the book is, a little aside. There are some amusing references made about modern literature that could very well apply to the book we are reading and also a very interesting reference to a story written that later came true(a kind of mini meditation on how fact and fiction mimic each other or follow the same laws, the same could be said for life and dreams) but the book purposely stays on the surface of things. Food is the real center of the book. That is the most substantial and sustaining ritual at the heart of life, at least that apsect of life that is most real it seems to Tabucchi. So the books pages pass, each meeting a chance for conversations and most of the conversations are just small talk. Kind of like life. It is clear the events are all dreamed and so Tabucchi is free to talk to both friends and relations living and dead. But they say the same kinds of things to each other in the dream world that they did in real life. And the dream world is little different than the real world. That is the charm of the book. Life is a dream, so eat."}, {"review_sentiment": 5.0, "review_text": "Requiem: A Hallucination is a book in which the narrator is obviously a persona of the author.  The action takes place within a single day - the  action being a dream, an hallucination of the narrator.  The narrator is  introduced as he is annoyed that the person he is to meet has missed their  appointment at 12 noon - only to realize that 12 to a ghost is more likely  midnight.  The person he is to meet is not explicitly identified but is  most likely the poet Pessoa.The narrative then covers the time until the  midnight meeting.  In this time the narrator meets a drug addict in the  park, a seller of lottery tickets, a gypsy who reads his fortune, a dead  friend, a madame of an unsavory hotel, his deceased father, a barkeeper, a  painter of details from the Temptation of St. Anthony, a lighthouse  keeper's wife who is caretaker for a house in which he once lived, a former  lover, a seller of stories, and finally the intended guest.  Along the way  one gathers recipes, literary history, a bit of philosophy ...I highly  recommend this book; it is an excellent text to first encounter Tabucchi."}, {"review_sentiment": 4.0, "review_text": "This book suplies a very rich mix of portuguese culture, Lisbon City and a strugle of a narator to find meanings in his subconcient.  The author takes the reader in a journey thoug Lisbon and at the same time in a journey to his memories, doubts and feelings, meeting people from his past, and characters that represent parts of him self, like the \"seller of stories\". All of wich is seasoned by the narrators love of the food of Portugal. Finally he gets to confront some realy important characters in his unconcient and ends up arguing whiht who we can supose to be Fernando Pessoa -a poet- or Sigmund Freud -a Psychiatrist-  Reading this book gives me the feeling that the best things in life are the simple things, not meaning that all the rest must not be dealt with.  If you like stories abuot the inside world of characters, you wil ask yourself how could so much be put in few pages, and at the same time be a special 'travel giude` to Lisbon."}, {"review_sentiment": 5.0, "review_text": "The main character \" I \", meditates in a hot summer day and night in  Lisbon. A  wonderful account with a strong feel of the mediteranean culture, food and drink are carefully supplied. The action takes place in no more than a day and the book should be read as so"}]}, "authors": ["Antonio Tabucchi"], "isbn": "081121270X", "longitude": -9.1365061, "periods": ["1900s"], "title": "Requiem: A Hallucination", "word_cloud": "great novella supply rich mix portuguese culture struggle narrator find meaning subcontinent author take journey thou time journey memory doubt feeling meet people character represent part seller story winch season narrator love food get confront relay important character unconcient end argue whit suppose give feel best thing life simple thing mean rest like story inside world character wile much page time special born cultural consul live half year teach half year greatly admire write novella subtitle involve day age writer involve visit graveyard bordello crumble mansion coast culminates meal ghost poet tower figure literature translate write wife text occupy page page provide detail many portuguese dish mention text regret small amount time spend read heartily recommend characterization plot subject matter praise describe journey man city meet people dead alive otherwise desert peculiarity character fact lose superego consequence id subconscious fuddle contious mind hence maim live sort dreamworld world come dead slightly message leave speculate even basic premise story intrigue fails measure potential short nice winch offer anything think lightness make easy help least little bit familiar poet author figure meet novella short page lot chapter lot white space big print really amusing philosophical side little conversation little aside soon realize little aside amuse reference make modern literature well read also interest reference story write later come true kind mini meditation fact fiction follow law say life dream purposely stay surface thing real center substantial sustain ritual heart life least aspect life real seem page pas meeting chance conversation conversation small talk life clear event dream free talk friends relation live dead say kind thing dream world real life dream world little different real world charm dream eat lightness make easy help least little bit familiar poet author figure meet novella short page lot chapter lot white space big print really amusing philosophical side little conversation little aside soon realize little aside amuse reference make modern literature well read also interest reference story write later come true kind mini meditation fact fiction follow law say life dream purposely stay surface thing real center substantial sustain ritual heart life least aspect life real seem page pas meeting chance conversation conversation small talk life clear event dream free talk friends relation live dead say kind thing dream world real life dream world little different real world charm dream eat narrator obviously persona author action take place single day action dream narrator introduce annoyed person meet miss appointment noon realize ghost likely midnight person meet explicitly identify likely poet narrative cover time midnight meeting time narrator meet drug addict park seller lottery ticket gypsy read fortune dead friend madame unsavory hotel decease father barkeeper painter detail lighthouse keeper wife caretaker house live former lover seller story finally intend guest way gather recipes literary history bit philosophy highly recommend excellent text first encounter supply rich mix portuguese culture struggle narrator find meaning subcontinent author take journey thou time journey memory doubt feeling meet people character represent part seller story winch season narrator love food get confront relay important character unconcient end argue whit suppose give feel best thing life simple thing mean rest like story inside world character wile much page time special main character meditate hot summer day night wonderful account strong feel mediterranean culture food carefully supply action take place day", "genres": ["Memoir", "Fiction & Literature", "Travel Writing"], "summary": "A private meeting, chance encounters, and a mysterious tour of Lisbon, in this brilliant homage to Fernando Pessoa.\r\n\r\nIn this enchanting and evocative novel, Antonio Tabucchi takes the reader on a dream-like trip to Portugal, a country he is deeply attached to. He spent many years there as director of the Italian Cultural Institute in Lisbon. He even wrote Requiem in Portuguese; it had to be translated into Italian for publication in his native Italy.\r\n\r\nRequiem's narrator has an appointment to meet someone on a quay by the Tagus at twelve. But, it turns out, not twelve noon, twelve midnight, so he has a long time to while away. As the day unfolds, he has many encounters―a young junky, a taxi driver who is not familiar with the streets, several waiters, a gypsy, a cemetery keeper, the mysterious Isabel, an accordionist, in all almost two dozen people both real and illusionary. Finally he meets The Guest, the ghost of the long dead great poet Fernando Pessoa. Part travelog, part autobiography, part fiction, and even a bit of a cookbook, Requiem becomes an homage to a country and its people, and a farewell to the past as the narrator lays claim to a literary forebear who, like himself, is an evasive and many-sided personality.", "asin": "081121270X", "rank": "2497444", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/418XPEWN18L.jpg", "country": "Portugal", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}