{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.1494512, "ratings": {"num_ratings": 2, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "I bought this book as a gift for my girlfriend - she was delighted and together we have spent many happy hours reading it together.I would commend this anthology to any lover of poetry and prose that composes images in the mind and evokes feelings to share..."}, {"review_sentiment": 5.0, "review_text": "Every word of the selected poems will hook you in more deeply. I am sincerely tempted to learn Portuguese in order to read de Andrade in his own tongue. If you love language that sings humanities deepest themes in a straightforward manner then read these poems. You will be amazed.forbidden wordsto knowby heartwrite to a working poet in mexico city about de andrade:wituckatron@hotmail.com"}]}, "authors": ["Eugenio de Andrade"], "isbn": "0811215237", "longitude": -8.6107884, "periods": ["2000s"], "title": "Forbidden Words", "word_cloud": "buy gift girlfriend delight together spent many happy hour read anthology lover poetry prose composes image mind evokes feeling share word select poem hook deeply sincerely tempt learn portuguese order tongue love language sings humanities deepest theme straightforward manner words to heart write work poet mexico city wituckatron", "genres": ["Poetry"], "summary": "Award-winning poetry in a bilingual edition, by Portugal's best-known living poet.\r\n\r\nEugenio de Andrade is the author of twenty-nine volumes of poetry as well as numerous children's books, collections of prose writings, and translations into Portuguese of Sappho, Federico Garcia Lorca, and Yannis Ritsos. Forbidden Words: Selected Poetry of Eugenio de Andrade, is based on the poet's own retrospective Antologia Breve (\"Brief Anthology\") of 1998, expanded and edited for English-speaking readers by his longtime translator, Alexis Levitin.\r\n\r\nMarguerite Yourcenar spoke of \"the well-tempered clavier\" of Andrade's poems, Gregory Rabassa of his \"succinct lyricism...summing things up in a moment, much like haiku.\" His verse, deeply rooted in the rural landscapes of his childhood and in the ancient Greek lyric, have the clarity of light on sand, radiating pagan intimations of immortality.", "asin": "0811215237", "rank": "1807180", "city": "Porto", "image": "https://images-na.ssl-images-amazon.com/images/I/41Sg8bZ9WSL.jpg", "country": "Portugal", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}