{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 298, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I love historical fiction and this so exciting and interesting!! Great characters and story line!!  I was so disappointed when the story was over."}, {"review_sentiment": 5.0, "review_text": "The narrative had blood and sinew.  As such, I was engaged with the fierce drama of natural events as well as the complex situations contrived by the human element.  From beginning to end as the plot line developed both in admirable detail.  I would recommend this book to anyone interested in historical events such as this one and enjoys a good story.  I am short on anything to contribute in the way of criticism"}, {"review_sentiment": 5.0, "review_text": "Gripping and detailed historical fiction!  I guess that's what you would call a tale based on true events. Some poetic license is taken to enhance the story, but sticks to the true narrative. I was drawn in by the event and characters , read it in two sittings."}, {"review_sentiment": 5.0, "review_text": "I liked the book. The characters are rich and well drawn, the story is well woven and a unique version of well known events."}, {"review_sentiment": 5.0, "review_text": "Well written. Great story."}, {"review_sentiment": 5.0, "review_text": "Lots of actual history mixed in some fictional characters. I could not put it down!"}, {"review_sentiment": 2.0, "review_text": "The final third of this book is replete with repetition and information of little importance. Once the earthquake/fire is upon us, the story dead ends, but the book does not."}, {"review_sentiment": 5.0, "review_text": "Heart breaking yet I couldn't put it down,  it's like reading about the Titanic,  you know the outcome but can't stop."}, {"review_sentiment": 2.0, "review_text": "Disappointed with this book.....was expecting a good story on the great San Francisco earthquake ....found this a disjointed tale without much historical significance.....a struggle to finish."}, {"review_sentiment": 5.0, "review_text": "I rarely read fiction, but took a chance on this historical fiction story and am so glad I did.  I could not put this book down!  The characters will stay with you and inhabit your dreams.  Absolutely compelling story!"}]}, "authors": ["James Dalessandro"], "isbn": "0811849414", "longitude": -122.4192363, "periods": ["1900s", "Recent Releases"], "title": "1906: A Novel", "word_cloud": "love historical fiction excite interesting character story line disappoint story narrative blood sinew engage fierce drama natural event well complex situation contrive human element begin end plot line develop admirable detail anyone interested historical event enjoy good story short anything contribute way criticism grip detailed historical fiction guess tale base true event poetic license take enhance story stick true narrative draw event character sitting like character rich well draw story well woven unique version well know event well write story lot actual history mixed fictional character final third replete repetition information little importance story dead end break yet read know outcome disappointed expect good story great earthquake disjoint tale much historical significance struggle finish rarely fiction take chance historical fiction story glad character stay inhabit dream absolutely compel story", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Now available in paperback, James Dalessandro's \"riveting account of corruption, greed, and murder in the City by the Bay\" (Dallas Morning News) was a best-seller in hardcover and production has begun on a major motion picture. \r\n\r\nSet during the great San Francisco earthquake and fire, this page-turning historical novel reveals recently uncovered facts that forever change our understanding of what really happened. Narrated by a feisty young reporter, Annalisa Passarelli, the novel paints a vivid picture of the Post-Victorian city, from the mansions of Nob Hill to the underbelly of the Barbary Coast to the arrival of tenor Enrico Caruso and the Metropolitan Opera. \r\n\r\nCentral to the story is the ongoing battle fought even as the city burns that pits incompetent and unscrupulous politicians against a coalition of honest police officers, newspaper editors, citizens, and a lone federal prosecutor. \r\n\r\nJames Dalessandro weaves unforgettable characters and actual events into a compelling epic.", "asin": "0811849414", "rank": "856530", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51NY75RGJBL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}