{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 32, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Loved it, but it was way to short.  More like a novella."}, {"review_sentiment": 5.0, "review_text": "Any reader who has already been bitten with the Muriel Spark bug but has not got around to this story should embrace it eagerly. I’d call it one of her best (I have never yet read a bad one by her), but it probably needs some appreciation on the reader’s part of the atmosphere of England immediately after the war. Myself, I am not quite old enough to recall 1945 with any clarity, but come to that Dickens is before my time too. A little historical background goes a long way, and novelists of the calibre of Dickens or Spark will do the rest for us.Dame Muriel is very good at first pages, and the first page here is as good as any, easing the reader into the general scene and the particular atmosphere of middle-class young women improvising their lives in a house of multiple occupancy that has itself seen better days. The cast is fairly large for a short novel, but the effect created is of a kind of kaleidoscope, with the vivacious young things, plus a few who are not so young, flashing in and out of the narrative. There may or may not be a central character, and if there is it is presumably Jane, the first character named. One does not go to Muriel Spark for moral lessons, but this time she stays neutral – they do what they do because that is who they are. Conspicuously absent are the real rotters we find in some of her other novels, such as Patrick Seton or Father Socket in The Bachelors.One or two other standard Spark personae are given a rest this time. There are no Catholics for instance, unless one counts the young missionary, which I don’t. There are no Scots either, only one middle-aged spinster with a Scottish name. In particular there is a complete absence of the irrational, such as Mrs Hogg in The Comforters disappearing when alone because she has no private life. The author does not even tease us this time with inconclusive hints like the vague suggestions of a diabolic theme in The Ballad of Peckham Rye, much less go totally overboard into irrationality as she does in The Hothouse by the East River.The time-perspective flits around a bit, and that is certainly a Spark mannerism. However what I find very special here is the way the story bursts into abrupt action towards the end. It would be wrong to be specific about that in a review, and wrong in a different way because of the totally chance coincidence between my reading this book and a ghastly recent tragedy in London. The colours of the Spark kaleidoscope flare up threateningly, but the author stays in control, and there is maybe even a touch of rather uncharacteristic humanity this time.So, do I ‘recommend’ this novel? To tell the truth, I don’t know. I think it is rather marvellous, as I usually find Muriel Spark, but she may or may not be your cup of tea."}, {"review_sentiment": 2.0, "review_text": "Amusing but lightweight story -  nothing much to it."}, {"review_sentiment": 4.0, "review_text": "This short novel set in London during and after the Second World War excels at creating interest without wasting words. It would be a good choice for a book club--there is so much to wonder and talk about. The Kindle Edition, unfortunately, is liberally sprinkled with typographical errors. It's pretty clear that no one proofread it."}, {"review_sentiment": 4.0, "review_text": "A very sad, dark tale.  Bummed me out, hence 4 rather than 5."}, {"review_sentiment": 1.0, "review_text": "No story."}, {"review_sentiment": 5.0, "review_text": "Loved the book and will read it again"}, {"review_sentiment": 4.0, "review_text": "Muriel Spark's short 1963 novel The Girls of Slender Means offers both a philosophical punch and a wonderful description of life in England just as the Second World War was coming to an end. Except for a few critical interludes set in the early 1960s, most of the book takes place in in 1945 in the May of Teck Club, a kind of group home for young unmarried women \"of slender means\" in London similar to one Spark Herself lived in during the war. The narrative focus is on a small group that includes Jane, a self-important, overweight girl with a job in publishing; Joanna, a clergyman's daughter obsessed with reciting poetry; and Selena, a shallow, promiscuous beauty.The catalyst for the plot is the revelation that Nicholas Farringdon, a young anarchist who had a relationship with a couple of the May of Teck girls back in 1945, was killed in 1962 while serving as a Catholic missionary in Haiti. Jane's attempts to contact the various May of Teck inhabitants to tell them about Farringdon's death punctuates the narrative and leads to the dramatic climax that fuels Farringdon's conversion experience. Spark, a Catholic convert, often includes dramatic jolts in her novels, sort of like a low-grade British version of Flannery O'Connor, and there's one here near the end that is definitely O'Connor-esque."}, {"review_sentiment": 4.0, "review_text": "Probably like most people here I've come to this book having first read Muriel Spark's wonderful \"The Prime of Miss Jean Brodie.\"  \"The Girls of Slender Means\" has the same wonderfully sharp prose, which alone makes the book worth reading.Several people have commented that the beginning of the book is slow and that they were knocked out by the ending.  I had the opposite reaction: the beginning, with its incredibly evocative portrait of London in 1945, fascinated me.  The ending began to lose my interest a bit, though I can't reveal why without giving anything away.Still, all told, a highly recommended work.One word of caution, though: the Kindle edition is terrible, replete as it is with typos.  I make a point when reading Kindle books to report content errors, and I had to do it dozens and dozens in this very short book.  I hope New Directions makes the necessary corrections (some publishers seem to ignore them), because it was incredibly frustrating to run into mistakes page after page - really broke my reading flow."}, {"review_sentiment": 3.0, "review_text": "I've always wanted to read this author and this is my first book of hers. I wasn't overly impressed, found it slow going for the majority. It's a short book and a fast read and while the first third or so I found quite boring there comes a point when I became interested in how it would all turn out. The author uses foreshadowing throughout though, so it is no great surprise as to the end result. The story is both quaint and quirky, having some humorous moments and the writing is witty. Sparks takes a look at single women in the post-WWII era, where we have some who want to get a man and marriage, others who want independence and a career and others who are lost in a no-man's land. (pun intended) The book's title is even interpreted beyond the obvious meaning. I'd try another of Spark's books and while I'm not immediately \"wow\"-ed with this one I can see it growing on me."}]}, "authors": ["Muriel Spark"], "isbn": "081121379X", "longitude": -0.12574, "periods": ["1900s"], "title": "The Girls of Slender Means", "word_cloud": "love way short more novella already bite bug get around story embrace eagerly call best never yet bad probably need appreciation part immediately war quite old enough recall clarity time little historical background go long way novelist caliber rest good first page first good ease general scene particular atmosphere young woman improvise life house multiple occupancy see better day cast fairly large short effect create kind kaleidoscope vivacious young thing young flash narrative central character presumably first character name go moral lesson time stay neutral absent real rotter find novel standard persona give rest time instance count young missionary spinster scottish name particular complete absence irrational disappear alone private life author even time inconclusive hint vague suggestion diabolic theme much le totally overboard irrationality flit bit certainly mannerism however find special way story burst abrupt action towards end specific review wrong different way totally chance coincidence read ghastly recent tragedy color kaleidoscope flare threateningly author stay control maybe even touch rather uncharacteristic humanity recommend truth know think rather marvelous usually find tea amuse lightweight story nothing much short set excels create interest waste word good choice club much wonder talk unfortunately liberally sprinkled typographical error pretty clear proofread sad dark tale hence rather story love short offer philosophical punch wonderful description life come end critical interlude set early take place kind group home young unmarried woman similar live war narrative focus small group include job publish clergyman daughter obsess recite poetry shallow promiscuous catalyst plot revelation young anarchist relationship couple back kill serve missionary attempt contact various inhabitant tell death punctuates narrative lead dramatic climax fuel conversion experience convert often include dramatic jolt novel sort british version end definitely probably people come first wonderful wonderfully sharp prose alone make worth people comment begin slow knock end opposite reaction begin incredibly evocative portrait fascinate end begin lose interest bit give anything tell highly recommended word caution edition terrible replete typo make point reading report content error dozens dozen short hope make necessary correction publisher seem ignore incredibly frustrate run mistake page page really break reading flow always want author first overly impress find go majority short fast first third find quite boring come point become interested author use foreshadow great surprise end result story quaint quirky humorous moment write witty take look single woman era want get man marriage others want independence career others lose land pun intend title even interpret obvious meaning try immediately wow see grow", "genres": ["Fiction & Literature", "WWII"], "summary": "\"Long ago in 1945 all the nice people in England were poor, allowing for exceptions,\" begins The Girls of Slender Means, Dame Muriel Spark's tragic and rapier-witted portrait of a London ladies' hostel just emerging from the shadow of World War II.\r\n\r\nLike the May of Teck Club itself—\"three times window shattered since 1940 but never directly hit\"—its lady inhabitants do their best to act as if the world were back to normal: practicing elocution, and jostling over suitors and a single Schiaparelli gown. The novel's harrowing ending reveals that the girls' giddy literary and amorous peregrinations are hiding some tragically painful war wounds. \r\n\r\nChosen by Anthony Burgess as one of the Best Modern Novels in the Sunday Times of London, The Girls of Slender Means is a taut and eerily perfect novel by an author The New York Times has called \"one of this century's finest creators of comic-metaphysical entertainment.\"", "asin": "081121379X", "rank": "611874", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/41TFJDFJpzL.jpg", "country": "England", "story_arc": ["Tragedy", "Things only get worse"]}