{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 48, "rating": 4.0, "reviews": [{"review_sentiment": 3.0, "review_text": "(Spoiler alert) Narrator Ditie begins his tale with his first job, as busboy at the Golden Prague Hotel in the 1930s. From a lowly background, Ditie starts to make serious money, and can begin to indulge in the lifestyle of the wealthy guests, whether visiting the girls at the Paradise brothel or throwing handfuls of coins to the poor. The first section of the novel didn't seem to be going anywhere, with its stories of eccentric guests and staff and sexual adventures.Then comes the German occupation; Ditie falls for Nazi patriot Lise, to the disgust of his countrymen. And goes on to make it big in the hotel business, but loses it all...As Ditie finds himself in a surreal 'millionaires' prison' the whole thing started to become a bit Kafkaesque and I found my concentration waning.But in the final chapter, as he is coerced into - and comes to enjoy - a quiet contemplative life, working in the mountains, the writing really became very strong and thought-provoking. Former moments of glory, such as serving royal dignitaries, cease to have the same significance:\"I had obviously changed so much that no one could tell by looking at me that I really had served the Emperor of Ethiopia. But it meant something quite different to me now. When I mentioned serving the Emperor of Ethiopia, it was a way of making fun of myself, because I was independent now and beginning to find the presence of other people irksome, and I felt that in the end, I would have to speak only with myself, that my own best friend and companion would be that other self of mine, that teacher inside myself with whom I was beginning to talk more and more.\"A very unusual book which is difficult to review, a mixture of anecdotes and poetry, human desire for wealth, sex and status and a gradual enjoyment of simpler pleasures. Maybe a book about growing up?"}, {"review_sentiment": 1.0, "review_text": "i couldn't finish it..."}, {"review_sentiment": 4.0, "review_text": "This is a book which tracks a person from pre-WWII Czecholovakia till into the Communist take over.  I don't want to tell the story because that would spoil the reading of the book.  It is really quite well done and the characters rise, fall and salvation are well told."}, {"review_sentiment": 5.0, "review_text": "This is a stunning novel that explores WWII and the rise of communism in Europe from a unique perspective. Essentially, the novel is about a self-interested man who navigates major historical moments without taking part in them. The writing is magical, and Hrabal makes a character who is, by all rights, unlikable, into the centerpiece of a story that I could not put down, and that I cannot stop thinking about years after finishing the book. And all of this is done with a sly sense of humor that creates an amazing emotional tension with the reality of the story.In terms of historical novels and novels of social and political commentary, this ranks among the best. It illuminates a different side of the same themes that 1984, The Tin Drum, and Night all dwell on."}, {"review_sentiment": 5.0, "review_text": "He tells us that it is possible to be at peace with ourselves when we are honest about our history.  I read excerpts of this novel when studying Czech history, but the novel is about so much more."}, {"review_sentiment": 4.0, "review_text": "I was familiar with Bohumil's works. his one of the best check's authors ever."}, {"review_sentiment": 5.0, "review_text": "wonderful book, as are most of Hrabal's other novels"}, {"review_sentiment": 5.0, "review_text": "HRABAL is a genius. This may be his finest novel, though CLOSELY OBSERVED/WATCHED TRAINS is another piece of wonder."}, {"review_sentiment": 4.0, "review_text": "Intrigued by odd references to Hrabal and this book, I decided to take a stab, and I am glad for it. This will not be every reader's cup of tea, although I also am glad to recommend it:  The greater difficulty is explaining why.  Ultimately, I think it is that, while I did not like all of this book, I liked much of it a great deal.  It is inconsistent, often foolish, but also often painfully wise and thought-provoking --- it made me look at things a bit differently.  It is, to quote the hero's refrain, a story of how, time and again, \"the unbelievable became true.\"I leave to others to expand upon the narrative exploits of the bus-boy, waiter, lover, millionaire hotelier and tree-cutting, road-repairing protagonist.  Ditie (whose name we learn well along in the story) varies his own character and behavior from innocent to clever to bizarre --- and back.  I gather from other reviews that Hrabal was \"under the influence of French surrealism.\"  Aside from this influence playing a very amusing, direct role in the closing chapter, it may be that \"surreal\" is the best short descriptive of the book as whole.  Both tone and substance are absurd, and tragedy and comedy get at least equal time.  Yet, there are extended passages that are genuinely lyrical and nothing short of beautiful.  In the context of Czechoslovakia immediately before, during and after WW2, unbelievable things are constantly becoming true, and maybe that is the author's parable of life and what he intended to show to us.The book's jacket cover says that Hrabal \"died falling from the fifth floor of a Prague hospital, apparently trying to feed the pigeons, in 1997.\"  It would be difficult to imagine a demise more painfully and perfectly suited to his character, Ditie, or to life as portrayed in I Served the King of England."}, {"review_sentiment": 5.0, "review_text": "His best for sure!"}]}, "authors": ["Bohumil Hrabal"], "isbn": "081121687X", "longitude": 14.4212535, "periods": ["1900s"], "title": "I Served the King of England", "word_cloud": "alert begin tale first job busboy lowly background start make serious money begin indulge lifestyle wealthy guest visit girl brothel throw handful coin poor first section seem go anywhere story eccentric guest staff sexual come german occupation fall patriot disgust countryman go big hotel business lose find surreal prison whole thing start become bit find concentration final chapter coerce come enjoy quiet contemplative life work mountain write really become strong moment glory serve royal dignitary cease significance obviously change much look really mean something quite different mention serve way make fun independent begin find presence people irksome felt end best friend companion mine begin unusual difficult review mixture anecdotes poetry human desire wealth sex status gradual enjoyment simpler pleasure maybe grow track person till take want tell story read really quite well do character rise fall salvation well tell stunning explore rise communism unique perspective man navigate major historical moment take part write magical make character right unlikable centerpiece story stop think year finish do sly sense humor create amazing emotional tension reality term historical novel novel social political commentary rank best illuminate different side theme dwell tell possible peace honest history excerpt study history much familiar work best check author ever wonderful novel genius piece wonder intrigue odd reference decide stab glad cup tea also glad recommend greater difficulty explain ultimately think like like much great deal inconsistent often foolish also often painfully wise make look thing bit differently quote hero story time unbelievable become true leave others expand narrative exploit waiter lover millionaire hotelier protagonist name learn well story varies character behavior innocent clever bizarre back gather review influence french surrealism influence play amuse direct role closing chapter best short descriptive whole tone substance absurd tragedy comedy least equal time extend passage genuinely lyrical nothing short beautiful context immediately unbelievable thing constantly become true maybe author parable life intend show jacket cover say die fall fifth floor hospital apparently try feed pigeon difficult painfully perfectly suit character life portray best sure", "genres": ["Memoir", "Fiction & Literature", "Historical Fiction", "WWII", "Cold War", "Humour"], "summary": "In a comic masterpiece following the misadventures of a simple but hugely ambitious waiter in pre-World War II Prague, who rises to wealth only to lose everything with the onset of Communism, Bohumil Hrabal takes us on a tremendously funny and satirical trip through 20th-century Czechoslovakia.\r\n\r\nFirst published in 1971 in a typewritten edition, then finally printed in book form in 1989, I Served the King of England is \"an extraordinary and subtly tragicomic novel\" (The New York Times), telling the tale of Ditie, a hugely ambitious but simple waiter in a deluxe Prague hotel in the years before World War II. Ditie is called upon to serve not the King of England, but Haile Selassie. It is one of the great moments in his life. Eventually, he falls in love with a Nazi woman athlete as the Germans are invading Czechoslovakia. \r\n\r\nAfter the war, through the sale of valuable stamps confiscated from the Jews, he reaches the heights of his ambition, building a hotel. He becomes a millionaire, but with the institution of communism, he loses everything and is sent to inspect mountain roads. Living in dreary circumstances, Ditie comes to terms with the inevitability of his death, and with his place in history.", "asin": "081121687X", "rank": "166151", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/518A522qWsL.jpg", "country": "Czechia", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}