{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 4, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "I loved the book! It's 10 times better than the movie! It's even better if you know Portuguese and know how to pronounce the names it's intriguing and interesting."}, {"review_sentiment": 5.0, "review_text": "Superb, masterfully composed"}, {"review_sentiment": 5.0, "review_text": "It is a great novel that deserves to be widely read, very well translated (a difficult task, considering the complicated titles and forms of address practiced in 19th-century Portugal)."}, {"review_sentiment": 5.0, "review_text": "The Crime of Father Amaro was a revelation to this reader. It's not just breathtakingly satirical and (as other readers have noted) cynical, but it manages to combine this with real wisdom and compassion (a difficult trick to pull off, since cynicism is so often heartless); and (in this superb translation by Margaret Jull Costa) comes across as wickedly stylish and inventive in terms of its language. The range of characterization is masterly; and what I particularly liked was the way in which our sympathies change as we read on. Father Amaro appears more sinned against than sinning for about the first half of the book: we feel genuinely sorry for his social isolation and angry at the injustice of his enforced celibacy. But then, when we discover how selfish and corrupt he has become, while still acknowledging that society IS at least partly to blame, we gradually stop feeling that his actions are in any way justifiable. The tragic consequences of his behaviour come with a chilling suddenness and savagery, and there is a wonderfully ironic final section set some years later, which ferociously condemns not just Father Amaro himself but the whole of Portuguese society at this time. And how topical this book seems at a time when the Catholic Church is rent by scandals of a related kind!This is a truly great novel: it's up there with Crime and Punishment, Madame Bovary, and Anna Karenina as one of the titanic masterpieces of world fiction, and deserves to be much more widely known. I can't wait to read more of de Queiroz's fiction."}]}, "authors": ["Jose Maria Eca De Queiros", "Margaret Jull Costa"], "isbn": "0811215326", "longitude": -9.1365061, "periods": ["1800s"], "title": "The Crime of Father Amaro", "word_cloud": "love time better movie even better know know pronounce name intrigue interesting masterfully compose great deserve widely well translate difficult task consider complicate title form address practice revelation breathtakingly satirical reader note cynical manages combine real wisdom compassion difficult trick pull cynicism often heartless superb translation come wickedly stylish inventive term language range characterization masterly particularly like way sympathy change appear sin sin first half genuinely sorry social isolation angry injustice enforce celibacy discover selfish corrupt become still acknowledge society least partly gradually stop feeling action way justifiable tragic consequence behavior come chilling suddenness savagery wonderfully ironic final section set year later ferociously condemn whole society time topical seem time rent scandal relate kind truly great titanic masterpiece world fiction deserve much widely know fiction", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "An unflinching portrait of a priest who seduces his landlady's daughter, made into an acclaimed and controversial motion picture.\r\n\r\nEça de Queirós''s novel The Crime of Father Amaro is a lurid satire of clerical corruption in a town in Portugal (Leira) during the period before and after the 1871 Paris Commune. At the start, a priest physically explodes after a fish supper while guests at a birthday celebration are \"wildly dancing a polka.\" Young Father Amaro (whose name means \"bitter\" in Portuguese) arrives in Leira and soon lusts after―and is lusted after by―budding Amelia, dewy-lipped, devout daughter of Sao Joaneira who has taken in Father Amaro as a lodger. \r\n\r\nWhat ensues is a secret love affair amidst a host of compelling minor characters: Canon Dias, glutton and Sao Joaneira's lover; Dona Maria da Assuncao, a wealthy widow with a roomful of religious images, agog at any hint of sex; Joao Eduardo, repressed atheist, free-thinker and suitor to Amelia; Father Brito, \"the strongest and most stupid priest in the diocese;\" the administrator of the municipal council who spies at a neighbor's wife through binoculars for hours every day. Eça's incisive critique flies like a shattering mirror, jabbing everything from the hypocrisy of a rich and powerful Church, to the provincialism of men and women in Portuguese society of the time, to the ineptness of politics or science as antidotes to the town's ills. \r\n\r\nWhat lurks within Eça's narrative is a religion of tolerance, wisdom, and equality nearly forgotten. Margaret Jull Costa has rendered an exquisite translation and provides an informative introduction to a story that truly spans all ages.", "asin": "0811215326", "rank": "521866", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/51nVBjIaiuL.jpg", "country": "Portugal", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}