{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 38, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "This book is so touching - it just gets to you, and you won't be able to forget it, ever. I love all books by this author, but this one is my favourite."}, {"review_sentiment": 5.0, "review_text": "One of the greatest books of the 20th Century, by one of the greatest authors."}, {"review_sentiment": 5.0, "review_text": "It is a classic and you can easily understand why it is a classic beginning from the first page."}, {"review_sentiment": 4.0, "review_text": "The book is so much better than the movie. It was an enjoyable read."}, {"review_sentiment": 5.0, "review_text": "Such a tender and touching story.  Authentic voices from the characters.  Wonderful character development."}, {"review_sentiment": 4.0, "review_text": "the original French is better but this is a pretty good translation"}, {"review_sentiment": 5.0, "review_text": "Subtle writing through the eyes of a 14 year old Muslim boy in the environs of the hardscrabble Belleville section of Paris in the 1970s."}, {"review_sentiment": 5.0, "review_text": "Good"}, {"review_sentiment": 5.0, "review_text": "My favorite book ever. So fresh and funny and sad and beautiful."}, {"review_sentiment": 3.0, "review_text": "A rather strange book.  There are many interesting ideas in the book, but I found the writing style weak."}]}, "authors": ["Romain Gary"], "isbn": "081120961X", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Life Before Us", "word_cloud": "touch get able ever love author favorite greatest century greatest author classic easily understand classic beginning first much better movie enjoyable such tender touch story authentic voice character wonderful character development original french better pretty good translation write eye year old boy environs hardscrabble section good favorite ever so fresh funny sad beautiful rather strange many interesting idea find write style weak", "genres": ["Fiction & Literature"], "summary": "The Life Before Us is the story of an orphaned Arab boy, Momo, and his devotion to Madame Rosa, a dying, 68-year-old, 220-lb. survivor of Auschwitz and retired \"lady of the night.\"\r\n\r\nMomo has been one of the ever-changing ragbag of whores' children at Madame Rosa's boardinghouse in Paris ever since he can remember. But when the check that pays for his keep no longer arrives and as Madame Rosa becomes too ill to climb the stairs to their apartment, he determines to support her any way he can.\r\n\r\nThis sensitive, slightly macabre love story between Momo and Madame Rosa has a supporting cast of transvestites, pimps, and witch doctors from Paris's immigrant slum, Belleville. Profoundly moving, The Life Before Us earned France's premier literary prize, the Prix Goncourt.", "asin": "081120961X", "rank": "533019", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51lDUWehWZL.jpg", "country": "France", "story_arc": ["Tragedy", "Things only get worse"]}