{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 36.600256, "ratings": {"num_ratings": 50, "rating": 4.4, "reviews": [{"review_sentiment": 3.0, "review_text": "Love Big Sur.  Henry Miller?  Not so much."}, {"review_sentiment": 5.0, "review_text": "A masterpiece... Henry Miller, god sent. Shedding light with the might of his words. An amazing book; so real it becomes spiritual. A jewel, a delicacy, a channel from the gods."}, {"review_sentiment": 5.0, "review_text": "Bought this book for my husband and it has made him fall in love with Henry Miller's writing."}, {"review_sentiment": 5.0, "review_text": "great narrative"}, {"review_sentiment": 5.0, "review_text": "First off there can be a perceivable gap between 'good' and 'great' writing and although Miller's writing may not be 'great' when actually aligned with the greats of literature, it certainly is very good.  He is a perfect writer for describing the 'colony' of Big Sur in its early stages.  Primarily enjoyable because of the context Miller gives the experience.  Bravo!"}, {"review_sentiment": 4.0, "review_text": "Miller doesn't rush anything in \"Big Sur...\" and in the end, I appreciated this quality of the book.  Made me think generally, made me reflect personally, and made me reconsider how I was living and could be living.  Miller is good for that."}, {"review_sentiment": 5.0, "review_text": "Had never read Henry Miller before but Big Sur is one of my favorite places in the world so when I found out it was one of his favorite places in the world, too and that he lived there for 15 years, I decided to give the book a try.  It is absolutely outstanding!  I found myself highlighting, underlining, making notations in the margin and even journaling about many sections.  It is truly tremendous and I continue to re-read it, again and again.  It may not be everyone's cup of tea or even for most people but it is one of my all-time favorite books."}, {"review_sentiment": 4.0, "review_text": "Good transaction.  Decent book."}, {"review_sentiment": 5.0, "review_text": "Excellent book.  Quite different from what I would normally expect from Miller.  Really showed his humanity and his spiritual side.  Gave me a new respect for the man and writer."}, {"review_sentiment": 1.0, "review_text": "Hard to read.  Did not hold my interest."}]}, "authors": ["Henry Miller"], "isbn": "0811201074", "longitude": -121.8946388, "periods": ["1900s"], "title": "Big Sur and the Oranges of Hieronymus Bosch", "word_cloud": "not much masterpiece god send shed light word amazing real becomes spiritual jewel delicacy channel god husband make fall love writing great narrative first perceivable gap write writing actually great literature certainly good perfect writer describe early stage enjoyable context give experience rush anything end appreciate quality think generally make reflect personally make reconsider live good never favorite place world find favorite place world live year decide give try absolutely outstanding find highlight underline make notation even journalism many section truly tremendous continue everyone cup tea even people favorite good transaction excellent different normally show humanity spiritual side new respect man writer hard interest", "genres": ["Memoir", "Biography"], "summary": "In his great triptych \"The Millennium,\" Bosch used oranges and other fruits to symbolize the delights of Paradise.\r\n\r\nWhence Henry Miller's title for this, one of his most appealing books; first published in 1957, it tells the story of Miller's life on the Big Sur, a section of California coast where he lived for fifteen years.\r\n\r\nBig Sur is the portrait of a place―one of the most colorful in the U.S.―and of the extraordinary people Miller knew there: writers (& writers who didn't write), mystics seeking truth in meditation (& the not-so-saintly looking for sex-cults or celebrity), sophisticated children & adult innocents; geniuses, cranks & the unclassifiable.\r\n\r\nHenry Miller writes with a buoyancy & brimming energy that are infectious. He has a fine touch for comedy. But this is also a serious book―the testament of a free spirit who has broken through the restraints & cliches of modern life to find within himself his own kind of paradise.", "asin": "0811201074", "rank": "55485", "city": "Monterey", "image": "https://images-na.ssl-images-amazon.com/images/I/51jcngKWLML.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}