{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 22, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Thank you for updating an already terrific volume. My hometown that I love to hate to love."}, {"review_sentiment": 5.0, "review_text": "Great book with lots of useful, interesting ideas about what to do in LA.  Highly recommended."}, {"review_sentiment": 5.0, "review_text": "If you like \"weird\", well....it's all in the book. Have already visited a couple of places and was not disappointed. Recommend!"}, {"review_sentiment": 5.0, "review_text": "It is because of this book, this ONE book, that I love LA.I live in LA, though not technically, really. I live in Long Beach and we have this sort of bubble over our vastly diversified culturific coastal city that acts as a beacon or shield or (whatever) - many of us never venture all that far out of LB.But I do love LA - the 'off the beaten path, somewhat weird and definitely unexpected that is expected because well, it's LA' LA.I found all of that and more in the pages of LA Bizarro. Bars, restaurants, landmarks, destinations, hopes and dreams of bygone eras and not-so-distant pasta are all within the pages of this guide to the LA you SHOULD know.I referenced this book in a few yelp reviews I wrote years ago and Tony Lovett emailed me, offering to send me the revised edition since I had the first and it was getting pretty weathered, what with me marking pages with each newfound experience and fulfillment. I was thrilled (and did receive a copy). An incredibly nice guy."}, {"review_sentiment": 5.0, "review_text": "This is the gift that keeps on giving-- hilarious and truly valuable info! I give this book to all transplants to LA and they always love it. That and the Mugs from the LA Coroners Dept."}, {"review_sentiment": 5.0, "review_text": "Great little book full of info about L.A.  A must read if you live in or plan to visit L.A."}, {"review_sentiment": 5.0, "review_text": "Prompt delivery of this fine product."}, {"review_sentiment": 1.0, "review_text": "Pretty lame; we sent it back."}, {"review_sentiment": 5.0, "review_text": "TOP NOTCH ALL THE WAY!!! GREAT STUFF!!! AAAAAAAAAAAAAAAA++++++++++++++++++"}, {"review_sentiment": 5.0, "review_text": "even though many\\y of these places are long gone, their memories deserve the reincarnation this book providesplus..it is finny"}]}, "authors": ["Anthony Lovett", "Matt Maranian"], "isbn": "0811865118", "longitude": -118.244476, "periods": ["2000s"], "title": "L.A. Bizarro: The All-New Insider's Guide to the Obscure, the Absurd, and the Perverse in Los Angeles", "word_cloud": "update already terrific volume hometown love hate love lot useful interesting idea recommend like weird well already visit couple place disappoint love live technically really live long sort bubble vastly diversify culturific coastal city act beacon shield whatever many never venture far love path somewhat weird definitely unexpected expect well find page restaurant landmarks destination hope dream bygone era pasta page reference yelp review write year ago email offer send revise edition first get pretty weather marking page newfound experience fulfillment thrill receive copy incredibly nice guy gift keep give hilarious truly valuable info give transplant always love little full info plan visit prompt delivery fine product pretty lame send back top even place long go memory deserve reincarnation finny", "genres": ["Social & Cultural Studies", "Pop Culture"], "summary": "The cult classic is back! More than 10 years after pioneering the gonzo guidebook genre, this all-new edition of the beloved #1 best-selling guide to bad taste L.A. has been fully revised. Packed with 75% new material, L.A. Bizarro boasts scores of fresh discoveries plus original photos presented in luscious, lurid color. \r\n\r\nConnoisseurs of the weird and wonderful, Anthony Lovett and Matt Maranian steer readers into a world of culinary curiosities, morbid museums, sexual sideshows, and dipsomaniacal dives. From pet cemeteries to piata district, hundreds of odd and outr delights are laid bare for visitors and Angelenos alike.", "asin": "0811865118", "rank": "496308", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/516pOdJZn%2BL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}