{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 9, "rating": 4.0, "reviews": [{"review_sentiment": 2.0, "review_text": "2.5 of 5 stars –This play was supposedly, possibly a follow-up (not necessarily a sequel) to whatever happened to Tom when he left St. Louis in \"The Glass Menagerie,\" but where \"Menagerie\" shines, this one is an \"eh.\"Even though this was published late in Tennessee Williams' life, and the time period suggests that it does follow that of \"Menagerie,\" it was actually initially drafted before \"Menagerie,\" in 1939. Indeed, the playwriting seemed like a less mature TW.The plot and characterization was too disparate and choppy; it didn't hold together well. The characters consisted of a bunch of poor, down on their luck and ill people - mentally as well as physically - desolate, disturbed, depressed, dysfunctional, dying. Many good plays have such a menagerie; but in this case, it was not fun to watch because there wasn't enough there for me to become invested in their circumstances or fate. Not even it's reported claim could maintain my interest throughout - reportedly, this was TW's first unambiguous gay liaison on stage (I'm not sure, but I seem to recall at least one of his many previous short plays that had such a liaison).It was interesting how this seemed to be based on a snapshot in time of TW's life, his few months in New Orleans, before he became famous with \"Menagerie,\" just after he adopted his nom de plume in order to enter a NYC play contest but avoid being discovered that he was over the age limit. I was in fact intrigued how the characters in this play were inspired by his actual rooming house mates, and that they laid the foundation for similar characters in later plays, from Stanley Kowalski to TW himself in many other plays, most directly Tom in \"Menagerie.\"As put in the play by the MC/narrator/(TW?) himself: \"I've grown into a man, about to take his first step out of this waiting station into the world.\" For a quick stop, this was fine, but I've moved on now, too."}, {"review_sentiment": 4.0, "review_text": "Loses a star for diluting its focus and leaning a little heavily on the episodic, but this is one of Williams' finest character-driven pieces from his late period. Full of his customary flights of poetry and underrated humor."}, {"review_sentiment": 5.0, "review_text": "A really wonderful play. It can be seen as a sequel to the Glass Menagerie in sorts, and I personally think it is just as good. That is not a light statement for me, as I consider the Glass Menagerie to be one of the best plays ever written. It is a beautiful and delicate little memory play, and for the life of me I can't figure out why it isn't produced as often as his other plays. It is a special work and should be read, not just because of its author, but because of its quality."}, {"review_sentiment": 4.0, "review_text": "Tennesse Williams' plays after \"The Night of Iguana\" in 1961 were not commercially successful. Williams wrote \"Vieux Carre\" in the mid-1970s, drawing from his diaries and journals and from earlier plays and stories. The play failed on Broadway but had a successful run in 1978 in London.The play consists of two parts and twelve scenes.  Although it is intimate in tone, it requires a cast consisting of five men and five women. The play is autobiographical.  Williams revisits has days between winter 1938 and spring 1939 as a young and poor writer in a shabby rooming house in New Orleans' French Quarter. Williams gives the specific address: 722 Toulouse Street, but the portrayal is meant to be universal. Williams writes, \"In the barrenness there should be a poetic invocation of all the cheap rooming houses of the world.\" The play moves between the particulars of Williams' life as a young man of 28 and broader themes.The primary character is Williams himself but he is called simply and more suggestively \"Writer\".  He speaks directly to the audience as a narrator, on occasion, as well as being a participant in the play. The remaining characters in the play are tormented, each in their own way, as is the Writer. They include, the delusional, witchlike, and greedy landlady, a figure who symbolizes rooming house landladies everywhere, and her longsuffering aged servant Nursie,, an African American woman who suggests she would rather be a bag lady than to continue working in the rooming house. Besides the Writer, the other boarders in the house include Nightingale, a painter suffering from tuberculosis with whom Writer has his first, and unhappy, homosexual experience. Other boarders are two elderly and impoverished spinsters, and Jane and Tye. Jane is a designer from the northeast who comes to New Orleans when she learns she has a serious disease of uncertain nature. She becomes romantically involved with Tye, an addicted and criminal drifter who works as a barker for a strip club. The play develops the tensions of each of the boarders among themselves and with the landlady.The plot of \"Vieux Carre\" is loose and disjointed with more of a focus on characterization and language.  Williams mostly avoids sentimentality as he remembers his bohemian years and he also captures a degree of detachment in his memory. Loneliness and desperation form much of the lot of the Writer and of the other characters. In scene two, the stage directions describe the Writer as making a \"sound of dry and desperate sobbing which sounds as though nothing in the world could ever appease the wound from which it comes: loneliness, inborn and inbred to the bone.\" In the following scene, where the Writer visits Jane and Tye, the young woman describes herself as \"frantic with loneliness\".  Their lives play out for a short time with the writer faring better than the others. He meets a young musician, Sky, and is able to travel with him west to California to the call of a clarinet to begin the next stage of his life. The writer sees the door opening before him as offering a \"desperate undertaking\".  The writer looks back and forward -- to a life which he didn't know at the time would bring him success together with a great deal of misery. He remembers that old companions \"remain with you only as ghosts; their voices fading but remembered.\"In his new biography, \"Tennessee Williams: Mad Pilgrimage of the Flesh\" (2014), John Lahr describes \"Vieux Carre\" as \"a crepuscular spectacle of dead souls, [which] includes among its spectral figures the jejune Writer himself.\" Although the play failed on Broadway, Williams writing had beauty and strength.  Lahr quotes New York Times reviewer, Walter Kerr: \"Tennessee Williams' voice is the most distinctively poetic; the most idiosyncratically moving, and at the same time the most firmly dramatic to have come the American theater's way -- ever. No point in calling the man our best living playwright.  He is our best playwright and let qualifications go hang.\"\"Vieux Carre\" is a movingly effective play about loneliness and about the perils of creativity. Those who love Williams' more famous works will enjoy getting to know this under-appreciated play.  It is available in this separate volume and in the second of the two Library of America volumes devoted to the plays of Tennessee Williams.Robin Friedman"}, {"review_sentiment": 5.0, "review_text": "Fine."}, {"review_sentiment": 4.0, "review_text": "VIEUX CARRE was originally produced on Broadway in 1977, where it was a notable commercial failure at five performances.  The play requires five women and five men and is performed on abstract set representing a decayed boarding house in the New Orleans French Quarter in the late 1930s.Williams had tremendous success in the 1940s and 1950s, but he struggled to find a commercial voice in the 1960s and 1970s.  VIEUX CARRE is in some ways typical of his output at this time: long on atmosphere and character, short on actual plot, and more interested in tone than tangibles.  Although a nameless writer is technically the central character, the play is really an ensemble piece, a collage of the desperate.  Mr. Nightingale is a sketch artist who refuses to believe he is dying of tuberculosis; the sisters Mary Maude and Carrie are so poor they are literally starving to death and trying to get by scraping through trashcans on the street; Jane is a society girl on the run from a terminal medical condition.  All of them are dominated by the landlady, Mrs. Wire, a half-crazy, half-sly woman who bends the tenants to her will with constant threats of eviction.Williams was noted for the often sordid nature of his work, and it would be hard to imagine characters and situations more sordid than those presented here.  The circumstances are nasty, hard, and cruel; the characters are ineffectual, desperate, and (as Mrs. Wire, the landlady, points out) \"dying of loneliness.\"  It is a place where the only hope one can have is for subsistence survival.  It is not difficult to see why the play was unsuccessful; it is very dark, very impressionistic, and is more a series of vignettes than it is a seamless whole.  Nonetheless, this is very likely the best of William's later plays.  Strongly recommended.GFT, Amazon Reviewer"}, {"review_sentiment": 5.0, "review_text": "I just finished 'Vieux Carre' yesterday, and I hated that because I'd love to know what happened to the characters after the final scene!  I've loved Tennessee Williams for decades, but this was one of his works I wasn't familiar with.  By the end of the first page, I felt like I'd opened a gift."}, {"review_sentiment": 4.0, "review_text": "Based on Williams' own real life experiences while living in a boarding house at 722 Toulouse Street in New Orleans briefly in the late 1930s, Vieux Carre is one of his lesser known \"memory plays.\"It is somewhat narrated by \"the writer\" as he interacts with his land lord Mrs. Wire, her maid, and several other tenants. There's a sexually charged couple - Tye and Jane - and another older couple of female crones who think they are high society but are actually extremely poor. There's also a gay artist suffering from Tuberculosis who has a brief sexual encounter with the writer, the only homosexual scene Williams ever wrote for onstage.Obviously being a script, much is left up to interpretation. This play isn't as full as Glass Menagerie, but it still has its moments to shine. I'd still love to see this live on stage some day, but those curious readers who don't know much about the \"real life\" events of Williams life that inspired this work might find themselves bored or lost."}, {"review_sentiment": 5.0, "review_text": "*Vieux Carre* is probably the finest play of Williams' \"Late\" period--and it's terrific, though unfairly neglected.  It's much more like the earlier work in terms of a \"straight\" narrative, and as good as it is I think we'll be seeing many more productions of it in the future."}]}, "authors": ["Tennessee Williams"], "isbn": "0811214605", "longitude": -90.0701156, "periods": ["1900s"], "title": "Vieux Carre", "word_cloud": "star play supposedly possibly necessarily happen leave shin eh even publish late life time period suggest follow actually initially draft indeed play writing seem le mature plot characterization disparate choppy hold together well character consist bunch poor luck ill people mentally well physically disturbed depressed dysfunctional die many good play menagerie case fun watch enough become invest circumstance fate not even report claim interest reportedly first unambiguous gay liaison stage sure seem least many previous short play liaison interest seem base snapshot time life month become famous adopt order enter play contest avoid discover age limit fact intrigue character play inspire actual rooming house mat lay foundation similar character later play many play directly put grow man first step wait station world quick stop fine move loses star dilute focus lean little heavily episodic finest piece late period customary flight poetry underrate humor really wonderful play see sequel sort personally think good light statement consider best play ever write beautiful delicate little memory life produce often play special work author quality play commercially successful write draw diary journal earlier play stories play fail successful run play consist part twelve scene intimate tone require cast consist men woman play autobiographical revisits day winter spring young poor writer shabby room house french give specific address portrayal mean universal write barrenness poetic invocation cheap room house world play move particular life young man broader primary character call simply suggestively speak directly audience narrator occasion well participant play remain character play tormented way include delusional greedy landlady figure symbolize room house landlady everywhere long suffering age servant african woman suggest rather lady continue work rooming house boarder house include painter suffer tuberculosis first unhappy homosexual experience other boarder elderly impoverished spinster designer northeast come learn serious disease uncertain nature become romantically involved addict criminal drifter work barker strip club play develop tension boarder plot loose disjoint focus characterization language mostly avoid sentimentality remembers bohemian year also capture degree detachment memory desperation form much lot character scene stage direction describe make sound dry desperate sob sound nothing world ever wound come loneliness inborn inbred bone follow scene visit young woman describe frantic life short time writer fare better others meet young musician able travel west call clarinet begin next stage life writer see door open offer desperate undertake writer look back forward life know time success together great deal misery remember old companion remain ghost voice fade remember new biography describe crepuscular spectacle dead soul include spectral figure jejune play fail write beauty strength quote reviewer voice distinctively poetic idiosyncratically move time firmly dramatic come american theater way ever point call man best living playwright best playwright let qualification hang movingly effective play loneliness peril creativity love famous work enjoy get know available separate volume second volume devote play fine originally produce notable commercial failure performance play require woman men perform abstract set represent decayed boarding house french late tremendous success struggle find commercial voice way typical output time long atmosphere character short actual plot interested tone tangibles nameless writer technically central character play really ensemble piece collage desperate sketch artist refuse believe die tuberculosis sister poor literally starve death try scrap trashcans street society girl run terminal medical condition dominate landlady woman bend tenant constant threat note often sordid nature work imagine character situation sordid present circumstance nasty hard cruel character ineffectual desperate landlady point die loneliness place hope subsistence survival difficult see play unsuccessful dark impressionistic series vignette seamless whole likely best later play finish yesterday hat love know happen character final scene love decades work familiar end first page felt open gift base real life experience live boarding house briefly late lesser know memory play somewhat narrate writer interacts land lord maid several tenant sexually charge couple older couple female crone think high society actually extremely poor also gay artist suffer brief sexual encounter writer homosexual scene ever write script much left interpretation play full still moments shine still see live stage day curious reader know much real life event life inspire work bored lost probably finest play period terrific unfairly neglect much earlier work term straight narrative good think see many production future", "genres": ["Drama"], "summary": "Born out of the journals the playwright kept at the time, Tennessee Williams's Vieux Carré is not emotion recollected in tranquility, but emotion re-created with all the pain, compassion, and wry humor of the playwright's own 1938-39 sojourn in the New Orleans French Quarter vividly intact.\r\n\r\nThe drama takes it form from the shifting scenes of memory, and Williams's surrogate self invites us to focus, in turn, on the various inhabitants or his dilapidated rooming house in the Vieux Carré: the comically desperate landlady, Mrs. Wire; Jane, a properly brought-up young woman from New York making at last grab at pleasure with Tye, the vulgar but appealing strip-joint barker; two decayed gentlewomen politely starving in the garret; and the dying painter Nightingale, who tries to teach the young writer something about love--both of the body and of the heart. This is a play about the education of the artist, and education in loneliness and despair, in giving and not giving, but most of all in seeing, hearing, feeling, and learning that \"writers are shameless spies,\" who pay dearly for their knowledge and who cannot forget. Building on two decades of Williams scholarship since Vieux Carré was originally published, Robert Bray, editor of The Tennessee Williams Annual Review, has provided a new introduction for this edition, giving the most authoritative account yet of its background and genesis.", "asin": "0811214605", "rank": "330883", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51VfbvJYFHL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}