{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 159, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Loved the book."}, {"review_sentiment": 5.0, "review_text": "I found this a great read, similar to (but less detailed than) Kingsolver's \"Animal, Vegetable, Miracle,\" which is another favorite.The recipe for Soupe au Pistou is worth the price alone. I just adapted it to our local fresh veggies, and my daughter pronounced it absolutely delicious."}, {"review_sentiment": 5.0, "review_text": "Love the idea that this woman took off for a foreign land and culture and wasn't really prepared. Takes place in the very early '70s, when I was young and being much more conventional. Recipes follow every chapter. If you're an adventurous cook who likes to experiment with less popular cuts of meat, this books for you."}, {"review_sentiment": 3.0, "review_text": "This book was an ok read but not very well written and the plot was not very exciting. Would not reread"}, {"review_sentiment": 4.0, "review_text": "Though it was not what I was expecting, I found this very interesting.  I have always liked to read about that area and learned new things about it."}, {"review_sentiment": 5.0, "review_text": "I chose five stars because the book is wonderfully written and the author loves her subject.  I'd like to meet her and share an evening in Provence."}, {"review_sentiment": 4.0, "review_text": "It's a light read, enjoyable for foodies.  Exactly what it says, good food and simple pleasures shared amongst friends that become family."}, {"review_sentiment": 5.0, "review_text": "Beautifully written and well edited, this author has given generously of her feelings for France, food, family and friends. She has a keen eye for character and what sets one personality apart from another. I found myself looking forward to opening my Kindle and visiting with her, and sad to come to the last page.  A rich read!"}, {"review_sentiment": 3.0, "review_text": "I love France. Always dreamed of living in Provence. This book gave me a little taste of what it was like. The narrative feels jumpy to me, much like a slide show with no time line however. Still a good read with your coffee."}, {"review_sentiment": 5.0, "review_text": "I loved this book!  The winning combination of food and relationships is key."}]}, "authors": ["Georgeanne Brennan"], "isbn": "081185213X", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "A Pig in Provence: Good Food and Simple Pleasures in the South of France", "word_cloud": "love find great similar le detailed recipe au worth price alone adapt local fresh veggie daughter pronounce absolutely delicious idea woman take foreign land culture really prepared place early young much conventional chapter adventurous cook like experiment le popular cut meat ok well write plot excite reread expect find interest always like area learn new thing choose star wonderfully write author love subject like meet share even provence light enjoyable foodie exactly say share among st friend become family beautifully write well edited author give generously feeling family friends keen eye character set personality apart find look forward open visit sad come last page rich love dream live give little taste narrative feel jumpy much slide show time line however still coffee love win combination relationship key", "genres": ["Memoir", "Travel Writing", "Food and Wine"], "summary": "From the publisher of Under the Tuscan Sun comes another extraordinary memoir of a woman embarking on a new life this time in the South of France. \r\n\r\nThirty years ago, James Beard Award-winning author Georgeanne Brennan set out to realize the dream of a peaceful, rural existence en Provence. She and her husband, with their young daughter in tow, bought a small farmhouse with a little land, and a few goats and pigs and so began a life-affirming journey. \r\n\r\nFilled with delicious recipes and local color, this evocative and passionate memoir describes her life cooking and living in the Proven al tradition an entrancing tale that will whet the appetite and the spirit perfect for foodies, Francophiles, or anyone who's dreamed of packing their bags and buying a ticket to the good life.\r\n\r\n\"Georgeanne Brennan's captivating memoir reminds me of why I, too, was enchanted by Provence. She beautifully captures the details of living in a place where the culture of the table ties a community together—where everyone knows the butcher and the baker, and everyone depends on the farmers.\" Alice Waters, owner, Chez Panisse", "asin": "081185213X", "rank": "759497", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/61fPA1HS0BL.jpg", "country": "FR", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}