{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 9, "rating": 4.0, "reviews": [{"review_sentiment": 2.0, "review_text": "While well written, the story drags and any ominous sense of the oncoming Nazi regime is too light."}, {"review_sentiment": 4.0, "review_text": "Christopher Isherwood, inextricably associated with W.H.Auden and Stephen Spender, represents a kind of educated, literary, urbane Englishness, but with interests outside provincial England. Left wing, fairly openly homosexual (when it was illegal) intellectual, finely crafted poets, playwrights and or novelists. And sometimes moving between more than one genre, and even collaborating as writers.Cambridge educated – though he never finished his degree, Isherwood was drawn to the decadent, artistically modern, politically volatile city of Berlin at the tail end of the twenties and early thirties.In this book, - and in his more well-known one, Goodbye to Berlin – mainly because it was later turned into the movie, Cabaret – he recounts his experiences in that city, as political instability intensified, and lines of allegiance became sharply drawn, and the Nazi party, initially regarded as a kind of loony fringe, not to be taken seriously, began its terrifying rise.Isherwood casts himself as William Bradshaw, a young man, eager for the experience of living in another country, earning his living by teaching English to private students. Bradshaw meets the eponymous Mr Norris, striking up a conversation with him as a way to pass time on a long train journey.“As he spoke he touched his left temple delicately with his finger-tips, coughed, and suddenly smiled. His smile had great charm. It disclosed the ugliest teeth I had ever seen. They were like broken rocks”Norris is another Englishman, middle-aged, dissolute, clearly a not-to-be trusted wheeler-dealer of some kind, but his distinctly eccentric physical persona, and a strangely appealing charm, despite the obvious dishonesty, amuse Bradshaw, and the two form an unlikely friendship. Norris’s fastidious oddness - the wearing of bizarre wigs and an obsessive attention to prinkings and powderings not usually found at that time openly engaged in by English men, certainly not in England, is typical of the Berlin experience – decadent, sophisticated and utterly unprovincial, which proved alluring about to those seeking a more colourful, even dangerous, European experience. Norris, it later transpires, has predilections for a kind of wholesome sexual deviancy – he is open about his relations with a dominatrix and her ‘minder’ a young man who is a member of the Communist Party. It fact Anni, the whore, AND her minder Otto, are regarded as friends by Norris.Political affiliations are centre stage everywhere. Isherwood, and Norris choose the Left, even though Norris is not necessarily, ever, quite what he seems, and may have fingers in many pies, as he also has some friends whose political allegiance seem to belong more naturally to the right.What is marvellous about Isherwood’s writing, a kind of story telling journalism, an exploration of what it was like to be in Berlin, is that although he is undoubtedly writing about a period which became very dark and very dreadful, the second of his Berlin books, particularly, this is the undercurrent, flowing underneath a brilliant, light-touch observation. A sense of frenetic life, liveliness, wit and urbanity drive the book along, there is certainly more than a touch of fiddling whilst Rome burns about the Weimar republic.Norris himself is a quite extraordinary creation, and, just as Bradshaw is Isherwood’s novelising himself, Norris has a real origin – a friend of Isherwood’s, Gerald Hamilton, also a writer, and once known as ‘the wickedest man in Europe’. Hamilton was served time in prison for bankruptcy, theft, being a threat to national security, and, interestingly, numbered amongst his friends not only Isherwood himself, but the unlikely combination of Winston Churchill and Aleister Crowley!The reader quite falls, as Bradshaw does, under his dubious charm, and it is a strange experience to find oneself appreciating the strange moral ambiguity of someone who would undoubtedly sell his own grannie to the highest bidder, yet, somehow, even whilst grannie might even know that herself, he comes across as naughty, rather than vicious. Or, as Isherwood/Bradshaw puts it, so much more elegantly at the start of the novel:“My first impression was that the stranger’s eyes were of an unusually light blue. They met mine for several blank seconds, vacant, unmistakably scared. Startled and innocently naughty, they half reminded me of an incident I couldn’t quite place; something which had happened a long time ago, to do with the upper fourth classroom. They were the eyes of a schoolboy surprised in the act of breaking one of the rules. Not that I had caught him, apparently, at anything except his own thoughts; perhaps he imagined I could read them”"}, {"review_sentiment": 5.0, "review_text": "This novel -- almost a novella -- was originally published in the US edition of \"The Berlin Stories\" with \"Goodbye to Berlin\" so if you own that original volume, you're set. Isherwood's preferred title and the one used in the UK was \"Mr. Noris Changes Trains\", but his US publisher, as Isherwood put it, \"found this obscure,\" and so it became \"The Last of Mr. Noris.\" A fine read and a great companion piece to The Berlin Stories."}, {"review_sentiment": 5.0, "review_text": "Great novel. Interesting characters in a fascinating milieu, Germany before the ii world war."}, {"review_sentiment": 4.0, "review_text": "Isherwood is one of the best story tellers. HHe has always been under rated."}, {"review_sentiment": 5.0, "review_text": "An excellent piece of historical fiction. Set in Europe, mostly Germany, during the 1930s. In the novel Mr. Norris is a compatriot and a friend of Christopher Isherwood. He is a rather unscrupulous businessman who is one-step ahead of his creditors and authorities. Thus, he's constantly \"changing trains\"."}, {"review_sentiment": 4.0, "review_text": "The author tells a story from the beginning of the nineteen thirties and from a Berlin which has still not realized how dangerous the political situation is. The book is not political, but politics give never the less a background for the story. Social democrats, communists and nazis are still fighting, but ordinary people really don't care, at least not yet. But at the end of the story you understand what way things are going. A lot of different characters and their acting under these circumstances are described, objectively,completely without prejudice or other strong feelings. Altogether, the book gives a good impression of the atmosphere in Berlin before the great disaster."}, {"review_sentiment": 4.0, "review_text": "Direct and compelling - a not-so mysterious mystery about complex actors.  A real sense of Berlin society in transformation, but even more so about human relationships. ."}, {"review_sentiment": 4.0, "review_text": "This novel describes well the decadence of pre-Hitler's Germany: dining cars on trains, made-up jobs to save unemployment, German bureaucracy with its officials hurrying about with files.It also portrays effeminacy: `Held my hand for long time', welcomed me to the shadow of my humble roof-tree', a greybeard with one foot in the tomb. How cruel youth is, was too delicate to go to school, had a house full of bronzed boys who played practical jokes on him, beautiful things-the flesh cannot give us happiness, only the spirit, `So particular..more like a lady than a gentleman', thinning eyebrows, not plucking, never shaves himself, potions and lotions, a suit for every day, nine years' money spent in two and silk underclothes.Baron (Kuno) von Pregnitz wears a monocle, `tortured himself daily on an electric horse', has `taken a great fancy to you', his `foot pressed on mine under the table, his `hand took mine under the fur rug' in car, invites him in, he devoted himself entirely to the shy boy PietThen there's the politics of the period: election posters being written over with different candidates, \"Are you of true Aryan descent?\", \"Had they no national pride to be mixing with Jews who were ruining their countries?\" \"There's lots of old scores being paid off nowadays.\"Many are in exile: the vagrant and exiled status. `I couldn't change into a different character; therefore I must change my domicile' - Davidson. The pursuit of lifestyle requires a journey away from British class system - the world at large is their finishing school. Is the tourist more a parasite than a pioneer? `The type of tourist who takes in the whole of Rome in one day.' There is aloneness and separation, the search for a homeland, the sexual rebel. Isherwood later contrasts his sinful European self with his redeemed American Vedanta self.Social Class: British fiction is invariably considered from a middle/upper class male point of view. The working class male may be an object of desire but is rarely the protagonist. `Christopher's kind are able to adventure outside their own class and society.' The new kind of homosexual is accepting, proud and defiant.Regarding older men, there is a fascination with eccentricities in portraying individuals whom respectable society would shun, especially comic pathos of older men. In later novels they are portrayed more fully as individuals, not just as pawns in the game against `the others'. Narrators are often weak characters fascinated by strength of character - the popular image of the homosexual male"}]}, "authors": ["Christopher Isherwood"], "isbn": "0811220265", "longitude": 13.3888599, "periods": ["1900s"], "title": "Mr Norris Changes Trains", "word_cloud": "well write story drag ominous sense oncoming regime light inextricably associate represent kind educate literary urbane interest provincial wing fairly openly homosexual illegal intellectual finely craft poet playwright novelist sometimes move genre even collaborate educate never finish degree drawn decadent artistically modern politically volatile city tail end twenty early mainly later turn movie recount experience city political instability intensify line allegiance become sharply draw party initially regard kind loony fringe take seriously begin terrify cast young man eager experience live country earn live teach english private student meet eponymous strike conversation way pas time long train spoke touch left temple delicately cough suddenly smile smile great charm disclose ugliest teeth ever see like broken rock dissolute clearly trust kind distinctly eccentric physical persona strangely appeal charm obvious dishonesty form unlikely friendship fastidious oddness wear bizarre wig obsessive attention printing powdering usually find time openly engage english men certainly typical experience decadent sophisticate utterly provincial prove allure seek colorful even dangerous european experience later transpire predilection kind wholesome sexual deviancy open relation dominatrix minder young man member fact whore minder regard friend affiliation center stage everywhere choose even necessarily ever quite seem many pie also friends political allegiance seem belong naturally marvelous writing kind story tell journalism exploration undoubtedly write period become dark dreadful second particularly undercurrent flow underneath brilliant observation sense frenetic life liveliness wit urbanity drive certainly touch fiddle whilst burn quite extraordinary creation novelize real origin friend also writer know wickedest man serve time prison bankruptcy theft threat national security interestingly number among st friend unlikely combination quite fall dubious charm strange experience appreciate strange moral ambiguity someone undoubtedly granny highest bidder yet somehow even whilst granny even come naughty rather vicious put much elegantly first impression stranger eye unusually light meet mine several blank second vacant unmistakably scar innocently naughty half remind incident quite place something happen long time upper fourth classroom eye schoolboy surprise act break rule not catch apparently anything thought perhaps imagine almost novella originally publish edition original volume set prefer title use publisher put obscure become last fine great companion story character fascinate milieu ii world war best story teller always rat excellent piece historical fiction mostly compatriot friend rather unscrupulous businessman ahead creditor authority thus constantly change author tell story begin nineteen thirty still realize dangerous political situation political politics give never le background story communists nazi still fight ordinary people really least yet end story understand way thing go lot different character act circumstance describe objectively completely prejudice strong feeling altogether give good impression atmosphere great disaster direct compel mysterious mystery complex actor real sense society transformation even human relationship describe well decadence din car job save unemployment german bureaucracy official hurry also portray effeminacy hand long time welcome shadow humble graybeard foot cruel youth delicate go school house full bronze boy play practical joke beautiful flesh happiness spirit lady gentleman thin eyebrow pluck never shave potion lotion suit day year money spend silk wear daily electric horse great fancy press mine table take mine fur rug car invite devote entirely shy boy politics period election poster write different candidate be true descent national pride mix ruin country lot old score pay nowadays many exile vagrant exile status different character therefore pursuit lifestyle require journey away british class system world large finishing school tourist parasite pioneer type tourist take whole day aloneness separation search homeland sexual rebel later contrast sinful european self redeem american fiction invariably consider class male point view work class male desire rarely protagonist kind able adventure class society new kind homosexual accepting proud older men fascination eccentricity portray individual respectable society especially comic pathos older men later novel portray fully individual pawn game others narrator often weak character fascinate strength character popular image homosexual male", "genres": ["Fiction & Literature"], "summary": "Two Englishmen meeting on a train to Berlin in 1930 kick off one of Isherwood’s most enduring novels\r\n\r\nOn a train to Berlin in late 1930, William Bradshaw locks eyes with Arthur Norris, an irresistibly comical fellow Englishman wearing a rather obvious wig and nervous about producing his passport at the frontier. So begins a friendship conducted in the seedier quarters of the city, where Norris runs a dubious import-export business and lives in excited fear of his bullying secretary, his creditors, and his dominatrix girlfriend, Anni. \r\n\r\nAs the worldwide economic Depression strangles the masses and the Communists make a desperate stand against Fascism and war, Norris sells himself as political orator, spy, and double agent. He also sells his friends. \r\n\r\nLike its companion novel, Goodbye to Berlin, Mr Norris Changes Trains offers unforgettable characters struggling in the vortex as the Nazis rise to power.", "asin": "0811220265", "rank": "915246", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/414N4kqJ-2L.jpg", "country": "Germany", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}