{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 125, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Fun and provacative accounts of life in Berlin's era of freedom and sexual exploration pre-WW2"}, {"review_sentiment": 5.0, "review_text": "Amazing... that kind of book so well written that it seems efortless. Sad it is over."}, {"review_sentiment": 4.0, "review_text": "Nothing wrong with the book just the author"}, {"review_sentiment": 5.0, "review_text": "Good historical read."}, {"review_sentiment": 5.0, "review_text": "Great. Thank you."}, {"review_sentiment": 1.0, "review_text": "Wasn't quite what I thought it would be.  Too much emphasis on pre Nazi homo sexuality.  I never was able to comprehend the whole \"Cabaret' bit anyway.  Sorry, not that modern.Ed Coates"}, {"review_sentiment": 5.0, "review_text": "Isherwood's prose and gleaming of light into dark spaces is beautiful. I will be portraying the Emcee in the national tour of Cabaret (the Kander & Ebb musical based off of these stories) and this piece has been a pleasure to research."}, {"review_sentiment": 5.0, "review_text": "I plan to read more of Isherwood's work."}, {"review_sentiment": 2.0, "review_text": "The next book on my list of books to read was Goodbye to Berlin by Christopher Isherwood.  I was able to find it on sale at Audible for around $5 so I thought I'd get it and listen to it in my car on the way to and from work.  The audio file, titled The Berlin Stories, contained both Goodbye to Berlin and The Last of Mr. Norris which is a novella that takes place prior to the events in Goodbye to Berlin.  Audible is a great website to find and download audio books to listen to.  I have a 45 minute commute to work so I find I prefer to listen to books instead of music because it helps to pass the time.  I am glad that the book did not cost me very much because I didn't really enjoy it.  If I had to pick one story over the other, I’d say I liked The Last of Mr. Norris better because it had more of a plot.  There wasn’t a whole lot going on in the second story.  I didn’t feel connected to any of the characters, they were sort of superficial and self-absorbed.  The main character is living in a time where the Nazis are starting to rise into power and Jewish business owners in Berlin are being discriminated against and all he cares about is going to parties and trying to get people to like him while pretending he doesn’t care if people like him.  I was hoping for something with a bit more substance, something that gave an idea of what it was like to be alive in a time of such upheaval.  Instead this novel mostly consists of shallow, emotionally detached characters who don’t seem to care very much about what’s going on around them.  You never get a real sense of how they feel about anything other than gossip and themselves.  I was disappointed, and wouldn’t recommend reading this.  I have read that this is one of the author’s earlier works though, I may give one of his later books a try because there is good writing here, even though the characters and plot line are a bit under developed."}, {"review_sentiment": 4.0, "review_text": "The reader sees pre-Nazi Berlin through the eyes of Christopher Isherwood.  This is not one smooth story.  Its jumps in time and in place, leaving the reader disjointed at times.  But I for one enjoyed that.  I think it added to the atmosphere that Christopher is working to expose.  Berlin is full of discordant forces and colorful characters.I really felt I got to know what Berlin was like during this time period.  And this is a time period I've always been a bit fascinated by, as I'm not going to lie, I am a huge fan of the play Caberet.  So getting to know Sally Boyles again was a true pleasure!"}]}, "authors": ["Christopher Isherwood"], "isbn": "081121804X", "longitude": 13.3888599, "periods": ["1900s"], "title": "The Berlin Stories", "word_cloud": "provocative account life era freedom sexual exploration amaze kind well write seem effortless nothing wrong author good historical quite think much emphasis per homo sexuality never able comprehend whole bit anyway prose gleam light dark space beautiful portray national tour musical base piece pleasure research plan work next list able find sale audible think get listen car way work audio file title contain last novella take place prior event great website find download audio listen minute commute work find prefer listen instead music help pas time glad cost much really pick story say like last better plot whole lot go second story feel connected character sort superficial main character living time start rise power business owner discriminate care go party try get people pretend care people hop something bit substance something give idea alive time upheaval instead mostly consist shallow emotionally detached character seem much go never real sense feel anything gossip disappoint recommend reading author earlier work later try good write even character plot line bit develop see eye smooth story jump time place leave disjoint time enjoy think add atmosphere work expose full discordant force colorful really felt get know time period time period always bite fascinated go lie huge fan play get know true pleasure", "genres": ["Memoir", "History", "Weimar Republic"], "summary": "A classic of 20th-century fiction, The Berlin Stories inspired the Broadway musical and Oscar-winning film Cabaret. First published in the 1930s, The Berlin Stories contains two astonishing related novels, The Last of Mr. Norris and Goodbye to Berlin, which are recognized today as classics of modern fiction.\r\n\r\nIsherwood magnificently captures 1931 Berlin: charming, with its avenues and cafes; marvelously grotesque, with its nightlife and dreamers; dangerous, with its vice and intrigue; powerful and seedy, with its mobs and millionaires. This is the period when Hitler was beginning his move to power.\r\n\r\nThe Berlin Stories is inhabited by a wealth of characters: the unforgettable Sally Bowles, whose misadventures in the demimonde were popularized on the American stage and screen by Julie Harris in I Am A Camera and Liza Minnelli in Cabaret; Mr. Norris, the improbable old debauchee mysteriously caught between the Nazis and the Communists; and the distinguished and doomed Jewish family, the Landauers.", "asin": "081121804X", "rank": "84996", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/31FjMR9MOKL.jpg", "country": "Germany", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}