{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 19, "rating": 4.3, "reviews": [{"review_sentiment": 2.0, "review_text": "I'm not a poetry person (I've written it but I don't like to read it, ha) so this was solely read to fulfill a task in 2 challenges I'm doing this year. The first two-thirds of this edition were a biography of Charles Baudelaire. I did like the prose poem format better than verse poem format. It was easier to read and understand though still flowery. More like very short stories than poems. I can't say I remember any of them, they didn't really stick out for any reason, not very memorable."}, {"review_sentiment": 5.0, "review_text": "Wonderful!"}, {"review_sentiment": 5.0, "review_text": "Baudelaire and Poe are two of the most intriguing literary personalities of the nineteenth century -- and to think Baudelaire was Poe's French translator!"}, {"review_sentiment": 5.0, "review_text": "I've found this big small book of prose poetry to be a gem amongst Baudelaire's work, a book which activated in me a mindful contemplative approach to poetry yielded and made possible by the one and only daring one, dear Charles Baudelaire.  Attaining such potentiality that I literally carried this book of poetics around with me for about a quarter of a year -- taking small bites of daily prose so I could explore as a kind of daily meditation.  I can report with clear recollection a uniquely powerful artistic maneuvering made possible by times remarkably clear and vital forces like a Baudelaire pens for us potentiality he dares of us to reach with might a knowing of language anew that seemingly was dear Baudelaire's pinnacle yield of explorative poetics baring both a far reaching scope as well as a breathless immediacy we meet with an excited readiness we seem to have saved up for Baudelaire himself.  I can only hope you meet his searing adeptness of a spinning language all his own that we are enthralled to experience -- providing a kind of rapture that beautifully original power makes the very passing of time speed up in an attempt to try to catch up with such fresh gestures one can only pen after a life committed to a natural fusion of our deeply individual place of oneness and of being we creatives can dare to bare a responsibility there of.  Dear Baudelaire provides us here in PARIS SPLEEB a striking set of poetics that bares a relevance today as vivid modernism we seem to need to remember in an era of expansive and unyielding equality that we find ourselves amidst this contemporary era -- Baudelaire's seemingly historic recollecting of singular modernism that gives us a clarity of understanding just how indeed we have found ourselves amidst our current era.  Thus relevant now even after over a hundred years have passed this small big book -- giving us a relevance of an impression of just how this poetry may have been met and giving us a glimpse of breaking the binder of this poetic book we just may sneak to catch a glimpse of how this work may have been met so many years ago.Dear Baudelaire approaches this work coming off a work as definitive of the poet finding his stride and adept command he realized amidst the blooms that signify his FLOWERS OF EVIL.  He can command with searing expressive power only because he is working amidst his own racing stride -- poetry that catches poignant poetics with the work almost being but bate for the catch of striking depth he could only here have hooked and told us the story thus of his catch.  This is perhaps why people may speak of dear Baudelaire with a special intimacy of the man because he caught his voice and lived to also tell us with vital clarity of our thus shared approach to creative expression.  With no romance and no misleading sentimentality are but just small aspects of how he can yield such definitive strength of stature that holds steadfast to an accurately beautiful poetics we may experience because in PARIS S his poetic expression that yields a significant creative force that he wills himself with adept ease and immediacy here into the firm footing of a European canon of poetic work making Charles Baudelaire both widely celebrated and intimately read as any pen to paper expression spanning the poetic landscape and finding itself attaining critical relevance of a psyche evolving amidst a poignant searing of modernists expression that demands of us to meet the poet with so much as we can meet the poet with a matched, respectively appropriate seriousness that Baudelaire even after a thorough familiarity of PARIS SPLEEN reaches to attain a work we can endevour to approach that I can with confidence convey a expressive poetics here that bares new discovery and adept layering that with each read and each time we revisit PARIS SPLEEN yields an illicit potential for discovery that we continue to find new elements of this piece as any seriously considered piece of visual art provides for the viewer.  Baudelaire maneuvers a language and breathless power that provides both the contemplative and the most immediacy we may dare to reach for in PARIS SPLEEN.  How Baudelaire approaches such a work of explorative refinement is most complex in he catches searing modernism as relevant as the day it broke its binding over a hundred years ago -- a modernism with illicit brilliance that even experienced in a now contemporary placement amidst a history unfolding with time itself opening up here a modernistic relevance that in a contemporary landscape of art experience we do well to remember such striking, daring and searing beauty that excites in us a compelling relationship with that with Baudelaire's poetic responsibility to spin an interplay of poetics that is simply and qualitatively exciting.  We meet a genius poet at a time amidst him catching a powerful stride and with a seasoned command of his life's searching and committed expression he embarked upon years before he found himself attaining a state of BEING when making precursors to this mighty and little book Baudelaire explored to realize when he unveiled his pen and poetic gestures that make FLOWERS OF EVIL a necessary expression that was necessary for Baudelaire to even approach these prose with an inertia which he with the succession of FLOWERS, his sense of searing command and ferocity of personal pivoting, of a footing so solid amidst his own spinning command of language that he dares to realize his creative individualism that with each complex approach to new explorative prose work he pens an individuate on rarely communicated with such vivid intamacy of personal expression that we hear the very things he has wished to tell us all in a tone made so clear and of unyielding strength of character that we rarely meet as a reader of quality poetic musings.  He impresses upon each of us a signiture and clarity of commanding vocal prowess that stays with us reminding us ever so after of the time we met the genius a dear poet we candidly can remember as dear Charles Baudelaire a poignant artist of such a quality we may dare thereafter to ask for in any poet we meet after dear Baudelaire.  His scope and contribution is wide and true -- and he continuous to illicit devoted readers all the time that we can somehow identify as a knowing of a most special man met in true form via his striking genius that he dares to attain a personality so daring he can sim produces that at its core has that signature Baudelaire air of cunning  such quality and of significant creative expression  a poet he is and just what a poignant stature he approaches the explorative prose found here.  PARIS SPLEEN comes at a pivotal moment in Baudelaire's creative fruition approaching this work after recently coming off his historically signature work FLOWERS OF EVIL.  Approaching a relatively new form of poetics after attaining such momentous stride found thereafter FLOWERS, how he arrives at a given piece of prose here marks an occasion where the man attained a mastery of language and expression so to reach further here in this small piece when compared to the signature grandeur that is a FLOWERS OF EVIL.  We see seasoned genius mid-stride here pivoting and maneuvering his poetics in ways that further speak to us of the quality of the man here.  A small piece in page count and in form serves to bare a succession of poignant creative expression that elevates this gem of a piece so that it may age as striking poetry as a piece into itself -- while attaining a signature expression immediately made ceitical in being a vital aspect of his works that without PARIS SPLEEN would miss a special aspect of what has come to know as an aspect of Charles Baudelaire's total image.  How he arrives at the poetic movements and adept command here in this little book bares a ferocious stride and searing poetic maneuvering that signifies a point in his creative expression where he has dared to reach a place of masterful being and transcending a seemingly simple, short piece of poetry upon a level of grandeur that elevates the prose here onto a level of striking command and write seemingly with a new found ease of immediacy that dares itself to new heights of transformative expression that is important work in itself -- as well as going down as a vital aspect of what historically makes up Baudelaire's totality of creative expression that with searing expression he wills himself into the canon of European poetics with an ease of stride while keeping the work up so far as never letting the dynamic power get away from him throughout his work here.  He thus deems PARIS SPLEEN as a remarkably special book of historic relevance onto itself as a critical work of poetic quality that sustains itself so to age with its original relevance that it unveiled upon the works release.  A work here that attains itself as a critical aspect of what collectively comprises Baudelaire's total image.  A collection of Baudelaire without PARIS SPLEEN is apparently incomplete in his individual reach serving as these prose being elemental in significance alongside his other works that all together comprise the total and striking individual totality that portraits for us a historically complete rendering of complete and characteristic totality that a collection yielding a total image of Baudelaire that a collection without PARIS SPLEEN is apparent in its incomplete portraiture of a genius in his own right with a ferocity and adeptness that all together bare with picturesque portraiture that PARIS SPLEEN demands itself to serve as a critical aspect of Baudelaire's total image -- of his total expression.  Any collection of Baudelaire's work that finds PARIS SPLEEN missing would ultimately be a missed opportunity of baring all his critical aspects so collectively can age thus hereafter as being of accurate expression of characteristic quality so all together may enter the canon of Europe's poetic landscape that dear Baudelaire is a daring and afe would thus be incomplete.  The quality of poetics thus stands up to seemingly larger bodies of work that are widely popular signature work -- lending a versed and depth of understanding his work giving us an intimate knowledge of his total image.So here we find such poignant gestures that reach a heightened place of expression that dare to attain a searing realization of each and every moment's given potential for a remarkably individualistic complete creative expression uniquely Baudelaire in nature.  This little book thus provides a special arena for Baudelaire to pivot his poetics into new and vital places having just coming off the more characteristic pieces of his.  His stride is sustained yielding this explorative and refined prose book.  And by doing so we see a seasoned mastery over form that is powerful in itself -- while establishing an aspect of Baudelaire that any collection of his writing would be missing without the presence of PARIS SPLEEN.  This small book achieves a necessary aspect in what Baudelaire's total image consists of -- even with FLOWERS OF EVIL the small space he works within here provided readers something new.  Working in seemingly small gestures we come to know Baudelaire in a more succinct and complete way that even his more grandiose work couldn't reach. With a new seasoned stride we get the sense of his BEING and command over his work here as he approaches new forms and approaches to creative expression.  PARIS SPLEEN marks a work here that he was able to catch a new language and say something new to us.  Now having good hundred years pass PARIS SPLEEN allows us an opportunity to catch a glimpse that must have been strikingly beautiful at the time.  We see a creative work having aged very well while retaining a relevance and vitality.Before we open this small book of prose poetry, and even still, before we begin reading PARIS SPLEEN's first section -- Baudelaire is already working to engage the reader and here impresses upon us one of the pieces first ideas presented to us:  that which PARIS SPLEEN seemingly may be about.  That the title PARIS SPLEEN communicates to us a unique combination of ideas along with the cover art -- that together produce the possibility for the reader to arrive at the idea of the book's title suggesting that PARIS SPLEEN is a documentary work.  An idea we seemingly discover on our own YET without question is directly from the place of Baudelaire's originally adept craft and understanding of the reader's experience.  With a Socratic touch only made detectable in hindsight, we discover this poignantly raw Baudelaire curiosity -- the idea bubbles up that PARIS SPLEEN could very well be a diary of a man living in the city he calls home, Paris.  This intimacy somehow stays with us throughout the read.  Even if this first idea falls flat in passing -- the subtle maneuvering of the poet at work here is seen activating the reader while never dropping the poetics dynamic swells of inertia and visceral body of a tactile material.  Baudelaire coming off more sin a way unique to the stuff of really fine poetry.And more importantly, he attains a command of that which any artist is ultimately responsible for -- the passing of time.  So as we then seem to push alongside with the artist an element of the book is established:  an active questioning becomes part of how we read PARIS SPLEEN and how it reads us.  Now we are responsible for an inquisitive and active role in reading.  Prose of contemplative quality is now afoot once activate by a now seemingly irrelevant question of the works nature.  He asked us just so far as to bring us into a more active relationship to the material.  Now we have simplicity with parable like perspective.  It won't work as a passive read after a couple prose in here with Baudelaire. He dares us to ask more.  And in hindsight he makes good on providing more.Here one may find themselves in a unique place where the artist subtlety may illicit our trust in a natural way that feels like we are being compelled forward.  Here we find those engrossing memories of time escaping us with a speed matching that of fine music.  Baudelaire winks at us with a gleam in the eye of such a thoughtful poetics.As we get into the book, such a thought seems to be irrelevant in itself, but herein lies the work of adept excellence that presents a level of expression by an individual that one attains mastery over form.  Charles Baudelaire following the FLOWERS OF EVIL pens in a searing state of BEING a work as simply pure as PARIS SPLEEN can be.  That can at the same time bare such depth and complexity that the two when coexisting in form yield transcendence.  A piece that whenever we return to it -- yields new insight and discovery.  A definitive quality of any exceptional piece of art."}, {"review_sentiment": 5.0, "review_text": "The genius of Baudelaire, this book has it!  It is poetry in the form of prose that is so pithy and poignant and laser beam sharp.  It is the philosophy and poetic genius of one of France's great poets.  As one example of the importance of Baudelaire's genius is the poem on page 74 called, Get Drunk.  It starts with:\"One should always be drunk.  That's the great thing; the only question.  Not to feel the horrible burden of Time weighing on your shoulders and bowing you to the earth, you should be drunk without respite.  Drunk with what?  With wine, with poetry, or with virtue, as you you please.  But get drunk.\"This small book is one to cherish and pick up periodically from time to time and slap yourself in the face with it, like dumping a bucket of cold water over your head periodically to wake you up and shake you to look at life."}, {"review_sentiment": 5.0, "review_text": "the best"}, {"review_sentiment": 3.0, "review_text": "Very obtuse and convoluted, but a worthwhile read."}, {"review_sentiment": 5.0, "review_text": "I love this book thank you!!"}, {"review_sentiment": 5.0, "review_text": "Everyone that lives in a city, or wants to \"get\" modern ad postomdern lit should get this book!My experiences with literature aren’t what prepared me for Charles Baudleaire’s “Miss Bistoury.” What prepared me was an encounter with my crazy neighbor. One of her obsessions is that my cat, a twelve year-old Charpeaux, born in Oregeon, is from the same litter as her six-year-old Siamese. She makes frequent reference to this fact, and if I deny this, she becomes quite impassioned on the fact that I was there the night our cats were born “during the flood.” It is very creepy to listen to this, so I avoid the subject any way I can – unless I’m getting her to show-off for a visitor to my home.Such encounters are very much a property of urban life. One is forced to deal with any number of people simply to survive; much less facing the throng one encounters trying to get through the city. Writing usually does not model these situations. In literature people are nuts for a reason. We can discover some trauma, some hidden fact that explains the cat lady or Baudelaire’s Miss Bistoury. If Victor Hugo told this tale, we have a really long psychological history; Zola would have given us the answer of class (that is Miss Bistoury is poor and the harsh life has made her crazy), Balzac a funny reason and De Maupassant a surprising ending at the end of the story. Baudealire’s narrator is addicted to mystery because he is in hope of solutions. In short, like us, he is a good reader and assumes that eccentricities will be explained. He sees in her in literary terms (or at least mocks our expectations) by reducing her home to descriptions found “in well-known classic French poets.”The narrator treats her stalker-like obsession with doctors as a literary mystery. If he can just ask the right questions, surely she will snap out of it, or tell us the amusing/tragic tale that began the obsession. Or if Miss Bistoury won’t tell his own (August Dupin-like) powers of observation will surely do the trick. But these literary conventions don’t help. She is simply crazy, and we are left with many more questions than answers. How does the lady support her self? How many men have taken advantage of her befuddled state by claming to be a doctor? Are the medical memorabilia she has, really gained from being a medical groupie? Why is she insistent that doctors a re kind to women? Why does she want to see the bloody surgical apron?The narrator is left with a sense of cosmic distaste. I don’t think he is angry with god for having made “monsters” -- there doesn’t seem to be much theodicy in Paris Spleen. He is angry with god for not following the conventions of writing. God has left no clues as to how Miss Bistoury came into being, or how such a horrid little state could have been avoided. Encountering her, like the madman on the bus or the drug dealer form across the street, is a thing-in-itself. There are no explanations, no comfort that can be drawn from a myth.This insistence on the messiness of the world is a theme throughout these prose poems. Motivations are difficult to guess, as in “To Every Man His Chimera” where the overwhelming motivations of each person are seen as monstrous, mythical, and heavy, or in “The Dog and the Scent- Bottle” where the attraction of the bad over the good is lambasted. This tale has no resolution –it is merely a suggestion of an emotional scene like “Rope” where a piece of rope that a child hanged himself on gains great value because of its connection to violence and death, or “The Poor Child’s Toy” where the toy of the title is a rat, and all we are left with a picture that rich and poor are united in their attraction to the feral and dangerous. The narrator has performed no good deeds. He has merely “taken a bath in a crowd.” He has allowed the strangeness, the alieness of our fellow man in the city to take him for a ride. He has been entertained and distracted. The world has yet again showed itself as mysterious and mean, puzzling and poor. His sensibilities are not challenged by the encounter, rather they are strengthened and developed.The book works as a collection because it tells indirectly of a complex emotion that could be called “imagination constrained by the dreadful city.” It is an imagination that can make dreadful things more dreadful, such as the fantasy of “Beat Up The Poor” or rebel against the dullness of the world as in “The Bad Glazier.” Baudelaire seldom discusses this attitude directly, but he does allow it to build up by the working formula of “show don’t tell.” By the end of the book we could each write our own additional prose poem, we certainly can see them in the world about us.It is hard for me to imagine a world not affected by this little book. It is common now to study the urban alien. It is the stuff of Seinfeld monologs, the wallpaper of Beat novels, the weirdo cast of Pynchon’s big books. We read these little stories and we are not shocked. The disenchanted poet seeking enchantment is the viewpoint we all seem to share now. We all look for our Miss Bistourys, we all collect these little tales. We all know that living in the city, means living in a world of madness, mystery and meanness. When we meet the homeless man in front of the Co-Op, who is worries about extraterrestrials, we are already taking notes for the tale to tell over iced chai."}, {"review_sentiment": 5.0, "review_text": "Love every bit of it. Like drinking the finest wine, i've read and re-read many times. His beautiful words and sublimity will stay with me forever."}]}, "authors": ["Charles Baudelaire"], "isbn": "0811200078", "longitude": 2.3514992, "periods": ["1800s"], "title": "Paris Spleen", "word_cloud": "poetry person write like ha solely fulfill task challenge year first edition biography like prose poem format better verse poem format easier understand still flowery more short story poems remember really stick reason memorable wonderful intrigue literary personality nineteenth century think translator find big small prose poetry gem among st work activate mindful contemplative approach poetry yield make possible dare dear potentiality literally carry poetics quarter year take small bite daily prose kind daily meditation report clear recollection uniquely powerful artistic maneuvering make possible time remarkably clear vital force pen potentiality dare know language anew seemingly dear pinnacle yield exploration poetics bar far reach scope well breathless immediacy meet excite readiness seem save hope meet searing adeptness spin language enthral experience provide kind rapture beautifully original power make passing time speed attempt catch fresh gesture pen life commit natural fusion deeply individual place oneness creatives dare bare responsibility provide strike set poetics bares relevance today vivid modernism seem expansive unyielding equality find midst contemporary era seemingly historic recollect singular modernism give clarity understand indeed find midst current era even year pass small big give relevance impression poetry give glimpse break binder poetic glimpse work many year approach work come work definitive poet find stride command realize midst bloom signify flower command sear expressive power work midst race stride poetry catch poignant poetics work almost bate catch strike depth tell story thus perhaps people dear special intimacy man catch voice live also tell vital clarity thus share approach creative expression romance mislead sentimentality small aspect yield definitive strength stature hold steadfast accurately beautiful poetics poetic expression yield significant creative force will ease immediacy firm foot canon poetic work making widely celebrate intimately pen paper expression span poetic landscape find attain critical relevance psyche evolve midst poignant searing modernist expression demand poet much meet poet match respectively appropriate seriousness even familiarity reach attain work en devour approach confidence convey expressive poetics bar new discovery layer time revisit yield illicit potential discovery continue new element piece seriously consider piece visual art provide viewer maneuver language breathless power provide contemplative immediacy approach work exploration refinement complex catch sear modernism relevant day break bind year ago modernism illicit brilliance even experience contemporary placement midst history unfolding time open modernistic relevance contemporary landscape art experience well strike dare sear beauty excite compel relationship poetic responsibility spin interplay poetics simply qualitatively excite meet genius poet time midst catch powerful stride season command life search committed expression embark year find attain state make precursor mighty little explore unveiled pen poetic gesture make flower necessary expression necessary even approach prose inertia succession sense sear command ferocity personal pivoting footing solid midst spin command language dare realize creative individualism complex approach new exploration prose work pen individuate rarely communicate vivid intimacy personal expression hear thing wish tell tone make clear unyielding strength character rarely meet quality poetic musing impress signature clarity command vocal prowess stay remind ever time meet genius dear poet candidly remember dear poignant artist quality thereafter ask poet meet dear scope contribution wide true continuous illicit devote reader time somehow know special man meet true form striking genius dare attain personality dare sim produce core signature air cunning quality significant creative expression poet poignant stature approach exploration prose find come pivotal moment creative fruition approach work recently come historically signature work relatively new form poetics attain momentous stride find thereafter arrive give prose mark occasion man attain mastery language expression small piece compare signature grandeur see seasoned genius pivot maneuver poetics way speak quality man small piece page count form serve bare succession poignant creative expression elevate gem piece age strike poetry piece attain signature expression immediately make critical vital aspect work special aspect come know aspect total image arrive poetic movement command little bar ferocious stride sear poetic maneuvering signifies point creative expression dare reach place masterful transcend seemingly simple short piece poetry level grandeur elevates prose level strike command write seemingly new find ease immediacy dare new height trans formative expression important work well go vital aspect historically make totality creative expression sear expression will canon european poetics ease stride keep work far never let dynamic power away work thus deem remarkably special historic relevance critical work poetic quality sustains age original relevance unveil upon work work attains critical aspect collectively comprise total image collection apparently incomplete individual reach serve prose elemental significance alongside work together comprise total strike individual totality portrait historically complete render complete characteristic totality collection yield total image collection apparent incomplete portraiture genius right ferocity together bare picturesque portraiture demand critical aspect total image total expression collection work find miss ultimately missed opportunity bar critical aspect collectively age thus hereafter accurate expression characteristic quality together poetic landscape dear daring age thus quality poetics thus stand seemingly larger body work widely popular signature work lending verse depth understanding work give intimate knowledge total find poignant gesture reach heightened place expression dare attain sear realization moment give potential remarkably individualistic complete creative expression uniquely nature little thus provide special arena pivot poetics new vital place come characteristic piece stride sustain yield exploration refine prose seasoned mastery form powerful establish aspect collection write miss presence small achieve necessary aspect total image consist even small space work provide reader something new seemingly small gesture come know succinct complete way even grandiose work new season stride get sense command work approach new form approach creative expression mark work able new language say something new now good year pass allow opportunity catch glimpse beautiful time see creative work age well retain relevance open small prose poetry even still read first section already work engage impress piece first idea present seemingly communicate unique combination idea cover art together produce possibility arrive idea title suggest documentary work idea seemingly discover yet question directly place originally adept craft understand experience touch make detectable hindsight discover poignantly raw curiosity idea bubble well man live city call home intimacy somehow stay even first idea fall flat pass subtle maneuvering poet work see activate never drop poetics dynamic swell inertia visceral body tactile material come sin way unique stuff really fine importantly attain command artist ultimately responsible passing time seem push alongside artist element establish active question becomes part read now responsible inquisitive active role read contemplative quality afoot activate seemingly irrelevant question work nature ask far bring active relationship material now simplicity parable perspective passive couple prose dare hindsight make good provide unique place artist subtlety natural way feel compel forward here find engross memory time escape match fine music wink eye thoughtful get think seem irrelevant herein lie work adept excellence present level expression individual attain mastery form follow flower pen sear state work simply pure time bare depth complexity coexist form yield transcendence piece return yield new insight discovery definitive quality exceptional piece art genius poetry form prose pithy poignant laser beam sharp philosophy poetic genius great poet example importance genius poem page call start always drink great thing question not horrible burden weigh shoulder bow earth drunk respite wine poetry virtue please drunk small cherish pick periodically time time slap face dump bucket cold water head periodically wake shake look life best very obtuse convolute worthwhile love thank everyone live city want modern ad postmodern lit experience literature prepare prepare encounter crazy neighbor obsession cat born litter make frequent reference fact deny becomes quite impassioned fact night cat bear creepy listen avoid subject way get visitor encounter much property urban life force deal number people simply survive much le face throng encounter try city usually model situation literature people nut reason discover trauma hidden fact explain cat lady tell tale really long psychological history give answer class poor harsh life make crazy funny reason surprise end end story narrator addict mystery hope solution short good assumes eccentricity explain see literary term least mock expectation reduce home description find classic french narrator treat obsession doctor literary mystery ask right question surely snap tale begin obsession power observation surely trick literary convention help simply crazy leave many question answer how lady support self many men take advantage befuddle state calming doctor medical memorabilia really gain medical groupie insistent doctor kind woman want see bloody surgical apron narrator leave sense cosmic distaste think angry god make monster seem much theodicy angry god follow convention write leave clue come horrid little state bus drug dealer form street explanation comfort draw insistence messiness world theme prose poem motivation difficult guess overwhelming motivation person see monstrous mythical attraction bad good lambast tale resolution merely suggestion emotional scene piece rope child hang gain great value connection violence death toy title rat leave picture rich poor united attraction feral dangerous narrator perform good deed merely take bath allow strangeness aliveness fellow man city ride entertain distract world yet show mysterious mean puzzle poor sensibility challenge encounter rather strengthen work collection tell indirectly complex emotion imagination constrain dreadful imagination dreadful thing dreadful fantasy rebel dullness world seldom discus attitude directly allow build work formula show end additional prose poem certainly see world hard imagine world affect little common study urban alien stuff mono logs wallpaper novel weirdo cast big little story shock disenchant poet seek enchantment viewpoint seem share look miss collect little tales know live city mean living world madness mystery meanness meet homeless man front worry extraterrestrial already take note tale tell ice chi bit drink finest wine many time beautiful word sublimity stay forever", "genres": ["Poetry"], "summary": "One of the founding texts of literary modernism.\r\n\r\nSet in a modern, urban Paris, the prose pieces in this volume constitute a further exploration of the terrain Baudelaire had covered in his verse masterpiece, The Flowers of Evil: the city and its squalor and inequalities, the pressures of time and mortality, and the liberation provided by the sensual delights of intoxication, art, and women. Published posthumously in 1869, Paris Spleen was a landmark publication in the development of the genre of prose poetry―a format which Baudelaire saw as particularly suited for expressing the feelings of uncertainty, flux, and freedom of his age―and one of the founding texts of literary modernism.", "asin": "0811200078", "rank": "140081", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51rDR0rkNvL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}