{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 19.4326009, "ratings": {"num_ratings": 23, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Great book by a significant Chilean author"}, {"review_sentiment": 5.0, "review_text": "The condition is good."}, {"review_sentiment": 5.0, "review_text": "A powerful book, yet accessible and easily read in an afternoon or over a weekend. I read this book because I was captivated by the character of Auxilio Lacouture in The Savage Detectives and wanted to see how Bolano dealt with this character and the subject matter as a novel in its own right. Bolano hasn't disappointed. Lacouture's character is as captivating as in The Savage Detectives, but her strange voice does equally well in sustaining this beautifully written yet strange novel. Lacouture describes the events of September 1968, where the Mexican army invades the University of Mexico City. While this happens, Lacouture hides inside the womens' toilets. That a novel could be sustained from such a scenario is in itself a testament to Bolano's talents as a writer. But what sustains the novel is the captivating voice of Lacouture, who disturbs and amuses with statements such as calling herself \"the mother off Mexican poetry\". An excellent book for anyone who loves The Savage Detectives and wants more, or also equally for anyone wanting an entree into Bolano's literature."}, {"review_sentiment": 3.0, "review_text": "This book was published in Spanish in 1999 and English in 2006. Along with By Night in Chile, it's been called a good introduction to the work and themes of Bolaño.There were no fully developed characters in Amulet, and little plot. These things weren't the author's concern. Instead, a number of themes were presented to be grasped in passing. A series of events took place in Mexico City and were narrated throughout by Auxilio, a woman who'd survived the 1968 army massacre in Tlatelolco. A few other characters moved in and out of her world -- poet-friends, a painter she spoke to, a gangster she visited to help rescue a friend.In the course of the book, a poet-friend of Auxilio's visited Chile in 1973 and experienced the rightwing coup against the government. Later, Auxilio had a vision of the Catalan surrealist painter, Remedios Varo, who'd fled Franco's Spain and then Nazi Germany for political exile in Mexico in the 1930s. And toward the book's end, Auxilio heard a Greek myth about a woman's potential escape from violence and death.A major theme seemed to be how people reacted to violence and political oppression in each generation -- by trying to live life to the full, fleeing, rebelling through the spoken word, retreating into their inner worlds, or just trying to help each other scrape by.The book ended with Auxilio's horrific vision, recalling a mural in Mexico City by David Siquieros: a generation of Latin American students marching toward an abyss, led to sacrifice as they sang songs of war, courage and love for each other. For Auxilio, this singing was our amulet. Maybe the endless tragedy was somehow counterbalanced by the endless will to resist."}, {"review_sentiment": 3.0, "review_text": "I heard a lot of great things about Bolano. I don't have that character on my keyboard for the 'n'. Anyway, I heard a lot of great things but frankly I was disappointed. Granted this was his only book I've read. I heard this was a good one to start with. I found it very predictable though and not very interesting. It's not poorly written so that's why I gave it 3 stars. It's just not very interesting or thought-provoking if you've explored much of anything beyond the basics."}, {"review_sentiment": 3.0, "review_text": "eh. Bolano fan, didn't see what the fuss was about this. There is some talk about how much of Bolano's work published is not as good as the novels he's known for."}, {"review_sentiment": 5.0, "review_text": "gift."}, {"review_sentiment": 5.0, "review_text": "It is a monologue narrated by a female. How hard would it be for a male writer to write as a female protagonist in first person. It is hard to put the book down when the writer is Bolaño."}, {"review_sentiment": 5.0, "review_text": "am always amazed by the way Bolano spins his thoughtful webs of ghosts and delusion.  i will forever read bolano"}, {"review_sentiment": 5.0, "review_text": "I am a great fan of Bolano and this book did not disappoint. I have read all of his novels and have moved on to reading his short stories now. Such a shame this author passed on at such an early age."}]}, "authors": ["Roberto Bolano"], "isbn": "0811217469", "longitude": -99.1333416, "periods": ["1900s"], "title": "Amulet", "word_cloud": "significant author condition good powerful yet accessible easily afternoon weekend captivate character want see deal character subject matter right disappoint character captivate strange voice equally well sustain beautifully write yet strange describe event army invades happen hide woman toilet scenario testament talent writer sustain captivate voice disturb amuse statement call mother poetry excellent anyone love detectives want also equally anyone want entree literature publish spanish call good introduction work theme fully develop character little plot thing author concern instead number theme present grasped pass series event take place narrate woman survive army massacre character move world painter speak gangster visit help rescue course visit experience right coup government vision surrealist painter flee political exile end heard myth woman potential escape violence major theme seem people react violence political oppression generation try live life full flee rebel spoken word retreat inner world try help scrape end horrific vision recall mural generation american student march abyss lead sacrifice sang song war courage love sing endless tragedy somehow counterbalance endless resist hear lot great thing character keyboard hear lot great thing frankly disappoint hear good start find predictable interest poorly write give star interest explore much anything basic eh fan see fuss much work publish good novel know gift monologue narrate female hard writer write female protagonist first person hard put writer always amaze way spin thoughtful web ghost delusion forever bola no great fan disappoint novels move reading short story such shame author pass early age", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A tour de force, Amulet is a highly charged first-person, semi-hallucinatory novel that embodies in one woman's voice the melancholy and violent recent history of Latin America.\r\n\r\nAmulet is a monologue, like Bolano's acclaimed debut in English, By Night in Chile. The speaker is Auxilio Lacouture, a Uruguayan woman who moved to Mexico in the 1960s, becoming the \"Mother of Mexican Poetry,\" hanging out with the young poets in the cafés and bars of the University. She's tall, thin, and blonde, and her favorite young poet in the 1970s is none other than Arturo Belano (Bolano's fictional stand-in throughout his books).\r\n\r\nAs well as her young poets, Auxilio recalls three remarkable women: the melancholic young philosopher Elena, the exiled Catalan painter Remedios Varo, and Lilian Serpas, a poet who once slept with Che Guevara. And in the course of her imaginary visit to the house of Remedios Varo, Auxilio sees an uncanny landscape, a kind of chasm. This chasm reappears in a vision at the end of the book: an army of children is marching toward it, singing as they go. The children are the idealistic young Latin Americans who came to maturity in the '70s, and the last words of the novel are: \"And that song is our amulet.\"", "asin": "0811217469", "rank": "225385", "city": "Mexico City", "image": "https://images-na.ssl-images-amazon.com/images/I/41E7nCuCP6L.jpg", "country": "Mexico", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}