{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 62, "rating": 3.8, "reviews": [{"review_sentiment": 2.0, "review_text": "This is an odd work. I found the random sentence structure and irregular syntax to be quite trying to read. A few profound passages, but mostly gibberish."}, {"review_sentiment": 5.0, "review_text": "Quite simply the most extraordinarily dynamite existential prose I've maybe ever read.  Each sentence has you leaning forward and feeling electric."}, {"review_sentiment": 5.0, "review_text": "I loved it!"}, {"review_sentiment": 5.0, "review_text": "This is the best book I have ever read, there are many reviews better than mine, I am just here to say: this is magnificent"}, {"review_sentiment": 5.0, "review_text": "One of my favourite novels ever. Incredibly powerful."}, {"review_sentiment": 4.0, "review_text": "Picked this up from the library on a whim-so glad I did.  What a beautiful story."}, {"review_sentiment": 3.0, "review_text": "Lispector’s final novel is in some senses, her most experimental. Brief, caustic, and occasionally unstable, we enter the frame of fiction making itself. Lispector begins from the perspective of a male writer, who tries to tell the story of Macabea, a woman destined to hardship in the slums of Brazil. While I am less interested in the meta-structure she designs in this text, Lispector’s strenght throughout consists in the ability to focus on the concrete, and to transfigure contents of thought in to abstractions. This one deserves re-reading."}, {"review_sentiment": 3.0, "review_text": "Unusual and somewhat awkward narrative structure, but it generally serves the purpose of the book well.  Not a feelgood read."}, {"review_sentiment": 5.0, "review_text": "great book for school. arrived on time. brand new"}, {"review_sentiment": 5.0, "review_text": "If you want to know be introduced to Clarice Lispector, read this excellent article by Benjamin Moser: [...]If you have not read Clarice yet, you must!"}]}, "authors": ["Clarice Lispector"], "isbn": "0811219496", "longitude": 0.0, "periods": ["1900s"], "title": "The Hour of the Star", "word_cloud": "odd work find random sentence structure irregular syntax quite try profound passages mostly gibberish quite simply extraordinarily dynamite existential prose maybe ever sentence lean forward feel electric love best ever many review better mine say magnificent favorite novel ever incredibly powerful pick library glad beautiful story final sens experimental caustic occasionally unstable enter frame fiction make begin perspective male writer try tell story woman destine hardship slum less interested design text strength consists ability focus concrete transfigure content think abstraction deserves unusual somewhat awkward narrative structure generally serve purpose well not great school arrive time brand new want know introduce excellent article yet", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A new edition of Clarice Lispector’s final masterpiece, now with a vivid introduction by Colm Tóibín.\r\n\r\nNarrated by the cosmopolitan Rodrigo S.M., this brief, strange, and haunting tale is the story of Macabéa, one of life's unfortunates. Living in the slums of Rio and eking out a poor living as a typist, Macabéa loves movies, Coca-Colas, and her rat of a boyfriend; she would like to be like Marilyn Monroe, but she is ugly, underfed, sickly and unloved. Rodrigo recoils from her wretchedness, and yet he cannot avoid the realization that for all her outward misery, Macabéa is inwardly free/She doesn't seem to know how unhappy she should be. \r\n\r\nLispector employs her pathetic heroine against her urbane, empty narrator―edge of despair to edge of despair―and, working them like a pair of scissors, she cuts away the reader's preconceived notions about poverty, identity, love and the art of fiction. \r\n\r\nIn her last book she takes readers close to the true mystery of life and leave us deep in Lispector territory indeed.", "asin": "0811219496", "rank": "33679", "city": "Rio de Janeiro", "image": "https://images-na.ssl-images-amazon.com/images/I/51xTGisRwiL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}