{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 25, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "As advertised :)"}, {"review_sentiment": 5.0, "review_text": "A fantastic tale of identity, Colonel Chabert is a man all believe dead who re-appears, bearing the memories of his many trials since his \"death\". Most amazing is the tale of the fateful day, when he finds himself alive, but near the bottom of a mass grave that he has to claw his way out of! Not for the faint-hearted. At times Down & Out In Paris & London, at times The Return of Martin Guerre, it's a quick read that sinks deep into the heart."}, {"review_sentiment": 5.0, "review_text": "If the first French literature I ever encountered had been COLONEL CHABERT, I probably would not have so resolutely shunned it over most of my life.  Although it bears a few of the tropes of nineteenth-century fiction, this novella, written in 1832, was ahead of its time.  (In 1832, James Fennimore Cooper was probably the most popular author in America and Sir Walter Scott in Great Britain.)  COLONEL CHABERT is shot through with the realism that I understand Balzac is famous for.  But regardless of its place in literary history, I commend COLONEL CHABERT as a compulsively readable story of almost mythical depth and import.Colonel Chabert had been an officer in Napoleon's army.  At the battle of Eylau, in Prussia, Chabert had been at the center of the cavalry action that turned the battle in the favor of Napoleon.  However, he was grievously wounded and left for dead on the battlefield.  Napoleon was so upset he sent two surgeons to confirm that Chabert was dead, but, based on the reports on what had happened to Chabert and the massive gash on his skull, the surgeons didn't bother to check his pulse and reported back to Napoleon that he was quite dead.  He was thrown into a common grave.  A death certificate was issued, and in due course his widow liquidated his estate, taking over most of it for herself.  She then remarried, had two children, and began a campaign of social climbing.  But Chabert had not died.  In a gruesome scene, he emerged from under a pile of corpses, using a severed arm as a lever; he was taken in by peasants and over many months restored to health.  The present action of the novella kicks off when he returns to Paris, years later, to re-establish his identity, straighten matters out with his wife, and reclaim as much of his fortune as possible.  He ends up employing a lawyer who also serves as his wife's lawyer.  (Apparently there was no concept of \"conflict of interest\" among the legal profession of Restoration France.)  His wife publicly denounces him as an imposter and privately uses her womanly wiles to shunt him aside.  All the time, Chabert maintains an obdurate dignity and honor.  But honor is a Napoleonic concept, now outmoded.Balzac packs a lot into the relatively slim COLONEL CHABERT -- 101  pages in this splendid translation by Carol Cosman, as published by New Directions.  Two things stood out for me.  First, the physical squalor that so many citizens of Paris lived in.  Second, the moral squalor of the professionals and upper class.  Near the end of the novella, the attorney who had represented both Chabert and his wife reflects:  \"Do you know * * * that in our society there are three men, the priest, the doctor, and the lawyer, who cannot appreciate the world?  They wear black robes perhaps because they are in mourning for all virtue and hope.  The unhappiest of the three is the lawyer.  When a man seeks out the priest, he is moved by repentance, by remorse, by passionate beliefs that elevate him and comfort the soul of the mediator.  The priest brings a little joy; he purifies, he heals, he reconciles.  But when he comes to us, the lawyers, we see the same ill feelings repeated again and again, never corrected.  Our offices are gutters that cannot be cleansed.\"  COLONEL CHABERT has some of the tragic, mythical elements of Aeschylus and Sophocles.An indication of the enduring power of COLONEL CHABERT is its appearance in two recent, major novels -- \"Austerlitz\" by W. G. Sebald and \"The Infatuations\" by Javier Marías.  Indeed, it was reading those two novels that prompted me to get COLONEL CHABERT.  In Sebald's great novel, the title character brings up Balzac's novella in his next-to-last conversation with the narrator and relates how reading Balzac's novella is what \"reinforced [his] suspicion * * * that the border between life and death is less impermeable than we commonly think.\"  The novella figures much more prominently in \"The Infatuations\", as it is at the center of the amoral philosophical rationalizations of the murderer Díaz-Varela.  Among other lessons he cites Balzac for is that \"the dead must stay where they are and nothing can be corrected.\""}, {"review_sentiment": 5.0, "review_text": "Balzac is the best, and this is a great story, done economically."}, {"review_sentiment": 5.0, "review_text": "great book!"}, {"review_sentiment": 4.0, "review_text": "I read this after viewing the film. The two have very different endings, but both shed interesting light on the French mind. EXTREMELY DIFFICULT READ (even for a French person at times, I'm told)!!"}, {"review_sentiment": 5.0, "review_text": "Great Deal, much appreciated."}, {"review_sentiment": 4.0, "review_text": "With a slow start, but for such a short story, keeps an amazing tension, around a question, \"Will she, won't she?\"  and makes one wonder why it turns out as it does.  The standards of the times change, human beings remain the same, some with more honor than others. A bit of a mystery, a bit of a romantic tragedy. Once past the first 8 small pages, an easy and page turning read."}, {"review_sentiment": 5.0, "review_text": "Such a cute, touching story. It was hard to find in English for someone else who doesn't speak French, so this was a great find."}, {"review_sentiment": 4.0, "review_text": "L'histoire d'un être noble, porté au désespoir par la méchanceté d'une femme abjecte.C'est interéssant, vers la fin du roman: la description de l'approche que l'avocat fait des misères humaines, face à celle du médecin ou du prêtre."}]}, "authors": ["Honoré de Balzac", "Carol Cosman"], "isbn": "0811213595", "longitude": 2.3514992, "periods": ["1800s"], "title": "Colonel Chabert", "word_cloud": "advertised fantastic tale identity man believe dead bearing memory many trial death amazing tale fateful day find alive bottom mass grave claw way not time time quick sink deep heart first french literature ever encounter probably resolutely shunned life bear trope fiction novella write ahead time probably popular author shoot realism understand famous regardless place literary history commend compulsively readable story almost mythical depth officer army battle center cavalry action turn battle favor however grievously wounded leave dead battlefield upset send surgeon confirm dead base report happen massive gash skull surgeon bother check pulse report quite dead common grave death certificate issue due course widow liquidated estate take remarry child begin campaign social climbing die gruesome scene emerge pile corps use severed arm lever take peasant many month restore health present action novella kick return year later identity straighten matter wife reclaim much fortune possible end employ lawyer also serve wife lawyer concept conflict interest legal profession wife publicly denounce imposer privately use womanly wile aside time maintain obdurate dignity honor honor concept pack lot relatively slim page splendid translation publish thing stand physical squalor many citizen live second moral squalor professional upper class end novella attorney represent wife reflect society men priest doctor lawyer appreciate world wear black robe perhaps mourn virtue hope unhappiest lawyer man seek priest move repentance remorse passionate belief elevate comfort soul mediator priest brings little joy purifies heals reconciles come lawyer see ill feeling repeat never correct office gutter cleanse tragic mythical element indication endure power appearance recent major novel indeed read novel prompt get great title character bring novella conversation narrator relate read novella reinforce suspicion border life death le impermeable commonly think novella figure much prominently center amoral philosophical rationalization murderer lesson cite dead nothing correct best great story do economically great view film different ending shed interest light french mind even person time tell much appreciate slow start short story keep amaze tension question make wonder turn standard time change human being remain honor others a bit mystery bit romantic tragedy first small page easy page turn such cute touch story hard find english someone else speak french great tree noble port au désespoir par la lemme interéssant rev la fin dew roman description fiat ed misfire humaines face cell dew médecin oi dew prêtre", "genres": ["Fiction & Literature"], "summary": "The story of a French military hero of the Napoleonic Wars, long assumed to be dead, tries to recover his fortune and former wife through the help of a famous Parisian lawyer.\r\n\r\nColonel Chabert, a Napoleonic War hero supposedly killed in the Battle of Eylau, returns to Paris after a long convalescence to find his wife remarried, and his pension gone. He employs a young, well-known lawyer to at least reclaim his pension. It is a game of wits: first to convince the lawyer that he is who he says he is; secondly to get his wife to admit to his identity and thereby give up some of her wealth. Once the lawyer believes Chabert's story, the wife must be made to part with his pension...", "asin": "0811213595", "rank": "698982", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/517653d4ENL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}