{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 11, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Good, easy, profound read"}, {"review_sentiment": 4.0, "review_text": "This is an interesting story of spiritual wandering, obsession, search, and metamorphosis. Shrike plays the antagonist to Lonely Hearts' spiritual confusion while at the same time prodding and insulting him in the right direction. This really dark and brooding tome is worth the read but you'll be thinking hard and reaching for something a bit lighter afterwards."}, {"review_sentiment": 5.0, "review_text": "old school writing for the new age"}, {"review_sentiment": 3.0, "review_text": "I gave this book to my grandmother as a birthday present. At the time, she was still writing advice columns for a newspaper in Chicago. I wish I’d read the book beforehand because it’s as good of a present for an advice columnist as Oedipus Rex is for your mother. The main character is Miss Lonelyhearts, an advice columnist who becomes desperate and lost after reading hundreds of letters from miserable New Yorkers. One of the letters is from a woman who doesn’t have a nose. Miss Lonelyhearts gets drunk and violent and that’s just the beginning. When my grandmother was growing up she used to “ir a buscar los pollos,” which meant chasing down chickens in back, snapping their necks and unfeathering them before dinner. Maybe she had a different constitution for it. At first she dreamed up all the questions. But eventually the column caught on and the letters came pouring in by the dozen. It seemed like all of Chicago was suffering. Every year she held a party for the people who wrote her letters. Very few of them came. It was in Belmont Cragin at a bar called Walt’s, a long cave with maroon walls and very few places to sit. The bartenders kept the beer in coolers filled with ice and they tucked a napkin into the top of every open bottle like a flower. My grandmother wore her red leather trench coat. She danced in it. A caterer set down massive tinfoil trays of meatballs and stuffed shells onto a long table in the back. One year, two of the guests fell in love. One of them was a life insurance salesman. He had taken a trip to Los Angeles and run into an ex-girlfriend from high school. After a bottle of wine, they slept together at his hotel. The next morning they went out to breakfast and the ex-girlfriend choked on her food. The salesman leapt across the table and stuck his finger into her mouth to dislodge a thick wad of scrambled egg from her throat. The ex-girlfriend was rattled. She couldn’t talk. She drank a glass of water. She raised her finger for the man to wait and she went outside to smoke. After five or ten minutes, the salesman went to check on her. The ex-girlfriend had vanished. He called everyone he knew but he couldn’t track her down. He flew home two days later. At my grandmother’s party, he met a woman who had lost her mother in a car accident. The woman had been driving her mother to a doctor’s appointment. They were arguing about where to park the car."}, {"review_sentiment": 5.0, "review_text": "The characters were wonderful. The story intriguing. I hard a hard time putting the book down. That's enough. No more."}, {"review_sentiment": 5.0, "review_text": "Nathaniel West's book written during The Depression Years in the USA, is a kind of seedy story.  I was happy to say in the end that it did have a deeper meaning even though it was unsettling at times almost like a modern book with less graphics & zero foul language.I enjoyed it nonetheless."}, {"review_sentiment": 2.0, "review_text": "70-odd pages of prose which whilst fairly readable were only mildly entertaining.Miss Lonelyhearts is a male agony columnist dealing with, or rather failing to deal with the problems brought to him by his readers. His cynical boss derides him and his ineffectual responses. Lonelyhearts seeks solace in drink and sex, involving himself more intimately in the problems of his readership as well as trying to seduce his boss’s wife. A temporary recourse to religion fails to provide a solution to anyone’s ills.A bar fight, an unhappy engagement, sex with a cripple’s wife and a grappling encounter with the cripple concludes with a gun going off. We end.I’ve read worse and will do again.West appears to be a fairly political writer and apparently there are greater themes at play here.According to Wikipedia, we have an Expressionist black comedy with the author sharing a sense of extreme disillusionment with Depression-era American society. (I get that bit.)It continues…..The novel can be read as a condemnation of alienation and the colonization of social life by commodification, foreshadowing the stance of the Situationists and Guy Debord in particular…..etc, etc, etc.Well I couldn’t have said it any better myself.I much preferred West’s A Cool Million (The Dismantling of Lemuel Pitkin) which I read last year.2 from 5Owned copy, which is a 4-book omnibus edition, also containing The Day of the Locust and The Dream Life of Balso Snell.Comment Comment | Permalink"}, {"review_sentiment": 4.0, "review_text": "3.5 starsI bought this novella because I read a piece by Harold Bloom, a renowned and prolific lit critic and a Yale humanities professor, describing why he loves MISS LONELYHEARTS. I wasn't nearly as enamored by this 80-page existential black comedy, primarily because the author, Nathanael West, couldn't hide his contempt for all religion nor his dark-red leanings.As the book begins, an unnamed 1933 NYC male newspaper columnist (I'll call \"ML\") has been assigned to write an advice column (similar in ilk to Dear Abby). ML thereafter starts suffering severe depression under the collective weight of the genuine agony and burdens thrown upon him in the \"Dear Miss Lonelyhearts\" letters of the readers.At after-hours gatherings, his editor, aptly named Shrike, repeatedly hazes ML, condemning his religion (and art) as the \"opiate of the masses\" and jokes that ML is \"an idealist in collision with humanity.\"Exacerbating ML's depression is his belief that the Miss Lonelyhearts column is a big farce perpetrated on the public. To ease his pain, he turns to drinking, religion, traveling with his fiancee', and an affair with Shrike's wife. ML also agrees to meet with a lady who wrote that her poor crippled husband cannot satisfy her intimate needs. West leaves it ambiguous on whether ML's fornication with the lady was driven by a Messiah complex, an ephemeral apostasy, or a mixture of both.This novella had the feel of a Marxist parable, the explanation of which would require my going far beyond the scope of a simple book review as well as into the bio of the author. That should tell you, at least, that its 80 pages are charged with meaning, latent and patent. All things considered, while the book is probably great for book club banter, it was not exactly a pleasure to read."}, {"review_sentiment": 4.0, "review_text": "This novel is definitely a modernist novel - complicated, yet thought-provoking. It is a very short read, and it follows a man whose pen name is \"Miss Lonelyhearts\" in his advice column. It's a little confusing, because it's modern, but a great read if you're a fan of that genre or would like to try out a novel from that genre. My advice is to keep an open mind, and try to figure out what West is revealing or critiquing about the newspaper and mass culture!"}, {"review_sentiment": 4.0, "review_text": "Good book"}]}, "authors": ["Nathanael West"], "isbn": "0811220931", "longitude": 0.0, "periods": ["1900s"], "title": "Miss Lonelyhearts", "word_cloud": "good easy profound interesting story spiritual wandering obsession search metamorphosis play antagonist spiritual confusion time prod insult right direction really dark brood tome worth think hard reach something bit lighter afterwards old school write new age give grandmother birthday present time still write advice column newspaper wish beforehand good present advice columnist mother main character advice columnist become desperate lose reading hundred letter miserable letter woman nose get drunk violent begin grandmother grow use ir bu scar locus poll mean chase chicken back snap neck feather dinner maybe different constitution first dreamed question eventually column caught letter come pour dozen seem suffer year hold party people write letter very come bar call long cave maroon wall place sit bartender keep beer cooler fill ice tuck napkin top open bottle flower grandmother wear red leather trench coat dance caterer set massive tinfoil tray meatballs stuffed shell long table back year guest fell life insurance salesman take trip run high school bottle wine together hotel next morning go breakfast choke food salesman leap table stuck finger mouth dislodge thick wad scramble egg rattle drank glass water raise finger man wait go outside smoke ten minute salesman go vanished call everyone know track fly home day later party meet woman lose mother car accident woman drive mother doctor appointment argue park car character wonderful story intrigue hard hard time put enough write kind seedy story happy say end deeper mean even unsettling time almost modern le graphic foul enjoy nonetheless page prose whilst fairly readable mildly male agony columnist deal rather fail problem bring reader cynical bos derides ineffectual response seek solace sex involve intimately problem readership well try seduce wife temporary recourse religion fail provide solution anyone bar fight unhappy engagement sex cripple wife grapple encounter cripple conclude gun go worse appear fairly political writer apparently greater theme play black comedy author share sense extreme disillusionment american society get condemnation alienation colonization social life commodification foreshadow stance situationists etc say better much prefer last copy omnibus edition also contain stars i buy novella piece renowned prolific lit critic humanity professor describe love nearly enamor existential black comedy primarily author contempt religion begin unnamed male newspaper columnist call assign write advice column similar ilk thereafter start suffer severe depression collective weight genuine agony burden throw letter gathering editor aptly name repeatedly haze condemn religion art opiate mass joke idealist collision humanity depression belief column big farce perpetrate public pain turn drink religion travel fiancee affair wife also agree lady write poor crippled husband satisfy intimate need leave ambiguous fornication lady drive complex ephemeral apostasy mixture novella parable explanation go far scope simple review well bio author tell least page charge mean latent patent thing consider probably great club banter exactly pleasure definitely modernist complicate yet short follow man pen name advice column little confusing modern great fan genre try advice open mind try figure reveal critique newspaper mass culture good", "genres": ["Fiction & Literature"], "summary": "A writer’s nightmare: his degrading day job as a lonely hearts advice columnist is only the beginning\r\n\r\nPraised by great writers from Flannery O’Conner to Jonathan Lethem, Miss Lonelyhearts is an American classic. A newspaper reporter assigned to write the agony column in the depths of the Great Depression seeks respite from the poor souls who send in their sad letters, only to be further tormented by his viciously cynical editor, Shrike. \r\n\r\nHarold Bloom said that this book is “my favorite work of modern American fiction.”", "asin": "0811220931", "rank": "441700", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51obGiCYyFL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}