{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 540, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "This book is at its best when it describes the work making windows and lamps. The detail and the way the author describes the color schemes used is wonderful. However outside the studio the book takes on a Barbara Cartland style that is way too simplistic and banal. I have read 2 other books by this author in which she fell into that style a lot less. Here it flowers and hurts the story."}, {"review_sentiment": 5.0, "review_text": "Enjoy getting into the lives of immigrants and their struggles and how their lives changed when given  opportunities..  Also enjoyed leaning about Tiffianys and how they evolved."}, {"review_sentiment": 3.0, "review_text": "It was a nice story. Entertaining to read."}, {"review_sentiment": 5.0, "review_text": "Perfect"}, {"review_sentiment": 5.0, "review_text": "Well done! Authentic (well-researched). Detailed and interesting. A good look at historical NYC too."}, {"review_sentiment": 4.0, "review_text": "I read Clara and Mr. Tiffany for my book club and really enjoyed it!  I learned so much about NYC around the turn of the century (did you know the subway opened for business in 1904?), about life for female workers in that era (who were not allowed to join labor unions), about glass window- and lamp-making processes, about the business of Tiffany’s, and about Louis Comfort Tiffany himself (who was the son of the jewelry store Mr. Tiffany) and his family history. I learned all this while enjoying the story of Clara Driscoll’s life.  She was a real person who worked for Mr. Tiffany, first helping with the creation of glass windows, coming up with the idea (supposedly) for Tiffany lamps, and becoming a designer of glass lamps and windows under Tiffany’s tutelage.  She also became the manager of the women’s department at Tiffany Studios.  Meanwhile, she led an interesting personal life and was fortunate to have some great friends.I appreciated all the research that Susan Vreeland must have performed and about her creativity at filling in the gaps of Clara’s story whenever there was no documentation available.  The characters in the book really came to life and so many of them were loveable and irresistible.The narrator of the audio book, Kimberly Farr, did a fine job overall.  At times she read a little too slowly/robotically but would strike her groove fairly quickly.  She was able to pull off some good accents and her voice acting was good.  I give her an A."}, {"review_sentiment": 5.0, "review_text": "A lovely book. I will read other books by this author."}, {"review_sentiment": 5.0, "review_text": "A fascinating history of Tiffany lamps and the stained glass windows that were developed by the ladies working for Mr. Tiffany.  Well-written"}, {"review_sentiment": 4.0, "review_text": "Clara grew in her artistic endeavors as she worked with Louis Tiffany, and that is well illuminated in the novel, but it also tells the stories of some of the other women, their struggles to survive, and the prejudice against women as artisans and as workers, and against women earning equal pay, a struggle that exists to this very day."}, {"review_sentiment": 2.0, "review_text": "Very disappointed with this book."}]}, "authors": ["Susan Vreeland"], "isbn": "0812980182", "longitude": 0.0, "periods": ["1800s", "Recent Releases"], "title": "Clara and Mr. Tiffany", "word_cloud": "best describes work making window lamps detail way author describe color scheme use wonderful however outside studio take style way simplistic banal author fell style lot le here flower hurt story get life immigrant struggle life change give also enjoy lean evolve nice story perfect well do interest good look historical club really enjoy learn much turn century know subway open business life female worker era allow join labor union glass process business son jewelry store family history learn enjoy story life real person work first help creation glass windows come idea supposedly lamps become designer glass lamps windows tutelage also become manager woman department meanwhile lead interesting personal life fortunate great appreciate research creativity fill gap story documentation available character really come life many lovable narrator audio fine job overall time little fairly quickly able pull good accent voice act good give lovely author fascinating history lamp stain glass window develop lady work grow artistic endeavor work well illuminate also tell story woman struggle survive prejudice woman artisans worker woman earn equal pay struggle exist day very disappointed", "genres": ["Biography", "Fiction & Literature", "Art & Architecture", "Historical Fiction"], "summary": "It’s 1893, and at the Chicago World’s Fair, Louis Comfort Tiffany makes his debut with a luminous exhibition of innovative stained-glass windows that he hopes will earn him a place on the international artistic stage.\r\n\r\nBut behind the scenes in his New York studio is the freethinking Clara Driscoll, head of his women’s division, who conceives of and designs nearly all of the iconic leaded-glass lamps for which Tiffany will long be remembered.\r\n\r\nNever publicly acknowledged, Clara struggles with her desire for artistic recognition and the seemingly insurmountable challenges that she faces as a professional woman. She also yearns for love and companionship, and is devoted in different ways to five men, including Tiffany, who enforces a strict policy: He does not employ married women.\r\n\r\nUltimately, Clara must decide what makes her happiest—the professional world of her hands or the personal world of her heart.", "asin": "0812980182", "rank": "66183", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51Pc7HrEzBL.jpg", "country": "Chicago", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}