{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 323, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Kaui Hart Hemmings' early title, The Descendants displays her skill and compassion elegiacally.  The story of a family in grief reveals a depth of love and tenderness against the backdrop of infidelity, disenchantment, and resentment, (i.e., a typically complicated family).I don't know how I would have responded to the story without first having seen the movie starring George Clooney.  But I suspect I would have loved it, regardless!"}, {"review_sentiment": 5.0, "review_text": "Engaging, thought-provoking, an emotional roller coaster, a real page turner. I had seen the movie when it came out, but recently decided to read the source material. I was not disappointed, and I wish I had read this sooner. Finished in two nights. Don't think twice; just start reading it."}, {"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 5.0, "review_text": "Really well written and fast moving book. Loved it as much as I did the movie. Maui has an easy going style."}, {"review_sentiment": 2.0, "review_text": "The characters are not very likable, especially Joanie. She pushes her teenage daughter Alex into modeling what amounts to soft-porn type bathing suit shots and thinks it's wonderful. She has an affair with a sleazy realtor and plans to leave her husband for him. In fact, she sets up a land deal that will benefit her lover financially, while her husband and his family may wind up the losers, albeit wealthy ones. And there's Joanie's two foul-mouthed spoiled brat daughters. One is a former drug addict shipped off to a private school on the Big Island, the other a foul-mouthed, messed-up 10-year-old kid who knows way too much about sex for her age. Joanie was too busy to raise her daughters because she's out thrill-seeking and shopping, financed by the weak, hard-working Matt. She got into the boating accident because she was in a race and recklessly trying to win. The author does everything to get the reader to hate Joanie, and she did a good job. But then the author expects us to feel sorry for Joanie because she's in a coma and dying. And Matt still loves her in spite of what she's done to him and his daughters? What a Casper Milquetoast...he is angry at Brian Speer, her lover, but not at Joanie.Matt lets Joanie's father accuse him of not giving her things she deserved like her own racing boat and other expensive baubles, instead of telling Gramps that his daughter was a Lying Cheat Airhead. Matt's confrontation of Joanie's lover, the sleazy Brian Speer, was weak and ineffectual; his daughter Alex was better at telling the guy off. He gets upset when Julie Speer is angry with his dying wife...but why shouldn't she be angry? Joanie was trying to steal her husband and break up her family. When she tells Matt that her husband said he never loved Joanie, Matt nastily replies that her husband didn't love her for awhile, either. He states how he kissed Julie goodbye at the beach to get back at Brian. What a tool--why can't Julie be afforded the same revenge against Joanie that he tried?Basically, this is a story of a very rich, powerful old Kama‘aina family and most people in Hawaii resent these Trust Fund types because most of us are struggling to make ends meet due to the low salaries and high cost of living. We live in tiny houses while they reside on huge estates. The Kings are NOT at all likeable-very pilau! They are little or no redeemable qualities The only positive was when Matt decided not to sell the land that had been handed down in their family because he didn't want Brian Speer and his friends benefitting from the sale and because he felt it should remain in the family as it has been for years instead of being developed into a concrete jungle. That was the only time he showed any backbone. Otherwise, he was a weak wuss who made excuses for his unfaithful bimbo wife and who was as big of a jerk as Brian Speer was. Matt struck me as somebody who actually hated women; at one point, he stated he didn't even want to be around his daughters.I found myself skipping chapters because parts of this book were boring. And the local flavor of Hawaii was missing in this book especially in all of the characters...it could have taken place anywhere. This is just a book about a bunch of messed-up extremely wealthy, unlikeable haoles. I can see why the copy I found was from a bargain bin at the thrift store. Not worth purchasing; read it at your local library."}, {"review_sentiment": 5.0, "review_text": "Loved this short story"}, {"review_sentiment": 5.0, "review_text": "I'm just adding another five-star review of this beautiful novel.  The George Clooney movie is great but the book is wiser, sadder, and funnier."}, {"review_sentiment": 5.0, "review_text": "I love the movie but never really thought to see if it was based on a book. Came across the book at the library on their recommendation shelf. Wow, what a great read/story. No wonder they picked it up for a movie. I totally recommend it. I see she has some other books out that I definitely look into. Great writer!"}, {"review_sentiment": 4.0, "review_text": "Really liked the movie, have just started the book. Reading these reviews make me curious... I have read over and over reviews that described Matt King as an *absentee father\" or \"uninvolved\". Since I am not far into the book, I am curious if that is how he is portrayed in the book. In the movie, it is clear he works a lot but statements suggest that he had interest in what was happening with his children, but their mom was the parent most involved in their day to day lives. I guess I question if the book goes deeper about this matter bc a busy father isn't the same as an absentee father."}, {"review_sentiment": 4.0, "review_text": "This book is definitely worth the read.  It is sad and sometimes distressing but it is also hopeful and heartwarming..."}]}, "authors": ["Kaui Hart Hemmings"], "isbn": "0812977823", "longitude": -157.8556764, "periods": ["2000s", "Recent Releases"], "title": "The Descendants: A Novel", "word_cloud": "early title display compassion elegiac ally story family grief reveals depth tenderness backdrop infidelity disenchantment resentment typically complicate family know respond story first see movie star suspect love engage emotional roller coaster real page turner see movie come recently decide source material disappoint wish sooner finish night do twice start read great really well write fast move love much movie easy go style character likable especially push teenage daughter modeling amount type bath suit shot think wonderful affair sleazy realtor plan leave husband fact set land deal lover financially husband family loser wealthy one spoil brat daughter former drug addict ship private school kid know way much sex age busy raise daughter shop financed weak get boat accident race recklessly try author everything hate good job author expect sorry coma die still love spite do daughter angry lover let father accuse give thing deserve race boat expensive bauble instead tell daughter lie confrontation lover sleazy weak ineffectual daughter better tell guy get upset angry die wife angry try steal husband break family tell husband say never love nastily reply husband love awhile state kiss beach back tool afford revenge try story rich powerful old nina family people resent type struggle end meet due low salary high cost living live tiny house reside huge estates little redeemable quality positive decide sell land hand family want friends benefit sale felt remain family year instead develop concrete jungle time show backbone weak wuss make excuse unfaithful bimbo wife big jerk strike somebody actually hat woman point state even want find skip chapter part bore local flavor miss especially character take place anywhere bunch extremely wealthy unlikable hale see copy find bargain bin thrift store not worth purchase local library love short story add review movie great wiser sadder funnier love movie never really think see base library recommendation shelf great wonder pick movie totally recommend see definitely look writer really liked movie start read review make curious review describe father involve far curious portray movie clear work lot statement suggest interest happen child mom parent involve day day live guess question go deeper matter bc busy father absentee father definitely worth sad sometimes distress also hopeful heartwarming", "genres": ["Fiction & Literature"], "summary": "Fortunes have changed for the King family, descendants of Hawaiian royalty and one of the state’s largest landowners. Matthew King’s daughters—Scottie, a feisty ten-year-old, and Alex, a seventeen-year-old recovering drug addict—are out of control, and their charismatic, thrill-seeking mother, Joanie, lies in a coma after a boat-racing accident. She will soon be taken off life support. \r\n\r\nAs Matt gathers his wife’s friends and family to say their final goodbyes, a difficult situation is made worse by the sudden discovery that there’s one person who hasn’t been told: the man with whom Joanie had been having an affair. Forced to examine what they owe not only to the living but to the dead, Matt, Scottie, and Alex take to the road to find Joanie’s lover, on a memorable journey that leads to unforeseen humor, growth, and profound revelations.\r\n\r\n\"The narrator of this audaciously comic début novel, the scion of the last Hawaiian landowning clan, has floated through his privileged life: marriage to a model given to \"speedboats, motorcycles, alcoholism\"; children getting into trouble (cocaine, bullying) at élite schools; membership at a century-old beach club that rejects those with \"unfavorable pedigrees.\" But when a catamaran accident leaves his wife in a coma he must wake from his own \"prolonged unconsciousness,\" reacquaint himself with his neglected daughters, and track down his wife’s lover. Meanwhile, his cousins are urging him to sell the family’s vast landholdings for development—to relinquish, in his eyes, the final vestige of their native Hawaiian ancestry. Hemmings channels the voice of her befuddled middle-aged hero with virtuosity, as he teeters between acerbic and sentimental, scoffing at himself even as he grasps for redemption.\" The New Yorker\r\n", "asin": "0812977823", "rank": "231656", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51LBpdVxp0L.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}