{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 451, "rating": 3.9, "reviews": [{"review_sentiment": 2.0, "review_text": "I was reccomended this book, but I just couldnt get into it. Not for me. I tried really hard, but its too much train of consciousness writing."}, {"review_sentiment": 5.0, "review_text": "The story is deliciously dark and holds up mirrors, possibly funhouse, to history, giving parallel struggles to nationhood and those crushed by it. It was hard to put down."}, {"review_sentiment": 4.0, "review_text": "My Wednesday book group discussed Salmon Rushdie’s Midnight’s Children in our October meeting. This is a highly regarded author—winner of many prizes, considered the father of the (post) modern Indian novel, the subject of popular controversy (the current edition lacks a sentence about Indira Gandhi that she sued him to omit, not to mention Rushdie’s more recent famous Fatwa), and an inspiration and caution for all Indian writers who have come after.The novel is the life story of Saleem Sinai recounted in first and third person and discussed in true postmodern fashion with his wife and  the reader. Saleem was born on the stroke of midnight of the partition of India into India and Pakistan. He is an omniscient narrator. He knows other character’s thoughts thanks to telepathic powers. His special power allows him to spy on his parents and anybody he is interested in and to communicate with the other children born on this historic moment, i.e. Midnight’s Children, who have their own magical powers. His story parallels the modern history of India, overwhelming but interesting for western readers.Most members of the group did not like the book and in fact found the story and language brilliant but sometimes difficult to follow. Only a few of us finished this looong book. There are so many characters that there is a dedicated Wikipedia page titled Characters of Midnight’s Children and of course we had trouble remembering them all. It is also very Indian with lots of Indian language and reference which we also had trouble with"}, {"review_sentiment": 5.0, "review_text": "Yeah, this is a crazy ass book!  I'm only 2/3 thru it and never want it to end!  It makes me smile to know it sits quietly on my bedside table during the day, waiting for me to return to it's pages.  In the early pages take note of Ramram's prophecy for yet unborn Saleem.  What follows is linked to that moment in time."}, {"review_sentiment": 5.0, "review_text": "Rushdie mashes absurdity and reality together. His prose is unrelenting. His narrator gleefully rambles and digresses. The world of magic, the main story, and the parallel story of the Indian political landscape circle around one another till their inevitable collision. It's easy to get lost in the multitude of characters, spanning across generations and nations. Just hold on -- the pay off will come when Rushdie's architecture of story and genealogy is revealed in a touching ending."}, {"review_sentiment": 2.0, "review_text": "I had to give it up after 45 pages.  From the awards and reviews I was expecting a serious book about a serious country in a serious time.  If you don't know, this book is mostly whimsy, odd humor, farce and inability to move the story.  I'm sure Rushdie was in stitches as he wrote each page but his humor escapes me.  If you want to read about a doctor with a huge nose, a hypochondriac woman who for modesty's sake must be examined through a hole in a draped sheet, a boatman who never bathes and a group of elders that use a spittoon from great distances, then this is your book. It isn't mine.If you want to read a very good book with Muslim mysticism try \"Alif the Unseen.\""}, {"review_sentiment": 4.0, "review_text": "Set against a turbulent period of Indo/Pakistani history, this is a fantastical voyage through the lives of one family.  It captures the essence of the time in a well written narrative"}, {"review_sentiment": 4.0, "review_text": "Great magical realism- loved it!"}, {"review_sentiment": 5.0, "review_text": "I gave this book five stars due to Salman Rushdie's skill and talent as an author. I much appreciate his imagination to which he gives full reign and allows it to leap, take wing, and soar all over the place. I appreciate the clever structure that undergirds the novel. I greatly appreciate his talent as a wordsmith. And I especially appreciate his wit.That said, I really was not crazy about this book. Magical realism is not a genre that I like at all. But I was compelled by Rushdie's effervescent prose to continue on to the end and I'm glad I did. However, I must say that I prefer fiction where the art of it is not so \"on parade.\" I revel in finding books in which you don't even think of the author, you don't \"smell the sweat\" of all the hard work that went into the book, you just get drawn in and revel in the story. I want books in which you aren't taken out the the story to remark to yourself how clever the writer is. I have a background in acting and as an actor, you want people to forget you're an actor and especially not to think of all the work behind your performance. If the audience is thinking of what a great actor you are while you are performing, in my opinion, you have failed.So, I understand why people really like this book. I just don't think I like most postmodern fiction too much. And the older I get, the more I learn that I'm probably a lot more shallow and not as intellectual as I often pretend to be."}, {"review_sentiment": 5.0, "review_text": "a romp - even if you can't keep the characters straight."}]}, "authors": ["Salman Rushdie"], "isbn": "0812976533", "longitude": 0.0, "periods": ["1900s"], "title": "Midnight's Children", "word_cloud": "recommend couldn't not try really hard much train consciousness write story deliciously dark hold mirror possibly fun house history give parallel struggle nationhood crush hard put group discuss meeting highly regarded many prize consider father post modern indian subject popular controversy current edition lack sentence sue omit mention recent famous inspiration caution indian writer come life story recount first third person discuss true postmodern fashion wife bear stroke midnight partition omniscient narrator know character thought thanks telepathic power special power allows spy parent anybody interested communicate bear historic moment magical power story parallel modern history overwhelm interesting western member group fact find story language brilliant sometimes difficult follow only finish looong many character dedicate page title character course trouble remember also indian lot indian language reference also trouble crazy as thru never want end make smile know sits quietly bedside table day wait return page early page take note prophecy yet unborn follow link moment time mash absurdity reality together prose unrelenting narrator gleefully ramble digress world magic main story parallel story indian political landscape circle till inevitable collision easy lose multitude character span generation nation just pay architecture story genealogy reveal touch end give page award review expect serious serious country serious time know mostly whimsy odd humor farce inability move story sure rushdie stitch write page humor escape want doctor huge nose hypochondriac woman modesty sake hole draped sheet boatman never bath group elder use spittoon great distance want good mysticism try turbulent period history fantastical voyage live family capture essence time well write narrative magical love give star due talent author much appreciate imagination give full reign allow leap wing soar place appreciate clever structure under girds greatly appreciate talent wordsmith especially appreciate say really crazy realism genre like compel effervescent prose continue end glad however prefer fiction parade revel find even think author smell hard work go draw revel story want take story remark clever writer background act actor want people actor especially think work performance audience think great actor perform opinion understand people really think like postmodern fiction much older get learn probably lot shallow intellectual often pretend romp even character straight", "genres": ["Fiction & Literature", "Historical Fiction", "Politics"], "summary": "Saleem Sinai is born at the stroke of midnight on August 15, 1947, the very moment of India’s independence. Greeted by fireworks displays, cheering crowds, and Prime Minister Nehru himself, Saleem grows up to learn the ominous consequences of this coincidence. \r\n\r\nHis every act is mirrored and magnified in events that sway the course of national affairs; his health and well-being are inextricably bound to those of his nation; his life is inseparable, at times indistinguishable, from the history of his country. \r\n\r\nPerhaps most remarkable are the telepathic powers linking him with India’s 1,000 other “midnight’s children,” all born in that initial hour and endowed with magical gifts.\r\n\r\nThis novel is at once a fascinating family saga and an astonishing evocation of a vast land and its people–a brilliant incarnation of the universal human comedy. \r\n\r\nMidnight’s Children stands apart as both an epochal work of fiction and a brilliant performance by one of the great literary voices of our time.", "asin": "0812976533", "rank": "16016", "city": "Mumbai", "image": "https://images-na.ssl-images-amazon.com/images/I/51yqNUCZu6L.jpg", "country": "Lahore", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}