{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 18.4801972, "ratings": {"num_ratings": 536, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "I love books that paint the picture of adventure and this one is that kind of book. I also like to ready anything that has John Chatterton in it. He is the most adventurous person when it comes to diving and frankly his dives scare the hell out of me! That's what makes his stories so compelling and exciting. This is a great read and worth the time to be part of the adventure!"}, {"review_sentiment": 4.0, "review_text": "enjoyable read"}, {"review_sentiment": 4.0, "review_text": "With this one I learn so much about the lives of pirates and why they did what they did"}, {"review_sentiment": 4.0, "review_text": "Very interesting story.  May be a bit more detail than some prefer, but I happily went along for the ride.  It is amazing the specialized aspects of our world that some people are obsessed to master."}, {"review_sentiment": 4.0, "review_text": "Made me want to learn to swim and become a diver!!"}, {"review_sentiment": 5.0, "review_text": "If you're a diver, recreational or otherwise, you will enjoy this book!"}, {"review_sentiment": 4.0, "review_text": "A good read"}, {"review_sentiment": 5.0, "review_text": "Great story and attention to detail - can't wait for my husband to read this real life story. We are both scuba divers."}, {"review_sentiment": 5.0, "review_text": "Great read ,a page turner if you love history ,discovery ,adventure along with pirates this is a book for you"}, {"review_sentiment": 4.0, "review_text": "Well researched well done."}]}, "authors": ["Robert Kurson"], "isbn": "0812973690", "longitude": -69.942111, "periods": ["2000s", "Recent Releases"], "title": "Pirate Hunters: Treasure, Obsession, and the Search for a Legendary Pirate Ship", "word_cloud": "love paint picture adventure kind also like ready anything adventurous person come dive frankly dive scare hell make story compel excite great worth time part adventure enjoyable learn much life pirate very interesting story bit detail prefer happily go ride amaze specialize aspect world people obsess master make want learn swim become diver diver recreational otherwise enjoy good story attention detail husband real life story scuba diver page turner history discovery adventure pirate well research well do", "genres": ["History", "Travel Writing"], "summary": "NEW YORK TIMES BESTSELLER \r\n\r\nA thrilling adventure of danger and deep-sea diving, historic mystery and suspense, by the author of Shadow Divers.\r\n\r\nFinding and identifying a pirate ship is the hardest thing to do under the sea. But two men—John Chatterton and John Mattera—are willing to risk everything to find the Golden Fleece, the ship of the infamous pirate Joseph Bannister. At large during the Golden Age of Piracy in the seventeenth century, Bannister should have been immortalized in the lore of the sea—his exploits more notorious than Blackbeard’s, more daring than Kidd’s. But his story, and his ship, have been lost to time. If Chatterton and Mattera succeed, they will make history—it will be just the second time ever that a pirate ship has been discovered and positively identified. Soon, however, they realize that cutting-edge technology and a willingness to lose everything aren’t enough to track down Bannister’s ship. They must travel the globe in search of historic documents and accounts of the great pirate’s exploits, face down dangerous rivals, battle the tides of nations and governments and experts. But it’s only when they learn to think and act like pirates—like Bannister—that they become able to go where no pirate hunters have gone before.\r\n\r\nFast-paced and filled with suspense, fascinating characters, history, and adventure, Pirate Hunters is an unputdownable story that goes deep to discover truths and souls long believed lost.\r\n\r\n“You won’t want to put [it] down.” Los Angeles Times", "asin": "0812973690", "rank": "180031", "city": "Santo Domingo", "image": "https://images-na.ssl-images-amazon.com/images/I/61nbl8FKKdL.jpg", "country": "D.R.", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}