{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 932, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Highly recommended. I am sure it will make a great movie as well. Fascinating way to tell about historical events"}, {"review_sentiment": 3.0, "review_text": "I admire the research the author did in writing this book. Historical fiction based on fact is my most favorite genre. Although I liked this book, I did not love it. There was something missing from what I would consider a great HF novel. Maybe because it was wrapped up in the legal issues, or maybe because the characters as described by the author just didn’t grab me, but there was something off in my estimation. When I think of great historical fiction, something I would rate five stars would be on the order of Robert Harris’s Cicero trilogy. Cicero certainly would have been a boring subject, but somehow Robert Harris turned it into the most fascinating story one could imagine. This novel was somewhat interesting but not just not engrossing. I always hate to be too critical when I know the author has done extensive research but I just could not rate this novel any higher."}, {"review_sentiment": 5.0, "review_text": "After reading this I passed it on to my husband - we both enjoyed the story and the setting. This was a very entertaining way to focus on this time in history."}, {"review_sentiment": 4.0, "review_text": "good historical fiction.I enjoyed it."}, {"review_sentiment": 5.0, "review_text": "excellent historical novel.i loved the writting"}, {"review_sentiment": 4.0, "review_text": "The story line is engaging and the character portrayals are revealing, but as a technical-type it left a lot to be desired in the 1) ac vs dc debate 2) explanation of what was different about Westinghouse & Edison light bulbs, 3) specific contributions Tesla made that were a factor in the ac / dc conflict.  The epilogue was good but would have been better if it had been much more extensive."}, {"review_sentiment": 5.0, "review_text": "Well written account of Edison, Tesla and Westinghouse."}, {"review_sentiment": 5.0, "review_text": "This was a very well written historical fiction.  All the characters were well defined. Tesla’s breakdown, the rivalry of those at the top, the shark tank of capitalistic society; beautifully written."}, {"review_sentiment": 4.0, "review_text": "Historically very interesting with a few diversions from the facts in the timeline. Good fictional storyline to string the facts together.Learned a lot about Edison, Tesla ,JP Morgan, and Westinghouse and their Era of invention and the competition in their industries."}, {"review_sentiment": 5.0, "review_text": "Great read!"}]}, "authors": ["Graham Moore"], "isbn": "0812988906", "longitude": 0.0, "periods": ["1800s", "Recent Releases"], "title": "The Last Days of Night", "word_cloud": "recommend sure make great movie well way tell historical event admire research author write fiction base fact favorite genre like love something miss great wrap legal issue maybe character describe author grab something estimation think great historical fiction something rate star order trilogy certainly subject somehow turn fascinate story somewhat interesting engross always hate critical know author do extensive research rate higher read pass husband enjoy story set entertaining way focus time history good historical enjoyed excellent historical love write story line engage character portrayal reveal leave lot desire v dc debate explanation different light bulb specific contribution make factor ac dc conflict epilogue good better much extensive well write account well write historical fiction character well define breakdown rivalry top shark tank capitalistic society beautifully write historically interesting diversion fact timeline good fictional story line string fact lot invention competition industry great", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "A thrilling novel based on actual events, about the nature of genius, the cost of ambition, and the battle to electrify America.\r\n\r\nNew York, 1888. Gas lamps still flicker in the city streets, but the miracle of electric light is in its infancy. The person who controls the means to turn night into day will make history—and a vast fortune. A young untested lawyer named Paul Cravath, fresh out of Columbia Law School, takes a case that seems impossible to win. Paul’s client, George Westinghouse, has been sued by Thomas Edison over a billion-dollar question: Who invented the light bulb and holds the right to power the country?\r\n \r\nThe case affords Paul entry to the heady world of high society—the glittering parties in Gramercy Park mansions, and the more insidious dealings done behind closed doors. The task facing him is beyond daunting. Edison is a wily, dangerous opponent with vast resources at his disposal—private spies, newspapers in his pocket, and the backing of J. P. Morgan himself. Yet this unknown lawyer shares with his famous adversary a compulsion to win at all costs. How will he do it?\r\n \r\nIn obsessive pursuit of victory, Paul crosses paths with Nikola Tesla, an eccentric, brilliant inventor who may hold the key to defeating Edison, and with Agnes Huntington, a beautiful opera singer who proves to be a flawless performer on stage and off. As Paul takes greater and greater risks, he’ll find that everyone in his path is playing their own game, and no one is quite who they seem.\r\n \r\n“In The Last Days of Night, Graham Moore takes us back to the dawn of light—electric light—into a world of invention and skulduggery, populated by the likes of Edison, Westinghouse, Tesla, and the novel’s hero, a young lawyer named Paul Cravath (a name that will resonate with ambitious law students everywhere). It’s part legal thriller, part tour of a magical time—the age of wonder—and once you’ve finished it, you’ll find it hard to return to the world of now.” Erik Larson, author of The Devil in the White City", "asin": "0812988906", "rank": "17607", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51LtIEPKA7L.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}