{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 188, "rating": 3.4, "reviews": [{"review_sentiment": 4.0, "review_text": "The narrative was a bit disjointed and sometimes irritating as a result, but it kept me engaged and wondering about the characters and their stories."}, {"review_sentiment": 5.0, "review_text": "I loved the way this book wove together the stories of three generations of two families in a completely unexpected way.  The writing was beautiful"}, {"review_sentiment": 3.0, "review_text": "Mr. Gilbert is a marvelous wordsmith and gifted prose stylist but the book is so rambling and digressive that it undercuts his talent. Having read and marveled at his short stores in the past, I feel that, like John Updike, he is much more successful in the short form than in novels. I think that if a really judicious editor had made some significant and very large cuts, this could have been a marvelous book."}, {"review_sentiment": 1.0, "review_text": "I wanted to quit reading this book about halfway through. By the end i wished I had. A token twist ending without being too much of a surprise. You knew some shoe was going to drop just not which one. A wholly inlikeable narrator that breaks the fourth wall to explain how he knows private information but only when it's convenient for the author to come up with an explanation. Just another grasping, transparent novel that tries too hard to show it knows the wealthy life inside New York's literary world and those in their orbit. But the ending just for the sake of it without any real moral imperative to the plot. Ugh."}, {"review_sentiment": 2.0, "review_text": "Oh yey, I thought, proper literature. Well reviewed, national bestseller, sounds great. But no. Not so much. This story of a Salingeresque writer and his family peripherally narrated by the best friend's son left a lot to be desired. It was definitely the proper literature, in fact it was tragically dramatically aware of it, with its ponderous page long sentences and overwhelming self importance. In fact, it was so busy being literature, it forgot to be a good book. You know, the sort with likeable characters and things happening and arcs and journeys and enveloping engagement for readers. All those things were either not offered at all or only sporadically and mostly buried by the oppressive general prolixity.  The actual events in the book span a brief amount of time, though described in such exhaustive detail, it becomes exhausting to read. The book took 6 years to write and what felt like years to read. It wasn't difficult to put down or something to look forward to picking back up again. I read it with mad determination of a completist, plodding through obscenely protracted sentences to get to the oases of actually enjoyable scenes. It was a task to finish, downright tedious at times. And the thing is Gilbert is obviously talented (and quite clever judging by the book's extras, it's there within the pages, however overwritten those are. Readers who are into  these sort of weighty slow family dramas and valuing language over plot might enjoy this. I'm usually really into the New York based stories, but this literati overindulgent moneyed elite just reeked of easy clichés. This seemed like the book it may be fashionable to pretend to like instead of actually like. Either way it really didn't work for me. Not enough redeeming features to justify the time. All that time."}, {"review_sentiment": 2.0, "review_text": "Hard to keep track of the characters as there are to many.  They switch from one to the next to much.  I can't say I would recommend this book to my fellow readers."}, {"review_sentiment": 2.0, "review_text": "A story of a disfuncional family. Well written but the prose too often interfered with the tell ing of the story. I found the ending depressing."}, {"review_sentiment": 4.0, "review_text": "I read a review in The New Yorker and then was notified by BookBub of a deal on this book so I bought it. I really enjoyed it, the writing and the family dynamics as well as the sci-fi plot twist."}, {"review_sentiment": 5.0, "review_text": "Outstanding piece of writing! Without doubt, a modern classic. Any reviewer who suggests otherwise is one of those cretins who gives five stars to books written on a seventh grade reading level."}, {"review_sentiment": 4.0, "review_text": "& Sons is a fine literary novel that touches on many of the interests of the lesser gender in this  inequitable world.  It is filled with those references to art and literature and life that lets you know the author has spent time learning about literature ,visiting museums and living that reminds old men like me of all the joys of life in a cultured world.  I found it a great fun read to review the exigencies that intercept most male llives."}]}, "authors": ["David Gilbert"], "isbn": "0812984358", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "& Sons", "word_cloud": "narrative bit disjointed sometimes irritate result keep engage wonder character story love way together story generation family completely unexpected way writing beautiful marvelous wordsmith gift prose stylist ramble digressive undercut talent have marvel short store feel much successful short form novel think really judicious editor make significant large cut want quit read halfway end wish token twist end much surprise know shoe go drop wholly unlikable narrator break fourth wall explain know private information convenient author come explanation grasp transparent try hard show know wealthy life literary world orbit end sake real moral imperative plot ya think proper literature review national bestseller sound great not much story writer family peripherally narrated best friend son leave lot desire definitely proper literature fact tragically dramatically aware ponderous page long sentence overwhelm self importance fact busy literature forget good know sort likable character thing happen arc journey envelop engagement reader thing offer sporadically mostly bury oppressive general prolixity actual event span brief amount time described exhaustive detail become exhaust take year write felt year difficult put something look forward pick mad determination completest plod obscenely protract sentence get oasis actually enjoyable scene task finish downright tedious time thing obviously talented quite clever judging extra page however overwrite sort weighty slow family drama value language plot usually really base story literati overindulgent moneyed elite reeked easy cliche seem like instead actually way really work not enough redeeming feature justify time time hard track character many switch next much fellow reader story dysfunctional family write prose often interfere ing story find end depress review notify deal buy really enjoy write family dynamic well twist outstanding piece write doubt modern classic reviewer suggest otherwise cretins give star write seventh grade reading level fine literary touch many interest lesser gender inequitable world fill reference art literature life let know spent time learn literature visit museum live reminds old men joy life culture world find great fun review exigency intercept male life", "genres": ["Fiction & Literature"], "summary": "“[A] big, brilliant novel.”—The New York Times Book Review\r\n\r\nWho is A. N. Dyer? & Sons is a literary masterwork for readers of The Art of Fielding, The Emperor’s Children, and Wonder Boys—the panoramic, deeply affecting story of an iconic novelist, two interconnected families, and the heartbreaking truths that fiction can hide.\r\n\r\nLook for special features inside. Join the Random House Reader’s Circle for author chats and more.\r\n \r\nThe funeral of Charles Henry Topping on Manhattan’s Upper East Side would have been a minor affair (his two-hundred-word obit in The New York Times notwithstanding) but for the presence of one particular mourner: the notoriously reclusive author A. N. Dyer, whose novel Ampersand stands as a classic of American teenage angst. But as Andrew Newbold Dyer delivers the eulogy for his oldest friend, he suffers a breakdown over the life he’s led and the people he’s hurt and the novel that will forever endure as his legacy. He must gather his three sons for the first time in many years—before it’s too late.\r\n \r\nSo begins a wild, transformative, heartbreaking week, as witnessed by Philip Topping, who, like his late father, finds himself caught up in the swirl of the Dyer family. First there’s son Richard, a struggling screenwriter and father, returning from self-imposed exile in California. In the middle lingers Jamie, settled in Brooklyn after his twenty-year mission of making documentaries about human suffering. And last is Andy, the half brother whose mysterious birth tore the Dyers apart seventeen years ago, now in New York on spring break, determined to lose his virginity before returning to the prestigious New England boarding school that inspired Ampersand. But only when the real purpose of this reunion comes to light do these sons realize just how much is at stake, not only for their father but for themselves and three generations of their family.\r\n \r\nIn this daring feat of fiction, David Gilbert establishes himself as one of our most original, entertaining, and insightful authors. & Sons is that rarest of treasures: a startlingly imaginative novel about families and how they define us, and the choices we make when faced with our own mortality.\r\n \r\n“A big, ambitious book about fathers and sons, Oedipal envy and sibling rivalry, and the dynamics between art and life . . . [& Sons] does a wonderful job of conjuring up its characters’ memories . . . in layered, almost Proustian detail.” The New York Times", "asin": "0812984358", "rank": "237021", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51VHCGUOpQL.jpg", "country": "Brooklyn", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}