{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 89, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "excellant read"}, {"review_sentiment": 5.0, "review_text": "I have mos of the Travis McGee novels, but was missing this one.  I have always enjoyed reading these novels and this one is no exception."}, {"review_sentiment": 2.0, "review_text": "A very forgettable book. I quit reading about halfway through. This was my first JDM book. They came highly recommended but I was very disappointed."}, {"review_sentiment": 5.0, "review_text": "A complex wonderful entry in the series as it slowly winds down. I don't want it to end. Highly recommended."}, {"review_sentiment": 4.0, "review_text": "Travis McGee is an unlicensed investigator who recovers stolen property, by illegal means if necessary.  His occupation is suitable for a self-confessed adrenaline junkie with an aversion to conformity.  His personal life is mainly hormone-directed, although he does have standards.  He disdains prostitutes and murder accomplices.  In several instances (earlier in the book series), he has seriously considered a long-term relationship.  These women tend to be intelligent professionals of good character, who are largely self-sufficient, except they all need his special brand of bedroom therapy to enrich their lives and become more complete human beings.  McGee is a likable, understandable, sympathetic character, aside from his pervasive promiscuity, which can be overlooked because it’s boosting book sales. In the Turquoise story, McGee deviates from his established pattern.  He becomes deeply involved with a woman whose history includes emotional instability, a longstanding obsession with him, and an incident in which she tried to accuse him of rape.  What does he see in her?  He addresses this issue semi-seriously, listing her wealth, youth, and ability to cook.  If this relationship turned out badly, would we sympathize with the poor fellow, or wonder what else he could have expected?  We are given no reason to care about this woman, which undercuts the story's suspense, but not its poetic imagery.  From a height on an exotic island, McGee scans the horizon tensely, day after day, for any sign of the ship bearing his loved one -- a touching gender role reversal. JDM’s stories are imaginative, original, and laced with informative detail.  His writing style is uniquely delightful.  He could describe grass growing or paint drying and make it thoroughly entertaining.  The stories' weakest element is plot structure.  Among other issues, the motives of principal characters are sometimes obscure or implausible, and the hero/villain conflict is sometimes resolved by McGee getting lucky.  In the Turquoise story, McGee’s emotional attachment to this particular woman is out of character.  It's an implausible motive for getting into a life-threatening situation, and the story's suspense level suffers for it.  Even so, I have not yet picked up a McGee story, including this one, that was easy to put down.  Fifteen and counting. "}, {"review_sentiment": 4.0, "review_text": "Another fine read by John D. MacDonald.  Some are better than others, but he never fails to deliver."}, {"review_sentiment": 5.0, "review_text": "I love the Travis McGee series and Turquoise Lament is no exception.  Yes, the attitudes are a bit dated, but read these books if you want a good mystery, a good escape read and good commentary about greed and vice."}, {"review_sentiment": 5.0, "review_text": "John d Macdonald writes great stuff"}, {"review_sentiment": 5.0, "review_text": "Love the Travis McGee series."}, {"review_sentiment": 5.0, "review_text": "All Travis McGee novels are stellar!"}]}, "authors": ["John D. MacDonald"], "isbn": "0812984064", "longitude": -157.8556764, "periods": ["2000s", "Recent Releases"], "title": "The Turquoise Lament: A Travis McGee Novel", "word_cloud": "excellent mos novel miss always enjoy read novel exception forgettable quit read halfway first come highly recommend disappoint complex wonderful entry series slowly wind want end recommend unlicensed investigator recovers steal property illegal mean necessary occupation suitable adrenaline junkie aversion conformity personal life mainly standard disdain prostitute murder accomplice several instance earlier series seriously consider relationship woman tend intelligent professional good character largely need special brand bedroom therapy enrich live become complete human being likable understandable sympathetic character aside pervasive promiscuity overlook boost sale story deviate establish pattern become deeply involved woman history include emotional instability longstanding obsession incident try rape see address issue list wealth youth ability cook relationship turn badly poor fellow wonder else expect give reason care woman undercut story suspense poetic imagery height exotic island scan horizon tensely day day ship bearing love touch gender role reversal story imaginative original laced informative detail write style uniquely delightful grass grow paint dry thoroughly entertain story weakest element plot structure issue motif principal character sometimes obscure implausible conflict sometimes resolve get lucky story emotional attachment particular woman character implausible motive get situation story suspense level suffers even yet pick story include easy put count fine better others never fail deliver love series exception attitudes bit dated want good mystery good escape good commentary greed vice write great stuff series novel stellar", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 15/21 in Travis McGee\r\n\r\n\"One of the most enduring and unusual heroes in detective fiction.\" Baltimore Sun\r\n\r\nNow that Linda \"Pidge\" Lewellen is grown up, she tells Travis McGee, once her girlhood idol, that either she's going crazy or Howie, her affable ex-jock of a husband is trying to kill her. McGee checks things out, and gives Pidge the all clear. But when Pidge and Howie sail away to kiss and make up, McGee has second thoughts. If only he can get to Pidge before he has time for any more thinking....\r\n\r\n“The great entertainer of our age, and a mesmerizing storyteller.” Stephen King", "asin": "0812984064", "rank": "153041", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51xtG0GZj7L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}