{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 21.161829, "ratings": {"num_ratings": 221, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "This is not the type of book I usually read. It has been sitting on my shelf for years. It has left me wanting to read more of his books. I like long books, but this was even long for me. A massive tome and with small print in the hardcover on top of that.I don’t understand how he could have had the time to research for one book, let alone the many he has written.The different chapters, some very long, are like short stories with a lot of history mixed in with great plots. You hated when each one ended, although some of them interweaved together. They take place in different time periods on different islands. It really was disturbing and sad the way people in history have been so utterly cruel to one another. Makes me want to resign from the human race.😞I must say though, that he is king of the run-on sentence."}, {"review_sentiment": 5.0, "review_text": "Michener writes blockbuster historical novels.  This one is great for a tropical vacation read!"}, {"review_sentiment": 4.0, "review_text": "This novel taught me a lot about the history of the Caribbean and gave me a new perspective of this area in our back yard.  I've read several other Michener novels and really enjoy the way he brings the area alive, my personal favorite being Alaska.  You have to get into a frame of mind that when you begin to read one of these novels, you need to enjoy the voyage and not be in a hurry to get to the end.  The one thing that Michener does that takes getting used to for me is his long sentences.  They are grammatically correct, but  seem to run on more than I like.  I gave this one a 4 star because I didn't think it was his best, but it was very good."}, {"review_sentiment": 5.0, "review_text": "All of Michener's historical novels are great - you just can't hurry the read. I'd you've traveled the Caribbean, studied new world exploration, or just like adventure this book is for you. Written from many different perspectives, locations, and across the centuries."}, {"review_sentiment": 5.0, "review_text": "This is one of Michener's better offerings. It is typical of his narrative development using a kind of \"leap frog\" technique where a character from an earlier episode may appear or have a descendant in a later one. The map of the Caribbean lends itself to both parallel and sequential narrative threads. In many of the episodes the good and the noble die at an early age and the venal, opportunistic, and violent thrive. Sometimes there is payback and sometimes, not often enough, but surprisingly and in accord with reality, the good guys win. Michener's theme of a more perfect world peopled by the progeny from many genetic and ethnic mixes has ample opportunity for development in this novel. His island, All Saints, is a kind of \"Everyman\" of Caribbean locations. \"Caribbean\" is worth the voyage."}, {"review_sentiment": 5.0, "review_text": "Great"}, {"review_sentiment": 1.0, "review_text": "Did not the book.it is an old cover and does not look like all the other Michener books."}, {"review_sentiment": 5.0, "review_text": "satisfied"}, {"review_sentiment": 3.0, "review_text": "Very much like reading a textbook. I did learn a ton but I didn't feel as invested in the characters as I did with other Michener books. Still worth the read. I've learned more reading Michener books than any class in college."}, {"review_sentiment": 5.0, "review_text": "What an excellent book by Michener. I love all his books!  His descriptions of the Caribbean islands.  I plan on reading all of his books!"}]}, "authors": ["James A. Michener"], "isbn": "0812974921", "longitude": -86.82505, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s", "500-1400s"], "title": "Caribbean: A Novel", "word_cloud": "type usually sit year leave want like long even long massive tome small print hardcover top understand time research let alone many different chapter long short story lot history mixed great plot hat end interweave together take place different time period different island really disturb sad way people history utterly cruel want resign human king sentence write blockbuster historical novel great tropical vacation taught lot history give new perspective area back yard several novel really way brings area alive personal favorite get frame mind novel need enjoy voyage hurry get thing take get use long sentence grammatically correct seem run give star think best good historical novel great travel study new world exploration adventure many different perspective location century better offering typical narrative development use kind leap frog technique character earlier episode descendant later map lend parallel sequential narrative thread many episode good noble die early age venal opportunistic violent thrive payback sometimes often enough surprisingly accord reality good guy win theme perfect world people progeny many genetic ethnic mix ample opportunity development island kind location worth voyage great old cover look satisfied very much read textbook learn ton feel invested character still worth learn read class college excellent love description island plan read", "genres": null, "summary": "In this acclaimed classic novel, James A. Michener sweeps readers off to the Caribbean, bringing to life the eternal allure and tumultuous history of this glittering string of islands. \r\n\r\nFrom the 1310 conquest of the Arawaks by cannibals to the decline of the Mayan empire, from Columbus’s arrival to buccaneer Henry Morgan’s notorious reign, from the bloody slave revolt on Haiti to the rise of Cuba’s Fidel Castro, Caribbean packs seven hundred dramatic years into a tale teeming with revolution and romance, authentic characters and thunderous destinies. \r\n\r\nThrough absorbing, magnificent prose, Michener captures the essence of the islands in all of their awe-inspiring scope and wonder.\r\n\r\n“Even American tourists familiar with some of the serene islands will find themselves enlightened. . . . In Caribbean, there appears to be a strong aura of truth behind the storytelling.” The New York Times", "asin": "0812974921", "rank": "51740", "city": "Cancun", "image": "https://images-na.ssl-images-amazon.com/images/I/51fvxn2amVL.jpg", "country": "Mexico", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}