{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 553, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "I agree with other commenters about the wealth of historical insights, but also the many (not all) one-dimensional characters and the rushed/ incomplete ending. Our book club agreed that most of the characters were not developed - as another commenter here put it, more like cardboard cutouts. And rather venal, cruel, and duplicitous ones at that. Even Pompeii was portrayed as largely a hustler's town - surely it was more complex and nuanced than that?In contrast, the hero, Attilius the aqueduct engineer (\"the acquarius\"), his love interest Corelia, and Pliny the Elder, his sister Julia, and her son Pliny the Younger were portrayed more fully. And Pliny the Elder's death at Stabiae (just south of Pompeii) in the last phase of Vesuvius' eruption, is quite accurate - you can google it and find corroboration from an actual letter of Pliny the Younger to the Roman historian Tacitus. (Pliny the Elder was scrupulous about taking concurrent notes, which his skilled slave Alexion saved from the eruption and later delivered to Pliny's nephew.)So other than the surfeit of nasty, shallow characters and the rushed/undeveloped ending, this book is actually a page-turner infused with deep and illuminating historical research and the occasional wise observation. For example, the engineer so familiar with the structural wonders of the Augusta Aqueduct ruefully notes as the power of Vesuvius is threatening all that: \"Civilization was a relentless war that man was doomed to lose eventually\" (p.153). For insights such as those, and for being in the company of Pliny the Elder (the great ancient naturalist) for a good deal of the narrative, I would give \"Pompeii\" four stars."}, {"review_sentiment": 4.0, "review_text": "The focus of the book is on events preceding the eruption of Mount Vesuvius, which led to the virtual annihilation of both Pompeii and Herculaneum. I was expecting a book that related to the eruption and the aftermath of that.This is covered in the book but through mainly one character, the engineer Marcus Attilius Primus. So it is an interesting approach, focusing on the human angle but in a novel way. The story is covered over four days. From a historical perspective the book gives great insight into the value of aqua ducts to the Romans, how they were designed and maintained, and the task of the engineers and their helpers.  The reader also gets good insight into the politics in the Roman Empire at the same time bringing in individuals at different levels of society whose lives were affected.There is vivid description about the effect of the eruption on some people but the full impact the eruption is not detailed.Robert Harris ought to have included a glossary for all the Latin terms that were used. It becomes irritating when the reader does not get the full impact of words used.The map at the beginning of the book is useful as it shows the location of Aqua Augusta, but it could have been more detailed so the reader could locate all the places mentioned in the book."}, {"review_sentiment": 5.0, "review_text": "Great to read , especially as I just cane back from Pompeii"}, {"review_sentiment": 4.0, "review_text": "I really enjoyed this book. Parts of it were a little to technical for my taste, but the story was very compelling and informative as well."}, {"review_sentiment": 3.0, "review_text": "Pompeii was interesting and a good read.  The lead up to the actual eruption was fascinating and kept the readers anxious to turn the pages.  I would have liked even more information and less of the graphic sexual details that had little or no  importance to the story."}, {"review_sentiment": 5.0, "review_text": "This book is fascinating.  I could hardly put it down.  I purchased the book after seeing the Pompeii exhibit in my area.  The two totally complement each other, but the book no doubt stands on its own."}, {"review_sentiment": 4.0, "review_text": "Another brilliantly researched page turner."}, {"review_sentiment": 5.0, "review_text": "Great read!  It was really interesting since I had just visited Pompeii."}, {"review_sentiment": 3.0, "review_text": "Kind of interesting, kind of tedious, good historical value.  I love a lot of Harris's books, but I'm having a hard time getting through this one.  I'm surprised at the language - did they use words like this back then?  Sounds like today's street language."}, {"review_sentiment": 2.0, "review_text": "The building story I found boring. But when it got to the end and the erruption it became more interesting as a glimpse of what it might have been like."}]}, "authors": ["Robert Harris"], "isbn": "0812974611", "longitude": 12.4829321, "periods": ["Recent Releases", "0-500s"], "title": "Pompeii: A Novel", "word_cloud": "agree comm enters wealth historical insight also many character incomplete end club agree character develop commented put cardboard cutout rather venal cruel duplicitous one even portray largely hustler town surely complex nuanced contrast hero aqueduct engineer aquarius interest sister son portray fully death south last phase eruption quite accurate google corroboration actual letter historian scrupulous take concurrent note skilled slave save eruption later deliver nephew so surfeit nasty shallow character end actually infuse deep illuminate historical research occasional wise observation example engineer familiar structural wonder ruefully note power threaten relentless war man doom lose eventually insight company great ancient naturalist good deal narrative star focus event precede eruption lead virtual annihilation expect related eruption aftermath cover mainly character engineer interesting approach focus human angle way story cover day historical perspective give great insight value aqua duct design maintain task engineer helpers also get good insight politics time bring individual different level society live vivid description effect eruption people full impact eruption include glossary term use become irritate full impact word map begin useful show location place mention especially cane back really enjoy little technical taste story compel informative well interest good lead actual eruption fascinate keep reader anxious turn page even information le graphic sexual detail little importance story fascinating hardly purchase see exhibit area totally complement doubt stand brilliantly research page turner really interest visit interesting kind tedious good historical value love lot hard time get surprise language use word back sound today street language building story find bore get end eruption become interesting glimpse", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "Ancient Rome"], "summary": "All along the Mediterranean coast, the Roman empire’s richest citizens are relaxing in their luxurious villas, enjoying the last days of summer. The world’s largest navy lies peacefully at anchor in Misenum. The tourists are spending their money in the seaside resorts of Baiae, Herculaneum, and Pompeii.\r\n\r\nBut the carefree lifestyle and gorgeous weather belie an impending cataclysm, and only one man is worried. The young engineer Marcus Attilius Primus has just taken charge of the Aqua Augusta, the enormous aqueduct that brings fresh water to a quarter of a million people in nine towns around the Bay of Naples. His predecessor has disappeared. Springs are failing for the ﬁrst time in generations. And now there is a crisis on the Augusta’s sixty-mile main line—somewhere to the north of Pompeii, on the slopes of Mount Vesuvius.\r\n\r\nAttilius—decent, practical, and incorruptible—promises Pliny, the famous scholar who commands the navy, that he can repair the aqueduct before the reservoir runs dry. His plan is to travel to Pompeii and put together an expedition, then head out to the place where he believes the fault lies. But Pompeii proves to be a corrupt and violent town, and Attilius soon discovers that there are powerful forces at work—both natural and man-made—threatening to destroy him.\r\n\r\nWith his trademark elegance and intelligence, Robert Harris, bestselling author of Archangel and Fatherland, re-creates a world on the brink of disaster.", "asin": "0812974611", "rank": "50994", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/51D3W0ZTGKL.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}