{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 423, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "great story-telling- tough to put this book down."}, {"review_sentiment": 3.0, "review_text": "I found the writing and characters a bit amateurishly written and the plot contrived. I was hoping for something better written considering the subject matter and characters! But the plot did keep me reading. I also really enjoyed all the Dante discussion which is the reason I read the book in the first place. I'd recommend the novel to anyone interested in Dante's Inferno. I didn't find the author's rendition of the three other writers particularly engaging."}, {"review_sentiment": 5.0, "review_text": "A real thriller with historical characters and setting. A book you just can't stop reading."}, {"review_sentiment": 3.0, "review_text": "Good mystery, but for me, a bit sluggish read."}, {"review_sentiment": 1.0, "review_text": "Too dry, did not pull me in."}, {"review_sentiment": 2.0, "review_text": "Gruesome.  Too graphic for me to continue.  I read about 40 pages."}, {"review_sentiment": 1.0, "review_text": "I read this book when I returned from a long trip overseas. Dante is a favorite author,but I slogged through this book, hoping that the killer was not as obvious as I thought it could be. Unfortunately , it is as obvious, and if you have ever experienced the ancient practice of wearing a hair shirt , the reading experience was similar. There aren't many characters I found to remotely interesting, and the premise is silly. What's sillier is the killer and his motives. Toss this one into the third ring of the nether world. I cannot recommend this book. I can say I will not read this author in future.Source: a small bookseller in Europe"}, {"review_sentiment": 5.0, "review_text": "Best book I've read in years.  Very well researched and thoroughly engrossing.  Couldn't put it down.  It sent me back to our literary masters, Longfellow, Lowell, et al.  Powerful sense of place of New England, Boston, and Harvard."}, {"review_sentiment": 1.0, "review_text": "I REALLY disliked this book. The premise is ridiculous and contrived: Five 19th century luminaries such as Longfellow, Oliver Wendell Holmes etc. act as armature sleuths to find a psychotic killer. The main characters seem to have barely one character trait each: 1 is always serene, one is always analytical, one is always impetuous, the others are blank. All of them are predictable and boring. Along the way, the reader is subjected to graphic descriptions of horrendous scenes of torture and slaughter, but no suspense (and I don't even know how that is possible!). Towards the end of the book there are also a couple gratuitous instances of ugly violent racism which have absolutely nothing to do with the plot or character development. The penultimate straw is the fact that the murderer's identity is discovered by the sleuths and revealed to the reader long before the end of the story, making for a really long, dragged-out and tedious denouement. SPOILER ALERT):  The last straw is that the perpetrator turns out to be a minor character who has barely been introduced throughout the \"story.\"  I kept hoping it would get better, and ended up wishing it would just end."}, {"review_sentiment": 4.0, "review_text": "It was difficult reading at first but got better as the story progressed. The ending seemed hurried like the author just wanted it to end."}]}, "authors": ["Matthew Pearl"], "isbn": "0812971043", "longitude": -71.0595678, "periods": ["1800s", "Recent Releases"], "title": "The Dante Club: A Novel", "word_cloud": "great tough put find write character bite amateurishly write plot contrive hop something better write consider subject matter character plot keep reading also really enjoyed discussion reason first place recommend anyone interested find author rendition writer particularly engage real thriller historical character set reading good mystery bit sluggish dry pull graphic continue page return long trip overseas favorite author slog hop killer obvious think unfortunately obvious ever experience ancient practice wear hair shirt read experience similar many character find remotely interesting premise silly sillier killer motif third ring nether world recommend say author small best year very well research thoroughly engross send back literary master al sense place really dislike premise ridiculous contrive five century luminary act armature sleuth psychotic killer main character seem barely character trait always serene always analytical always impetuous others blank predictable boring way subject graphic description horrendous scene torture slaughter suspense even know possible end also couple gratuitous instance ugly violent racism absolutely nothing plot character development penultimate straw fact murderer identity discover sleuth reveal long end story make really long tedious denouement last straw perpetrator turn minor character barely introduce story keep hop better end wishing difficult read first get better story progress end seem hurry author want end", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "A New York Times Bestseller\r\nWords can bleed.\r\n\r\nIn 1865 Boston, the literary geniuses of the Dante Club—poets and Harvard professors Henry Wadsworth Longfellow, Dr. Oliver Wendell Holmes, and James Russell Lowell, along with publisher J. T. Fields—are finishing America’s first translation of The Divine Comedy and preparing to unveil Dante’s remarkable visions to the New World. The powerful Boston Brahmins at Harvard College are fighting to keep Dante in obscurity, believing that the infiltration of foreign superstitions into American minds will prove as corrupting as the immigrants arriving at Boston Harbor.\r\n\r\nThe members of the Dante Club fight to keep a sacred literary cause alive, but their plans fall apart when a series of murders erupts through Boston and Cambridge. Only this small group of scholars realizes that the gruesome killings are modeled on the descriptions of Hell’s punishments from Dante’s Inferno. With the lives of the Boston elite and Dante’s literary future in America at stake, the Dante Club members must find the killer before the authorities discover their secret.\r\n\r\nDr. Oliver Wendell Holmes and an outcast police officer named Nicholas Rey, the first black member of the Boston police department, must place their careers on the line to end the terror. Together, they discover that the source of the murders lies closer to home than they ever could have imagined.\r\n\r\nThe Dante Club is a magnificent blend of fact and fiction, a brilliantly realized paean to Dante’s continued grip on our imagination, and a captivating thriller that will surprise readers from beginning to end.", "asin": "0812971043", "rank": "245463", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/61Sg266CM9L.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}