{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 162, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "Alan Furst is one of those authors, that when you read him for the first time, you simply have to have all his earlier work, as this reader did four years ago. Like a fine wine, there is no rush to immediately consume all the earlier work, so on this beautiful fall week in the White Mountains of Arizona, I was able to enjoy his 2006 “The Foreign Correspondent”.His espionage novels excel in the tense days of the late 1930s before the world is consumed in war. When reading this historical fiction, the visualization is in black & white and the reader is transported in time, in this case, to Paris, a city that many Furst readers know well.Paris is full of immigrants, and including many Italians who did not want to live under Mussolini. The story centers on Carlo Weisz, a correspondent that no longer can conduct his trade in Italy and he is fortunate to become a foreign correspondent for the Paris bureau of Reuters. He covers the Spanish civil war, as well as the closing days in Berlin just prior to Hitler’s march to conquer Europe, as well as news stories throughout France.Besides his Reuters position, Carlos becomes the editor of Liberazione, an anti-fascist newspaper that is smuggled and distributed in Italy. Mussolini’s secret police, the OVRA, are in Paris conducting their own espionage to learn who is behind that publication, so that it can be stopped. Before long Carlos is involved in a triangle between OVRA, the French Surete, and the British MI6. There is never a dull day and most days certainly contain an element of danger.As in all Alan Furst novels, there is romance between the lead character and a beautiful woman, which always adds a little more sizzle to the story."}, {"review_sentiment": 5.0, "review_text": "Anti-Fascist Italians in prewar France, Hitler resistance, the Spanish Civil War, and the start of WWII.  Mix in some interesting characters, spies, international intrigue, all wrapped in a really good story."}, {"review_sentiment": 3.0, "review_text": "This series is very unbalanced. Some of the books are fantastic while others are dull and hard to get through. As always Furst is a master of description. If anything there is consistency in that in all of the books."}, {"review_sentiment": 4.0, "review_text": "I am a fan of espionage/spy fiction, so I don't understand how I heretofore passed Mr. Furst by(actually, one might think that he would be...first on my list of authors in this genre). Anyway, this was well written, and the characters were pretty engaging and believable. The only shortcoming was that the ending was pretty abrupt, and not entirely satisfying (don't worry Mr Furst; I am the last person who would spoil the ending). I am currently on a project to read all of Mr. Furst's novels, so that, in and of itself, is a recommendation of sorts, no?."}, {"review_sentiment": 5.0, "review_text": "Really enjoyed this book. A good read!"}, {"review_sentiment": 5.0, "review_text": "Very Good Book, Keeps your attention."}, {"review_sentiment": 4.0, "review_text": "Furst is a very readable author and even though his books follow a familiar pattern they all are different enough to make them enjoyable."}, {"review_sentiment": 5.0, "review_text": "Received promptly as advertised.  good read."}, {"review_sentiment": 5.0, "review_text": "If you like reading espionage novels, you will enjoy this book."}, {"review_sentiment": 5.0, "review_text": "Alan Furst is the best American novelist writing today. His capture of character, mood, setting is extraordinary, plus he's a great storyteller. These two books are Furst at his best. Also get 'The Polish Officer.'"}]}, "authors": ["Alan Furst"], "isbn": "0812967976", "longitude": 2.3514992, "periods": ["1900s"], "title": "The Foreign Correspondent (Night Soldiers)", "word_cloud": "author first time simply earlier work year ago fine wine rush immediately earlier work beautiful fall week able espionage novel excel tense day late world consume war read historical fiction visualization black white transported time case city many reader know full immigrant include many want live story center longer trade fortunate become bureau cover spanish civil war well close day prior march conquer well news story position become editor newspaper smuggle distributed secret police conduct espionage learn publication stop long involve triangle never dull day day certainly contain element novel romance lead character beautiful woman always add little sizzle story italian prewar resistance start interest character spy international intrigue wrap really good story series unbalance fantastic others dull hard get always master description anything consistency fan fiction understand heretofore pass actually first author well write character pretty engage believable shortcoming end pretty abrupt entirely satisfy worry last person end currently project novel recommendation sort really enjoy good very good attention readable author even follow familiar pattern different enough make enjoyable receive promptly advertise good read espionage novel enjoy best american novelist write today capture character mood set extraordinary great storyteller best also get polish", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction", "Spanish Civil War"], "summary": "From Alan Furst, whom The New York Times calls “America’s preeminent spy novelist,” comes an epic story of romantic love, love of country, and love of freedom–the story of a secret war fought in elegant hotel bars and first-class railway cars, in the mountains of Spain and the backstreets of Berlin. It is an inspiring, thrilling saga of everyday people forced by their hearts’ passion to fight in the war against tyranny.\r\n\r\nBy 1938, hundreds of Italian intellectuals, lawyers and journalists, university professors and scientists had escaped Mussolini’s fascist government and taken refuge in Paris. There, amid the struggles of émigré life, they founded an Italian resistance, with an underground press that smuggled news and encouragement back to Italy. Fighting fascism with typewriters, they produced 512 clandestine newspapers. The Foreign Correspondent is their story.\r\n\r\nParis, a winter night in 1938: a murder/suicide at a discreet lovers’ hotel. But this is no romantic traged–it is the work of the OVRA, Mussolini’s fascist secret police, and is meant to eliminate the editor of Liberazione, a clandestine émigré newspaper. Carlo Weisz, who has fled from Trieste and secured a job as a foreign correspondent with the Reuters bureau, becomes the new editor. \r\n\r\nWeisz is, at that moment, in Spain, reporting on the last campaign of the Spanish civil war. But as soon as he returns to Paris, he is pursued by the French Sûreté, by agents of the OVRA, and by officers of the British Secret Intelligence Service. In the desperate politics of Europe on the edge of war, a foreign correspondent is a pawn, worth surveillance, or blackmail, or murder. \r\n\r\nThe Foreign Correspondent is the story of Carlo Weisz and a handful of antifascists: the army officer known as “Colonel Ferrara,” who fights for a lost cause in Spain; Arturo Salamone, the shrewd leader of a resistance group in Paris; and Christa von Schirren, the woman who becomes the love of Weisz’s life, herself involved in a doomed resistance underground in Berlin.\r\n\r\nThe Foreign Correspondent is Alan Furst at his absolute best–taut and powerful, enigmatic and romantic, with sharp, seductive writing that takes the reader through darkness and intrigue to a spectacular denouement.\r\n", "asin": "0812967976", "rank": "327355", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51QR1hhxZIL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}