{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 35, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Another Michener classic."}, {"review_sentiment": 4.0, "review_text": "Entertaining."}, {"review_sentiment": 4.0, "review_text": "Some of the stories I really enjoyed others not so much. The good ones were really good though."}, {"review_sentiment": 4.0, "review_text": "This was a interesting read. It's a series of 10 historical accounts about various characters one way or another lived, ruled or would rule on various pacific islands and some of the trouble they got into die to their motives or stubbornness. The stories stretch from the 1700's to the the 1950's and we peek into peoples motives and the world they lived in and reasoning for going to these islands and the trouble it usually ended up getting them into.  We also see some of how The explorers of the 18th and 19th century affected the Native islanders and made those places very difficult to safely visit by later explorers. We see interesting aspects of foolish and lowly human nature that end up creating the circumstances they had to deal with or that ended up causing their demise. I enjoyed reading the book. It wasn't always a 'page turner' though there were some stories I didn't want to put the book down and at least one case I read the entire section in one sitting. Well written and even when you have to put the book down you are not lost when you resume reading."}, {"review_sentiment": 5.0, "review_text": "I thoroughly enjoyed the book. I'm a huge fan of Michener! Well written and lots of different stories in here."}, {"review_sentiment": 5.0, "review_text": "This is a must read for anyone who loves history, adventure and travel.  It is one of my all-time favorite reads about early discovery of the Pacific Islands by European sailors.  it is rich with drama, action and passion."}, {"review_sentiment": 2.0, "review_text": "I read this to learn more about the exploration and adventurers in the South Pacific which I enjoyed, but this isn't James Michener's writing so must be his co-author, A.Grove Day who is not nearly as effective-entertaining. Nonetheless I did learn and stimulate my interest in knowing more and visiting the islands."}, {"review_sentiment": 5.0, "review_text": "Love his books"}, {"review_sentiment": 2.0, "review_text": "Thought this was going to be a sweeping saga (like Hawaii), but instead it’s a series of stand alone stories about South Pacific pirates and rogues from the great ‘sailing ship’ days.The first story was fairly decent, (about piracy aboard a whaling ship) but it seemed to end too soon and too abruptly.  After that, the subsequent stories failed to catch my imagination at all……and I gave up at 40%."}, {"review_sentiment": 5.0, "review_text": "Michener's writing could always make watching grass grow an adventure, so it's no surprise that these pirates and con men make for interesting reading. The characters' fascination with religion, war and conquest seems dated until I look at current headlines, and realize some things never change."}]}, "authors": ["James A. Michener", "A. Grove Day"], "isbn": "0812986865", "longitude": -157.8556764, "periods": ["1700s", "1800s"], "title": "Rascals in Paradise", "word_cloud": "classic entertain story really enjoy others much good one really good interest series historical account various character way live rule various pacific island trouble get die motif stubbornness story stretch peek people motif world live reason go island trouble usually end get also see explorer century affect native islander make place difficult safely visit later explorer see interesting aspect foolish lowly human nature end create circumstance deal end cause demise enjoy read always turner story want put least case entire section sit write even put lose resume read thoroughly enjoy huge fan write lot different story anyone love history adventure travel favorite read early discovery islands european sailor rich drama action passion learn exploration adventurer enjoy write nearly nonetheless learn stimulate interest know visit island go sweeping saga instead series stand alone story pirate rogue great sail ship first story fairly decent piracy whale ship seem end soon abruptly subsequent story fail catch imagination give writing always watch grass grow adventure surprise pirate con men make interesting read character fascination religion war conquest seem date look current headline realize thing never change", "genres": ["History", "Action & Adventure"], "summary": "In a thrilling collection of nonfiction adventure stories, James A. Michener returns to the most dazzling place on Earth: the islands that inspired Tales of the South Pacific. \r\n\r\nCo-written with A. Grove Day, Rascals in Paradise offers portraits of ten scandalous men and women, some infamous and some overlooked, including Sam Comstock, a mutinous sailor whose delusions of grandeur became a nightmare; Will Mariner, a golden-haired youth who used his charm to win over his captors; and William Bligh, the notorious HMS Bounty captain who may not have been the monster history remembers him as. From lifelong buccaneers to lapsed noblemen, in Michener and Day’s capable hands these rogues become the stuff of legend.\r\n \r\n“The best book about those far-scattered islands that has appeared in a long time . . . a portfolio of rare and ruthless personalities that is calculated to make the curliest hair stand straight on end.” The New York Times", "asin": "0812986865", "rank": "353944", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51kGjvI1oqL.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}