{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 406, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Never have I felt so at ease when reading of a post apocalyptic world. Not that it didn’t have its disquieting moments, of course. But a much easier read than, say, Blindness, while still throwing up a lot of interesting hypotheses."}, {"review_sentiment": 4.0, "review_text": "When I finished reading _The Midwich Cuckoos_ four months ago, I did not think I would be picking up another John Wyndham novel any time soon. Not that I did not enjoy that novel; I reviewed it and gave it five stars. I enjoyed Wyndham's narrative style, and was haunted by the notion of a brood of creepy, otherworldly children. I knew, however, that if I were to continue reading Wyndham, the next logical step would be _The Day of the Triffids_, and the premise of this book seemed a bit flat to me. Things changed about a month ago, when a coworker and I were discussing the unresponsiveness that characterized a large percentage of our students. \"Have you seen _Village of the Damned_?\" my coworker asked. I instantly produced my copy of _The Midwich Cuckoos_, which I happened to have in my office. I let her borrow my book, and a week later she gave me a copy of _The Day of the Triffids_. We should read _Chocky_, too, we decided, and maybe _The Kraken Wakes_, and _The Chrysalids_. We became, in a sense, the local John Wyndham Fan Club.Unlike _The Midwich Cuckoos_, _The Day of the Triffids_ has a clearly identifiable protagonist, who also acts as narrator. A biologist, Bill Masen is one of the few people who (by chance, like the couple that avoids disaster at the beginning of _Cuckoos_) is left with his sense of sight in working condition after a \"meteorite shower\" blinds the vast majority of the world's population. Catastrophic enough in itself, the event has an even more challenging consequence: it gives triffids, an opportunistic and fertile species of plant, an advantage over human beings. _The Day of the Triffids_ describes a man's efforts to survive in a world literally gone blind and in which the systems that have sustained humanity no longer have value.The novel falls perfectly into the catastrophe category. It is not difficult to imagine, as one is reading, what the actions described would look like in the form of a movie. In this sense, _The Day of the Triffids_ is much more celluloid-friendly than _The Midwich Cuckoos_. We have a male protagonist, Bill Masen, and his female companion, Josella Playton, who happens to be the famous author of a racy book titled _Sex Is My Adventure_. The circumstances in which the world finds itself are excellent for the typical catastrophe film, in which plot gives way to a series of episodes or encounters which the main characters must survive. This scenario is, to be honest, what put me off when I was considering whether to read more by Wyndham or not. There is, however, much more to _The Day of the Triffids_ than this.Like _Lord of the Flies_, _The Day of the Triffids_ has a philosophical dimension to it. One of the questions the novel asks is, \"What happens when our systems collapse, when our values no longer hold?\" As I read the novel, I was reminded of José Saramago's _Blindness_ (the original title is literally _Essay on Blindness_), which also deals with a world gone blind, literally and figuratively, as blindness can be a metaphor. These novels illustrate the dictum that catastrophes bring out the worst and the best in human beings. To some, life loses all value; others choose to continue fighting no matter what. Putting together _The Day of the Triffids_ and J. G. Ballard's _High-Rise_ (1975), or even Luis Buñuel's film _The Exterminating Angel_ (1962), would be a great exercise in comparison and contrast. Wyndham's novel, furthermore, is not without its moral, and by this I mean a rather explicit, even spelled-out lesson towards the end. I cannot say much about this without spoiling the story; I will merely evoke the name of Godzilla and leave the rest up to you. Are the plants the real enemy?Why not five stars? While I found the beginning and the ending of the novel to be flawless in terms of narrative effectiveness, the middle part seemed a bit slow to me. Also, I cannot help comparing _The Day of the Triffids_ with _The Midwich Cuckoos_, and I feel the latter is superior when it comes to the premise and to the subtext. Both stories deal with fear--of nature in the first case, of children in the second--but the symbolic potential of _Cuckoos_ makes it a much more haunting novel than _Triffids_. I feel one could adapt _Triffids_ to film, and not much would be lost; _Cuckoos_ seems like a more literary work.If you enjoy _The Day of the Triffids_, give _The Midwich Cuckoos_ a chance afterwards, no matter how you feel about the former. If you're looking for a place to start with Wyndham, I suggest you start with _Cuckoos_.My next Wyndham will be _Chocky_.Thanks for reading, and enjoy the book!"}, {"review_sentiment": 5.0, "review_text": "exceptional treatment of a particularly interesting subset of the catastrophic collapse. thorough examination of thought processes & reactions, both positive, negative, & counterproductive. there were times when the reactions seemed forced, but it soon was clear it was the difference in culture over 65 years. very thoughtful & enjoyable."}, {"review_sentiment": 5.0, "review_text": "So this book was quite fascinating.Given its age as well as the author being from 1950s England, it was rather difficult to get into this book at first.I had to keep mentally translating what exactly was being conveyed, but once I had the particulars sorted out, things picked up and it became a fascinating read.Not wanting to spoil much, I found the overall plot intriguing and able to evade predictability fairly easily. One point I did find fascinating was a reference to 19th century Mormon theology, which I was surprised a British author in the 1950s would have even been aware of details surrounding the historical controversies of an obscure American religion.Overall, this book was quite interesting and if you enjoy a solid apocalyptic epic, this read will be right up your alley."}, {"review_sentiment": 4.0, "review_text": "This story haunted my thoughts from the first time I read it in my teens. It shaped how I think a good futurist story is best written. The terrible events that unfold are told in quiet, even polite prose, which to this day I find the best way to convey horror. Over the top language or (in movies) images just don't do the job the same way. To this day I look at certain plants (The Western Australian Grass Tree in particular) and think, \"triffid.\""}, {"review_sentiment": 5.0, "review_text": "Great story, for an older story line very hard to put down."}, {"review_sentiment": 4.0, "review_text": "Reading The Day of the Triffids was very much like watching an old science fiction movie (like from the 50's and maybe early 60's). The actual story was good...no fear of the \"monsters\" but the blindness aspect struck a bit of fear. The thought of wandering around with others..all stumbling and blind...that was scary. Men and women played their respective roles as dictated by the times--that was funny or irritating depending on how you wanted to look at it.All in all, this 1950's classic book is worth the read. Either that, or sit down and watch The Green Slime, The Blob or even the old War of The Worlds movie! All are pretty much the same whether you read or watch.It was fun, but I won't search for book 2. :-)"}, {"review_sentiment": 4.0, "review_text": "I read this book years ago and enjoyed it just as much now as I did then.  Am now reading the sequel and even though it is by another author, it is just as good."}, {"review_sentiment": 5.0, "review_text": "The Day of the Triffids gives you very realistic and big scale picture of a social catastrophy. In the same time you looking on the situation by eyes of a real people, different people, good and bad, and a good and a bad people simultaneously. You will see variety of tactics and strategies of saving civilization or at least what left after it. Some time you will read the book as practical guidance for surviving in extreme situation and other time it will turn to mostly love story. Just start reading and you will not able to stop."}, {"review_sentiment": 5.0, "review_text": "After reading the reviews. I ordered a used copy in the original format. Great story."}]}, "authors": ["John Wyndham"], "isbn": "0812967127", "longitude": -0.12574, "periods": ["1900s"], "title": "The Day of the Triffids", "word_cloud": "never felt ease reading post apocalyptic world not disquiet moment course much easier say still throw lot interesting hypothesis finish read month think pick time soon not enjoy review give star enjoy narrative style haunt notion brood creepy otherworldly child know however continue read next logical step seemed bit flat thing change month coworker discuss unresponsiveness characterize large percentage student have see coworker ask instantly produce copy happen office let week later give copy decide maybe become sense local clearly identifiable protagonist also act narrator biologist people chance couple avoids disaster begin leave sense sight work condition shower blind vast majority world population enough event even challenge consequence give opportunistic fertile specie plant advantage human being describe man effort survive world literally go blind system sustain humanity longer fall perfectly catastrophe category difficult imagine reading action describe form movie sense much male protagonist female companion happen famous author racy title circumstance world find excellent typical catastrophe film plot give way series episodes encounter main character scenario honest put consider however much philosophical dimension question ask happen system collapse value longer hold remind original title literally also deal world go blind literally figuratively blindness metaphor novel illustrate dictum catastrophe bring worst best human being life loses value others choose fight matter put together even film great exercise comparison contrast furthermore moral mean rather explicit even lesson towards end say much spoil story merely evoke name leave rest are plant real enemy star find begin end flawless term narrative effectiveness middle part seem bit slow also help compare feel latter superior come premise subtext story deal fear nature first case child second symbolic potential make much haunt feel film much seem literary enjoy chance afterwards matter former look place start suggest start next reading enjoy exceptional treatment particularly interesting subset catastrophic collapse examination thought process reaction positive negative counterproductive time reaction seem forced soon clear difference culture year thoughtful enjoyable so quite age well author rather difficult mentally translate exactly convey particulars sorted thing pick become fascinate want spoil much find overall plot intrigue able evade predictability fairly easily point find fascinating reference century theology surprise british author even detail surround historical controversy obscure american quite interesting enjoy solid apocalyptic epic right alley story haunt thought first time teens shape think good futurist story best write terrible event unfold tell quiet even polite prose find best way convey horror top language movie image job way look certain plant particular think trifled story older story line hard put read much watch old science fiction movie maybe early actual story good fear monster blindness aspect struck bit fear thought wander stumble scary woman play respective role dictate time funny irritate depend wanted look classic worth sit watch green even old movie pretty much fun year ago enjoy much be read sequel even author good give realistic big scale picture social catastrophe time look situation eye real people different people good bad good bad people simultaneously see variety tactic strategy save civilization least leave time practical guidance survive extreme situation time mostly love story start read able stop read review order use copy original format story", "genres": ["Fiction & Literature", "Science Fiction"], "summary": "In 1951 John Wyndham published his novel The Day of the Triffids to moderate acclaim. Fifty-two years later, this horrifying story is a science fiction classic, touted by The Times (London) as having “all the reality of a vividly realized nightmare.”\r\n\r\nBill Masen, bandages over his wounded eyes, misses the most spectacular meteorite shower England has ever seen. Removing his bandages the next morning, he finds masses of sightless people wandering the city. He soon meets Josella, another lucky person who has retained her sight, and together they leave the city, aware that the safe, familiar world they knew a mere twenty-four hours before is gone forever.\r\n\r\nBut to survive in this post-apocalyptic world, one must survive the Triffids, strange plants that years before began appearing all over the world. The Triffids can grow to over seven feet tall, pull their roots from the ground to walk, and kill a man with one quick lash of their poisonous stingers. With society in shambles, they are now poised to prey on humankind. Wyndham chillingly anticipates bio-warfare and mass destruction, fifty years before their realization, in this prescient account of Cold War paranoia.", "asin": "0812967127", "rank": "100603", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/514UfL000NL.jpg", "country": "England", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}