{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 287, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "You can tell that the author put a lot of reasearch and thought into every chapter. An enjoyable read that takes you on a scenic holiday in France."}, {"review_sentiment": 5.0, "review_text": "I thoroughly enjoyed reading this book. I love historical novels and this one was filled with love, pain, atrocities of the war and healing. A truly enjoyable read."}, {"review_sentiment": 2.0, "review_text": "Pages loose and cut unevenly - readable."}, {"review_sentiment": 5.0, "review_text": "A lovele story, filled with enough historic facts to put the reader in the proper time frame."}, {"review_sentiment": 5.0, "review_text": "One of the best novels taking place in France during occupation of the Nazis.  Beautifully written, no blatant sex or bad language.  Why can't all books be written this way?  Takes a young Parisian woman who marries and follows her husband to a small town in Provence to care for his sick grandfather who's dying--well, not quite, but alive enough to start recounting his encounters with famous painters and how he acquired a number of their paintings.  One learns their background, how to \"read\" post-Impressionist paintings.  What the Parisian girl must adapt to in the countryside without the Parisian \"conveniences\" she was used to.  An absolute gem of a novel!"}, {"review_sentiment": 4.0, "review_text": "I really enjoyed this book."}, {"review_sentiment": 5.0, "review_text": "Susan Vreeland continues to delight and instruct with Lizette's List. For any Francophile or French art lover this novel provides suspense , intrigue mixed with a magical love story set in a real life Provençal  village, Roussillon. As testimony to Vreeland's writing prowess, descriptions of the Impressionist paintings capture the reader's attention and imagination !"}, {"review_sentiment": 5.0, "review_text": "Having been to this beautiful location added a great deal of pleasure for me, but even if you have never seen this lovely part of France.  I found this a very engaging story of how important community can be when love and loss is part of all of our lives."}, {"review_sentiment": 1.0, "review_text": "The most intriguing ever! ESPECIALLY SPECIAL if you are an artist, it is a MUST....set in ROUSILLION FRANCE it is the story of the villigers extracting the very pure pigments that mixed with oil became oil paints...THAT IS WHAT THE MASTERS USED"}, {"review_sentiment": 5.0, "review_text": "It didn't hurt that I visited Roussillon, France earlier this year (the setting of this book)  It made it easy for me to visualize the story. I also love the study of the art and artists of this time period so the book was satisfying on all kinds of levels.  It was a story and heroine that I still think about even though I finished reading it several weeks ago."}]}, "authors": ["Susan Vreeland"], "isbn": "0812980190", "longitude": 2.3514992, "periods": ["1900s", "Recent Releases"], "title": "Lisette's List", "word_cloud": "tell author put lot research think chapter enjoyable take scenic holiday thoroughly enjoy read love historical novel fill love pain atrocity war heal truly enjoyable page loose cut unevenly readable lovely story fill enough historic fact put proper time frame best novel take place occupation write blatant sex bad language write way young woman marries follow husband small town care sick grandfather die well quite alive enough start recount encounter famous painter acquire number painting learn background painting parisian girl countryside parisian convenience use absolute gem really enjoy continue delight instruct art provide suspense intrigue mixed magical love story set real life village testimony write prowess description impressionist painting capture attention imagination have beautiful location add great deal pleasure even never see lovely part find engage story important community love loss part life intriguing ever artist story villager extract pure pigment mixed oil become oil paint be hurt visit earlier year set make easy visualize story also love study artist time period satisfy kind level story heroine still think even finish read several week ago", "genres": ["Fiction & Literature", "Art & Architecture", "Historical Fiction", "WWII"], "summary": "From Susan Vreeland, bestselling author of such acclaimed novels as Girl in Hyacinth Blue, Luncheon of the Boating Party, and Clara and Mr. Tiffany, comes a richly imagined story of a woman’s awakening in the south of Vichy France—to the power of art, to the beauty of provincial life, and to love in the midst of war.\r\n \r\nIn 1937, young Lisette Roux and her husband, André, move from Paris to a village in Provence to care for André’s grandfather Pascal. Lisette regrets having to give up her dream of becoming a gallery apprentice and longs for the comforts and sophistication of Paris. But as she soon discovers, the hilltop town is rich with unexpected pleasures.\r\n \r\nPascal once worked in the nearby ochre mines and later became a pigment salesman and frame maker; while selling his pigments in Paris, he befriended Pissarro and Cézanne, some of whose paintings he received in trade for his frames. Pascal begins to tutor Lisette in both art and life, allowing her to see his small collection of paintings and the Provençal landscape itself in a new light. Inspired by Pascal’s advice to “Do the important things first,” Lisette begins a list of vows to herself (#4. Learn what makes a painting great). When war breaks out, André goes off to the front, but not before hiding Pascal’s paintings to keep them from the Nazis’ reach.\r\n \r\nWith German forces spreading across Europe, the sudden fall of Paris, and the rise of Vichy France, Lisette sets out to locate the paintings (#11. Find the paintings in my lifetime). Her search takes her through the stunning French countryside, where she befriends Marc and Bella Chagall, who are in hiding before their flight to America, and acquaints her with the land, her neighbors, and even herself in ways she never dreamed possible. Through joy and tragedy, occupation and liberation, small acts of kindness and great acts of courage, Lisette learns to forgive the past, to live robustly, and to love again.\r\n \r\n“Vreeland’s love of painters and painting, her meticulous research and pitch-perfect descriptive talents . . . are abundantly evident in her new novel.” The Washington Post", "asin": "0812980190", "rank": "68437", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/519uh0jW5oL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}