{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 495, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "Still reading... The jury is out."}, {"review_sentiment": 5.0, "review_text": "I really loved this book. It took me a bit to piece together what was happening but it all came together amazingly. I really enjoy the way that this author writes. It’s a book I will probably read again."}, {"review_sentiment": 5.0, "review_text": "Delightfully different novel full of fantasy and satire. Too bad Iran doesn't appreciate this work of art.Read it on a plane!"}, {"review_sentiment": 2.0, "review_text": "This book is completely pointless. I will give it two stars only because Rushdie does have a way with words - his sentences flow and are light and lyrical and even at times humorous. It is written in a very humorous tone, but all the effort went into style with little thought to characterization and no thought to plot. If you like characters who develop goat heads, think they are angels, and just all around wander about without purpose, then this is the book for you. For me, it was a waste of time. I don't know why any author would waste his time writing such a trite book that runs to 547 pages. I rarely don't finish a book but I wish I had given up on this one rather than waste my time all the way to the end."}, {"review_sentiment": 4.0, "review_text": "The novel was readable.  I can't say that it was a page turner but I finished reading it.  I'm the type that will put down a book and not finish, if it cannot grab me withing the first few pages and this one did.  I cannot see how this book earned the author a fatwah against his life but that's the problem with dictatorships, they are very scared of the written word."}, {"review_sentiment": 5.0, "review_text": "Like it or not, the satanic verses in the Koran did exist.  It was only after reflection that Mohammed and his advisors realised that these could not be the word of God and must be from Satan and they were redacted.This novel is a farcical entanglement of historical legend and modern psychology.  I’m glad I returned to it after all these years to enjoy an exceptionally good read."}, {"review_sentiment": 4.0, "review_text": "Fascinating"}, {"review_sentiment": 5.0, "review_text": "Great read"}, {"review_sentiment": 4.0, "review_text": "Not a lot of novelists have the balls to start a book with a suicide bomber causing a plane crash, or transform its main characters into angels and devils, or have a whole subplot about Muhammad the prophet, or playfully describe dongs, breasts, or women eating butterflies. No one can say Rushdie lacks in imagination.It is a masterfully constructed novel that tackles questions of identity on the individual, community, and cosmic scale -- and still doesn't quite fire off on all cylinders. There is a lot to love (Rushdie's penchant for magic realism, comedy, narrative parallels, and irony are all present), but it's weighed down by too much of a muchness. I was never bored, but the connections between the million dazzling subplots and ideas didn't cohere as cleanly as I was hoping either. It is a thick, enriching ambitious world that doesn't quite fill the reader's stomach.There is also a number of similarities to The Master and Margarita that I refuse to believe are accidental -- and the similarities are good! I just think, unlike Bulgakov, Rushdie got a bit too caught up in his own navel-gazing allegories to really let his freak flag fly as gloriously as the first half of the book promised.If you love magic realism and/or Rushdie, it's great. But it's a narrative that also requires patience and faith that there's something there worth mulling over--which is incredibly appropriate for a book where the main characters might be incarnations of Gibreel and Shaitan."}, {"review_sentiment": 5.0, "review_text": "I am reading this for the third time.  It is one of my favorite books.  Mr. Rushdie obviously has a brilliant, quick intellect.  This book is comprised of several stories, mostly centering on the experiences of a man who is elevated to the status of an angel, the other demoted to the status of a devil.  Even though this book has a large imaginative and intellectual scope, there are some scenes of such tenderness and pathos that lead me to believe that Mr. Rushdie is a most compassionate soul.  However, even though I have read it several times, I am still unable to determine if Mr. Rushdie had any theme in mind or if he was just spewing out his brilliant mind.  The book starts with the two protagonists falling through the sky after the plane they were riding was hijacked and bombed by a terrorist.  For what seems forever, Mr. Rushdie creates the sensation of falling, falling, falling.  This book is a tour de force of writing.Actually, there are two possible themes that are coming to mind.  First is the pain of not belonging which is shown clearly by the lives of South Asian and black immigrants in London; and very poignantly by a character in India who earns his living as a clown.  He was born a lower caste Hindu and to escape the pain of it converted to Islam, but he isn't even accepted in that world either.  His only true companion is his pet bull who he dresses up and uses in his clown acts.  The other possible theme could be the paradox of good and evil existing side by side.  Gibreel Farishta's lover's father, a Holocaust survivor, says, \"'...the most dangerous of all the lies we are fed in our lives,' which was in his opinion, the idea of the continuum.  'Anybody ever tries to tell you how this most beautiful and most evil of planets is somehow homogenous, composed only of reconcilable elements, that it all adds up, you get on the phone to the straightjacket tailor...'\"Yes, there is a destructive Mahound and imam who either themselves or whose helpers torture and gorge on innocent people, but that is a fact of life.  I read several reviews in which the writers were claiming that Rushdie was being spiteful in writing this book, but even though I believe he knew exactly what were going to be the results of publishing it, I doubt he meant spite.  An artist reacts intellectually and emotionally to the world around them, gets ideas, thoughts, tastes, and a writer is compelled to write them.  However, I am waiting for someone to write a novel about a writer with only one successful book behind him, whose sales are diminishing, who makes an arrangement with a notorious religious despot that he will write a disparaging expose and the despot will put a fatwa on his head, thereby ensuring fame and fortune for them both by the sheer magnitude of the ensuring notoriety."}]}, "authors": ["Salman Rushdie"], "isbn": "0812976711", "longitude": -0.12574, "periods": ["1900s"], "title": "The Satanic Verses: A Novel", "word_cloud": "still read jury really love take bit piece together happen come together amazingly really way author write probably delightfully different full fantasy satire bad appreciate work plane completely pointless give star way word sentence flow light lyrical even time humorous write humorous tone effort go style little thought characterization think plot character develop goat head think angel wander purpose waste time know author time write trite run page rarely finish wish give rather waste time way end readable page turner finish read type put finish grab withing first page see earned author fatwa life problem dictatorship scar write word verse exist reflection adviser realize word farcical entanglement historical legend modern psychology glad return year enjoy exceptionally good fascinate great not lot novelist ball start suicide bomber cause plane crash transform main character angel devil whole subplot prophet playfully describe dong breast woman eat butterfly say lack masterfully construct tackle question identity individual community cosmic scale still quite fire cylinder lot love penchant magic realism comedy narrative parallel irony present weigh much muteness never bore connection dazzle subplots idea cohere cleanly hop thick enrich ambitious world quite fill also number similarities refuse believe accidental similarity good think get bit caught allegory really freak flag fly gloriously first half magic realism great narrative also require patience faith something worth mull incredibly appropriate main character read third time favorite obviously brilliant quick intellect comprise several story mostly center experience man elevate status angel demote status devil even large imaginative intellectual scope scene tenderness pathos lead believe compassionate soul however even several time still unable determine theme mind spew brilliant mind start protagonist fall sky plane rid hijack bombed terrorist seem forever create sensation fall fall fall tour force possible theme come mind pain belong show clearly live asian black immigrant poignantly character earn live lower caste escape pain convert even accept world true companion pet bull dress use clown act possible theme good evil exist side side father survivor say dangerous lie feed live opinion idea continuum ever try tell beautiful evil planet somehow homogeneous compose reconcilable element add get phone straitjacket tailor destructive imam helper torture gorge innocent people fact life several review writer claim spiteful write even believe exactly go result publish doubt meant artist react intellectually emotionally world get idea thought taste writer compel write however wait someone write writer successful sale diminish make arrangement notorious religious despot write disparage expose despot put fatwa head thereby ensure fame fortune sheer magnitude ensure notoriety", "genres": ["Fiction & Literature"], "summary": "Inextricably linked with the fatwa called against its author in the wake of the novel's publication, The Satanic Verses is, beyond that, a rich showcase for Salman Rushdie's comic sensibilities, cultural observations, and unparalleled mastery of language. The tale of an Indian film star and a Bombay expatriate, Rushdie's masterpiece was deservedly honored with the Whitbread Prize.\r\n\r\nThe story begins with a bang: the terrorist bombing of a London-bound jet in midflight. Two Indian actors of opposing sensibilities fall to earth, transformed into living symbols of what is angelic and evil. This is just the initial act in a magnificent odyssey that seamlessly merges the actual with the imagined. A book whose importance is eclipsed only by its quality, The Satanic Verses is a key work of our times.", "asin": "0812976711", "rank": "20285", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51-X4jiQjWL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}