{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 107, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Helped me pass my CSET! Great book of California's interesting history."}, {"review_sentiment": 5.0, "review_text": "Super interesting book on California"}, {"review_sentiment": 3.0, "review_text": "This book has a lot of comprehensive information about California history but as others have mentioned it is extremely dry.  Reading this book has exhausted me and I'm generally a very good reader of what others consider to be dull materials.  Along with the helpful information I feel that the author includes too many irrelevant details and asides about historical figures that he only mentions once.  All in all though it is a nice over view I would prefer a more in-depth analysis of each topic.  I feel like too much is glossed over so nothing really creates much of a lasting impression.  This book has throughly irritated me if I'm being honest."}, {"review_sentiment": 5.0, "review_text": "Kevin Starr is the go-to on anything about California! His writing is wonderful never dry alway entertaining!"}, {"review_sentiment": 5.0, "review_text": "Nice condition, seems that it will supplement my study of California history quite nicely!"}, {"review_sentiment": 5.0, "review_text": "A+"}, {"review_sentiment": 5.0, "review_text": "Bought it for school. Much cheaper than new and it was in great condition"}, {"review_sentiment": 5.0, "review_text": "As a native Californian, raised there when schools still taught history, I enjoyed the book, and learned a lot."}, {"review_sentiment": 5.0, "review_text": "Outstanding very readable history of California. I really enjoyed it and I learned a great deal. I give it a huge thumbs up!"}, {"review_sentiment": 5.0, "review_text": "Worked for the class!"}]}, "authors": ["Kevin Starr"], "isbn": "081297753X", "longitude": -118.244476, "periods": ["1900s", "2000s", "Recent Releases"], "title": "California: A History", "word_cloud": "pas interest interesting lot comprehensive information others mention extremely dry exhaust generally good others consider dull material helpful information feel author include many irrelevant detail asides historical figure mention nice view analysis topic feel much gloss nothing really create much last impression thoroughly irritated honest anything write wonderful never dry away entertain nice condition seem supplement study quite nicely school cheaper new great condition native raise school still teach enjoy learn lot outstanding readable really enjoy learn great deal give huge thumb work class", "genres": ["History"], "summary": "California has always been our Shangri-la–the promised land of countless pilgrims in search of the American Dream. Now the Golden State’s premier historian, Kevin Starr, distills the entire sweep of California’s history into one splendid volume. From the age of exploration to the age of Arnold, this is the story of a place at once quintessentially American and utterly unique.\r\n\r\nArguing that America’s most populous state has always been blessed with both spectacular natural beauty and astonishing human diversity, Starr unfolds a rapid-fire epic of discovery, innovation, catastrophe, and triumph.\r\n\r\nFor generations, California’s native peoples basked in the abundance of a climate and topography eminently suited to human habitation. By the time the Spanish arrived in the early sixteenth century, there were scores of autonomous tribes were thriving in the region. Though conquest was rapid, nearly two centuries passed before Spain exerted control over upper California through the chain of missions that stand to this day.\r\n\r\nThe discovery of gold in January 1848 changed everything. With population increasing exponentially as get-rich-quick dreamers converged from all over the world, California reinvented itself overnight. Starr deftly traces the successive waves of innovation and calamity that have broken over the state since then–the incredible wealth of the Big Four railroad tycoons and the devastating San Francisco earthquake of 1906; the emergence of Hollywood as the world’s entertainment capital and of Silicon Valley as the center of high-tech research and development; the heroic irrigation and transportation projects that have altered the face of the region; the role of labor, both organized and migrant, in key industries from agriculture to aerospace.\r\n\r\nKevin Starr has devoted his career to the history of his beloved state, but he has never lost his sense of wonder over California’s sheer abundance and peerless variety. This one-volume distillation of a lifetime’s work gathers together everything that is most important, most fascinating, and most revealing about our greatest state.", "asin": "081297753X", "rank": "51752", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/41LIWQkxJ8L.jpg", "country": "United States of America", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}