{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 203, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "good story, much different from previous Michener books."}, {"review_sentiment": 4.0, "review_text": "I love James Michener's writing and am going to Spain in spring so wanted some insight into Spanish culture.  First, the book was written in 1968 during Franco's last year's as dictator so some of Michener's views are now dated.  Starting in the most remote, under-populated portion of Spain put me off from reading the rest of the book.  But several weeks later, I picked it up and tried again and found his deep knowledge of the culture, people, food and life of Spain to be fascinating (once he got past Extremadura).  I have read a few current guidebooks and a history of Spain, but this was by far, the book that gave me a real sense of Spain and what I should look for when we travel there.  There is a wonderful chapter on Barcelona and Catalonia which gave me a deeper understanding of the current situation between Catalonia and Madrid.  I would have given it 5 stars except for that awful first chapter and the last chapter that was all about bullfighting, the bulls, the matadors ad nauseum.  If you're into bullfighting, this is the chapter for you, otherwise just skip over it like I did."}, {"review_sentiment": 5.0, "review_text": "I can think of no other country which has been so well served by anglophone commentators.  I found this book readable and penetrating, worthy to be retained on a bookshelf beside Brenan and other great Hispanists.  This is the first book of Michener's which demonstrated to me how physically intrepid and intellectually voracious Michener was---and what a work ethic!Michener didn't pull his punches describing Spanish culture and history.  He wrote (I quote from memory), \"In no country in Europe, save possibly Roumania or Hungary, did the nobility have less of a sense of noblesse oblige.\"  Intellectuals tend to pussyfoot around discussing fatal flaws in national cultures; it is refreshing to read in plain English how flaws in national character can screw a potentially great country into a cocked hat, and dog a society century after century, right into the modern era."}, {"review_sentiment": 5.0, "review_text": "you definitely get a insightful cultural perspective from Michener, even though some things may be a bit dated. His love for the place is obvious."}, {"review_sentiment": 5.0, "review_text": "The original publication of Iberia was 1968 and I read it then as I was a fan of Michener.  I enjoyed it then but even more so the second time I read it in 2017 as I had just come back from a trip to Spain and Portugal.  Iberia is a travel diary by Michener who was a very curious traveler and found many interesting people to chat with and many interesting places to visit while in Spain. I recommend it to anyone who has a particular interest in or is traveling to Spain."}, {"review_sentiment": 2.0, "review_text": "This is not one of Michener's fictitious 'Grand histories' but a very detailed account of his many travels around Spain, the places he visited and the people he met. For anyone planning to live in Spain this could be useful (although of course it is now out of date) and for visitors it gives a depth of detail regarding the cities and buildings that is hard to match, but as a good read, I found it overly detailed  and insufficiently engaging."}, {"review_sentiment": 2.0, "review_text": "A low rating?  Don't get me wrong I love Spain, however, Michener delves into way too much detail for someone wishing a good story or character development.  That's it!"}, {"review_sentiment": 4.0, "review_text": "This book is almost entirely about Spain despite its title so if you are interested in Portugal (which only gets a passing mention) don't bother. Like Michener's novels, it's a massive doorstopper crammed with information and knowledge about Spain's history, culture, landscape and architecture – perhaps too much at times – along with personal opinions and comments.It is by no means a travel guide but is an ideal companion if you are planning a trip around Spain. For stay-at-home readers, it is a book for dipping into at random or reading one chapter and setting aside for a while rather than swallowing as a whole. It was first published around 1966 when Franco was still in charge and Spain was a very different place from today. However, change was coming about even then and the country was also very different from the one Michener knew when he was a young man."}, {"review_sentiment": 4.0, "review_text": "A very interesting book. This is not a standard Michener historic novel. It is a book about his perceptions and experiences in Spain. It is not an easy book to read but it contains a vast amount of information all very well presented. It is an excellent book to read before one visits the country."}, {"review_sentiment": 1.0, "review_text": "I was very disappointed in this book.  I should have read the description more carefully.  It is written about James M's visits to Spain.  There was no character development, no characters to develop except himself."}]}, "authors": ["James A. Michener"], "isbn": "0812969804", "longitude": 2.1774322, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s"], "title": "Iberia", "word_cloud": "good story much different previous kitchener love write go spring want insight spanish culture write last year dictator view date start remote portion put read rest several week later pick try found deep knowledge culture people food life fascinating get past current guidebook history far give real sense look wonderful chapter give deeper understanding current situation give star awful first chapter last chapter bullfighting bull matador ad nausea bullfighting chapter otherwise skip think country well serve anglophone commentator find readable penetrate worthy retain bookshelf beside great hispanics first demonstrate physically intrepid intellectually voracious work ethic pull punch describe spanish culture history write quote memory country save possibly nobility le sense noblesse oblige tend pussyfoot discuss fatal flaw national culture refresh plain flaw national character screw potentially great country cock dog society century century right modern era definitely insightful cultural perspective even thing dated love place obvious original publication fan enjoy even second time come back trip travel diary curious traveler find many interesting people chat many interesting place visit recommend anyone particular interest travel fictitious history detail account many travel place visit people meet anyone planning live course date visitor give depth detail regard city building hard match good find overly detail insufficiently engage low rating wrong love however delve way much detail someone wish good story character development almost entirely title interested get pass mention bother novel massive door stopper cram information knowledge history culture landscape architecture perhaps much time personal opinion mean travel guide ideal companion planning trip around reader dip random read chapter set rather swallow first publish still charge different place today however change come even country also different know young man interesting standard historic perceptions experience easy contain vast amount information well present excellent visit country disappoint description carefully write visit character development character develop", "genres": ["History", "Travel Writing"], "summary": "Spain is an immemorial land like no other, one that James A. Michener, the Pulitzer Prize–winning author and celebrated citizen of the world, came to love as his own. Iberia is Michener’s enduring nonfiction tribute to his cherished second home. In the fresh and vivid prose that is his trademark, he not only reveals the celebrated history of bullfighters and warrior kings, painters and processions, cathedrals and olive orchards, he also shares the intimate, often hidden country he came to know, where the congeniality of living souls is thrust against the dark weight of history. Wild, contradictory, passionately beautiful, this is Spain as experienced by a master writer.\r\n \r\n“From the glories of the Prado to the loneliest stone villages, here is Spain, castle of old dreams and new realities.”—The New York Times", "asin": "0812969804", "rank": "43093", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51HCYdUnccL.jpg", "country": "Spain", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}