{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 38.7077926, "ratings": {"num_ratings": 214, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "You have probably  never read a book like this.Marvel has created characters that are very unique. That what kept me reading what was coming next. Give it a try. It's a wild ride!!"}, {"review_sentiment": 5.0, "review_text": "This was an incredible story of three intertwining generations of love, loss, and finding footing in bizarre, but creative ways. I have more to think about now that I have finished. Can’t wait to meet with my book club."}, {"review_sentiment": 5.0, "review_text": "Fantastic book. Quite possibly better even than Life of Pi, something that I hitherto thought impossible."}, {"review_sentiment": 5.0, "review_text": "What a magnificent piece of work! Crafted into three brilliantly interlinked - yet completely separate stories, it is largely a poignant and unexpectedly moving exploration of grief. Its pace is slow at the outset - almost ponderous, and for a while one is not too sure where the story is headed. But the first tale becomes exponentially more interesting before closing with a wonderful twist, while gifting the reader with another vital element connecting the three stories. One is almost disappointed when the second one starts off in such a completely removed setting from the first, but that feeling quickly evaporates in one of the most fascinating discourses on Jesus of Nazareth (and Agatha Christie) I have ever read, followed not too long after that by a revelation on the second protagonist's source of grief, as well as some of the most exquisite grief and loss analogies, issued from the lips of yet another mourner. The final story then - once again completely removed from the other two (yet strangely linked) throws the reader into a third tale of unusual pace and trajectory, providing considerable thought-provoking material on time and life in general, almost in parallel with the grief theme - rather than purely in its context. The book maintains a simple, entirely accessible feel throughout, and despite the constant theme, is never really mournful - rather respectful and brave, while reminding the reader of the genre, with random but very colourful insertions of magical realism. A masterfully crafted and surprising book, which I've found almost more enjoyable in retrospect, as much of its imagery has intruded on my thoughts quite regularly in the weeks post-(reluctant) completion! I'd consider it a must-read."}, {"review_sentiment": 5.0, "review_text": "This is a text which one needs to read carefully and to be patient.  It is almost like reading Conrad's LORD JIM; where the first fifty pages make for tough and tedious reading, but afterwards, the novel flows.  With patience, one begins to see the connections which pull the three novellas together, and the final story is brilliant in all of its emphasis on faith, for without it, the novel would make little impact.  If you are an impatient reader, then this work is not for you, but the final piece brings the whole experience together in sort of a \"time warp.\"  Martel's diction is terrific if one appreciates the English language."}, {"review_sentiment": 5.0, "review_text": "This is three novellas which all relate to one another in somewhat obscure ways.  There are lots of twists and turns in the stories.  So well written and so interesting.  We read it for our book group and had it made for an interesting discussion."}, {"review_sentiment": 1.0, "review_text": "CERTAINLY NOT WHAT I EXPECTED - don't know how this ever got published???????Maybe what some editors may cosider  CREATIVE , ARTISTIC.  save you money!"}, {"review_sentiment": 2.0, "review_text": "Read it for book club. None of us really understood it. I thought his language was lovely in places but not sure I would have noticed it without such a great reader on the CD. That kept me listening."}, {"review_sentiment": 4.0, "review_text": "I still remember when Yann Martel’s Life of Pi was the rage among my British friends, after it won the Booker Prize in 2002. I purchased it, and still have not read it. Instead, I was intrigued by the title, and subject matter of this novel, and it has thus become my first Martel read.“Empires” have been around for a long time, commencing when humankind developed agricultural settlements in Mesopotamia, Africa, India, China, and no doubt other places. A minority of individuals economically, physically and usually legally dominating a majority, often of a different tribe or race. Starting in the late 15th Century, most of the European powers – later to be joined by the United States – developed substantial empires that were an integral part of their national existence – until they weren’t. As a European power, the Portuguese got into the empire game early, and were one of the last to leave, in the 1970’s, which was portrayed with varying degrees of success in Antonio Antunes’ The Return of the Caravels.  I know less about the Portuguese empire than most of the rest. It seemed that they did the least towards physically and mentally improving the lives of the natives; yet they also seemed to be one of the least overtly racist.Martel’s novel spans the centuries, and connects the colonies, the mother country, and the Portuguese diaspora. It is set in three major parts. The novel commences in Lisbon, December 1904. Menino Tomas has lost his father, his wife and his child in one week. The latter two died due to diphtheria. His wife was 24. As a result of his grief, he now walks backwards. Tomas holds a government job, working in a museum. From the museum he swipes the diary of Father Ulisses, who worked in Luanda (Angola) in 1631. He would later move to San Tome. He would become disillusioned with the colonial project, and disgusted with slavery. He would fall out of favor with the church hierarchy. Per the diary, he carved a crucifix, that apparently made its way to a church in the high mountains of Portugal. As the author points out, they really aren’t much in the way of mountains – more like a high, rather infertile plateau.Tomas’ rich uncle, Martim, who made his fortune in the African trade, gives him a new Renault motorcar, by which he is to travel to the high mountains in search of the crucifix, which must be at one of five churches. Of course, he must learn how to drive the car first, which comes with a crank starter. The expedition takes a couple of weeks, finding fuel is a major concern, as this motorcar is often the first one most villagers have seen.The second part is set in 1938 and involves a pathologist Eusebio Lorora. Naturally there are ties to the characters of the high mountains from the 1904 section. There is also a heavy dose of what is dubbed “magic realism” that did not seem to contribute to the novel’s success. The third part commences in 1981, in Canada, with an émigré from the high mountains who “made good”: he is a member of Parliament. He decides to chuck it all, and with a gorilla that he rescues from an animal center in Oklahoma, returns to the same village where the crucifix is, which happens to be his birthplace.No question, Yann Martel writes very well, and illuminates various places in history, as well as aspects of life, like early motorcars in remote regions, and gorillas. However, the novel simply did not cohere sufficient, seemed out of focus, with parts seemingly irrelevant, as he chased some topics of “political correctness” involving our on-going relationships with the animal “kingdom.” Thus, overall, 4-stars."}, {"review_sentiment": 2.0, "review_text": "Interesting book, but a bit too far fetched, disjointed, and lacking in character development to keep me feeling invested throughout."}]}, "authors": ["Yann Martel"], "isbn": "0812987039", "longitude": -9.1365061, "periods": ["1900s", "2000s", "Recent Releases"], "title": "The High Mountains of Portugal: A Novel", "word_cloud": "probably never create character unique keep read come next try wild incredible story intertwine generation love loss find foot bizarre creative way think finish meet club possibly better even something hitherto think impossible magnificent piece work brilliantly interlink yet completely separate story largely poignant unexpectedly move exploration grief pace slow outset almost ponderous sure story head first tale become exponentially interesting closing wonderful twist gift vital element connect story almost disappointed second start completely remove set first feel quickly evaporate fascinating discourse ever follow long revelation second protagonist source grief well exquisite grief loss analogy issue lip yet mourner final story completely remove yet strangely link throw third tale unusual pace trajectory provide considerable material time life general almost parallel grief theme rather purely maintains simple entirely accessible feel constant theme never really mournful rather respectful brave remind genre random colorful insertion magical realism masterfully craft surprising find almost enjoyable retrospect much imagery intrude thought quite regularly week reluctant completion consider text need carefully almost read first fifty page make tough tedious reading afterwards flow patience begin connection together final story brilliant emphasis faith little impact impatient work final piece brings whole experience together sort time warp diction terrific appreciate english language novella relate somewhat obscure way lot twist turn story so well write interest group make interesting discussion expect know ever get publish maybe editor money read club really understand think language lovely place sure great cd keep listen still rage british friend purchase still instead intrigue title subject matter thus become first long time commence humankind develop agricultural settlement doubt place minority individual economically physically usually legally dominate majority often different tribe race start late power later join develop substantial empire integral part national existence european power get empire game early last leave portray vary degree success attune know le portuguese empire rest seem least towards physically mentally improve life native yet also seem least overtly span century connect colony mother country diaspora set major part commences lose father wife child week latter die due wife result grief walk backwards hold government job work museum museum swipe diary work later disillusioned colonial project disgust slavery favor church hierarchy diary carve crucifix apparently make way church author point really much way rather infertile rich uncle make fortune african trade give new motorcar travel search crucifix church course drive car first come crank starter expedition take couple week find fuel major concern motorcar often first villager second part set involve pathologist tie character section also heavy dose dub magic realism seem contribute success third part commence make good member decide chuck gorilla rescue animal center return village crucifix happen question write well illuminate various place history well aspects life early motorcar remote region gorillas however simply cohere sufficient seem focus part seemingly irrelevant chased topic political correctness involve relationship animal overall interest bit far fetch disjointed lacking character development feeling invest", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "NEW YORK TIMES BESTSELLER \r\n\r\nIn Lisbon in 1904, a young man named Tomás discovers an old journal. It hints at the existence of an extraordinary artifact that—if he can find it—would redefine history. Traveling in one of Europe’s earliest automobiles, he sets out in search of this strange treasure.\r\n\r\nThirty-five years later, a Portuguese pathologist devoted to the murder mysteries of Agatha Christie finds himself at the center of a mystery of his own and drawn into the consequences of Tomás’s quest.\r\n\r\nFifty years on, a Canadian senator takes refuge in his ancestral village in northern Portugal, grieving the loss of his beloved wife. But he arrives with an unusual companion: a chimpanzee. And there the century-old quest will come to an unexpected conclusion.\r\n\r\nThe High Mountains of Portugal—part quest, part ghost story, part contemporary fable—offers a haunting exploration of great love and great loss. Filled with tenderness, humor, and endless surprise, it takes the reader on a road trip through Portugal in the last century—and through the human soul.\r\n\r\n“Charming . . . Most Martellian is the boundless capacity for parable. . . . Martel knows his strengths: passages about the chimpanzee and his owner brim irresistibly with affection and attentiveness.”The New Yorker", "asin": "0812987039", "rank": "128373", "city": "Lisbon", "image": "https://images-na.ssl-images-amazon.com/images/I/51X1WR1fjfL.jpg", "country": "Portugal", "story_arc": ["Tragedy", "Things only get worse"]}