{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 31.2253441, "ratings": {"num_ratings": 101, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "It hooked me at first, yet I started loosing interest as I went along. Yet, I recognize, it is well crafted and written."}, {"review_sentiment": 4.0, "review_text": "I really enjoyed the insights this book gave me into the the lives and thoughts of young people in China.  The characters are rich and poor with interesting back stories, and their interactions give the book, and society as a whole, life.  Progress is disruptive and Five Star Billionaire gives us an idea of how some of the people affected by progress might act, and why.  Sometimes I almost wanted to reach in to the book and give the characters a shake and change their self destructive patterns, but of course, I was as unable as they were to effect their own lives in a positive way.The book is an entertaining read.  I recommend it."}, {"review_sentiment": 3.0, "review_text": "I found \"Five-Star Billionaire\" difficult to read.  I felt that the writing style was necessary for the tome of the book, but often found it stilted.  The characters were well-developed, with considerable backstory in some cases.  The ending was both predictable and disappointing.  Loose ends were tied up to some extent, but I felt that the author was just done because even though what occurred to one of the characters was predictable, it wasn't explained.  Essentially, while it become quite clear that one of the characters had a vendetta against another character, the 'revenge' was taken upon a third character."}, {"review_sentiment": 4.0, "review_text": "This was quite an enjoyable read and a pretty read for a book around 400 pages. The story of five people making their way (or trying to) in Shanghai and each being connected either directly or tangentially was engaging.Phoebe was most interesting to me as she was an illegal-immigrant working and seeking a better life than the one she left behind in Malaysia. I often didn't like the way she went about attaining her goals but I also had enough empathy for her that her life beforehand had not afforded her better tools to work with. She didn't seem to have much of a moral center but there's never enough of her past given to let the reader understand her better. Still, she was most interesting to follow. I rooted for her to do well and cringed when things would go wrong for her. I also hoped for good things for her roommate, Yanyan. She was quite a sympathetic character in that while we don't witness it, it seems Shanghai life has beaten the ambition out of her and given her a case of depression and agoraphobia.Yinghui was also an engaging character. Her present as a successful business woman who has moments of worry that she's lost her chance for love was captivating and well balanced with the recounting of her past as a modern girl of privilege and daughter of seemingly a corrupt civil servant. Her life is split in two at a particular point and is one of the best threads of the book. She, is arguably one of two central characters here. She and the Five Star Billionaire are more than any others central to this story and connected in simple and then surprise ways. I loved that even when it hurt to read those reveals.I was drawn more to the female characters than the male though there was nothing lacking in the male points of view here. Gary, the fallen from grace, pop star was endearing and made me hope for him to have a big win and be less lonely at the close of the story. While I found Justin sympathetic and was glad that he seemed to have found some sort of peace after his breakdown, I felt disconnected from everything that had to do with his feelings for Yinghui. It was so one sided and abstract that I just couldn't get it. I wanted him to find happiness with Yanyan. And finally, there's Walter. He was interesting but I still don't know entirely what made him tick. His backstory and present are well laid out but he still felt remote and perhaps that is the point of the character as his elusive nature keeps him isolated from others which seems to attract others even though it presents a certain danger. He didn't surprise me but I had hoped I was wrong or something deeper would be revealed by book's end.Finally, here's to Shanghai! I loved how immersed I was in this book and reading about life in a big, cut-throat city that makes New York look like a school yard. I loved that to these characters making it big had nothing to do with going to the West. I loved that stars loomed large and not a one were from the West. The descriptions of the taste of the city and all the sounds and smells were so vivid. I also love that this reminded me that I've two books by Kevin Kwan on my TBR list and really want to get to those. Now that I've read about the hard scrabble life in Shanghai I want to look in on the other half. Definitely recommended."}, {"review_sentiment": 4.0, "review_text": "This is a most unusual book. At first, I felt disconnected and had a hard time knowing which character was who. Then, as I got into the plot? I began to try my hand at forecasting what was going to happen.I didn't do so well. Aw did a MUCH better job of interconnecting stories than I could have."}, {"review_sentiment": 5.0, "review_text": "Insightful read. Love, hopes, growth, ambition, laziness, and futures rended nil, but surprising maturity and acceptance of selves  and reach."}, {"review_sentiment": 3.0, "review_text": "Personally, I am not a fan of this novel's organization, flippping as it does from one character to another to another...making one wonder where it's all going.  I finished it though, so it was okay.  Unlikely to read another by this author."}, {"review_sentiment": 4.0, "review_text": "Tash Aw is Malaysian, and writes beautiful English prose. This book is about several characters, who once lived in Malaysia, but are all now doing various things in Shanghai, China. In a lot of ways, it's a book about contemporary Shanghai. It's a great read, but I found the ending of the book lacking with a lot of unresolved issues for each of the characters."}, {"review_sentiment": 3.0, "review_text": "I first saw this book at Blenheim Palace the birthplace of Winston Churchil and thought that it if it was read there it must be good. However.......the story teller created so many characters with Chinese names that it is almost impossible to remember each and every one. Only if you read it without interuptions you may remember who is who in the last chapters. And that is also the disadvantage of an e-book; it is not easy to go back a chapter or so to check who is who.On top of all this, the story has no real end. And sometimes the deliberations are too long.Do I recommend.....? Yes if you are from Malaysia or China may be, otherwise only for those who are interested in those parts of the world."}, {"review_sentiment": 3.0, "review_text": "I imagine most Western readers' knowledge of Shanghai stems from writers like  J. G. Ballard and  Kazuo Ishiguro who wrote about the city when it was still under foreign domination and the native Chinese were virtually ignored.This novel is a good opportunity to see modern Shanghai from a Chinese point of view although the five main characters are ethnic Chinese from Malaysia or from a different region of China who feel as lost in the megapolis as any foreigner. The author himself is from Taiwan and was raised in Malaysia.The book gets off to a good start as these migrants jostle for success in this challenging environment against millions of others in a similar plight. The characters are linked by their connection with the billionaire in the title but the kaleidoscopic plot makes the story complicated. There is a lot of overlap and I got confused over the characters at times as some situations repeat them. For example, two of the men have nervous breakdowns and lock themselves up in apartments for long periods. The women characters are actually more credible than the men.It is the kind of book that needs to be read quickly rather than in a leisurely way, in my view."}]}, "authors": ["Tash Aw"], "isbn": "0812984811", "longitude": 121.4888922, "periods": ["2000s", "Recent Releases"], "title": "Five Star Billionaire: A Novel", "word_cloud": "hook first yet start loose interest go recognize well craft write really enjoy insight give life thought young people character rich poor interest story interaction give society whole life disruptive give idea people affect progress almost want reach give character shake change destructive pattern course unable effect live positive entertain recommend find difficult felt write style necessary tome often find stilted character considerable backstory case end predictable disappointing end tie extent felt author do even occur character predictable explain essentially become quite clear character vendetta character take third character quite enjoyable pretty page story people make way try connect directly tangentially interest work seek better life leave often like way go attain goal also enough empathy life beforehand afford better tool work seem much moral center never enough past give let better still interest follow root well cringe thing wrong also hop good thing roommate quite sympathetic character witness seem life beaten ambition give case depression also engage character present successful business woman moment worry lose chance love captivate well balance recount past modern girl privilege daughter seemingly corrupt civil servant life split particular point best thread arguably central character others central story connect simple surprise way love even hurt draw female character male nothing lack male point view fall grace pop endear make hope big win le lonely close story find sympathetic glad seem found sort peace breakdown felt disconnect everything feeling yinghui side abstract want find happiness finally interest still know entirely make backstory present well lay still felt remote perhaps point character elusive nature keep isolate others seem attract others even present certain danger surprise hop wrong something deeper love immersed read life big city make look school yard love character make big nothing go love star loom large description taste city sound smell vivid also love remind list really want get now hard scrabble life want look half recommend unusual first felt disconnect hard time know character then get plot begin try hand forecast go well aw better job interconnect story insightful hop growth ambition laziness future redden nil surprising maturity acceptance self reach personally fan organization flip character make wonder go finish okay author write beautiful prose several character live various thing lot way contemporary great find end lack lot unresolved issue character first saw birthplace think however story teller create many character chinese name almost impossible remember only interruption last chapter also easy back chapter check top story real end sometimes deliberation recommend yes otherwise interested part world imagine western reader knowledge stem writer write city still foreign domination native virtually good opportunity see modern point view main character ethnic chinese different region feel lose megalopolis foreigner author raise get good start migrant jostle success challenge environment million others similar plight character link connection billionaire title kaleidoscopic plot make story complicate lot get confused character time situation repeat example men nervous breakdown lock apartment long period woman character actually credible kind need quickly rather leisurely way view", "genres": ["Fiction & Literature"], "summary": "An expansive, eye-opening novel that captures the vibrancy of China today.\r\n \r\nPhoebe is a factory girl who has come to Shanghai with the promise of a job—but when she arrives she discovers that the job doesn’t exist. Gary is a country boy turned pop star who is spinning out of control. Justin is in Shanghai to expand his family’s real estate empire, only to find that he might not be up to the task. He has long harbored a crush on Yinghui, a poetry-loving, left-wing activist who has reinvented herself as a successful Shanghai businesswoman. Yinghui is about to make a deal with the shadowy Walter Chao, the five star billionaire of the novel, who with his secrets and his schemes has a hand in the lives of each of the characters. All bring their dreams and hopes to Shanghai, the shining symbol of the New China, which, like the novel’s characters, is constantly in flux and which plays its own fateful role in the lives of its inhabitants.\r\n \r\nFive Star Billionaire is a dazzling, kaleidoscopic novel that offers rare insight into the booming world of Shanghai, a city of elusive identities and ever-changing skylines, of grand ambitions and outsize dreams. Bursting with energy, contradictions, and the promise of possibility, Tash Aw’s remarkable new book is both poignant and comic, exotic and familiar, cutting-edge and classic, suspenseful and yet beautifully unhurried.\r\n\r\nPraise for Five Star Billionaire\r\n \r\n“Estimable . . . artful . . . Mr. Aw is a patient writer, and an elegant one. His supple yet unshowy prose can resemble Kazuo Ishiguro’s. . . . He’s a writer to watch.” The New York Times \r\n \r\n“The ambition of the book perfectly reflects its subject. In one scene, we’re introduced to a ‘folk guitarist whose slangy lyrics spoke of urban migration and loneliness.’ Aw might be describing himself, except that his threnodies are set to sophisticated modern jazz.” Pico Iyer, Time", "asin": "0812984811", "rank": "725721", "city": "Shanghai", "image": "https://images-na.ssl-images-amazon.com/images/I/510l6lyDqaL.jpg", "country": "China", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}