{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 185, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Great read."}, {"review_sentiment": 5.0, "review_text": "Confirms what I always expected about the history of the church."}, {"review_sentiment": 5.0, "review_text": "A great book about the papal history."}, {"review_sentiment": 4.0, "review_text": "A good read. There is even a discussion on the ephemeral Pope Joan. Overall a balanced view of the long line of popes; the good, the bad, the mediocre, and a great here and there."}, {"review_sentiment": 4.0, "review_text": "I am glad I hung on through the early years, it was a long bumpy ride but very interesting! Well written considering he had two thousand years worth of material."}, {"review_sentiment": 4.0, "review_text": "This is a fair and balanced presentation of Catholicism, as a religion, through the history of papacy.The presentation starts with Peter being ‘martyred’ by the Roman authorities (for disturbing the Emperor’s peace) and ends with the reign of Pope Benedict XVI (ex Cardinal Joseph Ratzinger).By and large, the book details the horrors that the Roman Church visited upon humanity for 17 long centuries – from the Wars of Conquest, initiated under the auspices of the Popes, to the ‘Holy Inquisition’, the  religious apparatus designed specifically to torture and murder (by burning alive) all those that were considered enemies of the Church (read “Jews”).It is interesting to note that Pope Benedict XVI resigned his position for reasons unknown and unconfessed, reasons that Joseph Ratzinger (ex member of ‘Hitler Youth Organization’) will most certainly take to his grave.The book is often too detailed for the average reader but it reveals the currently ‘incorrect truth’ about the most perverse and devious religion ever invented by humans."}, {"review_sentiment": 3.0, "review_text": "In his introduction, the author states that he's a storyteller, not a scholar. That comes through quickly in the book because there are factual errors. It's an interesting read, but don't believe everything you read here. And don't use it for research on the papacy or Christian  history!"}, {"review_sentiment": 5.0, "review_text": "Factual, very well researched and interesting."}, {"review_sentiment": 4.0, "review_text": "This one moves fast through two thousand years of history. Decades sometime get shortened to a sentence; lives, to a paragraph. But for all that, it might be your best bet for a one volume history of ALL the popes (excluding the current one)."}, {"review_sentiment": 4.0, "review_text": "I understand Mr. Norwich is entitled to his biases, but that is the only complaint I have about the book. His history of the Papacy is informative, at times fascinating, and always readable. I recommend it."}]}, "authors": ["John Julius Norwich"], "isbn": "0812978846", "longitude": 12.4829321, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases", "1500s", "500-1400s", "0-500s"], "title": "Absolute Monarchs: A History of the Papacy", "word_cloud": "great confirms always expect church great papal good even discussion ephemeral balance view long line pope good bad mediocre great glad hang early year long bumpy ride interest write consider year worth material fair balance presentation religion presentation start martyr authority disturb peace end reign large detail horror visit humanity long century initiate auspex religious apparatus design specifically torture murder burn alive consider enemy interest note resign position reason unknown confessed reason ex member certainly take often detailed average reveals currently incorrect truth perverse devious religion ever invent human introduction author state storyteller scholar come quickly factual error interest everything research well research interest move fast year sometime shortened sentence life paragraph best volume popes exclude current understand entitle bias complaint informative time fascinate always readable recommend", "genres": ["History", "Religion", "Ancient Rome"], "summary": "A New York Times bestseller.\r\n \r\nIn a chronicle that captures nearly two thousand years of inspiration and intrigue, John Julius Norwich recounts in riveting detail the histories of the most significant popes and what they meant politically, culturally, and socially to Rome and to the world. \r\n\r\nNorwich presents such popes as Innocent I, who in the fifth century successfully negotiated with Alaric the Goth, an invader civil authorities could not defeat; Leo I, who two decades later tamed (and perhaps paid off) Attila the Hun; the infamous “pornocracy”—the five libertines who were descendants or lovers of Marozia, debauched daughter of one of Rome’s most powerful families; Pope Paul III, “the greatest pontiff of the sixteenth century,” who reinterpreted the Church’s teaching and discipline; John XXIII, who in five short years starting in 1958 instituted reforms that led to Vatican II; and Benedict XVI, who is coping with today’s global priest sex scandal. \r\n\r\nEpic and compelling, Absolute Monarchs is an enthralling history from “an enchanting and satisfying raconteur” (The Washington Post).", "asin": "0812978846", "rank": "104127", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/518MvRsxOWL.jpg", "country": "Italy", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}