{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 23, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "It's disgraceful the way Laforet's legacy has been treated.  I once spoke with a Professor of Spanish Literature about how remarkable I found the work, and he thought of it fondly but was under the false impression that this was the only thing she wrote.  She wrote a great deal, but Nada is undoubtedly the most widely-read and available of her works.  This is a first novel that shows a depth that even undisputed genius authors like Virginia Woolf or James Joyce didn't achieve with their first works.  It's a combination of a domestic examination and war-time story that also manages to work in elements of the picaresque, though the last one is incorporated in a wonderfully subtle way.  It's certainly fair to call the novel existential, but Laforet's existentialism is even more exponentially experiential and viscerally unique than other staples of this type of philosophy in the form of fiction.  Though like Camus, Sartre and de Beauvoir, it perhaps more closely relates to the philosophies found in Kafka's fiction.  While I want to impart the importance of the novel's cultural critique, it is very easy to see so many influences acknowledged and thoughtfully re-examined.  One such example would be Virginia Woolf's subversive takes of the novel of manners.  There's also many beautiful parallels between Laforet and her contemporary Simone de Beauvoir, primarily sharing the technique of using less abstractly oriented social analyses.  I'm using these cross-cultural references to help frame the novel for those who might not be familiar with war-time Spain (and, perhaps more importantly for understanding the novel, the war's aftermath), which the writer uses to create the sublimely border-line phantasmagorical atmosphere and structure the thematic exploration at work in the narrative.  It's essential to know something about the tensions and alliances forged after the Spanish Civil War.  While the novel can certainly be classified on a number of levels, Laforet most consciously invokes Gothic elements to a genius effect.  She uses the genre's conventions--especially the maddening introspective isolation and almost supernatural impairment of knowledge--to achieve a level of perspectivist realism that strikingly elucidates the horrors of war's aftermath and its tragic disruption of culture, interpersonal relationships, and the individual's understanding of their own identity.  If you're a fan of the war-time horror films of Guillermo del Toro (The Devil's Backbone or Pan's Labyrinth), you should certainly give this novel your full attention.  If you're a fan of, or even just familiar with, Jane Eyre or Wuthering Heights, you'll find Laforet to be a very reverent, 20th century kindred-spirit to the Brontes (Jane Eyre is perhaps the most important artistic influence at work in the book).  With all of this said, the book is a purely singular work of dark beauty that also has an unmistakable level of profundity that will enrich your understanding of literally any of the figures I've mentioned in this review and scores of others."}, {"review_sentiment": 5.0, "review_text": "This is an excellent novel. I didn't read the previously translated version but I recommend this one. It is very well written and I can understand all the critical acclaim."}, {"review_sentiment": 5.0, "review_text": "An exceptional book!! A must read! I have read it twice."}, {"review_sentiment": 3.0, "review_text": "Great condition"}, {"review_sentiment": 5.0, "review_text": ":)"}, {"review_sentiment": 5.0, "review_text": "This product was the best and is highly recommended to be purchased.  Please go out and get it just for a  good read if not for school."}, {"review_sentiment": 5.0, "review_text": "The best book written in Spain during the Franco era. A kind of gothic coming of age story of an 18 year old orphaned young woman who comes to live with her grandmother, uncles and aunts In 1940 Barcelona after the brutal Spanish Civil War. It got by Franco's censors as the author age 24 when she wrote this does not put in any politics related to the war although this war does play a part  in the setting. I read it is Spanish and English. The story is suspenseful, beautifully written, and full of fascinating and strange people."}, {"review_sentiment": 5.0, "review_text": "I read this for my Spanish class and was really enchanted with this edition.  I am now a big fan of Laforet's work and want to read more Spanish literature."}, {"review_sentiment": 5.0, "review_text": "The book came exactly as described/pictured. I needed this book for a class, and it came within the time I needed it by."}, {"review_sentiment": 4.0, "review_text": "Carmen Laforet wrote with a quiet beauty. Not really poetic, just an understated elegance. Even the more dramatic or violent scenes have a quieter feeling than you'd expect. Quite impressive for a woman who was in her early twenties when she wrote this book.The story is said to be somewhat autobiographical. Andrea, aged eighteen, goes to live with her grandmother, aunts, and uncles in Barcelona so she can attend the university. The family lives in greatly reduced circumstances after the Spanish Civil War and the death of the family patriarch. In his intro, Mario Vargas Llosa calls this story a \"detailed autopsy of a girl imprisoned in a hungry, half-crazed family on Calle de Aribau.\" That pretty much sums up the story, although I'd say some of the family members have progressed beyond half-crazed to full-blown madness.There are secrets revealed and high drama closer to the end of the book, but mostly it is about Andrea's attempts to escape from the loony bin she's living in by walking the streets of Barcelona and spending time with her friends from the university.This edition is a new translation by Edith Grossman. I am really falling in love with her translation skills. Some translations have a stilted feeling, but Grossman's just flow so smoothly and beautifully."}]}, "authors": ["Carmen Laforet"], "isbn": "0812975839", "longitude": 2.1774322, "periods": ["1900s"], "title": "Nada: A Novel", "word_cloud": "disgraceful way legacy treat speak spanish remarkable find work thought fondly false impression thing write write great deal undoubtedly available work first show depth even undisputed genius author achieve first work combination domestic examination story also manage work element picaresque last incorporate wonderfully subtle way certainly fair call existential existentialism even exponentially experiential viscerally unique staple type philosophy form fiction perhaps closely relate philosophy find fiction want impart importance cultural critique easy see many influence acknowledge thoughtfully example subversive take manner also many beautiful parallel contemporary primarily share technique use le abstractly orient social analysis use reference help frame familiar perhaps importantly understanding war aftermath writer use create sublimely phantasmagorical atmosphere structure thematic exploration work narrative essential know something tension alliance forge spanish certainly classified number level consciously invoke gothic element genius effect use genre convention especially madden introspective isolation almost supernatural impairment knowledge achieve level perspectivist realism strikingly elucidate horror war tragic disruption culture interpersonal relationship individual understanding identity fan horror film certainly give full attention fan even familiar find reverent century perhaps important artistic influence work say purely singular work dark beauty also unmistakable level profundity enrich understand literally figure mention review score others excellent previously translate version recommend well write understand critical acclaim exceptional twice condition product best highly recommend purchased good school best write era kind gothic come age story year old orphan young woman come live grandmother uncle aunt brutal get censor author age write politics related war war play part set spanish story suspenseful beautifully write full fascinating strange people spanish class really enchanted edition big fan work want spanish literature come exactly need class come time need write quiet beauty not really poetic understated elegance even dramatic violent scene quieter feel impressive woman early twenty write story say somewhat autobiographical age eighteen go live grandmother aunt uncle attend university family live greatly reduce circumstance spanish death family patriarch intro call story detailed autopsy girl imprison hungry family pretty much sum story say family member progress secret reveal high drama closer end mostly attempt escape loony bin live walk street spending time friends edition new translation really fall translation skill translation stilted feel flow smoothly beautifully", "genres": ["Fiction & Literature"], "summary": "One of the most important literary works of post-Civil War Spain, Nada is the semiautobiographical story of an orphaned young woman who leaves her small town to attend university in war-ravaged Barcelona. Edith Grossman’s vital new translation captures Carmen Laforet’s feverish energy, powerful imagery, and subtle humor. Nada is one of the great novels of twentieth-century Europe.\r\n\r\n“Laforet vividly conveys the strangeness of Barcelona in the 1940s, a city that has survived civil war only to find itself muted by Franco’s dictatorship…The spirit of sly resistance that Laforet’s novel expresses, its heroine’s determination to escape provincial poverty and to immerse herself in ‘lights, noises, the entire tide of life,’ has lost none of its power of persuasion.” — The New York Times Book Review", "asin": "0812975839", "rank": "179877", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51TqdjwfH8L.jpg", "country": "Spain", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}