{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 110, "rating": 3.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Made my head hurt at times. Brilliance from cover to cover. Standing O!"}, {"review_sentiment": 1.0, "review_text": "Doctorow had written Ragtime in 1975 and Billy Bathgate in 1989.  He had been showered with awards by 2000 when City of God was published.  Apparently he was so highly regarded as an author by this time that no editor or publisher dared criticise his work, or tell him that he was writing drivel. However, that is what City of God is---it's drivel.Why is it drivel?  It jumps incoherently from character to character and from decade to decade.  One page you're in NYC and the narrator believes his life is being made into a movie.  On the next page he's in jail for some undescribed crime.  On the next page the narrator is a different character in Lithuania during the Holocaust.  The following page you're in WWI--and on and on and on.  It's as if no editor dared question whether this was madness or genious.Well, it's madness.  Never confuse incomprehensible writing and great literature.  Just because the writer is highly regarded, doesn't mean he can't write a poorly organised and incoherent mess.  That's what this is---a mess."}, {"review_sentiment": 5.0, "review_text": "Nothing"}, {"review_sentiment": 1.0, "review_text": "I have read several other Doctorow books and enjoyed them but this is just a mess. I have no idea what he was thinking or why the sadistic love affair was included since it seemingly related to nothing else. What indeed was the purpose of the \"mystery\" of the cross. Other readers who have rated this a one star have said it better than I have but this is a complete waste of time and insult to readers of an otherwise brilliant author. This ranks as one of the worst books I have ever come across."}, {"review_sentiment": 2.0, "review_text": "A book whose total is less than the sum of its parts. The log-rolling reviews from other writers and lazy publishers describe a \"dazzling, virtuoso performance\" that is just logorrhea. The main character, whose caustic wit about the Christian Church we are supposed to admire, or perhaps be challenged by, converts to Judaism because he likes a rabbi. He rants on about the Christian church's sins against the Jews. There are scenes from a Jewish ghetto in WWII. All this has been said better before.His final speech, a rambling indictment of the church on the same subject offered as a prayer at his wedding to the hot rabbi, is ridiculous and in real life would clear a room. His great revelation is that he would believe in God if it satisfied his revenge fantasy against Holocaust perpetrators. Very disappointing book."}, {"review_sentiment": 3.0, "review_text": "I found it somewhat difficult to read.  The story seemed to wander all over the place and it was hard to find the theme of the story.  Had to make myself finish it, so it wasn't what I would call an enjoyable book to read."}, {"review_sentiment": 4.0, "review_text": "A talented visionary takes us on a ride through New York, religion, the big bang, religious atrocities, love, war, and a world of other topics in a book that at times was very difficult to follow. Love the Pem character and the symbolism with the cross at the ending of the story. Love the expansive vocabulary and the lyricality of much of the prose, it almost sings in many places. It was a difficult read because it ran off the rails many times and I can't say in honesty it was an enjoyable one (the camp scenes were overly-long) but I Iiked the novel, if that makes any sense, in the way I \"like\" reading Graham Greene."}, {"review_sentiment": 1.0, "review_text": "I didn't get past page 4."}, {"review_sentiment": 3.0, "review_text": "A really intelligent and well-educated individual with very good writing skills riffs on a wide variety of topics, with the riffs very loosely tied together with a few key characters.  Nothing that can really be called a plot; a few stories (some of them very good) and a lot of philosophizing.Interesting but at the same time tedious and sometimes almost irritating; at times one is tempted to say either \"who cares\" or \"so what\" or maybe both.Worth keeping for some of the riffs, which are good summaries of an intelligent point of view."}, {"review_sentiment": 5.0, "review_text": "Very interesting novel - the city is New York. Fascinating intellectual reflections by the priest examining the nature of the faith while engaged with a host of different characters living in the middle of a drastically changing New York neighborhood."}]}, "authors": ["E.L. Doctorow"], "isbn": "0812985893", "longitude": 0.0, "periods": ["1900s"], "title": "City of God", "word_cloud": "make head hurt time cover cover write shower award publish apparently highly regarded author time editor publisher dare criticism work tell write drivel however drivel jump incoherently character character decade decade page narrator believe life make movie next page jail undescribed crime next page narrator different character following page wwi editor dare question madness madness confuse incomprehensible write great literature writer highly regard mean poorly organize incoherent mess mess nothing several enjoy mess idea think sadistic love affair include seemingly relate nothing else indeed purpose mystery cross other reader rat star say better complete waste time insult reader otherwise brilliant author rank worst ever come total le sum part review writer lazy publisher describe dazzle virtuoso performance logorrhea main character caustic wit suppose admire perhaps challenge convert like rabbi rant christian church sin scene ghetto say better final speech ramble indictment church subject offer prayer wed hot rabbi ridiculous real life room great revelation satisfied revenge fantasy perpetrator very disappointing find somewhat difficult story seem wander place hard find theme story make finish enjoyable talented visionary take religion big bang religious atrocity love war world topic time difficult follow character symbolism cross end story expansive vocabulary typicality much prose almost sings many place difficult run rail many time honesty enjoyable camp scene like make sense way read get past page really intelligent individual good writing skill riff wide variety topic riff loosely tie together key character nothing really call plot story good lot time tedious sometimes almost irritate time tempt say care maybe keep riff good summary intelligent point view very interesting intellectual reflection priest examine nature faith engage host different character live middle drastically change neighborhood", "genres": ["Fiction & Literature", "Religion"], "summary": "With brilliant and audacious strokes, E. L. Doctorow creates a breathtaking collage of memories, events, visions, and provocative thought, all centered on an idea of the modern reality of God. At the heart of this stylistically daring tour de force is a detective story about a cross that vanishes from a rundown Episcopal church in lower Manhattan only to reappear on the roof of an Upper West Side synagogue. Intrigued by the mystery—and by the maverick rector and the young rabbi investigating the strange act of desecration—is a well-known novelist, whose capacious brain is a virtual repository for the ideas and disasters of the age.\r\n \r\nDaringly poised at the junction of the sacred and the profane, filled with the sights and sounds of New York, and encompassing a large cast of vividly drawn characters including theologians, scientists, Holocaust survivors, and war veterans, City of God is a monumental work of spiritual reflection, philosophy, and history by America’s preeminent novelist and chronicler of our time.", "asin": "0812985893", "rank": "679138", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/513V6ogHzCL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}