{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1104, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "I really enjoyed this book. I could not put it down and when I did, I awaited the time that I could pick it up once more. It was a pleasant surprise to enjoy it as much as I did considering I dislike reading stories from the first person point of view. However, the story managed to convince me not to put it down immediately. The only reason that I made it 4/5 is that the ending was rather disappointing and anti-climatic. All in all, an excellent read."}, {"review_sentiment": 4.0, "review_text": "If you’re entertained by the variations of Sherlock Holmes, Miss Marple, Hercules Poirot and tv shows like CSI and Criminal Minds then this is right up your alley.  This book takes you back to the early days of the science of criminology and forensic science with original characters that are true to the historical setting.  There is lots of historical background interwoven into the story that makes it more fascinating but also adds so much detail that it gets a little bogged down at times and slows the momentum of the story.  Still there is enough suspense and mystery to keep you turning pages to the very end."}, {"review_sentiment": 5.0, "review_text": "Great historian, great story teller, great writing. I am missing the 808 gang already, even a non- thriller reader should picks this novel up."}, {"review_sentiment": 5.0, "review_text": "While this was required reading for composition at my college, it was a fun book to read. This is not a book for the faint of heart or those who do not tolerate violence against children or sexual deviance, even in the non-fiction realm. It has graphic aspects. Carr gives a wonderful account of late 19th century New York City and thrills with interesting commentary about the city at that time, and develops a solid story with a friendship woven into a tense investigation. I am looking forward to reading this book again!"}, {"review_sentiment": 4.0, "review_text": "I am not usually a \"novel\" reader, but I must admit that I thoroughly enjoyed this one!!"}, {"review_sentiment": 4.0, "review_text": "A little graphic but keeps you reading."}, {"review_sentiment": 5.0, "review_text": "GREAT BOOK"}, {"review_sentiment": 5.0, "review_text": "Very well written and completely enthralling."}, {"review_sentiment": 5.0, "review_text": "Details that intrigue, characters who are too 21st century familiar, a forensic study before forensics began. Treat yourself. Read it."}, {"review_sentiment": 4.0, "review_text": "Really enjoyed the read, but difficult getting started. Loads of description about people, place and time period given in midst of story narrative."}]}, "authors": ["Caleb Carr"], "isbn": "0812976142", "longitude": 0.0, "periods": ["1800s"], "title": "The Alienist", "word_cloud": "really enjoy await time pleasant surprise enjoy much consider dislike read story first person point view however story manage convince put immediately reason make end rather disappoint excellent entertain variation tv show right alley take back early day science criminology forensic science original character true historical setting lot historical background interwoven story make fascinate also add much detail get little bogged time slow momentum story still enough suspense mystery turning page end historian great story teller great writing miss gang already even thriller pick require reading composition college fun faint heart tolerate violence child sexual deviance even realm graphic aspect give wonderful account late century thrill interesting commentary city time develop solid story friendship weave tense investigation look forward read usually thoroughly enjoy little graphic keep read great very well write completely enthral detail intrigue character century familiar forensic study forensics begin really enjoy difficult get start description people place time period give midst story narrative", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "The year is 1896, the place, New York City. On a cold March night New York Times reporter John Schuyler Moore is summoned to the East River by his friend and former Harvard classmate Dr. Laszlo Kreizler, a psychologist, or \"alienist.\" On the unfinished Williamsburg Bridge, they view the horribly mutilated body of an adolescent boy, a prostitute from one of Manhattan's infamous brothels.\r\n\r\nThe newly appointed police commissioner, Theodore Roosevelt, in a highly unorthodox move, enlists the two men in the murder investigation, counting on the reserved Kreizler's intellect and Moore's knowledge of New York's vast criminal underworld. They are joined by Sara Howard, a brave and determined woman who works as a secretary in the police department. Laboring in secret (for alienists, and the emerging discipline of psychology, are viewed by the public with skepticism at best), the unlikely team embarks on what is a revolutionary effort in criminology-- amassing a psychological profile of the man they're looking for based on the details of his crimes. Their dangerous quest takes them into the tortured past and twisted mind of a murderer who has killed before. and will kill again before the hunt is over.\r\n\r\nFast-paced and gripping, infused with a historian's exactitude, The Alienist conjures up the Gilded Age and its untarnished underside: verminous tenements and opulent mansions, corrupt cops and flamboyant gangsters, shining opera houses and seamy gin mills. Here is a New York during an age when questioning society's belief that all killers are born, not made, could have unexpected and mortal consequences.\r\n", "asin": "0812976142", "rank": "12155", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51xJlrRV5%2BL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}