{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 32, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Been there, but the book goes deeper than what I saw.  a troubled, beautiful island."}, {"review_sentiment": 5.0, "review_text": "This is my second time reading this novel. I ordered this book to replace a stolen copy of the book."}, {"review_sentiment": 5.0, "review_text": "This historical novella truly captures the classist, racist, cultural, and colonial challenges of being a member of one particular Jamaican elite family during a time of upheaval. I could not put it down."}, {"review_sentiment": 3.0, "review_text": "This book follows several characters as they go to Jamaica or grow up on that island during the past 100 years.  Be aware that the story jumps back and forth from the past to the present and back again, over and over.I never got the sense that Jamaica was paradise for anyone.  Scary in parts -- don't read this if you just going to northern or northwestern Jamaica on a vacation.  Kingston and the south coast region is still risky for visitors.  I've been to resorts in northern Jamaica and I'm glad I didn't read this book prior to going."}, {"review_sentiment": 5.0, "review_text": "I have read it3times. I have alsogiven it as a gift. My favorite book ever. If you love Jamaica you will want to read it."}, {"review_sentiment": 5.0, "review_text": "This is a novel you won't want to put down - filled with memorable characters and rich details of Jamaica's recent and past history. I look forward to reading more of this author's work."}, {"review_sentiment": 5.0, "review_text": "Excellent read. I tried to slow down the pace for it to last longer but alas......As a child during that period, I remember the soldiers, tanks, news of killings and sound of gunshots at night and the adults talking about people being killed for wearing wrong color,etc.  but never understood.  This book felt real to me, the description of places, the people, the dialect and it was nostalgic.  However it was also sad and painful to read about the swift change and accompanying violence during that time in such a beautiful place and to read the author's comparison to Khmer Rouge"}, {"review_sentiment": 4.0, "review_text": "I thought this book was very interesting.  I don't know a lot about Jamaica's history, but by building a story around it's history and involving Errol Flynn did make it an interesting read."}, {"review_sentiment": 5.0, "review_text": "A great novel if you are looking for a book about the real people and the real land of Jamaica.  Gives one a better perspective of what it was like to grow up in Jamaica.  It is for those people who want to more about the country and its people than the typical tourist resorts."}, {"review_sentiment": 4.0, "review_text": "\"Lawd what a worl'\" says Monica (318) and after reading about the rampant violence on the island - perhaps instigated by political parties - I have to agree with her.The story is circular. The main plot is interspersed with multiple sub-plots dealing with ancestors of several years/decades ago. There are numerous characters, sometimes making it difficult to remember who everyone is. The characters of Monica and Lana come off the page - they are so real. The diverse racial mixtures, the lingo, the food contribute to the vibrancy of this novel.But I had hoped that in the end true love would prevail and was very disappointed when this didn't happen."}]}, "authors": ["Margaret Cezair-Thompson"], "isbn": "0812979834", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "The True History of Paradise", "word_cloud": "been go deeper saw troubled beautiful island second time read order steal copy historical novella truly capture classiest racist cultural colonial challenge member particular family time upheaval follow several character go grow island year aware story jump back forth past present back never get sense anyone part go northern northwestern vacation south coast region still risky visitor resort northern glad prior go also given favorite ever love want put fill memorable character rich detail recent look forward read author work excellent try slow pace last longer ala child period remember soldier tank news killing sound gunshot night adult talk people kill wear wrong color etc never understand felt real description place people dialect nostalgic however also sad painful swift change accompany violence time beautiful place author comparison think interest know lot build story involve make interest great look real people real land give better perspective grow people want country people typical tourist resort work say reading rampant violence island perhaps instigated political party agree story circular main plot intersperse multiple deal ancestor several ago numerous character sometimes make difficult everyone character come page real diverse racial mixture lingo food contribute vibrancy hop love disappointed happen", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "It is 1981. Jean Landing secretly plans to flee her beloved Jamaica–the only home her family has ever known, a place now rife with political turmoil. But before she can make her final preparations, she receives devastating news: Lana, her sister, is dead. The country’s state of emergency leaves no time to arrange a proper funeral. Even Jean’s mother, Monica, who hadn’t spoken to Lana in more than a decade, cannot fully embrace her grief. \r\n\r\nThe tragedy only underscores Jean’s need to leave an island that holds no promise of a future. Her harrowing journey to freedom across a battered landscape takes Jean through a terrain of memories: of her childhood, with a detached mother at odds with an adoring father, of her complex bond with Lana, and of the friends and lovers who have shaped and shared her days. Epic in scope, The True History of Paradise poignantly portrays the complexities of family and racial identity in a troubled Eden.", "asin": "0812979834", "rank": "1443424", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/51cxw4ku9uL.jpg", "country": "", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}