{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 65, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "As advertised and on time."}, {"review_sentiment": 5.0, "review_text": "Comparing the setting to the Wikipedia entry for Doctorow, I believe this charming story of a sweet Bronx childhood is clearly, largely autobiographical.  He describes tenderly his loving relationships with a much older brother, his ADD father, and his adaptable mother.  There are vivid descriptions of Depression-era reality, but including the thoughtful, pre-boom layout of his New York borough and the way you could get practically everywhere easily on public transit."}, {"review_sentiment": 2.0, "review_text": "This book is a slice of life in the Bronx in the 30s. There isn't a real through-plot, just different events that happen to the protagonist. It's not until about 70% into the book that the World's Fair becomes a remote part of the story and later still when it touches the characters in the story directly. Not what I imagined it would be, but the writing is deft."}, {"review_sentiment": 2.0, "review_text": "It's not nearly as good a read as it was years ago........"}, {"review_sentiment": 5.0, "review_text": "Edgar, a young boy, tells of his struggles and triumphs growing up during the time of the World's Fair in New York City. I shall miss this author's writing."}, {"review_sentiment": 4.0, "review_text": "Emjoyed the book.  I grew on in New Jersey and traveld back and forth to New York so the setting was very familiar.  I was dissapointed when it ended- I wanted to follow  Edgar and his family and their reactions when the US entered the War.Well written, really get to know the chacters and how and why they relate to each other.  Would recommend this book.This is my third book written by Doctrow,  RagTime and the March.  Favorite is Rag Time."}, {"review_sentiment": 5.0, "review_text": "The late E.L. Doctorow's (1931 -- 2015) novel \"World's Fair (1985) is a lyrical autobiographical story about growing up in the New York City during the Depression.  Most of the book is told in the first person by an adult, \"Edgar\" Altschuler, who reflects upon his childhood up to the age of nine. The adult writer has also approached family members for their reminisces, and some chapters of the book are in the words of the boy's mother, Rose, brother, Donald, father, Dave, and his Aunt Frances.A beauty of this novel is the way in which it captures the innocence and feelings of early childhood in simple language but with an adult's sensibility and nostalgia. The story has the feel of authenticity even while it is told in a detached way from a distance of years.In its simplicity, the story covers a broad scope. Edgar is a youngster of four at the outset of the book, with a brother eight years older.  We see the closeness of the brothers together with their relationship to their parents, Dave, a free-spirited unsuccessful businessman and his restless, piano-playing, long-suffering wife Rose. The family is second-generation American descended from Russian Jews. The story also explores family on both the father's and the mother's side, including an aged, troubled grandmother, and relations who have made it further on the American economic ladder than Edgar's immediate family.Besides showing acculturation to American life, the novel is full of the sights of 1930's  New York City with its pushcarts, small shops, crowded streets and apartments, liveliness, and unpredictability. The writer and the young boy have sharp eyes and memories. The story also integrates the highly personal, individualized experience of growing up with the menacing events of the day. The rise of Hitler and the impending WW II are never far from consciousness. The book discusses the Depression and the socialism that appealed to many of the narrator's relatives at the time.  There is a portrayal of the Hindenburg flying over the city en route to its disaster.  And of course there is the World's Fair of 1939, described with relish in the latter portions of the book.Although the boy is only nine, the World's Fair shows him a glimpse of the future and takes Edgar out from insularity. He first attends the fair with a young girlfriend and her single mother, who is a bit risqué as compared to Edgar's other acquaintances. Near the end of the boy's first visit to the World's Fair, the narrator describes how he had felt as a child: \"I had worried before, all the time in this enormous effort to catch up to life, to find it, to feel it, comprehend it; but all I had to do was be in it and it would instruct me and give me everything I needed.  As I fell asleep the fireworks went off over and over again like me pounding my own chest and sending my voice to the heavens that I was here.\"In another section of the book, the boy's Aunt Frances discusses her marriage to Ephraim, a highly successful lawyer who has become a political conservative. \"Ephraim and I had a wonderful marriage.  We never argued.  He was a conservative Republican, a member of the Liberty League.  He knew I felt differently.  I voted for Norman Thomas one year and simply didn't tell him and he didn't ask.  He trusted me to handle all the household accounts and make the domestic decisions while he attended to his law practice.  The system worked beautifully.\"Something may be learned here in our own troubled times.In a review published after Doctorow's death, Tom Cox described \"World's Fair\" as \"an overlooked classic of American literature.\"  Cox wrotethat the book created a voice that \"is wise, comforting, open-eyed with wonder and authentic all at the same time\".  Even though it won the National Book Award in 1986, \"World's Fair\" has not received the attention accorded to some of Doctorow's other works.  It is an outstanding eloquent novel which deserves the description of \"overlooked classic\".Robin Friedman"}, {"review_sentiment": 5.0, "review_text": "Great book! As a New Yorker I kept stopping to Google places that were mentioned that are no longer here or have changed greatly—the Bronx as a \"new neighborhood\" in the 1930s, the Hippodrome, the Polo Grounds, Bungalow Bar trucks. Great story, great characters—very enjoyable."}, {"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 3.0, "review_text": "I thought it was well written  but until the part about the worlds  fair it wasn't very interesting"}]}, "authors": ["E.L. Doctorow"], "isbn": "081297820X", "longitude": 0.0, "periods": ["1900s"], "title": "World's Fair", "word_cloud": "advertised time compare set entry believe charm story sweet childhood clearly largely autobiographical describe tenderly loving relationship much older brother father adaptable mother vivid description reality include thoughtful layout borough way practically everywhere easily public transit slice life real different event happen protagonist become remote part story later still touch character story directly not imagine write nearly good year ago young boy tell struggle grow time author write grow travel back forth setting familiar dissapointed want follow family reaction enter write really know chanter relate third write late lyrical autobiographical story grow tell first person adult reflect childhood age adult writer also approach family member reminisce chapter word boy mother brother father beauty way capture innocence feeling early childhood simple language adult sensibility story feel authenticity even tell detach way distance simplicity story cover broad scope youngster outset brother year see closeness brother together relationship parent unsuccessful businessman restless wife family descend russian story also explore family father mother side include age troubled grandmother relation make american economic ladder immediate show acculturation american life full sight pushcarts small shop crowd street apartment liveliness writer young boy sharp eye memory story also integrate highly personal individualized experience grow menace event day rise impend never far consciousness discus socialism appeal many narrator relative time portrayal fly city route disaster course describe relish latter portion boy show glimpse future take insularity first attend young girlfriend single mother bit risque compare acquaintance end boy first visit narrator describe felt child worry time enormous effort catch life find feel comprehend everything need fell asleep firework go pound chest send voice heaven section boy discuss marriage highly successful lawyer become political conservative ephraim wonderful marriage never argue conservative republican member know felt differently vote year simply trust handle household account make domestic decision attend law practice system work beautifully something troubled review publish death describe overlook classic american literature create voice wise comfort wonder authentic time even receive attention accord work outstanding eloquent deserve description overlook classic keep stop place mention longer change new neighborhood truck story great enjoyable excellent think well write part world interest", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "\"Something close to magic.\" The Los Angeles Times\r\n\r\nThe astonishing novel of a young boy's life in the New York City of the 1930s, a stunning recreation of the sights, sounds, aromas and emotions of a time when the streets were safe, families stuck together through thick and thin, and all the promises of a generation culminate in a single great World's Fair . . .", "asin": "081297820X", "rank": "838125", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51bYZbA0TwL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}