{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 142, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Roger Crowley is a consistently great storyteller."}, {"review_sentiment": 5.0, "review_text": "I've recently become fascinated with the City of Venice.  This book was written in an accessible way and covered the history of Venice very well.  I thoroughly enjoyed it."}, {"review_sentiment": 5.0, "review_text": "This is full of interesting details about Venice and everything connected to it, starting right at the beginning and paying special attention to the parts you most want to hear about,  like their role in the Fourth Crusade. The audio is good, too."}, {"review_sentiment": 5.0, "review_text": "Having visited the spectacular city of Venice several times, it has been on my list to read a history of the Stati del Mare for some time.  Roger Crowley’s “City of Fortune: How Venice Ruled the Seas” fit the bill perfectly for this read.  While the book does not cover the breadth of Venetian history (for example, only touching on the mythical roots of the origins of the city built upon sand flats in a lagoon), it covers the most important period of time which formed Venice into the fantastical city we find today.  Beginning with the Venetian attack upon Constantinople in 1204 and ending with the finality of the Ottoman-Venetian war in 1503, the book covers the amazing rise of this city built upon trade, and ends with its sad decline, succumbed to forces from the east and west.  Venice truly was a city built upon trade and commerce; however, it is worth noting from the book how such city-states inevitably fall prey to the same tides of war as any other nation.  As such, Venice built a powerful navy, and used it to great effect to secure their navigational rites of the sea.  Another thing that the book did a great job of describing was how the influence of Venice in the Easter Mediterranean, along with its famous and frequent wars with Genoa, played a significant role in the fall of the Byzantine Empire, and the rise of the Ottomans.  It also describes in detail the challenges Venice faced in maintaining its many colonies spread throughout the Mediterranean Sea; a challenge many other European nations would discover for themselves in the years ahead.  Overall, this was a wonderful and engaging read.  For any person interested in the Stati del Mare, this book is highly recommended."}, {"review_sentiment": 5.0, "review_text": "This book cleared up quite a few mysteries about Venice.  There are frequent descriptions from original sources by contemporary chroniclers that bring the tumultuous history of Venice to life. I did not expect this book to be a page-turner but for me it was.The writing is clear and concise. I've been to Venice several times but this last visit was immeasurably enhanced by the visceral and dramatic knowledge contained herein. You'll never feel quite as casual strolling around  Piazza San Marco, or shopping on the Rialto bridge after reading this book.Kudos to the author."}, {"review_sentiment": 5.0, "review_text": "Wonderful narrative of how Venice ruled the seas and were modern merchants way ahead of the rest of the world. Written with great detail and understanding of the Venician mentality."}, {"review_sentiment": 5.0, "review_text": "This was a fascinating and highly readable story of the history of Venice. There is plenty of detail but not so much that you are overwhelmed and lose interest.  The author is a good storyteller and I gained some excellent insights about the city."}, {"review_sentiment": 5.0, "review_text": "excellent"}, {"review_sentiment": 4.0, "review_text": "Fascinating journey through a period of time I previously knew little about, but was extremely important in European / Mediterranean history. Hard to quit reading. Good pace and storytelling."}, {"review_sentiment": 5.0, "review_text": "I echo many comments already written:  I had NO IDEA about much of Venice's history.  How it ruled the oceans.  The rivalry with Genoa.  The back-and-forth with the Pope.  The long connection to Constantinople and the Black Sea.  The fascination with/ importance of Egypt.  And how the opportunity to make money outweighed everything else - including getting paid to ferry opposing armies across the Dardanelles, which ultimately led to the downfall of much of Europe (including those geniuses who piloted the boats).  Much has changed, much has not.  Much is now explained to me.  And now, I'm desperate to visit Venice even more than before.I'll also say that it's amazing how this historian can write a book that covers centuries, and is as readable as a novel.  Next book, please!"}]}, "authors": ["Roger Crowley"], "isbn": "0812980220", "longitude": 12.3345898, "periods": ["1600s", "Recent Releases", "1500s", "500-1400s"], "title": "City of Fortune: How Venice Ruled the Seas", "word_cloud": "consistently great storyteller recently become fascinated write accessible way cover history well thoroughly enjoy full interesting detail everything connect start right begin pay special attention part want hear role crusade audio good have visit spectacular several time list history time fit bill perfectly cover breadth venetian history example touch mythical root origins build sand flat lagoon cover important period time form fantastical find today attack end finality war cover amazing rise build trade end sad decline succumb force east west truly build trade commerce however worth note inevitably prey tide war nation build powerful navy use great effect secure navigational rite sea thing great job describe influence famous frequent war play significant role fall rise also describe detail challenge face maintain many colony spread challenge many european nation year ahead overall wonderful engage person interested highly recommend clear quite mystery frequent description original source contemporary chronicler bring tumultuous history life expect write clear concise several time last visit immeasurably enhance visceral dramatic knowledge contain herein never feel quite casual stroll shopping bridge reading author wonderful narrative modern merchant way ahead rest world great detail understand venician mentality fascinating highly readable story history plenty detail much overwhelm lose interest author good storyteller gain excellent insight excellent fascinate journey period time previously know little extremely important european history quit read good pace storytelling echo many comment already write no idea much history oceans rivalry long connection fascination importance opportunity make money outweigh everything else include get pay ferry oppose army ultimately lead downfall much include genius pilot boat much change much much explain desperate visit even also say amaze historian write cover century readable next please", "genres": ["History"], "summary": "“The rise and fall of Venice’s empire is an irresistible story and [Roger] Crowley, with his rousing descriptive gifts and scholarly attention to detail, is its perfect chronicler.” The Financial Times\r\n \r\nThe New York Times bestselling author of Empires of the Sea charts Venice’s astounding five-hundred-year voyage to the pinnacle of power in an epic story that stands unrivaled for drama, intrigue, and sheer opulent majesty. \r\n\r\nCity of Fortune traces the full arc of the Venetian imperial saga, from the ill-fated Fourth Crusade, which culminates in the sacking of Constantinople in 1204, to the Ottoman-Venetian War of 1499–1503, which sees the Ottoman Turks supplant the Venetians as the preeminent naval power in the Mediterranean. In between are three centuries of Venetian maritime dominance, during which a tiny city of “lagoon dwellers” grow into the richest place on earth. Drawing on firsthand accounts of pitched sea battles, skillful negotiations, and diplomatic maneuvers, Crowley paints a vivid picture of this avaricious, enterprising people and the bountiful lands that came under their dominion. \r\n\r\nFrom the opening of the spice routes to the clash between Christianity and Islam, Venice played a leading role in the defining conflicts of its time—the reverberations of which are still being felt today.\r\n \r\n“[Crowley] writes with a racy briskness that lifts sea battles and sieges off the page.”The New York Times", "asin": "0812980220", "rank": "52100", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51xfvC131BL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}