{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 177, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Very good; an invitation to read more of Sebald."}, {"review_sentiment": 5.0, "review_text": "Fascinating novel by one of the most brilliant of recent novelists, who unfortunately died in his prime.  Sebald is brilliant at evoking the elusive nature of the past, as his protagonist Austerlitz, a former refugee from Nazi Germany, tries to rediscover his origins.  In places, the novel is Proustian (including one increasingly horrific, eleven-page sentence describing the functioning of the concentration camp where his mother would have been interned, which is also a clever parody of Proust), but in constantly distancing the reader from Austerlitz's narrative, and with his uncertainties and speculations demonstrating what cannot be recaptured, this, his last novel, is actually more of a refutation of Proust.  Sebald's use of blurry, usually inartistic photographs, only approximately linked to the narrative, also makes the imaginative reconstruction of Austerlitz's past seem more real, while at the same time increasing the reader's distance from it.  One is left with a life history which seems both real and yet ultimately incomprehensible, as are the actual events of the Nazi era itself.  Despite its somewhat experimental nature, a compelling read!"}, {"review_sentiment": 5.0, "review_text": "A compelling, innovative major Holocaust novel about trauma and repressed memory experienced by a survivor of the kindertransport. If I had read Sebald's before this,  I might have included a chapter in my forthcoming Reading the European Novel from 1900:A Critical Study of Major Fiction from Proust’s Swann’s Way to Ferrante’s Neapolitan Tetralogy  (Wiley)"}, {"review_sentiment": 5.0, "review_text": "Unbelievable how much of the time one is compelled to remember that which one never knew about. Incredibly fascinating to experience."}, {"review_sentiment": 5.0, "review_text": "great service"}, {"review_sentiment": 2.0, "review_text": "Confusing novel. Spent way too much time discussing architecture. I would rather have read more about the protagonist."}, {"review_sentiment": 5.0, "review_text": "It looks good, I have not read it yet."}, {"review_sentiment": 5.0, "review_text": "Austerlitz was an 1805 battle that Napoleon won, and it is a train station in Paris today.  It is also the name of the title character of W.G. Sebald’s strangely absorbing illustrated novel telling how you can take the boy out of the Holocaust but you can’t take the Holocaust out of the boy.  One day in 1967, the undescribed, unnamed narrator encounters a strangely dressed fellow taking pictures in the Antwerp train station and strikes up a conversation.  Austerlitz turns out to be a savant of rail transport, an inveterate traveler who knows all there is to know about the train stations of Europe, and a lot else besides.  The novel proceeds episodically from station to station as the years pass and the narrator and Austerlitz meet, converse and say farewell.  It turns out that there is a point to this odd travelogue, and it concerns Austerlitz’s primal westward train journey across Europe as a young boy on the “kindertransport.”  This was the desperate 1938-39 effort of Jewish families to save their children from the Nazis, since they couldn’t save themselves.  The action of the later part of the novel concerns Austerlitz’s quest to discover his origins.  What makes “Austerlitz” unforgettable is Sebald’s Proustian style, composed of sinuous sentences that proceed gracefully for pages and pages before ending just at the right place.  The elegaic mood of these backward-looking sentences draws the reader into the tragedy of Austerlitz’s life and its eventual triumph."}, {"review_sentiment": 4.0, "review_text": "Always meaning to read this and finally got it done"}, {"review_sentiment": 1.0, "review_text": "Why the first page is 13?!?!?!?🙃🙃🙃"}]}, "authors": ["W.G. Sebald"], "isbn": "0812982614", "longitude": 14.4212535, "periods": ["1900s"], "title": "Austerlitz", "word_cloud": "very good invitation fascinate brilliant recent novelist unfortunately die prime brilliant evoke elusive nature protagonist former refugee try rediscover origin place proustian include increasingly horrific sentence describe function concentration camp mother also clever parody constantly distance narrative uncertainty speculation demonstrate recapture last actually refutation use blurry usually inartistic photograph approximately link narrative also make imaginative reconstruction seem real time increase distance leave life history seem real yet ultimately incomprehensible actual event era experimental nature compelling compelling innovative major trauma repress memory experience survivor kinder transport se bald chapter forthcoming read unbelievable much time compel never know fascinate experience great service confuse way much time discuss architecture rather look good yet battle train station today also name title character strangely absorb illustrate tell boy day undescribed unnamed narrator encounter strangely dress fellow take picture train station strike conversation turn savant rail transport inveterate traveler know know train station lot else proceeds episodically station station year pass narrator meet converse say farewell turn point odd travelogue concern primal westward train journey young boy desperate effort jewish family save child save action later part concern quest discover origins make unforgettable style compose sinuous sentence proceed gracefully page page end right place elegiac mood sentence draw tragedy life eventual triumph always mean finally get do first page", "genres": ["Memoir", "Essay", "Fiction & Literature", "WWII"], "summary": "This tenth anniversary edition of W. G. Sebald’s celebrated masterpiece includes a new Introduction by acclaimed critic James Wood. Austerlitz is the story of a man’s search for the answer to his life’s central riddle. A small child when he comes to England on a Kindertransport in the summer of 1939, Jacques Austerlitz is told nothing of his real family by the Welsh Methodist minister and his wife who raise him. \r\n\r\nWhen he is a much older man, fleeting memories return to him, and obeying an instinct he only dimly understands, Austerlitz follows their trail back to the world he left behind a half century before. There, faced with the void at the heart of twentieth-century Europe, he struggles to rescue his heritage from oblivion.\r\n\r\n\"Sebald stands with Primo Levi as the prime speaker of the Holocaust and, with him, the prime contradiction of Adorno’s dictum that after it, there can be no art.” The New York Times", "asin": "0812982614", "rank": "83821", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51cOfb1xTtL.jpg", "country": "Czechia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}