{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 107, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "This is one of the best memoirs / historical books I have read in some time. Just majestic in scope and beautifully written. It discusses an area of the world (Libya) of which I knew very little but now I know a lot more. I am very grateful that the author wrote this. I feel like a better person having read it. Bravo."}, {"review_sentiment": 1.0, "review_text": "I just found it boring."}, {"review_sentiment": 3.0, "review_text": "I liked the idea of this book and found the details about Libya past and present (a country about which I do not have a depth of knowledge) to be fascinating.  What I did not like, however, was the arrogance and egocentrism of the author, who tried desperately to situate himself at the centre of every single situation. He was a much better writer when he stuck to relaying facts, but the relentless self promotion and self flagellation wore me down. I read the book to the end because I rarely abandon a book midway through, but I found myself getting increasingly annoyed as time went on. I was relieved to have finished it."}, {"review_sentiment": 1.0, "review_text": "I did not like the book at all. Is was disappointing from beginning to end, just another personal account of some happening the same of which we are now reading about in every daily newspaper by the page full. And nobody either can or will do anything about all the violence happening in the middle-east countries today.  There is  no conclusion, there is no moral. the writer shows himself as week and inactive whereas his brother seems to do all the research on the father's whereabouts.Th book is not even written well. I don't need any more of this type of book, simply an offloading of some personal feelings. I am not a psychoanalyst."}, {"review_sentiment": 4.0, "review_text": "it's a good book, the writer is well informed on many events both historical and actual!!"}, {"review_sentiment": 5.0, "review_text": "This book is a testament to both the tenacity of life and the unforgiving nature of those that are no longer humanists. They are feral hunters and destroyers of mindfulness."}, {"review_sentiment": 5.0, "review_text": "Heartbreaking account of author's mission to make sense of his father's kidnapping.  Very well written and an important read."}, {"review_sentiment": 5.0, "review_text": "Beautifully written giving  very personal memories and places universal meaning."}, {"review_sentiment": 5.0, "review_text": "Compelling storu"}, {"review_sentiment": 3.0, "review_text": "A moving story vividly told, but hard to follow. Too many flashbacks and jumps in time and place. Same ingredients more intelligently organized would have been a really top notch experience. A little more thought for the reader?"}]}, "authors": ["Hisham Matar"], "isbn": "0812985087", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "The Return: Fathers, Sons and the Land in Between", "word_cloud": "best memoir historical time majestic scope beautifully write discuss area world know little know lot grateful author write feel better person find bore like idea find detail present country depth fascinate like however arrogance ego centrism author try desperately situate center single situation much better writer stick relay fact relentless self promotion flagellation wear end rarely abandon midway find get increasingly annoy time go relieve finish like be disappoint begin end personal account happen read daily newspaper page full nobody anything violence happen country today conclusion moral writer show week inactive whereas brother seem research father even write well need type simply offload personal feeling psychoanalyst good writer well inform many event historical actual testament tenacity life unforgiving nature longer humanists feral hunter destroyer mindfulness heartbreaking account author mission make sense father kidnap very well write important beautifully write give personal memory place universal meaning compel story move story vividly tell hard many flashback jump time place ingredients intelligently organize really notch experience little thought", "genres": ["Memoir"], "summary": "WINNER OF THE PULITZER PRIZE \r\n\r\nThe acclaimed memoir about fathers and sons, a legacy of loss, and, ultimately, healing--one of The New York Times Book Review's ten best books of the year.\r\n\r\nWhen Hisham Matar was a nineteen-year-old university student in England, his father went missing under mysterious circumstances. Hisham would never see him again, but he never gave up hope that his father might still be alive. Twenty-two years later, he returned to his native Libya in search of the truth behind his father's disappearance. The Return is the story of what he found there. \r\nThe Pulitzer Prize citation hailed The Return as \"a first-person elegy for home and father.\" \r\n\r\nTransforming his personal quest for answers into a brilliantly told universal tale of hope and resilience, Matar has given us an unforgettable work with a powerful human question at its core: How does one go on living in the face of unthinkable loss? ", "asin": "0812985087", "rank": "9264", "city": "Tripoli", "image": "https://images-na.ssl-images-amazon.com/images/I/51NYDhMsFYL.jpg", "country": "Benghazi", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}