{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 199, "rating": 3.4, "reviews": [{"review_sentiment": 3.0, "review_text": "I really wanted to like Open City, but ultimately found this book rather frustrating. Teju Cole's other writing can be wonderful, so I had high expectations.  The title is great, and I was initially drawn to the portrait of Manhattan at a particular moment in time (early 2000s).  I began reading this book in print, then switched over to kindle for a bit, and finally read the whole thing as audiobook.  Kevin Mambo reads in an engaging, fluid way that captures the variety of accents embedded in this book.As other reviewers have noted, the main character in Open City comes across as self-involved, even arrogant at times.  Not sure if this quality was intended by the author, but that is how it comes across.  At first I wasn't sure if this was a result of the reader's inflections, or the actual writing, but when I looked back at the book in print, I felt that Mambo had indeed represented the character, as written, accurately.Since the main character's narration dominates the book, it's hard not to notice that his assigned occupation -- medical resident -- doesn't fit very credibly with the book's premise of wandering through NYC and Europe. Graduate students in some fields might well have that kind of unstructured time while writing dissertations, and may even need to do it for their research, but it's hard to believe that an active medical resident at a competitive university hospital, far uptown in NYC, would have so much free time to wander the streets of lower Manhattan, aimlessly ride the subway, or depart on sudden stints of personal travel abroad.  I found this detail of the narrator's occupation increasingly distracting over the course of the book, and almost stopped reading because of it.  But I pressed on to the end since the book contained some other qualities that held my interest -- his vivid conversations with an internet / phone shop manager, and the intriguing bits of family history that seem to promise some kind of revelation (which never really materializes).At many points, the book has a surreal dreamlike effect that evokes Kafka's Amerika.  (So, maybe the irreality of the narrator's occupation was intentional?)  But that effect is continually offset by long stretches of random information that too often feel like half-digested internet searches.  That's a pity, because Open City otherwise contains some beautiful lyrical sentences about looking and seeing, about people in cities, about America, especially near the end - a reminder of Cole's other vocation as an art historian."}, {"review_sentiment": 5.0, "review_text": "This is the BEST book I've read in a LONG time.  If you love NYC you need this book!  I love New York and now have experienced it in a whole new way.  Following the character around on a walking adventure is wonderful!"}, {"review_sentiment": 2.0, "review_text": "my god; no tension, no story...equals no glory.  love 'blind spot,' but never imagined this pointless meandering.....and, in general, i live for the meander."}, {"review_sentiment": 3.0, "review_text": "Beautifully written and creative. Part of the plotless books that seem to interest young writers now. A little bit too self absorbed, too many high culture references (we trust that you are a cultivated man with refined tastes, Mr. Cole, but not even Proust name dropped at that frequency). But what talent for a first book! OK, give the man another half star."}, {"review_sentiment": 5.0, "review_text": "One of the most remarkable books I've read in some time!  At first, I was drawn in by the beauty of the style-- the gorgeous sentences alone are worth the read--but once you've made it some pages in to Open City, you begin to realize that you are not reading ABOUT a man walking through a city and a moment in culture and history; you ARE that man.  Cole has the astonishing gift of understanding how to write movement through time and space so that it is not merely described but directly experienced.  The book has many other excellent qualities, but it is this intimate understanding of how to manage cognitive cues in language that makes Cole's work and vision so extraordinary."}, {"review_sentiment": 5.0, "review_text": "A non-plot novel that keeps me interested from start to end. For people who love to come across historical facts, this book is full of them and they are mentioned or introduced in a decent flow. I also love how random and small but implicitly meaningful moments can be told in this novel and the fact that they, indeed, are quite relevant to each other if we look at them not as separate stories, but as parts of an underlined theme. The absence of an overarching plot leads me to stay in the moment with each stories, lets me feel the time shifts in the mind of the narrator, and indulges me in the process of the narrator's mind-wandering. Quite a nice experience."}, {"review_sentiment": 2.0, "review_text": "Not my kind of book. Prose is well done but had a hard time getting into the book. I need more dialog and \"purpose\" to the storyline.  Found it somewhat boring. Detail is great but sometime too much detail bogs down a story."}, {"review_sentiment": 2.0, "review_text": "I was expecting something more than what I got out of this book. It was a bit too internal for me and, from my perspective, nothing much happened. I finished it out of a sense of obligation but am unlikely to read this author again"}, {"review_sentiment": 4.0, "review_text": "My first time reading a Teju Cole work. To be his first novel, this was absolutely a masterpiece. His articulation & use of descriptive vocabulary left me speechless. I just may have to re-read this; I'm sure I may have missed something. So full !"}, {"review_sentiment": 5.0, "review_text": "at the end of teja cole’s Open City, what becomes clear is that there is no ending.  after following the reflections of julius, a bi-racial, german-nigerian, psychiatrist by day, as he wanders around manhattan by night, with walks an overseas trip in search of his european grandmother, in brussels, belgium, many of his reflections on death—the death of a former english literature professor, the death of a grandfather, and the last weeks in the life of the composer, gustave mahler—some sense of an ending, certainly, is expected.and, yet, it is at the end of this first-person confession, this open-ended narrative, to which the moral of the story is ‘life goes on’, that the form becomes evident.  for not until the end can one know that there is no intended listener for julius, that the story stands as a personal undated journal by a man who spends quite a bit of time by himself, when he isn’t working, reading philosophy, essays, histories and european literature, attending non-mainstream movies, symphonic concerts, and art galleries and photography exhibitions by himself.  an aesthete, a bit of a cosmopolitan.a long-distance relationship falls apart.  by chance, on a manhattan street, he is recognized by the sister of a friend he knew in nigeria.  she is in a new york biracial relationship.  julius doesn’t appear to be looking for a relationship or bothered by sexual desire.  he is comfortable as a solitude.  he has friends in manhattan, but not close friends, and no romantic interests.during his walks, his color and african features attract the attention of black immigrants from africa and island countries, seeking camaraderie with him, from which julius maintains distance, while lending an ear to the stories of the immigrants who escaped violence, poverty, and oppression, and their struggle to succeed in the united states.in brussels, which became an ‘open city’ during world war 2, he meets university educated muslim immigrants who, unlike their counterparts in the united states, have no gratitude for their host country, express their displeasure for western culture, their experiences as immigrants, and tolerance for forms of islamic rule which would raise eyebrows if openly discussed in many western countries, even in this novel’s pre-911 setting.subtle queasiness pervades cole’s text, giving rise to the disturbing suspicion that julius is using his skills as a psychiatrist to cope for the lack of a fuller emotional and social life and avoidance of his own bi-racial history; that his predilection for the arts, juxtaposed against the social violence he encounters within the world through experience, media, and conversation, functions for him in a manner similar to how personal violence functioned for justin bateman in bret easton ellis’  American Psycho.  credit cole’s control of tension for how Open City becomes counter-story to ellis’ novel, both novels exploring existential freedom within the city, questioning who are the free, and by what act of daring their freedom is won or given and maintained.the important difference between the two novels is the inclusion of black immigrants seeking sanctuary in open cities.  a new addition to existential literature of violence."}]}, "authors": ["Teju Cole"], "isbn": "0812980093", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Open City", "word_cloud": "really want ultimately find rather frustrating write wonderful high expectation title great initially draw portrait particular moment time early begin read print switch kindle bit finally whole thing audio book read engage fluid way capture variety accent embed reviewer note main character come even arrogant time not sure quality intend author come first sure result inflection actual writing look back print felt indeed represent character write main character narration dominate hard notice assign occupation medical resident fit credibly wander student field well kind unstructured time write dissertation even research hard believe active medical resident competitive university hospital far uptown much free time wander street lower aimlessly subway depart sudden stint personal travel abroad find detail narrator occupation increasingly distract course almost stop read press end contain quality hold interest vivid conversation internet phone shop manager intrigue bit family history seem promise kind revelation never really materialize many point surreal dreamlike effect evokes maybe reality narrator occupation intentional effect continually offset long stretch random information often feel internet search pity otherwise contain beautiful lyrical sentence look see people city especially end reminder vocation art historian time love need love experience whole new way follow character walk adventure wonderful god tension story equal glory love spot never imagine pointless meander general live meander beautifully write creative plot less seem interest young writer little bit self absorb many high culture reference trust cultivate man refine taste even name drop frequency talent first ok give man half star remarkable time first draw beauty style gorgeous sentence alone worth make page read man walk moment culture history man astonish gift understand write movement time space merely describe directly experience many excellent quality intimate understanding manage cognitive cue language make work vision extraordinary keep interested start end people love come historical fact full mention introduced decent flow also love random small implicitly meaningful moment tell fact indeed quite relevant look separate story part underline absence overarch plot lead stay moment story let feel time shift mind narrator indulges process narrator nice experience not kind well do hard time get need dialog purpose story line somewhat boring great sometime much detail bog story expect something get bite internal perspective nothing much happen finish sense obligation unlikely author first time read work absolutely articulation use descriptive vocabulary leave speechless sure miss something so full end tea cole become clear end follow reflection julius psychiatrist day wanders manhattan night walk overseas trip search european grandmother brussels belgium many reflection death former english literature professor death grandfather last week life composer gust ave sense end certainly yet end confession narrative moral story life go form become evident know intend listener julius story stand personal undated journal man spend quite bit time work read philosophy essay history european literature attend movie symphonic concert art gallery photography exhibition aesthete bit relationship fall apart chance manhattan street recognize sister friend know nigeria new york biracial relationship julius appear look relationship bother sexual desire comfortable solitude friend manhattan close friend romantic walk color african feature attract attention black immigrant africa island country seek camaraderie julius maintain distance lending ear story immigrant escape violence poverty oppression struggle united brussels become world war meet university educate muslim immigrant counterpart united state gratitude host country express displeasure western culture experience immigrant tolerance form islamic rule eyebrow openly discuss many western country even queasiness pervades cole text give rise disturb suspicion julius use skill psychiatrist cope lack fuller emotional social life avoidance history predilection art juxtapose social violence encounter world experience medium conversation function manner similar personal violence function justin batman bret east on elli credit cole control tension become elli novel explore existential freedom question free act dare freedom give important difference novel inclusion black immigrant seek sanctuary city new addition existential literature violence", "genres": ["Fiction & Literature"], "summary": "A New York Times Notable Book\r\n\r\nA haunting novel about identity, dislocation, and history, Teju Cole’s Open City is a profound work by an important new author who has much to say about our country and our world.\r\n\r\nAlong the streets of Manhattan, a young Nigerian doctor named Julius wanders, reflecting on his relationships, his recent breakup with his girlfriend, his present, his past. He encounters people from different cultures and classes who will provide insight on his journey—which takes him to Brussels, to the Nigeria of his youth, and into the most unrecognizable facets of his own soul.\r\n\r\n“[A] prismatic debut . . . beautiful, subtle, [and] original.” The New Yorker", "asin": "0812980093", "rank": "37476", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51WaKQr3aiL.jpg", "country": "Brussels", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}