{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 102, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "I just re-read E.L. Doctorow's brilliant novel Billy Bathgate, and it's even better than I remembered. Told from the viewpoint of a poverty-stricken teenager in 1935 who catches the eye of the notorious Dutch Schultz mob and is with them until their demise, it's a tremendous experience.Part coming-of-age, part dance-with-the-devil, part homage to a departed era, and part action novel, this one's a feast for people who like the written word. Doctorow accomplishes a lot in this book, but one thing he does especially well is make deft references to events and thoughts and observations that happened earlier in the story. At the end of the novel you realize just how important it was to pay attention to the little things all the way through.He also brings real people back to life as unforgettable characters. From Schultz's brilliant right-hand man Otto \"Abbadabba\" Berman to his most talented hitman Bo Weinberg, from the deadly and unnamed nemesis who is unquestionably Charles \"Lucky\" Luciano to the volatile, crafty, and self-destructive Dutchman himself, they walk, talk, and rampage again in this story. I strongly recommend it."}, {"review_sentiment": 5.0, "review_text": "A 1930's American gangster classic. So chock full of love, life, death and the will to survive set down in clean, Hemingwayesque  prose. The rich cast of characters got under my skin so deeply they haunted my dreams.Can't believe I discovered Doctorow so late in life, but now am on a mission to devour his other works."}, {"review_sentiment": 4.0, "review_text": "Enjoyable blend of history and fiction.  Well written and conceived."}, {"review_sentiment": 5.0, "review_text": "i like this book ,but can somebody tell me where did Billy got the money an the end of the story,i do not figure it out ,if some one can solve the riddle for me,thank you very much"}, {"review_sentiment": 4.0, "review_text": "Was a day late but great book"}, {"review_sentiment": 5.0, "review_text": "A capable boy catches the attention of head of the local rackets around Bathgate Avenue in the Bronx by juggling, and becomes affiliated with the mob as a good-luck charm--and years later tells his story in the novel Billy Bathgate.His job was “to pay attention, to miss nothing,” and take care of other specific tasks that were assigned to him.  The fruits of the meticulous memory of Billy Bathgate become a great story for the reader, and a magical windfall for the title character at the conclusion of the novel.The racket deals in beer, unions, policy, and ‘runs it like a candy store.’  But it also deals in death, beginning with the murder of Bo Weinberg at the start of the novel, with his feet stuck into a bucket of cement until it sufficiently hardened, then the body dumped in the East River.There is also the murder of Julie Martin, up in Onondaga County, where Dutch Schultz and his associates spend a summer preparing for the income tax evasion trial of the boss.  They spend money around town like it’s candy, make donations to local causes, and essentially buy the goodwill of the community.  Schultz even has a highly publicized conversion to the Roman Catholic religion, sponsored by ‘a man with the bad skin.  The one he respects so.’  A portion of that community becomes the jury for the trial in Onondaga County, the one which concludes with the judge saying “in all my years on the bench I have never witnessed such disdain of truth and evidence as you have manifested today.”“I promise, I tell him in the first act of mercy in my life” to take care of his girl, says Billy, as Bo Weinberg is facing his sentence.  This promise nearly becomes his undoing.  Bo’s girl becomes Dutch’s girl--what choice does she have after being a witness to Bo’s execution?  In Onondaga, Bo’s girl Drew is introduced as Billy’s governess, and the two spend plenty of time together keeping up appearances.  By the time she becomes expendable, Billy has fallen for Miss Drew, and when the two are dispatched to Saratoga, it may be a trip to their own funeral.Yet Billy is also resourceful, and lucky, he’s the kind of guy who makes his own luck, so the reader has the feeling that Billy can change the script. He was trying to catch on, but had to navigate the tricky boundaries of making himself available without being pushy. He seemed in a pickle when he went to the numbers house with his paper bag of cupcakes, but the incident became his opportunity.  “You handle Saratoga, kid, I’ll believe you can handle anything,” said numbers man Addadabba Berman.  But Billy was so nuts about Miss Drew that he couldn’t see straight, and that kinda nuts can get your own nuts in a bind.As spellbinding as Ragtime was, or The March, or World’s Fair, or Waterworks were, Billy Bathgate might be E.L. Doctorow’s best novel."}, {"review_sentiment": 3.0, "review_text": "An interesting tale, curious enough to keep me engaged. But I didn't care for the choppy sentences, or some or the sentences that ran on far too long. Overall,"}, {"review_sentiment": 4.0, "review_text": "Doctorow is well recognized in the literary world. He creates worlds that the reader can enter with varying degrees of involvement. This man has never written a novel that I don't like..."}, {"review_sentiment": 5.0, "review_text": "Masterpiece."}, {"review_sentiment": 4.0, "review_text": "A good story, slow in some places, too wordy in others.  All on all an interesting look into a different time"}]}, "authors": ["E.L. Doctorow"], "isbn": "0812981170", "longitude": 0.0, "periods": ["1900s"], "title": "Billy Bathgate", "word_cloud": "doctorow brilliant even better remember viewpoint teenager catch eye notorious mob demise tremendous part part homage depart era part action feast people write word accomplish lot thing especially well deft reference event thought observation happen earlier story end realize important pay attention little thing way also bring real people back life unforgettable character brilliant man talented whitman deadly unnamed nemesis unquestionably volatile crafty walk talk rampage story strongly recommend american gangster classic so chock full love life death survive set clean prose rich cast character get skin deeply haunt believe discover late life mission devour work enjoyable blend history fiction write conceive somebody tell get money end story figure solve thank much day late great capable boy catch attention head local racket juggle becomes affiliate mob charm year later tell story job pay attention miss nothing take care specific task assign fruit meticulous memory great story magical windfall title character conclusion racket deal beer union policy run candy also deal death begin murder start foot stuck bucket cement sufficiently harden body dump also murder associate spend summer prepare income tax evasion trial spend money town candy make donation local cause essentially buy goodwill community even highly publicize conversion religion sponsor man bad skin respect portion community become jury trial conclude judge say year bench never witness disdain truth evidence manifest promise tell first act mercy life care girl say face sentence promise nearly becomes undoing girl become girl choice witness execution girl introduce governess spend plenty time together keep appearance time becomes expendable fall dispatch trip also resourceful lucky kind guy make luck feel change script try navigate tricky boundary make available pushy seem pickle go number house paper bag cupcake incident become opportunity handle kid believe handle anything say number man nut see straight kinda nut get nut spellbinding best interesting tale curious enough keep engage care choppy sentence sentence run far long overall well recognize literary world create world enter vary degree involvement man never write like masterpiece good story slow place wordy others interesting different time", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "To open this book is to enter the perilous, thrilling world of Billy Bathgate, the brazen boy who is accepted into the inner circle of the notorious Dutch Schultz gang. \r\n\r\nLike an urban Tom Sawyer, Billy takes us along on his fateful adventures as he becomes good-luck charm, apprentice, and finally protégé to one of the great murdering gangsters of the Depression-era underworld in New York City. The luminous transformation of fact into fiction that is E. L. Doctorow’s trademark comes to triumphant fruition in Billy Bathgate, a peerless coming-of-age tale and one of Doctorow’s boldest and most beloved bestsellers.", "asin": "0812981170", "rank": "566386", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51pJ7L6j5yL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}