{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 36.1662859, "ratings": {"num_ratings": 69, "rating": 3.0, "reviews": [{"review_sentiment": 5.0, "review_text": "This book was hard to put down. Really vivid characters, and a compelling read despite the difficult subject matter. Writing about tragic lives such as these is not easy, but Bock has a way of making the reader care about each character and hopeful that they'll overcome life's difficulties."}, {"review_sentiment": 2.0, "review_text": "This novel won Bock the 2009 Sue Kaufman Prize for First Fiction. It must have been a slow year for first novels because this book has little redeeming qualities for its simplistic and shallow plot, boring and uninspired characters, and cliché tricks employed to try to keep the reader reading."}, {"review_sentiment": 5.0, "review_text": "This book will stay with me for a long time. It is not a novel for those who want something upbeat and positive."}, {"review_sentiment": 2.0, "review_text": "I read the entire book because I truly did want to know what happened, but I should have put it down.  The most depressing book I've read in ages."}, {"review_sentiment": 1.0, "review_text": "The blurb made it sound good, but I couldn't even make it thru chapter 2. The characters and scenes change constantly without any continuity.I've read first books by indie authors that are far better!I don't understand how this got into the library system, and worse yet, became an audio book....."}, {"review_sentiment": 5.0, "review_text": "I first read this book in 2008 and was captivated by it. It was weird at first -- I wasn't used to the various narrators and jumping from story to story but I'm glad I stuck with it because it all made sense at the end. Bock writes so vividly, you really get to know the characters on the page. Some are more mysterious than others and at first glance you could say they're poorly developed, but I really think those were intentional acts on the part of the author to add depths to the characters in a different way. We're only shown glimpses of their lives and there's a reason for that. It's up to us, the reader, to figure out what that reason is.This book made me want to run around the deserts of Las Vegas while wearing beat up Converse sneakers, ripped jeans, too much eye liner, unwashed hair, and random bumps and bruises from past adventures. If you allow yourself to be immersed in the world of \"Beautiful Children,\" you will not be disappointed!"}, {"review_sentiment": 4.0, "review_text": "Do you recall that famous Nietzsche chestnut - \"And when you gaze long into an abyss, the abyss also gazes into you\"? Well, in this book we get to take a long, hard look at Las Vegas, and it gets a chance to get into and rattle us. In the middle of nowhere, with no reason to exist other than its need to exist, Las Vegas is a fascinating, maddening, unique place.  This book, with all of its postmodern metafictional style, drives that home.The characters, who are set on paths that will converge at the end like some drugged out midnight showing of \"Nashville\", but with strippers, are types and constructs. There's no real point, it seems to me, to actually follow the mystery plot or to try to \"care for\" or \"connect with\" these characters. That would be like trying to care for or connect with a lamppost, (and less illuminating). The characters are pawns and markers moved around the Las Vegas board in order to allow us a full view of what this city is and what it can do to people.Sad, darkly funny, ironic, sometimes tender, but always on the make, this is a marvelous change of pace book and a rewarding read."}, {"review_sentiment": 1.0, "review_text": "I don't know how anyone can recommend this book.  It was trashy with no redeeming qualities.  I am amazed at how some books get to be \"best sellers\"."}, {"review_sentiment": 4.0, "review_text": "I came across this book after reading a review Charles Bock wrote that served as a retrospective of the emergence of cartoons designed for an adult audience.  The writing was engaging enough that it made me curious about his novel.  When I discovered that he was doing with Las Vegas what Tom Wolfe did with New York, Atlanta, and Miami and challenged other authors to do by portraying modern American cities in literature, I was sold.If other readers come away from this book feeling as if they've been privy to some unforgettable experiences but ultimately left feeling hollow, perhaps Bock has succeeded in conveying what Vegas is like from an local's perspective.Vegas is one of those cities that I've always found equally fascinating and repulsive.  I'd imagine that it would be difficult to feel like one is truly living a wholesome and meaningful life there considering the foundation the city is built upon.  Not that it would be impossible, but it must be far from the norm, and I feel that Bock does a good job conveying this.  Even the most stable of the brilliantly portrayed characters in the book live lives that are based on flash, hustle, and materialism.  None of the characters are free from deeply troubling elements, which I'm sure are much more common when one considers the motives that lead people to move to such a city.  I suppose in the end, the book only confirmed the suspicions I already had after visiting the city a dozen or so times under a number of pretenses.It's a bit difficult to assign a star rating to this one, so I'm mainly basing it on how engaged I was the entire time.  Unlike other reviewers, I was always drawn to the text and eager to continue reading up to the last page.  I found the mystery component behind the disappearance of Newell to be secondary to all the other stories told, but a strong element of suspense that ultimately disappointed.  Much like driving away from a weekend in Vegas, this book did not leave me feeling more optimistic, but it was a wild ride that I won't forget."}, {"review_sentiment": 3.0, "review_text": "I will say this about Bock's novel: I agonized over what rating I should pick, vacillating back and forth between giving it 3 stars and giving it 4. Should I grade the book based on how I enjoyed it overall? Or should I rank it based on the power of certain sections and how they made me feel? Ultimately, I had to go with the first option. Beautiful Children is a gutsy, audacious book, and there are some amazingly-written passages, but toward the end, I was plowing through huge chunks of it just to get the end so I could move on to something else.Let's start with the positive. With \"Children,\" Charles Bock proves himself a very talented writer. His prose is the most beautiful thing about this book; it's as smooth and pleasurable as the kind of cigarette ads you'd find plastered all over the Neon City. Bock is especially gifted at showing the reader what's going on or has gone on based on describing sheer details rather than outright saying it, and I'm always appreciative of this ability. In addition, Bock has a knack for getting inside the hopes and regrets of his characters, so much so that some sections of the book blew me away in their heartfelt desire to broadcast the tortured, inner thoughts of Beautiful Children's cast.Other reviewers have called the segments detailing Lincoln and Lorraine's marriage the strongest element of Bock's novel, and I agree with this heartily. Bock has a way of sketching the pain and trauma of the Ewings' living nightmare in a very realized and sobering way, detailing in full how they have drifted apart from each other since Newell's disappearance and thus truly capturing the insulated experience two people often share in a crumbling marriage -- both technically \"together\" but ultimately alone and unable to confide in friends or family. I also enjoyed the scene where multiple versions of Kenny from the future look back at the momentous night's events in the same way despite their different circumstances (a real highlight of the book). Lastly, I appreciated the depiction of the relationship between Cheri Blossom and Ponyboy. Despite the fact that Ponyboy is a complete scumbag and despite the fact that Cheri could do so much better, the notion that he's highly confident, physically sculpted, and (most of all) with a girl who has little self esteem of her own off the stage makes for a sadly realistic relationship, the kind that we've all seen play out many times before.Unfortunately, despite all that Beautiful Children has going for it, it's got a lot going against it, too. There were long stretches of the book that simply described everything going on around the central characters in copious detail, even when nothing is really happening (which is the case most of the time). Despite the fact that much of this is well-written, a lot of it turns up empty and, well, rather boring. The majority of the scenes with Kenny and Newell felt this way to me, as well as the experiences of the \"girl with the shaved head.\" While some of the characters are complex and intriguing, others aren't. How is Bing Beiderbixxe different from any other tail-starved nerd? What does Danger-Prone Daphney have going for her despite the fact that she's homeless AND pregnant? So the girl with the shaved head argues with her mom -- big deal!I think Beautiful Children's biggest problem, though, is Newell Ewing. Despite the fact that he's the linchpin of the entire plot, he's extremely unlikable, coming across as spoiled, caustic, and immature. I understand that this was likely Bock's intention, but it doesn't make reading the many scenes featuring the corpulent brat any easier to read. Also, given that the primary plot revolves around Newell's decision to run away from home, I found it highly unlikely that Newell would do this. He has difficulty connecting with his parents, sure, but what kid doesn't? More than that, Newell is privileged and constantly showered with fun stuff in his dad's attempt to win his approval. What kind of child would run away from this kind of upbringing? It seems to me that children only run away from home when they don't feel safe there, psychologically or emotionally. I never believed the notion that Newell felt that life on the streets was a better choice than his cushy, upper-class existence, especially since it involves going without good food, eschewing many materialistic adornments, and (most of all) operating independently without the safety net that parents can provide. This last thing, most of all, is what Newell would be unable to leave behind.I'm still happy that I chose to read Beautiful Children. Otherwise, I would have missed a lot of that brilliant and heartbreaking stuff going on with Lorraine and Lincoln. But I think that if Bock had made sure that his entire cast of characters were compelling rather than just half of them, he would have had a bigger hit on his hands. Let's see how you do with your next effort, Chuck!"}]}, "authors": ["Charles Bock"], "isbn": "0812977963", "longitude": -115.149225, "periods": ["2000s", "Recent Releases"], "title": "Beautiful Children: A Novel", "word_cloud": "hard put vivid character compel difficult subject matter tragic life easy way make care character hopeful overcome life difficulty year first novel little redeem quality simplistic shallow plot boring uninspired character cliche trick employ try reading stay long time want something upbeat positive entire truly want know happen put depressing age blurb make sound good even thru chapter character scene change constantly first indie author far better understand get library system worse yet become audio first captivate weird first use various narrator jump story story glad stick make sense end write vividly really know character page mysterious others first glance poorly develop really think intentional act part author add depth character different way show glimpse live reason figure reason make want run around desert wear beat sneaker rip jean much eye liner unwashed hair random bump bruise past adventure allow immerse world disappoint famous chestnut gaze long abyss abyss also gaze long hard look get chance get middle nowhere reason exist need exist fascinate madden unique place postmodern meta fictional style drive character set path converge end drug midnight show stripper type construct real point seem actually follow mystery plot try care connect character try care connect lamppost le illuminate character pawn marker move around board order full view city darkly funny ironic sometimes tender always make marvelous change pace rewarding know anyone recommend trashy redeem quality amaze best seller come read review write serve retrospective emergence cartoon design adult audience write engaging enough make curious discover challenge author portray modern american city literature reader come away feel privy unforgettable experience ultimately leave feel hollow perhaps succeed convey local city always find equally fascinating repulsive imagine difficult truly live wholesome meaningful life consider foundation city build not far feel good job convey even stable brilliantly portrayed character live life base flash hustle materialism none character free deeply troubling element sure much common consider motif lead people move city suppose end confirm suspicion already visit city dozen time number bit difficult assign star rating mainly base engage entire time reviewer always draw text eager continue read last page find mystery component disappearance secondary story tell strong element suspense ultimately disappointed much drive away weekend leave feel optimistic wild ride say agonize rating pick vacillate forth give star give base enjoy overall rank base power certain section make feel ultimately go first option gutsy audacious passage end plow huge chunk get end something start positive prove talented prose thing pleasurable kind cigarette ad find plastered especially gift show go go base describe sheer detail rather outright say always appreciative ability addition knack get inside hope regret character much section blow away heartfelt desire broadcast torture inner thought reviewer call segment detail marriage strongest element agree heartily way sketch pain trauma living nightmare realize sobering way detail full drift apart disappearance thus truly capture insulate experience people often share crumble marriage technically together ultimately alone unable confide friend family also enjoy scene multiple version future look back momentous night event way different circumstance real highlight lastly appreciate depiction relationship fact complete scumbag fact much better notion highly confident physically sculpt girl little self esteem stage make sadly realistic relationship kind see play many time go get lot go long stretch simply describe everything go central character copious detail even nothing really happen case time fact much lot turn empty well rather bore majority scenes felt way well experience girl shave head character complex intrigue others different nerd go fact homeless pregnant girl shave head argues mom big deal think biggest problem fact linchpin entire plot extremely unlikable come spoil caustic immature understand likely intention make read many scene feature corpulent brat easier also give primary plot revolves decision away home find highly unlikely connect parent sure kid more privilege constantly shower fun stuff dad attempt win approval kind child away kind upbringing seem child away home feel safe psychologically emotionally never believe notion felt life street better choice cushy existence especially involves go good food eschew many materialistic adornment operate independently safety net parent provide last thing still happy choose miss lot brilliant heartbreaking stuff go think make sure entire cast character compel rather half bigger hand next effort", "genres": ["Fiction & Literature"], "summary": "A New York Times Notable Book.\r\n\r\nOne Saturday night in Las Vegas, twelve-year-old Newell Ewing goes out with a friend and doesn’t come home. In the aftermath of his disappearance, his mother, Lorraine, makes daily pilgrimages to her son’s room and tortures herself with memories. Equally distraught, the boy’s father, Lincoln, finds himself wanting to comfort his wife even as he yearns for solace, a loving touch, any kind of intimacy.\r\n\r\nAs the Ewings navigate the mystery of what’s become of their son, the circumstances surrounding Newell’s vanishing and other events on that same night reverberate through the lives of seemingly disconnected strangers: a comic book illustrator in town for a weekend of debauchery; a painfully shy and possibly disturbed young artist; a stripper who imagines moments from her life as if they were movie scenes; a bubbly teenage wiccan anarchist; a dangerous and scheming gutter punk; a band of misfit runaways. The people of Beautiful Children are “urban nomads,” each with a past to hide and a pain to nurture, every one of them searching for salvation and barreling toward destruction, weaving their way through a neon underworld of sex, drugs, and the spinning wheels of chance.\r\n\r\nIn this masterly debut novel, Charles Bock mixes incandescent prose with devious humor to capture Las Vegas with unprecedented scope and nuance and to provide a glimpse into a microcosm of modern America. Beautiful Children is an odyssey of heartache and redemption heralding the arrival of a major new writer.", "asin": "0812977963", "rank": "1274672", "city": "Las Vegas", "image": "https://images-na.ssl-images-amazon.com/images/I/61FZAv5hc5L.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}