{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 559, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "The story proceeds at a good pace and seems accurate for the time period just before France lost to Germany. Stahl succeeds also in his romantic episodes with pleasing young ladies."}, {"review_sentiment": 3.0, "review_text": "Bought this book on the recommendation of a friend and had to force myself to finish it. There were interesting parts of the book especially when describing familiar places in Paris. However the story seems somewhat contrived and formulaic.  Would not be at the top of my reading list."}, {"review_sentiment": 4.0, "review_text": "4 1/2 stars- Furst is brilliant at characterization, history, mood, and pacing, all in a light, breezy package. I read it quickly because I couldn't put it down. Perhaps lacking a little gravitas down the stretch, but still- Furst really knows how to give you a good read, and you will want to try him again."}, {"review_sentiment": 5.0, "review_text": "Well written and obviously the author has done a lot research about this period of time in France.  I like spy books during the pre WW 2 and post war period anyway.  I'll surely be reading more or Mr. Furst's offerings"}, {"review_sentiment": 4.0, "review_text": "excellent read. love Alan First"}, {"review_sentiment": 4.0, "review_text": "Furst's novels are alway a fantastic exploration of the human condition under threat of war, and this one had a tinge of melancholy that I quite enjoyed. The emigré movie star Frederic Stahl is unusual, character wise, for Furst - but it combined two of my loves; the behind-the-scenes machinations of classical-era Hollywood, and the intrigue and espionage of Europe on the brink of WWII. Well done, sir."}, {"review_sentiment": 3.0, "review_text": "Interesting settings, but not enough suspense. Furst succeeded in creating tension but then let it slip away with descriptions of Paris or dinner entrees. He opened with a good cast of ominous characters but rarely used them to advance the story."}, {"review_sentiment": 5.0, "review_text": "Great story."}, {"review_sentiment": 5.0, "review_text": "A fine novel that does a splendid job of evoking time and place: Europe in 1939, the last days of peace, in Paris and Berlin. Hated to see it end."}, {"review_sentiment": 5.0, "review_text": "I have become a huge fan of Alan Furst.  He is an excellent writer.  I have always taken an interest in books on World War II.  His research and command of the facts is without question extremely accurate and compelling.  I just ordered 2 more of his books.  Mission to Paris is one of my all time favorites of a number of his books I have read so far.  Best in the business."}]}, "authors": ["Alan Furst"], "isbn": "0812981820", "longitude": 2.3514992, "periods": ["1900s", "Recent Releases"], "title": "Mission to Paris", "word_cloud": "story proceeds good pace seem accurate time period lose succeed also romantic episode please young lady recommendation friend force finish interesting part especially describe familiar place however story seem somewhat contrived formulaic reading list brilliant characterization history mood pace light breezy package quickly perhaps lack little gravitas stretch really know good want try well write obviously author do lot research period time like spy per war period anyway surely read offering excellent love novel away fantastic exploration human condition threat war tinge melancholy quite enjoy emigre movie star unusual character wise combine love machination intrigue espionage brink do sir interesting setting enough suspense succeed create tension let description dinner entrees open good cast ominous character rarely use advance story story fine splendid job evoke time place last day peace see end become huge fan excellent writer always take interest research command facts question extremely accurate compelling order time favorites number far business", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "Late summer, 1938. Hollywood film star Fredric Stahl is on his way to Paris to make a movie. The Nazis know he’s coming—a secret bureau within the Reich has been waging political warfare against France, and for their purposes, Fredric Stahl is a perfect agent of influence. What they don’t know is that Stahl, horrified by the Nazi war on Jews and intellectuals, has become part of an informal spy service run out of the American embassy. Mission to Paris is filled with heart-stopping tension, beautifully drawn scenes of romance, and extraordinarily alive characters: foreign assassins; a glamorous Russian actress-turned-spy; and the women in Stahl’s life. At the center of the novel is the city of Paris—its bistros, hotels grand and anonymous, and the Parisians, living every night as though it were their last. Alan Furst brings to life both a dark time in history and the passion of the human hearts that fought to survive it.\r\n\r\n“One of [Furst’s] best . . . This is the romantic Paris to make a tourist weep. . . . In Furst’s densely populated books, hundreds of minor characters—clerks, chauffeurs, soldiers, whores—all whirl around his heroes in perfect focus for a page or two, then dot by dot, face by face, they vanish, leaving a heartbreaking sense of the vast Homeric epic that was World War II and the smallness of almost every life that was caught up in it.” The New York Times Book Review", "asin": "0812981820", "rank": "202859", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51bR6DLE4bL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}