{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 31.2253441, "ratings": {"num_ratings": 994, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "Overall, a good book. Worth a read. At times I felt the story was too fast, but the author kept the story going. I liked how the book ended by concluding this story, but setting up a cliff hanger for another story."}, {"review_sentiment": 5.0, "review_text": "I chose this rating because it is well written; the reality of WW2 China and beyond was real. This is what could have happened during that time."}, {"review_sentiment": 4.0, "review_text": "Lisa See is by far my favorite author. I can never not connect with her characters. With the many themes of mother love, sister relationships, and the struggle of women I found a piece of myself in each book. Shanghi Girls not being the exception. I found my twin and myself in the characters of Pearl and May.Always fighting. Always blaming. But never abandoning the other.I cried a good amount of times and was grateful to read a story about immigrant women that had to struggle. It reminded me of my moms story of her quest to be an American citizen and the struggle of keeping with tradition.Give Lisa See a shot. She may bring you to tears but she’ll give you hope as well."}, {"review_sentiment": 5.0, "review_text": "Loved this book didn’t want it to end"}, {"review_sentiment": 3.0, "review_text": "An enjoyable book, especially from the perspective of the lives of Chinese in California during the the period 1920 - 1960.  The characters were interesting, if somewhat predictable.  Somehow, I felt like the younger sister's character was not fully believable.  Overall a nice read for the beach or a long weekend.  Good but not great."}, {"review_sentiment": 5.0, "review_text": "This is one of the best books I have ever read!  Highly recommend it."}, {"review_sentiment": 1.0, "review_text": "Read this book and finally could not take how ridiculous it became.  Had less then 10 pages and never finished it.  The author just gives up and so did I."}, {"review_sentiment": 5.0, "review_text": "Good story of Chinese immigrants to America. It took me to a world in which I've never been. Looking forward to the sequel."}, {"review_sentiment": 3.0, "review_text": "First set in the 1930’s in Shanghai, China, and then in Los Angeles, this historical novel follows two Chinese sisters who are have very different values.  Told by the older sister, Pearl, the sensible one, the story examines how the two upper-middle-class ‘beautiful girls’ deal with the horrors of the Japanese invasion of China.  They struggle to escape the bombing of Shanghai.  Even the extraordinary beauty of the spoiled younger sister May doesn’t help them.  Finally, using their wits alone, the two sisters manage against all odds to escape to Los Angeles, California, where their two ‘husbands’ from their abruptly arranged-marriages live.No longer members of a privileged class, the two sisters now face a life of hard labor, few luxuries, and over-whelming social prejudge.  One sister adjusts to life with her new “family”; the other continues to demand — and mostly gets — what she wants.  Tempers flair.“Shanghai Girls” examines the definition of family, of love, of self-sacrifice, and of commitment.  It looks at the relationships between children and their parents and the relationships of siblings.  It also explores how dreams can destroy.Unfortunately, at times the plot of the novel is just too contrived.  Too many things happen at just the right time to force the plot along.  This is especially true of the ending.  Then there is the overwhelming amount of racial prejudice.  The author seems determined to fit in every racial injustice she can think of.  One area where Lisa See does excell, however, is in painting a good portrait of sibling rivalry."}, {"review_sentiment": 5.0, "review_text": "Although this is a book of fiction, the story is filled with rich history. Through the voice of Pearl we learn the sacrifices and the suffering of our Chinese immigrants. I look forward to her sequel."}]}, "authors": ["Lisa See"], "isbn": "0812980530", "longitude": 121.4888922, "periods": ["1900s", "Recent Releases"], "title": "Shanghai Girls: A Novel", "word_cloud": "overall good worth time felt story fast author keep story go like end conclude story set cliff hanger story choose rating well write reality real happen time far favorite author never connect character many theme mother love sister relationship struggle woman find piece exception find twin character fight blame never abandon cry good amount time grateful story immigrant woman struggle remind mom story quest american citizen struggle keep shot tear hope well want end enjoyable especially perspective life chinese period character interest somewhat predictable felt younger sister character fully believable overall nice beach long weekend great best ever finally ridiculous become page never finish author give good story chinese immigrant take world never look forward sequel first set historical follow chinese sister different value tell older sister sensible story examine beautiful girl deal horror japanese invasion struggle escape bombing even extraordinary beauty spoil younger sister help use wit alone sister manage odds husband abruptly longer member privilege class sister face life hard labor luxury social prejudge sister adjust life new family continue demand mostly get want temper examine definition family commitment look relationship child parent relationships sibling also explore dream time plot contrive many thing right time force plot especially true end then overwhelm amount racial prejudice author seem determined fit racial injustice think area excel however paint good portrait sibling rivalry fiction story fill rich history voice learn sacrifice suffer chinese immigrant look forward sequel", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "In 1937 Shanghai—the Paris of Asia—twenty-one-year-old Pearl Chin and her younger sister, May, are having the time of their lives. Both are beautiful, modern, and carefree—until the day their father tells them that he has gambled away their wealth. To repay his debts, he must sell the girls as wives to suitors who have traveled from Los Angeles to find Chinese brides. \r\n\r\nAs Japanese bombs fall on their beloved city, Pearl and May set out on the journey of a lifetime, from the Chinese countryside to the shores of America. Though inseparable best friends, the sisters also harbor petty jealousies and rivalries. Along the way they make terrible sacrifices, face impossible choices, and confront a devastating, life-changing secret, but through it all the two heroines of this astounding new novel hold fast to who they are—Shanghai girls.", "asin": "0812980530", "rank": "41188", "city": "Shanghai", "image": "https://images-na.ssl-images-amazon.com/images/I/51Zo0jwBe0L.jpg", "country": "China", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}