{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 18.4801972, "ratings": {"num_ratings": 12, "rating": 4.0, "reviews": [{"review_sentiment": 2.0, "review_text": "Superflourouscwritingband plot doesn't fully develop. Classical Cuban text."}, {"review_sentiment": 3.0, "review_text": "Runs out of steam after a few islands , armies, and deaths. Still quite readable."}, {"review_sentiment": 5.0, "review_text": "Delicious prose. Carpentier's expansive passages are so ripe with word wizardy that sometimes I have to stop and just absorb what has been written before continuing. It's that good.He's a musicologist, and his writing almost, at times, feels like composed music in its perpetual rhythm unlike any piece of writing I've ever read in the English language.Beautiful. Just Beautiful. I wonder how amazing this book must have been in Spanish if it's this good in English.Read this if you are interested in the history of the Caribbean.Read this if you love prose as beautiful as a fine cup of tea."}, {"review_sentiment": 5.0, "review_text": "A work of genius, by the Creator of Magical Realism, even García Márquez acknowledged his influence."}, {"review_sentiment": 5.0, "review_text": "When you meet the beautiful Cuban heroin of this beautifully written saga, she seems like the kind of heiress who will be quickly married off to landed gentry. Instead she is swept into the revolutionary currents of the Caribbean in the time of slavery, and into the arms of a real-life historical figure who was an 18th century Robespierre of the Caribbean. His sense of destiny and sexual charisma appeal to her existentialism, though his egotism becomes tiresome, and his endless embrace of conflict begins to seem more manic and less rational as time wears on. Some of the things he says bear a strange resemblance to some of the utterings of Cuban revolutionary Fidel Castro, who ruled Cuba at the time this novel was published, to great acclaim, in 1962. So it's fun to try to parse exactly what was on the late Carpentier's mind as he wrote this smart swashbuckling adventure, which will help the reader to understand the history of the Caribbean at a time when the slaves were being freed."}, {"review_sentiment": 5.0, "review_text": "Easily one of the most exciting adventure stories, right up there with Treasure Island or Moby Dick, except with actually more adventure and short treatises on philosophy, art, literature, and politics! Alejo Carpentier is an unfairly forgotten author that more readers should pay attention to in the English-speaking world."}, {"review_sentiment": 5.0, "review_text": "Explosion in a Cathedral (El siglo de las luces, in Spanish), by Alejo Carpentier is a great novel. This work requires a careful and close reading, both because of Carpentier's erudition and because it demands also that we read it in relation to the works of art that form part of the narrative. In fact, the title given to this novel in English is that of the French title of a painting by Monsú Desiderio (born François Nomé), \"Explosion dans une église\" (1617-31). In addition, two paintings by Goya, \"Dos de Mayo de 1808\" and \"Tres de mayo de 1808\" (1814), plus the titles of thirteen etchings from his series \"Disaters of War\" (\"Los desastres de la guerra,\" 1863), which serve as subtitles in the novel, allow us to visualize the excess, drama, and apocalyptic theme that is central in this tale by Carpentier. Fused together with the text, these works of art (as well as the references made, for example, to William Hogarth's \"The Rake Progres,\" Cellini's sculpture \"Perseus,\" and Paolo Uccello's horses, etc.) further articulate and mirror the text's own commentary on the Century of Enlightenment. Through both the visual and the verbal Carpentier establishes a parallelism in terms of an aesthetic contrast between darkness and light, the socio-cultural and historical milieu of the Baroque period, and the documentation of chaos, human tragedy, and revolutionary ideals during the so-called \"El siglo de las luces\".The painting by Nomé, that of a great cathedral soon be reduced to a stockpile of nothingness, of scattered ruins that are already beginning to appear on the lower right corner of the picture, alludes to the religious and to the moral universe, to the transcendental and the immanent, to the sacred and the profane. But above all, it is a reference to the collapsing, whether by God or a cosmic explosion, of one of the symbols of civilization and one of humanity's greatest monuments to God. While the works of Goya, certainly haunted by the spirit of an ailing society, help the novel to illustrate the relationship between victims and victimizers and, as we read at the end of the novel, as a visual document of the cruelty that resulted from the French invasion of Spain. In other words, the importance of these works of art becomes clear if we take in consideration that not only these images are a major component in the meaning conveyed by the text but also an essential part of our reading."}, {"review_sentiment": 5.0, "review_text": "This is one of the best novels in the world. Maybe there are some muddy patches in the English-language edition, which is a translation of a French translation, but I think on the whole it transmits the amazingly rich prose of Carpentier, for whom language, history, life itself are all one music.The overt theme is the French Revolution, though mostly as viewed from France's colonies in the New World. The buried theme is gnosticism, the conviction that things could be different, could be better, that common reality is a sort of veil hiding what we might make of it if we only woke up. The Revolution at first feels like that gnostic awakening, and Carpentier captures that sense of possibility more beautifully than even Wordsworth.In many ways this novel parallels Calvino's Baron in the Trees; in others, Shelley's epic poem The Revolt of Islam (titled Laon and Cythna in its uncensored version). More essentially, it's like coming into your own in your late teens, seeing how wrong the so-called grownups have let things become, knowing it's for you and those like you to claim and remake life itself - then suffering every horrible, painful, perhaps inevitable setback one would expect such a project to run into on such an Earth. Carpentier shows people whose souls curdle, under this reverse wave. But he shows others who don't, lost selves we might even yet, even now, step into.Perhaps selves high alive in Wisconsin, in Libya as I write this."}, {"review_sentiment": 5.0, "review_text": "This review was originally written and posted on my blog at antarcticiana dot blogspot dot com, hence the introduction written from and about Cartagena de Indias. I've posted it here because I consider this a major novel of the 20th century, at least as far as Caribbean literature is concerned.When you've worked at making a revolution, it's difficult to go back to what you did before. --Explosion in a CathedralThe people of Cartagena de Indias, perhaps the most spectacular ancient city in the Americas, proudly describe themselves as Caribbean. In contrast, those from the interior, from the chilly, moist highlands of Bogotá, are called cachacos, a term that carries a pale tinge of disparagement. The cachacos are forever outsiders on this coast, where one often has the sense that to be Caribbean is appreciated as more vital than any notion of national pride. Particularly with the Colombian football team in a long, profound slump. Outside of Colombia, few would place Cartagena on a list of the top ten or even twenty-five Caribbean destinations, but Cartageneros are steeped in their own history; the sixteenth century fortifications, the city wall, and the massive castillo dominate the landscape and the psychology of the town, whose people seem not to have forgotten an era when Havana, Port au Prince, New Orleans and Veracruz were connected to it via a constant web of commerce and shipping.It is a fitting place to read Explosion in a Cathedral, Alejo Carpentier's epic novel, set in some of the farthest corners of the Caribbean basin, in once glorious and gloriously rich cities like Point-a-Pitre, Cayenne, and Paramaribo, places most people today will be hard-pressed to put a country to. Carpentier is one of Cuba's greatest novelists, but I fear I would have been unlikely to read this dense chronicle about the Caribbean aftermath of the French Revolution if it hadn't been for the recommendation of another, Leonardo Padura Fuentes. I've written about Padura Fuentes before; he is a writer whose work and opinions I respect immensely. Googling revealed a 2004 \"ten best\" list of Cuban novels he created for the Guardian. Explosion in a Cathedral came in at number one. \"(T)he theme,\" Padura Fuentes wrote, \"is the tragic destiny that awaits all revolutions: the failure of their grand aims and the perversion of their beautiful ideals.\" This is a loaded observation coming from a Havana writer whose work is characterized by a volatile blend of love for his city with disdain for the entrenchment of petty bureaucracy and the more ridiculous castigations of contemporary life there. Given that he also called the book \"the perfect fiction and supreme expression of stylistic and conceptual ambition in narrative prose,\" I promptly ordered a battered ex-library copy.The novel tells the story of Victor Hugues, a little-known Jacobin who maneuvered first to bring the French revolution to the Antillean colonies and then struggled to maintain his power in the face of shifting allegiances back in Paris. Born a baker, he traded in his rolling pin for a guillotine and became a butcher. When we meet him, however, he is a merchant, with interests in Port au Prince and Havana. He has just burst into the young and naive household of three bereaved relatives, a brother and sister, Carlos and Sophia, and their cousin Esteban. He easily insinuates himself into their lives, and ultimately his starry-eyed discourse and brash charisma will seduce two of them. Esteban succumbs philosophically, Sophia more traditionally.Carpentier conjures up a compelling image of the stasis of life in Havana in the pre-information colonial age. It is a place where the veneer of civility is warped by slavery, ripe for the exportation of the equalizing fire of the French Revolution: \"because people here seemed to be asleep, inert, living in a timeless marginal world, suspended between tobacco and sugar.\" His initial description of the city serves as the metaphorical template for Hugue's descent from infectious idealism into violent pragmatism: \"Strangers praised the town's color and gaiety after spending three days visiting its dance halls, saloons, taverns and gambling dens, where innumerable orchestras incited sailors to spend their money, and set the women's hips swaying. But those who had to put up with the place the whole year round knew about the mud and the dust, and how the saltpetre turned the door-knockers green, ate away the iron-work, made silver sweat, brought mildew out on old engravings, and permanently blurred and misted the glass on drawings and etchings, already curling up with damp.\" Carpentier makes great use of this formal device throughout the novel, foreshadowing the action with ominous sentences ostensibly unrelated to the trajectories of the characters. On the imminent threat of a hurricane, to which Hugue's response will elevate him as a kind of savior of the household: \"Those who lived on the island accepted the cyclone as a dreadful meteorological reality, which ultimately none of them would escape.\"When the Spanish colonial authorities set out to purge Cuba of revolutionary thought, the strange family foursome is broken apart. Carlos tends to business in Havana, and Esteban and Sophia accompany Hugues as he flees to the south coast and Santiago de Cuba with his fellow progressive, the mulatto vodou doctor Ogé. The Caribbean is in an uproar. Rumor has it that Haiti's slaves are rising up; the fearsome black revolt has begun. Sophia remains in Santiago for safety; Hugues, Ogé and Esteban sail across the channel to find Port-au-Prince in flames. There is no going back to Cuba, and no staying in Haiti; suddenly Esteban, who is really the tortured hero of this book, finds himself in Paris, swept up in events much larger than himself.Soon, he is diminished. Just one of the innumerable minor satellites orbiting Hugues' rising star as the conquering revolutionary exports the new France back to Guadeloupe, he will bear witness to the all corrupting influence of power as it rots away at his former mentor's ideals. Before long, the guillotine blade is dropping onto the necks of Hugues' enemies with disturbing frequency. Esteban follows Hugues to the next killing fields, the malarial Guyane, not because he wants to, but because he has become a virtual prisoner. When finally he manages to escape and return to Havana Carpentier introduces his grandest and most daring metaphor. Sophia, recently made a young widower and still in thrall to Hugues, years after a fleeting seduction in Santiago, abandons the reunited family to go and join him. Most writers would end their novel with the happy family reunion, but for Carpentier history is bound to repeat itself, and now it is Sophia, as mistress to the iron-fisted ruler, who will suffer disillusionment and witness the latter stages of Hugue's downward spiral into tyranny. In this novel there is no escaping the virulent fever of power and influence.Padura Fuentes is by no means suggesting that guillotines are falling in Cuba today, but merely by suggesting that we read this novel now he continues his measured, thoughtful, and literary critique of the Cuba he sees out the windows of his home in Havana, fifty years on from another revolution. Here, too, there seems to be some Caribbean common ground."}, {"review_sentiment": 4.0, "review_text": "I just finished reading this amazing book, set in the time of the French Revolution and its aftermath, covering a period from the early 1790s until well into the first decade of the 19th century.  Its settings move from Cuba to what is now the Dominican Republic, Haiti, France, Guadalupe, Cuba again, Venezuela, Barbados, French Guiana, Suriname, and finally Spain.  It provides a panoramic view of the history of the Caribbean during this time period, and in this respect it is as informative as a history book.The book revolves around three central characters: two wealthy orphaned cousins, Sofia and Esteban, and a roguish soldier of fortune, Victor Hugues, who was an actual historical figure.  When we first meet Esteban and Sofia they are just emerging from adolescence, and they age and mature through a variety of experiences until they are well into adulthood.  Victor Hugues is portrayed as a totally unscrupulous opportunist who will change his \"principles\" in a heartbeat, depending on who he may be working for. There are numerous plots twists, making it a moving human drama as well as a fascinating historic chronicle.  In this respect the book reminded me of \"War and Peace,\" although in was nowhere near as comprehensive.So why not 5 Stars?  Simply because the book was, at least to me, somewhat difficult to read.  I don't know whether the responsibility for this falls on the author or the translator, but I often found the prose dense, especially when the author was involved in descriptions, whether of houses, jungles, or the action of the sea; some of these descriptions went on for pages and pages.  Although dense, however, the prose never reaches the level of impenetrability.  What I found especially irritating, however, is that throughout the novel there are passages of untranslated French and Spanish, which I had to go to the trouble of translating for myself as best I could.  This translation, by the way, is a translation of the French edition which was translated from the original Spanish.  Why not commission someone to translate directly from the original Spanish?  Go figure.  All that aside, this book is an excellent read that I highly recommend."}]}, "authors": ["Alejo Carpentier"], "isbn": "081663808X", "longitude": -69.942111, "periods": ["1700s", "1800s"], "title": "Explosion in a Cathedral", "word_cloud": "plot fully classical text steam islands army death still quite readable prose expansive passage ripe word wizard sometimes stop absorb write continue musicologist write almost time feel composed music perpetual rhythm piece writing ever wonder amaze good interested history love prose beautiful fine cup tea work genius even acknowledge influence meet beautiful heroin beautifully write saga seem kind heiress quickly marry landed gentry instead sweep revolutionary current caribbean time slavery arm historical figure century sense destiny sexual charisma appeal existentialism egotism become tiresome endless embrace conflict begin seem manic le rational time wear thing say bear strange resemblance uttering revolutionary rule time publish great acclaim fun try parse exactly late mind write smart swashbuckling adventure help history time slave free easily exciting adventure story right actually adventure short treatise philosophy art literature politics unfairly forget author reader pay attention world silo clue spanish great work require careful close read erudition demand also relation work art form part narrative fact title give title paint bear sand rune église addition painting title thirteen etching series desastres serve subtitle allow excess drama apocalyptic theme central tale fuse together text work art well reference make example sculpture horse articulate mirror text commentary visual verbal establishes parallelism term aesthetic contrast darkness light historical milieu period documentation chaos human tragedy revolutionary ideal silo clue paint great soon reduce stockpile nothingness scatter ruin already begin lower right corner picture allude religious moral universe transcendental immanent sacred profane reference collapse cosmic symbols civilization humanity greatest monument work certainly haunt spirit ail society help relationship victim victimizes end visual document cruelty result french invasion word importance work art become clear consideration image major component mean convey text also essential part reading best novel world muddy patch edition translation french translation think whole transmits amazingly rich prose language history life overt theme french mostly view colony buried theme gnosticism conviction thing different common reality sort veil hiding wake first feel gnostic awaken capture sense possibility beautifully even many way parallel others epic poem title uncensored version more essentially come late teen see wrong grownup let thing know claim remake life suffering horrible painful perhaps inevitable setback project show people soul curdle reverse wave show others lose self even yet even self high alive write review originally write post blog antarcticiana dot blog spot dot com hence introduction write post consider major century least far caribbean literature work make revolution difficult back people perhaps spectacular ancient city proudly describe contrast interior chilly moist highland call cacao term carry pale tinge disparagement cacao forever outsider coast often sense appreciate vital notion national pride colombian football team long profound slump list top ten even destination steep history sixteenth century fortification city wall massive castillo dominate landscape psychology town people seem forget era au connect constant web commerce fit place epic set farthest corner basin glorious gloriously rich city place people today put country greatest novelist fear unlikely chronicle aftermath french recommendation write writer work opinion respect immensely google reveal ten best list novel create guardian come number theme write tragic destiny awaits revolution failure grand aim perversion beautiful ideal loaded observation come writer work characterize volatile blend love city disdain entrenchment petty bureaucracy ridiculous castigation contemporary life also call perfect fiction supreme expression stylistic conceptual ambition narrative prose promptly order battered tell story maneuver first bring french revolution colony struggle maintain power face shift allegiance back baker trade roll pin guillotine become butcher meet however merchant interest au burst young naive household bereave relative brother sister cousin easily insinuate life ultimately discourse brash charisma seduce succumbs philosophically conjure compelling image stasis life colonial age place veneer civility warp slavery ripe exportation equalize fire french people seem asleep inert live timeless marginal world suspend tobacco sugar initial description city serve metaphorical template descent infectious idealism violent pragmatism stranger praise town color gaiety spending day visit dance hall saloon tavern gamble den innumerable orchestra incite sailor spend money set woman hip sway put place whole year round know mud dust saltpeter turn green ate away make silver sweat bring mildew old engraving permanently blur misted glass drawing etching already curl damp make great use formal device foreshadow action ominous sentence ostensibly unrelated trajectory character imminent threat hurricane response elevate kind savior household live island accept cyclone dreadful meteorological reality ultimately none spanish colonial authority set purge revolutionary think strange family foursome break apart tend business accompany flee south coast fellow progressive mulatto voodoo doctor uproar slave rise fearsome black revolt begin remain safety sail channel find flame go back stay suddenly really torture hero find sweep event much larger diminish innumerable minor satellite orbit rise star conquer revolutionary export new back bear witness corrupt influence power away former mentor ideal long guillotine blade drop neck enemy disturb frequency follow next killing field malarial want become virtual prisoner finally manage escape return introduce grandest dare metaphor recently make young widower still thrall year fleet seduction abandon reunite family join most writer happy family reunion history bound repeat mistress ruler suffer disillusionment witness latter stage downward spiral tyranny escape virulent fever power mean suggest guillotine fall today merely suggest continue measure thoughtful literary critique see windows home fifty year revolution here seem caribbean common ground finish read amaze set time french aftermath cover period early well first decade century setting move finally provide panoramic view history time period respect informative history revolves central character wealthy orphan cousin roguish soldier fortune actual historical figure first meet emerge adolescence age mature variety experience well adulthood portray totally unscrupulous opportunist change principles heartbeat depend work numerous plot twist make move human drama well fascinate historic chronicle respect remind nowhere least somewhat difficult know responsibility fall author translator often find prose dense especially author involved description house jungle action sea description go page page dense however prose never reach level impenetrability find especially irritate however passage untranslated french spanish go trouble translate best translation way translation french edition translate original commission someone translate directly original figure aside excellent highly recommend", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A swashbuckling tale set in the Caribbean at the time of the French Revolution, Explosion in a Cathedral focuses on Victor Hugues, a historical figure who led the naval assault to take back the island of Guadeloupe from the English at the beginning of the nineteenth century. \r\n\r\nIn Carpentier's telling, this piratical character walks into the lives of the wealthy orphans Esteban and Sofia and casts them abruptly into the midst of the immense changes sweeping the world outside their Havana mansion.\r\n\r\n\"Built around the exciting and timely theme of revolutionary-turned-tyrant. A tour de force.\" New York Times Book Review\r\n\r\n\"Woven into the story is a complete history and geography of the Caribbean.\" Times Literary Supplement\r\n", "asin": "081663808X", "rank": "494757", "city": "Santo Domingo", "image": "https://images-na.ssl-images-amazon.com/images/I/41122DDXGHL.jpg", "country": "D.R.", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}