{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": -26.205, "ratings": {"num_ratings": 12, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "I enjoyed this book because it reminded me of the spirit of South Africa. It provides a fly on the wall depiction of post apartheid hillbrow by following the lives of several everyday characters."}, {"review_sentiment": 3.0, "review_text": "read it and find out"}, {"review_sentiment": 4.0, "review_text": "When watching films made in other countries, and, hopefully, film cultures different from that we have, nebbich, in the United States, I feel that I've spent my time well if I learned something about those cultures, general and artistic, even if the work in question was not much to my liking.\"Welcome to our Hillbrow\" was a book that fell into this zone that I usually reserve for movies. It's a short book, but I was rather glad to have done with it. The nexus of the plot was the complex of romance and sexual relationships, a situation that more often than not I find less than entrancing. However, given that AIDS is a major factor in the novel, it was understandable that the author would see fit to do this.The book's aspect of excellence is, in my view, the picture it gives of (nearly) contemporary South Africa. Hillbrow is a section of Johannesburg (Joberg, which has become Jozi) that was once a genteel neighborhood, became nonconformist and finally rough. Very rough: it is the crime center of Jozi, which has in turn become the southern pole of Africa's economy, drawing migrants from all over sub-Saharan Africa, Nigeria, Zimbabwe, Kenya, and elsewhere. So the migration that has been characteristic of South Africa for more than a lifetime has changed; it was earlier characterized by long term European migration, the ancient Bantu migration, and, latterly, the movement of villagers from black South Africa to work menial jobs for whites. Now it is a global-economy migratory culture, specializing in Africa, which is a rough place.The natives don't like it. \"Natives\" means black South Africans. Whites scarcely figure at all in this novel, except when one of the protagonists goes to Oxford. A large part of the problematic in this book is the African migration to Jozi, and the natives' not altogether justifiable dislike of it. Not justifiable because they apply moral values that are not instanced by black South Africans either. The South African village has been decaying for a long time, and has tended to retain not its ancient virtues, but its ancient vices, among them most notably intense envy and belief in witchcraft. The young protagonists, doing the best they can to fit into the modern world as academics, remain tied to their ancestral villages by these old vices.There is a certain magical realism element in the novel, in that first protagonist is dead, and is being addressed by an otherwise unidentified and unlocated individual. Moreover, discussions take place in heaven among the dead characters. An interesting device, but not completely successful, in my view.So, as I see it, \"Welcome to our Hillbrow\" didn't come off quite, novelistically, but it remained readable. Its virtue is that it depicts the state of despair in which a large part of the South African population lives. It seems that despair, and fear, are the concomitants of South African life."}, {"review_sentiment": 5.0, "review_text": "Excellent"}, {"review_sentiment": 5.0, "review_text": "It's an interesting book if one wants to examine the lives of Black South Africans living in a big city after the apartheid. Most of the the people in these neighborhoods have moved from countryside and live in a separate world from White South Africans. The unique thing about this book is that it doesn't deal with White vs Black issues, but its main focus is the attitude and prejudices of Black South Africans toward other Black South Africans and immigrants from other African countries. Interestingly, the rural people feel like Blacks in a city like Johannesburg are dirty, with low morals, and no good can come from associating with them. Their views on Immigrant African are even worse. The epidemic of AIDS is understood in the light of these views--it is believed that it was brought by Black African immigrants from countries like Nigeria."}, {"review_sentiment": 5.0, "review_text": "Mpe's novel is a sobering look at the intersections of social, political, cultural, and racial divides that characterize transitional South Africa. Setting himself apart from his predecessors, Mpe uses a palimpsestic narrative to critique his South African context and realities."}, {"review_sentiment": 5.0, "review_text": "I was assigned this book for a class on globalization, and I was not very excited to read it. However I was pleasantly surprised to find myself not just able to get through it, but actually enjoying it.Phaswane Mpe is a phenomenal writer, who developed deep, complex characters and truly embodied the state of mind that is xenophobia. The story he created will capture you and yourcuriosity of the unknown; and if you do know a lot about Africa and xenophobia, it will still pull you in with its relatability and a fantastic storyline.This book is thought provoking, engaging, sad, and at times, amusing.  For those smart enough to buy this...  Welcome to our Hillbrow..."}, {"review_sentiment": 5.0, "review_text": "a very good book. i love it"}, {"review_sentiment": 5.0, "review_text": "If you love literature in all it's forms, you must read this. It's one of the most beautiful books I've ever touched and truly unique in form. I don't know anyone who wouldn't benefit from reading it. I must have loaned my copy out 5 times already, and the response when I get it back is always the same: That was amazing.It's also a quick read, if you need that. But don't be surprised if you decide to read it again."}, {"review_sentiment": 5.0, "review_text": "This is a brief but brilliant portrait of life in the ghettos of Johannesburg where somehow life goes on, people fall in love, suffer, and some find sufficient happiness to survive."}]}, "authors": ["Phaswane Mpe"], "isbn": "0821419625", "longitude": 28.049722, "periods": ["2000s", "Recent Releases"], "title": "Welcome to Our Hillbrow: A Novel of Postapartheid South Africa", "word_cloud": "enjoy remind spirit provide fly wall depiction post apartheid hill brow follow life several everyday character watch film make country hopefully film culture different nebbich feel spend time well learn something culture general artistic even work question much liking fell usually reserve movie short rather glad do nexus plot complex romance sexual relationship situation often find le entrancing however give major factor understandable author fit aspect excellence view picture give nearly contemporary section neighborhood become nonconformist finally rough rough crime center turn become southern pole economy draw migrant elsewhere migration characteristic lifetime change earlier characterize long term european migration ancient migration latterly movement villager black work menial job white now migratory culture specialize rough native native mean black white scarcely figure protagonists go large part problematic migration natives altogether justifiable dislike not justifiable apply moral value instance black african village decay long time tend retain ancient virtue ancient vice notably intense envy belief witchcraft young protagonist best fit modern world academic remain tied ancestral village old certain magical realism element first protagonist dead address otherwise unidentified allocated individual moreover discussion take place heaven dead character interesting device completely successful see come quite novelistically remain readable virtue depicts state despair large part african population live seem despair fear concomitant african life excellent interest want examine life live big city apartheid most people neighborhood move countryside live separate world unique thing deal v issue main focus attitude prejudice immigrant african country interestingly rural people feel city dirty low moral good come associate view immigrant african even worse epidemic understood light view believe brought immigrant country sober look intersection social political cultural racial divide characterize transitional predecessor use palimpsest narrative critique context reality assign class globalization excite however pleasantly surprise able actually enjoy phenomenal writer develop deep complex character truly embodied state mind xenophobia story create capture your curiosity unknown know lot still pull reliability fantastic think provoke engage sad time amuse smart enough buy good love love literature form beautiful ever touch truly unique form know anyone reading loan copy time already response get back always also quick need surprise decide brief brilliant portrait life ghetto somehow life go people fall suffer sufficient happiness survive", "genres": ["Fiction & Literature"], "summary": " Welcome to Our Hillbrow is an exhilarating and disturbing ride through the chaotic and hyper-real zone of Hillbrow—microcosm of all that is contradictory, alluring, and painful in the post-apartheid South African psyche. \r\n\r\nEverything is there: the shattered dreams of youth, sexuality and its unpredictable costs, AIDS, xenophobia, suicide, the omnipotent violence that often cuts short the promise of young people’s lives, and the Africanist understanding of the life continuum that does not end with death but flows on into an ancestral realm. \r\n\r\nInfused with the rhythms of the inner-city pulse, this courageous novel is compelling in its honesty and its broad vision, which links Hillbrow, rural Tiragalong, and Oxford. It spills out the guts of Hillbrow—living with the same energy and intimate knowledge with which the Drum writers wrote Sophiatown into being.\r\n\r\n“In his 2001 novel, Welcome to Our Hillbrow, Mpe captured the dislocation and despair of people who moved in the late ’90s from rural South Africa to Hillbrow, a rough neighborhood in downtown Johannesburg with overcrowded high-rises and a large population of immigrants from elsewhere in Africa. In the South African literary imagination, Hillbrow has come to represent everything frightening and promising about the new South Africa; it is at once a scene of drugs, crime and xenophobia toward immigrants and also what theorists enthusiastically call ‘Afropolitan,’ a space that transcends national boundaries.” New York Times", "asin": "0821419625", "rank": "201811", "city": "Johannesburg", "image": "https://images-na.ssl-images-amazon.com/images/I/41-xkILI0kL.jpg", "country": "RSA", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}