{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 38.8949549, "ratings": {"num_ratings": 10, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "There's not to many books on this subject,so it was a treat to finally read about the history of Go-Go."}, {"review_sentiment": 5.0, "review_text": "It was an absolutely amazing read! Very informative!"}, {"review_sentiment": 5.0, "review_text": "Go-go Live is a must read for everyone living in the nation's capitol. A fly medley of go-go music, politics and the soul of a city in flux.Booked shipped quickly and was in great condition."}, {"review_sentiment": 1.0, "review_text": "I heard the author on a radio program and I wanted to learn more about go-go. I did not. she favored some bands and left out others. iam an avid reader and love books, but I did not like this one."}, {"review_sentiment": 5.0, "review_text": "I purchased it as a gift and he is truly a go-go fan.  It's a quick read.  Go-Go is here to stay."}, {"review_sentiment": 1.0, "review_text": "I came of age inside the Beltway in the mid-90s, so go-go was the pulse of my teenage years. People who aren't from there are generally shocked when I mention that all the radio played on Friday and Saturday nights was a form of music that they've never heard of. So I was excited to see a book that adds to the skimpy amount of critical literature on the heartbeat of DC.Too bad the book and its author are both total jokes. First off, this book is far more a collection of newspaper articles than a cohesive narrative. And they're not very good articles either, in terms of writing ability (bland) and content (preposterous). For example, she inexplicably spends a chapter in this already rather meager volume on religious go-go, which is probably not as important as, say, a sketchbook history of the genre. So she profiles an ex-stripper and pimp who run some bama go-go after they've found Jesus for two weeks, yet she seems oblivious to the existence of seminal figures like the Northeast Groovers and Junkyard Band, who get a couple of mentions in passing. I honestly don't think she's aware of anything iconic or seminal in the music itself. It's like hearing a middle-aged high school principal try to explain hip-hop culture or something.Which is probably the book's biggest flaw: Hopkinson doesn't really understand the music she proclaims to be protective of. She grew up in Indiana or someplace in cow country and had never heard of go-go until her freshman year at Howard (which even she admits is not a go-go hotspot for DC). Yet she chest-thumps protectively about go-go and DC as if she owns the place and is the gatekeeper of the music. In other words, she's a dilettante who understands neither the music nor the area. Someone who understands DC might have a less atavistic idea about cultural diversity. She discusses an unimportant controversy over Visionz Clothing, an Asian-owned outfitter selling garish t-shirts to go-go fans. Naturally, Visionz's black competitors stage a boycott, complete with race-baiting that Hopkinson reports on with a mindlessness that suggests she A) doesn't seem to notice that it amounts to simple racism and plays it objectively despite being firmly planted on her high horse about other topics; and B) doesn't seem to have noticed the gigantic Asian population that has lived in the DC area since 1980. Then again, Hopkinson doesn't seem to know that Virginia exists, since she has never lived there in the 45 minutes that she's lived in the Beltway. Why is she discussing a clothing controversy from 2004? Hmm. Good question. To fill pages? Because she has nothing else to say about a topic she doesn't know anything about?The same obliviousness mars her \"study\" of black DC in general. She crows about the \"Chocolate City\" and how it has been run by black people, yet any of the city's foibles are, of course, \"their\" fault - meaning the white people who don't actually run the city. It's a very atavistic take on representative democracy that makes me wonder if she's writing from a time warp in 1989. She peacocks about writing an angry column for the Washington Post about white people gentrifying \"her\" neighborhood (by the way my white grandparents and great-grandparents and great-great grandparents were living there in the 19th century, so slow your roll). In her world, it's outrageous that people move in and improve things so that it's safe to leave one's house at night. There aren't murders and drugs deals on every corner any more! Whatever will come to define black culture for Hopkinson? What a cynical view of an entire culture, if cleaning up one of the most dangerous cities in the country is seen as a return to some kind of plantation system.Again, if she had a passing understanding of DC, she might realize that the \"Chocolate City\" era was a relatively small period of time in a long history of an ever-changing city, really just the 60s through the 90s. Bemoaning the demise of the \"murder city\" days of DC is just as stupid as it would have been for my grandfather to bemoan the demise of the malarial Irish slums of the Swampoodle era in which he was born in Northeast. To me it would make more sense for my other grandfather to complain about the demise of the safe middle-class Northeast in which he was raised - I can imagine him driving past Cardozo High School and having a serious grievance about his alma mater turning into an open-air crack market.The nadir of the book, and the apotheosis of Hopkinson's Olympian, bama-level cluelessness, is her lengthy transcription (yes, it's a transcription of an interview, not actual writing) of a day spent with a pathetic loser wannabe drug kingpin from hicktown Maryland. Ron, a second generation PG County resident (this makes him an OG according to a transplanted fool like Hopkinson), is in his 30s, has a daughter, yet still lives with his mother when he's not cruising around town playing a 16-year-old's \"gangster\" fantasy of selling drugs and wasting space on the government teet of prison. Yet for Hopkinson, Ron is totally \"hilarious,\" probably because he's the only low-class black person who's ever been lame enough to hang out with her in her laughable attempts to slum it and appropriate DC culture before another academic does it first. Ron, what a hilarious guy. She meets him as he finishes a prison stint for a murder in which he was allegedly involved. Hopkinson notes with wide-eyed admiration, \"If Ron knew anything about who pulled the trigger that night, he never told me, and he never told authorities.\" Gee, what a stand-up guy. Mind, this is in a book in which the author quite reasonably shakes her head over senseless murders of teenagers on every other page. Oh but wait, those murders should be solved by white authorities, not by the people actually responsible for them, so Ron's just playing out his cultural role. Again, what a cynical joke.And don't get me started on Hopkinson's simple-minded economic theories. She praises the underground, tax-free drug economy and doesn't seem to understand that taxes pay for schools, social programs, and neighborhood improvement. Yet whose fault are the poor schools, social programs, and neighborhoods. I'll give you three guesses, and two don't count.The book is also filled with half-hearted, wet-blanket attempts at academic nonsense. She analyzes dances from a stupid sociological perspective about African traditions, as if it's supposed to be interesting or surprising. She makes the all-to-common error of thinking that black music is somehow unique for expressing what's happening in its culture in ways that don't get reported in the media. And you won't believe the nugget she uncovers from Chuck D of Public Enemy: apparently rap music is the \"CNN of black America\"! What stunning, extensive, mind-blowing research! It's that level of triteness that characterizes this entire poor excuse of a book.Go-go deserves both a competent critical study and a comprehensive narrative history. Hopkinson delivers neither. She should be banned from writing. And in the eyes of this tenth-generation Washingtonian, she should certainly be banned from writing about DC. To paraphrase Pleasure (a band Hopkinson likely has never heard of), don't put it in your pocket; don't lock it."}, {"review_sentiment": 4.0, "review_text": "I read it from the perspective of someone who was born in Washington, DC and who has lived in the area for most of my life.  Growing up here, it was easy to forget that I was a \"minority\" until I was out of the area.  GoGo music has its roots in Afrika, of course, but was invented by the late, great Chuck Brown and it remains a local treasure.  As the author pointed out, the gentrification of DC is leading to the music being marginalized and pushed into Ward 9, and we probably won't fully realize its impact until it's nearly disappeared, like the blues, jazz and other art forms created by us for us."}, {"review_sentiment": 4.0, "review_text": "I loved the book but I honestly can't imagine anyone outside of Washington, D.C. or not having any familiarity with D.C. feeling the same way.  I really liked the quotes at the beginning from Duke Ellington's perspective. It shows a historical viewpoint of the city, which helps readers understand the cliquish behavior of the present Washingtonians but it is also a great introduction to the book. The part about visions being Asian owned came as a shock to me and I'm glad that was in the book as well. I also appreciated the justification of the negative acts surrounding go-go, although the part about the dippas was a little bit of reach to me. Something's about the go-go can't be excused. Still, it was written by someone who isn't from D.C. and I don't feel any biases coming from the author. She really did her research and it's great reading about my city and its music from a non-Washingtonians perspective. Anyone from D.C. especially those who frequented the go-go scene would love this book. Plus because I am a 26, I learned thing about the go-go experience and the real D.C. from the 90's I never knew.Great gift. Even if the person isn't an avid reader, reading about this can surely bring back some memories and create appreciation. Long live old dc!"}, {"review_sentiment": 5.0, "review_text": "Really gives a good historical perspective of the old \"chocolate city\". I would highly recommend.  Enjoyed the photos as well."}, {"review_sentiment": 4.0, "review_text": "I learned of this book while listening to a radio interview with the author, Natalie Hopkinson, soon after the death of Chuck Brown.  I was especially excited to hear that Ms. Hopkinson is a fellow Howard Univ. graduate.  I was exposed to go-go music while a student at Howard Univ. during the early 1980's through a housemate who was a DC native.  I ordered two copies of this book before it was released - one for myself and one for my college friend, John G.  It was John G (his go-go name) who took me to go-go clubs to see and hear Rare Essence, Trouble Funk and Redds and the Boys.  It was at one of those go-go parties that John G arranged for my name to be shouted out by the lead talker who I can still hear say \"I'm gonna pull out the spotlight y'all.  Gonna put Big D on display.\"  With my personal experiences and appreciation for go-go, I impatiently waited for the book(s) to arrive.The book finally arrived and I started reading expecting that the book would in some way chronicle my own go-go experiences.  It did not take long to determine that the book is less about go-go and more about the idea that DC is dying or dead as a Chocolate City.  While go-go is certainly DC and DC is not DC without go-go, I was not convinced of a link between go-go and the so-called death of the Chocolate City DC.There are numerous references to ethnographic and sociological studies and theories and, in places, this book reads like one of them.  That DC, or black DC, had/has its own (sub)culture, complete with its own form of music, was obvious to many Howard Univ. students, especially those who lived off-campus in the neighborhoods of DC.  With respect to its go-go music tradition, DC is a sort of Galapagos.While references to Juergen Habermas's theories about the public sphere are interesting, as a former DC resident, a musician and someone who enjoys old-school go-go music, I wanted to hear more about the music itself.  It would be interesting to know how the music for the songs is constructed, the composition of a go-go band, how instruments, in addition to drums, are used, what makes a good go-go musician, and the evolution of go-go music since the mid-1970's.  Instead, the author recounts interviews with several individuals who each comment authoritatively, but almost exclusively, on the business created by go-go music and on the people who promote and consume it.I enjoyed the book in large part because I spent years living in DC and had my own personal go-go experiences.  I'm interested to know whether my friend John G, who has lived his entire life within the gravitational pull of go-go, will find the book interesting.  I hope he does and I look forward to having a discussion with him about it.Thanks to the author for her efforts to preserve the unique genre of music that is go-go.  I appreciate how difficult it is to describe art, especially music, with words."}]}, "authors": ["Natalie Hopkinson"], "isbn": "0822352117", "longitude": -77.0366456, "periods": ["1900s", "Recent Releases"], "title": "Go-Go Live: The Musical Life and Death of a Chocolate City", "word_cloud": "many subject treat finally history absolutely amaze very informative live everyone live nation capitol fly medley music politics soul ship quickly great condition hear author radio program want learn favor band leave others aim avid love like purchase gift truly fan quick stay come age inside pulse teenage year generally shock mention radio play night form music never hear excite see add skimpy amount critical literature heartbeat bad author total joke far collection newspaper article cohesive narrative good article term write ability bland content preposterous example inexplicably spend chapter already rather meager volume religious probably important say sketchbook history genre profile pimp baa find week yet seem oblivious existence seminal figure couple mention pass honestly think aware anything iconic seminal music hear high school principal try explain culture probably biggest flaw really understand music proclaims protective grow someplace cow country never hear freshman year even admit potshot protectively own place gatekeeper music word dilettante understands music area understand le atavistic idea cultural diversity discuss unimportant controversy outfitter sell garish fan naturally black competitor stage boycott complete report mindlessness suggest seem notice amount simple racism play objectively firmly plant high horse topic seem notice gigantic asian population live area then seem know exist never live minute live discuss clothing controversy question page nothing else say topic know anything obliviousness mar study black general crow black people yet foible course fault mean white people actually run atavistic representative democracy make write time warp peacocks write angry column white people gentrify neighborhood way white grandparent grandparent live century slow roll world outrageous people move thing safe leave house night murder drug deal corner come define black culture cynical view entire culture clean dangerous city country see return kind plantation pass understanding era relatively small period time long history really demise murder day stupid bemoan demise malarial slum era bear sense grandfather complain demise safe raise imagine drive serious grievance lama mater turn crack nadir apotheosis cluelessness lengthy transcription yes transcription interview actual writing day spend pathetic loser wannabe drug kingpin hick town second generation resident make accord transplanted fool daughter yet still live mother cruise town playing gangster fantasy sell drug waste space government tit prison totally hilarious probably black person ever lame enough hang laughable attempt slum appropriate culture academic first hilarious guy meet finish prison stint murder allegedly involved note admiration know anything pulled trigger night never tell never tell authority guy author quite reasonably shake head senseless murder teenager page wait murder solve white authority people actually responsible play cultural role cynical get start economic theory praise underground drug economy seem understand tax pay school social program neighborhood improvement yet fault poor school social program neighborhood give guess also fill attempt academic nonsense analyze dance stupid sociological perspective african tradition suppose interest surprising make error think black music somehow unique express happen culture way get report medium nugget uncovers apparently rap music black stun extensive research level triteness characterizes entire poor excuse deserve competent critical study comprehensive narrative history deliver ban write eye washingtonian certainly ban write band likely never hear put pocket lock perspective someone bear live area grow easy forget minority area music root course invent late great remain local treasure author point gentrification lead music marginalize push probably fully impact nearly disappear blue jazz art form create love honestly anyone familiarity feel way really like quote begin perspective show historical viewpoint help reader understand cliquish behavior present also great introduction part vision asian own come shock glad well also appreciate justification negative act surround part dip pas little bit reach something excuse still write someone feel bias come author really research great read music perspective especially frequent scene learn thing experience real never gift person avid read surely bring memory create appreciation live old dc really give good historical perspective old highly photo well learn listen radio interview author soon especially excite hear fellow graduate expose music student early housemate native order copy release college friend name take club see hear party arrange name shouted lead talker still hear say hon spotlight display personal experience appreciation impatiently wait finally arrive start read expect way chronicle experience long determine le idea die dead certainly convince link numerous reference ethnographic sociological study theory place read black sub culture complete form music obvious many student especially live neighborhood respect music tradition sort reference theories public sphere interest former resident musician someone enjoy music want hear music know music song construct composition band instrument addition drum use make good musician evolution music instead author recount interview several individual comment authoritatively almost exclusively business create music people promote consume enjoy large part spend year live personal experience interest know friend live entire gravitational pull find interesting hope look forward discussion author effort preserve unique genre music appreciate difficult describe art especially music word", "genres": ["History", "Music", "Pop Culture"], "summary": "Go-go is the conga drum–inflected black popular music that emerged in Washington, D.C., during the 1970s. The guitarist Chuck Brown, the \"Godfather of Go-Go,\" created the music by mixing sounds borrowed from church and the blues with the funk and flavor that he picked up playing for a local Latino band. \r\n\r\nBorn in the inner city, amid the charred ruins of the 1968 race riots, go-go generated a distinct culture and an economy of independent, almost exclusively black-owned businesses that sold tickets to shows and recordings of live go-gos. At the peak of its popularity, in the 1980s, go-go could be heard around the capital every night of the week, on college campuses and in crumbling historic theaters, hole-in-the-wall nightclubs, backyards, and city parks.\r\n\r\nGo-Go Live is a social history of black Washington told through its go-go music and culture. Encompassing dance moves, nightclubs, and fashion, as well as the voices of artists, fans, business owners, and politicians, Natalie Hopkinson's Washington-based narrative reflects the broader history of race in urban America in the second half of the twentieth century and the early twenty-first. In the 1990s, the middle class that had left the city for the suburbs in the postwar years began to return. Gentrification drove up property values and pushed go-go into D.C.'s suburbs. \r\n\r\nThe Chocolate City is in decline, but its heart, D.C.'s distinctive go-go musical culture, continues to beat. On any given night, there's live go-go in the D.C. metro area.\r\n\r\n\"Go-Go Live is a terrific and important piece of work. Music, race, and the city are three key pivot points of our society, and Natalie Hopkinson pulls them together in a unique and powerful way. I have long adored Washington, D.C.'s go-go music. This book helped me understand the history of the city and the ways that it reflects the whole experience of race and culture in our society. It puts music front and center in the analysis of our urban experience, something which has been too long in coming.\" Richard Florida", "asin": "0822352117", "rank": "1141447", "city": "Washington D.C.", "image": "https://images-na.ssl-images-amazon.com/images/I/51xliJoVaJL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}