{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": -4.3217055, "ratings": {"num_ratings": 49, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Great!"}, {"review_sentiment": 5.0, "review_text": "A powerful drama that wanted to be read!"}, {"review_sentiment": 5.0, "review_text": "Thanks"}, {"review_sentiment": 5.0, "review_text": "Great condition and very good for use in class!"}, {"review_sentiment": 3.0, "review_text": "Good textbook."}, {"review_sentiment": 5.0, "review_text": "Saw this play--transfixing; powerful."}, {"review_sentiment": 5.0, "review_text": "I love this story."}, {"review_sentiment": 3.0, "review_text": "School project"}, {"review_sentiment": 5.0, "review_text": "Eye opening. Definitely worth reading!"}, {"review_sentiment": 2.0, "review_text": "Could it be any more depressing? I realize it is important that everyone know the horrors that are happening in the world today. But in this play even the positive things that could have happened are stopped by circumstance."}]}, "authors": ["Lynn Nottage"], "isbn": "0822223902", "longitude": 15.3125974, "periods": ["1900s", "Recent Releases"], "title": "Ruined - Acting Edition", "word_cloud": "great powerful drama want thanks great condition good use class good textbook play transfix powerful love story project open definitely worth reading realize important everyone know horror happen world today even positive thing stop circumstance", "genres": ["Drama"], "summary": "Winner of the 2009 Pulitzer Prize for Drama\r\n\r\nA rain forest bar and brothel in the brutally war-torn Congo is the setting for Lynn Nottage’s extraordinary new play. The establishment’s shrewd matriarch, Mama Nadi, keeps peace between customers from both sides of the civil war, as government soldiers and rebel forces alike choose from her inventory of women, many already “ruined” by rape and torture when they were pressed into prostitution. Inspired by interviews she conducted in Africa with Congo refugees, Nottage has crafted an engrossing and uncommonly human story with humor and song served alongside its postcolonial and feminist politics in the rich theatrical tradition of Bertolt Brecht’s Mother Courage.\r\n\r\n“An intense and gripping new drama . . . the kind of new play we desperately need: well-informed and unafraid of the world’s brutalities. Nottage is one of our finest playwrights, a smart, empathetic and daring storyteller who tells a story an audience won’t expect.” Time Out New York", "asin": "0822223902", "rank": "395862", "city": "Kinshasa", "image": "https://images-na.ssl-images-amazon.com/images/I/41WAGdloJ5L.jpg", "country": "DR Congo", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}