{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 24.5895489, "ratings": {"num_ratings": 11, "rating": 3.6, "reviews": [{"review_sentiment": 4.0, "review_text": "A little dry"}, {"review_sentiment": 5.0, "review_text": "An informative, historical journey through Costa Rican culture.The different formats of content (poems, stories, etc.) gives you a holistic understanding of the culture without leaving you bored."}, {"review_sentiment": 1.0, "review_text": "More like a history review , dry n factual."}, {"review_sentiment": 5.0, "review_text": "Great introduction to Costa Rica for future traveler."}, {"review_sentiment": 2.0, "review_text": "A few good stories but not at all what I was hoping for"}, {"review_sentiment": 5.0, "review_text": "Beautiful book"}, {"review_sentiment": 3.0, "review_text": "Lots of information. A little hard to read."}, {"review_sentiment": 4.0, "review_text": "Good condition, very detailed."}, {"review_sentiment": 5.0, "review_text": "Rarely does an anthology of original documents of historical value mingled with insightful interpretative essays come together as a coherent work. Steven Palmer and Iván Molina, against those odds, have put the ball in the back of the net with just such a book.THE COSTA RICA READER'S three-part subtitle (`History, Culture, Politics') is honored along the way with an even touch. Everyone with an interest in Costa Rica as more than a tourist destination with great beaches will find between the covers of this recent collection the stuff that builds insight and understanding. This reviewer lived for sixteen years in 'tiquicia', together with its four million 'ticos', 'nicas', and assorted hangers-on. The West Virginia-sized patch of mountainous land with its sought-after beaches (I rarely found time to visit them) continues to maintain its grip on my soul. I wish this 2004 Duke University Press publication had been available about 1988. It would have rendered easier learning the lessons of tiquicia that had to come the hard, honest way.No matter, it's here now. The editors guide us through a nuanced qualification of `Costa Rican exceptionalism', finding in the tico experience--whether lived by the indigenous groups who were not quite so few and compliant as the national mythology suggests in the face of conquest and marginalization or by the 19th century coffee lords with their debt to German mercantilism or the 1980s Nicaraguan refugee whose task it is to decide with which of her divergent constituencies to identify herself--deep continuities with the rest of Latin American experience as well as a dollop of the country's celebrated idiosyncrasies.The seventy-odd pieces are brief, illuminating, and usually excerpted from something larger. Individually and as a collection, they leave the reader wanting more.Which is not unlike Costa Rica itself in the experience of many sojourners there, many of whom will never go back but who at the same time never manage entirely to leave.Read by this reviewer on a recent working week back in the land it so effectively describes, THE COSTA RICA READER would be highly recommended at twice the price."}, {"review_sentiment": 5.0, "review_text": "I love sociology. This is a great reader presenting different points of view of a complex society.  So you know a little about me to judge the (short) review...I've done immersion study in CR and am a master's level student in the us. US born.  Also over 40."}]}, "authors": null, "isbn": "0822333724", "longitude": -107.3920441, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases", "1500s"], "title": "The Costa Rica Reader: History, Culture, Politics", "word_cloud": "little dry informative historical journey rican different format content poem story etc give holistic understanding culture leave bore more history review dry n factual introduction future traveler good story hop beautiful information little hard good condition detail rarely anthology original document historical value mingle insightful interpretative essay come together coherent work odds put back net subtitle honor way even everyone interest tourist destination great beach find cover recent collection stuff build insight understand reviewer live sixteen year together assort patch mountainous land beach rarely find time visit continue maintain grip soul wish publication available easier learning lesson tiquicia hard honest matter editor guide nuanced qualification rican exceptionalism find tic experience live indigenous group quite compliant national mythology suggest face conquest marginalization century coffee lord debt german mercantilism refugee task decide divergent constituency identify deep continuity rest latin american experience well dollop country celebrate piece brief illuminate usually excerpt something larger collection leave want experience many sojourner many never go back time never entirely recent work week back land effectively describe highly twice price love sociology great present different point view complex society know little judge short review do immersion study master level student bear also", "genres": ["History", "Politics"], "summary": "Long characterized as an exceptional country within Latin America, Costa Rica has been hailed as a democratic oasis in a continent scorched by dictatorship and revolution; the ecological mecca of a biosphere laid waste by deforestation and urban blight; and an egalitarian, middle-class society blissfully immune to the violent class and racial conflicts that have haunted the region. Arguing that conceptions of Costa Rica as a happy anomaly downplay its rich heritage and diverse population, The Costa Rica Reader brings together texts and artwork that reveal the complexity of the country’s past and present. It characterizes Costa Rica as a site of alternatives and possibilities that undermine stereotypes about the region’s history and challenge the idea that current dilemmas facing Latin America are inevitable or insoluble.\r\n\r\nThis essential introduction to Costa Rica includes more than fifty texts related to the country’s history, culture, politics, and natural environment. Most of these newspaper accounts, histories, petitions, memoirs, poems, and essays are written by Costa Ricans. Many appear here in English for the first time. The authors are men and women, young and old, scholars, farmers, workers, and activists. The Costa Rica Reader presents a panoply of voices: eloquent working-class raconteurs from San José’s poorest barrios, English-speaking Afro-Antilleans of the Limón province, Nicaraguan immigrants, factory workers, dissident members of the intelligentsia, and indigenous people struggling to preserve their culture. \r\n\r\nWith more than forty images, the collection showcases sculptures, photographs, maps, cartoons, and fliers. From the time before the arrival of the Spanish, through the rise of the coffee plantations and the Civil War of 1948, up to participation in today’s globalized world, Costa Rica’s remarkable history comes alive. The Costa Rica Reader is a necessary resource for scholars, students, and travelers alike.", "asin": "0822333724", "rank": "75150", "city": "Costa Rica", "image": "https://images-na.ssl-images-amazon.com/images/I/41xawA4QcVL.jpg", "country": "Mexico", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}