{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 21.161829, "ratings": {"num_ratings": 4, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "Great book."}, {"review_sentiment": 4.0, "review_text": "Read it before a trip to Isla Holbox.  A good read."}, {"review_sentiment": 4.0, "review_text": "This book points out the vast differences between the native peoples of the Yucatan and the rest of the world.  Reads like a novel."}, {"review_sentiment": 5.0, "review_text": "I am a friend of the author, but I wouldn't read a book that didn't hold my interest and shed some light on the Yucatec Maya. This book did both.The 19th century Maya are every bit as fascinating as were their ancient ancestors and the million of so Maya who live today. Weren't aware of that? That's a shame because the Maya saga continues to unfold and Sullivan is a person who understands it intimately.An Irish-American hacienda owner is murdered at his remote plantation in northern Yucatan, not far from present-day Cancun.Sullivan knows how he was killed and who killed him, rebellious Maya who lived (and still live) in the region south of Cancun.But why was Stephens killed? This is the task Sullivan sets for himself. The intrigues, political and economic, are complex and twisted. They rise from the level of regional Yucatan squabbles right up to the United States' president, Ulysses Grant.Sullivan documents his information with care (his notes are good reading themselves), but this book reads like a thriller. To know something about the Maya and their history is to gain a better grasp of how people and their culture evolve. I recommend this book."}]}, "authors": ["Paul Sullivan"], "isbn": "0822959445", "longitude": -86.82505, "periods": ["1800s"], "title": "Xuxub Must Die: The Lost Histories of a Murder on the Yucatan", "word_cloud": "great read trip good point vast difference native people rest world friend author interest shed light century bit fascinating ancient ancestor live today aware shame saga continue unfold person understand hacienda owner murder remote plantation northern far know kill kill rebellious live still live region south kill task set intrigue political economic complex twist rise level regional squabble right president ulysses document information care note good reading read thriller something history gain better grasp people culture evolve recommend", "genres": ["History"], "summary": "Today, foreigners travel to the Yucatan for ruins, temples, and pyramids, white sand beaches and clear blue water. One hundred years ago, they went for cheap labor, an abundance of land, and the opportunity to make a fortune exporting cattle, henequen fiber, sugarcane, or rum. Sometimes they found death.\r\n\r\nIn 1875 an American plantation manager named Robert Stephens and a number of his workers were murdered by a band of Maya rebels. To this day, no one knows why. Was it the result of feuding between aristocratic families for greater power and wealth? Was it the foreseeable consequence of years of oppression and abuse of Maya plantation workers? Was a rebel leader seeking money and fame—or perhaps retribution for the loss of the woman he loved?\r\n\r\nFor whites, the events that took place at Xuxub, Stephens’s plantation, are virtually unknown, even though they engendered a diplomatic and legal dispute that vexed Mexican-U.S. relations for over six decades. The construction of \"official\" histories allowed the very name of Xuxub to die, much as the plantation itself was subsumed by the jungle. For the Maya, however, what happened at Xuxub is more than a story they pass down through generations—it is a defining moment in how they see themselves.\r\n\r\nSullivan masterfully weaves the intricately tangled threads of this story into a fascinating account of human accomplishments and failings, in which good and evil are never quite what they seem at first, and truth proves to be elusive. Xuxub Must Die seeks not only to fathom a mystery, but also to explore the nature of guilt, blame, and understanding.", "asin": "0822959445", "rank": "1381519", "city": "Cancun", "image": "https://images-na.ssl-images-amazon.com/images/I/51MFR4T3BSL.jpg", "country": "Mexico", "story_arc": ["Tragedy", "Things only get worse"]}