{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 18.4801972, "ratings": {"num_ratings": 12, "rating": 3.7, "reviews": [{"review_sentiment": 3.0, "review_text": "WOW, informative. Good info"}, {"review_sentiment": 5.0, "review_text": "WOW! Great Product, Great Price, Great Vendor = Great DEAL! I'm impressed! Thanks!"}, {"review_sentiment": 2.0, "review_text": "I'm torn about giving this book 2 stars. It's obviously well-researched by someone who's spent a lot of time thinking about the subject but it's not the story of Dictator Trujillo or the Dominican Republic or even a story at all -- there is no narrative. It's a book about policy written for policy wonks. It is not a coherent history, but rather an extensive thesis on how the different perceived goals of the military and state department interwoven with the personal biases of individuals create policy, using the Dominican Republic as a case study. It questions the perceived wisdom that propping up dictators and strong men in non-democratic nations at least create a framework of stability that benefits a country, if not the individuals within a country.Recommended as a sleep aid because it's the driest thing I've read in a year."}, {"review_sentiment": 4.0, "review_text": "This book is very informative on the history of my beloved country. Mr. Roorda did extensive research regarding the history of the Domincan Republic which makes it essential to fully understand the reasons behind my uncle's way of governing.  Americans still to this day need to better understand the way, the hispanic mind thinks, and the way we are! Once americans understand this, they will be better informed when they opiniate on latin american affairs.  When you research the past before my uncle, it becomes quite clear the reason that when you read into the inaffective governments before him, nothing was accomplished. How many weak Ceo's in American Corporations have been successful? My uncle built a country out of manure! clear and simple! Mr. Roorda has my compliments.It will provide a better understanding to Dominican history, for individuals who have a love of world history. Mr. Roorda states in the begining of the book, that my uncle made it difficult for American Companies to do business in the Dominican Republic, of course! his main concern was for the best interest of his country, period! so, Mr. Roorda, my compliments.Sincerely and Respectfully,Danilo Lynen Trujillo"}, {"review_sentiment": 5.0, "review_text": "No wonder this book has won so much praise in the history community!  Not your usual history book...  A must for students of Caribbean history, and an eye-opener for the rest of us.Highly recommended!"}, {"review_sentiment": 5.0, "review_text": "There are very few actually good readable books on the Caribbean islands.  There are even fewer books on the Dominican republic and Haiti.  The only books that come to mind besides this one are `Why the Cocks fight' by Wucker and `death of a dictator' by Diederich.  This book is a very good account of the early years of Trujillo and his relations with America.  Trujillo is best remembered for the massacre of the Haitians, immigrants who had invaded his country.  Other topics are covered in detail including the Jewish refugees, WWII and FDR interest in the Caribbean.  An essential history of American involvement and the history of this important country."}, {"review_sentiment": 3.0, "review_text": "This book approaches a topic which deserves serious attention by scholars of international relations - much more than is happening.  It approaches this topic from an interesting and rather revisionist point of view, offering the author's views and some interpretations.  Yet, the study is not so subjective, and not at all substantiated by facts.  All in all interesting reading, new views to talk and argue about, but nothing really new or inspiring."}, {"review_sentiment": 5.0, "review_text": "Eric Paul Roorda's book is a very interesting study in how well-intentioned U.S. policy backfired.  Beginning with Hoover and continuing with FDR, the U.S. tried to be a \"good neighbor\" to  Latin American nations.  In other words, the U.S. ceased to intervene at  the drop of a hat.  In the case of the Dominican Republic, this new policy  allowed a ruthless military dictator with fascist tendencies, Rafael  Trujillo, to seize power.  Despite warnings from those in the know, the  U.S. held fast to its non-intervention policy and allowed Trujillo to hold  power for years.  The book documents all of this as well as Trujillo's  well-organized and continual lobbying effort to gain the approval from U.S.  officials that he craved.  I had thought for a long time that we should  stay out of the business of other nations, but this book certainly casts  doubt on the wisdom of that approach.  Highly recommended."}, {"review_sentiment": 5.0, "review_text": "Eric Paul Roorda gives an insightful view in the  often overlooked subject of u.s. diplomatic and military relations with latin american dictators, namely that of the Trujillo regime in the Dominican Republic. Through  exhaustive research and excellent writing, Roorda gives a detailed account  of how the dictatorship of trujillo took advantage of F.D.R's Good Neighbor  Policy in order to cement complete social and politcal control upon the  Dominican people. Roorda illustrated how the Good Neighbor Policy, in  effect, gave tacit consent to the Trujillo regime. Another aspect of  American diplomatic history that Roorda poignantly sheds light on, is the  racist and prejudice attitudes of many of the American players in the game  of foreign affairs. These prejudices gives the U.S. government a  paternalistic view of the governments they deal with as well as the people  from those nations. The Dictator Next Door is a must read for any student  of Dominican history and for any reader interested in American foreign  affairs under the Good Neighbor Policy."}, {"review_sentiment": 5.0, "review_text": "Eric Paul Roorda gives an insightful view in the  often overlooked subject of u.s. diplomatic and military relations with latin american dictators, namely that of the Trujillo regime in the Dominican Republic. Through  exhaustive research and excellent writing, Roorda gives a detailed account  of how the dictatorship of trujillo took advantage of F.D.R's Good Neighbor  Policy in order to cement complete social and politcal control upon the  Dominican people. Roorda illustrated how the Good Neighbor Policy, in  effect, gave tacit consent to the Trujillo regime. Another aspect of  American diplomatic history that Roorda poignantly sheds light on, is the  racist and prejudice attitudes of many of the American players in the game  of foreign affairs. These prejudices gives the U.S. government a  paternalistic view of the governments they deal with as well as the people  from those nations. The Dictator Next Door is a must read for any student  of Dominican history and for any reader interested in American foreign  affairs under the Good Neighbor Policy."}]}, "authors": ["Eric Paul Roorda"], "isbn": "0822321238", "longitude": -69.942111, "periods": ["1900s"], "title": "The Dictator Next Door", "word_cloud": "informative info impress thanks tear give star obviously someone spend lot time think subject story even story narrative policy write policy wonk coherent history rather extensive thesis different perceive goal military state department interwoven personal bias individual create policy use case study question perceive wisdom prop dictator strong men nation least create framework stability benefit country individual sleep aid driest thing year informative history beloved country extensive research regard history make essential fully understand reason uncle way govern still day better way hispanic mind think way once american understand better inform opiniate latin american affair research uncle become quite clear reason ineffective government nothing accomplish many weak ceo american successful uncle build country manure clear simple provide better understanding dominican history individual love world history state begin uncle make difficult american business course main concern best interest country period wonder much praise history community not usual history student history rest recommend actually good readable island even fewer republic come mind fight good account early year relation best remember massacre immigrant invade country other topic cover detail include jewish refugee wwii interest essential history american involvement history important country approach topic deserves serious attention scholar international relation much happen approach topic interest rather revisionist point view offer author view interpretation yet study subjective substantiate fact interest read new view talk nothing really new inspiring interest study policy backfire continue try good neighbor latin american nation word cease intervene drop hat case new policy allow ruthless military fascist tendency power warning know hold fast policy allow hold power year document well continual lobbying effort gain approval official crave think long time stay business nation certainly cast doubt wisdom approach recommend give insightful view often overlook subject diplomatic military relation latin american dictator namely regime exhaustive research excellent write give detailed account dictatorship trujillo take advantage good neighbor order cement complete social political control people illustrate good neighbor effect give tacit consent regime aspect american diplomatic history poignantly shed light racist prejudice attitude many american player game foreign affair prejudice give government paternalistic view government well people nation history interested american foreign affair good neighbor policy give insightful view often overlook subject diplomatic military relation latin american dictator namely regime exhaustive research excellent write give detailed account dictatorship trujillo take advantage good neighbor order cement complete social political control people illustrate good neighbor effect give tacit consent regime aspect american diplomatic history poignantly shed light racist prejudice attitude many american player game foreign affair prejudice give government paternalistic view government well people nation history interested american foreign affair good neighbor policy", "genres": ["History", "Politics"], "summary": "The Good Neighbor Policy and the Trujillo Regime in the Dominican Republic, 1930-1945 \r\n\r\nThe question of how U.S. foreign policy should manage relations with autocratic governments, particularly in the Caribbean and Latin America, has always been difficult and complex. In The Dictator Next Door Eric Paul Roorda focuses on the relations between the U.S. and the Dominican Republic following Rafael Trujillo’s seizure of power in 1930. Examining the transition from the noninterventionist policies of the Hoover administration to Roosevelt’s Good Neighbor policy, Roorda blends diplomatic history with analyses of domestic politics in both countries not only to explore the political limits of American hegemony but to provide an in-depth view of a crucial period in U.S. foreign relations.\r\n\r\nAlthough Trujillo’s dictatorship was enabled by prior U.S. occupation of the Dominican Republic, the brutality of his regime and the reliance on violence and vanity to sustain his rule was an untenable offense to many in the U.S. diplomatic community, as well as to certain legislators, journalists, and bankers. Many U.S. military officers and congressmen, however—impressed by the civil order and extensive infrastructure the dictator established—comprised an increasingly powerful Dominican lobby. What emerges is a picture of Trujillo at the center of a crowded stage of international actors and a U.S. government that, despite events such as Trujillo’s 1937 massacre of 12,000 Haitians, was determined to foster alliances with any government that would oppose its enemies as the world moved toward war.\r\n\r\nUsing previously untapped records, privately held papers, and unpublished photographs, Roorda demonstrates how caution, confusion, and conflicting goals marked U.S. relations with Trujillo and set the tone for the ambivalent Cold War relations that prevailed until Trujillo’s assassination in 1961. The Dictator Next Door will interest Latin Americanists, historians, political scientists, and specialists in international relations and diplomacy.", "asin": "0822321238", "rank": "555540", "city": "Santo Domingo", "image": "https://images-na.ssl-images-amazon.com/images/I/51Zy0kW2akL.jpg", "country": "D.R.", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}