{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 7, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Extended essay of the relation of sports and culture.  Lots of insightful thoughts.  Not for anyone who has no familiarity with cricket."}, {"review_sentiment": 5.0, "review_text": "Great read."}, {"review_sentiment": 5.0, "review_text": "Not an easy read but it is a great one.  The book explores colonialism through the lens of cricket.  Very interesting."}, {"review_sentiment": 3.0, "review_text": "A classic. And the autobiographical stories of late-colonial West Indies are wonderful, and wonderfully written. A great second perspective, for anyone interested in a view of this time, other than VS Naipaul.However, the cricket is incredibly technical, long, and dense. The author seems to revel in using detailed sports terminology, which must have been a little \"inside baseball\" even at the time when it was written. It's hard to understand, even for a modern cricket fan. And completely incomprehensible for someone who doesn't the game beyond a flat bat, a bowler, and overs.The author seems to have disdain for the uninformed reader, when it comes to matters of sport. Although not at all for those who may know nothing of his island, which he loves informing the reader about.Which is a shame, because the book was thus written to date itself quickly. I'd love to see an edition that includes explanatory notes, or just cuts out some of the very technical cricket that has little to do with the overall story. It's almost a collection of unrelated chapters at times, although it certainly has on overall arc.A Gulag Archipelago of sorts. Much shorter, and less heavy. Although at times, it's hard to tell the difference."}, {"review_sentiment": 1.0, "review_text": "I have not received the item as of today 10/14/14"}, {"review_sentiment": 5.0, "review_text": "One of the outstanding books of our time. James development of his thesis on the relationship between sport and politics in the wider context of race, colonialism and socio political development is outstanding.Derek WilshereLower HuttNew ZealandAward of Merit , International Hockey Federation"}, {"review_sentiment": 5.0, "review_text": "I originally chose it because I was familiar with the West indies team of the 50s and 60s -- (once hit 2 against them) -- but this book turned out to be much more significant than a sports journal or \"tell all\". James moves through the history and context of cricket in the WI , weaving in the ties to the British public school culture, class 'warfare'  and \"the Empire\".Although his stated aim is to produce a reasoned  argument for a case (which he does), it can also be enjoyed by reading segments that are of particular interest (e.g. Victorian era, WG Grace, the great tours,the rise of professionalism, the 3 Ws) and  as a reference -- particularly if of WI heritage.The writing style is crisp and often repetitive -- at first this was disconcerting, but I chose to imagine James talking to me or a group and putting out his thoughts and intermingled facts with the skill of a passionate advocate. It worked.My original plan was to read and pass on but it stays on my bookshelf -- trustworthy borrowers only!"}]}, "authors": ["C. L. R. James"], "isbn": "0822355639", "longitude": 0.0, "periods": ["1900s"], "title": "Beyond a Boundary: 50th Anniversary Edition (The C. L. R. James Archives)", "word_cloud": "extend essay relation sport culture insightful thought not anyone familiarity cricket great not easy great explores colonialism lens cricket very interesting classic autobiographical story wonderful wonderfully write great second perspective anyone interested view time cricket incredibly technical long dense author seem revel use detailed sport terminology baseball even time write hard understand even modern cricket fan completely incomprehensible someone game flat bat bowler author seem disdain uninformed come matter sport nothing island love inform shame thus write date quickly love include explanatory note cut technical cricket little overall story almost collection unrelated chapter time certainly overall sort much shorter le heavy time hard tell difference receive item today outstanding time development thesis relationship sport politics wider context race colonialism socio political development originally choose familiar indie team hit turn much significant sport journal tell move history context cricket weave tie british public school culture class state aim produce reason argument case also enjoy read segment particular interest victorian era great tour rise professionalism reference particularly write style crisp often repetitive first disconcerting choose imagine talk group put thought intermingle fact skill passionate original plan pass stay trustworthy borrower", "genres": ["Memoir", "Politics", "Sport"], "summary": "Beyond a Boundary is a memoir on cricket written by the Trinidadian Marxist intellectual C. L. R. James, which he described as \"neither cricket reminiscences nor autobiography\".\r\n\r\nThis new edition of C. L. R. James's classic Beyond a Boundary celebrates the fiftieth anniversary of one of the greatest books on sport and culture ever written.\r\n\r\nNamed one of the Top 50 Sports Books of All Time by Sports Illustrated\r\n\r\n\"Beyond a Boundary . . . should find its place on the team with Izaak Walton, Ivan Turgenev, A. J. Liebling, and Ernest Hemingway.\"Derek Walcott, The New York Times Book Review\r\n\r\n\"As a player, James the writer was able to see in cricket a metaphor for art and politics, the collective experience providing a focus for group effort and individual performance. . . . [In] his scintillating memoir of his life in cricket, Beyond a Boundary (1963), James devoted some of his finest pages to this theme.\" Edward Said, The Washington Post\r\n\r\n\"Beyond a Boundary is a book of remarkable richness and force, which vastly expands our understanding of sports as an element of popular culture in the Western and colonial world.\" The Nation", "asin": "0822355639", "rank": "202559", "city": "Trinidad and Tobago", "image": "https://images-na.ssl-images-amazon.com/images/I/51acpoFb2tL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}