{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 5, "rating": 4.5, "reviews": [{"review_sentiment": 4.0, "review_text": "The book is divided into two halves. Part 1 describes what seems to be every single person who lives in the town. It describes their occupation, their relationships, their political and religious beliefs, and in many cases much more. It does provide a great deal of detail in preparation for part 2, however the lack of narrative makes it quite the tedious read. Part 2 is where things really take off and where I was glued to my seat for the remainder of the book. The picture perfect town that was so painstakingly described in part 1 begins to fall apart as the outside forces of the civil war descend upon the island.In general, I'd recommend this book if you're interested in the Spanish Civil War or the history of Ibiza. You're not going to hear this story anywhere else, and once it takes off it's a riveting account."}, {"review_sentiment": 5.0, "review_text": "The legendary Elliot Paul - expat editor of many Little Magazines, and also author of comic-mysteries, along with his moving \"The Last Time I Saw Paris\" (1942), reports life on Ibiza - perfection at last ! - until it was boldly and bloodily interrupted for him and peaceful residents by the Spanish Civil War. This historic war, which no one in the US knows anything about, went unchecked and unleashed the wrath to come -- WW2. This is dramatic reading."}, {"review_sentiment": 4.0, "review_text": "The Spanish town of the title is Santa Eulalia Del Rio, known to its inhabitants simply as Santa Eulalia.  Elliot (correct spelling) Paul made Santa Eulalia, a small fishing village on the Spanish island of Ibiza, his  home from 1931 to 1936.  He did not live there as an outsider, but rather  as an accepted and loved member of the community.During Paul's first few  years on Ibiza, life seemed idyllic.  Most of his friends and neighbors  were simple, somewhat naive, generally kind people who ranged from those  who struggled to eke out a living to those comfortably well off.  If the  rich preferred to stay that way and weren't too anxious to share the  wealth, so be it.  If the Communists thought the wealth should be spread  around, that seemed to be normal for your everyday Communist.  If the  Republicans liked the old style government and the Fascists thought that  they should be in control, as long as it was just a thought, it didn't hurt  anyone, did it?  In spite of these conflicting agendas, all seemed well and  no one thought that the problems on the mainland would spill over to their  little island.Paul brings Santa Eulalia to life.  He introduces us to  the leading citizens in each walk of life, and invests them with real  personalities.  No wooden characters here.  Paul's genius is in making us  feel that we know everyone and that we are participants in the life of  Santa Eulalia.He immerses himself deeply into the life of the village,  and, it is my opinion that if not for the hostilities of the Spanish Civil  war, Paul and his family would never have left Santa Eulalia.  As it was,  they waited until the last possible minute to escape, fleeing to the last  neutral ship to dock in the harbor minutes before it left.  At the time he  wrote this book, Paul was still suffering from feelings of guilt over  having survived when so many of his friends didn't.With the coming of  the Spanish Civil War, Ibiza was alternately ruled by Fascists, Loyalists,  Communists, and whatever other ist's could wrest control.  Each successive  change of power was accompanied by new oppressions, imprisonments and  executions.  The true victims of all of this were the innocent majority who  naively believed that they could continue their old ways of life no matter  who was in power.The day after Paul and his family made their escape  there was an invasion by Italian Fascist troops.  Within a few hours these  troops herded most of the remaining males into a town square and machine  gunned them.  The Italians didn't care whose side the men were on, they  considered all of the islanders to be a threat and thus executed all the  males they could find, no questions asked.  A day or two later, Spanish  government planes bombarded Santa Eulalia, destroying nearly every home in  the village.  At the time of the publication of this book in 1937, Paul was  still unable to determine the fate of any of his friends.THE LIFE AND  DEATH OF A SPANISH TOWN brings a community to life, presents its  inhabitants as real living people, and eventually brings home the horror of  war through the deaths of innocent people with real names, families, and  feelings.  An out of print book that merits reprinting."}, {"review_sentiment": 5.0, "review_text": "When this autobiographical account was published in the late 30's it was an immediate sensation. Though Elliot Paul is pretty well forgotten today, he was the author of many best sellers. The Life and Death of a Spanish  Town is generally regarded as his masterpiece. In this all but forgotten  book Paul describes the destruction of the idyllic life he led on the  Ballearic Island of Ibiza by the Fascists, both Italian and Spanish, who  struck out against the Spanish Republic in 1936. It has long been  considered one of the classics of the Spanish Civil War."}, {"review_sentiment": 5.0, "review_text": "When this autobiographical account was published in the late 30's it was an immediate sensation. Though Elliot Paul is pretty well forgotten today, he was the author of many best sellers. The Life and Death of a Spanish  Town is generally regarded as his masterpiece. In this all but forgotten  book Paul describes the destruction of the idyllic life he led on the  Ballearic Island of Ibiza by the Fascists, both Italian and Spanish, who  struck out against the Spanish Republic in 1936. It has long been  considered one of the classics of the Spanish Civil War."}]}, "authors": ["Elliot Paul"], "isbn": "0837156289", "longitude": 0.0, "periods": ["1900s"], "title": "The Life and Death of a Spanish Town", "word_cloud": "divide half describe seem single person live describe occupation relationship political religious belief many case much provide great deal detail preparation part however lack narrative make quite tedious thing really take glue seat remainder picture perfect painstakingly describe part begin fall apart outside force civil war descend general recommend interested history go hear story anywhere else take rivet account legendary expat editor many also author move last report perfection last boldly bloodily interrupt peaceful resident historic war know anything go unchecked unleashed wrath dramatic reading title know inhabitant simply correct spell make small fishing village island home live outsider rather accept loved member first year seem idyllic friend neighbor simple somewhat naive generally kind people range struggle eke live comfortably well rich prefer stay way anxious share wealth think wealth spread seem normal everyday like old style government think control long think hurt anyone spite conflicting agenda seem well thought problem mainland little brings introduce lead citizen walk invests real personality wooden character genius make everyone participant immerse deeply village opinion hostility war family never wait last possible minute escape flee last neutral ship dock harbor minute leave time write still suffer feeling guilt survive many friend come alternately rule fascist loyalists sit control successive change power accompany new oppression imprisonment executions true victim innocent majority naively believe old way matter day family make escape invasion italian troop hour troop herd remain male square machine gun care side men consider islander threat thus execute male question ask day later government plane bombard destroy nearly home village time publication still unable determine fate bring community present inhabitant real living people eventually bring home horror war death innocent people real name family feel print merit reprint autobiographical account publish late immediate sensation pretty well forget today author many best seller generally regard masterpiece forgotten describe destruction idyllic lead strike long consider classic autobiographical account publish late immediate sensation pretty well forget today author many best seller generally regard masterpiece forgotten describe destruction idyllic lead strike long consider classic", "genres": ["Memoir", "Travel Writing", "Spanish Civil War"], "summary": "The book is set in and around the small town of Santa Eulària des Riu, on Ibiza, where Paul had lived since 1931. In the first part of the book Elliot Paul describes the town and many of the characters who live and work there. He details their family lives, their hopes, their aspirations, and their politics. He provides details of the people at work and at play, and describes how he becomes part of the community of the town.\r\n\r\nPaul also writes of other ex-patriates who have made their homes in and around the town. Part two starts with Paul and his family returning to Ibiza, after some time away.\r\n\r\nThe narrative is set in 1936 in the week leading up to the outbreak of hostilities on Ibiza during the Spanish Civil War and describes the events that eventually lead to Paul, his family and other refugees from the violence, fleeing the island. It tells the story of civil disobedience, collaboration and the violence that split a once-happy community, although the narrative finishes before the tragic turn of events reaches its conclusion.\r\n\r\nThe postscript, written by Paul, dated 14 June 1937, details events following his departure from Ibiza and describes his hopes and fears for his friends on the island and a way of life that he thought would change for ever.\r\n\r\nIn this rare and vivid document, Paul captures the upheaval that shattered lives before he and his wife had\r\nto flee.", "asin": "0837156289", "rank": "3837799", "city": "Ibiza", "image": "https://images-na.ssl-images-amazon.com/images/I/31bbwUxKAvL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}