{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 88, "rating": 4.6, "reviews": [{"review_sentiment": 3.0, "review_text": "a very quick and jagged reading.the author would introduce something someone or somewhere and then on to the next.I feel that the story just glossed over too much.instead of stopping and making me feel what the author was feeling.reading is about conveying the feeling and description to the reader.I never really connected.I read lots of WWII books and have traveled to the post war torn countries."}, {"review_sentiment": 4.0, "review_text": "Brought for Grand-daughter"}, {"review_sentiment": 5.0, "review_text": "Excellent writing, tremendous story. A must read."}, {"review_sentiment": 5.0, "review_text": "Great story of human perseverance.  An illuminating history of life under a totalitarian secular society.  Citizens of any democracy should take note!"}, {"review_sentiment": 5.0, "review_text": "I lived in Bratislava, Slovakia from 1992 to 2002; visited Praha 3 or 4 times. It is stunning that one woman could endure this non-stop series of nightmares! It enlightened me afresh what my Slovak friends had endured prior to our arrival there. I wish she had mentioned that the leader of the Prague Spring, Dubcek was a Slovak. She endured so much under the hands of the 20th Century's biggest monsters: Hitler and Stalin."}, {"review_sentiment": 5.0, "review_text": "This is a really good read for an understanding of WWII and post-war Hungary. Easy read for undergraduate students"}, {"review_sentiment": 5.0, "review_text": "This biography adds to the accounts of life (\"existence\" is a better word) under a totalitarian regime.  It relates the senselessness of life, and the waste of life and talents.  I saw this book mentioned somewhere and thought it would be interesting to read as I hadn't read anything about oppression in Czechoslovakia.  I came away realizing more clearly that freedom is precious and we have to do all we can to protect and promote it.We read this in our parish book club and it was generally well-received with a recognition of the loss which Heda Margolius Kovaly and a whole nation experienced.  It is an easy book to read and well worth it."}, {"review_sentiment": 3.0, "review_text": "Upsetting as are all stories about life under repressive regimes."}, {"review_sentiment": 5.0, "review_text": "I bought this book in a little shop in Prague, it is a essential reading, the story is very sad, but the tone is not tragic or suffers of what would amount to understandable self pity, It is a great book under every light."}, {"review_sentiment": 5.0, "review_text": "good"}]}, "authors": ["Heda Margolius Kovaly"], "isbn": "0841913773", "longitude": 14.4212535, "periods": ["1900s", "Recent Releases"], "title": "Under a Cruel Star: A Life in Prague, 1941-1968", "word_cloud": "quick jag author something someone somewhere story gloss stop make feel author convey feel description never really lot travel post war torn country excellent write tremendous story story human perseverance illuminating history totalitarian secular society democracy note live visit time stun woman series nightmare enlighten afresh friend endure prior arrival wish mention leader endure much hand biggest monster really good understanding undergraduate student biography add account existence better word totalitarian regime relate senselessness waste talent saw mention somewhere think anything oppression come away realize clearly freedom precious protect promote parish club generally recognition loss whole nation experience easy well upset story repressive regime buy little shop essential reading story sad tone tragic suffers understandable self pity great light good", "genres": ["Memoir", "History", "WWII", "Cold War"], "summary": "Heda Margolius Kovaly's steady gaze at the lives caught up in Czechoslovakia's tragic fate under the Nazis and then during the Stalin era illuminates the chaotic life of a nation. Kovaly was deported to concentration camps, escaped from a death march, nearly starved in the post-war years, only to be shattered by her husband's conviction (in the infamous 1952 Slansky trial) and his execution. Resonant with lyricism, this gripping memoir is uplifting even in the midst of horror.\r\n\r\n“Once in a rare while we read a book that puts the urgencies of our time and ourselves in perspective, making us confront the darker realities of human nature... Mrs. Kovaly experienced the two supreme horrors of what Hannah Arendt called this terrible century. But her book is not just a personal memoir of inhumanity. In telling her story – simply, without self-pity – she illuminates some general truths of human behavior... Quietly, with cumulative force, it shows us how the totalitarian state feeds on the blindness and the weakness of man.” The New York Times", "asin": "0841913773", "rank": "94225", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/41XJT4KFX7L.jpg", "country": "Czechia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}