{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 17, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "as described, quite useful in the classroom and quick shipping"}, {"review_sentiment": 5.0, "review_text": "It is part of my history.  My kids loved the stories too."}, {"review_sentiment": 3.0, "review_text": "Good:These somewhat longer than the stories in the other dual language books and are probably more challenging and interesting.Big problem:The translations are artful and smooth – but that is not the point of a dual language book. Often the translation doesn't correspond to the Spanish. Words are added in, adjectives and whole phrases are left out, things are listed in a different order than they are in the Spanish, etc.Here is one good example of this. I'll keep it to just one, but this sort of thing arises on every page and eventually gets tedious and annoying.Toward the top of page 13 it says, \"Lo sentaron en la orilla.\"  This means, \"They set him/sat him up on the embankment.\"  But the translation on page 12 is, \"They propped him up.\"  That just isn't helpful.So this book could be useful as a study on how to translate smoothly, but it doesn't live up to the promise of a dual language book."}, {"review_sentiment": 3.0, "review_text": "not what i ordered or wanted"}, {"review_sentiment": 4.0, "review_text": "I have enjoyed the stories and purchased the others in the series and enjoyed them equally as well ... if you purchase one and like it you'll probably like the others (there's also Spain, Mexico, South America/Latin Countries)"}, {"review_sentiment": 5.0, "review_text": "It was on my son's wish list.  He likes to read stories about Puerto Rico and I think he is going to like it."}, {"review_sentiment": 5.0, "review_text": "The stories in the book reminded me of the stories my grandmother,grandfather,aunts and uncles used to tell me when I was a little girl.  There where many stories shared every year when I visited my family in Puerto Rico.  I loved it!!!!!  It bought back so many memories from the past."}, {"review_sentiment": 5.0, "review_text": "Gave this as a gift and the person that received it loved it.  She loves history and so does her spouse who doesn't speak spanish so the fact that the book is in both spanish and english makes it a great gift for them."}, {"review_sentiment": 4.0, "review_text": "This book is a very good reading through the eyes of people who are interested in the history. It give the reader a good understanding of Puerto Ricans and the way they lived."}, {"review_sentiment": 5.0, "review_text": "As a teacher in PR, we always talk about these stories and most of the students are familiar with them in Spanish.  These are great teaching tools to use in the English classroom.  This also could be said for those trying to learn or teach Spanish in the States (or PR).  These stories are commmon legends here on the island. Anyone you meet has a different tale or twist to it.  It was nice to read, easy too, and there is an insight to island lore and culture that for outsiders you can get just anywhere.  Enjoy!"}]}, "authors": ["Robert L. Muckley", "Adela Martinez-Santiago"], "isbn": "0844204021", "longitude": 0.0, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s", "500-1400s"], "title": "Stories from Puerto Rico", "word_cloud": "describe quite useful classroom quick shipping part history kid love good somewhat longer dual language probably challenge problem translation artful smooth point dual language translation correspond spanish add adjective whole phrase leave thing list different order spanish good example keep sort thing arise page eventually get tedious top page say sentaron en gorilla mean set embankment translation page prop translate smoothly live promise dual language order want enjoy purchase others series enjoy equally well probably others also son wish list like think go remind grandmother grandfather aunt uncle use tell little girl many share year visit family love buy back many memory gift person receive loved love history spouse speak spanish fact spanish english make great gift good reading eye people interested history good understanding way live teacher always student familiar spanish great teaching tool use english classroom also say try learn teach spanish state common legend island meet different tale twist nice easy insight island lore culture outsider get anywhere", "genres": ["History"], "summary": "Dive into the tales of Puerto Rico--in Spanish and in English!\r\n\r\nStories from Puerto Rico allows you to explore the island's rich history. It includes 18 well-known Puerto Rican legends that stretch from the dawn of creation to the twentieth century. These tales will introduce you to an array of characters as dynamic and colorful as the country that gave birth to them. Animals, indigenous peoples, conquistadors, spiritual beings, and extraterrestrials are among those who will make these pages come alive for you! As you read these stories side by side, you will be not only fine-tuning your language skills but also gaining insight into the rich cultural heritage of the Puerto Rican people.\r\n\r\nStories from Puerto Rico has both Spanish and English stories side by side. ", "asin": "0844204021", "rank": "715893", "city": "Puerto Rico", "image": "https://images-na.ssl-images-amazon.com/images/I/51-59nAsfsL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}