{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.8933203, "ratings": {"num_ratings": 11, "rating": 3.5, "reviews": [{"review_sentiment": 1.0, "review_text": "After some complications with the order, the book arrived but to my dismay, only few storieswere included and some were already well known like Caravaggio, Beatrice Cenci, Mutti etc.I was expecting the author to include for example the scandalous acts of Sant Pietro inMontorio etc.This book is simply a compilation of well known stories."}, {"review_sentiment": 5.0, "review_text": "This is a compelling treatment by a writer whose life is interwoven with this strange and great city. I expect to return to it again and again."}, {"review_sentiment": 2.0, "review_text": "I purchased this in the hope that it would be a general history but its not.  Its the Rome that the author grew up in and he then tells the story of the parts of the city that are relevant to him, areas of the city that he has memories of.Its interesting but also very personal but for me gets off track too often to keep my attention."}, {"review_sentiment": 5.0, "review_text": "If you want an interesting guide of the eternal city without the boredom that comes with most guides; if you enjoy learning historical details that are tantalizing as a soap opera may be, this is the book to read and enjoy."}, {"review_sentiment": 4.0, "review_text": "Augias is a fine Roman, a fine journalist, and a fine writer."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this book enormously, as it was able to give a lot of background to the history of Rome."}, {"review_sentiment": 4.0, "review_text": "There were so many fascinating parts to this book to enjoy.  Brought Rome over the centuries to life. After finishing the chapter on Antica Ostia, felt like hopping on a plane to Italy to see for myself.  But at times the structure made it feel slightly unfocused.  A few digressions, while interesting, distracted from the flow of the text.  Googling names of locations and individual structures mentioned helped to let you see what was being discussed in print.  I read this as an e-book and perhaps the printed book has illustrations or photos.  Having said all this, I still loved the the book.  The narratives are wonderfully written.  An excellent translation. 4-1/2 stars would be a better rating from me."}, {"review_sentiment": 3.0, "review_text": "A book thats not a tour guide but useful if you read and note the locations prior to visiting. The author does get sidetracked at times, but it is a fast read. It was a good diversion from visiting the innumerable churches and more and more marble."}, {"review_sentiment": 5.0, "review_text": "Received in perfect condition and very quickly, I was told about this book while on a tour of Italy and look forward to reading it"}, {"review_sentiment": 5.0, "review_text": "This is a very interesting book, one of the best that I have read on Rome.It is not a guide book with an in depth narration of several sites and personages. A must read!"}]}, "authors": ["Corrado Augias"], "isbn": "0847842762", "longitude": 12.4829321, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases", "1500s", "500-1400s", "0-500s", "Pre Common Era"], "title": "The Secrets of Rome: Love and Death in the Eternal City", "word_cloud": "complication order arrive dismay stories were include already well know expect author include example scandalous act san inmontorio simply compilation well know story compelling treatment writer life interwoven strange great expect return purchase hope history author grow tell story part relevant area memory interest also personal get track often keep attention want interesting guide boredom come guide learn historical detail tantalize soap opera fine fine journalist fine writer enjoy enormously able give lot history many fascinating part enjoy century life finish chapter felt hop plane see time structure make feel slightly unfocused digression interest distract flow text name location individual structure mention help discussed print perhaps print illustration photo have say still love narrative wonderfully write excellent translation star rating thatch tour guide useful note location prior visit author get sidetrack time good diversion visit innumerable church marble receive perfect condition quickly tell tour forward reading interest best guide depth narration several site personages", "genres": ["Essay", "Biography", "History", "Travel Writing"], "summary": "From Italy's popular author Corrado Augias comes the most intriguing exploration of Rome ever to be published. In the mold of his earlier histories of Paris, New York, and London, Augias moves perceptively through twenty-seven centuries of Roman life, shedding new light on a cast of famous, and infamous, historical figures and uncovering secrets and conspiracies that have shaped the city without our ever knowing it. \r\n\r\nFrom Rome's origins as Romulus's stomping ground to the dark atmosphere of the Middle Ages; from Caesar's unscrupulousness to Caravaggio's lurid genius; from the notorious Lucrezia Borgia to the seductive Anna Fallarino, the marchioness at the center of one of Rome's most heinous crimes of the post-war period, Augias creates a sweeping account of the passions that have shaped this complex city: at once both a metropolis and a village, where all human sentiment-bravery and cowardice, industriousness and sloth, enterprise and laxity-find their interpreters and stage. \r\n\r\nIf the history of humankind is all passion and uproar, then, as the author notes, \"for centuries Rome has been the mirror of this history, reflecting with excruciating accuracy every detail, even those that might cause you to avert your gaze.\"", "asin": "0847842762", "rank": "1353904", "city": "Rome", "image": "https://images-na.ssl-images-amazon.com/images/I/41fL9w9GaaL.jpg", "country": "Italy", "story_arc": ["Tragedy", "Things only get worse"]}