{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 59, "rating": 3.8, "reviews": [{"review_sentiment": 4.0, "review_text": "A very interesting and informative book. So many awful things are done in the name of religion.  Perhaps if we learnt more about other religions, we would become more tolerant and accepting of others beliefs and learn to live with each other in harmony."}, {"review_sentiment": 5.0, "review_text": "The language is powerful and conjures up images of an era gone by. I recommend this book to people who enjoy historical fiction. I enjoyed the book thoroughly. The characters are well developed."}, {"review_sentiment": 1.0, "review_text": "The book was hard to follow, names were confusing, text was depressing and boring.  The book rambled on and on and never held my interest.  This was never a book that I eagerly wanted to pick up and read so that I could see what was going to come next.  I only read the first 50 pages and could never figure how the author won any awards with this type of writing.  This is a book that I definitely will not be passing on to a friend.  I do not recommend this book."}, {"review_sentiment": 4.0, "review_text": "This was not an easy read. I found the many similar names confusing, due to my own ignorance of the Arabic language. It was, however a story giving much insight and appreciation of the Arab history"}, {"review_sentiment": 2.0, "review_text": "My 14 year old Muslim son read it and found it inappropriate. The sexual exploits was over the top for him and he ripped up the book and threw it away to protect his sisters from reading it."}, {"review_sentiment": 5.0, "review_text": "Excellent insight to what life may have been like for granadans after the 'reconquest' and the early days of the inquisition. Well written and descriptive of daily life bringing historical figures and accounts to life."}, {"review_sentiment": 4.0, "review_text": "A good depiction of Andalusia after the Reconquest. Well drawn characters and good perspective of life just before the Inquisition came to Granada."}, {"review_sentiment": 1.0, "review_text": "Last chapter is the only important one. Very slow and boring read"}, {"review_sentiment": 4.0, "review_text": "1499.  Zuhayr bin Umar and his brother Yazid, sister Hind, are the generation that sees the ‘final solution’ of the Catholic church and Christian rulers for the “Muslim problem” of the 15th and 16th Century. Though the Moors had inhabited much of Iberia for the past few hundred years; though the Moors skills and knowledge in most areas of science and mathematics far surpassed that of their Christian neighbors; though the Moors offered no threat other than their mere presence; though all these factors would seem to be in the Moors’ favor, the “Ximenes de Cisneros had always believed that the heathen could only be eliminated as a force if their culture was completely erased,” and so their art, their writing, their lives, even, were destroyed.  Some Moslems departed Spain.  Some converted to Christianity.  Some pretended conversion.  And some fought back.  Many of the latter two groups died."}, {"review_sentiment": 5.0, "review_text": "Excellent storytelling of a time of great turmoil, the Spanish inquisition told from a Muslim or Moorish point of view. Looking forward to the next book in this series."}]}, "authors": ["Tariq Ali"], "isbn": "0860916766", "longitude": 0.0, "periods": ["500-1400s"], "title": "Shadows of the Pomegranate Tree", "word_cloud": "interesting informative so many awful thing do name religion perhaps learn religion tolerant accept others beliefs learn live harmony language powerful conjures image era go recommend people enjoy historical fiction enjoy thoroughly character well develop hard follow name confuse text depress bore ramble never hold interest never eagerly want pick go come next first page never author award type write definitely pass friend recommend easy find many similar name confuse due ignorance language however story give much insight appreciation history year old son find sexual exploit top rip protect sister read excellent insight life granadans early day inquisition write descriptive daily life bring historical figure account life good depiction drawn character good perspective life come last chapter important slow boring bin brother sister generation see final solution church rulers problem inhabit much year skill knowledge area science mathematics far surpass christian neighbor moor offer threat mere presence factor moor favor ximenes always believe heathen force culture completely erase art write life even destroy depart convert pretend conversion fight back many latter group die excellent storytelling time great turmoil spanish inquisition tell point view look forward next series", "genres": ["Fiction & Literature"], "summary": "The Islam Quintet\r\n\r\nTariq Ali tells us the story of the aftermath of the fall of Granada by narrating a family sage of those who tried to survive after the collapse of their world. Ali is particularly deft at evoking what life must have been like for those doomed inhabitants, besieged on all sides by intolerant Christendom.\r\n\r\n“Tariq Ali captures the humanity and splendour of Muslim Spain ... an enthralling story, unravelled with thrift and verve. Shadows of the Pomegranate Tree is quizzical as well as honest, informative as well as enjoyable, real history as well as fiction ... a book to be relished and devoured.” The Independent", "asin": "0860916766", "rank": "145324", "city": "Andalucia", "image": "https://images-na.ssl-images-amazon.com/images/I/51NW%2B-2bivL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}