{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 40.4862174, "ratings": {"num_ratings": 17, "rating": 4.4, "reviews": [{"review_sentiment": 2.0, "review_text": "I can't help thinking that the other reviews on this site were written by friends of the author. I stumbled across this book on Amazon and decided to make it the first of my summer books.  Personally, I'd like four evenings of my life back.The best way that I can describe reading this book is that I kept waiting for something monumental to happen.  And I felt like nothing ever did.  The story just never seemed to have much of a climax. I don't want to cite specifics and ruin the book for anyone but it seemed like any time there was a hint of conflict it was quickly resolved without incident. There was no complexity whatsoever.I'm not sure if the author is trying to compensate for the character of Percy being so sensitive about everything, but his sister Ruby seems to care about almost nothing.  Regardless of the situation or who she is interacting with, I always felt that her feelings on what was happening was just \"Whatever.\"  Considering how Ruby is treated by her classmates and the situation she is facing, you never really see her display any emotions.  I would have liked to have seen her stand up to her tormentors, but she doesn't seem the least bit bothered by their teasing.  She doesn't seem that affected by the death of another character, despite her closeness to this character. She even goes so far as to state that such things are to be expected, given the circumstances.Technically I think Riel Nason is a good writer. I just don't get a lot of enjoyment from her story.  I am willing to entertain that it may be a cultural difference, or perhaps if you are from the area certain aspects might be more meaningful.  But overall, this book did not live up to the reviews."}, {"review_sentiment": 5.0, "review_text": "This is a great story, well crafted, with strong characters. A young teenager Ruby Carson falls through the ice while skating, and as she plummets she sees a vision of her town submerged in a lake, and a few of the town's people float past her.  Ruby is not one of the popular kids, and is teased because of this vision, which she blurted out as she was being rescued.We feel tension mount as Ruby struggles to find meaning in her vision, and as she tries to come to terms with being a teenager in a very small community.As weeks go by, stakes are found in the ground, mysterious people show up measuring and marking things around the town. It transpires that a dam is going to be built upstream and they will all lose their homes and the town itself, as it will be submerged. People start dying, the same people Ruby saw in the vision.The story is well worth reading, as Ruby and her younger brother are beautifully drawn, as are the many odd people who live in this community."}, {"review_sentiment": 4.0, "review_text": "It's the mid 1960's in a small town in New Brunswick.  Little do the residents  know,  over the next two years  life in their town is going to change in ways they could never have imagined.  The entire town lies in the future flood plain of a yet to built dam.  Almost everyone will have to move.  For most people, they will adapt, but for the Carson family, it will be more of a challenge.  Their nine year old son, Percy, is not like the other kids.  He sticks to his own strict routine and doesn't accept change. (autism?)  Along with worrying about her brother and his quirky behaviour, Ruby has her own issues.  Ever since she fell in the river, hitting her head, no one will let her forget the prophetic babbling she uttered.Small towns can be a supportive community where everyone knows everyone else, but it can also seem like a punishment when people continue to rub past events in your face.  Ruby is hoping that the forced move will improve her and Percy's lot in life.While the main story line is the flooding of the town, that of Percy, his behaviour and how the towns people respond to him is equally significant in my opinion.  The term autism has been used since 1908, though it wasn't until the 1970s that it became more widely know.  Keeping this in mind, I shouldn't be too surprised that there was so little understanding/tolerance for Percy.I was younger than Percy at the time this novel was set.  I have no memories of politics and how governments worked.  In this book, the provincial government is portrayed as paternalistic.  No public hearings nor consultations with the affected communities were held.  No discussion with the towns people of where they want to located their new town.  This lack of consultation led to all sorts of distrust and rumours in the community.  I really got the feel of neighbour against neighbour as people tried to cope with their loss.This book should appeal to teens through adults.  History lovers will appreciate that the story was inspired by the construction of a dam on the St. John River in the late 1960's.This is a debut novel for author Riel Nason"}, {"review_sentiment": 5.0, "review_text": "This book rightly captured prizes. It's superbly written with characters who will come to live with you. Can't beat the story arc either as a town suffers the worst part of \"progress.\""}, {"review_sentiment": 4.0, "review_text": "This book was very well written and I could identify with the characters easily.  Not too many characters so thatyou lose track of who is who."}, {"review_sentiment": 5.0, "review_text": "Based on a true event in New Brunswick.  There are still people here that remember the dam being built.  The characters are very sympathetic."}, {"review_sentiment": 5.0, "review_text": "My sister recommended this book after discovering it through CBC's \"Canada Reads\".She correctly felt that I my siblings would like it because the story's venue is N.B.'s St. John River Valley where we often visited our grandparents during the 50's and early 60's.It did fondly remind me of some of my childhood and a different era, but it transcends time and is truly entertaining, funny and poignant.A true test of its timelessness is that my 11 year old son also really enjoyed this book.We highly recommend it."}, {"review_sentiment": 4.0, "review_text": "This is a charming book, narrated by an adolescent girl with whom the reader can readily relate and sympathise as she goes through being bullied at school, all the while her town contemplates and adapts to being submerged to create a hydroelectric dam. Easy and quick to read, it is not great literature, but still much to be recommended. An interesting sub-motif is that of her living with an eccentric brother who has Aspergers, which was not recognised as such at the time (60's rural Canada) and which is refreshing for that very reason."}, {"review_sentiment": 5.0, "review_text": "This is one of the best books I read in 2012. The author is a blogging friend (we are both quilters). She is also an excellent author. I highly recommend this book and  have ordered the kindle copy as well as I loaned out my hard copy and am anxious to read it again."}, {"review_sentiment": 5.0, "review_text": "I loved everything about this book-simply couldn't put it down until I turned the final page. A terrific combination of a story that has you dying to see how it all plays out and the development of true-to-life characters. Ruby's voice and the exploration of her relationship with her brother who, if the story were written today, would likely be on the Autism Spectrum, was particularly insightful. A must-read."}]}, "authors": ["Riel Nason"], "isbn": "0864926405", "longitude": -74.4518173, "periods": ["2000s", "Recent Releases"], "title": "The Town That Drowned", "word_cloud": "think site write friends author stumble decide make first summer like evening life best way describe read keep wait something monumental happen felt nothing ever story never seem much climax want cite specific ruin anyone seem like time hint conflict quickly resolve incident complexity sure author try compensate character sensitive everything sister seem care almost nothing regardless situation interact always felt feeling happen treat classmate situation face never really display emotion see stand tormentor seem least bit bothered tease seem affected death character closeness character even go far state thing expect give think good writer get lot enjoyment story willing entertain difference perhaps area certain aspect overall live review great story well craft strong character young teenager fall ice skate plummet see vision submerge lake people float popular kid tease vision blurt feel tension mount struggle find meaning vision try come term teenager small week go stake find ground mysterious people show measure mark thing transpire dam go build upstream lose home submerge start die people saw story well worth read younger brother beautifully draw many odd people live community mid small resident know next year life go change way never entire lie future flood plain yet build dam everyone move people adapt family challenge year old son kid stick strict routine accept change autism worry brother behavior issue fell river hit head let prophetic babbling town supportive community everyone know everyone else also seem like punishment people continue rub event face hop force improve lot main story line flood behavior town people respond equally significant opinion term autism use become widely know keep mind surprise little younger time set memory politics government work provincial government portray paternalistic public hearing consultation affect community hold discussion town people want locate new lack consultation lead sort distrust rumor community really get neighbor neighbor people try cope appeal teen adult lover appreciate story inspire construction dam late debut author rightly capture prize superbly write character come live beat story suffers worst part progress well write character easily not many character that you lose track base true event still people remember dam build character sympathetic sister recommend discover correctly felt sibling story venue often visit grandparent early fondly childhood different era transcends time truly entertaining funny true test timelessness year old son also really enjoy highly charming narrate adolescent girl readily relate sympathy go bullied school contemplates adapt submerge create hydroelectric dam quick great literature still much recommend interesting living eccentric brother asperger recognize time rural refresh reason best author blogging friend quilters also excellent author highly recommend order kindle copy well loan hard copy anxious love everything turn final page terrific combination story die see play development character voice exploration relationship brother story write today likely particularly insightful a", "genres": ["Fiction & Literature"], "summary": "Living with a weird brother in a small town can be tough enough. Having a spectacular fall through the ice at a skating party and nearly drowning are grounds for embarrassment. But having a vision and narrating it to the assembled crowd solidifies your status as an outcast. \r\n\r\nWhat Ruby Carson saw during that fateful day was her entire town - buildings and people - floating underwater. Then an orange-tipped surveyor stake turns up in a farmer's field. Another is found in the cemetery. A man with surveying equipment is spotted eating lunch near Pokiok Falls. The residents of Haventon soon discover that a massive dam is being constructed and that most of their homes will be swallowed by the rising water. Suspicions mount, tempers flare, and secrets are revealed. \r\n\r\nAs the town prepares for its own demise, 14-year-old Ruby Carson sees it all from a front-row seat. Set in the 1960s, The Town That Drowned evokes the awkwardness of childhood, the thrill of first love, and the importance of having a place to call home. Deftly written in a deceptively unassuming style, Nason's keen insights into human nature and the depth of human attachment to place make this novel ripple in an amber tension of light and shadow. \r\n\r\nWinner of the 2012 Commonwealth Book Prize\r\n\r\n\"Charming, wry, and believable ... Nason has a particular gift for introducing supporting characters with memorable anecdotes, each of which reads like a sparkling little gem of a short story ... Ruby's voice, vibrating with contradictory desires, [delivers] shot-to-the-heart moments of real humour and pathos.\" Quill & Quire", "asin": "0864926405", "rank": "2036102", "city": "New Brunswick", "image": "https://images-na.ssl-images-amazon.com/images/I/519Sd-0-t3L.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}