{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 18, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Great product!  Just as described!"}, {"review_sentiment": 4.0, "review_text": "So far, the character seem naive, sweet, conniving, as well as very human."}, {"review_sentiment": 5.0, "review_text": "Couldn't put it down!!!"}, {"review_sentiment": 5.0, "review_text": "These two books are wonderful.  The movies are two of my all-time favorites."}, {"review_sentiment": 5.0, "review_text": "A plot line that is Greek tragedy, yet it is told with such humor, warmth, sweetness, compassion for even its villains. Pagnol transports you to another world and time. His simple, direct, and yet utterly unexpected descriptions of the physical world that is Provence makes you feel that you are right there, in the mistral, the storms of summer. It is a joy to read. I took this two-novel combo paperback with me on a 1-week mountain summer vacation, and I read it every chance I had at least 10 or 15 minutes. Hours by the pool,  10-15 minutes at a time while in line for something, waiting for someone, anything. JdF leads right into the Manon book; they're almost one novel, just in two volumes. I gave my copy away to a friend after I finished because I want someone else to experience the magic of these Pagnol novels. That's why I'm writing this review, and I hope you'll pick this book up, too, and see for yourself."}, {"review_sentiment": 5.0, "review_text": "I made the mistake of loaning it to someone who never returned it so I bought it again. I am intrigued with Pagnol's brilliant and very readable depiction of good and evil-- of every day good people who suffer needlessly because of every day people whose selfishness is really the worst possible evil."}, {"review_sentiment": 5.0, "review_text": "A most enjoyable old fashioned historical novel, great insight into another culture, consumed me into the saga, very hard to put down. Would read it again, highly recommended."}, {"review_sentiment": 5.0, "review_text": "A French classic, can't go wrong with Montand , Auteuil ,Depardieu .Great author, the perfect actors ,I love it"}, {"review_sentiment": 5.0, "review_text": "I've already re-read these novels. The story only gets better. I recommend these two works to everyone I know. \"Jean de Florette\" and \"Manon of the Springs\" are incredible! My only wish is that there existed a better translation. In some parts, the sentences don't flow right. However, I've never read the orignal works in French. Highly recommended!"}, {"review_sentiment": 5.0, "review_text": "I liked the books very much. I hoped the hero would find the spring. I liked Manons revenge. Surprising end."}]}, "authors": ["Marcel Pagnol"], "isbn": "0865473129", "longitude": 0.0, "periods": ["1900s"], "title": "Jean de Florette & Manon of the Springs", "word_cloud": "product describe so far character seem naive sweet connive well human put wonderful movie favorite plot line tragedy yet tell humor warmth sweetness compassion even villains transport world time simple direct yet utterly unexpected description physical world make right mistral storm summer joy take combo paperback mountain summer vacation chance least minute pool minute time line something wait someone anything lead right almost volume give copy away friend finish want someone else experience magic novel write review hope pick see make mistake loan someone never return buy intrigue brilliant readable depiction good evil day good people suffer needlessly day people selfishness really worst possible evil enjoyable old fashioned historical great insight culture consume saga hard put highly recommend french classic wrong author perfect actor love already novels story get better recommend everyone know incredible wish exist better translation part sentence flow right however never original work recommend like much hop hero spring like revenge end", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "In Jean de Florette and Manon of the Springs, Marcel Pagnol (called by Andre Malraux \"one of the great writers of our generation\" and by Jean Renoir \"the leading film artist of his age\") achieve the fullest and most satisfying expression of a story that haunted him for years, a Provencal legend of vengeance exacted by a mysterious sheperdess. Pagnol brings to his treatment of this powerful, moving story his dramatist's sense of place, ambience, and character and his keen understanding of the Provencal countryside and its people. \r\n\r\nRich with twists and ramifications, Jean de Florette and Manon of the Springs sets an idealistic city man against two secretive and deceitful Provencal country men in a superbly realized story of a struggle for life, of crime and punishment, of betrayal and revenge, and of judgment and forgiveness. In this edition, illustrated with images from the acclaimed film adaptation by Claude Berri, North Point presents Pagnol's enduring story in W.E. van Heyningen's exact and sensitive translation.\r\n\r\nBiblical in its cadences, epic in its sweep to destiny, and old fashioned in development of character and plot, this saga charts the destruction of a Provencal family.", "asin": "0865473129", "rank": "972861", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/51UNQvWACgL.jpg", "country": "FR", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}