{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 30, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "pure magic"}, {"review_sentiment": 5.0, "review_text": "Utterly charming"}, {"review_sentiment": 5.0, "review_text": "Loved the movies, My Father's Glory and My Mother's Castle.  The book added a little more details.  I found myself reading humorous passages out loud to my husband who really enjoyed the bits that were not in the movies."}, {"review_sentiment": 5.0, "review_text": "a must read!"}, {"review_sentiment": 4.0, "review_text": "Love this book. Charming, magical and dreamy. A bit slow in the beginning but if you love the South of France like I do you will absolutely fall deeper in love with Provence."}, {"review_sentiment": 5.0, "review_text": "Marcel Pagnol writes with good humor and a wickedly funny and precise eye for observing human nature. He always seems to choose just the right word to characterize people, and events, and has a profound sense of place.  He brings the hills of his beloved Provence alive--so much so that I find myself pulling the book out to read again every summer!  Only a truly great book can captivate you time after time."}, {"review_sentiment": 5.0, "review_text": "Two of the most wonderful books ever to grace the libraries of mankind. Read and savor."}, {"review_sentiment": 5.0, "review_text": "Highly recommend this great book."}, {"review_sentiment": 3.0, "review_text": "Content, obviously fine  -  very disappointed in this printing which feels cheap and nasty."}, {"review_sentiment": 5.0, "review_text": "Was a gift for a student graduate. It's one of those classic stories that is in my top 5 favorites.Arrived quickly and in great shape."}]}, "authors": ["Marcel Pagnol"], "isbn": "0865472572", "longitude": 0.0, "periods": ["1900s"], "title": "My Father's Glory & My Mother's Castle: Marcel Pagnol's Memories of Childhood", "word_cloud": "pure magic utterly charm love movie added little detail find read humorous passage loud husband really enjoyed bit movie magical dreamy bit slow beginning love absolutely fall deeper love provence write good humor wickedly funny precise eye observe human nature always seem choose right word characterize people event profound sense place bring hill beloved alive much find pull summer only truly great captivate time time wonderful ever grace library mankind savor recommend great obviously fine disappointed printing feel cheap nasty gift student graduate classic story top quickly great shape", "genres": ["Memoir"], "summary": "Bathed in the warm clarity of the summer sun in Provence, Marcel Pagnol's childhood memories celebrate a time of rare beauty and delight. Called by Jean Renoir \"the leading film artist of his age,\" Pagnol is best known for such films as The Baker's Wife, Harvest, Fanny, and Topaze, as well as the screen adaptations of his novels Jean de Florette and Manon of the Springs (North Point, 1988). But he never forgot the magic of his Provencal childhood, and when he set his memories to paper late in life the result was a great new success. \r\n\r\nMy Father's Glory and My Mother's Castle appeared on the scene like a fresh breeze, captivating readers with its sweet enchantments. Pagnol recalls his days hunting and fishing in the hill country, his jaunts about Marseilles, his schoolboy diversions, and above all his family: his anticlerical father and sanctimonious uncle, his mild and beautiful mother, and many others. This bright and lively book sparkles with the charm and magic that were Marcel Pagnol's own.", "asin": "0865472572", "rank": "215808", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/51TyP2KhbxL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}