{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 14, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "great"}, {"review_sentiment": 2.0, "review_text": "I read this book because I saw the movie.  Maybe something went missing in the translation.  It is a beautiful story and I am completely disappointed.  I was so bored with this book.  I kept hoping the characters would come to life and I would care whether they lived or died.  Nope."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed this book.  The main character is very amusing and although people are dropping dead right and left somehow you leave the book with a good feeling about humanity in general.  Very quirky and well written!"}, {"review_sentiment": 3.0, "review_text": "No romance, no sex, and unattractive main character.  It is all about him, yet when he meets two special women there is no romance.  The book's only redeeming feature is the historical account of a cholera epidemic."}, {"review_sentiment": 5.0, "review_text": "Very well written, entertaing"}, {"review_sentiment": 4.0, "review_text": "This novel is very good. that is glib and simplistic. but it is. it is an exciting and intelligent story of one man trying to survive a cholera outbreak in france in the 19th century. it is a very good novel and worth the read. (ftw the best books i have read are bleak house and Ulysses)."}, {"review_sentiment": 5.0, "review_text": "This is an exciting adventure that reminds me a bit of the historical novels of Alexandre Dumas , and  Walter Scott.It deserves to be as highly regarded as; Ivanhoe, The Three Musketeers, and Queen Margot.Jean Giono is also the author of one of the best short stories of the 20th Century, The Man Who Planted Trees."}, {"review_sentiment": 5.0, "review_text": "I don't know if I'm the only one thinking like this, but.....let's start by saying I've read plenty of novels, from Dostovyeski to Stendhal, from Boris Vian to Umberto Eco, writers from present, from past, classic literature, contemporary literature, and for me this is one of the most memorable novels I've ever read. When i started reading, I didn't expect too much from it, but I was deeply impressed... The story is a thriller, the description breathtaking, detailing superb,everything is so vividly narrated...that once you start reading, you just can't stop! Angelo's character is an icon, it is so similar to a Stendhal's character in a story called San Francesco A Ripa....definitively, a book everyone liking literature must read!"}, {"review_sentiment": 4.0, "review_text": "This book is about death or, rather, life in death.  Never did the lines from the English Book of Common Prayer, \"In the midst of life, we are in death.\" reverberate so strongly for me as in the reading of this novel.  Everywhere our Romantic (in the true sense of the word) Angelo meanders throughout this meandering book people drop dead of the Cholera.  Families toss their loved ones out the window to be picked up on the streets. Angelo is chatting with a fellow one minute and the next the fellow begins vomiting, develops the tell-tale signs of cyanosis and - after a few writhings and contortions - expires.  Only Angelo himself seems immune----because, well, his name is Angelo.The best parts of the book are the hallucinatory landscapes through which Angelo passes after he crosses a certain border in his own inner landscape: \"When the boundaries between the real and unreal disappear and one can pass freely from one side to the other, one's first feeling, unexpectedly, is that the prison has contracted.\"  The prison of the world, of course.Here is a brief, random example that Giono seems to be able to conjure out of nowhere in the midst of a pleasant walk through the countryside:\"The glints of reddened light stretched out until they were like those strands of pale hair that certain spiders hang on the wind, and before disappearing, they wrapped themselves one last time around the naked branches of the trees from which, thread by thread and cautiously, they were picked off by the still-burning shadows.  The west was sighing with regret.\"The novel works best as a sort of allegory - I was reminded several times of Pilgrim's Progress - in which the short time we have on this Earth is dreadfully accentuated and in which Angelo stalks through an almost medieval landscape of representative characters.My only problem with the book is that, in the 15 years that it took Giono to write it, he seems to have lost track of certain narrative threads. This gives the book a stylistically disjointed feel. Thus, only four stars.  But, still, highly recommended.  The book casts a cold eye on human life, human values, human affections in this world where, as Angelo puts it to himself:\"Only the cholera is genuine.\""}, {"review_sentiment": 5.0, "review_text": "I don't know if the author meant for the protagonist's name (Angelo) to be symbolic, but the young man is indeed an angelic figure.  He is made of flesh, just like the rest of the people around him, but he is involnerable to the infection.  First he is an angel of compassion to the victims of the epidemic.  Later on he becomes a guardian angel to Pauline.  And yet all this time he is very matter-of-factly about his self-sacrifice.  He expects no gratitude, no retribution.  I want to believe that there are still people like him in this world."}]}, "authors": ["Jean Giono"], "isbn": "086547060X", "longitude": 0.0, "periods": ["1800s"], "title": "The Horseman on the Roof", "word_cloud": "great saw movie maybe something go miss translation beautiful story completely disappoint bore keep hop character life lived die really enjoy main character amuse people drop dead right leave somehow leave good feeling humanity general quirky well write romance sex unattractive main character yet meet special woman redeeming feature historical account cholera epidemic very well write entertain good glib simplistic exciting intelligent story man try survive cholera outbreak france century good worth ft best bleak house ulysses exciting adventure remind bit historical novel deserve highly regarded also author best short story plant tree know think start say plenty novel writer present past classic literature contemporary literature memorable novel ever start read expect much deeply impressed story thriller description breathtaking detail superb everything vividly narrate start reading character icon similar character story call everyone like literature death rather life death line midst life death reverberate strongly read true sense word meander meander people drop dead love one window pick street chat fellow minute next fellow begin vomit develops sign hypnosis writhing contortion expire only seem immune well name best part hallucinatory landscape pass cross certain border inner landscape boundary real unreal disappear pas freely side first feel unexpectedly prison contract prison world brief random example seem able conjure nowhere midst pleasant walk glint redden light stretch strand pale hair certain spider hang disappear wrap last time naked branch tree thread thread cautiously pick shadow west sigh work best sort allegory remind several time short time dreadfully accentuate stalk almost medieval landscape representative problem year take write seem lose track certain narrative thread give stylistically disjoint feel thus star still highly recommend cast cold eye human life human value human affection world put only cholera genuine know author meant protagonist name symbolic young man indeed angelic figure make flesh rest people invulnerable infection angel compassion victim epidemic become guardian angel yet time expect gratitude retribution want believe still people world", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Perhaps no other of his novels better reveals Giono's perfect balance between lyricism and narrative, description and characterization, the epic and the particular, than The Horseman on the Roof. This novel, which Giono began writing in 1934 and which was published in 1951, expanded and solidified his reputation as one of Europe's most important writers.\r\n\r\nThis is a novel of adventure, a roman courtois, that tells the story of Angelo, a nobleman who has been forced to leave Italy because of a duel, and is returning to his homeland by way of Provence. But that region is in the grip of a cholera epidemic, travelers are being imprisoned behind barricades, and exposure to the disease is almost certain.\r\n\r\nAngelo's escapades, adventures, and heroic self-sacrifice in this hot, hallucinatory landscape, among corpses, criminals and rioting townspeople, share this epic tale.", "asin": "086547060X", "rank": "1041775", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/51RjztpGSxL.jpg", "country": "FR", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}