{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 42.3604823, "ratings": {"num_ratings": 27, "rating": 3.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Fun book to reflect on every now and then."}, {"review_sentiment": 1.0, "review_text": "Dumb"}, {"review_sentiment": 5.0, "review_text": "love this"}, {"review_sentiment": 5.0, "review_text": "If you've ever wondered what it is like to be a prostitute, this book offers a lot of insight.  One among many searing moments is when Michelle and her co-worker are lost en route to a client's house.  They stop for directions. She muses about how it feels when  you walk into a 7-11 and the clerk looks at you as if you're a hooker .. and you are.  Another  one:  Michelle gets increasingly more tattoos as she goes thru her 20s; at one point, she gets some on parts of her body that will show even with conservative clothing.  She things something like, \"No on will hire me to hook with these!\"  But, sadly, someone will, as she later finds out.  Why the roller coaster of hating hooking but then coming back to it?  Only for the money.  Hooking is better than being that 7-11 clerk.  In my view, this book brings up the trouble situation of work in America.  There isn't meaningful work for everyone.  Can we change this?  Read this book and start thinking how.And see what my preschooler thought:http://youtu.be/wTsk3kzu444"}, {"review_sentiment": 2.0, "review_text": "Rent Girl is the story of a lesbian trying to make it in the world, when she finds out about her friend being an escort. Next thing you know she finds herself as a prostitute. This is where we read about her finding the work truly deplorable and how she hates men. She moves to the West coast and finds a new girlfriend and together they attempt to become drug dealers in order to visit Greece. When they realize they aren't cut out to be dealers, she gets back into prostitution, without getting the guys involved. Which is to say that she would put on lesbian shows with her girlfriend. In a nutshell, they can't afford the trip to Greece so they go to Disneyland instead.Grammatically, the book is an absolute mess. Not knowing the difference between then and than, multiple misspelled words, and half the time I wasn't really sure who was supposed to be speaking. I thought the illustrations did a good job of capturing her different emotions when it came to the difference of her being with the men, and then being with the women."}, {"review_sentiment": 3.0, "review_text": "The story was very interesting. I enjoyed reading about how in-calls and out-calls work. The stories about the clients she visited were creative but sad. The art was very complementary. It added a lot.The style of dialog bugged me. It was hard to tell who was talking. There were a lot of errors in the book. Missing letters and the wrong use of there/their/they're.It's hard to recommend it because of the errors but if you want to see what it's like to be a sex worker it's an ok read."}, {"review_sentiment": 2.0, "review_text": "An ugly book about ugly people doing ugly things to each other.  You'll feel dirty after reading this book, and you should; after all, as a purchaser of it, you've allowed the author to dip back, once more, into prostitution as a way of paying her bills.And that sounds ugly and unpleasant, but honestly, I think that's exactly what they were aiming for with this book, and they nailed it.  You can't read it without taking part in its ugliness (and yes, I think this book is purposefully, consciously and conscientiously ugly).If you're looking for something deep and soulful, this isn't it.  If you're looking for titillation, this isn't it, either.  If you're looking for a confessional leavened with snide and self-awareness, yes, this is exactly what you're looking for.  Very slices-of-life sort of thing."}, {"review_sentiment": 3.0, "review_text": "After reading \"Valencia,\" I decided to check out Michele Tea's \"Rent Girl,\" a collaborative graphic novel style memoir about the author's years as a prostitute in Boston and, briefly, San Francisco. I loved the style and aesthetic of this book (even though a bizarre number of the illustrations were just pictures of Tea in various outfits, facing the viewer with this \"let me tell you how it is\" look on her face).The prose was stylistically similar to Tea's other work, but more focused on the topic at hand. The author spends little time discussing her own emotions, thought processes and even her own life outside work and the people she worked with. This book is interesting not because Tea offers compelling characters or a fully developed life story, but because she explains frankly and unabashedly what prostitution is like.Overall, it was a good read, but not as absorbing as some of her other work."}, {"review_sentiment": 5.0, "review_text": "This book should come with a warning: I couldn't stop reading it, and then I couldn't sleep when I finished it.I don't know how I stumbled onto it, but I bought it more out of curiosity than anything else.  Michelle Tea weaves a tale of a terrible gospel--there is The Fall, The Suffering, The Awareness--but alas, no salvation.  Over and over again, I kept wondering why she was doing this to herself and to other people, but there's no answer, even to her.  The book is gritty, and Tea herself is not a character the reader ever likes--but her perception of life very much on the edge is what makes this graphic novel so readable.This is not an elegant \"Belle de Jour\" story of prostitution, and parts are frightening.  Some of the men she is alone with--she knows--want to  rape and murder women or little girls.  Tea repeats feminist ideas to herself, as though to remind the reader that she is still liberated, but the ideas never materialize--after all, what does feminism mean with this kind of life?But that question is the purpose of the story.  Tea is still a feminist, a believer of sorts, but her life and her choices are her own.  She is a snarling, sarcastic lover of women.  She doesn't apologize for it, or make excuses.  She never tries to be a nice girl at all.  She develops a deep insight into her own actions, and the actions of the men who rent her by the hour--and all this without a bit of compassion.So you're wondering if you  should read it?  I'd say yes--but don't expect any resolution at the end"}, {"review_sentiment": 2.0, "review_text": "Ultimately, this book leaves me cold. The premise sounds good, a lesbian hooker's kiss and tell plus pictures but after a promising beginning, describing an invite-only party her madame throws the story falters. The main reason for this is that the narrator appears to have only one attitude towards other people: sneering contempt. This doesn't say much about these other people but it says a lot about the narrator. And thus one loses interest in her rapidly.Add atrocious (i.e. non-existent) editing, numerous spelling errors and the constant substitution of `than' with `then' and the picture that emerges is that of an author who appears to think that a memoir is worth reading simply because the author happens to be a part of the queer community. I am sorry, but it is not. Being self-absorbed and condescending doesn't make you a good writer, queer or not. I'd much rather read Dorothy Allison or Patrick Califia for that matter.A shame, really, because the idea does sound good and the illustrations by Laurenn McGubbin are quite nice."}]}, "authors": ["Michelle Tea"], "isbn": "0867196203", "longitude": -71.0595678, "periods": ["2000s", "Recent Releases"], "title": "Rent Girl", "word_cloud": "reflect dumb love ever wonder prostitute offer lot insight many sear moment lose route client house stop direction muse feel walk clerk look hooker get increasingly tattoo go thru point get part body show even conservative clothing thing something hire hook sadly someone later find roller coaster hat hook come back only money better clerk view brings trouble situation work meaningful work everyone change start think see preschooler thought http story lesbian try make world find friend escort next thing find prostitute finding work truly deplorable hate men move coast find new girlfriend together attempt become drug dealer order visit realize cut dealer get back prostitution get guy involve say lesbian show girlfriend nutshell trip go absolute mess not know difference multiple misspell word half time really sure suppose speaking think illustration good job capture different emotion come difference men woman story interest enjoy read work story client visit creative sad art complementary add style dialog bug hard tell talk lot error miss letter wrong use hard recommend error want see sex worker ok ugly ugly people ugly thing feel dirty reading purchaser allow author dip back prostitution way pay sound ugly unpleasant honestly think exactly aim nail take part ugliness yes think purposefully consciously conscientiously ugly look something deep soulful look titillation look confessional leavened snide yes exactly look very sort thing read decide check collaborative graphic style memoir author year prostitute briefly love style aesthetic even bizarre number illustration picture various outfit face viewer let face stylistically similar work focus topic hand author spend little time discuss emotion think process even life outside work people work interesting offer compel character fully developed life story explain frankly unabashedly prostitution good absorbing work come warning reading finish know stumble buy curiosity anything else weave tale terrible suffer ala salvation keep wonder people answer even gritty character ever like perception life much edge make graphic elegant story prostitution part frighten men alone know want rape murder woman little girl repeat feminist idea remind still liberate idea never materialize feminism mean kind life question purpose story still feminist believer sort life choice snarl sarcastic lover woman make excuse never try nice develop deep insight action action men hour bit wonder say expect resolution end ultimately leave cold premise sound good lesbian hooker kiss tell picture promise begin describe party madame throw story falter main reason narrator appear attitude towards people sneer contempt say much people say lot narrator thus lose interest atrocious edit numerous spell error constant substitution picture emerge author appear think memoir worth read simply author happen part queer community sorry be condescend good writer queer much rather shame really idea sound good illustration quite nice", "genres": ["Comics & Graphic Novels", "Fiction & Literature"], "summary": "Publishers Weekly called Michelle Tea \"\"a modern-day Beat, a kind of pop ambassador to the world of the tattooed, pierced, politicized and sex-radical queer-grrls of San Francisco. [She] dramatizes the hopes and hurts, apathies and ambitions of young lesbians looking for love in the Mission District.\"\" \r\n\r\nRent Girl continues Tea's graphic and uncompromising autobiographical bender, telling the story of her years as a prostitute, with provocative and richly illustrated work by Laurenn McCubbin.", "asin": "0867196203", "rank": "574075", "city": "Boston", "image": "https://images-na.ssl-images-amazon.com/images/I/512N6WV7PDL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}