{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 45.5202471, "ratings": {"num_ratings": 6, "rating": 3.3, "reviews": [{"review_sentiment": 2.0, "review_text": "While the book offers an interesting insight into the early jazz age in Portland and the long forgotten clubs around town, it fizzles out as it gets into the 1950's.  Perhaps the author lost interest in the subject as several cubs and prominent local musicians were ignored.  And while the Monte Ballou's Diamond Horseshoe was mentioned, the author fails include other famous clubs including Orleans Alley. And what happened to the Horseshoe and why did the Castle Jazz Band become the house band at Orleans Alley? Lots of unanswered questions. The glaring omissions of some of the better musicians of the era including Ed Zimbrick, Norm Domeries, George Baker, Lynn Teadke, and others is enough question the authors true knowledge of the jazz history of Portland.  With a little more research it could have been a pretty good book. Unfortunately there's just too many places and people missing, and the Portland jazz scene wasn't that big . I'll give it a D....at best."}, {"review_sentiment": 2.0, "review_text": "I was intersted in this because I am a Portland OR native and also am acquainted with Mr. Dietsche.Alas, I have to report that this thin volume doesn't do it's subject justice nor is the author a skilled enough writer to hold the reader's attention with a compelling narrative.The content explains in at least a minimal way the locations and occurrences but doesn't have any insightful analysis of the subject musical world nor of what happened to it afterwards.The author is known for being a former part owner of a record store and a leader of musical appreciation classes.He is not known for being a musician either as a leader or member of a successful performing group.Maybe this lack of real world experience leads him to use the tired old Portland mythology that the public entityreconstruction of the area where the Afican American music clubs were located was racist in motivation.The fact is a proportional number for whites, both owners and renters, were displaced at that time."}, {"review_sentiment": 3.0, "review_text": "A visitor to Portland today might not realize that the city has a rich history in jazz. Fueled by the shipbuilding boom of World War Two, the city's black population grew rapidly throughout the 40's, creating a vibrant community on the east bank of the Willamette. This was a land of wild nightclubs, neighborhood bars, shady speakeasies that were open all night. Big names came to play, artists like Duke Ellington, Dizzie Gillespie, and Louis Armstrong, but the city also produced a number of local talents, like Wardell Gray and Doc Severinsen. It was not, however, to last; the construction of the Memorial Coliseum wiped out much of the jazz scene, and much of its history was lost. Dietsche's Jumptown: The Golden Years of Portland Jazz sets out to record that lost history.Jumptown is by-and-large a narrative prose history. The story of the Portland jazz scene flows generally in a chronological line from the 1940s through to the 1980s, with each chapter focusing on a particular location that was key to the jazz of the time. The text relies heavily on direct research, consisting primarily of interviews with direct participants; many quotes and extended passages are included verbatim. Supporting this are numerous photos, many culled from those individuals. There are also reproductions of numerous LPs including recordings of local talents.This work contains a wealth of information on the history of Portland music and Portland's black neighborhoods. The book is not written for jazz neophytes however; many portions seem to be a stream of name-dropping, as if the book is a bop version of the Chronicles in the King James' Bible. Without this context, many passages will feel confusing or dense, and even with it, it seems to be more a who's who list than a story. The book does yield up some gems of local history, however, including the locations of most of the big clubs and some entertaining anecdotes in the words of witnesses and participants themselves.The book is printed in the dimensions of a typical hardbound book, but is in a softcover trade paperback binding. Paper weight is smooth and the photos are reproduced adequately. The back of the book contains a discography of Portland-related music that proves handy.Though a bit thin, the book is the only work I am aware of dedicated specifically to Portland jazz culture. Jazz lovers will no doubt understand the laundry list of names better than the average reader, and there is enough obscure history of the city that it will prove a worthy edition for Portland historians wishing for a truly broad library."}, {"review_sentiment": 5.0, "review_text": "A plethora of information on the Portland,OR jazz scene of the 40's & 50's.  The author sets each chapter with a wonderful historical context that brings a real vivacity to the text.  There are a multitude of pictures and the format of the book is extremely inviting.  The book is packed with useful knowledge in a reader friendly manner.  Increase your jazz info and read!"}, {"review_sentiment": 4.0, "review_text": "This book offers insight into the Portland music scene not availableanywhere else.  Lots of detail, and reasonably well written."}, {"review_sentiment": 4.0, "review_text": "This is an informative book telling about local developments in jazz. In order to judge what jazz means across America there is a need for more local histories."}]}, "authors": ["Robert Dietsche"], "isbn": "0870711148", "longitude": -122.6741949, "periods": ["1900s"], "title": "Jumptown: The Golden Years of Portland Jazz, 1942-1957", "word_cloud": "offer interest insight early jazz age long forgotten club around town fizzle get perhaps author lose interest subject several cub prominent local musician ignore mention author fails include famous club include happen house band unanswered question glaring omission better musician era include others enough question author true knowledge jazz history little research pretty good unfortunately many place people miss jazz scene big give best interest native also acquaint report thin volume subject justice author skilled enough writer attention compel content explains least minimal way location occurrence insightful analysis subject musical world happen author know former part owner record store leader musical appreciation know musician leader member successful perform lack real world experience lead use tired old mythology public entity reconstruction area african music club locate racist fact proportional number white owner renter displace time visitor today city rich history jazz fuel shipbuilding boom city black population grow rapidly create vibrant community east bank land wild nightclub neighborhood bar shady speakeasy open night name come play artist city also produce number local talent however last construction wipe much jazz scene much history lose set record lose narrative prose history story jazz scene flow generally chronological line chapter focus particular location key jazz time text rely heavily direct research consist primarily interview direct participant many quote extend passage include verbatim numerous photo many culled individual also reproduction numerous include recording local work contain wealth information history music black neighborhood write jazz neophyte however many portion seem stream bop version context many passage feel confuse dense even seem list story yield gems local history however include location big club entertain anecdote word witness participant print dimension typical hardbound softcover paperback bind weight smooth photo reproduce adequately back contain discography music prove bit thin work aware dedicate specifically jazz culture lovers doubt understand laundry list name better average enough obscure history city prove worthy edition historians wish truly broad library plethora information jazz scene author set chapter wonderful historical context brings real vivacity text multitude picture format extremely invite packed useful knowledge friendly manner jazz info offer insight music scene available anywhere else detail reasonably well write informative tell local development jazz order judge jazz mean need local history", "genres": ["History", "Music", "Pop Culture"], "summary": "A fascinating blend of music, politics, and social history, Jumptown sheds light on a time and place overlooked by histories of Portland and jazz. \r\n\r\nFor a golden decade following World War II, jazz talent and musical activity flourished in Portland. A thriving African American neighborhood--that would soon be bulldozed for urban renewal--spawned a jazz heyday rarely rivaled on the West Coast. Such luminaries as Duke Ellington, Charlie Parker, Oscar Peterson, Dave Brubeck, and Wardell Gray headlined Portland clubs and traded chops with the up-and-coming local talent. \r\n\r\nThe Dude Ranch. Lil' Sandy's McClendon's Rhythm Room. The Frat Hall. The Chicken Coop. The Uptown Ballroom. Jazz historian Bob Dietsche leads a guided tour of the main jazz spots--from supper club to dance hall--capturing the emotion, excitement, and energy of an evening on the town. His book for the first time collects hundreds of pieces of local jazz history--photographs, personal recollections, reviews, maps, handbills--to create \"an anatomy of a jazz village.\" Dietsche's compendium of stories and moments brings to life the citizens of the jazz village--the musicians and dancers, the disc jockeys and promoters, the critics and music teachers, the club owners and patrons. \r\n\r\nJumptown celebrates and preserves this rich cultural past and showcases its continuing influence. In an afterword, Lynn Darroch recaps the highlights in Portland jazz since 1968 and shows how \"Portland's twenty-first-century jazz scene reflects the city's original golden age, and the spirit of the Avenue remains in the sounds of today.\"", "asin": "0870711148", "rank": "2191089", "city": "Portland", "image": "https://images-na.ssl-images-amazon.com/images/I/51R23GGD20L.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}