{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 21, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "Gertrude Stein's decades long fascination with all things French - country, Paris, people. A quick read and several revelations. The particular Stein language and punctuation are sometimes rather irritating. \"Do Americans perhaps think that the world is flat because of their continent just as Europe knows it is round because Columbus sailed from Europe to prove it and even if he did hit up against a flat continent he was sure of it.\" Yes, indeed,"}, {"review_sentiment": 4.0, "review_text": "Paris France - Gertrude SteinGertrude Stein is a famous literary figure, though  only two literary lines of hers are well known: \"A Rose is a rose is a rose\", which hurt no one, and the unfortunate characterization of Oakland California, her birthplace as \"there is no there there.\"  The rose has survived the Steinism, but poor Oakland has been struggling for proper respect ever since.  [Full disclosure: I am an Oakland native]I hoped this group of musings would be a good counterpart to Ernest Hemingway's \"A Moveable Feast\", his memoir about Paris in the 1920's. However, it was published in 1940, just as the Second World War was revving up, not in the Golden 20s.  Misleadingly titled,  it is not really focused on Paris, but on the differences between the French and the English, and between the French of the countryside where Stein had a summer home vs. those of the city, and whether if your dog dies you should replace it with another of the same breed or with something completely different. There is also a wonderful section about a young girl named Helen Button (Bouton in French) and the difference between normality, war, and \"wartime\" through a child's eyes. Stein has a Humpty Dumpty habit - as the egg famously said in Caroll's \"Alice through the Looking Glass\", \"When I use a word it means exactly what I choose it to mean, neither more nor less.\"  Thus Stein talks a lot about the French being \"logical\" \"civilized \", \"fashionable\" and \"exciting\" , but these words seem to mean something a little different in her private lexicon.  Thus you have dictums such as \"There are two sides to a Frenchman, logic and fashion, and that is the reason why French people are exciting and peaceful\".I couldn't make anything of that, no matter how much I re-read the preceding sections.  But much of Stein's musings still seem strangely apt 75 years after publication, particularly her thought of how each century must go through its tortured adolescence.If you are hungry for action, events, dropping of famous names, lyrical description, or other common literary means of maintaining reader interest, be warned that Stein scorns such common tricks. If you like playing with words and thinking in sweeping generalizations without having to worry about plot, continuity, or characters, this is a fine bedside book."}, {"review_sentiment": 5.0, "review_text": "Delightful, this is read as if Stein was talking to you, and is filled with poetry."}, {"review_sentiment": 5.0, "review_text": "MY FAVORITE PLACE IN THE WHOLE WORLD AND MY FAVORITE AUTHOR NEED MORE STARS, ANOTHER 10 OR SO"}, {"review_sentiment": 4.0, "review_text": "Many interesting insights about the French national personality and what holds them together as a distinct culture.  Of course her prose is unique and challenging to read, with many quotable lines.  Enjoyed this short read."}, {"review_sentiment": 1.0, "review_text": "I am very fascinated by Gertrude Stein as a patron of the arts. Despite being a tiny book it took me long time to read it as it is probably the most boring book I have ever read. She was great at collecting art and supporting the famous artists of modern time - yet to me a poor writer."}, {"review_sentiment": 3.0, "review_text": "I love her, but her run on sentences and lack of punctuation does drive me crazy.  I must agree with Hemingway on that one.  She becomes too scattered in spots...redundant in others.  I was hoping to do a comparative between the Paris she saw during that period of time and Hemingway's Movable Feast view from the same time.  However, it still gives me insight into her mind and what was important issues to her."}, {"review_sentiment": 1.0, "review_text": "An acquired taste I have yet to acquire."}, {"review_sentiment": 5.0, "review_text": "Much more readable than much of Stein's work, this book is a love biography to Paris."}, {"review_sentiment": 5.0, "review_text": "This book is typical Gertrude Stein: full of witticisms and hard to understand statements!  I read it thru and wondered what I read, it was that good. I don't know if she was writing in a 'tough in cheek' sort of way but that was not her style. All in all it was a delight to read and re-read as it is classic 'Gertrude Stein'"}]}, "authors": ["Gertrude Stein"], "isbn": "0871403749", "longitude": 2.3514992, "periods": ["1900s"], "title": "Paris France", "word_cloud": "decades long fascination thing french country people quick several revelation particular language punctuation sometimes rather irritate perhaps world flat continent know round sail even flat continent sure indeed famous literary figure literary line well know rise rise hurt unfortunate characterization birthplace rise survived poor struggle proper respect ever disclosure oakland native hop group musing counterpart memoir however publish second rev title really focused difference french countryside summer home city dog dy breed something completely different also wonderful section young girl name difference normality war wartime child eye habit egg famously say use word mean exactly choose mean le thus talk lot french logical civilize fashionable exciting word seem mean something little different private lexicon thus dictum side logic fashion reason french people excite peaceful anything matter much precede section much musing still seem strangely apt year publication particularly thought century tortured hungry action event drop famous name lyrical description common literary mean maintain interest warn scorn common trick play word think sweeping generalization worry plot continuity character fine bedside delightful talk fill poetry favorite place many interesting insight french national personality hold together distinct culture course prose unique challenge many quotable line short fascinate patron art tiny take long time probably bore ever great collect art support famous artist modern time yet poor writer love sentence lack punctuation drive crazy become scattered spot redundant others hop comparative saw period time view time however still give insight mind important issue acquired taste yet much readable much work love biography typical full witticism hard understand statement thru wondered good know write cheek sort way style delight classic", "genres": ["Memoir"], "summary": "Matched only by Hemingway’s A Moveable Feast, Paris France is a \"fresh and sagacious\" (The New Yorker) classic of prewar France and its unforgettable literary eminences.\r\n\r\nCelebrated for her innovative literary bravura, Gertrude Stein (1874–1946) settled into a bustling Paris at the turn of the twentieth century, never again to return to her native America. While in Paris, she not only surrounded herself with―and tirelessly championed the careers of―a remarkable group of young expatriate artists but also solidified herself as \"one of the most controversial figures of American letters\" (New York Times).\r\n\r\nIn Paris France (1940), Stein unites her childhood memories of Paris with her observations about everything from art and war to love and cooking. The result is an unforgettable glimpse into a bygone era, one on the brink of revolutionary change.", "asin": "0871403749", "rank": "312921", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51mE0C%2Bd6FL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}