{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 10, "rating": 3.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Good stuff...my husband loves it."}, {"review_sentiment": 4.0, "review_text": "Quick shipping, a good book purchased after visiting New Orleans and shopping at Faulkner's home.  A gift that was well liked."}, {"review_sentiment": 1.0, "review_text": "I'm not too sure what those 400 pages were about. I THINK it was a boat ride down the river. I couldn't really tell because it rambled on and on about nothing. Someone was lost overboard, I think. A Mr. Tallifero wonders why he can't attract women. Beyond that, nothing. The epilogue is atrocious and unnecessarily long. Did I say this book was horrible yet?"}, {"review_sentiment": 5.0, "review_text": "One of Faulkner's funniest novels, often overlooked, full of irony including towards himself -or the author, who makes a Hitchcock -like appearance at one point only to be mockingly disparaged.His first quality novel, 1927, (the previous, and historically earliest one, actually considered of far greater import, though to my mind a quasi-romance novel) is already  perfect. The humor, tragedy, breathtaking style and other recurring motifs, such as class distinctions in the South prominent, displayed in a cruel, tragic or grotesque fashion. Hence, for instance, the humiliation of the protagonist, Taliafero,forever playing hide-and-seek with himself and those around him,  when a young New Orleans girl correctly pronounces his surname as 'TARVER'. Other characters are nameless, such as \" The Poet\", akin to set-types in medieval Morality plays; the Poet does not seem to produce any work, but looks gloomy on cue and speaks with the mandatory terseness and foreboding. The plot, as typically in Faukner, is overwelwelmed by the writing. The novelist was a poet, the art form he valued over all others and considered he had failed at. His  generosity of spirit hence prevails."}, {"review_sentiment": 3.0, "review_text": "Quite unlike many of Faulkner's later novels, _Mosquitoes_ is not nearly as densely written as those.  In _Mosquitoes_ there were few if any run on sentences.  It is a fairly easy book to read, but I found it far less interesting and fairly inconsequential compared to the other novels.  I would call the novel a human interest, if not soap opera type of story.  The passengers are brought together for a four day pleasure boat ride, on a yacht owned by the wealthy Mrs. Maurier, a patroness of the arts.  On the yacht were writers, poets, and artists of all sorts.  Based on the book's introduction and epilogue, Faulkner described about some of the male passengers based on writers that he personally knew.  Some of the passengers were interested in meeting people of the opposite sex for romantic purposes.  The conversations over heard in the novel were not particularly stimulating.One of the patrons, Mr. Talliaferro, a lonely widower, had particular difficulty in relating to women.  He came to believe that he was too much of a shy, retiring personality for women to be interested in him.  Toward the end of the book he concludes that if only he could break out of his shell, and be forceful with women, they would fall into his lap.Included on the guest list were Mrs. Maruier's nieceand nephew.  Mr. Talliaferro develops an interest in Jenny, a friend of Mrs. Maurier's niece, but Jenny does not return the favor to Mr. Talliaferro.  In fact the nephew steals a certain part of the yacht's engine he needed for an experiment he was working on.  The result was that the yacht became stranded for several days.  Jenny runs off with the boat's steward, which results in their getting temporarily lost._Mosquitoes_ does not delve deeply into the passenger's characters and personalities, but its occasional humor and mild adventures keep the story moving to some extent.  I would suggest that one should read some of Mr. Faulkner's latter novels to get the taste of the Faulkner style of writing, which, while rather complex, are far more interestingly plotted."}, {"review_sentiment": 5.0, "review_text": "They could not refuse, or ignore, the invitation from the middle-aged, dowdy matron of the arts. After all, her money provided endowments for many of these writers, poets, sculptors, and other assorted vain mediocrities. The ulteriorMotive was to introduce her hypersensitive niece and her border-line eccentric nephew to this hokum of hoi polloi, who spoke in worthless nonsensical language most of the time to create a mystic, and elevate the worth of their product-- themselves. They wandered about, drink in fist, drinking heavily, bantering to avoid serious conversations. Their eyes and thoughts followed the meandering paths of the two younger women. Lust was written on their faces and danced a jig in their eyes.The quirky niece decides to leave the boat with the handsome, persuasive steward. It was a lark, a spur of the moment thing, that became an endurance ordeal as they slogged through swampy swordgrass and reeds, alert for water moccasins and gators in the lowlands while fighting off blood thirsty mosquitoes. It took longer, and was a lot farther, than they had believed. With her hair looking like a fright wig, wading barefooted in the swamp, she abated her tears, all spunk momentarily lost, distracted by every imagined danger.They laughed, giggled, then fell into a mind-boggling realization that they were lost, and might well become, flavor tidbits of gator bait.This is a high-spirited romp that reveals another humorous side of the very gifted, and prolific author, William Faulkner."}, {"review_sentiment": 4.0, "review_text": "While I didn't like this novel quite as much as Soldier's Pay, Faulkner's first novel, it was consistently entertaining with many superbly crafted moments.  A middle-aged, dowdy matron of the arts invites a group of intellectuals/artists (e.g., a writer, a poet, a sculptor) and assorted other hangers-on for a disastrous (at least for the matron) cruise on an inland waterway in the Deep South.  Also on the cruise are the matron's highly independent, idiosyncratic niece and nephew, other friends of the matron, various crew members, and a young couple who were just passing by when the boat was leaving port.  The intellectuals spend most of their time drinking heavily and engaging in hard-to-follow intellectual banter, while lusting over the two alluring, attractive, very different young women on board.  When the boat breaks down because the nephew steals an important part of the engine in order to complete an invention on which he's working, the beautiful, boy-like, ultra-quirky niece and a handsome steward leave the boat without telling anyone and get lost in the swampy, mosquito-infested, steaming lowlands, trying to make their way to a town that is much farther away than they think.  This was the most serious and by far the most compelling subplot in the novel to me, and it runs quite a few pages.  Extremely atmospheric and very humorous, the book provided me with an enchanting reading experience, albeit most of the characters were not very admirable people and one may wonder exactly what the point of the exercise was after completing it."}, {"review_sentiment": 5.0, "review_text": "Mosquitoes is not what one would expect of Faulkner, which should not diminish one's enjoyment of the story.  It is humorous and satirical.  Absent Faulkner's typical familial, historical, and cultural baggage, his characters in Mosquitoes still agonize, which makes them interesting.  Let Faulkner surprise you.  Enjoy the characters he gives us here and their comedic byplay.  Absorb what he has to say about art and writing, in particular.  You won't get it anywhere else.  Try not to compare Mosquitoes to his other work; it is what it is, a slow boat loaded with pleasure."}, {"review_sentiment": 5.0, "review_text": "A deep and continuous source.  Reflects the popular misconception of what it means to live the highly creative life of an artist.  Title refers to Confucious quote that intellectual mosquitoes get their lives by sucking  others ideas. play for mosquitoes and everyone in between  a mosquito  my libido"}, {"review_sentiment": 3.0, "review_text": "This was not a bad not a bad book.  I had to say that initially.  For some other authors, this book could have been their masterpiece.  The problem though, is that this is a Faulkner book.  Faulkner reinvented the use of the English language in all the Yoknapatawpha books.  The problem is that when you compare something as compicated as a Yoknapatawpha novel to anything else, it has to fall short.  The plots of other Faulkner books are so dense and full of sybolism.  Mosquitoes is not dense.  It has a very mundane story about people on a boat.  This, like other Faulkner novels revolves around the nature of human beings and their interactions.  This novel is a more dialectical one in comparison to some of he other novels of his. We do not have the dark humor here that there is in a novel such as AsI Lay....  The epilogue redeems the novel with some of the dense writingthat Faulkner is notorious for.  Read this after you read several other Faulkner novels."}]}, "authors": ["William Faulkner"], "isbn": "0871403110", "longitude": -90.0701156, "periods": ["1900s"], "title": "Mosquitoes", "word_cloud": "good stuff husband love quick shipping good purchase visit shopping home gift well like sure page think ride river really ramble nothing someone lose overboard think tallier wonder woman nothing epilogue atrocious unnecessarily long say horrible yet funniest novel often overlook full irony include towards author make appearance point mockingly first quality previous historically earliest actually consider far greater import mind already humor tragedy breathtaking style recur motif class distinction prominent display cruel tragic grotesque fashion instance humiliation protagonist forever play around young girl correctly pronounces surname other character akin medieval play seem produce work look gloomy cue speaks mandatory terseness forebode plot typically overwelwelmed write novelist poet art form value others consider fail generosity spirit hence prevails quite many later novels nearly densely write run sentence fairly easy find far le interesting fairly inconsequential compare novel human interest soap opera type story passenger bring together day pleasure boat ride yacht own wealthy patroness art yacht writer poets artist sort base introduction epilogue describe male passenger base writer personally know passenger interested meeting people opposite sex romantic purpose conversation hear particularly patron lonely widower particular difficulty relate woman come believe much shy retire personality woman interested end concludes forceful woman guest list niece and nephew develop interest friend niece return favor fact nephew steal certain part yacht engine need experiment work result yacht become stranded several day run boat steward result get temporarily deeply passenger character personality occasional humor mild adventure story move extent latter novel get taste style write rather complex far interestingly plotted ignore invitation dowdy matron art money provide endowment many writer poet sculptor assort vain mediocrity ulterior motive introduce hypersensitive niece eccentric nephew hokum ho poll oi speak worthless nonsensical language time create mystic elevate worth product wander drink fist drink heavily banter avoid serious conversation eye thought follow meander path younger woman write face dance jig quirky niece decides leave boat handsome persuasive steward lark spur moment thing become endurance ordeal slog swampy sword grass reed alert water moccasin gator lowlands fight blood thirsty take longer lot farther believe hair look fright wig wad barefooted swamp abated tear spunk momentarily lose distract imagine laugh giggle fell realization lost well flavor tidbit gator romp reveals humorous side gift prolific author like quite much first consistently entertain many superbly craft moment dowdy matron art invite group writer poet sculptor assort disastrous least matron cruise inland waterway also cruise matron highly independent idiosyncratic niece nephew friend matron various crew member young couple pass boat leave port intellectual spend time drink heavily engage intellectual banter lust allure attractive different young woman board boat break nephew steal important part engine order complete invention work beautiful niece handsome steward leave boat tell anyone get lose swampy steam lowlands try way town much farther away serious far compel subplot run quite page extremely atmospheric humorous provide enchant read experience character admirable people exactly point exercise completing diminish enjoyment story humorous satirical typical familial historical cultural baggage character still make interesting character give comedic byplay say art write particular anywhere else compare slow boat load pleasure deep continuous source popular misconception mean live highly creative life artist refer confucius quote intellectual get life suck others idea play everyone mosquito libido bad bad say initially author problem reinvent use english language yoknapatawpha problem compare something complicate anything else short plot dense full symbolism mundane story people boat like novel revolve nature human being interaction dialectical comparison dark humor epilogue redeem dense notorious several novel", "genres": ["Fiction & Literature"], "summary": "“Full of the kind of swift and lusty writing that comes from a healthy, fresh pen.” Lillian Hellman\r\n\r\nA delightful surprise, Faulkner’s second novel introduces us to a colorful band of passengers on a boating excursion from New Orleans. This engaging, high-spirited novel―which Faulkner wrote “for the sake of writing because it was fun”―offers a fascinating glimpse of Faulkner as a young artist.", "asin": "0871403110", "rank": "1062772", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/41ER7rkWipL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}