{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 12, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Funny, weird, originally written and somehow, for me at least, sometimes moving too. Do not know if life can be so adventurous, full of hazard as Donleavy shows, but wish it could. Love this author, so can do nothing but warmly recommend it. Everybody will enjoy with Donleavy, is what I think. Good Literature means many things and Donleavy has some of them."}, {"review_sentiment": 5.0, "review_text": "Politically incorrect, right is wrong, wrong is right, mayhem everywhere, and filled with gut busting laughs."}, {"review_sentiment": 5.0, "review_text": "this book is a riot. grotesque, bizarre, extremely funny. very much over the top. and yet, there is some philosophical depth implicit in it as well. one can tell that donleavy was probably a fan of henry miller's writings and in my opinion he exceeds him. i found the book quite inspirational. an excellent read to chase away the blues."}, {"review_sentiment": 5.0, "review_text": "Donleavy is the master of criticism of our pompous presumptions.  He skewers the idiotic, the banal and the pattern of NY life.  He makes it a pleasure to shed a tear in sorrow, immediately to be followed by guffaws of contempt for our own weaknesses.  Love it."}, {"review_sentiment": 5.0, "review_text": "Just a very good read in my opinion."}, {"review_sentiment": 5.0, "review_text": "I'm still not sure why this hasn't been turned into a movie..it's so classic!!!  This book is so original and fresh.  And, also very, very, very funny full of dark wit.  I so recommend this book."}, {"review_sentiment": 3.0, "review_text": "pretty beat up copy.  i know that the books are cheap but you could at least take those pesky stickers off"}, {"review_sentiment": 4.0, "review_text": "Hard to review this since my eyes are full of tears from laughing.  I own all of Donleavy's books and would rate this his best.  Yes, even better than \"The Ginger Man\". (Incidentally, there is a non-fiction work \"The Making(?) of the Ginger Man\", which should be read right before curling up with any Donleavy's novels."}, {"review_sentiment": 4.0, "review_text": "The Fairytale is another of Donleavy's masterworks.  This story is told with Donleavy's unique kind of stream of consciousness narrative style, changing lanes from third person long shots to first person details at the cutting edge of his narrator's second-by-second experience. This is a story teller in complete control of the telling, if not of the story itself, sad and funny by turns.There is a line from a Joni Mitchell song:  \"laughing and crying, you know it's the same release...\"That's a perfectly succinct summary of the experience of reading this marvel of a novel."}, {"review_sentiment": 5.0, "review_text": "My Irish father bought this book years ago, one rainy day in a department store, He dragged me up the the top floor, I remember because he was very keen to get the latest J P Donleavy novel. After he had read it, I picked it up to see what all the fuss was about, and I was hooked immediately! After this I moved onto the Ginger Man then all his others, but this one's the best for me, this book is a classic!"}]}, "authors": ["J. P. Donleavy"], "isbn": "0871132648", "longitude": 0.0, "periods": ["1900s"], "title": "A Fairy Tale of New York", "word_cloud": "originally write somehow least sometimes move life adventurous full hazard show wish author nothing warmly think good mean many thing politically incorrect right wrong wrong right mayhem everywhere fill gut bust laugh riot grotesque bizarre extremely funny much top yet philosophical depth implicit well tell donleavy probably fan henry miller writing opinion exceeds find quite inspirational excellent chase away blue master criticism pompous presumption skewer idiotic banal pattern life make pleasure shed tear sorrow immediately follow guffaw contempt weakness love just good opinion still sure turn classic original fresh also funny full dark wit recommend pretty beat copy know cheap pesky sticker review eye full tear laugh rate even better work right curl novel masterworks story tell unique kind stream consciousness narrative style change lane third person long shot first person detail cut edge narrator experience story teller complete control tell story sad funny line song laugh cry know release perfectly succinct summary experience reading marvel irish father buy year ago rainy day department store drag top floor remember keen latest pick see fuss hook immediately move onto others best classic", "genres": ["Fiction & Literature", "Humour"], "summary": "A Fairy Tale of New York is a funny, lusty, and sad novel of comic genius. Returning from study abroad, Cornelius Christian enters customs with his luggage and his dead wife. His first encounter in New York is with a funeral director, with whom he reluctantly takes employment to pay for the burial expenses. \r\n\r\nIn the course of his duties he meets the beautiful Fanny Sourpuss over her millionaire husband's dead body. However, his over-enthusiastic handling of his first corpse lands him in court. Cornelius Christian wanders through the great sad cathedral that is New York, examining the human condition in all its comic pathos and lonely absurdity. \r\n\r\nWhether lingering in the Automat drinking from half empty coffee cups and stealing baked beans from the plates of customers who go looking for ketchup, or finding love on a street corner only to end up fighting his way out of a hooker's fists, Cornelius Christian, heroic anti-hero, sings of life's goodness in the wake of disaster.", "asin": "0871132648", "rank": "366787", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51X23af3FbL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}