{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 21, "rating": 4.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Wonderful series! Happy to find! Did not know was in papers... not available in our papers.☹️"}, {"review_sentiment": 5.0, "review_text": "Great book! Cool art and conversations. Great conversation piece!"}, {"review_sentiment": 5.0, "review_text": "Paul Madonna is a genius. His simple yet elegant ink wash painting are marvelous. This is my favorite book. He is truly an inspiration."}, {"review_sentiment": 5.0, "review_text": "A delightful walk down memory lane."}, {"review_sentiment": 5.0, "review_text": "Has got me chacking up! The mixture of art and comedy is fantastic, besides, the subtelty with which they are portrayed is inspiring. My favorite one so far is attached"}, {"review_sentiment": 5.0, "review_text": "If you grew up in The City, you'll love these."}, {"review_sentiment": 5.0, "review_text": "Beautiful soft drawings. Wish I had an original!  Thanks Mr. Madonna."}, {"review_sentiment": 5.0, "review_text": "Gorgeous book, fantastic artwork and great 'lazy afternoon' thoughts to go along with it. Really 5 stars."}, {"review_sentiment": 5.0, "review_text": "The artwork are so great! Love this book!"}, {"review_sentiment": 5.0, "review_text": "I love SF's architechture, and I love Madona's drawing.  And the book finally explains how he came up with the title as well."}]}, "authors": ["Paul Madonna"], "isbn": "0872864561", "longitude": -122.4192363, "periods": ["2000s", "Recent Releases"], "title": "All Over Coffee", "word_cloud": "wonderful series find paper available art conversation conversation piece genius simple yet elegant ink wash paint marvelous favorite truly inspiration delightful walk memory lane get sack mixture art comedy fantastic subtlety portrayed inspire favorite far attached grow love beautiful soft drawing wish original thanks gorgeous fantastic artwork great afternoon thought go along really star artwork great love sf architecture love drawing finally explain come title well", "genres": ["Comics & Graphic Novels", "Fiction & Literature"], "summary": "In February 2004, the San Francisco Chronicle began printing an enigmatic feature called “All Over Coffee.” Almost immediately, letters of love and hate, confusion and praise poured in. Accustomed to the familiar formats of comic strips and cartoons, some readers struggled to understand a creation that seemed to live both within and beyond those boundaries.\r\n\r\nAll Over Coffee blends the timing of comics with the depth of poetry. Artist and writer Paul Madonna has fused art, literature, and comics by pairing timeless cityscapes with philosophical musings and poignant stories in masterfully rendered ink-wash drawings that surpass the art of Ben Katchor in elegance and architectural detail. His work has been compared to “a meeting of the tone of Edward Gorey, the uniqueness of Chris Ware, and the artfulness of Raymond Pettibon.”\r\n\r\nQuirky, whimsical, and often profound, All Over Coffee’s stunning imagery and thoughtful writing combine to create a conceptual world, both dreamlike and familiar. This selection will delight anyone who has ever lived in or visited San Francisco—or dreamed of doing so—with its original, off-the-beaten-path view of the city and its inhabitants.\r\n\r\nPaul Madonna moved to San Francisco and began to self-publish comics after graduating from Carnegie Mellon University’s fine arts program and an internship at MAD magazine. In 2002 he launched his incredibly popular website, www.paulmadonna.com, posting a new cartoon each week. In 2004 the San Francisco Chronicle and SFGate.com picked up his strip “All Over Coffee,” which continues to appear weekly.", "asin": "0872864561", "rank": "382455", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/519vWTu%2B1vL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}