{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 8, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "A simple story of current day Cuba.  Hard to evaluate the writing, since it is translated.  Easy read for book club."}, {"review_sentiment": 4.0, "review_text": "I am sure the treatment of the Aussie POW's by the Japanese was accurate but it was agonizing to read.  The followup of the Aussies as well as those who held them captive and made theim labor on the railroad was most interesting.  It was a well written book."}, {"review_sentiment": 5.0, "review_text": "Dick Cluster is a marvelous translator. With his English-language edition of \"A Corner of the World\"  by Mylene Fernández-Pintado we have an engaging picture of contemporary Cuban life that is a MUST-READ for those in the U.S. who want to go to Cuba and want to be informed before they travel. I referenced this book in a course I taught on Cuba/U.S. relations this spring (2015).Anne Fountain"}, {"review_sentiment": 5.0, "review_text": "Dick Cluster’s translation of A Corner of the World by Mylene Fernandez-Pintado is a wonderful entry into the world of Cuban literature for those of us who are not readers of Spanish. A must read if visiting Cuba, interested in understanding Cuban life and culture in Havana, or want to read a great novel.This is a sensual story about how dreams and love blend together and float apart. Mylene Fernadez-Pintado gives us many ways of seeing relationships and of seeing life in Cuba. Through lyrical and lovely language, you are led into the interior life of the main character. Images of loss and longing as well as beauty and delight are evoked throughout. I loved this book and could barely put it down to eat and sleep."}, {"review_sentiment": 4.0, "review_text": "Look up pictures of the Malecón in Havana, that long road along the sea wall, over which the waves break in storms, blowing spume onto the decayed grandeur of the buildings behind. \"I looked at Havana, bordered by miles of ocean, but for the first time I felt the water was besieging us. […] What we can do is look out over the waves, which exist as a promise of the rest of the world.\" Mylene Fernández-Pintado's short novel is full of people who leave Cuba, eager to explore that promise. There are those who leave, those who yearn to go, and some who return, with a kind of regret. Yet the first-person narrator, Marian, a thirty-something professor of freshman composition, is committed to stay. She believes that \"being here is more important than the superlatives of over there. It doesn't seem crazy to want to live in my country.\"If you define a novel only in terms of plot, then this one would not rate especially high. But as an account of ordinary life in Cuba from the Revolution to about 2006, when the author began writing, it is incomparable. It does not paint pictures either of hardship or faded romantic dreams; it leaves both politics and sociology in the background. Yet it does not sugar-coat either; you feel that everything Marian tells us is both normal and true. As a university professor, albeit a low-profile one, she is perhaps better placed than most. But her voice (at least as translated by Dick Cluster) is wonderful: objective, wryly humorous, simultaneously principled and pragmatic, and surprisingly sexual. And the book is full of marvelous characters: her off-and-on-again lover who is about to marry a Panamanian heiress and move with her to London, his mother who calls round now and again to boast of her son, an outspoken and fiery female painter who nonetheless shows a remarkable strength of loyalty, and an older gay man who lives in a rooftop shack and makes money writing letters for lovesick girls.The story, such as it is, concerns Marian's affair with a young author fifteen years her junior. Her department head asks her to write a preface to this young man's book; she agrees, and eventually meets the author, only to find him intolerable. But first impressions are so often deceptive, and their next meeting ends very differently. Did I believe in their passion? Not entirely; it is not enough to hold the novel together by itself. For a while, I felt that the many other characters introduced, with their back-stories and histories -- not to mention the various asides on different aspects of Cuban life and outlook -- were distractions from the pursuit of what I took to be the main subject. But in the second part of the book especially, I came to realize that these WERE the main subject, and I would be unlikely to find a more authentic picture of life in Cuba anywhere else. So not quite five stars, alas, but a high four -- very high."}, {"review_sentiment": 4.0, "review_text": "Interesting small novel.  I heard the author and her translator, Dick Cluster, give a presentation from this book and talk about translating issues. So little work from Cuba is translated and published in the United States. And even in Cuba, books are published in such limited numbers that it is always difficult to get books, except at the annual book fair. \"A Corner of the World\" is a little gem of vignettes of neighbors, really almost a collection of short stories in a novel format with a loose plot revolving around a dead end relationship with a younger male writer. Should we stay or should we go is a common theme in Cuban writing and in Cuban movies. The separation of families, the discussions about talk of utopia in other countries, the disappointment when moving, the disappointment when staying, the love of country and its culture are all here in this short novel. I liked it but think it might have been more successful without the boyfriend theme and if it had been written in short story format. Also, I was disappointed to find the book is not being sold in Spanish in the U.S."}, {"review_sentiment": 5.0, "review_text": "A love story that reveals a wider world.  A gem-like story, fiercely unsentimental, that nonetheless  made me want to slip into this island culture with all its joys, disappointments, and complexities."}, {"review_sentiment": 4.0, "review_text": "The author presents a varied and balanced perspective of life in contemporary Havana in a compact narrative of the complexities of the Cuban reality.  The host of parallel characters struggle with making expected and unexpected choices and living with the repercussions thereof. The themes include all manner of leaving, loss and being left behind; self-identity; home vs. homeland; the cost of becoming 'the other'; the issue of the fantasy vs. the reality of any given society; the effect of violence, war and economic desperation on the moral code. The writing, especially in the second half, is wonderfully rich and the insights profound. The novel is, at its heart, a love story. But although Marian, the protagonist, appears to be banal and impossibly romantic, she turns out to be introspective.  But her feet are ultimately firmly planted on her home soil, making her much more three dimensional.  The heartbreaking choices of leaving or remaining at home is one made over and over again by the cast of characters.  You will find that in the end, there are no simple answers."}]}, "authors": ["Mylene Fernández Pintado"], "isbn": "087286622X", "longitude": -82.3658671, "periods": ["1900s", "Recent Releases"], "title": "A Corner of the World", "word_cloud": "simple story current day evaluate write translate club sure treatment japanese accurate agonize followup well hold captive make them labor railroad interest well write marvelous translator edition engage picture contemporary life want go want inform travel reference course teach relation spring fountain translation wonderful entry literature reader spanish visit interested understanding life culture want great sensual story dream love together float apart give many way see relationship see life lyrical lovely language lead interior life main character loss long well beauty delight evoke love barely eat sleep picture long road sea wall wave break storm blow spume decayed grandeur building look border mile first time felt water besiege look wave exist promise rest short full people leave eager explore promise yearn go return kind regret narrator professor freshman composition commit stay believe important superlative seem crazy want live country define term plot rate especially high account ordinary life author begin write incomparable paint picture hardship fade romantic dream leave politics sociology background yet feel everything tell normal true university professor perhaps better place voice least translated wonderful objective wryly humorous simultaneously principled pragmatic surprisingly sexual full marvelous character lover marry panamanian heiress move mother call son outspoken fiery female painter nonetheless show remarkable strength loyalty older gay man live rooftop shack make money write letter lovesick story concern affair young author fifteen year junior department head ask write preface young man agree eventually meet author find intolerable first impression often deceptive next meeting end differently believe passion not entirely enough hold together felt many character introduce history mention various aside different aspect life outlook distraction pursuit take main subject second part especially come main subject unlikely authentic picture life anywhere else quite star ala high high interest small hear author translator presentation talk translate issue so little work translate publish even publish limited number always difficult annual fair little gem vignettes neighbor really almost collection short story format loose plot revolve dead end relationship younger male writer stay common theme write movie separation family discussion talk utopia country disappointment move disappointment stay love country culture short like think successful boyfriend theme write short story format also disappoint find sold spanish love story reveals wider story fiercely unsentimental nonetheless make want slip island culture joy disappointment complexity author present vary balanced perspective life contemporary compact narrative complexity reality host parallel character struggle make expect unexpected choice live repercussion thereof theme include manner leaving loss leave home homeland cost become issue fantasy reality give society effect violence war economic desperation moral code write especially second half wonderfully rich insight heart story marian protagonist appear banal impossibly romantic turn introspective foot ultimately firmly plant home soil make much heartbreaking choice leave remain home make cast character find end simple answer", "genres": ["Fiction & Literature"], "summary": "\"Mylene Fernandez offers us a magnificent gift. Her story of lost love and the difficult pursuit of literature is at the same time an X-ray of life in Havana, set in a present where glimpses of the future have not yet arrived.\" Leonardo Padura, author of The Man Who Loved Dogs.\r\n\r\nIn contemporary Havana, \"Do I stay or do I go?\" is always the question, and love doesn't necessarily conquer all.\r\n\r\nA cautious, reserved professor of Spanish Literature, Marian has no idea that her quiet life is about to be turned upside down. When she's asked to review the work of a young, ambitious first-time novelist, she meets Daniel, and their love affair leads her to question both the choices she's made so far in her life and the opportunities she might yet still have.\r\n\r\nTheirs is the story of an intense and impossible love, set in today's Havana, a city where there can be no plans, where chance is the order of the day and a fierce sense of loyalty and pride coexists with the desire to live beyond the island's isolation.\r\n\r\n\"A Corner of the World explores the irreconcilable rift created between a couple—a young writer and a professor of literature—when one wants to leave, and the other does not. While everyone in Cuba knows someone who has left, stories told from the perspective of a narrator who, like Fernández, would never leave without a return ticket, are not ones often heard in the US.” Los Angeles Review of Books", "asin": "087286622X", "rank": "1763856", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/41KtIPR-8WL.jpg", "country": "Cuba", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}