{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 2, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Arrived in excellent condition.Very interesting read from an author (and artist) that has undeservedly fallen from popularity among the intellectual set. This particular novel is notable as a reflective account from a mature author, which stands in contrast from his brash earlier writing."}, {"review_sentiment": 5.0, "review_text": "While I've always been a great admirer of the eccentric painter and author Wyndham Lewis, I find most of his fiction frustratingly unsatisfying. As George Orwell wrote in 1945, \"Enough talent to set up dozens of ordinary writers has been poured into Wyndham Lewis's so-called novels... Yet it would be a very heavy labour to read one of these books right through. Some indefinable quality, a sort of literary vitamin... is absent from them.\"That's not the case with Lewis's oddly gripping masterpiece SELF-CONDEMNED. Here, for once, Lewis tells a story that engages your emotions and involves you with the fate of his protagonist. The plot is simple and terrible. Rene Harding, an icily forbidding Oxford Don, decides that history is bunk and, to avoid becoming entangled in the upcoming war with Hitler, immigrates to an utterly dreary Canadian town with his feeble-minded wife Hester. There they suffer extreme poverty and neglect, which Lewis depicts slowly and remorselessly, in Dreiserian detail. There is no relief for the reader, no feel-good ending, but there is genuine catharsis.Nobody would call this novel perfect. There are many aimless digressions and longueurs. But Lewis's vision is so original, and his descriptions are so vivid, I have no hesitation in giving SELF-CONDEMNED five stars. Highlights include a surreal, horrifying portrayal of a hotel burning down in the Canadian winter and creating a \"fiery iceberg\", a satirical encounter with one of those foolish Johnsonian professors who \"roll towards their interlocutor heavy carefully picked words, reminiscent of those which thundered in the small talk of the formidable Lexicographer\", and a funny scene in which Harding flings a copy of MIDDLEMARCH into the open sea.I'm so glad this great novel is now available as an eBook. Hopefully it will encourage other e-publishers to release more of Wyndham Lewis's work."}]}, "authors": ["Wyndham Lewis"], "isbn": "0876855753", "longitude": -79.387207, "periods": ["1900s"], "title": "Self Condemned", "word_cloud": "excellent interest author artist undeservedly fall popularity intellectual set particular notable reflective account mature author stand contrast brash earlier writing always great admirer eccentric painter author find fiction frustratingly unsatisfying write talent set dozen ordinary writer pour novel right indefinable quality sort literary vitamin absent case oddly grip masterpiece here tell story engages emotions involve fate protagonist plot simple terrible icily forbid decide history bunk avoid become entangle upcoming war immigrate utterly dreary canadian town wife suffer extreme poverty neglect depict slowly remorselessly dreiserian detail relief end genuine many aimless digression longueurs vision original description vivid hesitation give star include surreal horrify portrayal hotel burn canadian winter create fiery iceberg satirical encounter foolish johnsonian professor roll towards interlocutor heavy carefully pick word reminiscent thunder small talk formidable funny scene fling copy open glad great available e book release work", "genres": ["Fiction & Literature", "WWII", "Satire"], "summary": "Self Condemned, originally published in 1954, tells the story of Professor Renarding and his wife, Essie, as they find themselves in Momaco, a fictionalized version of Toronto, following his resignation as an academic in London, England. Reduced to a position at the second-rate University of Momaco, Renarding and Essie suffer through a bleak and oppressive isolation in a dreary and alien city.\r\n\r\nThe novel, a devastating, disturbing satire of life in wartime Canada, explores the difficulty individuals face as they struggle to adapt to new surroundings while preserving their sense of wholeness, as well as the bond that develops between people during a shared experience of isolation.", "asin": "0876855753", "rank": "4139272", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/51n%2B-AFMKUL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}