{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 10, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Not your visitor's view of London.  Dark, noir in a way, literary, of course.  The British do the cynical urban thing a lot better than we Americans do. As for the plot, every time you think you have a hold on it, another trap door opens. I'll take Geoff Nicholson over Martin Amis any day."}, {"review_sentiment": 5.0, "review_text": "This book is a love letter to the city of London, from several points of view. I normally don't like the books and movies that shift between several people, as one story usually is stronger than the others. (See my intense dislike of _Infinite Jest_ in spite of liking Foster Wallace's nonfiction.) However, here the main character is the city, not its inhabitants. The characters are just transients on the surface of the dynamic city. Nicholson has a character say it better than I just did, but when I wanted to make a not to myself about the central theme of the work, I had no pencil close. It was worth while, but remember my views are idiosyncratic and subjective. Read it and we might have something to to talk about."}, {"review_sentiment": 1.0, "review_text": "I was attracted to this book by a magazine's reference to it as a book capturing the feel of London. Nah. What a waste. Dumb and dry fiction with cardboard characters shuffled chaotically by the pretending but never delivering author.Like the main hero's plan to visit each and every London's street this book idea may have sounded cool, but the book itself plain and unfunny.The only laughing matter here is author's constant helpless trying to imitate Martin Amis-style cool wit. It never ever comes close to it, being barely amusing at its best.Half a star for the good title. Let it be the only part you happen to read."}, {"review_sentiment": 5.0, "review_text": "Bleeding London is one of the quirkiest, darkest and funniest novels I have ever read! (That says a lot, for I have read thousands of novels.) It focuses on various characters whose experiences in London are both sinister and funny. Mick, Judy and Stuart are quite different, but are somehow brought together in strange ways. They all have a different take on London -- Londoners feeling foreign in their natural habitat while out-of-towners see it as an exciting and daring challenge.Nicholson does a great job with the description of a big city. As a New York City native, I am able to identify with the story line and the dark message the author is sending. The backdrop of London is different from all of the other British novels I have read -- it shows a more realistic view of the city.Thought provoking and darkly funny, Bleeding London should be read by those who enjoy a unique literary experience."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed this book and loved learning about the sides of a great  city that I didn't know about...very entertaining."}, {"review_sentiment": 4.0, "review_text": "This wonderful novel is ideally enjoyed while living in or visiting London, seeing as how the city is a central character in it. With his typical offbeat humor, Nicholson weaves together the lives and stories of  three of its denizens. Stuart is the owner of a company that does walking  tours of London; burned out, he has decided to walk every single street in  London in a quest for fulfillment and meaning. Julie is a native Londoner,  although half-Japanese and thus is constantly being forced to prove herself  a native. She keeps detailed maps of the locations of all her sexual  encounters, as well as those of her partners. Mick is a Sheffielder whose  stripper girlfriend was gang-raped by six well-to-do Londoners. He's come  down to the unfamiliar city he hates in order to mete out some revenge.  Both these and the supporting cast are wonderfully drawn characters, their  paths through London are a treat."}, {"review_sentiment": 4.0, "review_text": "I just finished an uncorrected proof of this book. I had a hard time putting it down. Mr. Nicholson's writing is very visual. The characters were so well written (even the minor ones) that I not only could picture  them in my mind I felt that I have actually met a few of them in my  lifetime. I could not say that the book was wickedly funny.  But I did  found myself reacting out loud on the subway. I would recommend this book  to anyone who loves cities. This book doesn't only describe people's love  and or hate of London but touches upon emotions felt by anyone who has  spent some time if not all their lives in a large city. I have never heard  of Geoff Nicholson before but look forward to running into (maybe seeking  out) his work again."}, {"review_sentiment": 4.0, "review_text": "I had severe reservations about buying this book. Although being disuaded  by the photo of the author on the cover is not reason enough, the thought  of another book wrapped up in romantic idealism about any city, let alone  London, is enough to make anyone reconsider the purchase. Fortunately I was  clearly destined to read it. As a Londoner I was desperate to find a reason  to dislike this book, yet I could not. The characters are totally original,  easy to relate to and incredibley funny. They would probably carry the  weakest of story lines anyway, yet Nicholsons dark, paranoid and twisting  story makes this a book even better I ever hoped, even the most cynical  reader would totally love it. Personally I think that London is probably  the greatest city in world, and this book does nothing to negate that. Only  in London could the dangerous, brooding situations that arise seem so  ridiculously hilarious. Even a Londoner looking for something a little bit  different will love it - just don`t judge a book by the picture of the  author."}, {"review_sentiment": 5.0, "review_text": "I read this on my return from my first trip to London, so much of the geography meant something to me.  The premise behind this book, assorted individuals taking on London on their own for their own reasons, is great.  The switching between and intermingling of characters is well-done.  There's some dark comedy here.  Mick is quite a charcter, in both the literary and comedic sense.  The ending was a shocker...who would've thought!  If you find it, pick it up...Bleeding London is thoroughly entertaining."}, {"review_sentiment": 4.0, "review_text": "Surprisingly meaty and captivating enough to engage this London fan...the character of Mick is exceptional and there are some very funny moments. Wouldn't have seen that ending coming either...yes, read it, all of you! Definately entertaining."}]}, "authors": ["Geoff Nicholson"], "isbn": "0879518073", "longitude": -0.12574, "periods": ["1900s"], "title": "Bleeding London", "word_cloud": "not visitor view nor way literary course british cynical urban thing lot better plot time think trap door open take day love letter city several point view normally movie shift several people story usually stronger others see intense spite like nonfiction however main character city inhabitants character transient surface dynamic city character say better want make central theme work pencil close worth view idiosyncratic subjective something attract magazine reference capture feel waste dry fiction cardboard character shuffle chaotically pretend never deliver main hero plan visit street idea cool plain laugh matter author constant helpless try imitate cool wit never ever come close barely amuse star good title part quirkiest darkest funniest novel ever say lot thousand novel focus various character experience sinister funny quite different somehow bring together strange way different take feel foreign natural habitat see excite dare great job description big city native able identify story line dark message author send backdrop different british novel show realistic view provoke darkly funny enjoy unique literary experience really enjoy love learn side great city know entertain wonderful ideally enjoy live visit see city central character typical offbeat humor weave together life story denizen owner company walking tour burn decide walk single street quest fulfillment mean native thus constantly force native keep detailed map location sexual encounter well partner stripper girlfriend unfamiliar city hate order mete revenge support cast wonderfully draw character path treat finish uncorrected proof hard time put write visual character well write even minor one felt actually meet lifetime wickedly funny find react loud subway anyone love city describe people love hate touch emotion felt anyone spent time live large city never hear forward run maybe seek work severe reservation buy dissuaded photo author cover reason enough thought wrap romantic idealism city alone enough make anyone reconsider purchase fortunately clearly destine desperate find reason dislike yet character totally original easy relate incredible funny probably weakest story line anyway yet dark paranoid twist story make even better ever hop even cynical totally personally think probably greatest city world nothing negate brood situation seem ridiculously hilarious look something little bit different love judge picture author return first trip much geography mean something premise assorted individual take reason great switch intermingling character dark comedy quite charter literary comedic sense end shocker find pick thoroughly entertain surprisingly meaty captivate enough engage fan character exceptional funny moment see end come yes definitely entertain", "genres": ["Fiction & Literature"], "summary": "Three strangers in search of London's heart and soul, mapping out their stories from Acton to Hackney, Chelsea Harbour to Woolwich, in a comic dance of sex and death.\r\n\r\nMick is on his way to the Smoke from the provinces. He's got six guys to find with only their names to go on and no more help than the phone book and an A-Z. Stuart is determined to walk each of the capital's roads, streets and alleyways. But what will he do when there's nothing left of his A-Z but blacked out pages? Judy is set on creating her own unique map of each of the metropolis' boroughs…an A-Z of sex in the city.", "asin": "0879518073", "rank": "1994030", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/61Q7CS7TVXL.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}