{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 73, "rating": 4.2, "reviews": [{"review_sentiment": 1.0, "review_text": "I give Baudelaire 5 stars. My one star review is for this TRANSLATION. This review is in relation to the Tidball translation. I bought it based on a very good review written by another reader. I cannot review the whole book, but I can review the dedication, a poem of 4 stanzas. I can read French fairly well, but I wanted a translation to use to compare my own interpretation. I found in this one poem so many mistranslations - words either not understood, or simply changed for effect, that I quickly lost confidence in this translation. I am aware of the school of translation (in fact, there is a quote at the back of this book that refers to it) that suggests that the translation is a \"new poem\" will be \"faithful to the matter\" but will only \"approximate\" the form of the original, and the translated poem will become a \"new poem.\"In very rare cases this can work, provided the second poet is equal to the first, and is scrupulous in reflecting on the depth and complexity of the first, and then, develops the new poem in a new form that is also very fine.However, in this case, the first thing one notes is that Tidball does not translate basic words correctly. Or dense, banal, conventional imagery is substituted for something striking and profound,. For example, in line 3 Baudelaire writes:\"Jette ce livre saturnien,\"  Tidball translates this as: \"Throw out this misanthropic book.\"Let's begin with Jette. It is the imperative form of the verb Jeter , which means: to throw, to throw away, to cast (away). I think that to write \"throw out\" is a banal reformulation of what Baudelaire means - which is more like to \"cast it away from you\".But, this is not that important. What struck me about this line was the translation of \"livre saturnien\" as \"misanthropic book\". Of course, livre is book, but the adjective \"misanthropic\" felt wrong as a translation of \"saturnien\", which struck me as much more complex and interesting as a word. So I began to investigate the meaning of \"Saturnien.\"  My French Dictionary - a pretty big and heavy Petit Larousse (2008) translates \"Saturnien\" as having to do with Saturn ( the planet), and then adds a Literary Translation as: \" Triste, mélancholic.\" This means: sad, melancholic. Another dictionary defines Saturnien as \"sombre et melantholique.\" \"Sombre\" can be defined as: dark, somber, gloomy.\" So, we are beginning to get the idea of what saturnien might mean. Now, my French is only mediocre. Probably a professor at the Sorbonne could explain much much more about what Baudelaire meant. But at least we have a rough idea  of the meaning of the word.What does Tidball translate it as? \"Misanthropic.\" Misanthropic is an adjective, from the root noun \"misanthrope.\" This word is defined in my Oxford English Dictionary as \"a person who hates mankind/a person who avoids human society.\" It might interests the reader who is reading my comments - if any poor soul perseveres through this important pathway of definition. - that the French also have the word \"misanthrope\" (noun) and the related word \"misanthropique.\"  Thus, Baudelaire could have used the exact word Tidball used, had he wanted to use it.So, what does all this mean? What it means is that Baudelaire calls his book of poems \"dark/sad/somber/gloomy\" and Tidball translates this as \"one who hates/avoids society\", which strikes me as a dumbed-down cliché of the incredible richness, subtlety, genius, and darkness that that Baudelaire embodied. I could take 3 or 4 other words from the same Dedication poem and do the same thing with them as I have done here, had I the time and the stomach for it.At this point, I do not really care what Tidball does with his \"new poem\" because he has falsified and banalized what Baudelaire wrote, in a way that strikes me as doing great injustice to readers, the beauty and truth of poetry, and to Baudelaire himself.Of course, I have judged the entire book based on this one poem. This is true. Perhaps he had an off-day when he translated this one, and the rest sparkle as rooted in the complexity and genius of Baudelaire, yet like Eliot's Wasteland, transcend the original source. I hope so, but I won't find out, as I'm not going to read any more of Tidball.I leave it to you readers to try for yourself.Robert Girvan"}, {"review_sentiment": 3.0, "review_text": "Weird!  I love that the translating poets went for it in terms of meter and rhyme -- very cool.  However, the results are not as faithful as the concept.  Still, inspiring -- and Millay's intro is a great read."}, {"review_sentiment": 5.0, "review_text": "Good"}, {"review_sentiment": 5.0, "review_text": "Really good translations, love the bilingual format!"}, {"review_sentiment": 5.0, "review_text": "Great book, my personal favorite translation. Read a long time ago and wanted my own copy.10/10"}, {"review_sentiment": 5.0, "review_text": "Superb"}, {"review_sentiment": 5.0, "review_text": "beautiful-one of the best poetry i read"}, {"review_sentiment": 3.0, "review_text": "Not my cup of tea. Had to buy for college"}, {"review_sentiment": 5.0, "review_text": "Baudelaire,un des plus grands poètes ..;"}, {"review_sentiment": 5.0, "review_text": "Great edition of Baudelaire's works!"}]}, "authors": ["Charles Baudelaire"], "isbn": "0879234628", "longitude": 2.3514992, "periods": ["1800s"], "title": "Les Fleurs Du Mal", "word_cloud": "give star star review review relation translation buy base good review write review whole review dedication poem stanza french fairly well want translation use compare interpretation find poem many mistranslation word either understand simply change effect quickly lose confidence translation aware school translation fact back refers suggest translation new poem faithful matter approximate form original translate poem new poem rare case work provided second poet equal first scrupulous reflect depth complexity first develop new poem new form also case first thing note translate basic word correctly dense banal conventional imagery substitute something strike profound example line write ce liver saturnine translate misanthropic imperative form verb mean throw away cast away think write throw banal reformulation mean cast away important strike line translation liver saturnine misanthropic course liver adjective misanthropic felt wrong translation saturnine struck much complex interesting word begin investigate meaning pretty big heavy translate planet add melancholic mean sad melancholic dictionary defines somber et melantholique define dark somber gloomy so begin idea saturnine now french mediocre professor much much meant least rough idea mean translate adjective root noun misanthrope word define person hat person avoids human society interest read comment poor soul perseveres important pathway definition also word misanthrope noun related word misanthropique use word use want use mean mean call poems translate society strike cliche incredible richness subtlety genius darkness embody word thing do time stomach point really new poem falsify canalize write way strike great injustice reader beauty truth poetry course judge entire base poem true perhaps translate rest sparkle root complexity genius yet transcend original source hope go leave reader try love translate poet go term meter rhyme cool however result faithful concept still inspire intro great good really good translation love bilingual format personal favorite translation long time ago want superb best poetry not cup tea buy college un ed grand poetess edition work", "genres": ["Poetry"], "summary": "This translation of Baudelaire's magnum opus perhaps the most powerful and influential book of verse from the 19th century - won the American Book Award for Translation. And the honor was well-deserved, for this is one of Richard Howard's greatest efforts. It's all here: a timeless translation, the complete French text, and Mazur's striking black and white monotypes in one elegant edition.", "asin": "0879234628", "rank": "168153", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51PgJk4XhmL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}