{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 2, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "A very readable translation of a terrific novel by one of Québec's most intriguing writers. It reminded me a bit of Thomas Pynchon's V."}, {"review_sentiment": 4.0, "review_text": "Years ago after my friends and I had outgrown using the word 'yucky' we sometimes used the word 'wormy'. It implied something less straightforward than 'I'm disgusted' or 'this is repellent' and it went beyond 'yucky' because we used it only when referring to something that seemed wholly outside our sheltered little world. And it's the best word to describe how I feel about Immaculate Conception--I cast about for another, but none seemed so near the mark.Just as I don't know how to sum up the book in a different word, I've no idea how to review it, or in fact whether it's possible to write a review that does justice to all aspects of it; indeed, I'm writing this as much to dispel that feeling of worminess as to draw attention to the novel. At any rate, the setting is a working-class district of Montreal in what's probably the 1920's and the main characters are a schoolteacher teetering on the brink of madness, an apparently simple-minded clerk tormented by memories of a traumatic event, the clerk's vilely malicious and oppressive father, and a well-intentioned priest who is helpless to relieve the suffering and to mitigate the evils of the people around him.Soucy focusses now upon one character, now upon another, now upon the present, now upon the past. This doesn't make the book hard to follow; I did though sometimes confuse the events of one character's childhood with those of another's, and perhaps that's understandable as the book is rife with child abuse. It has as well its fair share of rape and murder and more than its fair share of thoroughly contemptible characters, one of whom seems as close to being purely evil as any other I've read about.Soucy as always writes wonderfully well, so well that he manages to entice a reader to carry on even when the account becomes gruelling and so well that he carries off hints of the fantastic, strands that defy explanation, and a revelation that is the stuff of Grand Guignol.I've seen comparisons of this novel to works by Dostoevsky, Poe, Sade, and more. In spirit though not style or content the authors it reminded me of were Celine and Lautreamont. Overall, a book of great power--though I half wish it weren't.(If you're seriously interested in Immaculate Conception I recommend reading an extraordinary review of it on amazon.ca. I don't agree with all of it, and it is because of poor layout difficult to read, but it gives a stronger idea of the effect the book can have upon a reader than anything I can say.)"}]}, "authors": ["Gaétan Soucy"], "isbn": "0887847838", "longitude": -73.6103642, "periods": ["1900s", "Recent Releases"], "title": "The Immaculate Conception", "word_cloud": "readable translation intrigue writer remind bit year friend outgrow use word sometimes use word imply something le straightforward disgust repellent go use refer something seem wholly outside shelter little world best word describe feel cast none seem know sum different word idea review fact possible write review justice aspect indeed write much dispel feel wordiness draw attention rate set district probably main character schoolteacher teeter brink madness apparently clerk tormented memory traumatic event clerk vilely malicious oppressive father priest helpless relieve suffer mitigate evil people focus character upon present make hard follow sometimes event character childhood perhaps understandable rife child well fair share rape murder fair share thoroughly contemptible character seem close purely evil always write wonderfully well well manage entice carry even account becomes grueling well carry hint fantastic strand defy explanation revelation stuff see comparison work spirit style content author remind great power half wish seriously interested recommend read extraordinary review agree poor difficult give stronger idea effect anything say", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "In 1920s Montreal, 75 parishoners die one terrible night at the hands of an arsonist. Among the survivors are Remouald, whose nightmarish, repressed childhood memories cause him constant turmoil; Séraphon, his invalid father who holds a self-destructive secret; and schoolteacher Clémentine Clément, who obsesses in solitude over past tragedies, unrequited passions, and the grim suspicion that something is woefully amiss with a group of young boys in her class. \r\n\r\nGaétan Soucy applies his trademark vivid language, bracing wit, and fearless insight to this compelling story of horror and hope.", "asin": "0887847838", "rank": "3874058", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/51NHIAq0aFL.jpg", "country": "Canada", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}