{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 3, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "In a recent three-week stay in Quebec, it seemed as if every second person I met mentioned this work.  So I bought it (in French), expecting to find it rather hard going, but feeling a vague obligation to figure out what all the fuss was about.  The sense of obligation disappeared about three pages in, and I was hooked.  During World War II, seven women in a working class, French-speaking quarter of Montreal are pregnant and due to deliver their children within a month.  One of these women is the Fat Woman of the title, whose life and that of her chaotic three-generation household form the center of this novel and of the succeeding five novels of Michel Tremblay's \"Chronicles of the Plateau Mont-Royal\" series.  As the novel unfolds in the course of one Saturday in May, we are introduced bit by bit to the lives of these women, their families, and their neighbors.  What a wonderful tapestry of lives this is!  There is humor; there is magic; there is sadness and suffering.  I fell in love, and have been boring friends and family with recommendations to read this work.  Tremblay's affection for his characters shines through without blinding him to their manifest shortcomings and flaws.  If you loved Olive Kitteridge: Fiction, consider putting this novel on your reading list."}, {"review_sentiment": 5.0, "review_text": "I have been traveling to Montreal very often for the last 8 years. Intrigued by its unique north american culture and history it was inevitable I would venture into its literature. The Francophone culture survival in an economically (and political) Anglophone dominated continent is of special interest to me. I live in northamerica and in Montreal I am an \"allophone\"; (nor French or English native speaker). Few voices have spoken so eloquently about the culture and issues regarding French Canada as Michel Tremblay. The Fat Woman Next Door is Pregnant is an incredible novel. A must read for urban literature lovers and a window into our French neighbors to the north.His plays and other books, including Some Night my Prince will come are a revelation. An incredible writer, sadly \"out of the radar\" in the English speaking world."}, {"review_sentiment": 5.0, "review_text": "You want to learn more about Montreal and that funny province to the north ?  Now that you've read Richler, you want to get the other side of the picture, the French side ?  Then Tremblay's \"Fat Woman\" is the best place to start.  A great novel by Quebec's most famous writer and best (and only) shot at the Nobel prize of literature."}]}, "authors": ["Michel Tremblay"], "isbn": "0889221901", "longitude": -73.6103642, "periods": ["1900s"], "title": "The Fat Woman Next Door Is Pregnant", "word_cloud": "recent stay seem second person meet mentioned work so buy french expect rather hard go feel vague obligation figure fuss sense obligation disappear page hook woman work class quarter due deliver child month woman title life chaotic household form center succeed novel series unfolds course introduce bit bit live woman family neighbor wonderful tapestry live humor magic sadness suffer fell bore friend family recommendation work affection character shine blind manifest shortcoming flaw love put read list travel often last year intrigue unique north american culture history inevitable venture culture survival economically political dominate continent special interest live northamerica anglophone french native speaker voice speak eloquently culture issue regard french literature lover window french neighbor play include come revelation incredible writer sadly radar speaking world want learn funny province north now want side picture french side then best place great famous writer best shot prize literature", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "It is the glorious second day of May, 1942. The sun is drawing the damp from earth still heavy with the end of a long Quebec winter, the budding branches of the trees along rue Fabre and in Parc Lafontaine of the Plateau Mont Royal ache to release their leaves into the warm, clear air heralding the approach of summer.\r\n\r\nSeven women in this raucous Francophone working-class Montreal neighbourhood are pregnant—only one of them, “the fat woman,” is bearing a child of true love and affection. Next door to the home that is by times refuge, asylum, circus-arena, confessional and battleground to her extended family, with ancient roots in both rural Quebec and the primordial land of the Saskatchewan Cree, stands an immaculately kept but seemingly empty house where the fates, Rose, Mauve, Violet and their mother Florence, only ever fleetingly and uncertainly glimpsed by those in a state of emotional extremis, are knitting the booties of what will become the children of a whole new nation.\r\n\r\nIn this first of six novels that became his Chronicles of the Plateau Mont Royal, Tremblay allows his imagination free reign, fictionalizing the lives of his beloved characters, dramatized so brilliantly in his plays and remembered so poignantly in his memoirs.“The fat woman” both is and is not Michel Tremblay’s mother—her extended family and neighbours more than a symbol of a colonized people: abandoned and mocked by France; conquered and exploited by England; abused and terrorized by the Church; and forced into a war by Canada supporting the very powers that have crushed their spirit and twisted their souls since time immemorial. This is a “divine comedy” of the extraordinary triumphs and tragedies of ordinary people caught up by circumstances that span the range of the ridiculous to the sublime.", "asin": "0889221901", "rank": "1784924", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/41M-FAZLsoL.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}