{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 42, "rating": 3.3, "reviews": [{"review_sentiment": 3.0, "review_text": "The book held my interest until the last chapter."}, {"review_sentiment": 5.0, "review_text": "I really enjoyed this book for the realism of the Cuba-to-America immigrant experience, as well as the beautiful dream-like sequences of what the family's life used to be in Cuba. It is a beautifully written story of a family whose dysfunction borders on mythology. This book completely captivated me."}, {"review_sentiment": 4.0, "review_text": "Considering that I attended school with the author, I found this a fascinating read.  How much is autobiographical I will never know."}, {"review_sentiment": 3.0, "review_text": "I liked it but I did not like the ending it was stupid"}, {"review_sentiment": 5.0, "review_text": "What a treat to revisit Oscar Hijuelos by reading his first novel Our House in the Last World. Hijuelos writes with a rhythm that is unmistakable. It’s as if, as you read, there is a Cuban guitarist softly strumming in the background. Although he writes sometimes of brutality and heartache, Hijuelos provides a beautiful glimpse into what it means to be Cuban-American, to be thrust from one’s country, longing to retain your birthright yet wanting to make it in your new country. In Hijuelos’s novels, some make it, some don’t. And the journey is the delight, even as we see characters so terribly flawed by their longings. Our House in the Last World tells of Alejo Santinio and his wife Mercedes as they raise their two sons in mid-20th century New York City, having immigrated from Cuba a few years before Castro took over the country. While other immigrant relatives and friends are adjusting to the new country, planting new roots, and gaining success, Alejo is a fish out of water. He struggles the entire time of his residency in NYC, taking out his frustrations on his wife and sons. Mercedes, meanwhile, is extremely unhappy and cannot cope with the poverty she’s been thrust into by her husband. She endures his spending their money on others, hoping to impress them, and she endures his brutality toward her, all the while suffering the hatefulness of Alejo’s sister Buita who despises Mercedes and would do anything to rip Mercedes’s two sons from her to raise as her, Buita’s, own. Our House in the Last World is a powerful examination of how we deal with our fates, and ultimately, despite the fact it portrays a man whose life seems wasted and thrown away, we see that Alejo’s sons and his wife grew from having known him."}, {"review_sentiment": 4.0, "review_text": "This is a fascinating, well-written first novel by Oscar Hijuelos.  It's basically autobiographical, based on his family during his early years.  As many of us grew up in dysfunctional families to at least some degree, we can relate and appreciate his honest revelations.  Much sadness and loss, very descriptive.  Hijuelos writes of the complexities of the characters, the \"good\" and the \"bad\", strengths and weaknesses, and successful and unsuccessful coping strategies with forgiveness and understanding.  I found the last chapter \"Voices from the Last World\" especially satisfying, a glimpse into the worlds of three of the family members.  I look forward to reading more of his books."}, {"review_sentiment": 3.0, "review_text": "Somewhat interesting, not nearly up to the standard of his later novels"}, {"review_sentiment": 2.0, "review_text": "This was a disappointment as a story. It just didn't go anywhere. The writer used good language and description but it was repetitive."}, {"review_sentiment": 5.0, "review_text": "really great book"}, {"review_sentiment": 3.0, "review_text": "I don't like stories with no characters that I can care for or relate to. The book is well written and kept me reading regardless.  I do enjoy historical fiction and immigrant stories and this story is believable."}]}, "authors": ["Oscar Hijuelos"], "isbn": "0892552832", "longitude": 0.0, "periods": ["1900s"], "title": "Our House in the Last World", "word_cloud": "hold interest chapter really enjoy realism immigrant experience well beautiful sequence family life use beautifully write story family dysfunction border mythology completely captivate consider attend school author find fascinate much autobiographical never know like end stupid treat revisit read first write rhythm unmistakable guitarist softly strum writes sometimes brutality heartache provide beautiful glimpse mean thrust country long retain birthright yet want make new country novel make journey delight even character terribly flaw longing tell wife raise son century immigrate year take country immigrant relative friend adjust new country plant new root gain success fish water struggle entire time residency take frustration wife son meanwhile extremely unhappy cope poverty thrust husband endure spend money others hop impress endures brutality suffer hatefulness sister despise anything son raise powerful examination deal fat ultimately fact portrays man life seem waste away son wife grow know fascinating first basically autobiographical base family early year many grow dysfunctional family least degree relate appreciate honest revelation much sadness loss descriptive write complexity character good bad strength weaknesses successful unsuccessful cop strategy understand find chapter voice especially satisfy glimpse world family member look forward read somewhat interesting nearly standard later novel disappointment story go anywhere writer use good language description repetitive really great like story character care well write keep read regardless enjoy historical fiction immigrant story story believable", "genres": ["Fiction & Literature"], "summary": "The debut novel by the Pulitzer Prize-winning author of The Mambo Kings Play Songs of Love.\r\n\r\nBearing all the hallmarks of Hijuelos's later work―exuberance, passion, honesty, and humor―this debut novel was heralded on its publication twenty years ago as \"virtuoso writing...a novel of great warmth and tenderness\" New York Times\r\n\r\nFilled with the sights and sounds of Cuba's Oriente province and New York City, the music and films of the fifties, lusty fantasies and the toughest of life's realities, it is the unforgettable story of Hector Santinio, the American-born son of Cuban immigrants, who is haunted by tales of \"home\" (a Cuba he has never seen) and by the excesses and then the death of his loving father. \r\n\r\nThis edition includes a new autobiographical introduction by the author, reflecting on how he came to write Our House in the Last World, and a new afterword in which he comments on the story.", "asin": "0892552832", "rank": "1288378", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51jFg57BXuL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}