{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 30.048819, "ratings": {"num_ratings": 6, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Lovely writing as always from both E.M. Forster and Lawrence Durrell"}, {"review_sentiment": 5.0, "review_text": "A colorful, well-written history of this fascinating city. The introduction by Lawrence Durrell is the best part though. Because he's one of the most beautiful, eloquent writers ever."}, {"review_sentiment": 5.0, "review_text": "This final volume of the Abinger Edition for the first time ever brings together two books written by E. M. Forster during the four years he spent in Alexandria. The first of them is a history and a guide to the city - a book which justly enjoyed a reputation for rarity as its first edition was largely destroyed (well, you have to look into the book to know the whole story) and which has since its publication (more likely since its republication in 1938) enjoyed the reputation of one of the more authoritative histories of Alexandria. The second of them is a collection of literary and historical essays which elaborate on various Alexandrian subjects - from Alexander the Great and the Ptolemys to Cavafy.The first book is serious work of scholarship although the personal touch of EMF is hard to miss anyway. The second is much lighter in tone, much more fanciful but serves as a perfect addition to the first one. Together they combine to offer a marvelous introduction to the fascinating city of Alexandria. If you happen to be heading in this direction you can ask for no better guide that E. M. Forster."}, {"review_sentiment": 5.0, "review_text": "Marvelously written, carefully researched, this is an outstanding book for anyone interested in Foster or Alexandria.  And just about anyone can learn much: an interesting example is what Foster says about Hypatia [the women philospher brutally killed by monks]: she was not young and probably not much of a philosopher; yes, Foster offers new perspectives on various currents in Alexandria."}, {"review_sentiment": 5.0, "review_text": "Called the best guidebook ever written, Forster's homage to Alexandria is at once informative, evocative, and nostalgic. The first half of the book is a series of vignettes on various moments and characters in the city's history. Forster immersed himself in the literature of ancient Alexandria and Greece, and it is this intimate acquaintance with the thought of the old city that gives the historical section its depth. Using a style that, though terse, always has time for a story or interesting quote, he covers the ancient library and mouseion, the Alexandrian contributions to science, the Christian and Arab periods. In the celebrated section \"The Spiritual City,\" he outlines the religious heritage of Alexandria, demonstrating how Christianity as we know it today was largely formed in this city. Durrell drew heavily on this section for the gnostic theme that runs through the Quartet. The historical section concludes with a translation of Cavafy's \"The God Abandons Antony,\" the first Cavafy poem to appear in print in English, and Forster considered the primary achievement of his guidebook to be the introduction of Cavafy to the English-speaking world. Each historical section is linked to sections in the guide, and Forster claimed that \"the 'sights' of Alexandria are in themselves not interesting, but they fascinate when we approach them through the past.\" Forster spent much time on trams in Alexandria, and the great love of his life, Mohammed el Adl, was a tram conductor on the Bacos route. It is fitting, then, that the tramlines should provide the web holding the guidebook together. Forster takes us through the city by tram, pointing out interesting buildings and sites to left and right. The guide also contains maps of the ancient and modern city, and plans of the Greco-Roman Museum and the Wadi Natrun monasteries. The book had a difficult birth: Forster's Alexandrian publisher suffered a fire in which they thought the books had been burned. After recouping insurance compensation, they discovered that they had in fact survived. They then decided to burn the books deliberately. In 1935, members of the Royal Archaeological Society of Alexandria decided to reprint the book. Forster put some work into revisions, but this second edition did not sell well, and it was only after the book was published in the US that it achieved moderate sales. More than any other guidebook, Forster's comes across as a labor of love. Lawrence Durrell wrote of the guidebook that Forster \"must have been deeply happy, perhaps deeply in love . . . Paradoxically, if that is the word, the book is also saturated with the feeling of loneliness, that of a cultivated man talking to himself, walking by himself.\""}, {"review_sentiment": 5.0, "review_text": "Recently read and used this book while in Alexandria.  There is essential information, beautifully organized, presented and written that should be available.  Introduction by Lawrence Durrell is wonderful too."}]}, "authors": ["E. M Forster"], "isbn": "0902743228", "longitude": 31.243666, "periods": ["1900s"], "title": "Alexandria: A History and a Guide", "word_cloud": "lovely write always colorful fascinate city introduction best part beautiful eloquent writer ever final volume first time ever bring together write year spend first city justly enjoy reputation rarity first edition largely destroy well know whole story publication likely republication enjoy reputation authoritative history alexandria second collection literary historical essay elaborate various alexandrian subject first serious work scholarship personal touch hard miss anyway second much lighter tone much fanciful serf perfect addition first combine offer marvelous introduction fascinate city happen head direction better marvelously write carefully research outstanding anyone interested anyone learn much interesting example say woman philosopher brutally kill monk young probably much philosopher yes offer new perspective various current alexandria call best guidebook ever write homage informative evocative first half series vignettes various moment character city immerse literature ancient intimate acquaintance think old city give historical section depth style terse always time story interesting quote cover ancient library mouse ion alexandrian contribution science christian period celebrated section outline religious heritage demonstrate know today largely form city draw heavily section gnostic theme run historical section conclude translation first poem appear print consider primary achievement guidebook introduction world historical section link section claim interest fascinate approach spend much time tram great love life e tram conductor route fit tramline provide hold guidebook together take city tram point interesting building site leave right also contain map ancient modern city plan monasteries difficult birth publisher suffer fire thought burn recoup insurance compensation discover fact survive decide burn deliberately member decide reprint put work revision second edition sell well publish achieve moderate sale more guidebook come labor love write guidebook happy perhaps deeply word also saturate feel loneliness cultivate man talk walk recently use essential information beautifully organize present write available wonderful", "genres": ["Travel Writing"], "summary": "Alexandria is a city which has haunted and inspired its visitors for over 2,000 years. Here, two of its best-known celebrants provide a view of Alexandria's present through the window of its past. \r\n\r\nWritten during World War I, and later revised, this is Forster's tribute to Alexandria--a combined history of the city and a practical guide for the visitor. This annotated edition contains not only the first translation of Constantine Cavafy's famous poem \"The God Abandons Antony\" but also a specially commissioned introduction by Lawrence Durrell, who recounts his recent return to the city that served as a backdrop for the Alexandria Quartet.", "asin": "0902743228", "rank": "3758924", "city": "Cairo", "image": "https://images-na.ssl-images-amazon.com/images/I/51RLDVA6xcL.jpg", "country": "Egypt", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}