{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 45, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "A book lover friend recommended this so I took a chance even though I have no real interest in Turkey. I learned a lot. Now I need to read more about Atatürk and the changes he installed when Turkey became a republic: people required to choose surnames, veils and the fez (Casablanca anyone?😉) were \"outlawed.\"What a roller coaster of family situations/ tragedies. I finished it in less than 2 full days.  No need to repeat others' descriptions, but I'd like to address a 2011 review (Ord?) who says he didn't understand why the author's mother said he had become distant a long time ago. \"He describes his mother's hardness when dealing with impossible loss. He comes across as a sensitive enough child to understand that his mother's loss was tremendous and perhaps most sad. But he doesn't describe how exactly he became distant from his family later on.\"I can't find it, but I think it was from the sense of abandonment when the mother left him and his brother in the first place when they were very young.Throughout, there are references to the mother's emotional descent (the tragedies she/they suffered were terrible) only to be pulled back from the brink of insanity.She married at 13 and was plunged into a life of extreme hardships in her early 20s. I was struck by her resilience and everything she, accustomed to a life of luxury, did to survive and raise 3 children to the best of her ability.The book covers two world wars. Now (December 2016) that our world is seeing radical Islamic led/inspired attacks and a Russian ambassador assassinated in Ankara, it seemed the right time to pick up this book and hope that the other international occurrences are not going to lead history to repeat itself. I pray for peace on earth."}, {"review_sentiment": 4.0, "review_text": "interesting, old appeared 50 years ago.."}, {"review_sentiment": 4.0, "review_text": "Well written, historically valuable, and very sad. What World War I was actually like for people, even a privileged family with some connections to power, in Ottoman Turkey. We know that Europe suffered terrible during The Great War. So did the rest of the world."}, {"review_sentiment": 4.0, "review_text": "This was a good read while in Istanbul. Some history with a compelling story of a family. It takes you through much of the last century and it is amazing to imagine the old city and the events of its recent history."}, {"review_sentiment": 5.0, "review_text": "Recently returned from a trip to Turkey....and discovered this book captured the atmosphere. Very enjoyable."}, {"review_sentiment": 5.0, "review_text": "A must read for anyone traveling to Turkey in order to understand the culture and the people."}, {"review_sentiment": 4.0, "review_text": "Touching beautiful story, all the more so as it is true."}, {"review_sentiment": 5.0, "review_text": "The reader is immediately drawn into this portrait of a bygone era.  Beautifully written, the vivid memories of a childhood filled with joy and then suddenly abject misery will keep you spellbound.  The author's immense compassion and love for his family as they traverse the years of war and privation bring to the fore the sufferings of the women and children left behind as the 'Great Powers' drag Turkey into the First World War."}, {"review_sentiment": 4.0, "review_text": "This books starts out as boring as its title. It's a middle class Turkish family in the early 1900s. They squabble with relatives and have a comfortable life selling carpets. But WWI begins and each of them is literally ruined by the deprivation and horror they survive (or not). I'll never forget the description of the battle of Gallipoli in northern Turkey. What a horrible, pointless mess! It's quite a good book but harrowing."}, {"review_sentiment": 3.0, "review_text": "I enjoyed this non-fictional account of life in Turkey during times of transition and change.  The story is told from the point of view of a young man describing the environment and circumstances of coming of age in Turkey.  For me it was a slow read and I didn't rate it very high as I didn't think it was representative of the lifestyle experienced by the ordinary Turk.  Orga came from a well to do family by any standard.His motivation for writing this story was reciprocal to my desire to read it.  For those interested in learning about life and tradition in Turkey, this is a good read and Orga's idea for documenting satisfied my inquiring curiosity"}]}, "authors": ["Irfan Orga"], "isbn": "0907871828", "longitude": 28.9651646, "periods": ["1800s", "1900s"], "title": "Portrait of a Turkish Family", "word_cloud": "lover friend recommend take chance even real interest turkey learn lot now need change instal become republic people require choose surname veil fez anyone outlaw roller coaster tragedy finish full day need repeat others descriptions address review say author mother say become distant long time describe hardness deal impossible loss come sensitive enough child understand mother loss tremendous perhaps sad describe exactly become distant later think sense abandonment mother leave brother first place reference mother emotional descent tragedy suffer terrible pull brink marry plunged life extreme hardship early strike resilience everything accustom life luxury survive raise child best cover world war now world see radical attack russian ambassador assassinate seem right time pick hope international occurrence go lead history repeat pray peace earth interest old year well write historically valuable sad actually people even privilege connection power know suffer terrible rest world good history compel story take much last century amaze imagine old city event recent history recently return trip discover capture atmosphere very enjoyable anyone travel order understand culture people touch beautiful story true immediately draw bygone era write vivid memory childhood fill joy suddenly abject misery author immense compassion year war privation bring fore suffering woman child leave drag start boring title middle class early squabble relative comfortable life sell carpet begin literally ruin deprivation horror survive never forget description battle northern horrible pointless mess quite good harrowing enjoy account life time transition change story tell point view young man describe environment circumstance come age slow rate high think representative lifestyle experience ordinary come well motivation write story reciprocal desire interested learning life tradition good idea document satisfied inquiring curiosity", "genres": ["Memoir", "History", "WWI"], "summary": "Describes in chilling, yet affectionate, detail the disintegration of a wealthy Ottoman family, both financially and emotionally. \r\n\r\nIt is rich with the scent of fin de siecle Istanbul in the last days of the Ottoman Empire. His mother was a beauty, married at thirteen, as befitted a Turkish woman of her class. His grandmother was an eccentric autocrat, determined at all costs to maintain her traditional habits. But the war changed everything. Death and financial disaster reigned, the Sultan was overthrown, and Turkey became a republic. The red fez was ousted by the cloth cap, and the family was forced to adapt to an unimaginably impoverished life. \r\n\r\nFilled with brilliant vignettes of old Turkish life, such as the ritual weekly visit to the hamam, as it tells the \"other side \" of the Gallipoli story, and its impact on one family and the transformation of a nation. ", "asin": "0907871828", "rank": "164901", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51C4PG7TNNL.jpg", "country": "Turkey", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}