{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 25, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "Can't say much. It was for a present. Haven't read the french version. I've read the original in catalan and I love it."}, {"review_sentiment": 2.0, "review_text": "I had anticipated this novel to be interesting given the author's personal life, which isto be a self-reflection in the story she has illustrated.  This story takes place during the Spanish Civil War.  However, I could not finish the book because the translation from Catalan to English was poorly done. The translation became very distracting in the reader's understanding of the character's bio and the story line. This was a disappointment because I was very interested in delving into the  author's writing since I have had no knowledge of the Spanish Civil War and/or Spanish authors.  I would recommend another read possibly but via a different translation."}, {"review_sentiment": 5.0, "review_text": "Great book!"}, {"review_sentiment": 5.0, "review_text": "Wonderful, paced, realistic and cleverly written. You actually feel and observe a very different perspective on life and living through the misery caused by war. The characters described seem real. So does the misery and loss. Great and beautiful ending.I love that it was written in Catalan during the 60's, when one would not really hope to have many readers at all."}, {"review_sentiment": 4.0, "review_text": "just as described."}, {"review_sentiment": 4.0, "review_text": "It's a real life arc story, gains and losses all along the way, sometimes uncomfortable, realistically so, but with resolution. I read it while I was visiting in Barcelona and it felt authentic to place though it's set in another time. It has some beautiful lyrical passages, while being true to life in its harshness of the times, and how people dealt as best they could. Must be read with the times in mind. I thought it would be more political than it was. It was more human oriented through the eyes and emotions of the protaganist Natalia and what she cared about.  The Spanish Civil War was rather secondary. Women don't care that much about politics and the wars that result,  more about their man, their children, yet the harsh realities can make all that secondary as well. At some point she must care for both her survival and her sanity, and there were no mental health resources in that regard in that time.  It was sometimes depressing but its a good read. I've read the book is described as beautiful. Beauty is in the eyes of the beholder in this case.  How does one write beautifully about the consequences of war, of what people have to go through during and after war? But i found it a good read, perhaps empowering even."}, {"review_sentiment": 4.0, "review_text": "You really have to know what was going on in Spain at the time to fully understand what was going on in this book. I enjoyed the many parallels between what was going on in the main characters relationship and what was going on in the country."}, {"review_sentiment": 5.0, "review_text": "This was a really easy read and it was very enjoyable. Honestly, i liked it so much i bought an extra copy to share."}, {"review_sentiment": 4.0, "review_text": "This 1986 novel brings the reader to the Civil War in Spain in the 1930's, a devastating war that plunged the people into poverty and despair.  Told through the eyes of a woman caught up in the tragedy of this war,  we first meet her as a young woman being courted and there are hints that this future marriage is not one made in heaven.  She has stars in her eyes but her husband is a bit of a brute, her mother-in-law is difficult to get along with, there is little money and she struggles to provide for her two young children who seem like a burden.  The family gets along somehow though and one of the ways they make their modest living is by raising doves.Suddenly, however, the Spanish Civil War is upon them and most of the men go off to war.  The woman now has to care for her children.  She has to go to work and leave them alone because they are almost starving and eventually have to kill the doves for food.This is a sad book and at times was hard to read.  Eventually, through the years, there are some changes but the husband never does return and even though the woman's life gets a little easier, I was depressed throughout this written classic which is a snapshot of a time and a place in history."}, {"review_sentiment": 2.0, "review_text": "A part de la mala traducció del títol, aquesta ès una bona representació del treball de Mercè Rodoreda. Però me decebre molt que l'única versió catalana de aquest llibre a Amazon costa més que $50! M'agrada molt que hi ha gent que volen llegir aquest llibre, que tenen interés a la nostra cultura (no sé perque dic 'la nostra'...no soc català!). Però a quin món vivim ón una versió original costa 4x una versió tradüida? Ho sento Amazon- t'estimo molt, però vaig a comprar l'original a ebay...Apart from the poorly translated title, this is a good representation of Mercè Rodoreda's work. But I'm disappointed that the only Catalan version of this book on this site costs more than $50! It's wonderful that people want to read this book and have interest in Catalan culture, but what kind of world do we live in where an original version costs 4x what a translated edition costs? Sorry Amazon- I love you, but I'm going to buy the original on ebay..."}]}, "authors": ["Mercè Rodoreda"], "isbn": "0915308754", "longitude": 2.1774322, "periods": ["1900s"], "title": "The Time of the Doves", "word_cloud": "say much present french version original catalan love anticipate interest give author personal life into story illustrate story take place however translation poorly do translation become distract understanding character bio story line disappointment interest delve author write knowledge spanish spanish author possibly different translation great pace realistic cleverly write actually feel observe different perspective life live misery cause war character describe seem real so misery loss beautiful love write really many reader described real life arc story gain loss way sometimes uncomfortable realistically resolution visit felt authentic place set beautiful lyrical passage true life harshness time people deal best mind think political human orient eye emotion protagonist care spanish rather secondary care much politics war result man child yet harsh reality make secondary well point survival sanity mental health resource regard sometimes depress good describe beautiful eye beholder case beautifully consequences war people go war find good perhaps empower even really go fully understand go enjoy many parallel go main character relationship go country really easy enjoyable like much buy extra copy share bring devastate war plunge people poverty despair eye woman catch war first young woman court hint future marriage make heaven star eye husband bit brute difficult along little money struggle provide young child seem burden family get along somehow way make modest living raise however spanish men go war woman care child go work leave alone almost starve eventually sad time hard year change husband never even woman life get little easier depress write classic snapshot place history part títol aquesta tuna boa representació fireball decebre molt we catalan llibre coat m we molt we hi ha gent we llegir quest llibre we teen inters la nostra cultural s perque sic nostra soc catalpa quin men vivid tuna versió original coat tuna versió tradüida sent molt per vain compare ebay poorly translate title good representation work disappoint version site cost wonderful people want interest culture kind world live original version cost translated edition cost love go original ebay", "genres": ["Fiction & Literature", "LGBT"], "summary": "The Time of the Doves - by Mercè Rodoreda - is the powerfully written story of a naïve shop-tender during the Spanish Civil War and beyond, is a rare and moving portrait of a simple soul confronting and surviving a convulsive period in history. The book has been widely translated, and was made into a film.", "asin": "0915308754", "rank": "84271", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51B6y7iQ3bL.jpg", "country": "Spain", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}