{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 5, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Great book"}, {"review_sentiment": 5.0, "review_text": "Very awesome price in great condition.  Thank you very much."}, {"review_sentiment": 5.0, "review_text": "I met this guy in Maldives in February 1984. One of the most important people of the 20th century. A sailor, an adventurer but most of all a scientist who did his research off his desk."}, {"review_sentiment": 5.0, "review_text": "As with all the Heyerdahl books, he is extremely through.  He isn't the same old, same old.  Like any archaeologist he starts from a premise that is original and follows the thread.  Traditionalist archaeologists (and Disney in the Little Mermaid and the things she discovered) establish what they THINK and then expect everyone to agree with them and if they don't, like the lobster, he is the expert.  Heyerdahl is one your either love or hate.  I love him and find him to be one of the most exciting adventurers ever.  I have most of his books and he lives what he believes to be POSSIBLE.  He has many ideas that could or could not be proven...they are lost in history.  Until we have a time machine many things are just speculation, but with Heyerdahl he proves possibilities.  Like how did they move the heads of Easter Island.One can only THINK and he challenges things that have never been proven.  Like where did they come from and how did they get there. Even though some people thought the only way people could have moved from Europe and Africa was Eastern migration over the Bering land strip.  But with Ra, he proved that indeed they could have come across the Atlantic.  He is fascinating and very interesting.  Whether you agree and think he is absolutely correct or simply putting out theories, he goes there and does it and is a wonder source for Geography and story teller.  Only an archaeology snob, like the Geographic societies that simply said \"either agree or you are an amateur.\"If you love adventure you can't help but love the Heyerdahl books."}, {"review_sentiment": 3.0, "review_text": "This is typical Heyerdal of Kontiki memory. Entrepreneurial, enthusiastic, hyperactive, resourceful, but not necessarily on the mark when it comes to conclusions.He spent considerable time in the Maldives, which is commendable. In a state that does not allow any symbols of religions other than Islam to be displayed (I have seen little Buddhas being confiscated at the airport) he was able to persuade the president to allow for diggings in Buddhist sites and most of that stuff is now on display at the Male museum. This alone justifies buying the book.However his conclusions about the role of Hinduism and Buddhism in pre-Islam Maldives are less than watertight, just as his conclusions after the Kontiki expeditions were. He pretty much acknowledges as much at the very end of the book. Finally, he also spends too many pages writing about himself."}]}, "authors": ["Thor Heyerdahl"], "isbn": "0917561198", "longitude": 0.0, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s", "500-1400s"], "title": "The Maldive Mystery", "word_cloud": "great very awesome price great condition much meet guy important people century sailor adventurer scientist research desk extremely old old archaeologist start premise original follow thread archaeologist thing discover expect everyone agree lobster expert hate love excite adventurer ever live believe many idea lose history time machine many thing speculation prove possibility move head challenge thing never prove come even people thought way people move migration land strip prove indeed fascinate interest agree think absolutely correct simply put theory go wonder source story teller archaeology snob society simply say agree amateur love adventure typical memory enthusiastic hyperactive resourceful necessarily mark come spend considerable time commendable state allow symbol religion display see little confiscate airport able persuade president digging site stuff museum alone justifies buy conclusion role le watertight conclusion expedition pretty much acknowledges much end also spend many page write", "genres": ["History", "Travel Writing"], "summary": "The author of the best-selling adventure Kon-Tiki travels to a relatively unknown part of the world in this archaeological detective story. \r\n\r\nWhen the government of the Maldive Islands - those 'dots on the map in the Indian Ocean' - wanted to investigate recent archaeological finds dating from thousands of years ago, it turned to one of the world's foremost explorers, Thor Heyerdahl. Although Heyerdahl knew little about the islands, he understood that the invitation implied a drastic change toward the Maldive past: until now, all study of Maldive history prior to A.D. 1153 (the year the islanders embraced the Islamic faith) had been repressed, and all pre-Moslem artifacts discarded or destroyed.\r\n\r\nWhat unfolded for Heyerdahl was an exciting search through Maldive history. On the island of Fua Mulaku he found the remains of walls made from beautifully cut and fitted stones, reminiscent of the 'fingerprint' masonry he had previously seen only in the prehistoric structures of the Middle East. And on Nilandu, he visited the excavation of the 'Phallus Temple,' which led him to ponder the puzzling fact that in this Moslem land, the mosques do not face toward Mecca. \r\n\r\nThe quest for the origins of Maldive history led Heyerdahl to Sri Lanka, to India, and to the carvings and buildings left by the vanished civilizaitons of Sumer, Mesopotamia, Bahrain, and the Indus Valley. Heyerdahl eventually found that the Maldive Islands, far from being remote and insignificant, formed a crucial crossroad for pre-European civilizations.", "asin": "0917561198", "rank": "1203918", "city": "Maldives", "image": "https://images-na.ssl-images-amazon.com/images/I/51-vkrxeECL.jpg", "country": "", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}