{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 21.304547, "ratings": {"num_ratings": 157, "rating": 4.3, "reviews": [{"review_sentiment": 2.0, "review_text": "I had difficulty following this book. Didn't finish it.  The writer of course wrote the style of the day. It bored me."}, {"review_sentiment": 5.0, "review_text": "Interesting read."}, {"review_sentiment": 5.0, "review_text": "Magnificent Strong Hawaiian people. The score will be settled by GOD ALMIGHTY in HIS time."}, {"review_sentiment": 5.0, "review_text": "Excellent read by America’s only real Monarch"}, {"review_sentiment": 5.0, "review_text": "Amazing, insightful, unyielding.  I cried several times when reading her account of the Hawaiian Kingdom's fortune and misfortune.  I've always known the history of the overthrow and occupation of the Hawaiian Kingdom, but this is a great book for those who want to know more details or even need a place to begin.  She also discusses Hawaiian family, education, and social practices prior to the overthrow.  She supplements with appendices which include her plea letters to presidents and ministers, text of the \"treaty of cession\", and other statements."}, {"review_sentiment": 5.0, "review_text": "Excellent history of Hawaii's annexation from a native Hawaiian's view . . ."}, {"review_sentiment": 5.0, "review_text": "MANDATORY READING!!!"}, {"review_sentiment": 4.0, "review_text": "As a former resident of Hawaii this book gave me an inside look and feel for how the Hawaiian Islands were stolen from the native Hawaiians. I also enjoyed her writing style."}, {"review_sentiment": 5.0, "review_text": "A great. Chronicle of how Hawai'i lost its independence to greed and American Jingoism at the turn of the 19th century.. Written by the deposed Monarch of this tiny nation in the pacific. The author's literary style is at times earstwhile and plaintive.  But at other times forceful and demonstrative."}, {"review_sentiment": 5.0, "review_text": "Still reading"}]}, "authors": ["Liliuokalani"], "isbn": "0935180850", "longitude": -157.8556764, "periods": ["1800s", "1900s", "Recent Releases"], "title": "Hawaii's Story by Hawaii's Queen", "word_cloud": "difficulty follow writer course write style day bore interest hawaiian people score settle time real monarch amaze insightful unyielding cry several time read account hawaiian fortune misfortune always know history overthrow occupation hawaiian great want know detail even need place also discuss hawaiian family education social practice prior supplement appendix include plea letter president minister text treaty cession statement excellent history annexation native view reading former resident give inside look hawaiian native also enjoy write style great chronicle lose independence greed american turn depose tiny nation author literary style time erstwhile plaintive time forceful demonstrative still read", "genres": ["Biography", "History"], "summary": "In 1893, Liliuokalani, the Queen of Hawaii, was deposed and five years later her nation became an incorporated territory of the United States.\r\n\r\n\r\nPublished shortly after these momentous events, her book Hawaii’s Story by Hawaii’s Queen is an incredibly personal history of the islands that she was born to rule. Liliuokalani covers from her birth in 1838 through the reigns of her forebears to her own turbulent time as Queen of the Hawaiian Islands.\r\n\r\nWritten to explain to the world the injustice of her situation and to reclaim the sovereignty which she had lost, the Chicago Daily Tribune claimed that “no scholar or lawyer could have state[d] it more effectively.” But despite her persuasive prose Hawaii never again regained its independence or its monarchy. \r\n\r\nHawaii’s Story by Hawaii’s Queen is a fascinating history of one of the United States of America’s smallest but most unique states as it was going through significant change at the turn of the twentieth century.\r\n\r\nQueen Liliuokalani was the last reigning monarch of the kingdom of Hawaii. She ascended the throne in January of 1891, upon the death of her brother, King David Kalakaua. For years after her overthrow, the Queen sought redress in the Congress and courts of the United States, but her efforts failed. Her autobiographical history Hawaii’s Story by Hawaii’s Queen is the only work by a Hawaiian monarch and provides insight into her fight to regain her throne and life on Hawaii during the late-nineteenth century.", "asin": "0935180850", "rank": "212448", "city": "Honolulu", "image": "https://images-na.ssl-images-amazon.com/images/I/51C5Q1DBAEL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}