{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 110, "rating": 4.0, "reviews": [{"review_sentiment": 2.0, "review_text": "Not my type of book.  Dragged on, nothing specific.  It took me forever to take this book.  I wanted more Jamaica and I just didn't get it."}, {"review_sentiment": 3.0, "review_text": "3 1/2 stars for this American classic- an early, original story of children captured by pirates, told largely from the children's POV. Story was written early in Hughes writing career, as well, and as such suffers some from undelineated shifts in POV, some ill advised uses of adjectives and adverbs, but on the whole, this work is still worth a read."}, {"review_sentiment": 1.0, "review_text": "This book I had such high hopes for. Started reading it and was so disgusted that I had to stop, which is rare for me. It was so explicitly gory, with detailed horror in almost every paragraph, and with that horrible cover drawn by a KNOWN PEDOPHILE (Google Henry Darger and his many drawings of naked children, little girls. Child porn.) When I saw the cover, I should have known what kind of book this was. This is NOT a classic. Good God. How do they get away with claiming that it is? It's a book of deep dark hellish people, hurting animals, killing animals, torturing insects. That book needs to go back to the nightmare it came from."}, {"review_sentiment": 4.0, "review_text": "High-seas piracy and the complex psychological lives of children are brought together, quite strikingly, in Richard Hughes’s 1929 novel \"A High Wind in Jamaica.\" This book looks ahead to William Golding’s \"Lord of the Flies\" in the way it suggests that the outward innocence of children may conceal a capacity for cruel and wicked acts; but Hughes’s presentation of these ideas seems to work at a subtler and more disturbing level than does Golding’s better-known 1954 novel.\"A High Wind in Jamaica\" begins in, unsurprisingly, Jamaica, at a time when that singularly lovely island is still an English colony. I took this book along with me on a trip to Jamaica, and I found that the descriptive passages from the early part of the book capture well the paradoxical beauty of the island: “The air was full of the usual tropic din: mosquitoes humming, cicalas trilling, bull-frogs twanging like guitars. That din goes on all night and all day almost: is more insistent, more memorable than the heat itself, even, or the number of things that bite” (p. 18). The evocation of natural beauty, closing on a note of menace: it is strongly characteristic of the manner in which Hughes conveys setting and tells his story.The “high wind” of the novel’s title is a hurricane that strikes Jamaica and destroys the home of the Bas-Thorntons, an English family who, like many other Britons of that time, have come to Jamaica to recoup fortunes lost in the mother country. Struck by how narrowly the family survived the tempest that destroyed the family home, and concerned that their proper English children seem to be taking on “wild” island ways, Mr. and Mrs. Thornton decide that it is a propitious time to send their children to live in England, along with the children of a nearby Creole family.Yet Hughes’s narrator places considerable emphasis on the idea that the Thorntons – and, by implication, most parents – know almost nothing about the actual emotional lives of their children, in passages like this one:“It would have surprised Mrs. Thornton very much to have been told that hitherto she had meant practically nothing to her children….[I]t would undoubtedly have surprised the children also to be told how little their parents meant to them. Children seldom have any power of quantitative self-analysis: whatever the facts, they believe as an article of faith that they love Father and Mother first and equally. Actually, the Thornton children had loved Tabby [the family cat] first and foremost in all the world, some of each other second, and hardly noticed their mother’s existence more than once a week. Their father they loved a little more: partly owing to the ceremony of riding home on his stirrups.” (pp. 44-45)But the Clorinda, the ship in which the Thorntons have booked passage “home” to England for their children, is waylaid by pirates; and once the children have been taken onto the pirate ship, Hughes gets on to his real subject: the question of what children – especially the two oldest Thornton children, John and Emily – are capable of, once the restraints of ordinary civilization have been stripped away.The children-and-pirates scenario may seem like something reminiscent of J.M. Barrie’s \"Peter Pan\" (1904); but if anything, \"A High Wind in Jamaica\" works as a sort of anti-\"Peter Pan.\" For one thing, the pirates, as led by a Danish captain named Jonsen and his Viennese first mate Otto, are not figures of operatic menace, like Captain Hook from Peter Pan or Long John Silver from Robert Louis Stevenson’s \"Treasure Island\" (1883); rather, they emerge as feckless and rather pathetic figures. Taking advantage of the indulgent attitudes of Spanish colonial authorities in the port of Santa Lucia, Cuba, they are operating a good 150 years after the supposed “golden age” of piracy: “Piracy had long ceased to pay, and should have been scrapped years ago; but a vocational tradition will last on a long time after it has ceased to be economic, in a decadent form. Now, Santa Lucia – and piracy – continued to exist as they always had: but for no other reason” (p. 96). And as their nautical misadventures unfold, Jonsen and Otto and the rest of the pirates show a remarkable capacity for poor and ill-informed decision-making. The more fateful, and more existentially troubling, words and actions and decisions come from the children.\"A High Wind in Jamaica\" offers a couple of real surprises. When, for example, one major character leaves the novel, the circumstances of said event are described so routinely – in a single, declarative, 24-word sentence, about one-third of the way through the book – that the reader is likely to flip through the next couple of pages in search of a passage saying “It was only a dream” or “It was not as serious as had been expected”; but no such passage is to be found. Comparably surprising is an action that Emily carries out after Captain Jonsen’s pirate ship has captured a Dutch merchantman.Hughes is one of those early-20th-century British modernists whose literary consciousness seems to have been molded in large part by the devastation of the First World War. His narrator sets forth the events of \"A High Wind in Jamaica\" with a knowing, rueful outlook on human flaws and failings, occasionally moving from the novel’s characteristic third-person omniscient point of view to passages of first-person narration in which the narrator stresses what he does not know – as when the narrator says of Mrs. Thornton that “She was a dumpy little woman – Cornish, I believe” (p. 44).This work reminded me of the novels of Robert Graves and Malcolm Lowry, fellow Britons who lived and wrote during the same period; and if you like books like Graves’s World War I memoir \"Good-Bye to All That\" (1929) or Lowry’s novel \"Under the Volcano\" (1947), then \"A High Wind in Jamaica\" will probably appeal to you as well."}, {"review_sentiment": 4.0, "review_text": "Welsh writer Richard Hughes published A High Wind in Jamaica in 1929 (sometimes published in the U.S. under the title The Innocent Voyage), and the playwright’s novel would go on to be turned into a Broadway production by dramatist Paul Osborn in 1943.  The novel was also adapted for a 1965 movie of the same title that starred Anthony Quinn and James Coburn, and was performed as a radio play on two occasions (once in 1950 and then again in 2000).  To say the least, the novel has had a good run.Despite all of that, I was unfamiliar with the novel and its author until I heard Ann Patchett praise it at the San Antonio book festival a couple of weeks ago in a conversation she had there with author Elizabeth McCracken.  It is Patchett’s theory that A High Wind in Jamaica has served as the blueprint for countless novels about children who are totally oblivious to the dangerous circumstances they may suddenly find themselves in.  She admits to more than once having used the pattern herself, including in her current novel, Commonwealth (a novel that turns out to be much more autobiographical than I would have imagined before hearing the author speak about it).A High Wind in Jamaica tells the story of a group of children being sent to England from Jamaica by their parents so that they can attend boarding schools in the mother country.  The children, all of them roughly between the ages of three and ten years old, are sent on their own – the youngest children being in the complete care of their older brothers and sisters.  Unfortunately, the rather lazy and negligent captain of the vessel on which they leave for England, allows his boat to be boarded and taken by a small group of the most incompetent “pirates” in the history of piracy.  The cowardly captain, in fact, makes a run for his own freedom, abandoning the children to the pirates who had temporarily moved the kids to their own little boat.  Now, the Danish pirate captain and his crew are stuck with a bunch of kids they have no idea what to do with – try as they might to figure it all out.To the kids, who never realize that their very lives are in jeopardy, it is all one big adventure and soon enough they are climbing ropes and getting into trouble at a pace that astounds even the roughest of the pirate crew.  The captain knows that he has to get rid of the children one way or the other if he is going to be able to avoid capture and prison – or worse – but no one wants to take them off his hands.Richard Hughes tries to take the reader inside the minds of the children and what they see from their distinctive points-of-view, his theory being that the minds of children do not work anything remotely like the minds of adults work.  This is a point that none of the adults in the story ever seem to figure out – and the repercussions stemming from this oversight are both comic and tragic.  In the end, the children who live through the prolonged “kidnapping” may be the least affected by what happened to them on the high seas around Cuba.Bottom Line: A High Wind in Jamaica is clever piece of satire that manages to be both a comedy and a tragedy.  It is easy to see why the short novel (191 pages) has been popular for so long, and if Ann Patchett’s theory is correct, why it will remain a studied piece of writing for decades to come.  Despite its sometimes-tedious writing style, this one makes for an interesting read."}, {"review_sentiment": 5.0, "review_text": "Great literature. Like magical reason, but not, which makes it even stranger and more wonderful."}, {"review_sentiment": 5.0, "review_text": "The audiobook is wonderful.  Great narration."}, {"review_sentiment": 5.0, "review_text": "I read this around age 13, while at a family trip to the beach.  My father (who loved O'Henry's \"Ransom of Red Chief\") gave me his copy.  I remember that I couldn't put it down.  Mind you, this was 52 years ago!  That's how much of an impression the book made upon me.My memory was that the book was about a hurricane in Jamaica, and now that I live in hurricane country, I thought it would be interesting to read it again.  I was shocked to read in Wiki what the storyline is of this book.  I'd completely forgotten!  As I read about the children, I realized that perhaps that was one of the things that fascinated me:  it was so completely different from any other book about children than I had ever read.One brief comment.  Knowing what I know now about slavery, Jamaica was one of the most terrible places that a slave could ever live.  Is it possible that this is deliberate?  The descendants of slave owners experience some of what was inflicted on the slaves who made their family wealthy (in the past, at least)?"}, {"review_sentiment": 4.0, "review_text": "An unusual novel with some quite malevolent undertones. Enjoyed the setting, a lush and sultry Jamaica and life aboard a pirate vessel. It was the characters themselves that I found difficult to like, child and adult. It's certainly a well written novel just not one that I felt an affinity to."}, {"review_sentiment": 2.0, "review_text": "Glad I read it for book discussion, but bizarre, complex mix of Peter Pan meets Heart of Darkness…did not enjoy reading it, but did enjoy discussing it."}]}, "authors": ["Richard Hughes"], "isbn": "0940322153", "longitude": 0.0, "periods": ["1800s"], "title": "A High Wind in Jamaica", "word_cloud": "not nothing specific take forever take want get star american early original story child capture pirate tell largely child write early write career well suffers delineate shift ill advise us adjective adverbs whole work still worth hope start read disgust stop explicitly gory detailed horror almost paragraph horrible cover drawn many drawing naked child little girl porn saw cover know kind classic away claim deep dark hellish people hurt animal kill animal torture insect need go back nightmare come piracy complex psychological life child bring together quite strikingly look ahead way suggest outward innocence child capacity cruel wicked act presentation idea seem work subtler disturb level golding begin unsurprisingly time singularly lovely island still english colony take along trip find descriptive passage early part capture well paradoxical beauty island air full usual tropic din mosquito hum cicada trill twang guitar din go night day almost insistent memorable heat even number thing bite evocation natural beauty closing note menace strongly characteristic manner conveys set tell title hurricane strike destroy home family many briton time come recoup fortunes lose mother country narrowly family survive tempest destroy family home concern child seem take wild island way decide propitious time child live child nearby narrator place considerable emphasis idea implication parent know almost nothing actual emotional life child passage surprise much tell hitherto meant practically nothing undoubtedly surprised child also tell little parent meant seldom power quantitative fact believe article faith first equally child love family cat first foremost world second hardly notice mother existence week father love little partly owe ceremony rid home pp ship book passage home child waylay pirate child take pirate ship get real subject question child especially oldest child capable restraint ordinary civilization strip scenario something reminiscent anything work sort thing pirate lead danish captain name first figure operatic menace rather emerge feckless rather pathetic figure take advantage indulgent attitude spanish colonial authority port operate good year suppose golden age piracy long cease pay year ago vocational tradition last long time cease economic decadent form now piracy continue exist always reason nautical misadventure unfold rest pirate show remarkable capacity poor fateful existentially troubling word action decision come child offer couple real surprise example major character leave circumstance say event describe routinely single declarative sentence way likely flip next couple page search passage say dream serious expect passage find comparably surprising action carry pirate ship capture british modernist literary consciousness seem mold large part devastation narrator set forth event know rueful outlook human flaw failing occasionally move characteristic omniscient point view passages narration narrator stress know narrator say dumpy little woman believe work remind novel fellow live write period memoir probably appeal well writer publish sometimes publish playwright turned production dramatist also adapt movie title star perform radio play occasion least good unfamiliar author hear praise festival couple week conversation author theory serve blueprint countless novel child totally oblivious dangerous circumstance suddenly admits use pattern include current turn much autobiographical hear author speak tell story group child send parent attend board school mother country child roughly age year old send youngest child complete care older brother sister unfortunately rather lazy negligent captain vessel leave allow boat board take small group incompetent pirate history piracy cowardly captain fact make run freedom abandon child pirate temporarily move kid little boat now danish pirate captain crew stuck bunch kid idea try kid never realize life jeopardy big adventure soon enough climb rope get trouble pace astound even roughest pirate crew captain know rid child way go able avoid capture prison worse want try take mind child see distinctive theory mind child work anything remotely mind adult work point none adult story ever seem figure repercussion stem oversight comic tragic end child live prolong kidnapping affected happen sea clever piece satire manage comedy tragedy easy short page popular long theory correct remain studied piece write decade come write style make interesting great literature magical reason make even stranger wonderful audio book wonderful narration around age family trip beach father love give copy remember year ago much impression make memory hurricane live hurricane country think shock story line completely forget child realize perhaps thing fascinate completely different child ever brief comment know know slavery terrible place slave ever possible deliberate descendant slave owner experience inflict slave make family wealthy past least unusual quite malevolent undertone set lush sultry life aboard pirate vessel character find difficult child adult certainly well write felt affinity discussion bizarre complex mix meet enjoy read enjoy discuss", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Richard Hughes's celebrated short novel is a masterpiece of concentrated narrative. Its dreamlike action begins among the decayed plantation houses and overwhelming natural abundance of late nineteenth-century Jamaica, before moving out onto the high seas, as Hughes tells the story of a group of children thrown upon the mercy of a crew of down-at-the-heel pirates. \r\n\r\nA tale of seduction and betrayal, of accommodation and manipulation, of weird humor and unforeseen violence, this classic of twentieth-century literature is above all an extraordinary reckoning with the secret reasons and otherworldly realities of childhood.", "asin": "0940322153", "rank": "95665", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/51HZ6h58W5L.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}