{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 1, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "I am a real estate broker and being new to Miami due to my husbands job transfer I ordered this book to learn about the area and the history of Miami. I felt how could I fairly represent homes and the area without knowing the history of it. I loved this book. I found it hard to put down. In reading this book I found in the obituary in the paper last week that William \"Butch\" Brickell passed away at 46 in his sleep at his home in Coral Gables. He was the Great Great Grandson of William and Mary Brickell. I felt after reading it, I had an understanding of the family that were his relatives. Sad to lose a young man and the death is still undetermined. I'd of love to have met him. Awesome book for locals to get a better understand of the earth under our feet! Plus, I loved the mention of Titusville....where I am orginally from!Karen Hoyt Mason"}]}, "authors": ["Helen Muir"], "isbn": "0940495198", "longitude": -80.1936589, "periods": ["1900s"], "title": "Miami, U.S.A.", "word_cloud": "real estate broker new due husband job transfer order learn area history felt fairly represent home area know history love find hard put reading find obituary paper last week pass away sleep home felt read understand family relative lose young man death still undetermined love meet local get better understand earth foot love mention originally", "genres": ["History"], "summary": "\"The best book ever written on Miami.\" Tampa Tribune\r\n\r\nHelen Muir s affectionate account of Miami first appeared in 1953 and has grown through several revisions into the definitive popular history of a remarkable city. Marjory Stoneman Douglas, writing for the Chicago Tribune, called the first edition \"vigorous, colorful, dramatic, variously detailed, jam-packed with people, fast moving, a seething document. . . . Helen Muir threads her way vividly and surely through the tangles of modern crime, pretensions, and scandals, but also shows Miami growing enormously as an intellectual and cultural focus.\"\r\n\r\nIn the decades since, change has roared through Miami like a hurricane, and Helen Muir, at 89, remains active in the city s cultural and intellectual life.\r\n\r\nUpdating this new edition through the 1990s, Muir brings the story of the frontier post transformed by Flagler, Tuttle, and a host of near-legendary figures and events to a new century of readers. To those who reflect on Muir s colorful epilogue, the city s primitive origins barely 100 years ago will seem improbable, the characters and events of its boom, crash, and war years astonishing, and the pace of its growth and transformation since that time barely believable.", "asin": "0940495198", "rank": "2686847", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51pWxFT6u9L.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}