{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 42.8184538, "ratings": {"num_ratings": 2, "rating": 2.9, "reviews": [{"review_sentiment": 1.0, "review_text": "Like the previous reviewer, I very much like the production of the Peirene books, and love having otherwise inaccessible authors translated for an English-speaking audience eager to read these authors.However, unlike the previous reviewer, I completely disagree about the quality of the writing...or the translation.  The language is not exquisite, but overly pedantic, containing much that does nothing to propel the plot or dialogue--the book could have been much shorter without useless statements such as: \"He blinks\".  On the one hand, overtly flowery language is a hindrance if the writer has nothing compelling to say, but on the other, it can also be too banal--which it is in the case of this book.  The writer stretched out the plot in a nice fashion, keeping you guessing as to the motive for the boxer's (Danny's) flight to Pamplona, but it was painful to get there.  The Robert character is cardboard stiff and uninteresting--the most interesting passages are those of Danny's recollection of his dealings with his trainer and promoter, and with the love interest. There is nothing to believe in any connection between Robert and Danny, nor Danny's sense of obligation to Robert.  There is also very little development of characters as a whole that surround the main character.This series is a wonderful idea, and beautifully produced, but either the translations are too simplistic and un-evocative of the writers' own languages, or the writers themselves have been ill-advisedly chosen for this series.A big disappointment for me, though I had much hope."}, {"review_sentiment": 5.0, "review_text": "This new series of short paperbacks from Peirene publishers are beautifully produced and reasonably priced. They give English readers the opportunity to sample contemporary European writers via excellent translations.I started with Tomorrow Pamplona, a dark brooding thriller. The language is exquisite and the plot sucks you in and propells you forward to the climax at the end. This is heady stuff, and not for the faint hearted!"}]}, "authors": ["Jan van Mersbergen"], "isbn": "0956284043", "longitude": -1.6442556, "periods": ["2000s", "Recent Releases"], "title": "Tomorrow Pamplona", "word_cloud": "previous reviewer much production love otherwise inaccessible author translate audience eager previous reviewer completely disagree quality write translation language exquisite overly pedantic contain much nothing propel plot dialogue much useless statement blink hand overtly flowery language hindrance writer nothing compel say also banal case writer stretch plot nice fashion keep guess motive boxer flight painful get character cardboard stiff uninteresting interesting passage recollection dealing trainer promoter love interest nothing believe connection sense obligation also little development character whole surround main series wonderful idea beautifully produce translation simplistic writer languages writer choose big disappointment much hope new series short paperback publisher beautifully produce reasonably price give english reader opportunity sample contemporary european writer excellent start dark brood language exquisite plot suck propel forward climax end heady stuff faint heat", "genres": ["Fiction & Literature"], "summary": "A story about anger, aggression and the desire for intimacy by a rising star of modern Dutch literature.\r\n\r\nA professional boxer and a family man meet by chance on a journey to the Pamplona Bull Run. The boxer is fleeing an unhappy love. The father hopes to escape his dull routine. Both know that, eventually, they will have to return to the place each calls ‘home’.\r\n\r\nWhy Peirene chose to publish this book: ‘I adore the deceptive simplicity of this story. On the surface, the fast moving plot, the short sentences, the ordinary words make the text as straightforward as punches in a boxing match. But just as physical conflict stirs deep emotions, so too does this book as it focuses on a single question: how do you choose between flight and fight?’ Meike Ziervogel\r\n\r\n‘As he tracks back and forth between the dual narratives, moving inexorably to the double climax, Van Mersbergen skilfully builds emotional intensity until the point when the boxer and bulls' fury are finally unleashed.’ The Independent\r\n", "asin": "0956284043", "rank": "5466191", "city": "Pamplona", "image": "https://images-na.ssl-images-amazon.com/images/I/419ueW2FowL.jpg", "country": "Spain", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}