{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 54, "rating": 4.1, "reviews": [{"review_sentiment": 4.0, "review_text": "good book"}, {"review_sentiment": 2.0, "review_text": "Predictable sports / hero worship book, nothing surprising here. Compare with, say, Zlatan's autobiog which is pretty interesting coz Zlatan is such a bizarre character."}, {"review_sentiment": 4.0, "review_text": "Not the best book on a sports team but still worth your time"}, {"review_sentiment": 5.0, "review_text": "Amazing"}, {"review_sentiment": 4.0, "review_text": "Graham Hunter is obviously a fan of Barca. It is a good reading for whom like me love Barca and have witnessed every step of Guardiola's excellent legacy as a Barca coach between 2008 and 2012.For the cerebral readers and neutrals who thrive on reading the evolution of tactics and the relentless renowned effort of Pep in changing his tactics, his book offers little input in that regard."}, {"review_sentiment": 3.0, "review_text": "Mostly an author's love affair with Barca. Not very revealing, mostly rehashed material."}, {"review_sentiment": 4.0, "review_text": "Got a lot more deep story from this book.well writing."}, {"review_sentiment": 4.0, "review_text": "Enjoyed the structure of the book and the detailed information."}, {"review_sentiment": 5.0, "review_text": "Extremely enjoyable read, Graham Hunters insight to the world of Barcelona is incredible. I couldn't put the book down. A must for anyone who loves how Barcelona play football, and who enjoy reading stories and learning the history of some of the best footballers the world has ever seen"}, {"review_sentiment": 3.0, "review_text": "It's entertaining for the stories it provides, a result of the author's access to the team and club. However it is also un-balanced on account of this. The fan as author doesn't succeed here."}]}, "authors": ["Graham Hunter"], "isbn": "0956497152", "longitude": 2.1774322, "periods": ["1800s", "1900s"], "title": "Barça: The Making of the Greatest Team in the World", "word_cloud": "good predictable sport hero worship nothing surprising say auto biog pretty interesting cox bizarre character not best sport still worth time amaze obviously fan good reading love witness step excellent legacy coach cerebral reader neutral thrive read evolution tactic relentless renowned effort change tactic offer little input regard mostly author love affair not reveal mostly rehash material lot deep story write structure detail information extremely enjoyable insight incredible anyone love play football enjoy read story learn history best footballer ever see entertain story provide result author access club however also account fan author", "genres": ["History", "Sport"], "summary": "Founded in 1898, FC Barcelona, also know as Barca, is today the world's biggest football club. Its 120,000-seat stadium, Camp Nuo, is one of the great cathedrals of the game, and its museum is the most visited in Spain. This is the story of FC Barcelona and its evolution as a social and political phenomenon.", "asin": "0956497152", "rank": "487269", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51qkqITe1fL.jpg", "country": "Spain", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}