{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 199, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Amazing read!"}, {"review_sentiment": 5.0, "review_text": "Absolutely spellbinding!  Thanks for making this hard-to-find treasure available."}, {"review_sentiment": 5.0, "review_text": "This is a masterful work of fiction that everyone should read."}, {"review_sentiment": 5.0, "review_text": "This is an ingenious hatching of a theory of the Whitechapel Murders case, one that flies in the face of all that's good and civilized in Victorian Britain and the British Empire at its peak, despite all those well-known wens, warts, and suppurating lesions.And perhaps the greatest graphic novel yet produced, despite the oftentimes nearly illegible lettering in what I must assume is a reduced page size from the normal magazine- or comic-page sizing of around 8.5” x 11” or so. (You may need strong reading glasses to make out some of the text.) Alan Moore is an indefatigable researcher and brilliant storyteller. Eddie Campbell's spidery, scratchy drawings suit the murky mood of the story. (And even so, when called upon to render historic London architecture, Campbell’s panels burst into glorious, meticulous copperplate-etching-type, scaled architecture-textbook detail and quality.)This book gripped me from front to back. The conspiracy Moore conjures, supported by 42 pages of dense notes and an additional graphic appendix, unfolds splendidly. It includes, of course, the London neighborhoods, and volumes (or is it simple myriad panels) on 19th century social mores, to include, yes, all those whores and other species of “loose women” and, to our eyes today, reprehensible men, but also – for those who are unprepared, but this is no spoiler, because the Ripper stories have been in circulation for sometimes more than a century – royalty, to include Victoria, Druidism and the Old Gods, Freemasonry and its secrets and rituals, icons on 19th century art, architecture, and literature, details of contemporary police and Scotland Yard procedure, and, believe me, very much more, crammed into its  572 pages.And on my next visit to London I'm going to bring with me chapter 4, as my guide to the buildings of Nicholas Hawksmoor. For an architecture buff, as I am, who has stomped around London peering into old churches and ancient structures, as I have, chapter 4, and its beautiful renderings of some of London’s greatest churches, was a particular unexpected, delightful serendipity.I would urge every reader to narrate chapter 14 aloud, in the most refined English accent they are capable of producing. I found it to be a chilling reading experience.And parents, if the title fails to warn you sufficiently, do examine the contents closely before leaving this one out for the kiddies on a rainy Saturday. The copy I read had no \"for mature readers only\" markings. From Hell is most assuredly for mature readers only and deserves, at the very least, an “NC-17” rating.This is simply a terrific read and one that, I see from other reviews, will require from many a measure of patience. Moore unfolds his tale at what some will find a too-leisurely pace. Other readers have greater toleration for both glacial pace and a carefully studied narrative ambiguity. For those of us who wallow in detail, texture, and explanatory endnotes, as well as a horror stories that, in the end, are truly disturbing, this should be just the ticket."}, {"review_sentiment": 5.0, "review_text": "I would definitely recommend this book to anyone who is a fan of graphic novels. However this book is not for a younger audience as it features gruesome murders and gratuitous sex, albeit in drawings."}, {"review_sentiment": 5.0, "review_text": "good seller. great book."}, {"review_sentiment": 4.0, "review_text": "Not finished reading but it's good so far"}, {"review_sentiment": 1.0, "review_text": "the book that i got will make you wonder if it was really brand new. the corners are dented and the spine opening the cover page is ripped."}, {"review_sentiment": 5.0, "review_text": "Purchased for son at his request - he's delighted."}, {"review_sentiment": 3.0, "review_text": "I can see why people enjoy this novel - if you are a fan of the graphic style, this is a very compelling and complex story.  I just realized upon reading this that I don't enjoy graphic novels.  There was just a bit to many violent and sexual scenes that I thought added very little to the story, but just were put there for shock value.Even though it wasn't my taste, I could see the value in this book.  The story has some interesting philosophical moments and it does make you think.  So if you enjoy graphic novels, this might be something you like.  If you aren't sure of that style, I would say stay away."}]}, "authors": ["Alan Moore"], "isbn": "0958578346", "longitude": -0.12574, "periods": ["1800s", "Recent Releases"], "title": "From Hell", "word_cloud": "amaze absolutely spellbind make treasure available masterful work fiction everyone ingenious hatch theory case fly face good civilized victorian peak wen wart suppurate perhaps greatest graphic yet produce oftentimes nearly illegible letter reduce page size normal size strong reading glass make text indefatigable researcher brilliant storyteller spidery scratchy drawing suit murky mood story even call render historic architecture panel burst glorious meticulous scale detail quality grip back conspiracy conjures support page dense note additional graphic appendix unfolds splendidly include course neighborhood volume simple myriad panel century social more include yes whore specie loose woman eye today reprehensible men also unprepared spoiler stories circulation sometimes century royalty include secret rituals icon century art architecture literature detail contemporary police procedure believe much cram next visit go bring chapter guide building architecture buff stomp peer old church ancient structure chapter beautiful rendering greatest church particular unexpected delightful narrate chapter aloud refine accent capable produce find chill read parent fails warn sufficiently examine content closely leave kiddy rainy copy mature reader marking assuredly mature reader deserves least simply terrific see review require many measure patience unfolds tale find pace other reader greater toleration glacial pace carefully study narrative ambiguity wallow detail texture explanatory end notes well horror story end truly disturb ticket definitely anyone fan graphic novel however younger audience feature gruesome murder gratuitous sex drawing good seller great not finish reading good far got make wonder really brand new corner dent spine opening cover page rip purchase son request delight see people enjoy fan graphic style compelling complex story realize read enjoy graphic novel bit many violent sexual scene think add little story put shock taste value story interesting philosophical moment make think enjoy graphic novel something sure style away", "genres": ["Comics & Graphic Novels", "Fiction & Literature", "Historical Fiction", "True Crime"], "summary": "Legendary comics writer Alan Moore and artist Eddie Campbell have created a gripping, hallucinatory piece of crime fiction about Jack the Ripper. Detailing the events that led up to the Whitechapel murders and the cover-up that followed, From Hell has become a modern masterpiece of crime noir and historical fiction.", "asin": "B001GIL1I0", "rank": "1618715", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51p9fO-aXiL.jpg", "country": "England", "story_arc": ["Tragedy", "Things only get worse"]}