{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 36.1662859, "ratings": {"num_ratings": 50, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "A big Dave Hickey fan"}, {"review_sentiment": 5.0, "review_text": "A book I've given to many people over the years. The writing, the insights, the humor are incomparable. Dave Hickey is a bit of a curmudgeon, but being as intelligent and cultured as he is, how could he not be."}, {"review_sentiment": 5.0, "review_text": "Lots of insight on art and life, as well as a laugh-out-loud read - especially the essay on Liberace - I highly recommend this book."}, {"review_sentiment": 5.0, "review_text": "Just five stars. Hickey is my hero."}, {"review_sentiment": 3.0, "review_text": "This is a collection of critical essays on various American popular media from the back half of the 20th century. For those who came up anytime between the 60's and the late 80's, the topics will likely resonate, and the eulogies for celebrity figures will inspire fond nostalgia. Hickey has a clever insight for every topic under the sun, no matter how mundane it may seem; he exposes the subtle ideologies that we take for granted in familiar stories and songs.I am a little bit skeptical of the theme; \"Art and Democracy\" is far too broad a topic, and the seemingly random pop culture grab-bag represented here lacks unity. Air Guitar has some fantastic content, but as a collection, it never justifies its own necessity. Still, it has its worth as a course on how to write fluid, optimistic criticism (certainly absent from today's polemical internet media); or, simply, as an expertly-rendered nostalgia trip."}, {"review_sentiment": 5.0, "review_text": "Absolutely enjoyable read. dave hickey is an art critic that knows how to write."}, {"review_sentiment": 5.0, "review_text": "i got this volume around 2003 while attending RISD.  It was a hyper craze at the time, circulating amongst my friends. If you hadn't read it, then you were in the process of doing so.  I think it appealed to our short attention spans.  But more importantly, it was prized as one of very few \"youthful\" and pop-cultural illuminations of art criticism.  And most importantly, it is just well-written and succinct book, that is partly based in a tradition of writing that is as verbose as the day is long.Hickey's prose reads like that of a smart-ass at times.  he assumes that reader is familiar with the artist names, and he drops many of them often, and quickly abandons them.  This turned me off at first.  but then i realized: i am a bit of a smart-ass myself.  Therefore his writings had a firm place in the back of my mind whilst i constructed my MFA thesis around '08.His framework of writing led me to discover a sub genre in literature called \"Kmart Minimalism.\"  Just as hickey describes the environment of fine/commercial art, and art dealing and criticism, a kmart minimalist describes a physical environment by dropping and abandoning a range of items of commercial debris (like walking through a kmart and itemizing everything you see.)This book is wonderful!!  i recommend it to anyone who is interested in art!!"}, {"review_sentiment": 5.0, "review_text": "I loved every word.  It brought back so many memories and introduced me to new ones."}, {"review_sentiment": 5.0, "review_text": "Super book, great condition. Well worth the investment to own."}, {"review_sentiment": 4.0, "review_text": "Better than \"OK\" condition mentioned in description, I'm very pleased with this purchase and even more enthralled by the content!"}]}, "authors": ["Dave Hickey"], "isbn": "0963726455", "longitude": -115.149225, "periods": ["1900s"], "title": "Air Guitar: Essays on Art & Democracy", "word_cloud": "big fan give many people year write insight humor incomparable bit curmudgeon intelligent culture lot insight life well especially essay highly recommend just star hero collection critical various american popular medium back half century come anytime late topic likely resonate eulogy celebrity figure inspire fond nostalgia clever insight topic sun matter mundane expose subtle ideology take grant familiar story little bit skeptical theme far broad topic seemingly random pop culture represent lack unity fantastic content collection never justify necessity still worth course write fluid optimistic criticism certainly absent today polemical internet medium simply nostalgia trip absolutely enjoyable dave hickey critic know get volume attend hyper craze time circulate among st friend process think appeal short attention span importantly prize youthful illumination criticism importantly succinct partly base tradition write verbose day prose read time assumes familiar artist name drop many often quickly abandon turn first realize bit writing firm place back mind whilst construct thesis around framework write lead discover sub genre literature call hickey describe environment deal criticism kmart minimalist describe physical environment drop abandon range item commercial debris walk itemize everything wonderful recommend anyone interested love word bring back many memory introduce new one great condition investment condition mention description please purchase even enthral content", "genres": ["Essay", "Art & Architecture", "History"], "summary": "The 23 essays (or \"love songs\") that make up the now classic volume Air Guitar trawl a \"vast, invisible underground empire\" of pleasure, through record stores, honky-tonks, art galleries, jazz clubs, cocktail lounges, surf shops and hot-rod stores, as restlessly on the move as the America they depict. \r\n\r\nAir Guitar pioneered a kind of plain-talking in cultural criticism, willingly subjective and always candid and direct. A valuable reading tool for art lovers, neophytes, students and teachers alike, Hickey's book--now in its eighth printing--has galvanized a generation of art lovers, with new takes on Norman Rockwell, Robert Mapplethorpe, Stan Brakhage, Andy Warhol and Perry Mason. \r\n\r\nIn June 2009, Newsweek voted Air Guitar one of the top 50 books that \"open a window on the times we live in, whether they deal directly with the issues of today or simply help us see ourselves in new and surprising ways,\" and described the book as \"a seamless blend of criticism, personal history, and a deep appreciation for the sheer nuttiness of American life.\"\r\n\r\nDave Hickey (born 1939) is one of today's most revered and widely read art writers. He has written for Rolling Stone, Art News, Art in America, Artforum and Vanity Fair among many others.", "asin": "0963726455", "rank": "262514", "city": "Las Vegas", "image": "https://images-na.ssl-images-amazon.com/images/I/41cX5kIzjnL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}