{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 24.5895489, "ratings": {"num_ratings": 50, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "This book is great. I would recommend this to anyone traveling to Costa Rica or to anyone interested in learning about restoration of jungles and preservation of our natural world."}, {"review_sentiment": 5.0, "review_text": "I met Jack Ewing when I was in Costa Rica and loved his story. The book gave me more information on the biodiversity and work they are doing in Costa Rice.  Good read."}, {"review_sentiment": 5.0, "review_text": "Fun and interesting stories that will help you with understanding Costa Rica for your visit or just worldly view"}, {"review_sentiment": 5.0, "review_text": "Good first book on this small jewel of a country... I have since read three other books to orient myself on the Tico culture for my trip  next yr."}, {"review_sentiment": 5.0, "review_text": "Exceptionally well written and important book.  The author is passionate about his subject and is a talented story teller.  If you've had the opportunity to travel to Costa Rica, the stories in this book will resonate strongly as many of the animals and nature described in this book are typically Costa Rican and difficult to avoid when you are there.  The stories are written with a friendly and funny narrative tone which draws in the reader. Also the short chapters in the book each devoted to an animal or natural phenomenon allow readers to gain a wide and varied exposure to many subjects.  I've been to Costa Rica on two occasions, and reading this book motivates me to return and discover some of the natural wonders I've yet had a chance to see. This is a fascinating read!"}, {"review_sentiment": 4.0, "review_text": "I met Jack Ewing during a recent trip to Costa Rica.... he's obviously passionate about helping the reemergence of the bio corridors in Central America.  His writing style is that of a storyteller. The book is both informative and thought provoking."}, {"review_sentiment": 5.0, "review_text": "Great read!"}, {"review_sentiment": 4.0, "review_text": "Apparently this book is composed of a compilation of previously published  articles. Each one has its own feel. Together they they give an insightful, if arcane look at Costa Rica from a previous cattle rancher turned environmentalist. I liked it ."}, {"review_sentiment": 3.0, "review_text": "Cool anecdotal stories but writing is at times amateurish.  Writer has good intentions."}, {"review_sentiment": 5.0, "review_text": "This book is excellent! We've been on the Carribean side of Costa Rica twice, but after reading this book, I definitely want to visit the southwestern part of Costa Rica too. And if you're interested in the human impact on our natural world, this is an eye opening book. I highly recommend it!"}]}, "authors": ["Jack Ewing"], "isbn": "0965809811", "longitude": -107.3920441, "periods": ["2000s", "Recent Releases"], "title": "Monkeys Are Made Of Chocolate: Exotic And Unseen Costa Rica", "word_cloud": "great anyone travel anyone interested learn restoration jungle preservation natural world meet love story give information biodiversity work interest story help understand visit worldly view good first small jewel country orient culture trip yr exceptionally well write important author passionate subject talented story teller opportunity travel stories resonate strongly many animal nature describe typically rican difficult story write friendly funny narrative tone draw also short chapter devote animal natural phenomenon reader gain wide varied exposure many subject occasion read motivates return discover natural wonder yet chance see fascinating meet recent trip obviously passionate help reemergence bio corridor write style storyteller informative thought provoke great apparently compose compilation previously publish article feel together insightful arcane look previous cattle rancher turn environmentalist like anecdotal story write time amateurish good intention excellent side twice read definitely want visit southwestern part interested human impact natural world eye open highly recommend", "genres": ["Science & Nature"], "summary": "Discover the mysterious and fascinating ways in which animals and plants—and people—interact with one another in the rainforests of Costa Rica. Author and naturalist Jack Ewing shares a wealth of observations and experiences, gathered from more than three decades of living in southwestern Costa Rica, home to some of the most prolific and diverse ecosystems on Earth. \r\n\r\nMore than just a simple collection of essays, Monkeys are Made of Chocolate is a testament to the wonder of life in all its countless guises, as seen through the eyes of a man with a gift for subtle discernment and a natural flair for storytelling.", "asin": "0965809811", "rank": "152755", "city": "Costa Rica", "image": "https://images-na.ssl-images-amazon.com/images/I/513W0SWVHTL.jpg", "country": "Mexico", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}