{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 42.8804219, "ratings": {"num_ratings": 11, "rating": 2.7, "reviews": [{"review_sentiment": 1.0, "review_text": "So I made the mistake of buying this book not once but twice although I will only be reading it once. To begin, the first time that I bought this book it was authored by Ellen something or other. The second time, excited to read another book about the Camino written by a female author, I bought it thinking that Elyn Aviva just had to be a different writer than the ever complaining and unprepared Ellen but unfortunately it was not. Only the spelling of the name was different (the reason being is lost on me) With difficulty I returned to these pages because day in and day out the same story was repeated ad nauseum, including the ever redundant sentence: It was hot. For someone intent on walking the \"true\" path, steeped as it is in rich history and spiritual essence, Ellen (and Elyn) was dismissive of those not walking the authentic way. For the scholar that she supposedly is her writing is eclipsed by pseudo-judeo Christian views that she herself does not believe but still finds it necessary to proselytize nonetheless. Any insight that might be of interest to readers seeking to undertake the journey that follows the Milky Way is merely briefly mentioned and never explored, and in my opinion the book is poorer for it. It is my hope that a third edition of this book is not published under yet another nom de plume."}, {"review_sentiment": 4.0, "review_text": "One of the better books I've read about the Pilgrimage de Camino de Santiago."}, {"review_sentiment": 2.0, "review_text": "I did not like all the unanswered questions in the book.  This is a book showing how not to do the 811 km \"walk\" to Santiago.  The last 100 km is supposed to be done entirely on foot to be eligible for the Compostela Certificate of completion of the pilgrimage. Yet, these pilgrims did it partly by taxi from Sarria and then claimed the certificate!  And write a book about it."}, {"review_sentiment": 3.0, "review_text": "It was more about the history of the Camino and not about the actual hiking of it .  Really good if you want to know the background and about the sites along the way."}, {"review_sentiment": 3.0, "review_text": "Following the Milky Way was an interesting account of the Camino de Santiago, but not riveting. I think I was expecting more."}, {"review_sentiment": 1.0, "review_text": "Pros:  The author does mention a few historical aspects of the Camino. But, note these historical and cultural aspects can be found in other books that are better written.Cons: Very self serving, whining, continuous complaining. The author is clearly not interested in the cultural aspects and certainly not the religious ones of the Camino. The majority of her complaints and sufferings are self imposed. The heavy drinking along with huge meals coupled with the heat and walking are a recipe for the stomach distress and heat injuries the author complains so much of.  She starts her walk late in the  morning and walks at the highest heat. What a fool! Furthermore there is no personal growth. Most Camino writers, even the non religious, have at least learned something about themselves.  This one does not. The rhetorical questions at the moments of internal thought are insipid. Can't recommend this book there are so many other excellent books that have the same information on the Camino in them and are far more interesting to read."}, {"review_sentiment": 1.0, "review_text": "I have read many books on the Camino De Santiago.  The information on this book intrigued me enough to spend my money and purchase a copy.  This book has been one of the hardest ones to get through.  It is written as if two books were thrown together.Con:  The personal portions of the book are painful to stomach as the author complains and whines ad nauseam, along with the endless references to the \"authentic\" Camino.  From the beginning of the book to the end, the author whines, complains, does not believe in anything, has no real purpose for walking the Camino other than to say she did.  Her only real focus is to make SURE she walks the \"real\" or \"authentic\" Camino.  Very odd.  The \"real\" Camino is the journey itself.  I find myself skipping large portions of this book (the author's personal insights) as they do not add any value to the experience of reading it.  I certainly don't imagine that walking 800 km is a fairy tale experience, however, an insightful book is much more profound then a journal full of rants like this one.  When you finally get to page 246 the author is suddenly MORE consumed with arriving at Santiago on August 22, then with walking the \"authentic\" Camino.  So she takes not one but TWO taxi rides for 43 kilometers rationalizing that \"...after all, the Camino is very long, and some parts of it were more authentic than others.  Besides, we had run short on time.\"  The Certificate is given to people who actually walk at least the last 100 km.  Apparently she rationalizes that one, by insisting on getting her certificate.  The cherry on top is her elitist attitude upon arrival in Santiago, her expectations that she was a \"real\" pilgrim because she walked (most of the way) and expected special treatment.  The church, however, treats all visitors the same, regardless of their mode of transportation.  Her lack of patience with people I found surprising, with \"we had no tolerance for petty bureaucracy any more.\"  So she lost patience on the Camino?  I doubt she had any before the Camino.  I am saddened by her experience.  Rather than walking with eyes and heart wide open she walked with an agenda clutched tightly in her fist.Pro:  The historical interjections are interesting and well written.  I think this book would have faired much better had the author written a book with that as the focus, and perhaps ended the book with a chapter on personal experience.  I do NOT recommend this book.  There is nothing to be gained from reading it.  I do, however, recommend spending your hard earned money on any one of the the following books:  'My Camino', 'Pilgrimage to the End of the World', 'Confessions of a Pilgrim', and 'The Camino'.  Everyone of these are much more insightful and inspiring, let alone FAR more enjoyable to read."}, {"review_sentiment": 5.0, "review_text": "This is the third book I have read on the Camino and by far the best. It infuses a depth of spirituality into the Pilgrimage that is lacking in most modern accounts. it also emphasises the feminine side of nature and the Camino itself. Read it even if you never intend to do the Pilgrimage yourself. Wonderful!"}, {"review_sentiment": 5.0, "review_text": "The review heading is a quote from day 10, July 18, 1982 in Elyn Aviva's fascinating tapestry of trail journal and scholarly insight.  This story was first published in 1989.  The 2nd edition was published in 2001. Prior to the 2nd edition, the author walked the Camino again in 1997 and again in 2000.The Camino in 1982 was a vastly different experience from the modern Camino, and for this reason the author has left the text of the body unchanged except for some editing.  She has added an 18 page Introduction to the 2nd Edition where she describes some of the changes over the last twenty years and talks about the other pre Christian pilgrimage routes that some believe evolved into the Christian Camino.I had never read the original edition, and really enjoyed the account of Elyn and her friend Bill's journey.  They had never backpacked before, and started out carrying heavy packs, wearing new boots, and throughout the book I emphasized with the experience of new backpackers, gradually becoming fit.  In 1982 there were few refugios compared to today, and frequently they slept under the open sky.  The trail was poorly marked, sometimes non existent compared to today.  Sometimes they had to hitch.  Particularly in the earlier part of the trek, the local people did not look on pilgrims with favor.Each day gets a  section in the book, with a little map showing maybe a third of the entire Camino, with a little bracket showing the distance walked for the day.  The first day has a similar map of the entire route - not a map for detailed info, but a simple line with place names. Day 1 starts in St. Jean Pied de Port and the book ends with Day 47 - leaving Santiago.Anyone who has walked the Camino will appreciate this story, and anyone about to travel the route will benefit from the history included with the day to day narrative.Modern day walkers - read this for background, but be sure to get the Confraternity of St. James The Camino Frances guide to take with you, as well as either John Brierley's guide or Davies and Cole's guide.  Also, check the forums such as GoCamino and Santiagobis and websites such as backpack45."}, {"review_sentiment": 5.0, "review_text": "Elyn Aviva has written an excellent book on walking the Camino. She includes the human interest angle as well as interesting info about the history, cultural aspects, and architecture. The fact that her walk was in 1982, before the Camino became the popular pilgrimage route it is now, is quite interesting. I consider this book to be a great addition to my growing library of books on this subject."}]}, "authors": ["Elyn Aviva"], "isbn": "0971060908", "longitude": -8.5458608, "periods": ["2000s"], "title": "Following the Milky Way: A Pilgrimage on the Camino de Santiago", "word_cloud": "so make mistake buying twice read first time buy author something second time excite write female author buy think different writer ever complain unprepared unfortunately only spell name different reason lose difficulty return page day day story repeat ad nausea include ever redundant sentence hot someone intent walk true path steep rich history spiritual essence dismissive walking authentic way scholar supposedly write eclipse christian view believe still find necessary nonetheless insight interest reader seek undertake journey follow merely briefly mention never explore opinion poorer hope third edition publish yet mom plume better like unanswered question show km walk last km suppose do entirely foot eligible completion yet pilgrims partly taxi claim certificate history actual hiking really good want know background site way interest account rivet think expect author mention historical aspect note historical cultural aspect find better very self serve whine continuous complain author clearly interested cultural aspect certainly religious one majority complaint suffering impose heavy drinking huge meal couple heat walk recipe stomach distress heat injury author complains much start walk late morning walk highest heat fool personal growth writer even non religious least learned something rhetorical question moment internal thought insipid recommend many excellent information far interest many information intrigue enough spend money purchase copy hardest one get write personal portion painful stomach author complain whine ad nausea endless reference authentic begin end author whine complains believe anything real purpose walk say real focus make sure walk real authentic real journey find skip large portion author personal insight add value experience reading certainly imagine walk km fairy tale experience however insightful much journal full rant finally page author suddenly consume arrive walk authentic take taxi rid kilometer rationalize long part authentic others short time give people actually walk least last km apparently rationalize insisting get certificate cherry top elitist attitude arrival expectation real pilgrim walk way expect special treatment church however treat visitor regardless mode transportation lack patience people find surprising tolerance petty bureaucracy so lost patience doubt sadden experience walk eye heart wide open walk agenda clutch tightly historical interjection interest well write think much better author write focus perhaps end chapter personal experience not nothing gain reading however recommend spend hard earn money much insightful inspire alone enjoyable third far best infuse depth spirituality lack modern account also emphasize feminine side nature even never intend review head quote day fascinate tapestry trail journal scholarly insight story first publish edition publish edition author walk vastly different experience modern reason author leave text body unchanged edit add page describe change last twenty year talk per christian route believe evolve christian never original edition really enjoyed account friend journey never backpack start carry heavy pack wear new boot emphasize experience new backpacker gradually become fit refugio compare today frequently sleep open sky trail poorly mark sometimes non existent compare today hitch earlier part local people look pilgrim day get section little map show maybe third entire little bracket show distance walk day first day similar map entire route map detail info simple line place name start end leave walk appreciate story anyone travel route benefit history include day day day walker background sure get guide take well either guide guide also forum website write excellent walking include human interest angle well interesting info history cultural aspect architecture fact walk become popular route quite interesting consider great addition grow library subject", "genres": ["History", "Religion", "Travel Writing"], "summary": "Following the Milky Way is the story of Elyn Aviva's 500-mile-long journey on foot on the Camino de Santiago. This 1000-year-old pilgrimage road stretches from the French Pyrenees across northern Spain to Santiago de Compostela, supposed tomb of St. James the Apostle. \r\n\r\nIt is a journey that crosses the landscape of the soul as well as the mountains and mesetas of Spain. This book is a vivid memoir of a life-changing adventure, chance encounters, unforeseen dangers, and unexpected pleasures. Spanish history, wine, food, literature, art, architecture, and legend share equal time with the stories of pilgrims that Elyn meets along the way. Following the Milky Way is a fascinating historical document. Today, hundreds of thousands of people-including Shirley MacLaine-are going on the Camino, but Following the Milky Way describes the pilgrimage in 1982, when the Camino was nearly abandoned. This second edition includes a new introduction that explores the meaning of pilgrimage in greater detail, delves more deeply into the esoteric symbols and pre-Christian shrines that lie hidden within the Way, and provides a unique look at the changes that have occurred in the pilgrimage in recent years.", "asin": "0971060908", "rank": "2177907", "city": "Santiago de Compostela", "image": "https://images-na.ssl-images-amazon.com/images/I/51uNtEO60IL.jpg", "country": "Spain", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}