{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 42.8184538, "ratings": {"num_ratings": 23, "rating": 4.9, "reviews": [{"review_sentiment": 5.0, "review_text": "Loved the book!  I could picture myself being there as it was so very well written!"}, {"review_sentiment": 5.0, "review_text": "Purchased to learn and understand prior to attending a professional staged reading of a play by the same name.This book provided everything! I get it. Really well done.  ~lori g"}, {"review_sentiment": 5.0, "review_text": "The definitive work about Pamplona's bull run festival. I purchased this book back in 2008 and have gone back to it countless times for information about Spain's infamous running of the bulls. As the owner of Spyns Pamplona tours, I have attended the San Fermin festival for the past ten years and still find new and interesting things about Pamplona and its incredible festival. Mouton's writing style is sophisticated and yet surprisingly readable. The book's photos are stunning and really capture the essence of this festival. I have always recommended Spyns' running of the bulls clients read it cover to cover before traveling with us to the annual July festival. While it doesn't pretend to be a bull runner's guide, it does give you rich historical detail about this strange and violent tradition."}, {"review_sentiment": 5.0, "review_text": "Amazing portrayal. Very accurate and helpful in trying to run"}, {"review_sentiment": 5.0, "review_text": "An outstanding work that could only be written by one who has been there. Mouton takes us into the streets with the bulls and to the tables of the barrio bars as he makes us part of an enduring phenomenon that has become a rite of passage for so many. He is a storyteller of the first order and brings us deeper into a lore where Hemingway so famously tread. It is an adrenalin rush and much more--a capture of a way of life in the crosshairs of a changing world."}, {"review_sentiment": 5.0, "review_text": "Don't even think about going to Pamplona without reading this first!Ray Mouton's Pamplona: Running the bulls bars and barrios of Sanfermin is the ultimate and undisputable guide to enjoying the best party on the planet.From where to eat, what to drink and how to run, this amazing read, details everything a novice and a veteran Sanferminner should and must know!Mouton explains the deep traditions and reasons for the Encierro, or, running of the bulls. Why it exists, and why people by the millions continue to flock to the most amazing experience in the world.The book recounts several experiences and stories surrounding this wondrous event, and covers in detail absolutely everything including the running, the Corridas (bull fights), the parades, the ceremonies and all the festivities that make up Sanfermin.At the core of the book is Mouton's passion for the event.Readers will be mesmerized by the description of beauty and sometimes horror that fills every page and will feel as though they are in the heart of the festival itself, even though they remain in the comfort of their reading chair.Anyone even entertaining the slightest thought as too participating in this life-changing experience must read this book.I read it twice before participating in my first Sanfermin, and I can honestly say that it made my trip not only perfect, but incredible and amazing!I ran with the bulls several times, I ate the most amazing meals, drank the most delicious drinks and met the most interesting and fabulous people all thanks to Mouton's book.His advice and stories made my experience far more incredible because I arrived in Pamplona knowing exactly what to expect and knew what I needed to do to make the experience perfect!So sit back and let the amazing descriptions of Mouton wash over you like a warm comforting bath.I defy you not to go to Pamplona after reading this book!"}, {"review_sentiment": 4.0, "review_text": "Whilst unavoidably orientated to North American aficionados this is a brilliant book which goes behind the scenes to tell the story of why thousands are drawn back to Pamplona from all corners of the world for 9 days in July. Beautifully presented and written Ray Mouton has done the Festival proud. This publication renders Michener's section in \"Iberia\" obsolete and brings Pamplona to the contemporary world giving those of Generation Y who are the future long term serious runners a narrative that lives and breathes the Fiesta."}, {"review_sentiment": 5.0, "review_text": "This book is an excellent account of what exactly happens during the Festival of San Fermin at Pamplona. It is a first hand guide of the day by day events of the festival including the historical figures of bullfighting.  A must read for those planning to go to Pamplona someday or those with the curiosity of the event."}, {"review_sentiment": 5.0, "review_text": "I truely enjoyed this book.  Someday I will get there and also live the legend of this city that Ernest made popular- though it was doing just fine without him.Good writing takes you to a place you have not been before and Ray Mouton does it with this book."}, {"review_sentiment": 5.0, "review_text": "The best book ever written about Sanfermines, the festival of San Fermin known to many as the running of the bulls. This truly is a guide to Fiesta. No other work published will better educate and prepare you for this event. A well written must for all who plan on attending and immersing themselves in the spirit of Fiesta.Held each year in Pamplona, Spain in July, Sanfermines is much more than the daily spectacle of the encierros or \"the running of the bulls\" early each morning and much more than the corrida de toros in the Plaza de Toros late each afternoon. The fiesta is a celebration of family and life in Navarra.Fiesta belongs to the Navarrans, and has for centuries; however the gracious citizens of Iruña (Basque for Pamplona) have opened their arms to the people of the world, inviting all to participate in what has often been described as one of the most exhilarating  experiences on planet earth.Of course you  should read Hemingway's \"The Sun Also Rises\", however if you buy only one book before heading to Sanfermines, it should be Ray Mouton's \"Pamplona: Running the Bulls, Bars and Barrios in Fiesta de San Fermin.\""}]}, "authors": ["Ray Mouton"], "isbn": "0972122303", "longitude": -1.6442556, "periods": ["1900s", "2000s"], "title": "Pamplona: Running the Bulls, Bars, and Barrios in Fiesta de San Fermin", "word_cloud": "love well write purchase learn understand prior attend professional stag reading play provide everything get really well do g definitive work bull run festival purchase back go back countless time information infamous bull owner tour attend festival ten year still find new interesting thing incredible festival writing style sophisticate yet surprisingly readable photo stun really capture essence festival always recommend bull client cover travel annual festival pretend bull runner guide rich historical detail strange violent tradition amaze portrayal accurate helpful try run outstanding work write take street bull table barrio bar make part endure phenomenon become rite passage many storyteller first order bring deeper lore famously tread adrenalin rush much capture way life cross hairs change world even go read first bull bar ultimate indisputable guide enjoy best party eat drink run amaze detail everything novice veteran explain deep tradition reason bull exist people million continue flock amazing experience recount several experience story surround wondrous event cover detail absolutely everything include bull fight ceremony festivity make core passion mesmerize description beauty sometimes horror fill page heart festival even remain comfort read even entertain slightest thought participate experience participate first honestly say make trip perfect incredible amazing run bull several time eat amazing meal drink delicious drink meet interesting fabulous people thanks advice story make experience far incredible arrive know exactly expect know need make experience perfect sit let amazing description wash warm comforting defy go reading unavoidably orientate north american aficionado brilliant go scene tell story thousand draw back corner world day present write do proud publication render section obsolete brings contemporary world give future long term serious runner narrative life breathes excellent account exactly happen first hand guide day day event festival include historical figure bullfighting plan someday curiosity event truly enjoy get also live legend city make fine write take place best ever write festival know many bull truly guide work publish better educate prepare event well write attend immerse spirit year much daily spectacle encierros bull early morning much corridor late afternoon celebration family life belongs century however gracious citizen open arm people world invite participate often describe exhilarating experience planet course also rise however head", "genres": ["History", "Travel Writing"], "summary": "This is the definitive book on Pamplona's fiesta and running of the bulls, praised by James Michener and other Pulitzer Prize winners. This chronicle and history has 256 pages and over 130 photographs taken by internationally acclaimed photographers. The volume also essays the American Experience from Hemingway to the present.\r\n\r\n\"This book is the next best thing to going to Pamplona itself.\" JAMES A. MICHENER, Pulitzer winning author of Iberia.", "asin": "0972122303", "rank": "1075272", "city": "Pamplona", "image": "https://images-na.ssl-images-amazon.com/images/I/51S39V38M6L.jpg", "country": "Spain", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}