{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 3, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "It feels good to read an entertaining story like this: Tail of the Blue Bird by Ghanaian writer, Nii Ayikwei Parkes. He is presenting us with an original murder mystery, an adventure story that moves beyond fact-based evidence with believable, well drawn characters. Despite its fantasy-like cover image, Nii Ayikwei Parkes's novel is firmly grounded in modern-day Ghanaian reality that incorporates urban as well as rural life and with it the need to bridge the different cultural, linguistic and spiritual traditions. The author brings all the different narrative strands convincingly together and does so in a lively and engaging way.Most of the action takes place in a remote village two and a half hours drive from Accra, the capital. The young forensic expert, Kayo, has been dispatched to the village with his police sidelick, Garba, to investigate the foul smelling remains of what appears to be of  human nature. The solving of the case has political ramification for him and the police inspector in Accra. Time is of the essence... but evidence cannot be obtained or verified  without the cooperation of village elders... and their world operates on different parameters than city people would assume.Nii Ayikwei Parkes pulls the reader very quickly into this different world; his characters, Kayo and Garba, and the central figures in the village are very well drawn; their personalities are endearing and affecting and at times surprising in their own ways. The author's depiction of the northern Ghana landscape is evocative... and you can easily imagine the presence and the power of the ancestors' spirits.  Just one caution, the language, especially the dialogs take a bit of getting used to for most of us. My recommendation: just relax into it and the fast paced story; it will become easy after a while. While terms are not directly explained, the author finds an organic way to let you know what they mean in due course."}, {"review_sentiment": 5.0, "review_text": "The beauty of this book is the fantastic description and dialogue among the villagers, as the reluctant police forensics expert comes to investigate the crime.  The complex relationships among the villagers gradually unfold, as does their hesitant engagement with the universal moral issue of responsibility for the welfare of others.  It's a beautiful first novel, and I especially will never forget the imagery evoked as the local hunter describes his relationship to the forest.  Pure magic."}, {"review_sentiment": 5.0, "review_text": "A woman driving around the countryside in Ghana sees a bird near a village and jumps out to try and find it. While searching, she smells something terrible coming from one of the huts, like a decomposing body, and reports to authorities. Because she is the girlfriend of some minister or other, the Ghana police come to investigate, ignoring local tradition during their inspection. Finally the police hire an ambitious young man, who is Ghanaian but studied forensic medicine (CSI style) in England. When he goes to the village he performs a modern day scientific investigation but by respecting tradition, he gets to know the local people. His final report is scienctific but can only be explained based on traditional folk tales.Parkes description of the village and local people was a well drawn picture and his use of local dialect was engaging. This is the first fiction that takes place in Ghana I've heard of and I appreciate learning about city and country lives of its people. A good writer and a great debut nove."}]}, "authors": ["Nii Ayikwei Parkes"], "isbn": "0981858430", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "Tail of the Blue Bird", "word_cloud": "feel good entertain story writer present original murder mystery adventure story move evidence believable well draw character cover image firmly ground ghanaian reality incorporate urban well rural life need bridge different cultural linguistic spiritual tradition author bring different narrative strand convincingly together lively engage action take place remote village half hour drive capital young forensic expert dispatch village police sidekick investigate foul smelling remain appear human nature solve case political ramification police inspector essence evidence obtain verify cooperation village elder world operate different parameter city people pull quickly different world character central figure village well draw personality endear affect time surprising way author depiction northern landscape evocative easily presence power ancestor spirit caution language especially dialog take bit get use recommendation relax fast pace story become easy term directly explain author find organic way let mean due course beauty fantastic description dialogue villager reluctant police forensics expert come investigate crime complex relationship villager gradually unfold hesitant engagement universal moral issue responsibility welfare others beautiful first especially never imagery evoke local hunter describe relationship forest pure magic woman drive countryside see near village jump try find search smell something terrible come hut decompose body report authority girlfriend minister police come investigate ignore local tradition inspection police hire ambitious young man study forensic medicine style go village performs modern day scientific investigation respect tradition get know local people final report scientific explain base traditional folk description local people well picture use local dialect engage first fiction take place hear appreciate learn city country live people good writer great debut move", "genres": ["Fiction & Literature"], "summary": "Sonokrom, a village in the Ghanaian hinterland, has not changed for hundreds of years. Here, the men and women speak the language of the forest, drink aphrodisiacs with their palm wine and walk alongside the spirits of their ancestors. \r\n\r\nThe discovery of sinister remains - possibly human, definitely 'evil' - and the disappearance of a local man brings the intrusion of the city in the form of Kayo, a young forensic pathologist convinced that scientific logic can shatter even the most inexplicable of mysteries.\r\n\r\nAs old and new worlds clash and clasp, and Kayo and his sidekick, Constable Garba, delve deeper into the case, they discover a truth that leaves scientific explanations far behind.\r\n\r\n\"A delightful book that combines the basic tug of the whodunit with the more elegant pleasures of the literary novel\" The Independent\r\n", "asin": "0981858430", "rank": "1733598", "city": "Ghana", "image": "https://images-na.ssl-images-amazon.com/images/I/51VCTGo4s6L.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}