{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 35, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "A useful advance historical reference for visitors to Montreal and Quebec City.It greatly helped a \"Yank\" understand the extended history and culture of \"New France\"and appreciate French Canadians. Well worth the read."}, {"review_sentiment": 2.0, "review_text": "As we were traveling in Quebec this summer, I read the book to have a historical perspective of the area. I suppose it did give a framework but seemed rather tedious. I am glad I read it to meet my need for information, but I would not say it was an enjoyable read."}, {"review_sentiment": 5.0, "review_text": "Like"}, {"review_sentiment": 3.0, "review_text": "More and Better maps would help."}, {"review_sentiment": 5.0, "review_text": "excellent"}, {"review_sentiment": 5.0, "review_text": "The best Canadian history of Quebec and first families."}, {"review_sentiment": 4.0, "review_text": "Very good"}, {"review_sentiment": 5.0, "review_text": "Found it very informative and interesting."}, {"review_sentiment": 5.0, "review_text": "Very interesting, background info for history and genealogy folks."}, {"review_sentiment": 5.0, "review_text": "Great writing about the history of Quebec. I have only been to Quebec once and this makes me want to go again."}]}, "authors": ["Jacques Lacoursière", "Robin Philpot"], "isbn": "098124050X", "longitude": -73.6103642, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "Recent Releases"], "title": "A People's History of Quebec", "word_cloud": "useful advance historical reference visitor greatly help understand extend culture appreciate french travel summer historical perspective area suppose give framework seem rather tedious glad meet need information enjoyable more map excellent best canadian first family very good interesting very interesting background info genealogy folk great write make want", "genres": ["History"], "summary": "Revealing a little-known part of North American history, this lively guide tells the fascinating tale of the settlement of the St. Lawrence Valley. It also tells of the Montreal and Quebec-based explorers and traders who traveled, mapped, and inhabited a very large part of North America, and “embrothered the peoples” they met, as Jack Kerouac wrote.\r\n\r\nConnecting everyday life to the events that emerged as historical turning points in the life of a people, this book sheds new light on Quebec’s 450-year history––and on the historical forces that lie behind its two recent efforts to gain independence.\r\n\r\n\"A concise history of Quebec, from the earliest days of colonization to the aftermath of the most recent sovereignty referendum, rendered in an easily read 200 pages. As fascinating as the march of great figures and the mapping of landmark events are the details of how they affected the ordinary life of their times.\"  Montreal Gazette", "asin": "098124050X", "rank": "263605", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/51dF9SK4lXL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}