{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 10, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "The protagonist, Mumtaz, of this 1948 novel has been compared to Kafka's K or Melville's Bartleby, but these do not match nearly as well as Hans Castorp. Like Mann's Magic Mountain, we see a young man, an intellectual, melancholy and troubled, who on the eve of world war looks inward. Dissatisfied, Mumtaz does not retreat from the city, but watches it pass. Drawn to the folk music and Ottoman culture increasingly abandoned in the new Turkish order, he looks to his mentor Ihsan. Ihsan provides a more modernist counterpoint to Mumtaz's nostalgia, but it fails to rouse Mumtaz. A Mind at Peace may be a rather ironic title, for Mumtaz true to his phenomenological crisis is restless and insecure.\"Do we love each other, or the Bosphorus?\" He muses such with his lover Nuran. The first part of the book details his detachment, where he feels as if \"cold print\" stamps everything he sees and renders it mechanical and prone. Ahmet Hamdi Tanpinar clearly looks to Mann, Robert Musil, and the French and German music and poetry of the past century of so in crafting this slow, sonorous narrative. Comparisons to this Istanbul-centered story to Joyce's Ulysses, however, again seem forced. While the events follow the day and night and dawn when WWII is declared, and Mumtaz turns 27, most of the events in the middle are from flashbacks. There is very little drama or action for the bulk of the book.Part two sees Nuran and Mumtaz in love. Very intense descriptions capture their passion. The language is not explicit, but the feelings are intense. Part three shifts into an extended set-piece on music. The last portion tries to hasten the pace, and for once, the beggars and poor Mumtaz passes jolt him into some recognition of his aloofness. One barely sees the privileged characters of this novel at work or worrying about making a living, and much of the mood seems hermetic, again a testament to the impact of the Western forebears Tanpinar evidently admires.As Mumtaz later tells a doctor in part 4, he likes both Turkish and European music. \"But not as the same person.\" For caught \"between two realms,\" A Mind at Peace explores \"huzan,\" the longing that is not quenched, within a Turkish soul. Erdag Goknar's translation remains challenging. He uses some archaic terms and these I assume echo Tanpinar's integration of Ottoman phrasing into his original. Turkish is difficult to render into English as it takes such a different form. Goknar enables readers such as us to hear at least some resonances of Tanpinar's rhythms. Like the musics loved by Mumtaz, they may be separate from our own, but we can sense them. Not an easy read, but for the patient."}, {"review_sentiment": 3.0, "review_text": "A historical, philosophical novel of society in Turkey in the 1930's. At times heavy reading."}, {"review_sentiment": 3.0, "review_text": "Most of what happens in this novel is conversations. There is a wedding that in the end does not take place and a suicide -- neither bride no groom. The result is very atmospheric but with not much action."}, {"review_sentiment": 5.0, "review_text": "I won't comment on the translation, as other reviewers have done it competently. I will focus on the story and what it meant to me. Like other readers, I arrived to this book after reading the excellent \"Istanbul\" by Orhan Pamuk. Let's hope his book will spark a flow of (good) translations of this and the other Turkish works mentioned by him. Turkey is and has been for millenia a very important country where many of history's most important situations have taken place and through which many civilizations have passed (or stayed).\"A Mind at Peace\" (I wonder if the original title translates literally like this) is a whole revelation: it is a wonderful novel of ideas whose action develops in the years immediately previous to WWII. Turkey was then in the middle of a deep social, economic and political transformation, brought about by the dissolution of the Ottoman Empire after WWI and by Ataturk's government. The particular situation of the characters, their doubts, fears and hopes are a reflection of the general insecurity and agitation of Turkish society, terrified of being dragged into yet another global armed conflict.The story begins with young Mumtaz, a professor who wanders around Istanbul on different family errands on account of his cousin and mentor Ihsan's illness. As he walks, Mumtaz is constantly thinking of his beloved Nuran, who has recently left him. He is very hurt and full of longing. We learn of Mumtaz's extremely difficult childhood, the son of a man murdered by Greek invaders, who then lost his mother and has been raised by his much older cousin Ihsan and his wife, both of whom he adores. After this comes a long flashback, really the focus of the novel, in which we are told the story of Mumtaz and Nuran. I won't spoil the details of that story; suffice it to say that Nuran has been recently divorced and that she has a daughter. The relationship is thus very complex in that time and place's social environment. Nevertheless, both lovers plan to marry as soon as the law allows it. Beyond sexual and emotional attraction, they share a great love of Turkish traditional music (a major subject of the novel which also illustrates the tension between tradition and modernity), and are fond of long walks around the city. This really turns the city into the major character of the book: with great beauty and detail, Istanbul's neighborhoods, mosques, palaces and parks are described. A myriad of local characters and festivities people the tale, which acquires epic undertones with multiple references to the history, art, and habits of the yearned-for Ottoman Empire. (As an aside: this very longing makes the book a love-it-or-hate-it object for Turkish people, apparently. Especially the situation of women under Ottoman rule is a contentious point on the desirability of Muslim rule). The characters have long arguments about Turkey's current situation, as well as about the ominous circumstances of Europe. As the general environment and mood deteriorate, so does the romance. This is further aggravated by the sudden intrusion of Suad, a repulsive man who courts Nuran in spite of being married.With an exuberant and romantic prose (which survives the obviously flawed translation), Tanpinar has woven a wide and deep, alternately lyrical and epic, novel with a great cast of characters, a story where the general trends of society and the specific personal situations have reflecting correspondences. In spite of being in love, Mumtaz and Nuran bear doubts: \"were we in love with each other or both with the Bosphorus?\". \"The greatest novel about Istanbul\", according to Pamuk, makes one long to visit (or revisit) this magical city and walk it in the company of these fateful lovers."}, {"review_sentiment": 3.0, "review_text": "This book reminds me of something that would be required reading in high school or college.  The sentence construction and words are wonderful but by the time I've finished several paragraphs I have completely lost track of where this story is going.  I'm embarrassed to say that perhaps I'm not educated enough to fully appreciate what Tanpinar has accomplished here, but this is not an easy book to read for me - especially at night when I do most of my reading.I have not even gotten through 1/4 of the book so perhaps I will struggle through it and have a different perspective upon completion.  I was never wild about The Illiad, either."}, {"review_sentiment": 5.0, "review_text": "This lyrical evocation of Istanbul on the eve of the second world war is experienced through eyes, ears and mind of a young man especially sensitive to the terrible conflicts of its recent past, the city's two-faced identity (looking toward Asia and toward Europe), the country's economic backwardness, the beauty of the Bosphorus and of the homes, some splendid, some ruinous that border it, the sharp class divisions and the powerful ties of family. The young man is Mümtaz, orphaned in the war against the Greeks in 1923 and now, in 1939, 27 years old. Besides the city itself and its music, especially the traditional türküs and Ottoman classical music, the chief influences on him are his much older cousin İhsan, his professor and his guardian since his early ophanhood; Nuran, a beautiful divorcée with a lovely singing voice, two years older than Mümtaz, who was his fiancée in the previous summer but now has abandoned him and left him hopelessly forlorn; and Suad, another cousin, terribly smart, cynical, and tormented. Their conflicting passions and their doubts are a gigantic, complex metaphor for Turkey itself.The translation is on the whole quite elegant, though the translator has a penchant for some unusual English words (\"luculent\" is a favorite) and resorts often to the Turkish words in the descriptions of boating on the Bosphorus and other passages. It is a moving and ambitious book, that can be appreciated by any reader but will be most fully appreciated by those famliar with the music that is evoked almost throughout."}, {"review_sentiment": 2.0, "review_text": "Too bad.  The novel itself is probably very good, but the translation is appalling.  After slogging through the first five pages I opened another 10 at random: not one was without failure,  How could the NEA, which gave the translator a grant, approve this?e.g.  Mumtaz had not set out on a substantial walk.... first line...he'd while away the measure of the week ... second sentenceAn entire household slept and woke with the remorse of Ihsan's affliction.  4th sentenceNot one of these is standard contemporary English, either American or British.  It's not that they can't be understood, it's that we have to compensate while reading, like carrying a shifting heavy sack while walking.The worst part is that this publication means that we won't see another, we hope well done, translation for 20 years or so."}, {"review_sentiment": 5.0, "review_text": "Required reading for anyone going to Istanbul. Amazingly poetic prose. Every page is a gift."}, {"review_sentiment": 4.0, "review_text": "This is a novel more in the spirit of a wm Faulkner novel than a Robert Graves piece. Why did I expect more war than personal, romantic intimacy? Frankly, I wonder if the translator has ever been in Turkey for any period of time. Imagery is good, but for me the translation is 'too high brow' maybe I should have tried to read the original Turkish, before turning to the English version because much of the English seems too 'unTurkish.' So much of what is translated seems more an invention of the translator than the intent of the author. I am soldering on reading the book because of the unique subject and unique period it encompasses.Hope I am not offending anyone, but it's my review"}, {"review_sentiment": 4.0, "review_text": "Orhan Pamur speaks of Ahmet Hamdi Tanpinar as an essential part of his sense of Istambul.  Based on his descriptions of Tanpinar in his book Istambul, I was excited to read this translation of Tanpinar's masterpiece.The physical book is extremely attractive, even sensual.  With an old photo on the cover of several rowboats on the Bosphorus you are being introduced to the world within the book's covers.  Elegant endpapers, thick off-white paper, and an unusually square shape to the book all present a pleasant, inviting physical object.  Archipelago Books, I publisher I'd not encountered before, did an excellent job (though their editor missed a few too many errors).On opening the book the first thing you notice is the lack of any notes, introduction, or even an index to the various Parts of the book.  This is puzzling, and unfortunate.  The dust jacket provides a few sentences on the author and this work (in addition to a few sentence plot summary).  And even those sentences tell us little.  What does it mean to say that this book is \"a Turkish Ulysses\"?  The book deserves a wide readership, beyond the niche of people already familiar with this author.  And that readership needs at least some minimal sign-posts to help navigate this dense examination of Istambul's intellectual, philosophical and moral dilemmas at the start of World War II.  One method would be an introduction explaining the dynamics of Turkey at that time, and explaining Tanpinar's place in that debate.  Another would be to provide a few footnotes, or end notes, explaining certain words or concepts unlikely to be understood by the average English speaking reader.  For example, the debate over whether a character is mevlevi or bektashi was completely lost on me.  How about you?The novel starts \"(City of Two Continents, August 1939)\".  And that could also be the one sentence summary of the novel.  Turkey and its citizens are about to be plunged into WWII, a Western war that is very on the periphery of its interests, history and consciousness.  But what is consuming the characters in this novel is the doppelganger of living in the past and the present, in the East and in the West, in two continents, two realities.The novel is told using both the first and third person views of the main character, Mumtaz.  And even the third person observations are claustrophobic, told from a ground level prospective never far from the immediate observations of Mumtaz, a young writer and intellectual who \"does\" essentially nothing during the 1939 focus of the book.  He thinks, observes, feels.  His love for Nuran, his hatred of yet attraction to Suad, the filial love and respect for Ihsan...these are drawn out in long, complex worlds of emotion that slowly built and deepen as the novel progresses.But the central character in this novel is Turkey, Turkish, Istambul and the Borphorus.  What do these things mean to a well educated, not-poor (I'm not sure what \"class\" these intellectuals belong to...but few have a conventional job) group of largely male intellectuals?  The answer is a deep ambivalence.  They live in a city of past architectural glory, the capitol of a vast empire.  And while they are part of that heritage, they are also drawn to the present, to the Western.  This is most often described in descriptions of music.  Some of the most lyrical parts of the book describe Turkish classical music, the sound of the ney while a singer intones verses composed for various sultans.  And while this is being lyrically described Mumtaz will realize that he is actually thinking of a Beethoven sonata.  Quoting a Farsi couplet the discussion will veer to French symbolist poets.  But oh the longing, the sorrow, of those couplets:The days foreshortened, aged men in KanlicaConjure memories of past autumns one by one.By the end of the novel you are left with a deep understanding of the longing felt by Mumtaz, to be his own person, not dragged down by the weight of his history and culture, yet aware that without those things he would be empty.  \"The vast fallout of two centuries of disintegration and collapse, of being the remnants of an empire and still unable to establish our own norms and idioms.\"So why only 4 starts (and actually I would give it a 3.5)?  Because of the lamentable translation.  My definition of a good translation is one I don't notice.  And this fails my test miserably.  There is little plot in this novel.  It is a closely observed study, and by necessity that means a book that is slowly, closely, read and observed.  The lyrical content simply must be accompanied by similar prose or the image is shattered.  On every page the reader encounters a variety of translation ticks: the hackneyed phrase, the unnecessarily complex words, the odd spelling, the anti-lyrical and the weird.Hackneyed: hither and yond, oft times, by and by, by and large, truth be told, kith and kin, hale and hearty, sing a ditty, let the cat out of the bag, a slave of his baser desires.Big words: in one paragraph we encounter quiddities, haecceities and ideational.Odd spelling: phantasy and magick [each used many, many times].Anti-lyrical: \"Ihsan's personality was more agreeable than those personae of his preconceptions might have indicated\" \"exercise her volition to live apart\"  \"the verdure assaulted one's casing of skin.\"Weird: \"at whiles.\"  Synonym for periodically or at times.  And used way too often!So maybe Tanipar is addicted to archaic spellings, has a huge vocabulary that he throws around, is addicted to hackneyed phrases and the translator is merely following the original.  Maybe, but adding all of these quirks together, if the translator has merely followed the original, this book would not be \"the greatest novel ever written about Istambul,\" quoting Orhan Pamur."}]}, "authors": ["Ahmet Hamdi Tanpinar"], "isbn": "0982624638", "longitude": 28.9651646, "periods": ["1900s"], "title": "A Mind at Peace", "word_cloud": "protagonist compare match nearly well see young man intellectual melancholy trouble eve world war look inward retreat city watch pass folk music culture increasingly abandon new turkish order look mentor nisan provide modernist counterpoint nostalgia fail rouse rather title true phenomenological crisis restless insecure muse lover first part detail detachment feel cold print stamp everything see render mechanical prone clearly look french music poetry past century craft slow sonorous narrative story ulysses however seem force event follow day night dawn declare turn event middle flashback little drama action bulk see intense description capture passion language explicit feeling intense shift extend music last portion try hasten pace beggar poor pass jolt recognition barely see privileged character work worry make live much mood seem hermetic testament impact western forebear evidently later tell doctor part like turkish european music person caught realms explore human longing quench turkish soul translation remain challenge use archaic term assume echo integration phrase original turkish difficult render take different form enable reader hear least resonance rhythms music love sense not easy patient historical philosophical society time heavy reading most happens conversation wed end place suicide bride groom result atmospheric much action translation reviewer do competently focus story mean reader arrive read excellent hope flow good translation turkish work mention important country many history important situation take place many civilization pass stay wonder original title translate literally like whole revelation wonderful idea action develop year immediately previous middle deep social economic political transformation bring dissolution government particular situation character doubt fear hop reflection general insecurity agitation society terrify drag yet global arm story begin young professor wanders different family errands account cousin mentor illness walk constantly think beloved recently leave full longing learn extremely difficult childhood son man murder greek invader lose mother raise much older cousin wife adores come long flashback really tell story detail story suffice say recently divorce daughter relationship thus complex time place social environment lover plan marry soon law allow sexual emotional attraction share great turkish traditional music major subject also illustrate tension tradition modernity fond long walk city really turn city major character great beauty detail neighborhood mosque palace park describe myriad local character festivity people tale acquires epic undertone multiple reference history art habit aside long make object turkish people apparently situation woman rule contentious point desirability rule character long argument current situation well ominous circumstance general environment mood deteriorate romance aggravate sudden intrusion repulsive man court spite exuberant romantic prose survive obviously flaw translation woven wide deep alternately lyrical epic great cast character story general trend society specific personal situation reflect correspondence spite love bear doubt greatest accord make long visit revisit magical city walk company fateful lover remind something reading high school college sentence construction word wonderful time finish several paragraph completely lose track story go embarrass say perhaps educate enough fully appreciate accomplish easy especially night even get perhaps struggle different perspective completion never wild lyrical evocation eve second world war experience eye ear young man especially sensitive terrible conflict recent past city identity look country economic backwardness beauty home splendid ruinous border sharp class division powerful tie family young man orphan war year old city music especially traditional türküs classical music chief influence much older cousin professor guardian early ophanhood beautiful divorce lovely singing voice year older fiance previous summer abandon leave hopelessly forlorn cousin terribly smart cynical torment conflicting passion doubt gigantic complex metaphor translation whole quite elegant translator penchant unusual word truculent favorite resort often turkish word description boat passages move ambitious appreciate fully appreciate familiar music evoke almost too bad probably good translation appal slog first page open random failure give translator grant substantial walk first line away measure week second sentence an entire household slept wake remorse affliction sentence not standard contemporary american british read carry shift heavy sack worst part publication mean hope well do translation year require reading anyone go poetic prose page gift spirit wm piece expect war personal romantic intimacy wonder translator ever period time good translation high brow maybe try original turn english version much seem so much translate seem invention translator intent author solder read unique subject unique period offend anyone review speak essential part sense base description excite translation physical extremely attractive even sensual old photo cover several rowboat introduce world cover elegant end papers thick paper unusually square shape present pleasant invite physical object publisher encounter excellent job editor miss many error open first thing notice lack note introduction even index various part puzzling dust jacket provide sentence author work addition sentence plot summary even sentence tell little mean say turkish ulysses deserves wide readership niche people already familiar author readership need least minimal help dense examination intellectual philosophical moral dilemma start method explain dynamic time explain place debate footnote end note explain certain word concept unlikely understood average english speaking example debate character mevlevi bektashi completely lose start also sentence summary citizen plunge war periphery interest history consciousness consume character doppelganger live past present continent tell use first third person view main character even third person observation claustrophobic tell ground level prospective never far immediate observation young writer intellectual essentially nothing focus think love hatred yet attraction filial love respect drawn long complex world emotion slowly build deepen central character thing mean well educate sure class intellectual belong conventional job group largely male intellectual answer deep ambivalence live city past architectural glory capitol vast empire part heritage also draw present western often described description music lyrical part describe turkish classical music sound yen singer intones verse compose various sultan lyrically describe actually think sonata couplet discussion veer french symbolism poet oh longing sorrow couplets day foreshorten age men memory autumn end leave deep understanding longing felt person drag weight history culture yet aware thing vast fallout century disintegration collapse remnant empire still unable norm idiom so start actually lamentable translation definition good translation notice fails test miserably little plot closely observe study necessity mean slowly closely observe lyrical content simply similar prose image shatter page encounter variety translation tick hackneyed phrase unnecessarily complex word spell yon oft time large truth tell kith hale hearty sing ditty let cat bag slave baser word paragraph encounter quiddity haecceities spell fantasy magic use many many time personality agreeable persona preconception exercise volition live apart verdure assault casing skin while periodically time used way often maybe addict archaic spelling huge vocabulary throw addict hackneyed phrase translator merely follow original add quirk together translator merely follow original ever write quote", "genres": ["Fiction & Literature", "WWII"], "summary": "Considered by Orhan Pamuk to be the greatest novel ever written about Istanbul, this is a lyrical tribute to both the city and human love.\r\n\r\nA Mind at Peace, originally published in 1949, is a magnum opus, a Turkish Ulysses and a lyrical homage to Istanbul. With an innate awareness of how dueling cultural mentalities can lead to the distress of divided selves, Tanpinar gauges this moment in history by masterfully portraying its register on the layered psyches of his Istanbulite characters. Set on the eve of World War II in the “city of two continents,” this literary feat is a narrative of duality: a historical novel and a love story (of the senses and the mind), language and music, tradition and modernity, East and West—and of the vital juncture where one young man must attempt to bridge all of these worlds at once.\r\n\r\nSurviving the childhood trauma of his parents’ untimely deaths in the early skirmishes of World War I, Mümtaz is raised and mentored in Istanbul by his cousin Ihsan and his cosmopolitan family of intellectuals. Having lived through the tumultuous cultural revolutions following the fall of the Ottoman Empire and the rise of the early Turkish Republic, each is challenged by the difficulties brought about by such rapid social change.\r\n\r\nThe promise of modernization and progress has given way to crippling anxiety rather than hope for the future. Fragmentation and destabilization seem the only certainties within the new world where they now find themselves. Mümtaz takes refuge in the fading past, immersing himself in literature and music, but when he falls in love with Nuran, a complex woman with demanding relatives, he is forced to confront the challenges of the World at large. Can their love save them from the turbulent times and protect them from disaster, or will inner obsessions, along with powerful social forces seemingly set against them, tear the couple apart?", "asin": "0982624638", "rank": "852093", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/51bzQfS9wIL.jpg", "country": "Turkey", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}