{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 58, "rating": 4.7, "reviews": [{"review_sentiment": 4.0, "review_text": "This personal saga covers decades in author Ben's life, and mostly his bromance with writing colleague Hank. Dipping back and forth in time, the novel includes New York's '80s, his Idaho youth, and a few intimate-epic trips. Having recently read Spanbauer's novel <i>Now Is The Hour</i>, I got a clear 'roman a clef' sense, from his references to childhood, and other aspects. The repetition of phrases and foretelling of pivotal events to come, whether poetic or annoying, depending on your taste, returned and returned.The section of Ben's HIV illness is moving, painful, and truthful. I felt many scenes were well dramatized; the trippy moments, the conversations and settings. I empathized for his breakup with Ruth, and despite Ben being gay, how he felt trapped in a marriage of a sort. We're shown the inevitability of Ruth's connection with Hank. Yet I never truly understood why Hank was so fascinating. The near-Kerouac/Cassidy man-love is understandable. But without so much as a sentence or paragraph from Hank's book, why is he so alluring, other than being a handsome man who is a close -then distant- friend?Still, evocative and amusing, touching in many parts, I look forward to reading more of the author's books."}, {"review_sentiment": 5.0, "review_text": "Spanbauer delivers once again - a powerful journey into love and intimacy over the arc of time.  I loved this book and his ability to transport me viscerally into the broad spectrum of the human experience."}, {"review_sentiment": 5.0, "review_text": "Tom Spanbauer is a fantastic novelist. I've read all five of his books. With the first, Faraway Places, he is 'finding his feet', it's a very good book, but it’s with the second, The Man Who Fell in Love with the Moon, where Spanbauer fully demonstrates he is a master of words, truly establishing a style for strong, epic narrative. With this second novel Tom develops a kind of grand guignol flourish to his stories and wonderful characters within an all-encompassing grand epic. The gg flourish helps with the readability factor, making it literally fantastic fiction. This gg factor is at its peak with the Moon Lover, and then employed to varying degrees with the next two epics (each again being lovely books). Note, the below contains some spoilers, though I don’t think they are huge ones . . .I Loved You More is an outstanding work of fiction on people, modern love, relationships (across hetero and homo ‘borders’), the passing of time, Aids, mental health and treatment. This is a book I cannot speak too highly of. It is a perfect book. It is a classic. I worry my review won’t do the book justice as it is limited to my ability. With I Loved You More Tom finally abandons the almost-grand guignol style of Man Who Fell in Love with the Moon, still retaining the passionate prose of a gripping read. In this statement is part of what makes I Loved You More a great book: that it manages to be eminently readable and at the same time totally grounded in reality, addressing serious issues of commitment, honesty to oneself and honesty as a writer, and emotional honesty in relationships which could be construed as being based on lies (ie a homo with a hetero) (don’t you love the English language).I Loved You More brings in many themes and characters with their own wonderful stories. The book is mainly about a triangular relationship between Ben, and Hank his best friend, and a third character Ruth. As is normal with Tom’s books I find myself unable to stop reading as the main character goes from one world to the next, meeting new people, going to new places. A hundred pages go by, a decade rolls on, more characters come and go, and in this way a real story builds up about how Ben is struggling in America, to gain some kind of self worth and confidence, getting on with life, his writing, dealing with Aids and mental health problems. Throughout, the relationship between Ben and Hank glows in the dark. It sounds potentially corny, this ‘Eternal Flame’ of a relationship, but that’s what Tom succeeds in portraying with Ben and Hank. [To be clear they are just buddies.] It must be one of the best accounts of a close friendship I have ever read, it’s convincing, it’s moving, it’s of itself unique (ie, it has it’s own life).Ruth’s character is also full colour (perhaps more so in its warts and all way). Where Ben and Hank’s friendship is a beacon of love on a pedestal, the love between Ben and Ruth, nevertheless true, is certainly different. In fact it stands in sharp comparison, as fractured, having its demise within its origins. Ben appreciates Ruth for her love and support during the darkest period of his illness, but he is also brutally honest of her faults. In contrast, however, it seems Ruth’s love for Ben is a demanding love. The way Spanbauer describes this is wise in its unjudgemental stance, he leaves it to the reader to fathom certain issues rather than making them explicit. Though Spanbauer is usually explicit, there are some interesting points which go by unmentioned despite his honesty. For instance as Ben is suffering from a crippling illness and accompanying mental and physical conditions, fear of going out, depression, sleeplessness, exhaustion etc; Ruth thrives. Not explicitly stated, it’s insinuated that Ben takes this unnoticed wallflower, Ruth, and encourages her to blossom – gone is her fringe, her hair grows lush and long, she loses weight, she develops her confidence, her sense of self, her writing and teaching – and she says to him that he will never be able to repay her for the help she has given him! In laying these ideas quietly, is Spanbauer playing an upper hand here? Pretending to be humble, wanting to be the saint, or does he truly not realise what he gave to Ruth in the relationship? This could be seen as dark stuff: it’s as though Ruth, the flower, blooms, as Ben’s life turns to compost. It’s a harsh statement to put into words – the dynamic of Ruth’s relationship (especially if some of the book’s content is auto-biographical?) – does Ruth deliberately seek out weak men in order to dominate and flourish? Continuing the story, old habits die hard, on first sight, Ruth falls immediately for Hank, it must be his glass eye . . .The book’s comparisons of different love is part of the books unveiling of the mysteries of love, its multifarious guises. There is a kind of balance between Ben and Ruth: where Ben doesn’t reciprocate the same love for Ruth, she doesn’t reciprocate honesty in the same way. This is the messiness of love in all its unglory. With Ben and Hanks friendship, what is shown is the glory of love when there are no such demands put on it and where the frontiers are clearer. Love here is more pure, a source of strength, seemingly more simple, perhaps rarer. Then there are many other stories of love within the book drawn through other characters.These complexities make it difficult to review Spanbauer properly as there is so much included in his writing. The main thing is that Spanbauer is a loving, compassionate author. He takes characters who are side-lined, a bit beat up, secondary to other people and builds a story around that character (who he relates to, the central characters are always similarly from the West, gay, and with similar family backgrounds). Hence he is ‘un-marginalising’ the antihero, ‘centralising’ the geek. This isn’t new of course. Hubert Selby Junior was a master at this in Last Exit. But the way Spanbauer does it is deftly elegant: to write the antihero into a kind of heroic text. Watch how the epic builds up around his characters: you love them, identify with them and desperately want them to be happy. And the ‘other’ people, those who are normally at the epicentre (straights etc) are shown to have their problems as well. This isn’t anti-straight writing. But it is writing that sets past bent records straight (or at least a bit more straight). Everybody has problems, it is human to suffer, and a gay person isn’t by definition a secondary character. Spanbauer’s writing thus becomes suitably political in unmarginalising the marginised – doing it so beautifully, so entertainingly is thick icing.As societal imbalances are being redressed in this way, all the other characters reveal their stories as well, as mentioned, a lot of them are ‘beat up’ stories. I suppose, some are tragic. Tragedy is ultimately avoided in the redemptive pursuit of coming to terms with seeking place, confidence, self worth and purpose and what it means to be human, that a negative can be a positive, such as Aids, when it is accepted as a general aspect of being human, experiencing life within the full spectrum of what life means, pain is part of human experience. [This acceptance of Aids comes when Aids is no longer the Death Toll faced with ignorance as it was in the Eighties.]. Of course there are happy moments in between, the light glinting off the porcelain, Ida’s bed (from the Ida of Man Who Fell in Love with the Moon). A lot of meaningful eye to eye contact. Love in full bloom. Other issues also enter about feminism, racism and the Sioux, poverty etc. The descriptions of Ben’s mental health tied up with Aids, how it makes him feel isolated from the outer world, how it affects his relationship with Ruth (how she even believes he is making a large bit of it up!), and what treatments are available in Oregon is described stunningly with a lot of small detail in between.The truly wonderful thing is Spanbauer’s skill at dealing with all these issues in an entertaining read (unlike my crap review); with a funny, humane and beautiful style of writing. I’ve tried to avoid revealing the specific story here, this is the kind of review that makes much more sense after having read the book. My main purpose is to nod my head to a very powerful writer. One who should be getting much more attention.[While writing this it reminded me of another classic of gay literature, Modern Love by Paul Magrs.]\"I’ve never really thought I’d say thank god I got AIDS or that it was a blessing I got AIDS. I actually end up saying it in this book. It was. It’s helped me have a new awareness about all this **** that I went through. It’s really profound. For the longest time I felt selected out and put upon and why me. Now I just understand that I’m just a part of human suffering.\" ~Tom Spanbauer"}, {"review_sentiment": 5.0, "review_text": "This book has become my favorite. Tom Spanbaur's writing is poetic and beautiful."}, {"review_sentiment": 3.0, "review_text": "I wanted to like this book as the premise sounded interesting. Set in the 80s and 90s, it started off well enough, from the beginning Ben admits that he's impotent and reminds you every chance he gets, then for much of the middle the narrative takes you on an aimless cross country road trip with Ben and Hank where nothing physical happens. Ever. It's one long period where Ben whines over not getting what he wants from Hank, a physical relationship, while he obsessively studies every unimportant nuance of his straight friend. I guess we're lucky since this is all information the reader is going to get about Hank, as we never get into his head and truly understand him.The author repeats details and phrases throughout the book over and over, as if he's saying to the reader, \"remember this in case you didn't catch it the first time,\" which is insulting and is a waste of time and print. The last quarter of the book picks up a bit as Ben struggles with HIV while his friend Ruth plays caretaker, and who similarly harbors unrequited crush on Ben. The triangle closes when Ruth meets Hank and they run off and leave  Ben behind. The story resolves into nothing more than a few hundred pages of sour grapes."}, {"review_sentiment": 5.0, "review_text": "This is a wonderful book, highly recommend it."}, {"review_sentiment": 5.0, "review_text": "I didn't see the \"plot twist\" until I was on pg. 412ARGHHHIt's so beautiful, it hurts."}, {"review_sentiment": 4.0, "review_text": "This is not his best book but worth the read. The ending makes the somewhat maudlin trip worth taking. Despite its sentimentality and even in his indulgence of melodramatic, his gentle sense of beauty shines through."}, {"review_sentiment": 5.0, "review_text": "Perhaps Spanbauer's best.  Certainly the best for me since the Man who Fell in Love with the Moon.  Focus on older characters, middle aged and beyond looking back on relationships dating back decades."}, {"review_sentiment": 5.0, "review_text": "The characters live and breath off the page in this compelling memoir. I can't remember a more visceral reading experience. Tom Spanbauer is a messy, magnificent writer."}]}, "authors": ["Tom Spanbauer"], "isbn": "0986000787", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "I Loved You More", "word_cloud": "personal saga cover decade author life mostly romance write colleague back forth time include trip have recently now be get clear clef sense reference childhood aspects repetition phrase foretell pivotal event come poetic annoy depend taste return section illness move painful truthful felt many scene well dramatize triply moment conversation setting empathize breakup gay felt trapped marriage sort show inevitability connection never truly understood fascinate understandable much sentence paragraph allure handsome man close friend still evocative amuse touch many part look forward read author delivers powerful journey love intimacy arc time ability transport viscerally broad spectrum human experience fantastic novelist first foot good second fully demonstrate master word truly establish style strong epic narrative second develop kind grand guignol flourish story wonderful character grand epic j flourish help readability factor make literally fantastic fiction j factor peak employ vary degree epic lovely contain spoiler think huge one outstanding work fiction people modern relationship hetero homo border pass time mental health treatment speak highly perfect classic worry review justice limit ability finally abandon guignol style still retain passionate prose gripping statement part make great manages eminently readable time totally grounded reality address serious issue commitment honesty honesty writer emotional honesty relationship base lie ie homo hetero love english language brings many theme character wonderful story mainly triangular relationship best friend third character normal find unable stop reading main character go world meet new people go new place a hundred page go decade roll character come way real story build struggle gain kind worth confidence get life write deal mental health problem throughout relationship glow sound potentially corny relationship succeed portray buddy best account close friendship ever convince move unique ie life character also full color perhaps warts way friendship beacon pedestal love nevertheless true certainly different fact stand sharp comparison fracture demise origin appreciate support darkest period illness also brutally honest fault contrast however seem demand way describe wise unjudgemental stance leave fathom certain issue rather make explicit usually explicit interesting point go unmentioned honesty instance suffer cripple illness accompany mental physical condition fear go depression sleeplessness exhaustion thrive not explicitly state insinuated take unnoticed wallflower encourage blossom go fringe hair grows lush long loses weight develops confidence sense self write teach say never able repay give lay idea quietly play upper hand humble want saint truly realist give relationship see dark stuff flower bloom life turn compost harsh statement put word dynamic relationship especially content deliberately seek weak men order dominate flourish story old habit die hard first sight fall immediately eye comparison different part unveil mystery love multifarious guise kind balance honesty way messiness glory friendship show glory love demand put frontier clearer pure source strength seemingly simple perhaps then many story love drawn complexity make difficult review properly much include write main thing love compassionate author take character bit beat secondary people build story character relate central character always similarly gay similar family background antihero centralize geek new course master last exit way deftly elegant write antihero kind heroic text epic build character love desperately want happy people normally epicenter straight show problem well writing write set past bent record straight least bit straight everybody problem human suffer gay person definition secondary character write thus become suitably political unmarginalising marginised beautifully entertainingly thick societal imbalance redress way character reveal story well mention lot beat story suppose tragic ultimately avoid redemptive pursuit come term seek place confidence self purpose mean human negative positive accept general aspect human experience life full spectrum life mean pain part human experience acceptance come longer face ignorance course happy moment light glint porcelain bed lot meaningful eye eye contact full bloom other issue also enter feminism racism poverty etc description mental health tie make feel isolated outer world affect relationship even believe make large bit treatment available describe stunningly lot small detail truly wonderful thing skill deal issue entertain crap review funny humane beautiful style write try avoid revealing specific story kind review make much main purpose nod head powerful writer get much attention write remind classic gay literature never really thought say thank god get blessing get actually end say help new awareness go really longest time felt select now understand part human suffering spanbauer become favorite write poetic beautiful want premise sound interesting start well enough begin admits impotent reminds chance get much middle narrative take aimless cross country road trip nothing physical happen long period whine get want physical relationship obsessively study unimportant nuance straight friend guess lucky information go get never get head truly understand author repeat detail phrase say case first time insult waste time print last quarter pick bite ben struggle friend play caretaker similarly harbor unrequited crush triangle close meet run leave story resolve nothing hundred page sour grape wonderful highly recommend see plot twist pg beautiful hurt best end make somewhat maudlin trip worth take sentimentality even melodramatic gentle sense beauty shine perhaps best certainly best older character middle age look back relationship date back decade character live breath page compel memoir visceral read experience magnificent writer", "genres": ["Fiction & Literature", "LGBT", "Historical Fiction"], "summary": "Tom Spanbauer’s first novel in seven years is a love story triangle akin to The Marriage Plot and Freedom, only with a gay main character who charms gays and straights alike. \r\nI Loved You More is a rich, expansive tale of love, sex, and heartbreak, covering twenty-five years in the life of a striving, emotionally wounded writer. \r\n\r\nIn New York, Ben forms a bond of love with his macho friend and foil, Hank. Years later in Portland, a now ill Ben falls for Ruth, who provides the care and devotion he needs, though they cannot find true happiness together. Then Hank reappears and meets Ruth, and real trouble starts. \r\n\r\nSet against a world of struggling artists, the underground sex scene of New York in the 1980s, the drab, confining Idaho of Ben’s youth, and many places in between, I Loved You More is the author’s most complex and wise novel to date.\r\n\r\n\"A taut, brutal narrative … that comes to hypnotize, shimmering like the brilliant sun on the alfalfa fields.\" The New York Times", "asin": "0986000787", "rank": "911166", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51pk6hb6LtL.jpg", "country": "Portland", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}