{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": -37.8142176, "ratings": {"num_ratings": 2, "rating": 5.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Love this magazine! Every issue if full of beautiful photography, unique articles, and a whole lot of coffee knowledge. The print quality is also fantastic!I will say, this is the first issue where a few of the pages with photography were printed on a more glossy paper. I prefer the previous issues where every page is a on matte paper. I think the glossy printing gave the magazine a more 'chemically' smell which isn't as pleasant when relaxing at home enjoying a cup of coffee while reading. I'd prefer if on future issues they only used matte paper if that is what caused the funky smell.None the less, 5 stars hands down, can't wait for the next issue!"}, {"review_sentiment": 5.0, "review_text": "The ultimate coffee table book, full of lots of interesting photos & info."}]}, "authors": ["Adam Goldberg", "Daniela Velasco", "Elyssa Goldberg", "Bonjwing Lee"], "isbn": "0986296260", "longitude": 144.9631608, "periods": ["2000s", "Recent Releases"], "title": "Drift, Volume 5: Melbourne", "word_cloud": "magazine issue full beautiful photography unique article whole lot coffee knowledge print quality also fantastic say first issue page photography printed glossy paper prefer previous issue page matte paper think glossy printing give magazine smell pleasant relaxing home enjoy cup coffee reading prefer future issue use matte paper cause funky le star hand next issue ultimate coffee table full lot interest photo info", "genres": ["Travel Writing", "Magazines"], "summary": "Introducing Drift: Melbourne. This issue contains stories about Melbourne, its coffee, and the people who drink it. For our fifth issue, we hear from dozens of locals, shop owners, roasters, patrons, entrepreneurs, writers, and photographers about what it s like to drink coffee in Melbourne. \r\n\r\nThe capital of Victoria is flush with cafes, boasting one of the highest concentrations of coffee shops per capita in the world. Home of the flat white and avocado toast, this unsuspecting epicenter of the coffee world is at a crossroads, as its most towering figures take what they've learned to enterprises overseas, and leave the Australian city to recalibrate its identity.", "asin": "0986296260", "rank": "134743", "city": "Melbourne", "image": "https://images-na.ssl-images-amazon.com/images/I/51nN2dzS8pL.jpg", "country": "Australia", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}