{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 33, "rating": 3.9, "reviews": [{"review_sentiment": 1.0, "review_text": "My fault; it was abridged and I didn't notice."}, {"review_sentiment": 5.0, "review_text": "I love this book; have read it many times over the years.  Had lost my copy so was so happy to be able to get a new copy.  If you like history and love New Orleans you will like this book!"}, {"review_sentiment": 5.0, "review_text": "Antoine's is a place that is steeped in History, it makes you feel as though you are part of the plot, part of the city and their exciting way of life.Food is wonderful and going there to eat and look, see and be seen is a treat and a thrill!"}, {"review_sentiment": 5.0, "review_text": "This is my 3rd time to read this book.  My granddaughter, daughter and I are going to a wedding in which Antoine's is hosting the reception.  This book is wonderful"}, {"review_sentiment": 5.0, "review_text": "Lighten up folks! This book is just plain old fun to read. The characters are caricatures, but that is what they were meant to be. I had trouble putting it down.  The flavor of New Orleans comes through and just adds to the enjoyment of the book. I recommend it to anyone who enjoys a good read from that time period-1948."}, {"review_sentiment": 2.0, "review_text": "Poorly written, unlikeable characters, tedious plot. I tried to force myself to read it all the way through but started skimming about 1/3 of the way and quit reading after that. I do not recommend it."}, {"review_sentiment": 4.0, "review_text": "well done--an enjoyable read"}, {"review_sentiment": 5.0, "review_text": "Five Star rating in all respects! Thank you"}, {"review_sentiment": 1.0, "review_text": "This book was much too racist for me. It was shameful. I don't feel it was even necessary to portray any particular point in the story, it was just mean spirited. The female characters were shallow and predictable. The murder mystery itself could have been wrapped up in a few chapters at most, the rest was just incohesive fluff, drifting aimlessly. It gets difficult at some point to remember that you're even reading about a murder mystery. If you want to get a feel for New Orleans in general, there are better ways to get there other than reading this book; that's what the internet is for.Was this a literary work of fiction or just a shameless plug for Antoine's restaurant?All of the characters came across the same. No one particular style of speaking is ever that consistent. It's like seeing every number in a tax return ending in a nice round zero....audit flag! Even wealthy people say \"gonna\" and ain't more than you think. When the book got corny, it really got corny, like the song about the levee......stop now, please!I liked the different POVs the author used, that was unexpected and I liked anticipating getting into the characters head, might have used it more to help compensate for all that it lacked. Other than that, thumbs down."}, {"review_sentiment": 5.0, "review_text": "This is the second time I've read the book. At one time it was considered one of the FIVE best books of the first half of the 20th century. It is still an excellent read. It is atmospheric and gives a very close look at the New Orleans lifestyle, political and private."}]}, "authors": ["Frances Parkinson Keyes"], "isbn": "0988962705", "longitude": -90.0701156, "periods": ["1900s", "Recent Releases"], "title": "Dinner at Antoines", "word_cloud": "fault abridge notice love many time year have lose copy happy able new copy like history place steep make part plot part city excite way wonderful go eat look see see treat thrill time granddaughter daughter go wed host reception wonderful lighten folk plain old fun character caricature mean trouble put flavor come add enjoyment recommend anyone enjoy good time poorly write unlikable character tedious plot try force way start skim way read recommend well do enjoyable rating respect much racist shameful feel even necessary portray particular point story mean spirit female character shallow predictable murder mystery chapter rest in cohesive fluff drift aimlessly get difficult point even read murder mystery want get general better way get read internet literary work fiction shameless plug restaurant character come one particular style speak ever consistent see number tax return end nice round zero flag even wealthy people say hon think get corny really get corny song levee stop please like different author use unexpected like anticipate get character head use lacked other thumb second time time consider best first half century still excellent atmospheric give close look lifestyle political private", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Orson Foxworth celebrates his return to New Orleans by giving a dinner in the 1840 room at Antoines restaurant, ostensibly planned to present his niece for the Carnival festivities and to renew his romance with Amelie Lalande. Laland's daughter Odile, accidently spills a red wine down her white dress, a seemingly light incident. \r\n\r\nHowever, it is recalled thirty hours later when she is found dead with a strange pistol and an ambiguous note on the floor beside her. Though looking like suicide the plot revolves out of proving otherwise. Infused with much history, customs, and mores of New Orleans of the 1940's. \r\n\r\nWith a new introduction by Patricia Brady setting the history, context of the novel, and with biographical notes on Keyes.", "asin": "0988962705", "rank": "306422", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/51JmrNyIECL.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}