{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 180, "rating": 4.4, "reviews": [{"review_sentiment": 3.0, "review_text": "It was interesting and an easy read. Didn’t care for the way it ended. Would have give 4 stars if conclusion of the story was better."}, {"review_sentiment": 5.0, "review_text": "This story transported me back in time. It is filled with robust historic detail. I will never see gondolas the same way again."}, {"review_sentiment": 5.0, "review_text": "Very well written historical novel. The characters came alive & there was a nice twist at the end."}, {"review_sentiment": 5.0, "review_text": "I didn't expect to enjoy this book as much as I did! I thought there might be too many  technical aspects of gondola building. Wrong. It added to the clarity of the story. Great characterization!"}, {"review_sentiment": 5.0, "review_text": "Wonderful way to travel back in time to the heart of Venice. A rich experience of the workmanship and lives of the characters."}, {"review_sentiment": 5.0, "review_text": "I enjoyed this moving tale. The emotions put forth in words some of which I could not make out. I feel they are authentic from my time around Italy and Italians."}, {"review_sentiment": 5.0, "review_text": "Hard to put this down. Totally transports you into another world, another time. You learn a lot about gondola making in the process."}, {"review_sentiment": 4.0, "review_text": "Good read - got it for free so the price was right!"}, {"review_sentiment": 5.0, "review_text": "A fantastic historical fiction. The historical accuracy and vivid detail made me feel like I was transported to 16th century Venice.  I was drawn into the life of the main character and felt like I could see, hear, taste, and smell teh things described in the book.  I enjoyed The Gondola Maker so much that I immediately purchased the prequel The Painter's Apprentice.  I highly recommend this book."}, {"review_sentiment": 5.0, "review_text": "The Gondola Maker is a wonderful historical fiction piece that takes you into the 16th century. There is drama, beautiful descriptions of the waterways, houses and people of the time. Look forward to a sequel!"}]}, "authors": ["Laura Morelli"], "isbn": "098936710X", "longitude": 12.3345898, "periods": ["Recent Releases", "1500s"], "title": "The Gondola Maker", "word_cloud": "interest easy care way end give star conclusion story better story transport back time fill robust historic detail never see gondola way very well write historical character come alive nice twist end expect enjoy much think many technical aspect building add clarity story characterization wonderful way travel back time heart rich experience workmanship live character enjoy move tale emotion put forth word authentic time put transport world time learn lot make process good get free price right fantastic historical fiction historical accuracy vivid detail make feel transport century draw life main character felt hear taste smell the thing describe enjoy much immediately purchase highly recommend wonderful historical fiction piece take century drama beautiful description waterways house people time forward sequel", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Award-winning historical fiction set in 16th-century\r\n\r\nFrom the author of Made in Italy comes a tale of artisanal tradition and family bonds set in one of the world's most magnificent settings: Renaissance Venice.Venetian gondola-maker Luca Vianello considers his whole life arranged. His father charted a course for his eldest son from the day he was born, and Luca is positioned to inherit one of the city's most esteemed boatyards.\r\n\r\nBut when Luca experiences an unexpected tragedy in the boatyard, he believes that his destiny lies elsewhere. Soon he finds himself drawn to restore an antique gondola with the dream of taking a girl for a ride.\r\n\r\nThe Gondola Maker brings the centuries-old art of gondola-making to life in the tale of a young man's complicated relationship with his master-craftsman father. Lovers of historical fiction will appreciate the authentic details of gondola craftsmanship, along with an intimate first-person narrative set against the richly textured backdrop of 16th-century Venice.\r\n\r\n\"I'm a big fan of Venice, so I appreciate Laura Morelli's special knowledge of the city, the period, and the process of gondola-making. An especially compelling story.\" Frances Mayes, author, Under the Tuscan Sun", "asin": "098936710X", "rank": "530772", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/51t5OuelT9L.jpg", "country": "Italy", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}