{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 23.138028, "ratings": {"num_ratings": 43, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Different viewpoint. Fascinating view of old Havana."}, {"review_sentiment": 3.0, "review_text": "Interesting book with historical backround but a tad too long"}, {"review_sentiment": 5.0, "review_text": "Wish I had read Tropicana Nights Before a recent trip to Havana. Rosa Lowinger gives an excellent road trip through Cuban architecture, history, and culture.  Her descriptions of Tropicana's origins, owners and impact, the case study of the Mafia and its ties in Cuba and the US, and the tragic revolution and associated diaspora make this a valuable read."}, {"review_sentiment": 5.0, "review_text": "excellent"}, {"review_sentiment": 5.0, "review_text": "Brought back many wonderful memories! I went to school with Martin Fox's nephew and met Martin in Miami!"}, {"review_sentiment": 5.0, "review_text": "A page turner for sure!  Fascinating interweaving of the history of the Tropicana night club with the events surrounding the Cuban revolution.  After visiting the venues described in this book, I couldn't put the book down.  Extremely readable, and well written and researched."}, {"review_sentiment": 3.0, "review_text": "This book was just okay - I enjoyed it when she was discussing the politics of the time, but most of the book is about different musical acts in Cuba.  I wasn't familiar with most of them.  Honestly I wouldn't recommend."}, {"review_sentiment": 5.0, "review_text": "Tropicana Nights was a great read about the famed Cuban nightclub The Tropicana.  Their were a lot of historical facts in the book which were quite interesting about the politics of the era.  It was also nice to read about the movie stars who frequented the club and the black and white pictures that were included within the book.  I have recommended this book to many of my friends.  Interesting read."}, {"review_sentiment": 5.0, "review_text": "Good writing and a great story. Havana and all of Cuba are an often ignored part of history.I really enjoyed it."}, {"review_sentiment": 5.0, "review_text": "I haven't read such a great book in a long time. The author has captured not only the early history, culture, and politics of Cuba but also the real stories (1940's-1950's) directly with  the Tropicana's widow (Ofelia Fox). Numerous interviews with Tropicana's past  employees (artists) from the early days were fascinating and the shows and costumes became more  and more complex over time .  You can imagine yourself there gambling or watching the famous cabaret shows with the socialites of the glory days!  Her descriptions of the physical regions of Cuba and Havana's art and architecture were also outstanding."}]}, "authors": ["Rosa Lowinger", "Ofelia Fox"], "isbn": "0989808521", "longitude": -82.3658671, "periods": ["1900s", "Recent Releases"], "title": "Tropicana Nights: The Life and Times of the Legendary Cuban Nightclub", "word_cloud": "different viewpoint view old interest historical background tad long wish recent trip give excellent road trip architecture history culture description origins owner impact case study tie tragic revolution associate diaspora make valuable excellent back many wonderful memory go school page turner sure fascinate interweave history night club event surround revolution visit venue describe extremely readable well write research okay enjoy discuss politics time different musical act familiar great famed lot historical fact quite interest politics era also nice movie star frequent club black white picture include recommend many friend interest good writing great story often ignore part really enjoy great long time author capture early history culture politics also real story directly widow interview employee artist early day fascinate show costume become complex time imagine gamble watch famous cabaret show socialites glory day description physical region art architecture also outstanding", "genres": ["History", "Music"], "summary": "At Tropicana you could play the roulette wheel, dance to the latest mambo or rumba, or simply ogle the parading goddesses of the flesh. It was the brightest jewel in 1950s Cuban nightlife, and Nat “King” Cole, Liberace, Josephine Baker, and Carmen Miranda performed there before audi­ences that included Ernest Hemingway, Marlon Brando, and Joan Crawford. \r\n \r\nIn Tropicana Nights, Rosa Lowinger and Ofelia Fox, widow of Martin Fox, the club’s last owner, take us back to its glory years. Ofelia, the “first lady” of Tropicana, shares her memo­ries, undimmed by decades of exile, with Rosa Lowinger, also a Cuban exile, whose parents frequented the club in its heyday. Together, Lowinger and Fox vividly portray the cultural rich­ness and roiling social problems of pre-Revolutionary Cuba and take the reader on a tour of one of the world’s most glam­orous venues at its most brilliant moment.", "asin": "0989808521", "rank": "641025", "city": "Havana", "image": "https://images-na.ssl-images-amazon.com/images/I/51aXqXbvOkL.jpg", "country": "Cuba", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}