{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 5, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Good book, read it while in my bunkhouse in the rain forest of Dominica!"}, {"review_sentiment": 3.0, "review_text": "The story of a white Creole family in 1930s Dominica - the Master is a broken man after World War I, reliant on his drug supplier, who has leeched most of the wealth out of the family. Near neighbour, Andrew, is dying of tuberculosis.And then the three grown-up daughters return separately to visit: lovely Stella, bringing her little son from America; Joan, with her child from England, eager to continue her political activism among the poor of Dominica. And finally Natalie, a rich widow.Narrated by Lally, the old black nurse - herself ill - who has been re-employed to care for the children, this book promised great things. I found Lally a strong character, and the sense of the humidity and abundance of the island gave it a real sense of place. However I found all the daughters rather silly and unbelievable, and really couldn't care about any of them.The quote on the back cover from the Sunday Times, that it is 'Reminiscent of The Wide Sargasso Sea' was to my mind a great exaggeration; apart from being set in the same country, Jean Rhys' work is far superior."}, {"review_sentiment": 5.0, "review_text": "This book is like a favorite painting at a museum one returns to see again and again.  Each reading reveals a little more about the characters and the setting and offers important insights into life  (as imagined, but based on the author's experience) on an island in the Caribbean.  A true treasure!"}, {"review_sentiment": 2.0, "review_text": "I was fascinated and curious about Dominca and looked forward with great anticipation to a very engaging read that would provide a glimpse of the island and its life.  However,I found the story line to be slow and less than interesting or inspiring."}, {"review_sentiment": 5.0, "review_text": "The book is in really good condition and was received promptly.  I'd buy again from this source."}]}, "authors": ["Phyllis Shand Allfrey"], "isbn": "0993108628", "longitude": 0.0, "periods": ["1900s"], "title": "Orchid House", "word_cloud": "good bunkhouse rain forest story white family break man reliant drug supplier leech family neighbor die daughter return separately visit lovely bring little son child eager continue political activism poor finally rich old black nurse ill care child promise great thing find ally strong character sense humidity abundance island give real sense place however find daughter rather silly unbelievable really back cover mind great exaggeration apart set country work far superior like favorite painting museum return reading reveal little character set offer important insight life imagine base author experience island true treasure fascinate curious look forward great anticipation engage glimpse island life however find story line le interesting inspiring really good condition receive promptly buy source", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "First published in 1954, The Orchid House, Phyllis Shand Allfrey's only published novel, is a classic of Caribbean literature. In this markedly autobiographical story of the three daughters of a once-powerful but now impoverished white family, Allfrey interweaves her family's history with the history of her home island of Dominica in the twentieth century. \r\n\r\nThe novel is written in a sensuous style and the story remarkably told through the eyes of Lally, the black nurse of the three sisters. Often praised for the clearsightedness of its analysis of the Dominican historical process, The Orchid House stands at a crucial intersection of West Indian politics. It was during this period that the colonized took over from the colonizer the direction of local governments. \r\n\r\nAllfrey, a Fabian socialist and founder of Dominica's first political party, articulates in this novel the central tenet of a political philosophy that guided a lifetime of grassroots activism: that profound changes had to take place in the power structures of Caribbean societies to bring social justice to its peoples, and that those who persevered in seeking to revive the past were doomed. ", "asin": "0993108628", "rank": "5398472", "city": "Dominica", "image": "https://images-na.ssl-images-amazon.com/images/I/51N0smG7dUL.jpg", "country": "", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}