{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 6270, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "It seems a bit insane to submit a review when there are almost 7000 posted already, but for the reader who has come upon this via my profile page, it's worth noting that any Dickens book is worth reading - I love him so much! - and this beloved classic is no exception.As Dickens goes, this is not my favorite of his oeuvre, but I still highly recommend it. It is superb, especially for the masterful way it depicts (and enables us to feel, to smell, to experience to the marrow of our bones) the horrific events surrounding the French Revolution. But read it, also, for the tender story of love, constancy, and sacrifice - the best of human actions - that bloom and develop alongside and in contrast to the anguish, terror, and ghoulish and vengeful horror brought about by the very antithesis of human goodness.This is a masterpiece and a must-read."}, {"review_sentiment": 3.0, "review_text": "Not an interesting story to me."}, {"review_sentiment": 4.0, "review_text": "A good unbiased overview of the conflict .  Recommended to anyone looking for a deeper understanding of the key stakeholders.  It will certainly help to frame the current situation today.  One small correction. Truman did not loose the 1952 election, he did not run."}, {"review_sentiment": 2.0, "review_text": "Didn't really get into this book"}, {"review_sentiment": 5.0, "review_text": "Oldie but goodie.  Just love to read."}, {"review_sentiment": 5.0, "review_text": "The French Revolution is a terrible time in history that we must not pass off or forget, and recognize the atrocities that humans are still capable of."}, {"review_sentiment": 3.0, "review_text": "In my honest opinion about the book Great expectations by Charles Dickens it was an okay book that had both pros and cons applied. The novel was published in 1861 by the author Charles Dickens who is know for the novel \"The Tale of Two Cities\" this author has a style of repetition in his storytelling sense. The genre of this story is a Novel. The story takes place in 19th century England, a boy named Pip finds himself conflicted when he runs into a convict who threatens him into bringing food an a file, but never reveals who helped him escape his irons when he is caught. Later Pip  is sent to meet Miss. Havisham and Estella who live at Satis house, Pip instantly falls in love with the beautiful Estella, but she is cold hearted and cruel. When Pip is dismissed from Miss. Hvisham's service he become Joe's blacksmith apprentice, Estella makes Pip feel less about himself and his financial ranking by bullying him with snarky comments that make him desire being a gentleman. An anonymous benefactor leaves Pip a great fortune which he uses to move to London and become a gentleman to better his manners and have better education with Mr. Mathew Pockett who he strikes a great friendship with his son Herbert. Pip somehow believes that his benefactor is Miss. Havisham. Soon Pip's wealth changes him and he is ashamed of Joe. On Pip's 24th birthday he finds out his real benefactor and has realized he made a grave mistake with his friends and family who have always been faithful to him. Miss. Havisham apologizes to Pip for mistreating him all those years ago and he forgives her. Pip is determined to make things right with his life and atone for his sins. I think Charles Dickens did a wonderful job describing Pip's character, his feeling, his thoughts, and his perspective. I would 100% recommend this book it is a detailed relatable novel."}, {"review_sentiment": 5.0, "review_text": "Superb  transaction! Great Amazon purchase!"}, {"review_sentiment": 5.0, "review_text": "ah Dickens...."}, {"review_sentiment": 5.0, "review_text": "Excellent"}]}, "authors": ["Charles Dickens"], "isbn": "0996584854", "longitude": 2.3514992, "periods": ["1800s"], "title": "A Tale of Two Cities", "word_cloud": "seem bit insane submit review almost post already come profile page worth note read love much beloved classic go favorite oeuvre still highly especially masterful way depicts enable smell experience marrow bone horrific event surround french also tender story love constancy sacrifice best human action bloom contrast anguish terror ghoulish vengeful horror bring antithesis human masterpiece not interesting story good unbiased overview conflict recommend anyone look deeper understand key stakeholder certainly help current situation today small correction loose election really foodie love french terrible time history recognize atrocity human still capable honest opinion expectation con apply publish author know author style repetition storytelling sense genre story story take place century boy name find conflict run convict threatens bring food file never reveals help iron catch later send meet live house instantly fall love beautiful cold heat cruel dismiss service become blacksmith apprentice make feel le financial rank bully snarky comment make desire gentleman anonymous benefactor leave great fortune use move become gentleman better manner better education strike great friendship son somehow believe benefactor wealth change ashamed birthday find real benefactor realize make grave friend family always faithful apologize mistreat year ago forgive determine make thing right life atone sin think wonderful job describe character feel thought perspective detailed repeatable superb transaction purchase ah dickens excellent", "genres": ["Fiction & Literature"], "summary": "“It was the best of times, it was the worst of times…” A Tale of Two Cities has arguably one of the most often quoted opening lines in the canon of classic literature, and Charles Dickens’ famous novel continues to stand the test of time. A story of the French Revolution, A Tale of Two Cities raises questions of justice and the high price of economic and social disparity that still hit the mark today. After being falsely incarcerated for 18 years in the notorious Bastille prison, Dr. Manette returns to England a broken man, but is restored to a semblance of his former self with the aid of his lovely and devoted daughter, Lucie. When father and daughter are later called to testify in a case of treason, Charles Darnay and Sydney Carton enter their lives. Uprisings and twists of fate ensue and readers witness man at his best and worst, right up until the heroic and memorable ending.", "asin": "0996584854", "rank": "957643", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41Xbt8sE9WL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}