{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 43.6044622, "ratings": {"num_ratings": 195, "rating": 4.4, "reviews": [{"review_sentiment": 4.0, "review_text": "Although I give Fatal Pursuit four stars ( I liked it---liked other Bruno stories better), I do love Martin Walker's entire Bruno series. I often forget there is a mystery to be solved as he takes you through the cuisine, casks, culture, caves, chateau, chevals, canines and characters of St. Denis. A good read."}, {"review_sentiment": 1.0, "review_text": "the car is a T57S and not a 57C. The brass plate with the chassis no is fixed to the body and not to the chassis.Erik Koux."}, {"review_sentiment": 5.0, "review_text": "ONE OF HIS BEST!"}, {"review_sentiment": 5.0, "review_text": "Excellent subject matter.  Cars, Food, Drink, Mayhem plus Bruno, Horse, Dog, & Women.......!  Great"}, {"review_sentiment": 3.0, "review_text": "Not the best Bruno book.  Maybe I'm just tiring of the same characters and the improbable plots, but having read all the previous Bruno books this one made me unlikely to buy the next one."}, {"review_sentiment": 5.0, "review_text": "I love the gentle nature of these mysteries, the pastoral setting and the love of food and wine and how they contribute to the quality of life"}, {"review_sentiment": 5.0, "review_text": "Excellent story and escape to Perigord!"}, {"review_sentiment": 5.0, "review_text": "I really enjoy all the books by Martin Walker. He really gives a wonderful account of the French countryside as well as many good French cooking recipes, mixed in with his stories of mystery and intrigue."}, {"review_sentiment": 4.0, "review_text": "Another good installment of the Bruno series. Before my wife got sick we used to save and travel to the south of France periodically. While we sadly can no longer travel there, these books bring the area back to us. This story is one of his better mysteries. I recommend it."}, {"review_sentiment": 4.0, "review_text": "I did enjoy the Bruno series. The plots are very good.I like the description of the context, the recipes, the little side stories. But I do get tired of this \"Latin Lover\" who falls for every women who comes his way. This is quite overdone just as the detailed description of every wine that is drank gets boring.However, it is a good and enjoyable read"}]}, "authors": ["Martin Walker"], "isbn": "1101970758", "longitude": 1.4442469, "periods": ["2000s", "Recent Releases"], "title": "Fatal Pursuit", "word_cloud": "give star like story better love entire series often forget mystery solve take cuisine cask culture cave chateau coeval canines character good car brass plate chassis fix body excellent subject matter not best tire character improbable plot previous make unlikely next one love gentle nature mystery pastoral set love food wine contribute quality life excellent story escape really really give wonderful account french countryside well many good french cooking recipe mixed story mystery intrigue good installment series wife get sick use save travel south periodically sadly longer travel area back story better mystery recommend enjoy series plot description context recipes little side story get tired fall woman come way quite overdone detailed description wine drank get good enjoyable", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A pair of murders, a romance, and rivals in pursuit of a long-lost vintage car make for another mystery for Bruno, chief of police.\r\n\r\nIt’s the start of summer, and Bruno’s found himself the last-minute replacement navigator in a car rally race. The event has attracted a spate of outsiders with deep pockets, big egos and, in the case of one young Englishman, an intriguing story about a lost Bugatti Type 57C. Having disappeared somewhere in France during World War II, and worth millions of dollars, it’s among the most beautiful cars ever made, driving its pursuers mad with greed. \r\nWhen a local scholar turns up dead, Bruno suspects unnatural causes. Still, while life may offer its challenges—often in the form of distractingly comely Parisiennes—there is always time for a good bottle and a home-cooked meal.\r\n\r\n“Thrilling and truly élégante…. Walker has created an object of desire more delectable than the festive meals Bruno always prepares for his friends.” The New York Times ", "asin": "1101970758", "rank": "40136", "city": "Toulouse", "image": "https://images-na.ssl-images-amazon.com/images/I/51PuG9FYwYL.jpg", "country": "France", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}