{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 23, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "On balance, Augustown turned out to be a somewhat less than satisfying read for me. I thought it started out impressively as a skillfully crafted blend of Black folklore and magical realism that effectively articulated - often through infusion of patois - aspects of Jamaican history, culture and the insidious, lingering effects of colonialism. In most respects, those aspects of the narrative pervaded to the conclusion.Unfortunately, once the multiple textures converged to fully illuminate the central story line the book lost distinctiveness, mirroring a number of other books with a core focus of perfidious classism and the seemingly inevitable victimization of a marginalized underclass."}, {"review_sentiment": 2.0, "review_text": "I thought the N.Y. Times gave  an upgraded review of this rather confusing book."}, {"review_sentiment": 5.0, "review_text": "One of the most interesting books I ever read."}, {"review_sentiment": 5.0, "review_text": "Lyrical, poignant, brilliant."}, {"review_sentiment": 5.0, "review_text": "If it was not hugely presumptuous of me and not so likely to be proved wrong in the years to come, I would pronounce this Kei Miller’s magnum opus.  This is a lyrical, sensuous novel.  Kei Miller colours outside the lines, refusing to acknowledge a boundary between poetry and prose.  The scenes pouring out of the novelist’s pen are so vivid, a reader can see and smell and hear and touch and feel every event, every emotion.I had to stop to collect myself when the sanctity of a little boy’s dreadlocks was violated.  Take a break to clear my mind from the brutal images of the autoclaps.  All while chuckling at the audacity of the narrator who berates the reader for ascribing labels such as “magical realism” to the unfolding events.I don't know if I will ever be able to write a proper review of this novel.  I am still trying to catch my breath from the wonder of the work."}, {"review_sentiment": 5.0, "review_text": "I read Augustown and enjoyed it. Kei is a weaver of tales in a way that's grounded in reality. As a non Jamaican I saw how he was able to connect class race and folklore with the backdrop of a real place called augustown. I learned some new patois phrases and some history. It's a sad and necessary story that's told well."}, {"review_sentiment": 5.0, "review_text": "I absolutely loved reading this book to the point where I was sad that it ended. It was well written to the point where you felt as if you were there with the characters."}, {"review_sentiment": 2.0, "review_text": "The first 50 pages draw you into another world.  Everyone speaks in dialect.  Their actions don't always seem logical.  But it gets boring when the scene switches to 1920 and then back to the present.  I never cared about the flying preacher.  I ended up skimming the 2nd half."}, {"review_sentiment": 4.0, "review_text": "well crafted and well written"}, {"review_sentiment": 5.0, "review_text": "Great book, extraordinary command of language and narrative technique."}]}, "authors": ["Kei Miller"], "isbn": "110187161X", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "Augustown", "word_cloud": "balance turn somewhat le satisfy think start impressively skillfully craft blend folklore magical realism effectively articulate often infusion patois aspect jamaican history culture insidious linger effect colonialism respect aspect narrative pervade multiple texture converge fully illuminate central story line lose distinctiveness mirror number core focus perfidious class ism seemingly inevitable victimization marginalize underclass think time give upgraded review rather confuse interesting ever lyrical poignant brilliant hugely presumptuous likely prove wrong year come magnum opus lyrical sensuous color outside line refuse acknowledge boundary poetry prose scene pour novelist pen vivid see smell hear touch feel event stop collect sanctity little boy dreadlock violate break clear brutal image auto claps chuckle audacity narrator berate ascribe label magical realism unfold know ever able write proper review still try breath wonder work enjoyed weaver tale way ground reality non saw able connect class race folklore backdrop real place call learn new patois phrase history sad necessary story tell well absolutely love read point sad end well write point felt character first page draw world everyone speaks dialect action always seem logical get boring scene switch back present never care fly preacher end skim half well craft well write extraordinary command language narrative technique", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "11 April 1982: a smell is coming down John Golding Road right alongside the boy-child, something attached to him, like a spirit but not quite. Ma Taffy is growing worried. She knows that something is going to happen. Something terrible is going to pour out into the world. But if she can hold it off for just a little bit longer, she will. So she asks a question that surprises herself even as she asks it, \"Kaia, I ever tell you bout the flying preacherman?\"\r\n\r\nSet in the backlands of Jamaica, Augustown is a magical and haunting novel of one woman’s struggle to rise above the brutal vicissitudes of history, race, class, collective memory, violence, and myth.\r\n\r\n“Miller’s writing has a cool immediacy [that] gives more than a nod to García Márquez… A vivid modern fable, richly nuanced and empathetic.” The Guardian\r\n\r\n“A deceptive spellbinder, a metafiction so disguised as old-time storytelling that you can almost hear the crackle of home fires as it starts. But then it gets you with twists and turns, it seduces and shocks you even as it wrestles with the very nature of storytelling itself. It’s the story of women haunted by women, and of the dangers of both keeping secrets and saying too much.” Marlon James (author of Man Booker Prize-winning A Brief History of Seven Killings)", "asin": "110187161X", "rank": "76723", "city": "Jamaica", "image": "https://images-na.ssl-images-amazon.com/images/I/41J214hlacL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}