{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 1423, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "What a rich, heartbreaking and beautiful novel! I felt every storyline as if it was a part of my own life. So incredibly well-researched and written."}, {"review_sentiment": 5.0, "review_text": "Powerful, sad, revealing history of how a family journeyed from freedom and slavery in Ghana during the past couple hundred years to present day America."}, {"review_sentiment": 5.0, "review_text": "This is a beautiful story. I could write this is a beautiful story over and over again and still not explain the beauty and sorrow the words in this book brought to life. Each chapter made me stop and regroup, I would ask myself to whom does this character belong? What generation is this? I wondered when and where my ancestors stories stopped being told what I did I lose on the ship ride over?"}, {"review_sentiment": 5.0, "review_text": "Wonderful book!"}, {"review_sentiment": 5.0, "review_text": "A breathtaking tale of two generations. The stories are heart wrenching and thought provoking at the same time. I️ highly recommend"}, {"review_sentiment": 5.0, "review_text": "Yaa Gyasi shows deep empathy with the human condition enduring and distorted by the suffering imposed by racial prejudice, whether through the brutal atrocities of the slave trade, or of American segregation and subsequent continuing discrimination.In a wide coverage of both Ghanaian and US society, from tribal village, British colonial military, primitive US cotton fields and coal mines, to the ghettoes of Harlem over 8 generations, her characterisations are rich and convincing. She doesn’t flinch from showing the generic nature of human atrocity in her account of internecine conflict in pre-colonial Ghana. The novel is well researched. Gyasi’s imagination is fertile but always realistic. Her book is a classic."}, {"review_sentiment": 5.0, "review_text": "Yaa is a captivating writer. Her writing allows the reader to celebrate all facets of life, good and sometimes, not too good."}, {"review_sentiment": 5.0, "review_text": "Could not put it down. Makes me want to visit where it started. History of slavery especially in USA is profoundly sad to imagine more than 450 years of being treated inhuman. Beautifully written. Mahalo!"}, {"review_sentiment": 3.0, "review_text": "*I received a copy of this book in exchange for an honest review. Thanks to Penguin Books (UK) and NetGalley*3.5 starsEffia and Esi have never met but are sisters. Their lives go in different directions - one marries a slave trader, the other is sold into slavery.Homegoing follows Effia and Esi's families for several generations and as they live their lives across different continents.Homegoing was an emotional, thought-provoking read.I enjoyed following Effia and Esi's families and seeing what happened to them, most of which was sad.Reading the parts about the slave trade was upsetting. It's terrible to think that it actually happened.The writing style was easy to follow and in a way I liked that we only saw snippets of each character's life, but I also wanted to find out more about them.There were a few times where I forgot who was related to who.Overall this was an unique, enjoyable read that I would recommend."}, {"review_sentiment": 4.0, "review_text": "A visually elaborate story that follows two half sisters born in colonial Ghana.  One marries a white man, the other placed in the dungeon beneath it and sold into slavery for transport to the  American South. Both are unaware of the other, yet their stories  give detail about their lives and those of the descendants .  This book  provides in horrific detail about  the middle passage, slavery, reconstruction, and modern day America.  Despite all the terrible tragedy , I found a glimpse of hope in the final chapter in the story between Marcus and Marjorie.  However,this novel is overloaded with too many  characters that I consider irrelevant and confusing that I would skip through until I found a better story line.  Great effort for a debut and I give this book the rating of 4.  and look forward to the next one."}]}, "authors": ["Yaa Gyasi"], "isbn": "1101971061", "longitude": 0.0, "periods": ["1700s", "Recent Releases"], "title": "Homegoing", "word_cloud": "rich heartbreaking beautiful felt story line part life incredibly write powerful sad reveal history family journey freedom slavery past couple year present day beautiful story beautiful story still beauty sorrow word bring life chapter make stop regroup character generation wonder ancestor story stop tell lose ship ride wonderful breathtaking tale generation story heart wrench think provoke time highly show deep empathy human condition endure distort suffer impose racial prejudice brutal atrocity slave trade american segregation subsequent continue wide coverage ghanaian society tribal village british colonial military primitive cotton field coal mine ghetto generation characterization rich convince flinch show generic nature human atrocity account internecine conflict well research imagination fertile always realistic classic captivate writer writing allow celebrate facet life good sometimes good put want visit start slavery especially profoundly sad imagine year treat inhuman write receive copy exchange honest review starseffia never meet sister live different direction marries slave trader sell follow family several generation live life different emotional enjoyed follow family see happen part slave trade upset terrible think actually write style easy follow way like saw snippet character life also want find time forget related unique enjoyable visually elaborate story follow half sister bear colonial marry white man place dungeon beneath sell slavery transport unaware yet story give detail live descendant provide horrific detail middle passage slavery reconstruction modern day terrible tragedy find glimpse hope final chapter story however overload many character consider irrelevant confusing find better story line effort debut give rating look forward next one", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "Winner of the PEN/ Hemingway Award\r\n\r\nGhana, eighteenth century: two half sisters are born into different villages, each unaware of the other. One will marry an Englishman and lead a life of comfort in the palatial rooms of the Cape Coast Castle. The other will be captured in a raid on her village, imprisoned in the very same castle, and sold into slavery.\r\n\r\nHomegoing follows the parallel paths of these sisters and their descendants through eight generations: from the Gold Coast to the plantations of Mississippi, from the American Civil War to Jazz Age Harlem. Yaa Gyasi’s extraordinary novel illuminates slavery’s troubled legacy both for those who were taken and those who stayed—and shows how the memory of captivity has been inscribed on the soul of our nation.\r\n\r\n“Dazzling. . . . Devastating. . . . Truly captivating.” The Washington Post", "asin": "1101971061", "rank": "1347", "city": "Ghana", "image": "https://images-na.ssl-images-amazon.com/images/I/51L%2BYV-QD2L.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}