{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 45.4972159, "ratings": {"num_ratings": 106, "rating": 3.9, "reviews": [{"review_sentiment": 5.0, "review_text": "You won’t forget this book quickly.  From the images to the story to the characters, it’s all as sharp as a freshly honed knife.  It took me a while to get into it but this tale of love & loss & forever running from/to something is part mystery, part magic & part polemic on how we hurt others & ourselves. Not exactly a upper but highly recommended."}, {"review_sentiment": 4.0, "review_text": "This was my first Emily St. John Mandel book- I will read more. I appreciate the brevity of this book -it wasn't unnecessarily long, as some books often are- and I could have finished it in a shorter time than I did. Her characters will stay with you. Her writing is beautiful. This is haunting stuff."}, {"review_sentiment": 4.0, "review_text": "I loved Station Eleven by Mandel, so I was excited to read this novel, too.  I was engaged throughout and think the characterization is realistic.  I was left a little disappointed with the conclusion, but, having said that, I'm not sure how else the plot might have been resolved.  All in all a good read--but not as good as Station Eleven."}, {"review_sentiment": 5.0, "review_text": "Breath-taking!"}, {"review_sentiment": 5.0, "review_text": "I've become a huge fan, have read 3 of her novels, each with a quite different storyline but all with a beautiful writing style, such a joy! I've just downloaded a 4th novel."}, {"review_sentiment": 3.0, "review_text": "I bought this book because I loved \"Station Eleven.\"  I think “Last Night in Montreal” is very well written, but it’s also very dark and depressing.  There are parts where not much is going on except fever-dream passages that are mesmerizing in their repetition and trance-inducing incantations, and then they’re just boring.  I can see where she’s trying to go, but I guess I just didn’t have the patience.  Might be better for angst-ridden young adults (i.e. I might have liked it more at age 20)."}, {"review_sentiment": 3.0, "review_text": "I loved \"Station 11\"  and thought I would like this book too but it seemed too dark and the characters lacked likability.  Sorry.  I think she,s a great author but I just find,t care for the book."}, {"review_sentiment": 5.0, "review_text": "Let me just say this...... Emily St. John Mandel writes BEAUTIFULLY.  At times, I felt like I was reading a poem.  This story was so captivating that I could have read it in one sitting, but I like to savor my novels.  Lol. This was an amazing reading experience."}, {"review_sentiment": 2.0, "review_text": "Overwrought, unlikable characters.  Very disappointing after reading Station Eleven."}, {"review_sentiment": 3.0, "review_text": "Good stuff."}]}, "authors": ["Emily St. John Mandel"], "isbn": "1101911956", "longitude": -73.6103642, "periods": ["2000s", "Recent Releases"], "title": "Last Night in Montreal", "word_cloud": "forget quickly image story character sharp freshly hone knife take tale love loss forever run something part mystery part magic part polemic hurt others not exactly upper highly recommend first appreciate brevity unnecessarily long often shorter time character stay writing beautiful haunting stuff love excite engage think characterization realistic leave little disappointed conclusion say sure else plot good good station become huge fan novel quite different story line beautiful write style joy download buy love think well write also dark depress part much go passage mesmerize repetition incantation bore see try guess patience better young adult like age love think seem dark character lack likability think great author find care write time felt read story captivate sit like savor novel lola amazing reading experience unlikable character very disappointing reading good stuff", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "When Lilia Albert was a child, her father appeared on the doorstep of her mother's house and took her away. Now, haunted by an inability to remember much about her early childhood, Lilia moves restlessly from city to city, abandoning lovers and eluding the private detective who has dedicated a career to following close behind. \r\n\r\nThen comes Eli. When Lilia goes out for a paper and fails to return to their Brooklyn apartment, he follows her to Montreal, not knowing whether he wants to disappear, too, or help her find her way home. But what he discovers is a deeper mystery, one that will set past and present spinning toward collision.", "asin": "1101911956", "rank": "340796", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/41N8AOxvC8L.jpg", "country": "Canada", "story_arc": ["Tragedy", "Things only get worse"]}