{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 43.6044622, "ratings": {"num_ratings": 205, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "This is a wonderful series by Martin Walker taking place in a quiet village of provincial France that is authentic down to the wine they grow. But there is always some trouble, and Bruno the Chief of Police is tasked to solve the conspiracy, in this case a group of Terrorists attempting to attack and kill a group of archaeologist that are opening a new cave and finding a secret tomb. This part of France is famous for cave drawings, Neanderthal man's expression of their animal world, and of course Templar's secret activities. I enjoy this novel most as an Audio CD. It isn't necessarily a fast pace action novel but you definitely get the feel for the people, the food, the politics, and when trouble comes, they get their game on. Definitely one of Walker's better in his series, but all of them a excellent and you might enjoy reading a prior novel so that you are familiar with the main characters."}, {"review_sentiment": 5.0, "review_text": "Many characters from recent and early novels appear as history from local and far off lands are woven with current threats in vintage Martin Walker style. Nice ending. May be the best Bruno to date."}, {"review_sentiment": 5.0, "review_text": "Another engrossing story from Martin Walker. I'm looking forward to the next of Bruno's adventures. I've never read a more entertaining series of novels."}, {"review_sentiment": 3.0, "review_text": "There is nothing to directly criticize.  However, there is nothing fresh in this novel; it is too true (for my tastes) to the news that we hear everyday: those able to grab the headlines do so. \"Terrorism\" almost becomes a cliché.  That it would spill over into the south of France given that nation's particular international and ethnic history should not be a surprise.  However, it seems that even Bruno cannot escape into the place in which we all spend much more time: the kitchen."}, {"review_sentiment": 3.0, "review_text": "It was very boring not well written in my opinion. I will not choose to read Bruno stories again. It was generous of me to give it 3 stars."}, {"review_sentiment": 5.0, "review_text": "Martin Walker's novels centered on Bruno, chief of police in St. Denis, are pure entertainment. His grasp of the Perigord region is impressive-food, culture, geography and life style. In addition, one learns of history and current issues that impact France. The Templars' Last Secret is no exception."}, {"review_sentiment": 5.0, "review_text": "Love all the books! Looking forward.....!"}, {"review_sentiment": 2.0, "review_text": "Definitely the one I like much less than the others in the Bruno series! As an Israeli, living near Jerusalem, I love escaping into the French countryside. The last thing I wanted was a lot of stuff about terrorists, Israelis and our \"wonderful\" Mossad. The golden dome that you see on television when Israel is mentioned is NOT the al-Aksa mosque. It is not a mosque at all. It is the Dome of the Rock, so Martin, if you have to write about us, at least get it right! The only reason I gave it any stars at all is the usual mix of good characters, good wine, good food,and gorgeous countryside. If you are a Bruno fan, this is the one to pass on."}, {"review_sentiment": 5.0, "review_text": "The action scenes were really exciting and Bruno’s love interests believable. Nice descriptions of cave paintings. One of the best"}, {"review_sentiment": 5.0, "review_text": "A ripping good tale with action, adventure, love, intrigue and international spies and terrorists.....and oh yes, great food and wine. Highly recommended."}]}, "authors": ["Martin Walker"], "isbn": "1101946806", "longitude": 1.4442469, "periods": ["2000s", "Recent Releases"], "title": "The Templars' Last Secret", "word_cloud": "wonderful series take place quiet village provincial authentic wine grow always trouble task conspiracy case group terrorists attempt group archaeologist open new cave find tomb part famous cave drawing man expression animal world course activity enjoy audio cd necessarily fast pace action definitely feel people food politics trouble come game better series excellent read prior familiar main character many character recent early novel appear history local far land woven current threat vintage style end best bruno date engross story look forward next adventure never entertain series novel nothing directly however nothing fresh true taste news hear everyday able grab headline almost become cliche south give nation particular international ethnic history surprise however seem even escape place spend much time kitchen bore well write opinion choose story generous give star novel center chief police pure entertainment grasp region culture geography life style addition learn history current issue impact exception forward definitely like much le others series living love escape french countryside thing want lot stuff terrorist wonderful golden dome see television mention write least right reason give star usual mix good character good wine good food gorgeous countryside fan pas action scene really excite love interest believable description cave painting best rip good tale action adventure love intrigue international spy terrorists oh yes great food wine recommend", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Bruno, Chief of Police Series\r\n\r\nBruno, the beloved chief of police in the idyllic French town of St. Denis, is back! This time a mysterious death brings ancient secrets to light, and it's up to our hero--and favorite gourmand--to connect the tangled threads of past and present \r\n\r\nWhen a woman's body is found at the foot of a cliff near St. Denis, Bruno suspects a connection to the great ruin that stands on the cliff above: the Château de Commarque, a long-ago Knights Templar stronghold which, along with the labyrinth of prehistoric caves beneath it, continues to draw the interest of scholars. With the help of Amélie, a young newcomer to the Dordogne, Bruno learns that the dead woman was an archaeologist searching for a religious artifact of incredible importance, the discovery of which could have dramatic repercussions throughout the Middle East--not to mention in St. Denis. And the woman's ties to Islamic terrorists can only heighten the pressure on Bruno to unravel the centuries-old mystery. Meanwhile, an old flame of Bruno's is assigned to work with him on the case, and the two find time, naturellement, to enjoy the supreme pleasures of the wine, food, and beauty of the Dordogne.\r\n\r\n“Enchanting.” The New York Times ", "asin": "1101946806", "rank": "44867", "city": "Toulouse", "image": "https://images-na.ssl-images-amazon.com/images/I/51rU7oNykaL.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}