{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 59.9132694, "ratings": {"num_ratings": 1109, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "It was a very good book"}, {"review_sentiment": 4.0, "review_text": "An entertaining, well-written novel with a richly developed protagonist in Harry Hole.  The plot, like most novels with fictional serial killers, is typically implausible.  Also, the story is more than a little confusing at the start, though this is partly due to an English reader's unfamiliarity with Norwegian names.  But this is also due to the deliberate blurring of when certain events in the novel occur; this pays off nicely near the end, but it is quite confusing in the beginning.  The book is strewn with red herrings, none of which are remotely convincing, though I suspect that seems to be the point.  Once the last of the false leads is resolved, the pace picks up considerably."}, {"review_sentiment": 3.0, "review_text": "Not as good at The Girl with the Dragon Tattoo. Functions as a stand-alone novel just fine. Could have been better. Not bad. Not great."}, {"review_sentiment": 4.0, "review_text": "I saw the trailer for the movie and thought it looked frightening but I do not watch scary movies.  I thought it had a similar flavor to the Girl with the Dragon Tattoo series.  I particularly liked the twists and turns and returning to learning a new area of the world."}, {"review_sentiment": 2.0, "review_text": "This was a ridiculous boring book and storyline.  What made it ten times worse is that it took place in Norway with the terrible names of cities, streets and even the people listed in the story. I can't believe any reader in the USA would enjoy this book.  Sorry!!"}, {"review_sentiment": 4.0, "review_text": "This book immerses us in a surreal world. One in which most women are promiscuous even when in committed relationships or wed, and don't use contraception ever, and men don't use contraception either, and consequences never occur to anyone, probably because women facing said consequences never bother making the men responsible for their children.I did find the book well written, though I disliked a lot of what was contained, including the outright alcoholism of the lead detective and his colleagues' willingness to help him on his way to blackouts, and his continued participation in an affair. I also couldn't credit some tales - a wealthy man hangs himself from boredom in Oslo? Why not move to the South of France or New York for winter if he has wealth?The actual crimes centre on a serial killer of women, whose mind was warped by his mother's affair. As a grown man he revenges himself on other mothers. Harry Hole the lead detective is the only policeman with experience of catching a serial killer, so the work comes to him once the fact of a predator is realised. A sinister habit of building snowmen near the victims' homes comes to light. A young woman whose father was a detective, now a cop herself, is transferred from Bergen to Oslo and works with Harry.I kept wanting the women in question to defend themselves and not to meekly do what a sinister man tells them. Why would you go and sit to be tied up? One woman does her best, mostly running away, but I would not have thrown an axe in her position and indeed it leaves her weaponless.Be prepared for gruesomeness and suicides. Scandi crime is bleaker than bleak.This is an unbiased review."}, {"review_sentiment": 5.0, "review_text": "Couldn't put this down!  Don't start this book any later than noon, or you won't get any sleep!!  The psychology and detail are both great, and the suspense just keeps building and building until the very end.  Superb read."}, {"review_sentiment": 5.0, "review_text": "I thought I would read this as the movie had come out recently-I wanted the book version (which in my mind is always better)before the movie version. I read this book in two days. Very rarely do I read a book cover to cover in two days.  But this one I did....and you will too. Start reading,I promise you will not stop."}, {"review_sentiment": 5.0, "review_text": "Suspenseful, creepy, and creative. This kept me awake for my car trip!"}, {"review_sentiment": 4.0, "review_text": "Summary from Goodreads:\"Internationally acclaimed crime writer Jo Nesbø’s antihero police investigator, Harry Hole, is back: in a bone-chilling thriller that will take Hole to the brink of insanity.Oslo in November. The first snow of the season has fallen. A boy named Jonas wakes in the night to find his mother gone. Out his window, in the cold moonlight, he sees the snowman that inexplicably appeared in the yard earlier in the day. Around its neck is his mother’s pink scarf.Hole suspects a link between a menacing letter he’s received and the disappearance of Jonas’s mother—and of perhaps a dozen other women, all of whom went missing on the day of a first snowfall. As his investigation deepens, something else emerges: he is becoming a pawn in an increasingly terrifying game whose rules are devised—and constantly revised—by the killer.Fiercely suspenseful, its characters brilliantly realized, its atmosphere permeated with evil, The Snowman is the electrifying work of one of the best crime writers of our time.\"My Thoughts:This is hands down one of the creepier thrillers that I've read so far this year!  I first heard about this book thanks to the Read or Dead podcast which is a new favorite of mine.  I've had Jo Nesbo's books on my radar but this podcast gave me the push to finally give this author a try.  It also helped that there is a movie coming out based off of this book (and you know that I need to read the book first).  I'm so glad that I finally gave this author a try because this book was intense!  It was the perfect way for me to begin my R.I.P. reading challenge.  This book was darker and way more chilling than I expected it to be.  It begins with this creepy, straight out of a horror movie feel type prologue that basically set the tone for the entire book.  I felt like it was non-stop tension from the very beginning page until the very last page of the book.  You've got to enjoy a great read like that!Harry Hole is a great main character to read about.  As this is the 1st book that I've read in this series, it means I started smack dab in the middle of it.  I found that it didn't matter in the slightest.  I love a flawed main character which describes Harry perfectly.  I liked the way that this author put out red herrings to keep the reader guessing until the very end.  I would think that I had the mystery all figured out, and then the book would take an unexpected turn which would have my re-thinking everything.  I never was able to figure out what was going on until the very end.  I don't think that this book is for everyone as it was very gruesome at times.  It was dark and brutal at times as well.  But it was also oh so good!  I'm so, so curious to see the movie now as you never know exactly what to expect when a book is turned into a movie.  I hope it is just as good as the book!Overall, I really enjoyed reading this book and am eager to read more in this series.  I've already got the first book on my shelves so I will probably start at the beginning to see how it all began sometime soon.  This book was filled with suspense and tension which is exactly how I like my thrillers to be.  I found it hard to put down even when I was thoroughly creeped out by it.  I feel like this was the perfect way to start of my R.I.P. reading challenge as I couldn't have picked a darker thriller than this book.  I would recommend this book to other readers but with the warning that it can be graphic at times.  Fans of mysteries and thrillers should check this author out!  Recommended!Bottom Line:  A terrifying thriller that kept me up way too late reading!Disclosure:  I checked this book out from my local library thanks to the Read or Dead podcast mentioning i"}]}, "authors": ["Jo Nesbo"], "isbn": "1101973730", "longitude": 10.7391112, "periods": ["2000s", "Recent Releases"], "title": "The Snowman: A Harry Hole Novel", "word_cloud": "good entertaining richly develop protagonist plot novel fictional serial killer typically implausible also story little confusing start partly due unfamiliarity norwegian name also due deliberate blur certain event occur pay nicely end quite confuse begin strewn red herring none remotely convince suspect seem point once last false lead resolve pace pick considerably not good fine better not bad not great saw trailer movie thought look frightening watch scary movie think similar flavor series particularly like twist turn return learn new area world ridiculous bore story line make ten time worse take place terrible name city street even people list story immerse surreal world woman promiscuous even commit relationship wed use contraception ever men use contraception consequence never occur anyone probably woman face say consequence never bother make men responsible find well write dislike lot contain include outright alcoholism lead detective colleague willingness help way blackout continue participation affair also credit tale wealthy man hang boredom move winter wealth actual crime center serial killer woman mind warp mother affair grown man revenge mother lead detective policeman experience catch serial killer work come fact predator realize sinister habit build snowman victim home come light young woman father detective cop transfer work keep want woman question defend meekly sinister man tell sit tie woman best mostly run away ace position indeed leave prepared gruesomeness suicide crime bleaker unbiased review later noon psychology detail great suspense keep build build end superb think movie want version mind always better movie version day very rarely cover cover day start read promise suspenseful creepy creative keep awake car trip summary acclaim crime writer antihero police investigator back thriller take brink first snow season fall boy name wake night find mother go window cold moonlight see snowman inexplicably appear yard earlier day neck mother pink suspect link menace letter receive disappearance perhaps dozen woman go miss day first snowfall investigation deepen something else emerge become pawn increasingly terrifying game rule constantly suspenseful character brilliantly realize atmosphere permeate electrify work best crime writer time hand creepier thriller far year first hear thanks podcast new favorite mine radar podcast give push finally author try also help movie come base know need first glad finally give author try intense perfect way read challenge darker way chill expect begin creepy straight horror movie feel type prologue basically set tone entire felt tension begin page last page get enjoy great great main character series mean start smack dab middle find matter slightest love flaw main character describes perfectly like way author put red herring guess end mystery figure unexpected turn everything never able figure go end think everyone gruesome time dark brutal time well also oh good curious see movie never know exactly expect turned movie hope good really enjoy reading eager series already get first shelf probably start begin see begin sometime soon fill suspense tension exactly thriller find hard put even thoroughly creeper feel perfect way start reading challenge thriller reader warn graphic time mystery thriller check author terrify thriller keep way late reading disclosure check local library thanks read dead podcast mentioning", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "The next thrilling installment in the Harry Hole series.\r\n\r\nThe night the first snow falls a young boy wakes to find his mother gone. He walks through the silent house, but finds only wet footprints on the stairs. In the garden looms a solitary figure: a snowman bathed in cold moonlight, its black eyes glaring up at the bedroom windows. Round its neck is his mother's pink scarf. \r\n\r\nInspector Harry Hole is convinced there is a link between the disappearance and a menacing letter he received some months earlier. As Harry and his team delve into unsolved case files, they discover that an alarming number of wives and mothers have gone missing over the years. When a second woman disappears Harry's suspicions are confirmed: he is a pawn in a deadly game. For the first time in his career Harry finds himself confronted with a serial killer operating on his turf, a killer who will drive him to the brink of insanity. \r\n\r\nA brilliant thriller with a pace that never lets up, The Snowman confirms Jo Nesbø's position as an international star of crime fiction.", "asin": "1101973730", "rank": "3808", "city": "Oslo", "image": "https://images-na.ssl-images-amazon.com/images/I/51Anc7xzedL.jpg", "country": "Norway", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}