{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 113, "rating": 3.0, "reviews": [{"review_sentiment": 3.0, "review_text": "This book was given to me by Blogging for Books for an honest unbiased review.Here’s a short but sweet version of my review of “I Am No One”Jeremy is a college history professor who begins to become paranoid as the days go by due to some boxes coming to his doorstep with pictures of his online activity and phone records in it. He’s middle-aged with a successful daughter who he’s attempting to reconnect with due to loneliness.Satisfying thriller with fantastic dialogue and spy galore. At first, I was unsure about whether or not I’d be finishing the novel. While the concept was satisfying, thrillers are generally not my cup of tea. Although my worries, I read the novel, “I Am No One” was fantastic. Anyone who enjoys thrillers and mysteries will genuinely enjoy this novel.Altogether I did enjoy the novel, not as much as I wish I could say. If I were someone who enjoyed thrillers, I’m sure I would’ve enjoyed it more. Any lover of thrillers or mysteries should look into this book. I figure this will be a choice read for particular readers, yet everyone should attempt to read this someday. Make today that day!I’m giving this a 3.5 out of 5 stars! Thank you for reading!"}, {"review_sentiment": 3.0, "review_text": "After a decade teaching abroad at Oxford, Professor Jeremy O'Keefe is back in New York. Upon his return, he begins to receive deliveries of some suspicious boxes filled with paperwork from his online activity and he discovers that he is being followed throughout the city. As a result of this, Jeremy tries to figure out what he may have done to be the target of such nefarious acts..... and here we begin to discover who Jeremy really is.  This book is written from Jeremy's point of view.  We get to crawl around inside his head and see what makes him tick.  Jeremy is a somewhat boring individual with nothing really exciting to say.  But nonetheless, I still found him to be fairly likeable.  This book was not as exciting as I was expecting it to be, but I still found myself interested enough to keep reading.  This book is very wordy and sometimes our protagonist seems to ramble on about unimportant details, but I found his dull thoughts interesting enough to keep reading.  I found myself able to relate to Jeremy in a basic way, although I'm not sure why.  Perhaps, because the author does let us crawl around inside Jeremy's head, that I found I can relate to him on a human level.  He's a flawed individual, but aren't we all?  Overall, I thought this book wasn't bad.  I think it could have been more exciting, but it also could have been worse."}, {"review_sentiment": 3.0, "review_text": "Jeremy O'Keefe is an historian who has spent the last few decades shuttling between New York City and Oxford, England. When the novel opens, he is back in New York City, where he has accepted a new position and hopes to spend time with his daughter, Meredith, who remained stateside with her mother when he went abroad. She is now an adult, married to a rich and powerful man, with a career of her own. Jeremy is enjoying spending time with her and sharing in the perks of the life she now leads.Then one day a student doesn't show for an appointment based on a e-mail exchange Jeremy can't remember, then packages arrive by messenger indicating his life has become the most open of books -- unless Jeremy may have gone a bit mad.  This novel is billed as a thriller, but it consists primarily of Jeremy wondering what's happening and pondering what he could have done to make it happen to him. Unfortunately for the reader, Jeremy's inner dialogues read more like long essays in the New Yorker than anything else. The title indicates Jeremy is a \"no one\" -- but is he really? For me the only interesting bits of this novel were piecing together the mystery of why anyone would be interested in Jeremy as a security risk, given that he appears to be a bit of an unreliable narrator.  It's not a bad book exactly, but it's not the thriller I was led to expect."}, {"review_sentiment": 4.0, "review_text": "It takes awhile to get into this but its worth the effort.  The protagonist moves back to NYC after a long sojourn teaching in Oxford. Not long after moving he begins to see evidence that someone is watching him. Is it the government? Is it someone he's upset or wronged? What follows is a novel of Kafkaesque self evaluation, as he looks back on his own life trying to decipher the reasons someone might put him under such scrutiny. It is a spotty novel, but overall intriguing and enjoyable."}, {"review_sentiment": 3.0, "review_text": "The tone of this book is excellent but, while the author seems comfortable without a plot, it is frustrating for the reader.The first person narrator is an academic who's been in England for 10 years and has just returned to NYC to teach. He begins to think he is being followed and strange things start to happen -- someone sends him a box filled with an account of every website he's ever visited, for instance.At first you don't know whether the narrator is just paranoid or if these things are really happening, and nothing is ever really resolved, as if the author followed a random person and then just sto"}, {"review_sentiment": 3.0, "review_text": "An introspective character study that manges to keep up some tension but ultimately, not enough happens.  I guess it's supposed to be ironic that an expert in the (German) history of surviellance is clueless about modern day privacy issues but I found it farfetched.  The long passages are smart and well written but I did grow tired of them.  I would have liked to give it 3 1/2 stars but couldn't round up to 4."}, {"review_sentiment": 5.0, "review_text": "I Am No One is a great, smart psychological thriller, a rumination on the current state of privacy.  The narrator, Jeremy O'Keefe is a college professor who has just returned to New York after a long stint in the UK.  As the novel opens, something odd happens involving his email and then further odd, and more troubling things continue to happen.  O'Keefe is a bit of an unreliable narrator--he is reluctant to tell the whole story and as the novel progresses, he slowly peels away the layers of the onion to explain (potentially) why things are happening to him.  The novel includes a lot of rumination and consideration, not a lot of action or dialogue.  It is not a true page turner, but I found this one fascinating.  Enjoy!"}, {"review_sentiment": 5.0, "review_text": "Obviously I'm in the minority with this review but I adored this book. It's everything that light entertainment should be; leisurely, intrepid and original. It doesn't place much in the form of demands on the reader yet is an utter delight to pick up and read as the pages, word usage and imagery tickle the brain. Perfect for lazy summer afternoons. While the main story is good, what really sets this apart is the descriptive \"tangents\" that other readers seem to resent - I adore the rambling nuanced musings about life, mental health, travel and more...it felt so authentic, so real. Very much like reading an old fashioned letter or diary entry of someone you once knew. The realism combined with twisted story line make this pure enjoyment."}, {"review_sentiment": 4.0, "review_text": "If you're a fan of the '60's TV cult classic The Prisoner or of the \"government conspiracy\" episodes of The X-Files or of the more recent Orwellian drama Person Of Interest then you'll probably enjoy this book.A brief plot summary: Jeremy O'Keefe, an overeducated, uncommonly introspective, middle-aged academic, who by his own insistence is an ordinary man of no great note or accomplishment, is under surveillance. Packages begin arriving at his Manhattan apartment, the contents of which lead him to believe his computer has been hacked, his phones have been tapped, and cameras, possibly in drones or satellites, have been tracking his every move for years. Every time he looks out the window he thinks he sees someone on the street below watching his apartment, and he keeps encountering a mysterious young man at odd times and locations, maybe by coincidence or maybe not, whom he has no recollection of ever having met before but who seems to know him. Someone is calling his mother, who lives in a rural town upstate, with stories of embarrassing incidents from his past. He even comes to believe that whatever success he has had in his career as a history professor, previously at Oxford University in England and now at NYU, is the result not of his own effort and talent but of the influence of some powerful outside agency. Is he paranoid, delusional, crazy? His daughter, son-in-law, and ex wife are beginning to think so, and he toys with the possibility himself at length. But it gradually becomes evident to the reader that despite his constant self deprecating humble bragging the good professor may not be quite as ordinary or innocent as he would have you believe.The author of this novel, despite his penchant for turgid, convoluted, rambling prose replete with endless sentences stuffed with multiple levels of subordinate clauses, parenthetical digressions, and untranslated Latin and French aphorisms, has managed to craft a pretty good mystery story. Written in the first person narrative style from the point of view and perhaps fevered brain of the main character, it's especially relevant and relatable given all the news these days about how ordinary people are being affected by computer hacking, identity theft, government surveillance, loss of privacy, etc. One unusual narrative technique I particularly liked was how the author gradually and ever so casually reveals aspects of his protagonist's character and his past that cumulatively add up to explain why he might be under such oppressive surveillance. These little expository nuggets are slipped in every ten or twenty pages or so, usually in an uncommonly brief sentence or two at the conclusion of some long-winded recounting of current or past events in the professor's life ostensibly intended to show just how unremarkable his life is and has always been. The ending, at which point (almost) all of the reader's and the professor's questions are answered, is something of a letdown, as it is exactly the ending that's been hinted at throughout the book -- no M. Night Shyamalan twist here. But all in all, an enjoyable as well as a bit unsettling book -- could what happened to the I-Am-No-One [special] professor indeed happen to anyone?"}, {"review_sentiment": 4.0, "review_text": "Interesting, well-written examination of fear and paranoia in the age of constant surveillance. The ending is a little rushed, but I suspect from the negative reviews that many readers didn't understand the implications of what transpired. Not a fast-paced thriller, but a powerful character study and ominous, kafkaesque look at the panopticon in which we live."}]}, "authors": ["Patrick Flanery"], "isbn": "1101905859", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "I Am No One", "word_cloud": "give honest unbiased short sweet version review college history professor begin become paranoid day go due box come doorstep picture online activity phone record successful daughter attempt reconnect due thriller fantastic dialogue spy galore first unsure finish concept satisfy thriller generally cup tea worry fantastic enjoy thriller mystery genuinely enjoy enjoy much wish someone enjoy thriller sure lover thriller mystery look figure choice particular reader yet everyone attempt someday today day give star reading decade teach abroad back return begin receive delivery suspicious box fill paperwork online activity discover follow city result try figure do target nefarious act begin discover really write point view get crawl inside head see make tick somewhat boring individual nothing really exciting say nonetheless still find fairly likable exciting expect still find interested enough keep reading wordy sometimes protagonist seem ramble unimportant detail find dull thought interest enough keep reading find able relate basic way sure perhaps author inside head find relate human level flaw individual think bad think also historian spent last decade shuttle open back accept new position hop spend time daughter remain stateside mother go abroad adult married rich powerful man career enjoy spending time share perk life day student show appointment base exchange package arrive messenger indicate life become open go bit mad billed thriller consist primarily wonder happen pondering do happen inner dialogue long essay anything else title indicate really interest bit piece together mystery anyone interested security risk give appear bit unreliable narrator bad exactly thriller lead take awhile worth effort protagonist move back long sojourn teach not long move begin see evidence someone watching is government be someone upset wrong follow evaluation look life try decipher reason someone spotty overall intriguing enjoyable tone excellent author seem comfortable plot frustrate first person narrator academic year return nyc teach begin think follow strange thing start someone send box fill account website ever visit first narrator paranoid thing really happen nothing ever really resolve author follow random person stew introspective character study manged keep tension ultimately enough happens guess suppose ironic expert german history surveillance clueless modern day privacy issue find far fetched long passage smart well write grow tired give star great smart psychological thriller rumination current state privacy narrator college professor return long stint open something odd happen involve email odd trouble thing continue happen bit unreliable narrator reluctant tell whole story progress slowly peel away layer onion potentially thing happen include lot rumination consideration lot action dialogue true page turner find fascinating enjoy obviously minority review adore everything light entertainment leisurely intrepid original place much form demand yet utter delight pick page word usage imagery tickle brain lazy summer afternoon main story good really set apart descriptive tangent reader seem resent adore ramble nuanced musing life mental health travel felt authentic real very much read old fashion letter diary entry someone know realism combine twisted story line make pure enjoyment fan tv cult classic government conspiracy episodes recent orwellian drama probably enjoy brief plot summary over educated uncommonly introspective academic insistence ordinary man great note accomplishment surveillance begin arrive apartment content lead believe computer hack phone tap camera possibly drone satellite track move year time look window think see someone street watch apartment keep encounter mysterious young man odd time location maybe coincidence maybe recollection ever meet seem know call mother live rural town upstate story embarrass incident even come believe success career history professor previously result effort talent influence powerful outside agency paranoid delusional crazy daughter ex wife begin think toy possibility length gradually become evident constant self deprecate humble brag good professor ordinary innocent penchant turgid convolute ramble prose replete endless sentence stuff multiple level subordinate clause parenthetical digression untranslated french aphorism manage craft pretty good mystery story first person narrative style point view perhaps fevered brain main character especially relevant repeatable give news day ordinary people affect computer hack identity theft government surveillance loss privacy unusual narrative technique particularly like author gradually ever casually reveal aspect protagonist character cumulatively explain surveillance little expository nugget slip ten twenty page usually uncommonly brief sentence conclusion recount current past event professor life ostensibly intend show unremarkable life always end point almost professor question answer something letdown exactly end hint twist enjoyable well unsettle special professor indeed happen anyone interest examination fear paranoia age constant surveillance end little rushed suspect negative review many reader understand implication transpire not thriller powerful character study ominous kafkaesque look panopticon live", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A mesmerizing novel about memory, privacy, fear, and what happens when our past catches up with us.\r\n\r\nAfter a decade living in England, Jeremy O'Keefe returns to New York, where he has been hired as a professor of German history at New York University. Though comfortable in his new life, and happy to be near his daughter once again, Jeremy continues to feel the quiet pangs of loneliness. Walking through the city at night, it's as though he could disappear and no one would even notice.\r\n\r\nBut soon, Jeremy's life begins taking strange turns: boxes containing records of his online activity are delivered to his apartment, a young man seems to be following him, and his elderly mother receives anonymous phone calls slandering her son. Why, he wonders, would anyone want to watch him so closely, and, even more upsetting, why would they alert him to the fact that he was being watched? \r\n\r\nAs Jeremy takes stock of the entanglements that marked his years abroad, he wonders if he has unwittingly committed a crime so serious that he might soon be faced with his own denaturalization. Moving towards a shattering reassessment of what it means to be free in a time of ever more intrusive surveillance, Jeremy is forced to ask himself whether he is 'no one', as he believes, or a traitor not just to his country but to everyone around him.", "asin": "1101905859", "rank": "620838", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/41bCCeGmHOL.jpg", "country": "", "story_arc": ["Tragedy", "Things only get worse"]}