{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 17575, "rating": 4.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Best book I've ever read"}, {"review_sentiment": 5.0, "review_text": "On a scale of 1-10, I will definitely rate this book a 10. First, reading this book helps me to experience the suffering of the Jews, to understand the injustice of the society under Hitler, and to realize the hope and power of words. Second, this book was written in the perspective of Death who takes people’s soul after they died, it was interesting to see the perspective of Death in narrating this story. For these two aspects, I think this novel definitely deserves a 10. And I would like to recommend this awesome novel to everyone."}, {"review_sentiment": 5.0, "review_text": "Couldn't stop reading it! Great writing! Short and to the point! Made the book extremely manageable to read over a few days!"}, {"review_sentiment": 5.0, "review_text": "Great book and service!"}, {"review_sentiment": 5.0, "review_text": "Highly recommend this one....i love books about European history. ...but sometimes a little more imagination  is nice. And i love reading books that mention places i recognize and have been to."}, {"review_sentiment": 5.0, "review_text": "This is my 3rd WWII book in the past year, and my favorite so far. Poetic, heartwarming and heartwrenching all at once. I appreciate books like this that help history truly come to life so it feels more real to me."}, {"review_sentiment": 5.0, "review_text": "Every human needs to read this book. It is about Life. Beauty. Joy. Horror. Fear. Pain. Most of all, The Book Thief is about LOVE. If I were still a teacher of middle schoolers on up, I would read this book to my students and we would cry together and be bonded in our common humanity forever."}, {"review_sentiment": 4.0, "review_text": "Thought provoking. An interesting approach to the historical truths that we already know. Well drawn characters keep the reader involved."}, {"review_sentiment": 4.0, "review_text": "I genuinely really liked this book. It was from a different perspective and that made it very interesting to read! It was however really slow to start, but overall great. The ending wasn't what I thought it would be; definitely a great read for anyone :)"}, {"review_sentiment": 5.0, "review_text": "Spoiler:  This book had me crying at the end! the author does such an amazing jod writing this book and I became so attached to the characters that when they all die it broke my heart a little. When your reading this book you feel like your in Germany, playing soccer, watching books burn, and stealing and eat apples with all the charachers. I also loved the odd perspective the whole book was writen in. Best author ever(besides jennifer a. nelson and Carolyn meyer and lois lowry)"}]}, "authors": ["Markus Zusak"], "isbn": "1101934182", "longitude": 0.0, "periods": ["1900s", "Recent Releases"], "title": "The Book Thief", "word_cloud": "best ever scale definitely rate reading help suffer understand injustice society realize hope power word write perspective take people soul die interesting see perspective narrating story aspect think definitely deserves awesome everyone read write point extremely manageable day service recommend love european history sometimes little imagination nice reading mention place recognize year favorite far poetic heartwarming heart wrenching appreciate help history truly come life feel real human need most still teacher middle schooner student together bonded common humanity forever provoke interesting approach historical truth already know drawn character keep involved genuinely really like different perspective make interest however really slow start overall great end think definitely great anyone spoiler cry end author amaze hod write become attached character die break heart little read feel play soccer watch burn steal eat apple character also love odd perspective whole write author ever besides jennifer nelson meyer soil lorry", "genres": ["Fiction & Literature", "Historical Fiction", "WWII", "Young Adult"], "summary": "The extraordinary #1 New York Times bestseller that is now a major motion picture, Markus Zusak's unforgettable story is about the ability of books to feed the soul.\r\n\r\nIt is 1939. Nazi Germany. The country is holding its breath. Death has never been busier, and will become busier still.\r\n\r\nLiesel Meminger is a foster girl living outside of Munich, who scratches out a meager existence for herself by stealing when she encounters something she can’t resist–books. With the help of her accordion-playing foster father, she learns to read and shares her stolen books with her neighbors during bombing raids as well as with the Jewish man hidden in her basement. \r\n\r\nIn superbly crafted writing that burns with intensity, award-winning author Markus Zusak, author of I Am the Messenger, has given us one of the most enduring stories of our time.", "asin": "1101934182", "rank": "6056", "city": "", "image": "https://images-na.ssl-images-amazon.com/images/I/51LoESiMnmL.jpg", "country": "", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}