{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 45.4972159, "ratings": {}, "authors": ["Gwethalyn Graham"], "isbn": "1131710487", "longitude": -73.6103642, "periods": ["1900s"], "title": "Earth and High Heaven", "word_cloud": "", "genres": ["Fiction & Literature"], "summary": "During the summer of 1942, at a time when the world was already embroiled in the Second World War, twenty-eight-year-old Erica Drake meets Marc Reiser at a garden party. Though the two develop an interest in one another from the start, a seemingly insurmountable rift exists between them—Erica is a Gentile, while Marc is Jewish. However, as their attachment to one another deepens, they soon choose to face the disapproving arguments of their parents as well as their own prejudices.\r\n\r\nEarth and High Heaven was one of the most highly acclaimed and popular books of its time. Published at the end of the Second World War, it won the Governor General’s Award and was the first Canadian novel to reach number one on The New York Times Bestseller list.\r\n\r\n\"In a country that barely remembers its prime ministers, it's hardly surprising that one of CanLit's brightest early stars is almost forgotten. But Cormorant Books' reprint of the 1944 novel Earth and High Heaven should bring back to prominence the extraordinary Gwethalyn Graham, who published two novels in her short life (1913 to 1965) and won the Governor General's award for both. Set against the opening years of the Second World War, Earth and High Heaven is a blistering attack on bigotry. It turns on the intense psychological conflict that erupts between father and daughter after the Westmount WASP woman falls in love with a Jew from an Ontario mining town. (The plot was drawn directly from Graham's own unhappy life: after two failed marriages, her love affair with a Jewish man was derailed when Graham's father refused to meet him.) The novel was in international success, translated into 18 languages and topping American bestseller lists.\" Macleans", "asin": "B000NXH9G2", "rank": "2638013", "city": "Montreal", "image": "https://images-na.ssl-images-amazon.com/images/I/41ErUJKjxsL.jpg", "country": "Canada", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}