{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 37.7792808, "ratings": {"num_ratings": 2300, "rating": 4.1, "reviews": [{"review_sentiment": 3.0, "review_text": "As someone who has worked at Google, I don't think I was the target audience for this book. I enjoyed the mystery that wound through the book, the way it read like an old time fantasy while set in modern times. However the modern times were not remotely accurate. I kept getting broken out of the narrative by some of the ridiculous plot points that wound through the book. The way the author wrote about both Google and the unbroken spine felt half impressed and half mocking. The whole \"We're a company that makes boobs\" was such a completely awful joke that made me cringe every time it was brought up, which was often. The main character was a Mary Sue who had the solutions to everything, through no actual accomplishment of his own. He used the people around him and never really stopped to question what impact his actions could have on those people. I did not like the main character and so struggled to like the rest of the book.If you like intriguing mysteries set in modern times, this is a good book. If you like fully fleshed characters and even vaguely accurate technical references, I would maybe stay away."}, {"review_sentiment": 4.0, "review_text": "Felt a little like a young adult novel to me (perhaps it is and I missed seeing that?!). However, the story was interesting and took enough turns that I could not guess where it would end up. Enjoyable."}, {"review_sentiment": 4.0, "review_text": "It took about 50 or so pages to get into it, but the book was well worth it.  History, mystery, technology, secrets, and quests!!  It was all woven together for a good read!"}, {"review_sentiment": 5.0, "review_text": "Finally a book that captured my attention after a long period of starvation, starting and not finishing several novels. Sloan created a captivating story colliding contemporary and anachronistic elements with a dash of enthusiasm and mystery. It's like a cake so delicious  that you always wish you could have another piece of."}, {"review_sentiment": 5.0, "review_text": "I was utterly charmed from the first pages and by the time I'd finished, the charm had grown to complete adoration! The protagonist's voice was refreshingly bright with humor and optimism. In some ways, I found the novel to be a kind of crossroads of Neil Gaiman's quiet storytelling and Umberto Eco's Foucault's Pendulum—with a much happier ending."}, {"review_sentiment": 5.0, "review_text": "I kept seeing this book but always grabbed something else. Super glad I picked it up this time.  Absolutely delightful!"}, {"review_sentiment": 2.0, "review_text": "The ending sucked. The cover is the only cool thing"}, {"review_sentiment": 4.0, "review_text": "An insight to how technology can unravel time old secrets in a very short time."}, {"review_sentiment": 5.0, "review_text": "Smart; well done. Loved learning more about technology."}, {"review_sentiment": 5.0, "review_text": "A wonderful modern fantasy that will tickle your fancy!“Mr. Penumbra’s 24-Hour Bookstore” is a delightful trip into an unexpected world you may think could only exist in film.  Robin Sloan has crafted it with a lively wry imagination and thoughtful way with words – a feast for readers.The story unfolds in a city made for adventures, San Francisco.  Even as the downtown area is dwarfed by high-rises and the surrounds are consumed by voracious tech office parks, the author reveals a more twisty neighborhood with mysterious figures scurrying about.An out-of-work programmer, desperately in need of income, Clay Jannon, answers a “Help Wanted” ad looking for a late shift clerk at a 24-hour bookstore. He discovers the long, narrow building squeezed next to another store, Booty’s, with neon legs that cross and uncross.Once he enters, he finds shelves stretching up almost three stories like “an old Transylvanian forest, a forest full of wolves and witches and dagger-wielding bandits all waiting just beyond moonlight’s reach.”  If anything could describe library “stacks”, this bookstore embodies it. The store symbol – “ two-hands perfectly flat, rising out of an open book” – embellish the front window.Clay meets the unassuming older gentleman, Mr. Penumbra, who introduces himself: “I am Penumbra, and I am the custodian of this place.” And as he hints after a brief exchange: “Prior experience in the book trade is of little use to you here.”Despite the store and its owner curious appearance, Clay is predisposed to this world since he and his earliest friends have long been avid followers of “The Dragon-Song Chronicles”, a sort of Tolkien fantasy. It is one Penumbra is familiar with as well.Clay takes the job, essentially the graveyard shift, and quickly finds out the bookstore has a clientele that are slightly odd and apparently on some kind of mission to make sense of books seemingly written in an unfathomable code.At the heart of the riddle is an actual historical figure, Aldus Manutius, a fifteenth century printer who created the Aldine press, and his timeless typeface, Gerritszoon, fashioned by his assistant and partner, Francesco Griffo. Although the typeface is fictional, it may be a teasing reference to Garamond.Working with a coterie of roommates, friends and other odd acquaintances, Clay joins the mysterious chase for whatever it is that is driving the bookstore patrons.  He enlists the help of a Google princess, Kat, young, attractive and totally obsessed with her Google career path.And the tale moves from San Francisco to New York City and back. There are some dark encounters with a black-robed cult reminiscent of Umberto Eco’s 1980 classic novel, “The Name of the Rose”, and a wonderful send up of Google devotees and their campuses.One very funny scenario takes place toward the end at the Consolidated Universal Long-Term Storage facility in Nevada where the answer to the mystery may be held.  And without as much as a blink of an eye or spelling it out, Sloan leaves the reader to work out the acronym.“Mr. Penumbra’s 24-Hour Bookstore” is a combination of fantasy and humor that reminds me of a whimsical 1932 film, “Love Me Tonight,” with Maurice Chevalier and Jeanette MacDonald– a place where fantasy and reality mix and get along together just fine."}]}, "authors": ["Robin Sloan"], "isbn": "1250037751", "longitude": -122.4192363, "periods": ["2000s", "Recent Releases"], "title": "Mr. Penumbra's 24-Hour Bookstore: A Novel", "word_cloud": "someone work think target audience enjoy mystery wound way old time fantasy set modern time however modern time remotely accurate keep get broken narrative ridiculous plot point wind way author write unbroken spine felt half impressed half mock whole company make boob completely awful joke make cringe time bring often main character solution everything actual accomplishment use people never really stopped question impact action people like main character struggle like rest intrigue mystery set modern time good fully flesh character even vaguely accurate technical reference maybe away little young adult perhaps miss see however story interesting take enough turn enjoyable take page get well worth mystery technology secret quest woven together good finally capture attention long period starvation start finishing several novel create captivate story collide contemporary anachronistic element dash enthusiasm mystery cake delicious always piece utterly charm first page time finish charm grown complete adoration protagonist voice refreshingly bright humor optimism way find kind crossroad quiet storytelling much happier end keep see always grab something else glad pick time absolutely delightful end suck cover cool thing insight technology unravel time old secret short time well do learn technology wonderful modern fantasy tickle fancy delightful trip unexpected world film craft lively wry imagination thoughtful way word feast story unfolds city make adventure even downtown area dwarfed surround consume voracious tech office park author reveals twisty neighborhood mysterious figure scurry programmer desperately need income answer want ad look late shift clerk discover long narrow build squeeze next store neon leg cross enters find shelf stretch almost story old transylvanian forest forest full wolf witch bandit wait moonlight anything library stack embodies store symbol perfectly flat rise open embellish front meet unassuming older gentleman introduce custodian hint brief exchange experience trade little use store owner curious appearance predispose world earliest friend long avid follower sort fantasy familiar take job essentially graveyard shift quickly find bookstore clientele slightly odd apparently kind mission make sense seemingly write unfathomable heart actual historical figure fifteenth century printer create press timeless typeface fashion assistant partner typeface fictional tease coterie roommate friends odd acquaintance join mysterious chase drive bookstore patron enlist help princess young attractive totally obsessed career tale move back dark encounter cult reminiscent classic name wonderful send devotee funny scenario take place end facility answer mystery much blink eye spell leave work combination fantasy humor remind whimsical film place fantasy reality mix together fine", "genres": ["Fiction & Literature", "Fantasy"], "summary": "A Winner of the Alex Award, a finalist for the Los Angeles Times Book Prize for First Fiction, named a Best Book of the Year by NPR, Los Angeles Times, and San Francisco Chronicle\r\n\r\nThe Great Recession has shuffled Clay Jannon away from life as a San Francisco web-design drone and into the aisles of Mr. Penumbra's 24-Hour Bookstore. But after a few days on the job, Clay discovers that the store is more curious than either its name or its gnomic owner might suggest. The customers are few, and they never seem to buy anything―instead, they \"check out\" large, obscure volumes from strange corners of the store. Suspicious, Clay engineers an analysis of the clientele's behavior, seeking help from his variously talented friends. But when they bring their findings to Mr. Penumbra, they discover the bookstore's secrets extend far beyond its walls. \r\n\r\nRendered with irresistible brio and dazzling intelligence, Robin Sloan's Mr. Penumbra's 24-Hour Bookstore is exactly what it sounds like: an establishment you have to enter and will never want to leave.", "asin": "1250037751", "rank": "7645", "city": "San Francisco", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZM0Qn6EbL.jpg", "country": "United States of America", "story_arc": ["Tragedy", "Things only get worse"]}