{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.8755546, "ratings": {"num_ratings": 50, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "I LOVED it! Brian puts the reader into his world, where you feel you are a resident of the apartment complex. You are filled with questions throughout and a sadness that Brian is gone and can no longer answer any of your questions. I am thankful I read this on my Kindle, so I can look up the vocabulary Brian uses...words I've never come  across or did not know their meaning. He will be missed."}, {"review_sentiment": 5.0, "review_text": "I really, really liked Chicago by Brian Doyle.  I am familiar with Chicago, so it made the book come alive.  Doyle is an amazing writer.  He is very detail oriented, so at the end of the description you know exactly what he is talking about - it is like you are there.  I kept forgetting that Edward is a dog as he writes as if he is a person.  My first introduction to B Doyle was Mink River - another amazing book.  Thanks again to my wonderful cousin for introducing me to Doyle.I highly recommend Chicago to readers who like:  very descriptive writing, well written and well researched stories, Chicago, great fiction, and amazing use of words."}, {"review_sentiment": 5.0, "review_text": "I was enthralled while reading this book and keep it by my bed so I can re-read portions of it for inspiration. Brian Doyle created a fictional world where miraculous and ordinary things are coexist seamlessly, and he nails the goodness that is at the core of Chicagoans. It's the first work of Brain Doyle's I've run across and has so much heart. I lived in Chicago as a very young child and again as a young adult, and it was a wonder for me to read a novel that recaptures so much of the inner life of the city as it was in the 1970s."}, {"review_sentiment": 1.0, "review_text": "Wonderfully evocative novel about Chicago. Plot-wise it's just an account of five years living here, but in terms of nuance, fabulous vignettes and the overall feel of this book, it is a must for every Chicagoan, former Chicagoan and would-be Chicagoan. I loved it."}, {"review_sentiment": 5.0, "review_text": "thought it was a fun and quirky read"}, {"review_sentiment": 5.0, "review_text": "I enjoy Brian Doyle's writing so much. I've now read theee of his novels. Sorry he is gone and we can no longer look forward to a new book from this master."}, {"review_sentiment": 5.0, "review_text": "I love Brian Doyle's prose. His combination of mystery and hard reality is a joy to read."}, {"review_sentiment": 3.0, "review_text": "I don't know Chicago well and it would be a good read if you were going there."}, {"review_sentiment": 5.0, "review_text": "Loved the book!  Brian Doyle has a truly original voice!  No one else would make believeable people and a dog as equals."}, {"review_sentiment": 5.0, "review_text": "I absolutely loved this memoir by the fabulous Brian Doyle. Will sorely miss his luminous writing! RIP Brian."}]}, "authors": ["Brian Doyle"], "isbn": "1250118123", "longitude": -87.6244212, "periods": ["2000s", "Recent Releases"], "title": "Chicago: A Novel", "word_cloud": "love put world feel resident apartment complex fill question sadness go longer answer question thankful look vocabulary use word never come know mean miss really really liked familiar make come alive amazing writer detail oriented end description know exactly talk keep forget dog write person first introduction amazing wonderful cousin introduce highly reader descriptive write well write well researched story great fiction amaze use word enthral read bed portion inspiration create fictional world miraculous ordinary thing coexist seamlessly nail goodness core first work run across much heart live young child young adult wonder recapture much inner life city wonderfully evocative account year live term nuance fabulous vignette overall feel former love think fun quirky enjoy brian write much three novel go longer forward new master love brian combination mystery hard reality joy know well go love brian truly original voice one else believable people dog equal absolutely love memoir fabulous sorely miss luminous write", "genres": ["Fiction & Literature"], "summary": "On the last day of summer, a young college grad moves to Chicago and rents a small apartment on the north side of the city, by the lake. This is the story of the five seasons he lives there, during which he meets gangsters, gamblers, policemen, a brave and garrulous bus driver, a cricket player, a librettist, his first girlfriend, a shy apartment manager, and many other riveting souls, not to mention a wise and personable dog of indeterminate breed.\r\n\r\nA love letter to Chicago, the Great American City, and a wry account of a young man’s coming-of-age during the one summer in White Sox history when they had the best outfield in baseball, Chicago is a novel that will plunge you into a city you will never forget and may well wish to visit for the rest of your days.\r\n\r\n“This coming-of-­age novel follows a young grad student who moves to the city and meets a wide cast of colorful characters during his five-­season stay. Described as ‘a love letter to Chicago,’ Doyle's novel takes us back to a Chicago of years ago that feels both foreign and familiar.” Chicago Tribune\r\n\r\n", "asin": "1250118123", "rank": "38672", "city": "Chicago", "image": "https://images-na.ssl-images-amazon.com/images/I/51EkSnX-UeL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}