{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 49.262428, "ratings": {"num_ratings": 45, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "The Atlas of LoveLaurie Frankel’s The Atlas of Love takes us into the lives of Jill, Janey, and Katie, three graduate students balancing teaching, writing, coursework, and their personal lives…in that order.When Jill becomes pregnant, she is shocked to learn that the father wishes to terminate the pregnancy. Her friends rally around her, moving mountains to create a life that includes Jill’s baby. In an arrangement that could only work through youthful optimism, these women parent the child together in a loving home. All the while, Katie, a devout Mormon, prays for the love of her life to present himself. Her dubious friends mock her optimism, tolerating her religious fervor.All playdates must end, and it is cruel maturity that forces a change in the child’s world. One can no more fault Frankel for creating this beautiful setting, than for being the force to shake it to its core, leaving the child at the mercy of his caregivers. No animals or children are harmed during the writing of this novel, but tears are shed and attachments are stretched. Refreshingly, it is Katie whose adherence to her own truth remains constant while her friends work their way through early adulthood.In the spirit of This is How It Always Is, Frankel creates settings and characters facing obstacles several steps beyond the usual norms. All the while, she carefully folds them into beautiful prose."}, {"review_sentiment": 5.0, "review_text": "This is one of the best novels that I have read in a long time! The narrator, Janey, is one of the kindest, most generous person one is likely to encounter in fiction or real life. A graduate student working towards her PhD in English lit, she tries to make sense of the twists and turns of her very complicated life through her understanding of the structure of literature, specifically the art of storytelling. Now I have made it sound boring, but it is anything but boring! Her tight group of friends and family and her devotion to them (even though there is one self-centered stinker who doesn't deserve Janey's care), and the unusual and tight plot kept me glued to my iPad. This is a book that I will be buying for friends at Christmas!"}, {"review_sentiment": 5.0, "review_text": "Fell in love with the characters in this book, and fell in love with the way Laurie Frankel writes.  I was so sorry to have the book end.  This was the first Laurie Frankel book I have read, and have purchased two other books of hers and am reading them now.  I have also recommended this book to several of my friends who love to read as much as I do.  I adored this book.  Thank you, Laurie Frankel, for telling this story."}, {"review_sentiment": 4.0, "review_text": "great read! wold recommend this book."}, {"review_sentiment": 5.0, "review_text": "Perfect quick read... left me laughing and yet shedding a few tears!"}, {"review_sentiment": 5.0, "review_text": "loved that this story has as its main characters graduate students in an English Ph.D. program.  Lots of inside jokes to enjoy.  Witty.  Charming."}, {"review_sentiment": 2.0, "review_text": "I loved the idea for this book : several unrelated people raising a baby together. And I loved the writing and the characters. They're educated, witty, compassionate. On many levels the book delivered.But. To me there was a huge problem which quickly prevented me from getting immersed in the story, and it was that Atlas was completely not believable as a baby. Whereas some novels made me laugh with their very realistic descriptions of motherhood, this one didn't even come close. I'm a mother and I kept wondering : where are the interrupted nights and the exhaustion of the first months? What about all those times you feel like you have no clue at all?  what about the all-consuming emotional rollercoaster? These aspects may be mentioned in passing but I never felt they came alive. I felt the girls were mere babysitters. The lack of realism in this respect pretty much ruined the book for me."}, {"review_sentiment": 2.0, "review_text": "I guess I'm the minority but I just couldn't help but feel that the plot felt forced and the characters a bit contrived.  I had read another Laurie Frankel novel which I loved and was hoping this would be as good but was disappointed"}, {"review_sentiment": 4.0, "review_text": "I thought this was a really good book. I get tired of heavy serious books and also of \"chic lit\" that gets ridiculous. I really enjoyed this book although right from the start I knew there would be issues with their arrangement which proved to be true. I HATED the Jill character, did not like 1 single thing about her and didn't understand why nice Janey and Katie would be friends with her or turn their whole lives upside down for her!"}, {"review_sentiment": 3.0, "review_text": "The author covers all her bases: There's the protagonist, the Mormon friend, the gay couple, the straight guys/boyfriends who fear commitment, and the single mom expecting the baby who brings everyone together.All the stereotypes have been included. Friendship trumps marriage and family. Every. Single. Time. Two men who can't conceive deserve our respect and sympathy while the virgin Mormon should be grateful someone values her uterus. The baby on the cover is just a plot device.The setting is Seattle but could take place anywhere, even Vancouver Canada.Told in first person point of view, it would've been nice to get inside some of the other character's heads as first person works better in juvenile/teen lit, not adult. These characters are not in ninth grade but they may as well be. The protagonist, Jane, isn't pregnant, her best friend Jill is. The two graduate students pick up a stray Mormon named Katie and decide to form a family with the two single ladies doing all the sacrificing while Jill sits back and rests on her entitlement issues. Single mothers have all the luck.The author clearly did her homework about Mormon Feminists: skittish about pre-marital sex while non-committal make outs are totally fine, no drinking, frequent dating (apparently Seattle is swarming with straight, single LDS guys who don't equivalate dating with sex) completely supportive of the gay lifestyle but heaven forbid a Mormon should go shopping and spend money on Sunday! Katie also has no qualms about the occasional sleeping in the same bed with her two besties. All that's missing here is a vibrator.The three ladies decide to buy a house and raise the baby, together. Katie has a date every Friday and sees her situation as temporary while Jane cooks, cleans and babysits when she's not teaching at the college. This lasts for several chapters. A grandmother battles cancer and the baby gets sick while the three main characters argue over how to define their relationship and the story starts to drag.Katie, who served an LDS mission, is planning her wedding to be held in somebody's backyard because the temple in Utah is too far away and her \"family\" will be left out. (Um, Seattle has a Mormon temple too) Jane has a potential relationship forming while Jill might get back together with the baby's father who deserted her.There no sex, some mild swearing (the f-bomb is dropped a few times, that's all) and the story is cute but hardly worth revisiting since the characters are not believable or consistent. Nobody changes or grows as a result of their conflicts because there is no conflict. A single woman expecting a baby is not a conflict, it's an event that contributes to the story which is very weak. A quick read and enjoyable but hardly worth purchasing. Borrow it from the library or one of your \"besties\" like I did."}]}, "authors": ["Laurie Frankel"], "isbn": "125011666X", "longitude": -123.11554, "periods": ["2000s", "Recent Releases"], "title": "The Atlas of Love", "word_cloud": "take live graduate student balance teach write coursework personal become pregnant shock learn father wish terminate pregnancy friends rally move mountain create life include baby arrangement youthful optimism woman parent child together love home prays life present dubious friend mock optimism tolerate religious playmate cruel maturity force change child world fault create beautiful set force shake core leave child mercy caregiver animal child harm write tear shed attachment stretch refreshingly adherence truth remain constant friend work way early spirit how be create setting character face obstacle several step usual norm carefully fold beautiful prose best novel long time narrator kindest generous person likely encounter fiction real life graduate student work towards lit try make sense twist turn complicated life understanding structure literature specifically art storytelling now make sound bore anything bore tight group friends family devotion even stinker deserve care unusual tight plot keep glue buy friend character fell way write sorry first purchase reading also recommend several friend much adore tell story great wold recommend quick leave laugh yet shed tear love story main character graduate student english program joke enjoy love idea several unrelated people raise baby together love write character educate witty compassionate many level huge problem quickly prevent get immersed story completely believable baby novel make realistic description motherhood even come close mother keep wonder interrupted night exhaustion first month time feel clue emotional roller coaster aspect pass never felt come alive felt girl mere babysitter lack realism respect pretty much ruin guess minority plot felt force character bite contrived love hop disappointed think really good get tired heavy serious also chic lit get ridiculous really enjoy right start know issue prove true hat character single thing understand nice turn whole life upside author cover base protagonist friend gay couple straight fear commitment single mom expect baby brings everyone stereotype include trump marriage family men deserve respect sympathy virgin grateful someone value baby cover plot set place anywhere even first person point view inside character head first person work better lit adult character ninth grade protagonist pregnant best friend graduate student pick stray name form family single lady sacrifice sit back rest entitlement issue mother author clearly homework skittish sex make out totally fine drinking frequent date apparently swarm straight single guy equivalate date sex completely supportive gay lifestyle heaven forbid go shop spend money also qualms occasional sleep bed bestirs miss lady decide house raise baby together date see situation temporary cook clean babysits teach college last several chapter a grandmother battle cancer baby get sick main character argue define relationship story start serve mission plan wed hold somebody backyard temple far away family leave temple potential relationship form back together baby father desert sex mild swearing drop time story cute hardly worth revisit character believable consistent nobody change grow result conflict conflict single woman expect baby conflict event contribute story weak quick enjoyable hardly worth purchase library bestirs", "genres": ["Fiction & Literature", "Women's Fiction"], "summary": "When Jill becomes both pregnant and single at the end of one spring semester, she and her two closest friends plunge into an experiment in tri-parenting, tri-schooling, and trihabitating as grad students in Seattle. \r\n\r\nNaturally, everything goes wrong, but in ways no one sees coming. Janey Duncan narrates the adventure of this modern family with hilarity and wisdom and shows how three lives are forever changed by (un)cooperative parenting, literature, and a tiny baby named Atlas who upends and uplifts their entire world. \r\n\r\nIn this sparkling and wise debut novel, The Atlas of Love, Frankel's unforgettable heroines prove that home is simply where the love is.\r\n“Laurie Frankel displays a great ear for dialogue and a witty turn of phrase in quick characterizations.” The Seattle Times\r\n", "asin": "125011666X", "rank": "68999", "city": "Vancouver", "image": "https://images-na.ssl-images-amazon.com/images/I/41QrqDHXjSL.jpg", "country": "Canada", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}