{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 21, "rating": 2.9, "reviews": [{"review_sentiment": 3.0, "review_text": "In October 2017, the book discussion group had a large and diverse gathering at the LGBT Center in NYC to to discuss \"Black Deutschland\" by Darryl Pinckney.I liked the novel and another reader loved it. A few members of the group couldn't finish it although they found nuggets as they read, but most readers were somewhere in the middle. While I expected some comparisons to James Baldwin's expat novels, \"Black Deutschland\" is all Christopher Isherwood in Berlin, this time with a young African-American man just out of re-hab finding his way in Berlin and the world. Early on, we're reminded that Isherwood says that \"Berlin means boys,\" but it doesn't really happen here. Instead, we get far more work and family drama.A number of readers had a hard time with the dense language and stream-of-consciousness that seemed to be written by a \"coffee-house beatnik,\" as one reader put it. Others agreed that it had too much back-and-forth dithering in time and action. Others were fascinated by the thought processes, the complexity, the clever language, and the quick unannounced changes in time and feelings between multiple trips to Chicago and Berlin. While some found the style \"scattered,\" others thought that it was a great way to tell the story of a fragmented life that's being assembled in front of us. It's definitely a style that requires reading with a certain amount of trust: The time or place may not be obvious at first, but it finally becomes clear and advances the plot. A few readers thought the language consciously used \"mis-direction\" to confuse and make a point rather than just stream-of-consciousness to tell the story.Another point of discussion was the many historical notes inserted throughout the novel. Some found them too pedantic, others found them interesting and erudite. One reader compared them to the blurbs at the tops of chapters used by 19th-century writers to set the scene, enrich the upcoming narrative, and make a peripheral point about something that's happening. An online critic suggested that we read them like marginalia written by the author beside his ongoing story. They're all interesting but tying them to the novel is sometimes hard.Some found the characters flat but there's definitely a lot going on and the small plot pays off. None of us could quite keep all of the narrator's family in Chicago straight but the Berlin characters are largely clear although some of the minor characters at the ChiChi bar and the housing coop aren't as well drawn as they should be. We couldn't quite decide if the architect Rosen Montag was closer to Frank Lloyd Wright or Rem Koolhaas, or a combination of the two.In tone, this novel may best be compared to \"Unnecessary Errors\" by Caleb Crain, which we read last year about a young man coming of age in Budapest during an exciting political period. But all the references to opera, music, and European history were interesting after last month's novel \"The Queen of the Night\" by Alexander Chee.Definitely a mixed review."}, {"review_sentiment": 1.0, "review_text": "Awkward, lumpish sentences and generally amateurish writing. Poor plot, uninteresting characters. A terribly missed opportunity; the author tries to say something profound about so many things and misses all his targets."}, {"review_sentiment": 5.0, "review_text": "Having been born and lived in post war Germany gave me a special understanding of the environment."}, {"review_sentiment": 3.0, "review_text": "I expected more from the text, after listening to Pinckney's conversation with Zadie Smith on SoundCloud.com (New York Public Library)."}, {"review_sentiment": 5.0, "review_text": "A completely masterful telling of a man's expansion of his personal boundaries contrasted in opposing and segregated communities. One isn Chicago and the other Berlin. Poignant, poetic and insightful. An evocative use of the collapse of Soviet wall as metaphor for discovery of human dignity"}, {"review_sentiment": 2.0, "review_text": "The blurbs made this sound like something in the tradition of Isherwood's description of life in Berlin, which I've enjoyed reading and re-reading, but the book was a big disappointment. There's hardly anything about gay life in Berlin at all: even \"ChiChi's,\" the gay bar, turns out to be not even gay any more! It's mostly about how the narrator gets along with his enormous repertoire of relatives (both in Berlin and back home in Chicago). He's a recovering alcoholic and drug addict, but there isn't even much about that aspect of his life other than brief mentions of what AA meetings in Germany are like.This got lots of praise from the literati (in the NYRB, New Yorker, etc.), apparently because of its rather unusual and original style. The narrator constantly jumps around (sometimes in the middle of a paragraph) between what life was like in Chicago, what happened in one or more of his visits to Berlin (the chronology was never clear), what his philosophy of life is, etc. etc.  I guess this is post-modern. In a way, I was reminded of William Burroughs's cut-up technique, though Burroughs makes this work because what he describes is so over-the-top, while the life of Pinckney's narrator is rather pedestrian. While I grudgingly admired what he was trying to do stylistically, all this didn't make things very interesting for the reader. If you're looking for Berlin stories, stick with Herr Issyvoo."}, {"review_sentiment": 2.0, "review_text": "High hopes for an intriguing premise, but Pinckney refuses to ever make a clear declaration or offer connective tissue when he can make an elliptical aside in the middle of a scene.The romance with Duallo could have made for a great novella; the rest is a collection of meandering impressions."}, {"review_sentiment": 3.0, "review_text": "The book tends to focus a great deal on architecture and history , so people who find these boring should avoid it . People who enjoy exposure to a character's thoughts will probably enjoy this book."}, {"review_sentiment": 2.0, "review_text": "Judging from the first few pages presented at Amazon, the narrative in Black Deutschland appears bare-bones thin, the action and dialogue tepid and dry. Darryl Pinckney is a good writer, as far as I can see. However, the endless and irrelevant narrative digressions--not to mention utterly unmemorable characters--make for a very flabby book, one that can not be held together with B- level writing skills. I have found very little in the first 65 pages that would propel me to want to buy it, at least at full price. Perhaps I would buy a used copy at a cheap price or better yet, rent it from the library."}, {"review_sentiment": 3.0, "review_text": "A new subject -- a gay black in Berlin -- and interesting from that point of view.  The style is sometimes incoherent and pretentious and repetitive.  But worth a read for the fresh subject and feeling for place and period."}]}, "authors": ["Darryl Pinckney"], "isbn": "1250117976", "longitude": 13.3888599, "periods": ["2000s", "Recent Releases"], "title": "Black Deutschland", "word_cloud": "discussion group large diverse gathering discuss like love member group found nugget reader somewhere middle expect comparison expat novel time young man find way world remind say mean boy really instead far work family number reader hard time dense language seem write put agree much dither time action fascinate thought process complexity clever language quick unannounced change time feeling multiple trip find style scatter others think great way tell story fragment life assemble front definitely style require read certain amount trust time place first finally become clear advance plot reader think language consciously use confuse make point rather discussion many historical note insert find pedantic others find interest erudite compare blurb top chapter use writer set scene enrich upcoming narrative make peripheral point something happen online critic suggest marginalia write author ongoing story interest tie sometimes find character flat definitely lot go small plot pay none narrator family straight character largely clear minor character bar housing coop well quite architect closer combination tone compare unnecessary error last year young man come age excite political period reference opera music european history interest last month mix review lumpish sentence generally amateurish write plot uninteresting character terribly miss opportunity author try say something profound many thing miss target have bear lived post war give special understanding environment expect text listen conversation completely masterful tell man expansion personal boundary contrast oppose segregated community poetic insightful evocative use collapse wall metaphor discovery human dignity blurb make sound something tradition description life enjoy read big disappointment hardly anything gay life even gay bar turn even gay mostly narrator get along enormous repertoire relative back home recover alcoholic drug even much aspect life brief mention meeting get lot literati etc apparently rather unusual original style narrator constantly jump sometimes middle paragraph life happen visit chronology never clear philosophy life guess way remind technique make work describes life narrator rather pedestrian grudgingly admire try stylistically thing interest look story stick high hope intrigue premise refuse ever clear declaration offer connective tissue make elliptical aside middle romance great novella rest collection meander impression tends focus great deal architecture history people find boring avoid enjoy exposure character thought probably enjoy judge first page present narrative appear thin action dialogue tepid dry good writer far see however endless irrelevant narrative digression mention utterly unmemorable character make flabby hold together level write skill find little first page want buy least full price perhaps use copy cheap price better yet rent library new subject gay interesting point view style sometimes incoherent pretentious repetitive worth fresh subject feel place period", "genres": ["Fiction & Literature", "LGBT"], "summary": "Jed―young, gay, black, out of rehab and out of prospects in his hometown of Chicago―flees to the city of his fantasies, a museum of modernism and decadence: Berlin. The paradise that tyranny created, the subsidized city isolated behind the Berlin Wall, is where he's chosen to become the figure that he so admires, the black American expatriate. Newly sober and nostalgic for the Weimar days of Isherwood and Auden, Jed arrives to chase boys and to escape from what it means to be a black male in America.\r\n\r\nBut history, both personal and political, can't be avoided with time or distance. Whether it's the judgment of the cousin he grew up with and her husband's bourgeois German family, the lure of white wine in a down-and-out bar, a gang of racists looking for a brawl, or the ravaged visage of Rock Hudson flashing behind the face of every white boy he desperately longs for, the past never stays past even in faraway Berlin. In the age of Reagan and AIDS in a city on the verge of tearing down its walls, he clambers toward some semblance of adulthood amid the outcasts and expats, intellectuals and artists, queers and misfits. And, on occasion, the city keeps its Isherwood promises and the boy he kisses, incredibly, kisses him back.\r\n\r\nAn intoxicating, provocative novel of appetite, identity, and self-construction, Darryl Pinckney's Black Deutschland tells the story of an outsider, trapped between a painful past and a tenebrous future, in Europe's brightest and darkest city.\r\n\r\n\"Never without charm . . . The book's form, like its prose, is ambitious, risky . . . The novel is full of wondrous things―several genial character portraits, funny and exact depictions of West Berlin, [and] beautiful evocations of Chicago . . . Despite the gravity of Jed's burdens and dilemmas (race, success, sanity, America, Germany), the book's tone is comic, pleasingly spry, and the prose breaks naturally into witty one-liners [and] perfected wisdom.\" The New Yorker\r\n\r\n", "asin": "1250117976", "rank": "1041493", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/41fyxSkEsKL.jpg", "country": "Germany", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}