{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 256, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "An amazing book. Not for everyone. Mostly historical fact,well researched, but also a tiny bit of fiction (it's filed as such in the library) and some writer's exposition where the author details his own experiences and obsessions in researching and writing the story. I've never read anything like it. I learned some things from the non-fiction part of the story and I think that, if expanded as a fictional novel based on fact it would have been fascinating in that format also.  I suppose the authors own interjections are what would turn people off from this but I found it helped in portraying  the humanity of the characters since the writer cares very deeply about what actually happened. Very unique. Highly recommended. Even the title is fascinating."}, {"review_sentiment": 5.0, "review_text": "Pristine condition. Very happy withy this purchase."}, {"review_sentiment": 5.0, "review_text": "Such a terrific, smart, clever, engaging book, and accurate too. I wouldn't characterize it as historical fiction beçause the history, while delivered in an unorthodox way, is pretty sound, as in identifying facts as separate from fiction. So maybe it's history and fiction, which gets closer to the truth. But perhaps history as fiction really captures it.  I say that because, as someone who has  a better than average knowledge of WWII and the events leading up to it, this book does a great job of covering the facts pertaining to WWII and the \"final solution.\"  For those who don't know much about WWII, this is book is a good start. To top it off, it's a compelling mystery with events rarely covered by standard treatment.  I highly recommend this outstanding book."}, {"review_sentiment": 4.0, "review_text": "Gift for a friend.  He liked this novel."}, {"review_sentiment": 5.0, "review_text": "Highly original approach"}, {"review_sentiment": 5.0, "review_text": "One of the finest books I've ever read"}, {"review_sentiment": 5.0, "review_text": "Once again, I am forced to eat my words.  I used to think that, as a general rule, I do not like these postmodern novels where the author inserts himself into the narrative and blurs the line between memoir and fiction.  Recent books, however, are forcing me to rethink that position.  Ben Lerner used the technique successfully in 10:04 as did Michael Chabon in Moonglow.  Now I find that Laurent Binet has done the same with HHhH.Superficially, this novel shares something with Chabon’s.  Both are essentially works of historical fiction; however, Chabon hues much closer to memoir and he places himself in his novel only rarely.  In HHhH, Mr. Binet is a constant presence in a novel whose main story is one with which he has no direct connection other than a passion for what he wants to tell.  His disconnect leaves us with a novel of two threads: the history, and Binet’s writing of that history.The history here is the story of the assassination of Reinhard Heydrich in Prague by two men, a Czech named Jan Kubis and a Slovak named Jozef Gabcik.  Heydrich is best known as the mind behind the Final Solution as formalized at the Wannsee Conference.  In fact, he was known as one of the most brilliant and ruthless of the Nazis (HHhH = German for “Himmler’s brain is called Heydrich”).  His assassination was the first major takedown of a Nazi elite during World War II and a fascinating story of espionage.As to Mr. Binet’s presence in the novel; well, at first I feared that it was going to be distracting.  Instead, he became a guide.  Helped by the fact that this is not one of the most well-known stories of World War II, we are almost able to participate with Mr. Binet as he conducts his research, chooses what he is going to leave in or throw out, and basically defines for us what he feels an historical novel should be.  It turns out, his view is pretty bland: facts, few reconstructions of conversations, and direct description of action.  Ultimately, it is Mr. Binet’s presence that enlivens what could have been a pretty flat undertaking and drives us through what turns out to be a very interesting tale.In the end, I don’t think my opinion of these “self-aware” novels has much changed.  I can’t see this technique working as a general approach to fiction.  That said, in the hands of a brilliant writer with the right material, it’s a technique that I can’t now deny has its appeals.  Mr. Binet has certainly made the most of it in this wonderful novel."}, {"review_sentiment": 5.0, "review_text": "Great description, accurately researched and mixed with literary, cultural and historical comments. Incredibly well translated into English."}, {"review_sentiment": 1.0, "review_text": "Quit reading after page 89. Facts, fiction, speculation, opinion, judgement ... I had no idea where this author was going and didn't want to waste any more of my time trying to find out. Would have given this book zero stars if I could."}, {"review_sentiment": 3.0, "review_text": "good"}]}, "authors": ["Laurent Binet"], "isbn": "1250033349", "longitude": 14.4212535, "periods": ["1900s", "Recent Releases"], "title": "HHhH", "word_cloud": "amazing not everyone mostly historical fact well research also tiny bit fiction file library writer exposition author detail experience obsession research write story never anything learn thing part story think expand fictional base fact format also suppose author interjection people find help portray humanity character writer care deeply actually happen unique recommend even title fascinating condition happy with purchase such terrific smart clever engage accurate historical fiction history deliver unorthodox way pretty sound identify fact separate fiction maybe history fiction get closer truth perhaps history fiction really capture say someone better average knowledge event lead great job cover fact pertain final solution know much good start compelling mystery event rarely covered standard treatment highly recommend outstanding friend like original approach finest ever once force eat word use general rule like postmodern novel author insert narrative blur line memoir fiction however force rethink position use technique successfully now find laurent do share something essentially work historical fiction however hue much closer memoir place rarely constant presence main story direct connection passion want disconnect leave thread history write history story assassination men name name best know mind formalize fact know brilliant ruthless brain call assassination first major take down elite fascinate story presence well first fear go distract instead become guide fact stories almost able participate conduct research choose go throw basically define feel historical turn view pretty bland fact reconstruction conversation direct description action ultimately presence enlivens flat undertake drive turn interesting end think opinion novel much change see technique work general approach fiction say hand brilliant writer right material technique deny appeal certainly make wonderful description accurately research mixed literary cultural historical comment incredibly well translated reading page fiction speculation opinion judgment idea author go want waste time try give star good", "genres": ["Fiction & Literature", "Historical Fiction", "WWII"], "summary": "A New York Times Book Review Editors' Choice\r\n\r\nHHhH: \"Himmlers Hirn heisst Heydrich,\" or \"Himmler's brain is called Heydrich.\" The most lethal man in Hitler's cabinet, Reinhard Heydrich seemed indestructible―until two exiled operatives, a Slovak and a Czech, killed him and changed the course of history.\r\n\r\nIn Laurent Binet's mesmerizing debut, we follow Jozef Gabcík and Jan Kubiš from their dramatic escape from Nazi-occupied Czechoslovakia to their fatal attack on Heydrich and their own brutal deaths in the basement of a Prague church. A seamless blend of memory, actuality, and Binet's own remarkable imagination, HHhH is at once thrilling and intellectually engrossing―a fast-paced novel of the Second World War that is also a profound meditation on the debt we owe to history.", "asin": "1250033349", "rank": "94887", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/41UkdSJuWjL.jpg", "country": "Czechia", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}