{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 75, "rating": 3.6, "reviews": [{"review_sentiment": 3.0, "review_text": "I enjoyed the main character of Dr. Quirke - pathologist - seems he is in all Mr. Blacks novels.  I was unaware as this was the first book of Benjamin Black's I have read.  The story was well written and had it shares of murders, strange family members, and money."}, {"review_sentiment": 5.0, "review_text": "Just finished the audio book. The reader was fantastic and the book mysterious and very entertaining."}, {"review_sentiment": 4.0, "review_text": "brings you back in time to Dublin in the rare auld times. Excellently written. Quirke is a very complex character. Draws you in to want more."}, {"review_sentiment": 5.0, "review_text": "Love this series.  Wish he would write more."}, {"review_sentiment": 5.0, "review_text": "I love each and every book I read by Benjamin Black and this was no exception!"}, {"review_sentiment": 2.0, "review_text": "My fifth Quirke novel and I was hoping for an improvement over the last one, A Death In Summer.  I did not get the improvement I wanted - more character depth, more plot sophistication, more writing complexity.Black writes very well with engaging words and colorful visual pictures.  But much is missing with his words.All the established Quirke characters appear in the book but none get more than a cursory reference to their inner world.  Mona could  have such dimension to her but all we know is she cheats on her husband and is from South Africa.  And, once again, the plot lacks sophistication and diversity.  Black pulls the reader along like a child in a wagon, sitting passively while traveling slowly from point A to point B until the mystery is solved.From the first there are only four possible perpetrators but none are really explored.  They are lackluster with no excitement in the final resolution.When I started the Quirke series, I was intrigued and excited by the potential of the Quirke character but he has proven to have little intrigue or interest.  The reader knows he likes alcohol too much, cigarettes in abundance and questions his choice in women and only rarely spends any time at his job as a pathologist.Perhaps all I have noted is exactly how Black intended the Quirke series to be.  If so, I should just not bother with the sixth Quirke novel I have waiting on the shelf because I am once again disappointed.  But I wonder, how much of a masochist am I?"}, {"review_sentiment": 5.0, "review_text": "Super book...right to the last paragraph!! Can't wait for the next...will there be one???"}, {"review_sentiment": 1.0, "review_text": "Item was a used library book but product description had not stated this fact.  Nothing is worse than trying to make a marked up library book appear nice on your bookshelf.  So disappointed!"}, {"review_sentiment": 5.0, "review_text": "Love this series"}, {"review_sentiment": 2.0, "review_text": "I read an interview with John Banville, a/k/a Benjamin Black, in which he described how fast he writes his Quirke novels.  It shows.  The writing is just pedestrian -- there is nothing about it that draws the reader into a scene.  The Quirke character is completely one-dimensional, and, like another of the chief characters, Clancy, is a handsome womanizer who can return to a former lover after years away and be greeted with open -- well, everything.  One of the dreariest elements in crime fiction is the inclusion of this male wish-fulfillment trope; it's cheap, easy, and makes it unnecessary for the author to flesh out a relationship.  To me, there was so little here that I felt that the Quirke series was just a money-making ploy for Banville."}]}, "authors": ["Benjamin Black"], "isbn": "1250024188", "longitude": -6.2602732, "periods": ["1900s", "Recent Releases"], "title": "Vengeance: A Novel (Quirke)", "word_cloud": "enjoy main character pathologist seem novel unaware first story well write share murder strange family member money just finish fantastic mysterious entertain brings time rare laud time excellently write complex character want series love exception fifth hop improvement last get improvement want character depth plot sophistication write writes well engage word colorful visual picture much miss establish character appear none get cursory reference inner world cheat husband plot lack sophistication diversity pull child wagon sit passively travel slowly point mystery first possible perpetrator none really explore lackluster excitement final start series intrigue excited potential character proven little intrigue interest know like alcohol much cigarette abundance question choice woman rarely spends time job note exactly intend series bother sixth wait shelf disappoint wonder much masochist right last paragraph wait next one item use library product description state fact worse try marked library appear nice bookshelf so disappointed series interview describe fast writes novel show write pedestrian nothing draw scene character completely chief character handsome womanizer return former year away greet open well everything dreariest element crime fiction inclusion male trope cheap easy make unnecessary author flesh relationship little felt series ploy", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "A bizarre suicide leads to a scandal and then still more blood, as one of our most brilliant crime novelists reveals a world where money and sex trump everything\r\n\r\nIt's a fine day for a sail, and Victor Delahaye, one of Ireland's most successful businessmen, takes his boat far out to sea. With him is his partner's son—who becomes the sole witness when Delahaye produces a pistol, points it at his own chest, and fires.\r\n\r\nThis mysterious death immediately engages the attention of Detective Inspector Hackett, who in turn calls upon the services of his sometime partner Quirke, consultant pathologist at the Hospital of the Holy Family. The stakes are high: Delahaye's prominence in business circles means that Hackett and Quirke must proceed very carefully. Among others, they interview Mona Delahaye, the dead man's young and very beautiful wife; James and Jonas Delahaye, his identical twin sons; and Jack Clancy, his ambitious, womanizing partner. But then a second death occurs, this one even more shocking than the first, and quickly it becomes apparent that a terrible secret threatens to destroy the lives and reputations of several members of Dublin's elite.\r\n\r\nWhy did Victor Delahaye kill himself, and who is intent upon wreaking vengeance on so many of those who knew him?", "asin": "1250024188", "rank": "120741", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/516QsNFiP9L.jpg", "country": "Ireland", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}