{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 778, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "This was a great read. I was transported in time and now want to live in Paris. Couldn’t read it fast enough."}, {"review_sentiment": 3.0, "review_text": "Often to showcase a by-gone era story,  a writer would need a vehicle to bring such story into our time and letting the readers to connect.The trouble begins when the author's heart is so invested in the \"old times\" story, that it eclipses the modern time story and the modern story feels flat in comparison. The modern story drags the whole book down in such cases."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this book and the perspective it gave of turn of the century Paris. It did not turn out as I expected but I liked that."}, {"review_sentiment": 5.0, "review_text": "I was surprised by how much I enjoyed this book. I really enjoy books that are based on real people and true stories.  This author did a great job presenting this story."}, {"review_sentiment": 1.0, "review_text": "BORING"}, {"review_sentiment": 3.0, "review_text": "Potential to be a much better storyline, but I agree with other reviewers who felt that the personal romantic relationship of the main character interfered with the story."}, {"review_sentiment": 5.0, "review_text": "Good read"}, {"review_sentiment": 2.0, "review_text": "Got off to a good start, but got bogged down and i didn't finish the book.  Too slow"}, {"review_sentiment": 3.0, "review_text": "I was intrigued by the background of the book; the wonderful images of the culture that existed at that time.I was less intrigued with the modern day romance woven into the story line."}, {"review_sentiment": 3.0, "review_text": "I picked up this book because of my interest in anything Parisian. I enjoyed the author's vivid depictions of what life was like in Paris during that time period - lively, chaotic and free flowing as only French culture can be. In contrast, the American point of view was quite bland and the main character's moral compass is questionable and I didn't enjoy her character development. I picked up this book hoping for a light summer read, which was delivered by the Parisian side, but April, the main character of the book and her background story was sad to read and dragged on at times. Overall, I gave this book a 3.5 stars."}]}, "authors": ["Michelle Gable"], "isbn": "1250067774", "longitude": 2.3514992, "periods": ["1900s", "2000s", "Recent Releases"], "title": "A Paris Apartment", "word_cloud": "great transport time want live fast enough often showcase era story writer vehicle story time let reader trouble begin author heart invest old time story eclipse modern time story modern story feel flat comparison modern story drag whole case enjoy perspective give turn century turn expect like surprise much enjoy really base real people true story author great job present story boring potential much better story line agree reviewer felt personal romantic relationship main character interfere story good good start get bogged slow intrigue background wonderful image culture exist le intrigued modern day woven story line pick interest anything parisian enjoy author vivid depiction life time period lively chaotic free flow french culture contrast american point view quite bland main character moral compass questionable enjoy character development pick hop light summer deliver parisian side main character background story sad drag time overall give star", "genres": ["Fiction & Literature", "Romance"], "summary": "Bienvenue à Paris!\r\n\r\nWhen April Vogt&#039;s boss tells her about an apartment in the ninth arrondissement that has been discovered after being shuttered for the past seventy years, the Sotheby&#039;s continental furniture specialist does not hear the words \"dust\" or \"rats\" or \"decrepit.\" She hears Paris. She hears escape.\r\n\r\nOnce in France, April quickly learns the apartment is not merely some rich hoarder&#039;s repository. Beneath the cobwebs and stale perfumed air is a goldmine, and not because of the actual gold (or painted ostrich eggs or mounted rhinoceros horns or bronze bathtub). First, there&#039;s a portrait by one of the masters of the Belle Epoque, Giovanni Boldini. And then there are letters and journals written by the very woman in the painting, Marthe de Florian. These documents reveal that she was more than a renowned courtesan with enviable decolletage. Suddenly April&#039;s quest is no longer about the bureaux plats and Louis-style armchairs that will fetch millions at auction. It&#039;s about discovering the story behind this charismatic woman.\r\n\r\nIt&#039;s about discovering two women, actually.\r\n\r\nWith the help of a salty (and annoyingly sexy) Parisian solicitor and the courtesan&#039;s private diaries, April tries to uncover the many secrets buried in the apartment. As she digs into Marthe&#039;s life, April can&#039;t help but take a deeper look into her own. Having left behind in the States a cheating husband, a family crisis about to erupt, and a career she&#039;s been using as the crutch to simply get by, she feels compelled to sort out her own life too. When the things she left bubbling back home begin to boil over, and Parisian delicacies beyond flaky pâtisseries tempt her better judgment, April knows that both she and Marthe deserve happy finales.\r\n\r\nWhether accompanied by croissants or champagne, this delectable debut novel depicts the Paris of the Belle Epoque and the present day with vibrant and stunning allure. Based on historical events, Michelle Gable&#039;s A Paris Apartment will entertain and inspire, as readers embrace the struggles and successes of two very unforgettable women.", "asin": "1250067774", "rank": "31893", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51Qf%2BHNZ5iL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}