{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 126, "rating": 3.3, "reviews": [{"review_sentiment": 4.0, "review_text": "atocha was nicer. this is a good book, too. not too thick, just the way I like a book."}, {"review_sentiment": 5.0, "review_text": "The most engaging book I've read in a long, long while.  The writing is out-of-the-box superb: one astounding sentence after another, each of which subverts its own assertion. The reader (at least this one) is thereby cast into, and oddly sustained by, the recalcitrant dysmetria of what it means to be human. An honest book."}, {"review_sentiment": 5.0, "review_text": "Although the narrator's voice can occasionally be frustrating, Lerner here composes a masterful, meandering exploration of modern life. Highly recommend."}, {"review_sentiment": 2.0, "review_text": "Ben Lerner’s 10:04 recalls the postmodernism of Amis, DeLillo, and transposes its solipsism onto the 19th century aesthetic of a Sebald. At times beautiful, and often funny, Lerner’s experimentations nevertheless fail to amount to a sustained engagement with the problems he treats. Casting a version of himself—at times in the first person, at times in the third—Lerner takes us through the story of his confrontations with a potentially fatal illness, questions of artificial insemination, and the structure of time. One wonders if he realizes the preciousness of his Brooklyn aesthetic; we encounter detailed treatments of the conceptual art world, his co-op, etc. Perhaps stripping down this paraphernalia would reveal the clarity of his voice in future work."}, {"review_sentiment": 5.0, "review_text": "As I mentioned in another review, a couple of novels I’ve read recently have had authors using techniques I don’t typically like but, somehow, managed to do so successfully.  (The Nix by Nathan Hill is the other example.)In this case, Mr. Lerner has written a post-modern, self-referential novel that blurs the line between memoir and fiction. In 10:04, we have as protagonist a writer writing a book about a writer writing a book about the same experiences that are described in this book.  Usually, I despise these kinds of stories.Mr. Lerner, however, manages to overcome my dislike.  He does so by a plot that bounces around in clever, short scenes and by a prose style that revels in amazing intelligence while still engaging the reader—a fine line that is too often difficult to manage.  He also succeeds because, frankly, this book is short.  I’m not sure I could have tolerated this for an extended period.  But, as it is, it is an excellent read."}, {"review_sentiment": 5.0, "review_text": "This book is amazing! I just finished it recently, and I'm dying to re-read it already because I know that there must be hundreds of nuances and clever little bits that I missed completely on the first read-through. It's smart, funny, and written in a prose that's completely different from anything else out there right now."}, {"review_sentiment": 4.0, "review_text": "A bit confusing to start with, but then flowed more smoothly.Enjoyed the different, sometimes challenging read."}, {"review_sentiment": 3.0, "review_text": "the conceptual underpinning of the plot is great. however i find much of his language is a bit clunky. he tries to show intellectuality to the reader rather than entertain or tell a story. the writing seems to me over-workshopped and lacking in energy and spontaneity at times. his use of words like propriaperception serves as a basic example. it's a neat idea, seemingly deep, but just clunky and overthought, overwrought. his techniques are lazy because he is just copy pasting short stories and pieces he wrote elsewhere.i think he probably just got a contract for a novel and didn't know what to do, so he overthought it and ends up affecting tired metafictional ideas. it really doesn't work. just admit you didn't like it. the publishers have done a lot to market this fella and make you feel like you should like him. you don't have to. be yourself."}, {"review_sentiment": 3.0, "review_text": "Sort of a fun read although I probably didn't do it justice by reading in spurts over 4 months. I should probably cycle back and re-read it sometime"}, {"review_sentiment": 5.0, "review_text": "This book is the voice of now (2016).  Some of the writing is just brilliant, and that makes up for the rather wandering plot.  The ideas in this book are very original.  Lerner is expressing things that very much needs to be expressed in a fully contemporary voice."}]}, "authors": ["Ben Lerner"], "isbn": "1250081335", "longitude": 0.0, "periods": ["2000s", "Recent Releases"], "title": "10:04", "word_cloud": "atocha nicer good thick way like engaging long long writing superb astound sentence subverts assertion least thereby cast oddly sustain recalcitrant dysmetria mean human honest narrator voice occasionally frustrating composes masterful meander exploration modern life recommend recall postmodernism transpose solipsism century aesthetic time beautiful often funny experimentation nevertheless fail amount sustain engagement problem treat cast version time first person time take story confrontation potentially fatal illness question artificial insemination structure time realize preciousness aesthetic encounter detail treatment conceptual art world etc perhaps strip paraphernalia clarity voice future work mention review couple novel recently author use technique typically somehow manage successfully example case write blur line memoir fiction protagonist writer write writer write experience describe usually despise kind however manage overcome plot bounce clever short scene prose style revel amaze intelligence still engage fine line often difficult manage also succeed frankly short sure extended period excellent amazing finish recently die already know nuance clever little bit miss completely first smart funny write prose completely different anything else right bit confusing start flow different sometimes challenge conceptual underpinning plot great however find much language bit clunky try show intellectualize rather entertain story write seem lack energy spontaneity time use word propriaperception serf basic example neat idea seemingly deep clunky overthought technique copy paste short story piece write think probably get contract overthought end affect tired meta fictional idea really work admit publisher do lot market fella make feel fun probably justice read spurt month probably cycle back sometime voice writing brilliant make rather wandering plot idea original express thing much need express fully contemporary voice", "genres": ["Fiction & Literature"], "summary": "Winner of The Paris Review's 2012 Terry Southern Prize.\r\n\r\nIn the last year, the narrator of 10:04 has enjoyed unlikely literary success, has been diagnosed with a potentially fatal medical condition, and has been asked by his best friend to help her conceive a child. In a New York of increasingly frequent superstorms and social unrest, he must reckon with his own mortality and the prospect of fatherhood in a city that might soon be underwater.\r\n\r\nIn prose that Jonathan Franzen has called \"hilarious ... cracklingly intelligent ... and original in every sentence,\" Lerner captures what it's like to be alive now, during the twilight of an empire, when the difficulty of imagining a future is changing our relationship to both the present and the past.", "asin": "1250081335", "rank": "149198", "city": "New York", "image": "https://images-na.ssl-images-amazon.com/images/I/51Joc3GzvtL.jpg", "country": "", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}