{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 43.653963, "ratings": {"num_ratings": 135, "rating": 2.9, "reviews": [{"review_sentiment": 5.0, "review_text": "I found this book inspiring. It is insightful examination of what it means to be a person, an artist, and an friend, made it a compelling read. For me it captured the difficulty of navigating one's way through our contemporary adult world. Some of the reviews seemed to think it was supposed to be a lighthearted comedy or something other than what it is -- I think that taken on its own terms, it is a truly wonderful book."}, {"review_sentiment": 1.0, "review_text": "Don't bother"}, {"review_sentiment": 3.0, "review_text": "I realize this book has tons of accolades and it was on a list of books I wanted to read, but I can't say I overall enjoyed it.  I found it hard to read and a bit depressing.  Perhaps it was just not the book for me (or the timing was not right for me to read).  I took me a lot longer to read than many books.  I'm sure others will enjoy it."}, {"review_sentiment": 5.0, "review_text": "So good that I'm looking forward to reading it again."}, {"review_sentiment": 1.0, "review_text": "I hated this book. Everything about it. I wanted to stop less than half way through, but I'm no quitter. Nothing but random ramblings and nonsense. Feminism? Please. Don't read this. I'd rather you burn your money than spend it on this book."}, {"review_sentiment": 1.0, "review_text": "Absolutely awful.  No plot, whiny characters, disjointed, and a complete waste of time and money."}, {"review_sentiment": 1.0, "review_text": "I truly thought this book was terrible I couldn't finish reading it. It jumps all over the place and is inconsistent. The author also seems like a narcissist."}, {"review_sentiment": 5.0, "review_text": "Loved this book!"}, {"review_sentiment": 5.0, "review_text": "It makes me ponder, laugh, reflect. I think I am going to read the author's other books"}, {"review_sentiment": 3.0, "review_text": "If you like eat, pray, love, you'll like this, although this is a little bit more insightful! :)"}]}, "authors": ["Sheila Heti"], "isbn": "125003244X", "longitude": -79.387207, "periods": ["2000s", "Recent Releases"], "title": "How Should a Person Be?: A Novel from Life", "word_cloud": "find inspire insightful examination mean artist friend make compel capture difficulty navigate way contemporary adult world review seem think suppose lighthearted comedy something think take term truly wonderful bother realize ton list want overall enjoy find hard bit depress perhaps time right take lot longer many sure others enjoy so good look forward read hat everything want stop le half way quitter nothing random ramblings nonsense rather burn money spend absolutely awful plot whiny character disjoint complete waste time money truly think terrible read jump place inconsistent author also seem narcissist love make ponder reflect think go author like eat pray love little bit insightful", "genres": ["Fiction & Literature"], "summary": "Named a Book of the Year by The New York Times\r\n\r\nA raw, startling, genre-defying novel of friendship, sex, and love in the new millennium.\r\n\r\nBy turns loved and reviled upon its U.S. publication, Sheila Heti's breakthrough novel is an unabashedly honest and hilarious tour through the unknowable pieces of one woman's heart and mind. Part literary novel, part self-help manual, and part vivid exploration of the artistic and sexual impulse, How Should a Person Be? earned Heti comparisons to Henry Miller, Joan Didion, Mary McCarthy, and Flaubert, while shocking and exciting readers with its raw, urgent depiction of female friendship and of the shape of our lives now. \r\n\r\nIrreverent, brilliant, and completely original, Heti challenges, questions, frustrates, and entertains in equal measure. With urgency and candor she asks: What is the most noble way to love? What kind of person should you be?", "asin": "125003244X", "rank": "107149", "city": "Toronto", "image": "https://images-na.ssl-images-amazon.com/images/I/41kQMCOfmbL.jpg", "country": "Canada", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}