{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 31.2253441, "ratings": {"num_ratings": 33, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "Fascinating book . I am big lover of shanghai . And this book is highly reccomended ! So many historical details. So many interesting facts. A great novel and if you are like me a Shanghai fan you cannot miss this book!!"}, {"review_sentiment": 5.0, "review_text": "I picked this up in Canada and have enjoyed it for the last month. Now it's going to as a birthday gift to family.  Many readers of historical China news will find familiar names - Emily Hahn, Victor Sassoon. Grescoe had done really in-depth research as well. I totally recommend this for anyone interested in 20th century Shanghai history, and the history of westerners / expatriates in China."}, {"review_sentiment": 4.0, "review_text": "Expatriate life in Shanghai, 1935-1939, focusing primarily on Micky Hahn, a promiscuous adventurer and talented writer, but also her lover Zau Sinmay, a  Chinese poet and small scale publisher, and Victor Sassoon a very wealthy Jewish bachelor  who built and owned the famous Cathay Hotel (now the Peace Hotel). Character and writing make for a fascinating story, but I suspect the author used a novelist’s imagination at times.  I read two professional reviews, but none compares what Grescoe has to say about Hahn’s inner thoughts to original sources and certainly Grescoe does not really help.  When Grescoe relates Hahn’s character to her being a youngest child, I suspect that is all him. The extra-national areas of Shanghai during that period were a very cosmopolitan enclave visited by many Western notables – Noel Coward wrote the first draft of “Private Lives” while laid up in the Cathay with the flu.  Grescoe provides enough historical and political background, especially if occasionally supplemented with Wikipedia."}, {"review_sentiment": 4.0, "review_text": "My husband and I both read the book and thought (until we got to the ending) that it was a novel.We;d been to Shanghai years ago, but certainly didn't explore it the way Taras Grescoe did.A pleasure to read.Note: Taras also wrote a travel article about Shanghai in the NYTimes."}, {"review_sentiment": 4.0, "review_text": "I wonder if it is still possible for adventurous expats to live so large in today's world -- anywhere?  Very entertaining -- until, of course, WWII turns the story quite dark."}, {"review_sentiment": 5.0, "review_text": "Well written and very informative."}, {"review_sentiment": 5.0, "review_text": "The star of the book is the city of Shanghai. The slightly lesser star is a young American lady Emily \"Mickey\"  Hahn who decides to live much of her adult life there. She is a free spirit causing scandal by her close relationship with a married Chinese poet. Mickey has numerous jobs but her primary income is derived through writing magazine articles and publishing personal memoirs and novels about Asia. There is a great amount of research done here as well as a tremendous volume of information on Chinese history from 1850 to 1950."}, {"review_sentiment": 5.0, "review_text": "A wonderful exciting book"}, {"review_sentiment": 4.0, "review_text": "Excellent read."}, {"review_sentiment": 5.0, "review_text": "This is a beautifully-written account of Shanghai in the 1930s, of a cosmopolitan city caught between political and geopolitical forces, including the Englishman of Iraqi-Jewish background who built the Cathay Hotel and other modern buildings, an American writer originally from St. Louis who wrote for the New Yorker and married a Chinese man (among others), and other interesting historical figures. It is all the more powerful in that it is NOT fiction."}]}, "authors": ["Taras Grescoe"], "isbn": "1250049717", "longitude": 121.4888922, "periods": ["1900s", "Recent Releases"], "title": "Shanghai Grand: Forbidden Love and International Intrigue in a Doomed World", "word_cloud": "fascinate big lover highly recommend so many historical detail so many interesting fact great fan miss pick enjoy last month now go birthday family many reader historical news find familiar name emily do really research well totally recommend anyone interested century history history westerner expatriate life focus primarily promiscuous adventurer talented writer also lover poet small scale publisher wealthy bachelor build own famous write make fascinating story suspect author use novelist imagination time professional review none compare say inner thought original source certainly really relate character youngest child suspect area period cosmopolitan enclave visit many western notable write first draft live lay flu provide enough historical political background especially occasionally supplemented husband think get end year ago certainly explore way pleasure also write travel article wonder still possible adventurous expat live large today anywhere very entertaining course turn story quite dark well write informative star city slightly lesser star young lady decide live much adult life free spirit cause scandal close relationship marry chinese poet numerous job primary income derive write magazine article publish personal memoir novel great amount research do well tremendous volume information history wonderful exciting excellent account cosmopolitan city catch political geopolitical force include background build modern building american writer originally write marry chinese man others interest historical figure powerful fiction", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "On the eve of WWII, the foreign-controlled port of Shanghai was the rendezvous for the twentieth century&#039;s most outlandish adventurers, all under the watchful eye of the fabulously wealthy Sir Victor Sassoon.\r\n\r\nEmily \"Mickey\" Hahn was a legendary New Yorker journalist whose vivid writing played a crucial role in opening Western eyes to the realities of life in China.\r\n\r\nAt the height of the Depression, Hahn arrived in Shanghai after a disappointing affair with an alcoholic Hollywood screenwriter, convinced she will never love again. After checking in to Sassoon&#039;s glamorous Cathay Hotel, Hahn is absorbed into the social swirl of the expats drawn to pre-war China, among them Ernest Hemingway, Martha Gellhorn, Harold Acton, and a colourful gangster named Morris \"Two-Gun\" Cohen. But when she meets Zau Sinmay, a Chinese poet from an illustrious family, she discovers the real Shanghai through his eyes: the city of rich colonials, triple agents, opium-smokers, displaced Chinese peasants, and increasingly desperate White Russian and Jewish refugees―a place her innate curiosity will lead her to explore first hand. Danger lurks on the horizon, though, as the brutal Japanese occupation destroys the seductive world of pre-war Shanghai, paving the way for Mao Tse-tung&#039;s Communists rise to power.", "asin": "1250049717", "rank": "376103", "city": "Shanghai", "image": "https://images-na.ssl-images-amazon.com/images/I/513-TGFXNLL.jpg", "country": "China", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}