{"where_to_read": ["Cafe", "Damn, my beret blew away"], "readability": 0, "latitude": 29.9499323, "ratings": {"num_ratings": 225, "rating": 4.3, "reviews": [{"review_sentiment": 3.0, "review_text": "The story of Zemurray is an interesting one and in most parts of the book is well told and enjoyable. However, in addition to clearly being infatuated by Zemurray and giving a biased view of the man, the author injects his own baseless feelings and opinions of Zemurray and speculates as to what drove him constantly. Specifically, he continually talks about Zemurray being ethnically Jewish and spends pages upon pages attempting to make his story one of race and religion when as far as we can tell from all the facts he presents in the book the man could have cared less that he was Jewish and it did not seem to influence in the least; Zemurray did not practice religion or follow Jewish traditions as the author notes. Despite having no evidence to suggest race or religion were important to the man, no first hand accounts, interviews with people close to him, or written words by Zemurray, he dedicates paragraphs throughout the book trying to make it a story of a 'Jewish immigrant' rather than just an 'immigrant' which distracts and disorients the reader from an otherwise fine book."}, {"review_sentiment": 5.0, "review_text": "The book is exactly as advertised & arrived promptly. Thank you."}, {"review_sentiment": 5.0, "review_text": "Great book. Lots of great biz and historical insighs!"}, {"review_sentiment": 5.0, "review_text": "Fascinating story"}, {"review_sentiment": 4.0, "review_text": "Interesting stuff.  I always took bananas for granted."}, {"review_sentiment": 5.0, "review_text": "The book is turn paging and created a live story in the readers mind. The story of Sam is in depth and research done is key."}, {"review_sentiment": 5.0, "review_text": "A fascinating read, and one that really helps explain why Central America is the way it is. Extraordinarily well written;"}, {"review_sentiment": 4.0, "review_text": "Great read. Stale at times, but necessary to set the stage and picture of the times. Parts about his children and family were sometimes verbose- but I understand the author wanted to pain the entire portrait of a man, and what is a man without family?"}, {"review_sentiment": 4.0, "review_text": "very interesting."}, {"review_sentiment": 3.0, "review_text": "The book is well written and has some great historical information but it just didn't get me excited. If you are into historical stories, this is totally for you. If you are more interested in fictional tales, this may be hit or miss."}]}, "authors": ["Rich Cohen"], "isbn": "1250033314", "longitude": -90.0701156, "periods": ["1800s", "1900s", "Recent Releases"], "title": "The Fish That Ate the Whale: The Life and Times of America's Banana King", "word_cloud": "story interest part well tell enjoyable however addition clearly infatuated give biased view man author inject baseless feeling opinion speculate constantly continually talk ethnically jewish spends page page attempt make story race religion far tell fact present man le jewish seem influence least practice religion follow jewish tradition author note evidence suggest race religion important man first hand account interview people close write word dedicate paragraph try story immigrant rather distract disorients otherwise fine exactly advertise arrive promptly great biz historical insight fascinate story interest stuff always take banana grant turn page create live story reader mind story depth research do key fascinate really help way extraordinarily well write necessary set stage picture child family sometimes understand author want pain entire portrait man man family interest well write great historical information get excite historical story totally interested fictional tale miss", "genres": ["Biography", "Business & Finance", "History"], "summary": "The fascinating untold tale of Samuel Zemurray, the self-made banana mogul who went from penniless roadside banana peddler to kingmaker and capitalist revolutionary\r\n\r\nThe fascinating, untold tale of Samuel Zemurray, the self-made banana mogul who went from penniless roadside banana peddler to kingmaker and capitalist revolutionary.\r\n \r\nWhen Samuel Zemurray arrived in America in 1891, he was tall, gangly, and penniless. When he died in the grandest house in New Orleans sixty-nine years later, he was among the richest, most powerful men in the world. Working his way up from a roadside fruit peddler to conquering the United Fruit Company, Zemurray became a symbol of the best and worst of the United States: proof that America is the land of opportunity, but also a classic example of the corporate pirate who treats foreign nations as the backdrop for his adventures.\r\n\r\nZemurray lived one of the great untold stories of the last hundred years. Starting with nothing but a cart of freckled bananas, he built a sprawling empire of banana cowboys, mercenary soldiers, Honduran peasants, CIA agents, and American statesmen. From hustling on the docks of New Orleans to overthrowing Central American governments and precipitating the bloody thirty-six-year Guatemalan civil war, the Banana Man lived a monumental and sometimes dastardly life. \r\n\r\nRich Cohen's brilliant historical profile The Fish That Ate the Whale unveils Zemurray as a hidden power broker, driven by an indomitable will to succeed.", "asin": "1250033314", "rank": "24322", "city": "New Orleans", "image": "https://images-na.ssl-images-amazon.com/images/I/41lHqhh606L.jpg", "country": "United States of America", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}