{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 30.2711286, "ratings": {"num_ratings": 128, "rating": 4.2, "reviews": [{"review_sentiment": 4.0, "review_text": "This isn't my normal read. Trying to break out of my routine of reading suspense/thriller series. This was a really nice read. If you liked the movie Boyhood, I would say the story is obviously different, but is similar in a way it follows someone over their lifetime. Just a much longer period of time. I thoroughly enjoyed the story, and would recommend it to others."}, {"review_sentiment": 5.0, "review_text": "Great Story of unselfish love!"}, {"review_sentiment": 5.0, "review_text": "This book was a page turner that keeps the reader spellbound till the very end. Not only was it a a deeply moving and exciting piece of literature, but it did my heart good to see that somebody with Elizabeth Crook's genius for writing and character development devoted a good portion of her life in paying tribute to a tragic day in American history which most people living today don't even know ever happened..50 years ago & I remember it as if it happened last year. Excellent Work Elizabeth !!!  Kindest Regards, FS  (aka: Doug)"}, {"review_sentiment": 5.0, "review_text": "Many twists but interesting"}, {"review_sentiment": 2.0, "review_text": "This book is not, as advertised, a \"historical novel\". It is set in the midst of a historical event and the details of that event are accurate (the Tower shooting). Details about Austin are also accurate. But the story is just a love story about people who were affected by the shooting. It struck me as almost a romance novel placed in the setting of the Tower shooting. Not what I was looking for."}, {"review_sentiment": 5.0, "review_text": "This book was set in a tragic historical time but the characters came to life and went beyond the historical. A great read!"}, {"review_sentiment": 5.0, "review_text": "Excellent book!"}, {"review_sentiment": 5.0, "review_text": "This is a great book it opened my eyes about a true event that happened at the University of Texas Campus Shooting and the story of the lives of those people who were instrumental in helping others survive the it."}, {"review_sentiment": 4.0, "review_text": "It wasn't what I expected at all. It has some twist. Good read. Especially the first part."}, {"review_sentiment": 4.0, "review_text": "A compelling read of a shocking event. Elizabeth Crook has  smooth style and credible understanding of the survivors of this UT Tower shooting. Can readily recommend it."}]}, "authors": ["Elizabeth Crook"], "isbn": "125006922X", "longitude": -97.7436995, "periods": ["2000s", "Recent Releases"], "title": "Monday, Monday: A Novel", "word_cloud": "normal break routine reading series really nice liked movie story obviously different similar way follow someone lifetime much longer period time thoroughly enjoy story others unselfish love page turner keep spellbound till end not deeply move excite piece literature heart good see somebody genius write character development devote good portion life pay tribute tragic day american history people live today even know ever year remember happen last year aka many twist interest advertised historical set midst historical event detail event accurate shooting also accurate story love story people affect shoot strike almost romance place set shoot not look set historical time character come life go historical great excellent great opened eye true event happen story live people instrumental help others survive expect first part compelling shock event smooth style credible understanding survivor shoot readily", "genres": ["Fiction & Literature"], "summary": "In this gripping, emotionally charged novel, a tragedy in Texas changes the course of three livesOn an oppressively hot Monday in August of 1966, a student and former marine named Charles Whitman hauled a footlocker of guns to the top of the University of Texas tower and began firing on pedestrians below. Before it was over, sixteen people had been killed and thirty-two wounded. It was the first mass shooting of civilians on a campus in American history.\r\n\r\nMonday, Monday follows three students caught up in the massacre: Shelly, who leaves her math class and walks directly into the path of the bullets, and two cousins, Wyatt and Jack, who heroically rush from their classrooms to help the victims. On this searing day, a relationship begins that will eventually entangle these three young people in a forbidden love affair, an illicit pregnancy, and a vow of secrecy that will span forty years. Reunited decades after the tragedy, they will be forced to confront the event that changed their lives and that has silently and persistently ruled the lives of their children.\r\n\r\nWith electrifying storytelling and powerful sense of destiny, Elizabeth Crook's Monday, Monday explores the ways in which we sustain ourselves and one another when the unthinkable happens. At its core, it is the story of a woman determined to make peace with herself, with the people she loves, and with a history that will not let her go. A humane treatment of a national tragedy, it marks a generous and thrilling new direction for a gifted American writer.", "asin": "125006922X", "rank": "1068236", "city": "Austin", "image": "https://images-na.ssl-images-amazon.com/images/I/51M1uAS%2BRDL.jpg", "country": "United States of America", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}