{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 857, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "This book pokes fun at racism in America. Set in a fictitious town of Dickens, California, in southeast Los Angeles. The author spins stories about his personal experiences growing up as a black man in east LA.  Hilariously funny but with a serious message."}, {"review_sentiment": 5.0, "review_text": "One of the best books I have read."}, {"review_sentiment": 5.0, "review_text": "This book is too funny. I bought it in June and read it again in October. I usually don't Re-read that quickly but this book is that good."}, {"review_sentiment": 2.0, "review_text": "This was a really hard book to get into. Enjoyable at parts; laugh out loud funny at others.  But the author wrote in a \"stream of consciousness\" fashion for much of the book, which made it difficult to follow."}, {"review_sentiment": 3.0, "review_text": "could not get into this book --- too violent and droning. I usually like books that get the Man Booker prize, but not this one (at least not this attempt)."}, {"review_sentiment": 5.0, "review_text": "I enjoyed this book. In places it's laugh out loud funny, in others touching, and in many more places it stopped me flat and made me think. Inventive, clever, a fine read. Beatty is a rare talent."}, {"review_sentiment": 4.0, "review_text": "This book merits its international recognition, The Sellout generates a racist world reminiscent of Swift's satire.The plot is so oddball that I sometimes had to reread stretches to find my way.The Sellout certainly entertains and often teaches. I did laugh out loud frequently. However, anyone averse to vulgarity should find another book."}, {"review_sentiment": 5.0, "review_text": "Everyone could benefit from reading and discussing this treatment of reality."}, {"review_sentiment": 3.0, "review_text": "I selected this as a Man Booker winner - hoped it would be worth checking out.I found it apparently challenging - rather misogynist, which in view of current events was not encouraging. However, I persevered  and was finally pleased I did so. Thought provoking overall."}, {"review_sentiment": 5.0, "review_text": "Smartly written. Wickedly funny. Made me think, and I like that in a book. I listened to it and highly recommend the narrator!"}]}, "authors": ["Paul Beatty"], "isbn": "1250083257", "longitude": -118.244476, "periods": ["1900s", "2000s", "Recent Releases"], "title": "The Sellout", "word_cloud": "poke fun racism fictitious town southeast author spin story personal experience grow black man east funny serious message best funny buy usually quickly good really hard get enjoyable part loud funny others author write stream consciousness fashion much make difficult follow violent drone usually like least attempt enjoy place laugh loud funny others touch many place stop flat make think inventive clever fine rare talent merit international recognition generates racist world reminiscent plot oddball sometimes reread stretch find certainly entertain often teach laugh loud frequently however anyone averse vulgarity find everyone read discuss treatment reality select winner hop check find apparently challenge rather misogynist view current event encourage however persevere finally pleased think provoke overall smartly write funny think like listen highly recommend narrator", "genres": ["Fiction & Literature", "Satire"], "summary": "Winner of the Man Booker Prize, 2016\r\n \r\nA biting satire about a young man's isolated upbringing and the race trial that sends him to the Supreme Court, Paul Beatty's The Sellout showcases a comic genius at the top of his game. It challenges the sacred tenets of the United States Constitution, urban life, the civil rights movement, the father-son relationship, and the holy grail of racial equality―the black Chinese restaurant.\r\n\r\nBorn in the \"agrarian ghetto\" of Dickens―on the southern outskirts of Los Angeles―the narrator of The Sellout resigns himself to the fate of lower-middle-class Californians: \"I'd die in the same bedroom I'd grown up in, looking up at the cracks in the stucco ceiling that've been there since '68 quake.\" Raised by a single father, a controversial sociologist, he spent his childhood as the subject in racially charged psychological studies. He is led to believe that his father's pioneering work will result in a memoir that will solve his family's financial woes. But when his father is killed in a police shoot-out, he realizes there never was a memoir. All that's left is the bill for a drive-thru funeral.\r\n\r\nFueled by this deceit and the general disrepair of his hometown, the narrator sets out to right another wrong: Dickens has literally been removed from the map to save California from further embarrassment. Enlisting the help of the town's most famous resident―the last surviving Little Rascal, Hominy Jenkins―he initiates the most outrageous action conceivable: reinstating slavery and segregating the local high school, which lands him in the Supreme Court.\r\n\r\n“The Sellout is among the most important and difficult American novels written in the 21st century . . . It is a bruising novel that readers will likely never forget.” Los Angeles Times", "asin": "1250083257", "rank": "5630", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51MoVVfjSgL.jpg", "country": "United States of America", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}