{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 80, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "Make Your Home Among Strangers is a fictional novel about Lizet, a young Hispanic girl from a lower-middle-class neighborhood in Miami, who is accepted into a prestigious college in New York state. She struggles in her new “predominantly white” environment, both academically and socially. She must decide whether she wants to join the upper echelon of college-degree-earning Latinos or get stuck in her old life with her sister, one-year-old nephew, and recently divorced mother. While the novel is technically fiction, I couldn’t help but read it as an autobiography of the author Jennine Capo Crucet. There are some scenes that come off as too real (and sometimes too benign) to be made up. Many scenes are overly descriptive, such as Lizet’s traveling between her college and home, so that the emotional and symbolic narrative gets lost in the noise. Most of the time the story feels long, unwieldy, and a slog to get through. However, there are gems among the rough as Lizet’s struggles to settle in both her old and new life make her an endearing protagonist. It’s easy to sympathize with her yearning to been seen as both a normal college student and someone who understands a Cuban immigrants struggle. Readers who want to learn about the struggle of Latino identity in America, or who can connect to it personally, may find Make Your Home Among Strangers a worthwhile read if they can forgive the slow pace and often overwritten narrative."}, {"review_sentiment": 1.0, "review_text": "A lot of words that go.... nowhere. MYHAS is the literary equivalent of posting a photo of your cat eating breakfast on Facebook. Disrespectful of the reader's time really. On the plus side, I didn't notice too many grammatical errors."}, {"review_sentiment": 4.0, "review_text": "I enjoyed this book, although I found Lizet quite frustrating at times. The best part of the book is the very real portrait of life. Maybe that's also the worst part - the part that is uncomfortable."}, {"review_sentiment": 4.0, "review_text": "Good read.  A little slow at first but worth the read."}, {"review_sentiment": 5.0, "review_text": "This anomaly of a girl who prospers in a poor Cuban Miami high school faces pressures of an elite college while being pulled by the family to return and fore sake her dreams. Her courage and focus is inspiring, especially given the absence of a support network of any kind in her adopted city."}, {"review_sentiment": 1.0, "review_text": "The motivations and feelings of the characters remain a mystery. On the other hand, the author wastes a lot of time detailing the political climate. The combination makes for a slow and redundant read."}, {"review_sentiment": 4.0, "review_text": "This was a good read, especially if you have an interest in issues that affect minority youth, particularly immigrants, and how they perceive their place in the world and struggle with cultural identity, success, etc."}, {"review_sentiment": 5.0, "review_text": "OUTSTANDING !!!"}, {"review_sentiment": 5.0, "review_text": "Great read. This book will resonate with every first generation Latino(a) entering college. Ms. Capo Crucet does a great job identifying the struggles and concerns that first generation students face in the real world."}, {"review_sentiment": 5.0, "review_text": "A sad, funny emotional look at a first generation American!"}]}, "authors": ["Jennine Capó Crucet"], "isbn": "1250094550", "longitude": -80.1936589, "periods": ["2000s", "Recent Releases"], "title": "Make Your Home Among Strangers: A Novel", "word_cloud": "fictional young girl neighborhood accept prestigious college state struggle new predominantly white environment academically socially want join upper echelon get stick old life sister nephew recently divorce mother technically fiction help author scenes come real sometimes benign make many scene overly descriptive travel college emotional symbolic narrative get lose noise most time story feel long unwieldy slog however gem rough struggle old new life endear protagonist easy yearn see normal college student someone understand cuban immigrant struggle want learn struggle identity connect personally worthwhile forgive slow pace often overwritten narrative lot word go nowhere literary equivalent post photo cat eat breakfast time really plus side notice many grammatical error enjoy find quite frustrating time best part real portrait life also worst part part uncomfortable good little slow first worth anomaly girl prospers poor high school face pressure elite college pull family return fore sake dream courage focus inspire especially give absence support network kind adopt city motivation feel character remain mystery hand author waste lot time detail political climate combination make slow redundant good especially interest issue affect minority youth particularly immigrant perceive place world struggle cultural identity success etc outstanding resonate first generation enter college great job identify struggle concern first generation student face real world sad funny emotional look first generation american", "genres": ["Fiction & Literature"], "summary": "A New York Times Book Review Editors' Choice\r\n\r\nThe arresting debut novel from award-winning writer Jennine Capó Crucet\r\n\r\nWhen Lizet-the daughter of Cuban immigrants and the first in her family to graduate from high school-secretly applies and is accepted to an ultra-elite college, her parents are furious at her decision to leave Miami. Just weeks before she's set to start school, her parents divorce and her father sells her childhood home, leaving Lizet, her mother, and Leidy-Lizet's older sister, a brand-new single mom-without a steady income and scrambling for a place to live.\r\n\r\nAmidst this turmoil, Lizet begins her first semester at Rawlings College, distracted by both the exciting and difficult moments of freshman year. But the privileged world of the campus feels utterly foreign, as does her new awareness of herself as a minority. Struggling both socially and academically, she returns to Miami for a surprise Thanksgiving visit, only to be overshadowed by the arrival of Ariel Hernandez, a young boy whose mother died fleeing with him from Cuba on a raft. The ensuing immigration battle puts Miami in a glaring spotlight, captivating the nation and entangling Lizet's entire family, especially her mother.\r\n\r\nPulled between life at college and the needs of those she loves, Lizet is faced with difficult decisions that will change her life forever. Urgent and mordantly funny, Make Your Home Among Strangers tells the moving story of a young woman torn between generational, cultural, and political forces; it's the new story of what it means to be American today.", "asin": "1250094550", "rank": "78644", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51e4a2wCM4L.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}