{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 11, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Mr Downie has written a highly entertaining yet fact filled book based on years of experience as a Parisian food critic and historic Paris tour guide for the rich and powerful.  He knows Paris block by block from the subterranean up and seems to tell all. I found myself underlining the names of restaurants described and other points of interest to visit (or avoid) but soon stopped because there were so many of note for so many different reasons. The author has crafted a brilliant book difficult to put down that no one else could have written.  My only quibble is that the book lacks an index."}, {"review_sentiment": 5.0, "review_text": "This genius format took me from Napolean to literal Napoleans. David Downie has such incredible historic insight from A-Z. A must read at any cost.By the way, I've sprung on oysters and scallops since the last word. Bon vivant, et j'ai faim. ❤️"}, {"review_sentiment": 5.0, "review_text": "This book kept me sane on a last crazy business trip to China this week! Such a fascinating trip through the history of eating in Paris! Well written, smart, inspired!Now I am waiting for the paperback to come out because I've yet to master the ability to revisit passages on Kindle that I want to research further.  And I can't wait to revisit the Mazarin Library to take a peek at some of those manuscripts myself."}, {"review_sentiment": 5.0, "review_text": "There is a lot of deep historical knowledge here but is served up in tasty bites that are easily digested.  For anyone interested in France, Paris, and food this is a great read.  Mr. Downie mentions a lot of sites that are still in existence and can be visited so the book can also be used as a guide to travel.  Along with his other Paris titles, this is a book for anyone planning on visiting and who wants more than a one paragraph explanation provided by most travel information.  Just get it!!"}, {"review_sentiment": 5.0, "review_text": "Whether or not you know Paris, BUY this book. It's a guaranteed voyage of discovery by an author who knows Paris inside out and generously shares its secrets - culinary or otherwise - with his readers. And by the by, this is by no means an easy subject to tackle - Paris and its love affair with food - because you are bound to offend someone somewhere who does not agree with what you write. A love for food is a very subjective one and all good food writers are going to project their own tastes and enthusiasms into their writing about a place, a dish and the history behind it. It is my conviction that David Downie does this admirably in A Taste of Paris. He pulls off a difficult task - engaging the reader with some serious history about Paris, the genesis of its food, his own thoughts and insights - with erudition and a light touch which is both enchanting, informative and interesting. In short, A Taste of Paris is excellent and a damn good read. It has all the necessary \"ingredients\" to be a winner and is an absolute must for history and food lovers alike."}, {"review_sentiment": 5.0, "review_text": "This is a book that pulls you right into the French way of life and France's love affair with food. Erudite, enthralling, engaging. You won't be able to put it down. Bravo, David Downie!"}, {"review_sentiment": 1.0, "review_text": "I 'm very sorry to say it, but I found this to be one of the most irritating, least worthwhile, books I have read in a long time.The title is seriously misleading—“A Taste” must refer to the author’s, because that is the main theme of the text. Though there are many references to historical documents, places and events, they are not connected by a coherent historical narrative in which one subject leads to another. The claim of “the Parisian Love Affair with Food” is never addressed, much less demonstrated, and as for even the author’s “love” of “food”, there is no evidence here of a refined palate or much culinary knowledge on his part. Many names are dropped, but often this seems to be showing off, marketing his walking-tour business rather than teaching readers; street maps would have helped.  The strongest takeaway as the central thread for me was the author’s apparent fascination with himself—his constant padding of the text with often gratuitous insertions of his personal takes on everything (as if that is what readers care most about), instead of simply presenting an objective history in which we are interested, for which we were misled to buy the book.The prose style is breezy, smart-alecky, over-written and purportedly facetious—more suitable to short, light magazine articles than to nonfiction books. Servers in restaurants are many times described as dressed like penguins, as if that (cliché, after all) were—what? Witty? Clever? Funny? Certainly none of those from the second time on. Unremitting and purportedly clever word-plays draw more attention to the writing than to the subjects at hand. I found no depth of insight or nuanced sensibility.Actually the pretext of a “history” and “the Parisian Love of Food” are misconceived. Because so little is known about the early history of Paris, the text focuses on the author almost entirely—e.g., the solid historical information in the first 24 pages of the book (after which I stopped counting) could easily have been fitted into two paragraphs. Charlemagne is adduced as if somehow representative of Paris, whereas he was born in either Belgium or Germany, and lived all over Europe wherever he was (almost always) fighting, keeping his court at Aachen, in today’s Germany. The history of Paris is of course familiar from many other sources, but this book contains no illuminating attempt to create a specialized narrative fitting into that history."}, {"review_sentiment": 5.0, "review_text": "Love the ring. Excellant better than I imagined.  Havent started the book but it arrived in excellant condition."}, {"review_sentiment": 5.0, "review_text": "“If I flipped a franc, it would land on something worth swallowing,” David Downie writes of his arrival in Paris in 1976. He remembers, as I do, gazing into the yawning seven-story hole where Les Halles had provided food and drink to all Paris until its relocation to suburban Rungis several years before, and he laments much more strongly than I do the second replacement for the historic Baltard canopies, the massive skate wing that covers the new and very chic shopping center. Les Halles has come a long way, from Zola’s Belly of Paris to yet another pricey and upmarket shopping center.Downie’s newest book, A Taste of Paris, is the third in his recent series of memoirs/explorations of Paris. Beginning with Paris, Paris: Journey into the City of Light (2011) and continuing with A Passion for Paris: Romanticism and Romance in the City of Light (2016), the series explores his fascination with his home city. I still think Paris, Paris is the best guidebook I’ve read, and it’s not really a guidebook but a slow, guided introduction to fascinating aspects of the city. A two dozen peeks through a two dozen keyholes, which together add up to a rounded view.The list of Downie’s books is long. There are more than a dozen on it. I haven’t read all of them but I’ve read and enjoyed a good sample, and many of them have food at their center. Or wine. Or food and wine.Unless you are a serious student of French culinary history — enrolled at one of the big cooking academies, for example — I suggest you approach A Taste of Paris the way you’d approach a historical novel. It is nicely written, in Downie’s own idiosyncratic style, and full of facts and sidelights about the historical personalities, including the three King Louis <sup>(see links below)</sup> whose reigns led up to the Revolution. It’s entertaining.As you get into it you’ll appreciate more the sheer depth of Downie’s knowledge about Paris, France, food, and any combination of the three. I still remember reading his Food Wine Burgundy and thinking it contained more information per square inch than anything I’d read. A Taste of Paris comes close.Readers of this blog know that Paris is my favorite city, and that I spend a lot of time there researching and writing my novels. One of Downie’s sidelines is as a tour guide, and a few years ago my sister, visiting with friends from Texas, asked him to guide her group, and invited me to tag along. It was an impressive experience. Downie’s knowledge of the city’s history is precise and seems bottomless.The part of A Taste of Paris I enjoyed most was Downie’s discussion of more recent years, such as the story of Les Halles. I remember with pleasure the midnight dinner of pigeon Jan and I shared with the financial editor of the International Herald Tribune and his wife in the early seventies, when we were freelancing in Frankfurt and writing business and financial stories in the German-speaking countries. Les Halles as Zola described it almost exactly a hundred years before, down to the rich onion soup that made up an obligatory part of every meal.I’ve enjoyed meals at restaurants he mentions, many of them, and bought a peppermill at E. Dehillerin, which he calls “the most famous and labyrinthine of several kitchen supply emporiums” in the area. It’s like your grandfather’s hardware store.And I’ve also visited and recommend the famous sculpture by Raymond Mason, in a side chapel of the imposing Saint-Eustache church which looks over Les Halls. In modern style, it depicts vendors when they left Les Halles for the last time in 1969. It’s colorful and atmospheric."}, {"review_sentiment": 5.0, "review_text": "It was not by accident that Paris became the world capital of gastronomy. But -- how did it happen? David Downie, who in his marvelous books has walked you all the way around the City of Light, now walks you back in time to her secret history, through the centuries-long saga of how Paris was fed. The logistics are staggering, the characters unforgettable, and the stories of the kind you can dine out for a year on. Reading, you may just feel that gastronomy as we know it in the best Paris restaurants is the tender flower of mighty and continuous labor dating to the deep, deep past. As always, David Downie leads you to see Paris anew, through any lens he crafts for you. Don't miss this one!"}]}, "authors": ["David Downie"], "isbn": "1250082935", "longitude": 2.3514992, "periods": ["1800s", "1900s", "2000s", "Recent Releases"], "title": "A Taste of Paris: A History of the Parisian Love Affair with Food", "word_cloud": "write highly entertaining yet fact fill base year experience critic historic tour guide rich powerful know block block subterranean seem tell find underline name restaurant describe point interest visit avoid soon stop many note many different reason author craft brilliant difficult put else write quibble lack index genius format take literal incredible historic insight way spring oyster scallop last word vivant et fain keep sane last crazy business trip week such fascinating trip eat write smart inspire now wait paperback come yet master ability revisit passages want research revisit peek manuscript lot deep historical knowledge serve tasty bite easily digest anyone interested great mention lot site still existence visit also use guide travel title anyone plan visit want paragraph explanation provide travel information get know guarantee voyage discovery author know inside generously share secret culinary otherwise reader mean easy subject tackle bound offend someone somewhere agree write subjective good writer go project taste enthusiasm write place dish conviction admirably pull difficult task engage serious genesis thought insight erudition light touch enchant informative interesting short excellent damn good necessary ingredient winner absolute lover alike pull right french way life enthral engage able sorry say find irritate least worthwhile long title seriously author main theme many reference historical document place event connect coherent historical narrative one subject lead claim never address much le demonstrated even author evidence refine palate much culinary knowledge part name drop often seem show market business rather teach reader street map help strongest takeaway central thread author apparent fascination constant padding text often gratuitous insertion personal take everything reader care instead simply present objective interested mislead prose style breezy purportedly suitable short light magazine article nonfiction restaurants many time describe dress penguin cliche none second time unremitting purportedly clever draw attention write subject hand find depth insight nuanced pretext misconceive little known early text focus author almost solid historical information first page stop count easily fit paragraph adduce somehow representative whereas born live almost always fight keep court today course familiar many source contains illuminate attempt create specialize narrative fitting ring better imagine start arrive excellent condition flip franc something swallow write arrival remember gaze yawn hole provide drink relocation suburban several year lament much strongly second replacement historic canopy massive skate wing cover new chic shopping center come long way yet pricey upmarket shopping newest third recent series continue series explore fascination home city still think best guidebook really slow guide introduction fascinate aspect city dozen peek dozen keyhole together add rounded list long dozen enjoy good sample many center wine serious student french culinary enrol big cooking academy example suggest approach way approach historical nicely write idiosyncratic style full fact sidelight historical personality include sup see link reign lead appreciate sheer depth combination still read think contain information square inch anything come blog know favorite city spend lot time research write novel sideline guide year ago sister visit friend ask guide group invite tag impressive experience knowledge city precise seem part enjoy discussion recent year story remember pleasure midnight dinner share financial editor wife early seventy freelance write business financial story country describe almost exactly year rich onion soup make obligatory part enjoyed meal restaurants mention many buy pepper mill call famous labyrinthine several kitchen supply emporiums area grandfather hardware also visit recommend famous sculpture side chapel impose church look modern style depict vendor leave last time colorful atmospheric accident become world capital gastronomy marvelous walk way walk back time secret saga feed logistics stagger character unforgettable story kind dine year gastronomy know best restaurant tender flower mighty continuous labor date deep deep past always lead lens craft do", "genres": ["History", "Food and Wine"], "summary": "A Taste of Paris is a delectable culinary history of the gastronomic capital of the world, written by David Downie, the critically acclaimed author of Paris, Paris and A Passion for Paris.\r\n\r\n“A joyous romp through time . . . The streets and tables of Paris will never be the same and I could not be more grateful.” Alice Waters \r\n\r\nIn his trademark witty and informative style, David Downie embarks on a quest to discover “What is it about the history of Paris that has made it a food lover’s paradise?” Long before Marie Antoinette said, “Let them eat cake!” (actually, it was brioche), the Romans of Paris devoured foie gras, and live oysters rushed in from the Atlantic; one Medieval cookbook describes a thirty-two part meal featuring hare stew, eel soup, and honeyed wine; during the last great banquet at Versailles a year before the Revolution the gourmand Louis XVI savored thirty-two main dishes and sixteen desserts; yet, in 1812, Grimod de la Reynière, the father of French gastronomy, regaled guests with fifty-two courses, fifteen wines, three types of coffee, and seventeen liqueurs.\r\n\r\nFollowing the contours of history and the geography of the city, Downie sweeps readers on an insider’s gourmet walking tour of Paris and its environs in A Taste of Paris, revealing the locations of Roman butcher shops, classic Belle Epoque bistros serving diners today and Marie Antoinette’s exquisite vegetable garden that still supplies produce, no longer to the unfortunate queen, but to the legendary Alain Ducasse and his stylish restaurant inside the palace of Versailles. Along the way, readers learn why the rich culinary heritage of France still makes Paris the ultimate arbiter in the world of food.", "asin": "1250082935", "rank": "26370", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51ktcfrLGEL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}