{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 87, "rating": 3.7, "reviews": [{"review_sentiment": 4.0, "review_text": "A well-written interesting thriller"}, {"review_sentiment": 3.0, "review_text": "I'm really enjoying the Quirke novels. John Banville (Benjamin Black) is an incredible author. His mystery novels are quite different from the normal fast-paced, always-catch-the-bad-guy formula of other detective novels. They are atmospheric, dark and Quirke does not always win."}, {"review_sentiment": 5.0, "review_text": "Black has a whole series that everyone should read. Being introduced to a pathologist named Querkie......only in Ireland I suppose."}, {"review_sentiment": 5.0, "review_text": "As all his novels, it kept my interest"}, {"review_sentiment": 2.0, "review_text": "My fourth Quirke novel and this one lacks complexity and depth.  The plot is absolutely linear.  We get on the train at point A and travel on a straight track to the end of the line.  Good, perhaps, for train travel but boring and tedious for a novel.The characters are completely devoid of depth.  An opportunity exists to get to know more about Sinclair but, although a focal point in the story, he remains one dimensional.  We also should begin to know more about Hackett but alas we merely find out about his boots and socks.  The core characters get a mention but feel like an after thought.  And then there is Teddy.  A good potential for a menacing villain but he never develops.The overriding word that comes to mind for the novel is shallow - just scoring the surface of the story, but never getting deep enough to plant any seeds to eventually harvest a crop.Too bad!"}, {"review_sentiment": 3.0, "review_text": "Enjoyed the book but find all the Benjamin Black novels are getting into a predictable pattern.  Probably won't read any more of his."}, {"review_sentiment": 5.0, "review_text": "Complicated, disturbing, surprising, magnificently written."}, {"review_sentiment": 1.0, "review_text": "Characters are all just annoying"}, {"review_sentiment": 2.0, "review_text": "Workmanlike but not much else.Filled with cliches: the cop struggling not to relapse into alcoholism, the hated rich guy, the aloof widow, lonely childhoods, etc., etc., etc.  The principal characters are collections of dysfunctionalities, lacking in any real depth.  Emotions are extreme, inappropriate (as they say in psychology) and come without warning or reason. Reactions make no sense.  The main character, Quirke, somehow manages to get embarrassed, nonplussed, flummoxed, etc. in every sort of social situation imaginable.  He seems to have the maturity and sophistication of a 12-year-old suddenly forced to deal with adults.  The victim's daughter is like a parody of Rhoda in \"The Bad Seed.\"  The plot (who dun it?) slogs along through the weird psychological landscape.  There is an odd, almost perverse, obsession with Jews and who is and who isn't.  Not sure what, if anything, this is supposed to prove; it is terribly awkward and borders on being offensive.I gave it 2 stars mainly because 1 star should be reserved for books even worse, with terrible writing and sloppy construction.  This one, as noted above, at least is competently put together.  But that is all."}, {"review_sentiment": 5.0, "review_text": "Captivating. Couldn't put it down. Benjamin Black has written a winner. Highly recommend as one of this author's best books."}]}, "authors": ["Benjamin Black"], "isbn": "1250002508", "longitude": -6.2602732, "periods": ["1900s", "Recent Releases"], "title": "A Death in Summer: A Novel (Quirke)", "word_cloud": "interesting thriller really enjoy novel incredible author mystery novel quite different normal formula detective novel atmospheric dark always win whole series everyone introduce pathologist name suppose novel keep interest fourth lack complexity depth plot absolutely get train point travel straight track end line perhaps train travel bore tedious character completely devoid depth opportunity exist get know focal point story remain dimensional also begin know ala merely find boot sock core character get mention feel thought good potential menacing villain never override word come mind shallow score surface story never get deep enough plant seed eventually harvest bad enjoy find get predictable pattern complicate disturb surprising magnificently write character annoy workmanlike much cliche cop struggle relapse alcoholism hat rich guy aloof widow lonely childhood etc principal character collection dysfunctionalities lack real depth emotion extreme inappropriate say psychology come warn reason reaction make sense main character somehow manage get embarrass nonplussed flummoxed etc sort social situation imaginable seem maturity sophistication suddenly force deal victim daughter parody plot dun slogs weird psychological landscape odd almost perverse obsession not sure anything suppose terribly awkward border give star mainly star reserve even worse terrible write sloppy construction note least competently put together captivate write winner recommend author best", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "One of Dublin's most powerful men meets a violent end— and an acknowledged master of crime fiction delivers his most gripping novel yet\r\n\r\nOn a sweltering summer afternoon, newspaper tycoon Richard Jewell—known to his many enemies as Diamond Dick—is discovered with his head blown off by a shotgun blast. But is it suicide or murder? For help with the investigation, Detective Inspector Hackett calls in his old friend Quirke, who has unusual access to Dublin's elite.\r\n\r\nJewell's coolly elegant French wife, Françoise, seems less than shocked by her husband's death. But Dannie, Jewell's high-strung sister, is devastated, and Quirke is surprised to learn that in her grief she has turned to an unexpected friend: David Sinclair, Quirke's ambitious assistant in the pathology lab at the Hospital of the Holy Family. Further, Sinclair has been seeing Quirke's fractious daughter Phoebe, and an unlikely romance is blossoming between the two. As a record heat wave envelops the city and the secret deals underpinning Diamond Dick's empire begin to be revealed, Quirke and Hackett find themselves caught up in a dark web of intrigue and violence that threatens to end in disaster.\r\n\r\nTightly plotted and gorgeously written, A Death in Summer proves to the brilliant but sometimes reckless Quirke that in a city where old money and the right bloodlines rule, he is by no means safe from mortal danger.", "asin": "1250002508", "rank": "103391", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51mfexiYK5L.jpg", "country": "Ireland", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}