{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 51.50853, "ratings": {}, "authors": ["Edward St. Aubyn"], "isbn": "1250023904", "longitude": -0.12574, "periods": ["2000s", "Recent Releases"], "title": "At Last: The Final Patrick Melrose Novel", "word_cloud": "", "genres": ["Fiction & Literature"], "summary": "A New York Times Notable Book of the Year\r\n\r\nThe fifth novel in Edward St. Aubyn's stunning cycle about his protagonist Patrick Melrose. The last four novels in the cycle are available in The Patrick Melrose Novels.\r\n\r\nHere, from the writer described by The Guardian as \"our purest living prose stylist\" and whom Alan Hollinghurst has called \"the most brilliant English novelist of his generation,\" is a work of glittering social comedy, profound emotional truth, and acute verbal wit.\r\n\r\nAs readers of Edward St. Aubyn's extraordinary earlier works―Never Mind, Bad News, Some Hope, and the Man Booker Prize finalist Mother's Milk―are well aware, for Patrick Melrose, \"family\" has always been a double-edged sword. At Last begins as friends, relatives, and foes trickle in to pay final respects to his mother, Eleanor. An Americam heiress, Eleanor married into the British aristocracy, giving up the grandeur of her upbringing for \"good works\" freely bestowed on everyone but her own son, who finds himself questioning whether his transition to a life without parents will indeed be the liberation he had so long imagined.\r\n\r\nThe service ends, and family and friends gather for a final party. Amid the social niceties and social horrors, Patrick begins to sense the prospect of release from the extremes of his childhood, and at the end of the day, alone in his room, the promise some form of safety. . . at last.", "asin": "1250023904", "rank": "641246", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51XlDqLAiWL.jpg", "country": "England", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}