{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 103, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "This novel is less a mystery than an exploration of Dublin life in the 1950's.  It is  rather dark, if  you like that sort of thing.  The descriptions and dialogue are quite sharp.  It made me want to read another Quirke novel...just not right away."}, {"review_sentiment": 5.0, "review_text": "One of the best mystery series ever--highly recommended."}, {"review_sentiment": 5.0, "review_text": "A good outing by Benjamin Black. Quirke, as ever, is drinking and insightful. The chapters featuring the tinkers are the best part of the novel. The Catholic church does not come out of this well."}, {"review_sentiment": 5.0, "review_text": "I enjoyed the story set in Dublin, and in the past. Police work was so different then, without all the technology we have now."}, {"review_sentiment": 5.0, "review_text": "Quirk actually solves the crime,"}, {"review_sentiment": 3.0, "review_text": "I loved the first three Quirke mysteries and John Banville is a great writer. But I thought the plot was too thin in this one and that there was just too much dwelling on neurotic obsessions. The ending too was bad with the reader left with Quirke's unresolved health or mental problem."}, {"review_sentiment": 2.0, "review_text": "My sixth Quirke novel and finally the author shares more expansive insights into Quirke's life  This novel clearly focuses the majority of attention on Quirke and Phoebe.  What the author does not focus much attention on is a murder.  For that reason, I don't think of this as a murder mystery novel.Although what the author invests in his strong, vivid writing, he neglects in plot and character development.  The plot/character devise he uses with Phoebe is so predictable but her juvenile rationale and questioning of her relationships is extremely weak. And, Quirke's solo journey to resolve the murder is so one dimensional and abrupt that the whole scene is just boring.As with the two prior novels, the storyline is so very linear lacking in depth, complexity and intricacy.  I have come to believe the author just does not want to invest much time into Quirke stories and it shows, except maybe to the Wall Street Journal."}, {"review_sentiment": 3.0, "review_text": "Disappointing when compared to previous Quirk novels."}, {"review_sentiment": 5.0, "review_text": "I've enjoyed each of the novels in the series. I strongly recomend Benjamin Black, his descriptions of Dublin, his characters and his plots are so powerful you feel you' re there."}, {"review_sentiment": 1.0, "review_text": "Read the first third, sent it back to the cloud, then deleted it.  More of the same, old man finding young attractive woman that can't seem to control their desire for the old sour man.  A dreary mystery.  Formula writing"}]}, "authors": ["Benjamin Black"], "isbn": "1250050278", "longitude": -6.2602732, "periods": ["1900s", "Recent Releases"], "title": "Holy Orders: A Quirke Novel", "word_cloud": "le mystery exploration life rather dark sort thing description dialogue quite sharp make want right away best mystery series ever highly recommended good outing ever drink insightful chapter feature tinker best part church come well enjoy story set past work different technology actually solve crime love first mystery great writer think plot thin much dwell neurotic obsession end bad leave unresolved health mental problem sixth finally author share expansive insight life clearly focus majority attention author focus much attention murder reason think murder mystery author invest strong vivid write neglect plot character development devise use predictable juvenile rationale question relationship extremely weak solo journey resolve murder dimensional abrupt whole scene prior novel story line linear lack depth complexity intricacy come believe author want much time story show maybe disappoint compare previous novel enjoy novel series strongly recommend description character plot powerful feel first third send back cloud delete more old man find young attractive woman control desire old sour man dreary mystery writing", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "When the body of his daughter's friend is brought to his autopsy table, Quirke is plunged into a world of corruption that takes him to the darkest corners of the Irish Church and State.\r\n\r\n\"At first they thought it was the body of a child. Later, when they got it out of the water and saw the pubic hair and the nicotine stains on the fingers, they realized their mistake.\"\r\n\r\nSo begins Holy Orders, the latest Quirke case set in Dublin at a moment when newspapers are censored, social conventions are strictly defined, and appalling crimes are hushed up. Why? Because in 1950s Ireland the Catholic Church controls the lives of nearly everyone. But when Quirke's daughter Phoebe loses her close friend Jimmy Minor to murder, Quirke can no longer play by the Church's rules. Along with Inspector Hackett, his sometime partner, Quirke investigates Jimmy's death and learns just how far the Church and its supporters will go to protect their own interests.\r\n\r\nHaunting, fierce, and brilliantly plotted, this is Benjamin Black writing at the top of his form. His inimitable creation, the endlessly curious Quirke, brings a pathologist's unique understanding of death to unlock the most dangerous of secrets.", "asin": "1250050278", "rank": "691733", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51ZzANecJ3L.jpg", "country": "Ireland", "story_arc": ["Tragedy", "Things only get worse"]}