{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 50.110653, "ratings": {"num_ratings": 280, "rating": 4.0, "reviews": [{"review_sentiment": 4.0, "review_text": "It was suspenseful as it wasn't clear until the end, \"who done it\", but I didn't find it a page turner."}, {"review_sentiment": 5.0, "review_text": "I love this author and this series  The plots get tricky sometimes and it's hard to keep track of all the characters but well worth the effortWould like to see more from this author..."}, {"review_sentiment": 5.0, "review_text": "Neuhaus is a new author for me.  It is not the last time I will read her.  Already started on another.  The workings of the German police system is actually so much like it is in the states.  I can usually figure out \"Who done it \" rather quickly.  Although I questioned the perpatrarors motives throughout, it was way into the ending that it became clear.  And then there was more!!!"}, {"review_sentiment": 2.0, "review_text": "Two stars for the fact that I finished the book. As others have noted the translation was clunky but that is not the problem. The plot is dense with a lot of characters. The beginning is interesting but at about a third of the book, the story veers from implausible to absurd. It is one of those books where everybody is hiding something and the detectives themselves don't do any detecting - facts just fall into their laps with regular frequency. I am done with this author."}, {"review_sentiment": 5.0, "review_text": "Crime, intrigue,  drama...All in one. Great read. Don't try to read before bed, you'll not want to put down to go to sleep.Another foreign author has joined my favorites list!"}, {"review_sentiment": 5.0, "review_text": "I forget the answer to most of the above questions, but I enjoyed the book."}, {"review_sentiment": 4.0, "review_text": "! Easy read that makes you think about yourself and your life and the way you live it. Must read"}, {"review_sentiment": 5.0, "review_text": "This book was the first Neuhaus I read.  Snow White is riveting, complex, believable, and surprising. I have since read several more of this author's books.  Her other book, \"The Ice Queen\" is even better."}, {"review_sentiment": 4.0, "review_text": "Great story kept you guessing the whole time."}, {"review_sentiment": 5.0, "review_text": "wonderful author and story...lots of twists and turns...I immediately began reading anothe by Nele!"}]}, "authors": ["Nele Neuhaus"], "isbn": "1250039770", "longitude": 8.682093, "periods": ["2000s", "Recent Releases"], "title": "Snow White Must Die", "word_cloud": "suspenseful clear end do find page turner love author series plot get tricky sometimes hard track character well worth author new author last time already start working police system actually much state usually figure do rather quickly question perpetrator motif way end become clear star fact finish others note translation clunky problem plot dense lot character begin interesting third story veers implausible everybody hide something detective detect fact fall lap regular frequency do author intrigue drama bed put foreign author join favorite list forget answer question enjoy easy make think life way live first rivet complex believable surprising several author even better story keep guess whole time wonderful author story lot twist turn immediately begin read another", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "Book 1/4 in Bodenstein & Kirchoff series\r\n\r\nOn a wet November day, Detectives Pia Kirchoff and Oliver von Bodenstein are summoned to the scene of a mysterious accident. A woman has fallen from a bridge onto the motorway below. It seems that she may have been pushed. The investigation leads them to a small town near Frankfurt, and the home of the victim, Rita Cramer.\r\n\r\nOn a September evening eleven years earlier, two seventeen-year-old girls, Laura and Stefanie (also known as Snow White), vanished without trace from this same village. In a trial based entirely on circumstantial evidence, Stefanie’s boyfriend, handsome and talented, Tobias Sartorius, was sentenced to ten years in prison. He has now returned to his home in an attempt to clear his name. Rita Cramer is his mother.\r\n\r\nIn the village, Pia and Oliver encounter a wall of silence. But when another young girl goes missing, the events of the past repeat themselves in a disastrous manner. The investigation turns into a dramatic race against time, because for the villagers, there is soon no doubt as to the identity of the perpetrator. And this time they are determined to take matters into their own hands.\r\n\r\n‘Ms Neuhaus is Germany’s top-selling crime novelist, and her work is catching on throughout Europe’ Wall Street Journal", "asin": "1250039770", "rank": "473598", "city": "Frankfurt", "image": "https://images-na.ssl-images-amazon.com/images/I/51t5LRfF9IL.jpg", "country": "Germany", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}