{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": -37.8142176, "ratings": {"num_ratings": 1062, "rating": 4.4, "reviews": [{"review_sentiment": 1.0, "review_text": "The CDs were defective. I tried two times and both packages would have several discs start in the middle and 4 and 5 were identical. Since I did this twice one would be wise to stay away from the audiobook."}, {"review_sentiment": 5.0, "review_text": "A very impressive first novel. This story is set in Australia and the farming town is in the middle of a two year drought. I very much liked the atmospheric tone of the drought, it took on a character of its own. The story involves a current day tragedy and an unsolved death from twenty years prior. The narrative weaves well between the two stories with plenty of twists and secrets revealed.I loved the author's dedication which reads \"To my parents, Mike and Helen, who always read to me\"."}, {"review_sentiment": 5.0, "review_text": "I picked this book because of its award nomination, so I had high hopes. I was not disappointed. A balanced, realistic and measured crime novel. Not violent, not rushed and not insecure in seeking to create reader adrenaline surges. Similar to Sandford's Virgil Flowers stories, but with less of the macho American syndrome. True quality crime."}, {"review_sentiment": 4.0, "review_text": "I read this on vacation and it held my interest. It took place in Australia, and I enjoyed learning about that locale and the characters the author created around it. It will keep you guessing until the end! I discovered it's a debut novel--but it was very well written. (The only minor criticism was that all nervous people chewed on their thumbnails.)"}, {"review_sentiment": 5.0, "review_text": "This is the best book I've read in a long time. Very believable without all the \"twists\" that make you say yeah right ,like that's gonna happen. The characters felt real, and I liked the suspense. This book wasn't overdone with good guys= supermen or women and the bad guys omnipotent or everybody dying right and left to make the story \"suspenseful,\"I highly recommend this"}, {"review_sentiment": 5.0, "review_text": "Best book I have read in a long time.  Kept my interest to the end."}, {"review_sentiment": 4.0, "review_text": "I usually stick with the same authors. Saw this on amazon and gave it a try.Really enjoyed it. Rich characters and non stop suspenseLoved the ending."}, {"review_sentiment": 3.0, "review_text": "The story was ok, but not what I expected after reading all the reviews. Perhaps my expectations were too high. I found parts of the story to be exceedingly slow...and it took me longer to finish this book than it usually does. After spending the last few weeks working my way through a variety of the Kindle Unlimited selections, I was disappointed that I'd paid $12.99 for this book."}, {"review_sentiment": 5.0, "review_text": "You will be guessing from beginning to end with this well-told suspenseful thriller! Great story, great dialogue, intriguing characters!  I have already recommended it to my friends, and I can't believe that I bought it for $2.99 on Kindle!  I have paid more for much less!"}, {"review_sentiment": 2.0, "review_text": "Pace was so slow, I got bored and didn't finish the story.  Sorry, I wanted to like it."}]}, "authors": ["Jane Harper"], "isbn": "1250105609", "longitude": 144.9631608, "periods": ["2000s", "Recent Releases"], "title": "The Dry", "word_cloud": "defective try time package several start identical twice away audio book impressive first story set farm town year drought much like atmospheric tone drought take character story involve current day tragedy unsolved death twenty year prior narrative weave well story plenty twist secret love author dedication read parent always pick nomination high hope disappoint balanced realistic measure crime not violent rush insecure seek create adrenaline surge story le macho american syndrome quality crime vacation hold interest take place enjoy learn locale character author create keep guess end discover debut well write minor criticism nervous people chew thumbnail best long time believable twist make say right hon character felt real like suspense overdone good superman woman bad guy omnipotent everybody die right left make story suspenseful highly recommend best long time interest end usually stick author amazon give enjoy rich character non suspense loved end story ok expect read review perhaps expectation high find part story exceedingly slow take longer finish usually spend last week work way variety selection disappoint pay guess begin end suspenseful thriller story great dialogue intrigue character already recommend friend buy pay much le slow get bored finish story want", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "INSTANT NEW YORK TIMES BESTSELLER\r\n\r\nA small town hides big secrets in The Dry, an atmospheric, page-turning debut mystery by award-winning author Jane Harper.\r\n\r\nAfter getting a note demanding his presence, Federal Agent Aaron Falk arrives in his hometown for the first time in decades to attend the funeral of his best friend, Luke. Twenty years ago when Falk was accused of murder, Luke was his alibi. Falk and his father fled under a cloud of suspicion, saved from prosecution only because of Luke’s steadfast claim that the boys had been together at the time of the crime. But now more than one person knows they didn’t tell the truth back then, and Luke is dead.\r\n\r\nAmid the worst drought in a century, Falk and the local detective question what really happened to Luke. As Falk reluctantly investigates to see if there’s more to Luke’s death than there seems to be, long-buried mysteries resurface, as do the lies that have haunted them. And Falk will find that small towns have always hidden big secrets.\r\n\r\n“A breathless page-turner, driven by the many revelations Ms. Harper dreams up…You’ll love [her] sleight of hand…A secret on every page.” The New York Times\r\n\r\n“One of the most stunning debuts I've ever read… Every word is near perfect.” David Baldacci", "asin": "1250105609", "rank": "1143", "city": "Melbourne", "image": "https://images-na.ssl-images-amazon.com/images/I/51MFa84Sb9L.jpg", "country": "Australia", "story_arc": ["Tragedy", "Things only get worse"]}