{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 34.054935, "ratings": {"num_ratings": 49, "rating": 3.6, "reviews": [{"review_sentiment": 5.0, "review_text": "Thanks."}, {"review_sentiment": 4.0, "review_text": "Abbott listed her favorite thriller writers in By the Book and having never heard of Steph Cha, I knew I had to read her. In Follow Her Home, Juniper Song, a mid-twenties Korean-American with a fixation for Philip Marlowe, decides to help a close friend who fears his father is having an affair. Song may not actually be a PI but she has many similarities and I think would get listed with the best of the best—terrible smoking habit included. Song is broken from the past, dripping with sarcasm, relentless, and my new favorite main character in a noir series. Speaking of series, I need to go buy Beware Beware and Dead Soon Enough."}, {"review_sentiment": 2.0, "review_text": "Follow Her Home is a very average book. I felt as if I was reading a novel intended for young readers (14 to 16 year olds)  I read the book two weeks ago and can barely remember the content.. Hopefully the writer will grow and evolve over time. Not memorable!"}, {"review_sentiment": 5.0, "review_text": "Super nice new series. LA locale interesting female protagonist and all the call backs to classic LA noir. Checking out the next in the Song saga."}, {"review_sentiment": 5.0, "review_text": "Mysterious Book Report No. 117Follow Her HomeJohn Dwaine McKennaAs regular readers of the Mysterious Book Report, know we work to search out and find debut mysteries written by first-time authors and grow as fans with them, rather than bowing and scraping at the feet of the mega-writers with seven or eight figure publishing contracts from the giants of the industry—although we do admit to occasionally genuflecting near them, by occasionally reviewing the masters in order to serve the entire reading public.  But, our focus will always be on finding our next great author rather than our most favorite old ones.  This week we’ve got a new author and book and, guess what, it’s aimed squarely at the lady readers in the crowd!  It’s unique, it’s good, and, there’s no Irish tough guy cops to be found anywhere in it.  That’s because Follow Her Home,  by Steph Cha is about a Korean-American amateur detective named Juniper Song, who has a thing for the novels of Raymond Chandler and his hard-boiled detective, Phillip Marlowe.  (The character played by Humphrey Bogart in The Maltese Falcon, and always referred to simply as Marlowe.)The mystery begins at a party when Song is asked by her white Yale University classmate, Luke, if she thinks his father, a prominent and powerful Los Angeles lawyer, is having an affair with a young, eighteen  year old Korean beauty named Lori.  Song agrees to investigate and the mystery begins, interwoven with a back story about Iris, Song’s tragic younger sister, also involved with an older white man in a case of what author Cha refers to as ‘yellow fever,’ or older white men who are infatuated with young Asian women and pursue them in trans-racial relationships which are frowned upon by most Asian parents.Follow her Home is dark, brooding, noir-ish and full of references to Phillip Marlow.  It’s fun, entertaining and a fast read.  But, with sentences like this on page 171, “. . . she wore a raspberry cap-sleeve cotton dress with a full skirt and Peter Pam collar with tan ballet flats.”  It’s definitely not a guy type novel.  The ladies however, will love it!"}, {"review_sentiment": 5.0, "review_text": "A crisp re-imagining of classic LA crime, with clear-headed Juniper Song playing the Marlowe role. Observations about modern obsessions make it particularly relevant."}, {"review_sentiment": 5.0, "review_text": "First time reader with this character. A fun read. A bit teen oriented, still worthwhile."}, {"review_sentiment": 2.0, "review_text": "Every sentence is chock full of adjectives, sometimes to its detriment.  Got tired of it after a while."}, {"review_sentiment": 5.0, "review_text": "Excellent rational story.  Excellently written.  I'm off to read her next two."}, {"review_sentiment": 1.0, "review_text": "I read an interview with Steph Cha on the release of her third novel. The description of her novels in the interview seemed so intriguing -- the interview said the novels described various neighborhoods in Los Angeles in \"vivid detail\", including the Angelanos who aren't seen so often (considering all the Hollywood types). There was also quite a bit talked about the ethnic/Korea angle, and how great it was.I was pretty disappointed by the book. It didn't live up to what was promised in the interview, at all. There are practically no discussions of Los Angeles neighborhoods. If driving a Porsche or Volvo down Santa Monica or La Cienega Blvds is a \"vivid description,\" then I need to get into writing, because I could do much better. I learned zero about Los Angeles reading this book. It could have been set in any city.Second, the \"ethnic\" angle was extremely stereotyped. One of the main characters is a beautiful \"flower\" of a girl who dresses up in Asian costumes and works in a hostess club. Give me a freaking break. You also have the domineering Asian mom who risked it all for her kid. Yawn, so freaking stereotyped. This novel has ZERO about the \"real\" Koreatown -- absolutely nothing.The plot was kind of interesting, and I did finish the book. But much of it was so unbelievable that it made the book much less satisfying. Things happen to characters and they decide NOT to call the police for very contrived reasons -- just because if you called the police (which ANYONE would do on about page 10 of this book), the book's over. C'mon, work a little on realistic plotting. And the plot was pushed forward by a Facebook post by one of the main characters that NO ONE would ever make. Ridiculous.And yeah, the Marlowe references were way overdone. This is a 350 page book, and it says \"Marlowe\" over 75 times. That's like once every 4 pages or so. We get it, the author is trying to make Song (the heroine) into the modern day, feminine, Korean Marlowe. But the author thinks we are stupid, because she has to pound us over and over again with this comparison. It gets old so very fast. I actually found Song to be a fairly compelling character -- she, and some of the backstory with her sister Iris, are the only good parts of the book. But overall, this is a very, very poor novel -- and it's not nearly as advertised."}]}, "authors": ["Steph Cha"], "isbn": "1250009626", "longitude": -118.244476, "periods": ["2000s", "Recent Releases"], "title": "Follow Her Home (Juniper Song Mysteries)", "word_cloud": "thanks list favorite thriller writer never hear know fixation decide help friend fear father affair actually many similarity think list best smoking habit include break past dripping sarcasm relentless new favorite main character nor series series need average felt read intend young reader year old week ago barely writer grow evolve time not memorable nice new series locale interesting female protagonist call back classic next saga mysterious regular reader mysterious know work search find debut mystery write author grow fan rather bow scrap foot figure publishing contract giant admit occasionally genuflect occasionally review master order serve entire reading public focus always find next great author rather favorite old one week get new author guess aim squarely lady reader crowd unique good tough guy cop find anywhere amateur detective name thing novel detective character play maltese always refer simply mystery begin party ask white classmate think prominent powerful lawyer affair young eighteen year old korean beauty name agree investigate mystery begin interweave story tragic younger sister also involved older white man case author refers yellow fever older white men infatuate young asian woman relationship frown dark brood full reference fun entertain fast sentence page wore raspberry cotton dress full skirt collar tan ballet definitely guy lady however love crisp classic crime play role modern obsession make particularly relevant first time character fun bit teen orient still worthwhile sentence chock full adjective sometimes detriment tire excellent rational story write next interview release third description novel interview seem intriguing interview say novel describe various neighborhood detail include see often consider type also quite bit talked angle great pretty disappointed live promise interview practically discussion neighborhood drive description need write much better learn read ethnic angle extremely stereotype main character beautiful flower girl dress asian costume work hostess club freaking break also domineer asian mom risk kid freaking stereotype real absolutely plot kind interesting finish much unbelievable make much le satisfying happen character decide police contrive reason call police work little realistic plotting plot push forward post main character ever yeah reference way overdone page say time like page get author try make heroine modern day feminine korean author think stupid pound comparison get old fast actually find fairly compel character backstory sister good part overall poor nearly advertise", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "A stunning, edgy debut introducing Juniper Song, an amateur sleuth taking on the darkness in the veins of L.A. with razor-sharp wit and a breaking heart.\r\n\r\nJuniper Song knows secrets–how to keep them and how to search them out. As a girl, noir fiction was her favorite escape, and Philip Marlowe has always been her literary idol. So when her friend Luke asks her to investigate a possible affair between his father and a young employee, Juniper (or \"Song\" as her friends call her) finds an opportunity to play detective. \r\n\r\nDriving through L.A.'s side streets, following leads, tailing suspects-it all appeals to Song's romantic ideal of the noir hero. But when she's knocked out while investigating a mysterious car and finds a body in her own trunk, Song lurches back to the real L.A., becoming embroiled in a crime that goes far beyond role play. What's more, this isn't the first time Song has stuck her nose in other people's business. \r\n\r\nAs she fights to discover the truth about her friend's family, Song reveals one of her own deeply hidden secrets, something dark and damaging, urging her to see the current mystery through, to rectify the mistakes of her past life.\r\n\r\nA dazzling debut from fresh new talent Steph Cha, featuring a strong, modern, sharply observant heroine with an unforgettable voice, Follow Her Home takes readers through dangerous twists and turns, beyond the glittering high-rises and freeways of L.A. on a case that will stay with them long after the final page.\r\n\r\n\"[Song] is a compelling and original protagonist… One only hopes that Cha and her driven, neo-noir detective have more opportunities to explore those troubling intersections over many books to come.\" LA Times\r\n\r\n", "asin": "1250009626", "rank": "1040324", "city": "Los Angeles", "image": "https://images-na.ssl-images-amazon.com/images/I/51eGNndWXHL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}