{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 51.50853, "ratings": {"num_ratings": 62, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent!"}, {"review_sentiment": 5.0, "review_text": "Llosa's monumental work is the essential companion to Conrad's Heart of Darkness. A disturbing but a necessary exercise to read it."}, {"review_sentiment": 5.0, "review_text": "Learned about an individual who made quite a difference in history"}, {"review_sentiment": 4.0, "review_text": "I have always felt that the sexual misdeeds of priests must have led to terrible feelings of betrayal by those with a lifelong commitment to the church either as priests or nuns.  Given the profoundness of this commitment, it is not surprising that intact systems of denial are present.  However, the book is about the inevitable breakdown of that denial and the acceptance of responsibility for the role of an enabler and all the pain that is involved.  The reader travels this journey with the narrator as he, christlike, suffers the blows of the angry public and eventually accepts his role in the collective guilt.  A great book.Oops!  Wrong book.  This is a review for the \"History of Loneliness\"  by John Boyne"}, {"review_sentiment": 4.0, "review_text": "Such was the intriguing nature of the life of Sir Roger Casement, it is almost as if had he not lived a novelist with the skills of Mario Vargas Llosa would have had to invent him.  Casement was the world's moral crusader of the late Victorian era, exposing extreme brutality in the colonisation of the Congo in the name of Belgium's King Leopold and similar horrors in a parallel process of exploitation in Peru.  He was knighted for his services to humanity, but these  experiences took a heavy toll on his health and his relationships.  Simply reading about them in Vargas Llosa's elegantly crafted narrative is shocking enough, raising profound questions about human nature and its propensity for evil and bringing untold horror to innocent people in the name of some misconceived greater mission.  Parallels are inevitable with the Holocaust, Stalin's Terror and Mao's re-education campaigns.  The other parts of Casement's life sit awkwardly with these ethical exposures and in the structure of \"The Dream of the Celt\".  I thought Casement's youth was beautifully told, but the issues of his sexuality were never fully resolved.  The biggest gap of all, however, was what lay behind his final crusade to free Ireland from the British yoke.  For this cause he seemed willing to surrender everything including ultimately his life, but one is never fully convinced why.  Perhaps that was exactly Vargas Llosa's intention."}, {"review_sentiment": 3.0, "review_text": "Not one of his better books."}, {"review_sentiment": 1.0, "review_text": "So vile and violent that I could not finish it, characters were not developed enough to care about them.  Seemed like a lot of violence for violence sake.  An epidemic of hand and penises removal often from live natives so that they could shown to justify the consumption of  ammunition used to hunt was the end of my read."}, {"review_sentiment": 3.0, "review_text": "I've long had the fantasy of meeting MVL in an airport somewhere and telling him I'd read The Feast of the Goat and The War of the End of the World in their spanish editions having taken up the language seriously in my late 40s.  And added to those two, but yet unfinished, is his autobiography El Pez en el Agua.  Which doesn't make me anything more than a fan who has also read most of his other offerings, last year revisiting Death in the Andes and Who Killed Palomino Molero?  That out of the way, y disculpa me por eso, I found The Dream of the Celt something of a chore to finish, as instructive and well written as it was.  MVL is a storyteller with few peers and normally develops even minor characters with remarkable depth.  The Dream of the Celt reads more like a biography of Roger Casement: how he worked tenaciously to expose murderous exploitation in the Congo and the Peruvian Amazon before switching his energies to Irish independence.  The history is complemented, as you are probably aware from other reviews, with Casement's ruminations and dreams of his mother as he awaits his inevitable hanging for treason.  If you've never read Vargas Llosa this is not the novel with which to start;  the first two mentioned above are worthy of second and third readings."}, {"review_sentiment": 5.0, "review_text": "A terrific novel based on the life of Roger Casement.  Vargas Llosa shows his virtuosity as a chronicler of the human condition via fiction.  The story is about Roger Casement, the Irish Brit turned Irish nationalist by his experiences of colonialism in the Belgian Congo and the Peruvian Amazon.  Vargas Llosa entrances the reader with this descriptions of human emotions and living environments.  One can feel the heat of the Amazon, or the claustrophobia of Casement's prison, or the refreshment on the skin of the cool waters wher Casement swam for recreatoin. One can also experieince the depths of emotion and passions, as Casement confronts the cruelties inflicted on the natives by Europeans or by native elites in the Congo or the Amazon, or as he struggles with decisions over when and how to organize an insurrection in Ireland, or, most poignantly, his struggles over his sexuality, and his actual or imagined exploits.  I recently read a blurb on how reading fiction helps in learning how to interact socially under various circumstances.  I think this book is a perfect example of not just that, but also of how the mind struggles and wins, and sometimes loses, in its daily battles with the challenges of reality, be they personal harm inflicted by nature or others, or by the constant struggle to simply stay afloat, above the sadness and even depression that is sometimes just below ground.  The story itself about Casement's evolution from English knight to traitor is fascinating.  Vargas Llosa masterfully depicts the various players in the drama, from the fauna and flora of the various environments, to the personas that crossed Casement's paths - his mother, his fellow revolutionaries, the various culprits supporting and heroes fighting the injustices Casement witnessed, the priest and Casement's jailer, among many.  This is a novel that will endure in the memory of  its readers."}, {"review_sentiment": 5.0, "review_text": "The biography of a man who gave a big contribution to the history of the world we see today...a man that unfortunately nobody knows but can teach us so much!"}]}, "authors": ["Mario Vargas Llosa"], "isbn": "1250033322", "longitude": -0.12574, "periods": ["1900s", "Recent Releases"], "title": "The Dream of the Celt", "word_cloud": "excellent monumental work essential companion disturb necessary exercise learn individual make quite difference history always felt sexual misdeed priest lead terrible feeling betrayal lifelong commitment church priest nun profoundness commitment surprising intact system denial present however inevitable denial acceptance responsibility role enabler pain involve travel journey narrator christlike suffers blow angry public eventually accept role collective guilt great review such intriguing nature life almost live novelist skill world moral crusader late victorian era expose extreme brutality colonization name similar horror parallel process exploitation knight service humanity experience take heavy toll health relationship read elegantly craft narrative shocking enough raise profound question human nature propensity evil bring untold horror innocent people name misconceive greater mission inevitable campaign part life sit awkwardly ethical exposure structure think beautifully tell issue sexuality never fully resolve biggest gap however lay final crusade free yoke cause seem willing surrender everything include ultimately life never fully convinced perhaps exactly intention not better so vile violent character develop enough care lot violence violence sake epidemic hand penis removal often live native show consumption ammunition use hunt end long fantasy meeting airport somewhere tell spanish edition take language seriously late add yet unfinished autobiography e make anything fan also offering last year revisit way disculpa echo find something chore finish instructive well write storyteller peer normally develop even minor character remarkable depth read biography work tenaciously expose murderous exploitation switch energy irish independence history complement probably aware review rumination dream await inevitable hang treason never start first mention worthy second third reading terrific base life show virtuosity chronicler human condition fiction story turn irish nationalist experience colonialism belgian entrance description human emotion live environment feel heat claustrophobia prison refreshment skin cool water whee swam recreation also experience depth emotion passion confronts cruelty inflict native native elite struggle decision insurrection poignantly struggle sexuality actual imagine exploit recently blurb reading fiction help learn socially various circumstance think perfect example also mind struggle win sometimes lose daily battle challenge reality personal harm inflict nature others constant struggle simply afloat sadness even depression sometimes grind story evolution knight traitor fascinate masterfully depict various player drama fauna flora various environment persona cross path mother fellow revolutionary various culprit support hero fight injustice witness priest casement jailer many endure memory reader biography man give big contribution history world see today man unfortunately nobody know teach much", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "A painstakingly researched and lively novel about a neglected human rights pioneer by the Nobel Laureate Mario Vargas Llosa\r\n\r\nIn 1916, the Irish nationalist Roger Casement was hanged by the British government for treason. Casement had dedicated his life to improving the plight of oppressed peoples around the world. But when he dared to draw a parallel between the injustices he witnessed in African and American colonies and those committed by the British in Northern Ireland, he became involved in a cause that led to his imprisonment and execution. Ultimately, the scandals surrounding Casement's trial and eventual hanging marred his image to such a degree that his pioneering human rights work wasn't fully reexamined until the 1960s. Dream of the Celt is a fascinating fictional account of an extraordinary man in the original and dynamic style of Nobel Laureate Mario Vargas Llosa.\r\n\r\nTranslated from the Spanish by Edith Grossman\r\n\r\n“Mario Vargas Llosa has done an inestimable service to the memory of a great man.” ―John Banville, The New York Review of Books", "asin": "1250033322", "rank": "226307", "city": "London", "image": "https://images-na.ssl-images-amazon.com/images/I/51uw8HhTq-L.jpg", "country": "England", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}