{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 53.3497645, "ratings": {"num_ratings": 86, "rating": 4.3, "reviews": [{"review_sentiment": 5.0, "review_text": "Well-drawn characters that the reader can care about; plot keeps you guessing. And, as ever, you want to take Quirke home and mind him."}, {"review_sentiment": 5.0, "review_text": "I loved this book, I love this series and I love Benjamin Black!  Quirke is a great character.  His internal monologue has a Leopold Bloom quality.  There are many little buts of writing that are so beautiful and insightful.  Hackett is an excellent counter character a bit in the vein of Andy Dalziell or Vera Stanhope, gruff and plain spoken but incredibly clever."}, {"review_sentiment": 5.0, "review_text": "As described and fast shipping/"}, {"review_sentiment": 3.0, "review_text": "Not as good as previous Quirke novels."}, {"review_sentiment": 3.0, "review_text": "Well drawn characters and a pleasant read, but not much heft for a novel and not much mystery for a mystery."}, {"review_sentiment": 5.0, "review_text": "Never disappointed"}, {"review_sentiment": 5.0, "review_text": "An incredibly fun book to read, has to rank right up there with my favorite BB novels.So many milestones are passed here in addition to the great plot--Mal dying, Quirke has a new love interest, Phoebe splits with David, Costigan finally gets justice... couldn't ask for from Banville."}, {"review_sentiment": 5.0, "review_text": "I won't write much because I'm a little stunned by how good this novel is and don't feel competent to write a full review. As the plot progresses, the reader is exposed to an intricate web of interlocking details that lead not only to the \"un-tying the knot\" of the mystery but also to a comprehensive inderstanding of Quirke--past, present, and future. It is a breathtaking revelation of the human journey for self-understanding.Since so much is resolved--and so intricately--I am not surprised that this is apparently the last book in the Quirke series. I usually go out of my way to read a series in order, but now will go back to enjoy this character in the first 5 books."}, {"review_sentiment": 5.0, "review_text": "See my written review in large print paperback version."}, {"review_sentiment": 5.0, "review_text": "Love any book by this author.Characters just come to life.I am always a bit sad when I finish the book."}]}, "authors": ["Benjamin Black"], "isbn": "1250117879", "longitude": -6.2602732, "periods": ["1900s", "Recent Releases"], "title": "Even the Dead: A Quirke Novel", "word_cloud": "character care plot keep guess ever want home mind love love series love great character internal monologue quality many little buts write beautiful insightful excellent counter character bit vein gruff plain speak incredibly clever describe fast not good previous novel well draw character pleasant much heft much mystery mystery never disappoint incredibly fun rank right favorite many milestone pass addition great plot die new love interest split finally get justice much little stun good feel competent write full review plot progress expose intricate web interlock detail lead knot mystery also comprehensive understand past present future breathtaking revelation human journey much resolve intricately surprise apparently last series usually go way series order go back enjoy character first write large print paperback version come always bit sad finish", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "A suspicious death, a pregnant woman suddenly gone missing: Quirke's latest case leads him inexorably toward the dark machinations of an old foe\r\n\r\nPerhaps Quirke has been down among the dead too long. Lately the Irish pathologist has suffered hallucinations and blackouts, and he fears the cause is a brain tumor. A specialist diagnoses an old head injury caused by a savage beating; all that's needed, the doctor declares, is an extended rest. But Quirke, ever intent on finding his place among the living, is not about to retire.\r\n\r\nOne night during a June heat wave, a car crashes into a tree in central Dublin and bursts into flames. The police assume the driver's death was either an accident or a suicide, but Quirke's examination of the body leads him to believe otherwise. Then his daughter Phoebe gets a mysterious visit from an acquaintance: the woman, who admits to being pregnant, says she fears for her life, though she won't say why. When the woman later disappears, Phoebe asks her father for help, and Quirke in turn seeks the assistance of his old friend Inspector Hackett. Before long the two men find themselves untangling a twisted string of events that takes them deep into a shadowy world where one of the city's most powerful men uses the cover of politics and religion to make obscene profits.\r\n\r\nEven the Dead--Benjamin Black's seventh novel featuring the endlessly fascinating Quirke--is a story of surpassing intensity and surprising beauty.", "asin": "1250117879", "rank": "164245", "city": "Dublin", "image": "https://images-na.ssl-images-amazon.com/images/I/51hMt89CVkL.jpg", "country": "Ireland", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}