{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 52.5170365, "ratings": {"num_ratings": 29, "rating": 3.8, "reviews": [{"review_sentiment": 3.0, "review_text": "disappointed in writing itself."}, {"review_sentiment": 5.0, "review_text": "This is a beautifully written book.  Astute and wise observations and conclusions are couched in such gorgeous language that many sentences are such that I am inclined to memorize them.  There is a certain freedom in his writing which presumably comes from the book being a \"Portrait\" rather than a \"History\" strictly speaking which conversely makes it more \"real.\""}, {"review_sentiment": 1.0, "review_text": "Received today, first two pages TORN!!!"}, {"review_sentiment": 4.0, "review_text": "A fun way to cover the history of Berlin.  A thoughtfully collected set of mini-biographies that string together to capture the changing culture of Berlin."}, {"review_sentiment": 5.0, "review_text": "Slow start, but sequential history in a novel, but factual, form.  Good history.  Well written.  Nice background of Berlin."}, {"review_sentiment": 5.0, "review_text": "I read this book while spending a three-week intensive experience in Berlin, and the book may have been the best part of the trip. Reading about the history of the city, while experiencing it at the same time was astounding. If you're thinking about a visit to the amazing city of Berlin, TAKE THIS BOOK WITH YOU! You will not regret reading it - it brought me to tears more than once, and the summation at the end of the book made my Berlin experience so much more profound."}, {"review_sentiment": 1.0, "review_text": "Dumb, stupid, poorly designed, badly writing crap."}, {"review_sentiment": 3.0, "review_text": "Berlin is an interesting book.  I bought it and read it because I am planning a trip that starts in Berlin.  The author does take some time to explain some of the touristy spots with a great deal of background of famous characters who either grew up there or came there for the experience.  Most of these characters are from a by-gone-era that most would not know about.  The most recent one was about David Bowie.  If you are interested in history, especially German history, then this one is for you."}, {"review_sentiment": 4.0, "review_text": "Very well written and informative. The fact that there are no page numbers included in the digital edition made citing the book as a reference difficult."}, {"review_sentiment": 5.0, "review_text": "Since the advent of photography, portraiture has become less an exercise in reproducing exactly the features of the subject and more about capturing the essence. In “Berlin: Portrait of a City through the Centuries”, Rory MacLean has done just that. By means of individual portraits of two dozen of the cities inhabitants he attempts to arrive at the soul of this at once grand and troubled European capital. His opening chapter considers the fresco of the Totentanz (Dance of Death) in the Marienkirche, Berlin’s oldest surviving church and this becomes, in a way, the leitmotiv of the entire book. The book combines the stories of the well-known, the powerful and the famous people with those whose names we may know but nothing more. In some cases, he even creates a few individual characters out of types. This may rankle a true historian, but this book – while historical – is not strictly speaking a history. I guess you might call this work “novelistic history” in the same way that there are historical novels. Whatever you call it, it is a fascinating read. He uses a technique that reminds one of Arthur Schnitzler’s play “Reigen” where one of a pair of lovers appears in two consecutive scenes, thus linking all the players together. The book flows like a dance where one partner is handed off to the next until the last scene entitled appropriately “Let’s Dance”.Whether you know Berlin well already or even if you have never been, this book will give you an affectionate yet unsentimental insight into this important city."}]}, "authors": ["Rory MacLean"], "isbn": "1250074908", "longitude": 13.3888599, "periods": ["1600s", "1700s", "1800s", "1900s", "1500s"], "title": "Berlin: Portrait of a City Through the Centuries", "word_cloud": "disappointed writing beautifully write wise observation conclusion couch gorgeous language many sentence incline certain freedom write presumably come rather strictly speak conversely make real receive today first page tear fun way cover history thoughtfully collect set string together capture change culture slow start sequential history factual form history write spend intensive experience part trip history experience time astound thinking visit amaze regret read bring tear summation end make experience much stupid poorly design badly write crap interest buy plan trip start author time touristy spot great deal famous character grow come experience most character recent interested history especially german history very well write informative fact page number include digital edition make cite reference difficult advent photography portraiture le exercise reproduce exactly feature subject capture essence do mean individual portrait dozen city inhabitants attempt arrive soul grand troubled european capital open chapter considers fresco oldest survive church become way leitmotiv entire combine story powerful famous people name nothing case even create individual character type true historian historical strictly speak history guess work novelist history way historical novel call fascinate use technique remind play pair lover appear consecutive scene thus link player together flow dance partner hand next last scene entitle appropriately let well already even never give affectionate yet unsentimental insight important", "genres": ["Essay", "History"], "summary": "A Washington Post Best Book of the Year\r\n\r\nBerlin is a city of fragments and ghosts, a laboratory of ideas, the fount of both the brightest and darkest designs of history's most bloody century. The once arrogant capital of Europe was devastated by Allied bombs, divided by the Wall, then reunited and reborn as one of the creative centers of the world. Today it resonates with the echo of lives lived. No other city has repeatedly been so powerful and fallen so low; few other cities have been so shaped and defined by individual imaginations.\r\n\r\nBerlin tells the volatile history of Europe's capital over five centuries through a series of intimate portraits of two dozen key residents: the medieval balladeer whose suffering explains the Nazis' rise to power; the genius Jewish chemist who invented poison gas for First World War battlefields and then the death camps; the iconic mythmakers like Christopher Isherwood, Leni Riefenstahl, and David Bowie, whose heated visions are now as real as the city's bricks and mortar. Alongside are portrayed some of the countless ordinary Berliners whose lives can only be imagined: the ambitious prostitute who refashioned herself as a baroness, the fearful Communist Party functionary who helped to build the Wall, and the American spy from the Midwest whose patriotism may have turned the course of the Cold War.\r\n\r\nBerlin is a history book like no other, with an originality that reflects the nature of the city itself. In its architecture, through its literature, in its movies and songs, Berliners have conjured their hard capital into a place of fantastic human fantasy. No other city has so often surrendered itself to its own seductive myths. Berlin captures, portrays, and propagates the remarkable story of those myths and their makers", "asin": "1250074908", "rank": "580579", "city": "Berlin", "image": "https://images-na.ssl-images-amazon.com/images/I/5124viDA3PL.jpg", "country": "Germany", "story_arc": ["Tragedy", "Things only get worse"]}