{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 58, "rating": 4.2, "reviews": [{"review_sentiment": 3.0, "review_text": "\"The willingness to impose restrictions on private rights in the interest of the quality of the shared space\" provides the essential crux of how Baron Haussman and Napoléon III were able to stimulate the rebirth of Paris into the city that so many of us know and love. An entertaining read for any Francophile/Parisophile but, unlike Haussman and Paris, Paris Reborn lacks a driving conviction to create something cohesive in style and timeless in quality.The unfortunate aspect of this book is that the author, Stephane Kirkland, never laid a firm foundation for me (and I imagine most readers) to create a workable and multi-dimensional understanding of all the elements needed give Paris its rebirth. This is to say that Kirkland expects the reader to have an image of what Paris was like before it became the Paris known today. Unfortunately, even those who know Paris well, (I'm including myself) will have trouble following the litany of street, buildings, and landmarks recounted through out. At times this made me think the book should be read with two maps in hand : one of medieval Paris and one of modern day Paris. This cumbersome act would have no doubt added much to my ability to create a multidimensional sense of how incredible Paris' rebirth was/is in a historical context.The recounting of the Second Empire's history also follows multiple paths that fail to weave a cohesive backdrop (or a rather complex backdrop). Kirkland jumps between years and historical figures in addition to topics of finances, politics, culture, and aesthetics but never manages to tie it all together. Instead these topics are interjected among each other and it is left to the reader to organize them. I'm thankful that the book doesn't follow the linear path of time but much could have been done to give the reader more structure on which to drape the different elements of this history.Nonetheless, I enjoyed this book for its ability to transport me to a Paris unknown to me and to the Paris that I love. It is a book I would recommend to anyone want to learn more about the Second Empire or the history of Paris. If anything this book has reminded that Paris is worth a visit!"}, {"review_sentiment": 5.0, "review_text": "Well written history of the remaking of Paris under Napolean III and Baron Haussman. It helped me appreciate Paris to a much greater degree on a recent visit and also provided more background and context related to a course I was taking on the Impressionists."}, {"review_sentiment": 5.0, "review_text": "A fascinating story of why we all love Paris.  I highly recommend this book !!"}, {"review_sentiment": 5.0, "review_text": "Fantastic!"}, {"review_sentiment": 5.0, "review_text": "Haussmann may have been the first 20th-century man. (All right, second to Odysseus.) The transformation of Paris is a fantastically readable tale of two flawed, powerful, visionary \"Power Brokers.\" In less than 20 years, the 19th century turned modern, and the Paris of today is enduring proof of what was accomplished."}, {"review_sentiment": 4.0, "review_text": "In this well written history of Second Empire Paris, Kirkland wants to redress what he sees as a problem in histories about Haussmann and Paris. Kirkland wants to include Napoleon III in the story too. He has a point. When we think about the Paris of this age we think about Haussmann's Paris. We don't think about Napoleon III's Paris. So Kirkland focuses on Napoleon III but he also focuses on the urban, economic, social, scientific and cultural forces that allowed both Haussmann and Napoleon III to succeed in transforming Paris over two decades in the nineteenth century.The author wants you to believe that Napoleon III was the true reason we have the Paris of today. While he is not wrong he is not right either. The vast majority of why we have Paris the way it is today is because of Baron Haussmann. Also, the author lovingly describes the transformation of so many streets but sadly didn't provide a single map of Paris. There are a few color depictions at the back of the book of notable people (3). But I would rather have had two maps to see what Paris looked like before Haussmann's transformations and what it looked like after.If you want a light history of the time period that focuses on Paris then get this book. It's an easy read."}, {"review_sentiment": 1.0, "review_text": "In his book, Paris Reborn: Napoléon III, Baron Haussmann, and the Quest to Build a Modern City, Stephane Kirkland argues that the history of the transformation of Paris under Baron Haussmann cannot be understood without including Napoleon III in the narrative. To Kirkland, Haussmann is too often viewed as the beginning and end of Paris’s urban reforms. Further, Kirkland does not see the transformation of Paris as a fundamentally positive thing. He instead argues that the re-development of Paris was “a heavy-handed enterprise, which achieved its ends at tremendous human and cultural cost and wiped from the map an old, much-loved Paris that we will never know” (2).Lastly, Kirkland argues that, under the Second Empire, Paris became a monument itself. While past rulers and legislatures had erected numerous monuments throughout the city, Napoleon III and Haussmann intended for Paris to be a monument to global humanism. While he decries Napoleon III’s iron fist, much of this book simply consists of Kirkland saying how much he loves the beauty of Paris. For good measure, Kirkland compares late nineteenth-century Paris to late nineteenth-century New York in order to illustrate how Paris was so perfect that Americans could not successfully emulate it.While this book is informative, it is not suitable for academics. Instead, it is a work aimed for a general public that is interested in the history of Paris. While the writing is easy to follow, it is not very good. When discussing the newly installed emperor’s designs on France, Kirkland writes, “In early 1853, no one yet knew what to expect from the reign of this newly installed emperor. One of the first things he did was unexpected: He got married” (52). It is true that this is an interesting biographical fact, but the author does not execute it well.Worse, the author’s use of sources are very slim and he gives little reference to other histories of Paris—within the academy or without. When there are citations, the reader is left wondering why Kirkland would choose those sources. For example, the author has six citations in the first chapter. Of them, four are directly quoted from Voltaire and one points to a biography of Voltaire that was written in 1867. Recent secondary sources are uncommon. Moreover, there is scarcely an introduction or a conclusion to his work. While there are chapters that function in this role, they do not add anything meaningful to his text.While this book will work fine for someone who wants a light read about the emergence of Paris as we know it today, it should not be seen as a serious work of scholarship."}, {"review_sentiment": 4.0, "review_text": "I have read a lot about the history of Paris. This is an excellent history of how the city evolved in the mid 1800s during the reign of Napoleon III. Such books, I think, really help you to appreciate the city when you visit."}, {"review_sentiment": 4.0, "review_text": "A very well written history of the rebuilding of Paris under Louis Napoleon. The author provides a well detailed history of how Paris was transformed from a midevil village to the beautiful, well planned city of today. This represents the largest urban renewal in history, taking a number of decades to accomplish and billions of dollars. It all started with Napoleon's reign and his vision of a world-class, magnificent capital worthy of Napoleon's France. The book is well written, but the amount of detail makes it a slow, laborious read. However, it does shed light on a significant but little known aspect of a major period in French history. The book documents the many problems Napoleon and the man in charge of executing his plan, Baron Haussmann, faced and overcame. These problems are similar to those faced today for any urban renewal project; money, politics, and politicians against progress. It is interesting to note that even Napoleon,a dictator in all but name, had these problems. But, it did get done and it is well documented in this history. My only issue with the book is the laborious passages describing in excruciating detail some aspects of the renewal that I think could have been described in a more readable form."}, {"review_sentiment": 5.0, "review_text": "A fascinating story, told in an engaging manner.  If only more works about history were as interesting as this one."}]}, "authors": ["Stephane Kirkland"], "isbn": "1250042682", "longitude": 2.3514992, "periods": ["1800s", "1900s", "Recent Releases"], "title": "Paris Reborn: Napoléon III, Baron Haussmann, and the Quest to Build a Modern City", "word_cloud": "willingness impose restriction private right interest quality share space provide essential crux able stimulate rebirth many know entertaining lack drive conviction create something cohesive style timeless unfortunate aspect author never lay firm foundation imagine reader create workable understanding element need give rebirth say expect image become know today unfortunately even know well include trouble follow litany street building landmark recount time make think map hand medieval day cumbersome act add much ability create multidimensional sense incredible rebirth historical recount second history also follow multiple path fail weave cohesive backdrop rather complex backdrop jump year historical figure addition topic finance politics culture aesthetic never manage together instead topic interject left organize thankful follow linear path time much do structure drape different element enjoy ability transport unknown love anyone want learn history anything remind visit well write history remake help much greater degree recent visit also provide background context related course take impressionist fascinating story highly recommend fantastic man right second transformation fantastically readable tale flaw powerful visionary power broker le year century turn today endure proof accomplish well write history want redress see problem history want include story point age think think focus also focus urban economic social scientific cultural force allow transform decade nineteenth author want believe true reason today wrong right vast majority way today also author lovingly describes transformation many street sadly provide single map color depiction back notable people rather map see look transformation look want light history time period focus easy argue history transformation understand include narrative often view begin end urban reform further transformation fundamentally positive thing instead argue enterprise achieve end tremendous human cultural cost wipe map old never know argue become monument past ruler legislature erect numerous monument intend monument global humanism decries iron fist much simply consist say much love beauty good measure compare late late order illustrate perfect successfully informative suitable academic instead work aim general public interested history write easy follow good discuss newly instal emperor design write early yet know expect reign newly instal emperor first thing unexpected get married true interesting biographical fact author execute author use source slim give little reference history academy citation leave wondering source example author citation first chapter directly quote point biography write secondary source uncommon moreover scarcely introduction conclusion work chapter function role add anything meaningful work fine someone want light emergence know today see serious work scholarship lot history excellent history evolve mid reign such think really visit well write history rebuild author provide well detailed history transform mi devil village beautiful well plan today represent largest urban renewal history take number decade accomplish billion dollar start reign vision magnificent capital worthy well write amount detail make slow laborious however shed light significant little know aspect major period french history document many problem man charge execute plan face problem similar face today urban renewal project money politics politician progress interesting note even dictator name problem do well documented history issue laborious passage describe excruciate detail aspect renewal think readable form fascinating story tell engage manner work history interest", "genres": ["Art & Architecture", "History", "Politics", "Urbanism"], "summary": "In the mid-nineteenth century, the Paris we know today was born, the vision of two extraordinary men: the endlessly ambitious Emperor Napoléon III and his unstoppable accomplice, Baron Haussmann. This is the vivid and engrossing account of the greatest transformation of a major city in modern history.\r\n\r\nTraditionally known as a dirty, congested, and dangerous city, Paris was transformed in an extraordinary period from 1848 to 1870, when the government launched a huge campaign to build streets, squares, parks, churches, and public buildings. The Louvre Palace was expanded, Notre-Dame Cathedral was restored, and the masterpiece of the Second Empire, the Opéra Garnier, was built. A very large part of what we see when we visit Paris today originates from this short span of twenty-two years.\r\n\r\nThe vision for the new Paris belonged to Napoléon III, who had led a long and difficult climb to absolute power. But his plans faltered until he brought in a civil servant, Georges-Eugène Haussmann, to take charge of the implementation. Heedless of controversy, at tremendous cost, Haussmann pressed ahead with the giant undertaking until, in 1870, his political enemies brought him down, just months before the collapse of the whole regime brought about the end of an era.\r\n\r\nStephane Kirkland's Paris Reborn is a must-read for anyone who ever wondered how Paris, the city universally admired as a standard of urban beauty, became what it is.", "asin": "1250042682", "rank": "206178", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/51KmG7B56CL.jpg", "country": "France", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}