{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 50.0874654, "ratings": {"num_ratings": 52, "rating": 4.5, "reviews": [{"review_sentiment": 5.0, "review_text": "Spellbound, so incredibly lifting and yet so incredibly sad, I could not put it down.  Loving classical music and reading her life story, against so many odds, wow is all I can say."}, {"review_sentiment": 5.0, "review_text": "An inspiring true story. A must read!"}, {"review_sentiment": 5.0, "review_text": "I have read many books about the holocaust. After personally visiting Terezin, the concentration camp near Prague a few years ago, her words took me there and what it must have like to endure this catastrophe.  My own relatives were sent there and I felt comforted that Alice had probably provided some solace for them admist their horrific daily lives."}, {"review_sentiment": 3.0, "review_text": "I love reading personal holocaust stories - this one is a bit difficult to get through because of all the musical references and sideline stories - but is good story."}, {"review_sentiment": 5.0, "review_text": "Great story"}, {"review_sentiment": 5.0, "review_text": "This story gives insight to how a person whose world was turned upside down, survived through her love of music."}, {"review_sentiment": 4.0, "review_text": "This heartbreaking yet wonderfully beautiful story was the perfect book to read before heading on a trip to Prague. After seeing a documentary \"Defiant Requiem\" about the Jewish Ghetto Terezine and the people who had suffered so much there made this book was even more intriguing to read. Alice, her friends, family and colleagues -- all accomplished musicians, composers and performers lifted one another up during such horrific times of Nazi Germany and the holocaust. It was a difficult read due to the suffrage of so many, but worth pushing through it, as Alice herself is a woman you won't forget any time soon, she haunts me weeks after I have finished the book."}, {"review_sentiment": 5.0, "review_text": "No one should have to endure what the remarkable woman did She was caught up in the worst place and still managed to survive. She lost her childhood and yet managed to learn how to play the piano. Taught many other to play as well . I wish there were cd s available with her music.May she rest in peace and may her memory be a blessing"}, {"review_sentiment": 4.0, "review_text": "Having visited Prague and Terezin I was very interested to read this book.  I was well written and a balanced account of the time.  No sensational descriptions of the horrors although anyone familiar with the history of that time knows they were present.  The only omission was no mention of the government officials and other artists also imprisoned there.  I especially appreciated the few measures of the Chopin Etudes at the beginning of the sections related to the concerts including them and the short descriptions of each etude.  It is a loving account of an amazing life and talent without being overly sentimental.  Her ability to take life as it came most of the time added much to the strength of the account and her character, especially in the relationship with her son.  Truly a remarkable life!"}, {"review_sentiment": 2.0, "review_text": "What could have been a great book is merely an interesting book. I don't know who did the translation, but it is a poor one. There are grammar mistakes and the language is extremely simplistic. The best parts are the description of the Chopin Etudes interwoven with highlights from stories about other people.This book needs some serious editing because the mistakes are irritating and distracting, and the poverty of the writing style simplifies the story to the point that it is hard to feel the emotion, drama and tensions which should  be a foremost in our minds and hearts while reading.I can not recommend this book."}]}, "authors": ["Melissa Müller", "Reinhard Piechocki"], "isbn": "1250007410", "longitude": 14.4212535, "periods": ["1900s", "Recent Releases"], "title": "Alice's Piano: The Life of Alice Herz-Sommer", "word_cloud": "incredibly lift yet incredibly sad classical music read story many odds wow say inspiring true story many holocaust personally visit concentration camp year ago word take endure catastrophe relatives send felt comforted probably provide solace admits horrific daily life love read personal holocaust story bit difficult musical reference sideline story good story story story give insight person world turn upside survive love music heartbreaking yet wonderfully beautiful story perfect head trip see documentary people suffer much make even intriguing friend family colleague accomplish musician composer performer lift horrific time holocaust difficult due suffrage many worth push woman time soon haunt week finish one endure remarkable woman catch worst place still manage survive lose childhood yet manage learn play piano many play well wish cd available rest peace bless have visit interest well write balance account time sensational description horror anyone familiar history time know present omission mention government official artist also imprison especially appreciate measure begin section related concert include short description etude love account amazing talent overly sentimental ability come time add much strength account character especially relationship son remarkable great merely interesting know translation poor grammar mistake language extremely simplistic best part description interwoven highlight story need serious edit mistake irritate distract poverty write style simplifies story point hard feel emotion drama tension foremost mind heart recommend", "genres": ["Biography", "WWII", "Music"], "summary": "How music provided hope in one of the world's darkest times—the inspirational life story of Alice Herz-Sommer, the oldest living Holocaust survivor\r\n\r\nAlice Herz-Sommer was born in Prague in 1903. A talented pianist from a very early age, she became famous throughout Europe; but, as the Nazis rose to power, her world crumbled. In 1942, her mother was deported to the Theresienstadt concentration camp and vanished. In 1943, Alice, her husband and their six-year-old son were sent there, too. \r\n\r\nIn the midst of horror, music, especially Chopin's Etudes, was Alice's salvation. Theresienstadt was a \"show camp\", a living slice of Nazi propaganda created to convince outsiders that the Jews were being treated humanely. In more than a hundred concerts, Alice gave her fellow prisoners hope in a time of suffering. Written with the cooperation of Alice Herz-Sommer, Melissa Müller and Reinhard Piechocki's Alice's Piano is the first time her story has been told. \r\n\r\nAt 107 years old, she continues to play her piano in London and bring hope to many.", "asin": "1250007410", "rank": "978533", "city": "Prague", "image": "https://images-na.ssl-images-amazon.com/images/I/51dugATfQnL.jpg", "country": "Czechia", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}