{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 16, "rating": 4.0, "reviews": [{"review_sentiment": 5.0, "review_text": "Clever way to be an armchair tourist and historian of the City of Light.  Other reviewers took issue with the paper (it was fine), the side bars (they were like an extended, informative parenthetical note - didn't disrupt the reading), and deviation from the original in French (I wouldn't know).  I've been to Paris twice, and enjoy history when it's well written.  This hits on both cylinders.If you visit Paris, you will undoubtedly get around using the Metro - heaven forbid you should rent a car!  This book is the ideal guide.  There are enough specific directions (\"walk to the end of the street, look behind the church...\") to make it practical in person.  It was enough to give the book a \"you are there\" flavor, without being tedious.I recognized some of the history from high school Latin class, some from history class, some from other reading, and (yes) some from memory.  This is a clever, novel approach to something that's been done by everyone.  I learned plenty about the Louvre, right bank/ left bank, the dire situation w the plague, the church & papacy, and the resilience of the Parisians."}, {"review_sentiment": 4.0, "review_text": "Good summary of Paris history. A little a bit haphazard in the layout with interleaved geography and historical lines. A lot of effort dedicated to language, however, a bit light on substance. No illustrations, which make it difficult to relate, particularly for those who have not been there."}, {"review_sentiment": 5.0, "review_text": "A book of very interesting information pertaining to Paris' history; yet, with the most intriguing manner of explanation based on l'Metro. For those who enjoy Paris history, seek new ways of learning it and possibly collect such informative books, this is for you! It is the author's flair for writing that causes this book's account of history such an enjoyable treat."}, {"review_sentiment": 1.0, "review_text": "This is an entertaining and lively book for a very simple reason: it is written with gleeful disregard for the facts. It would be one thing if the author had announced he was going to improvise creatively on what is known, but that is not what he does. Instead he simply invents dialogue and color that is not in the original sources - many of which are relatively well-known. Then there are gems like his suggesting the reader visit the \"Oubliettes\" (dungeons) on the Rue Galande to see what those at the Chatelet (since destroyed) were like. He even cites graffitti, supposedly from prisoners. at the site. Only trouble - the Oubliettes is a BAR and there is no evidence these are genuine. One has only to look at nineteenth century sources on the street to see that no one mentions what would surely have been worth noting by then; to the contrary, one work specifically says there is nothing of note on the street but a chapel (since gone, I believe).It is very troubling to see how readily people praise a book for teaching them things when they don't know enough to know what they're \"learning\" is made up."}, {"review_sentiment": 5.0, "review_text": "This book, Metronome, was a runway best seller in France. When this English translation is read, it is easy to see why. The easy-going, reader-friendly manner in which these and other stories are told shines through in the English translation. It presents the history of France in an innovative, out-of-the-box manner. It makes the narrative of history an enjoyable reading experience.Chapters in the history of France are told with reference to the subway stations found in the inner core of Paris. For example, the story of the Bastille is told through what the commuter sees at the Bastille metro station (which, incidentally, is not a whole lot because the Bastille was completely destroyed during the French Revolution).The story of the Louvre are told with reference to the Palais-Royale-Musee du Louvre metro stop.The chaotic and bloody events of the civil war between the Armagnacs and Burgundians during the Fourteenth Century while the country was battling the Hundred Years War with England are told at the Chateau de Vicennes metro stop.Half-way through the book Lorant Deutsch brings the reader barely to 1000 C.E. This should not be surprising. By Western standards, Paris is an ancient city with a rich history. The metro stops described in his book constitute the very core of the city center where the events of Paris’ earliest history took place.Throughout the book Deutsch will present mini stories on the side of the page. These side stories include, What is on Dogobert’s Tomb? How did Les Halle disappear? Where have all the colleges gone? Who was Nicolas Flamel?  These stories are almost more interesting than the main text.One does not need to be a Francophile to enjoy this book, but this book will make you one.Good book, history brilliantly told, good translation. What could go wrong? Well, ....Other customer reviews of this book have complained about the paper on which the text is printed. I dismissed these comments and purchased the book anyway. While the book is highly recommended, these reviewers were correct. The paper the publisher used is cheap, shoddy, and rough.We are not talking about acid-free paper. I have seen comic books printed on better paper. I have seen newspapers PRINTED SIXTY YEARS AGO in better shape. No exaggeration, the paper used for this book feels like sandpaper. I still give this book five stars for the excellent stories told.Shame on the publisher, St. Martins Griffin, for disrespecting the reading public by printing such a cheap edition of this book!"}, {"review_sentiment": 5.0, "review_text": "This is a fantastic book; a very interesting way to explore the history of a place.  If you've been or are going to Paris, I recommend reading this book.  I wish it had photos, although I've spent some fun time on the Internet exploring various places mentioned in the book."}, {"review_sentiment": 5.0, "review_text": "A well-written history of Paris through the Metro stops and nearby architectural remnants. Paris is wonderful and even more enchanting if you realize that the beautiful door you see near the National Archives is actually the entry of a mansion built in 1380 (L'hôtel de Clisson). The history is presented through brief vignettes that reference locations shown on a map for each chapter, each of which represent a century in Paris's history. Highly recommended!"}, {"review_sentiment": 5.0, "review_text": "This journey in time is a treasure - next time I am in Paris, I will take the 'Tour\" ..."}, {"review_sentiment": 4.0, "review_text": "Interesting approach to make one's way through Paris - one arrondissement after another. History, too."}, {"review_sentiment": 5.0, "review_text": "I read it in French (I'm French born and raise in Paris), so I can say that I know Paris very very well. I actually learnt a lot of stuff reading this book. I'm offering it to an American friend who lived in Paris for 2 years. She had a blast, and is going back at least twice a year for fun.I would recommend reading this book only if you're (very) familiar with the city, if not it may be overwhelming. Happy reading"}]}, "authors": ["Lorànt Deutsch"], "isbn": "125002367X", "longitude": 2.3514992, "periods": ["2000s", "Recent Releases"], "title": "Metronome: A History of Paris from the Underground Up", "word_cloud": "way armchair tourist historian other reviewer take issue paper fine side bar extend informative parenthetical note disrupt read deviation original french twice enjoy well write hit visit undoubtedly get use heaven forbid rent car ideal enough specific direction walk end street look church make practical person enough give flavor recognize high school class class read yes memory clever approach something do everyone learn plenty right leave bank dire situation plague church papacy resilience parisian good summary little bit haphazard layout interleave geography historical line lot effort dedicate language however bit light substance illustration make difficult relate particularly interesting information pertain yet intriguing manner explanation base enjoy seek new way learn possibly informative author flair write cause account enjoyable treat entertain lively simple reason write gleeful disregard facts thing author announce go improvise creatively know instead simply invents dialogue color original source many relatively then gems suggest visit dungeon see destroy even cite graffiti supposedly prisoner site only trouble evidence genuine look nineteenth century source street see mention surely worth note contrary work specifically say nothing note street chapel go believe trouble see readily people praise teach thing know enough know learn make runway best seller english translation easy see manner story tell shine translation present innovative manner make narrative enjoyable read tell reference subway station find inner core example story tell commuter see metro station incidentally whole lot completely destroy french story tell reference dew chaotic bloody event civil war country battle tell bring barely surprising western standard ancient city rich metro stop describe constitute core city center event earliest take present mini story side side story include disappear college go story almost interest main need make brilliantly tell good translation wrong well customer review complain paper text print dismiss comment purchase anyway highly recommended reviewer correct paper publisher use cheap shoddy talk paper see comic print better paper see newspaper better shape exaggeration paper use feel sandpaper still give star excellent story publisher disrespect read public printing cheap edition fantastic interesting way place go recommend read wish photo spend fun time explore various place mention stop nearby architectural remnant wonderful even enchant beautiful door see actually entry mansion build present brief vignette reference location show map chapter represent century recommend journey time treasure next time take interest approach make way arrondissement french french bear say know well actually learn lot stuff reading offer american friend live year blast go back least twice year reading familiar city happy reading", "genres": ["History", "Urbanism"], "summary": "A phenomenal bestseller in France, Metronome presents a fascinating history of Paris through the lens of the city's iconic Metro system\r\n\r\nDid you know that the last Gallic warriors massacred by the Romans lie beneath the Eiffel Tower? That the remains of Paris's first cathedral are under a parking lot in the Fifth District? Metronome follows Loránt Deutsch, historian and lifelong Francophile, as he goes on a compelling journey through the ages, treating readers to Paris as they've never seen it before. Using twenty-one stops of the subway system as focal points―one per century―Deutsch shows, from the underground up, the unique, often violent, and always striking events that shaped one of the world's most romanticized city. \r\n\r\nReaders will find out which streets are hiding incredible historical treasures in plain sight; peer into forgotten nooks and crannies of the City of Lights and learn what used to be there; and discover that, however deeply buried, something always remains.", "asin": "125002367X", "rank": "535404", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/41lDUDrgbWL.jpg", "country": "France", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}