{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 64.145981, "ratings": {"num_ratings": 140, "rating": 3.9, "reviews": [{"review_sentiment": 4.0, "review_text": "Quite a different spin on his usual detective series. Takes you on a slippery & deep study of human actions/reactions while in and around the western glaciers. Opens many skeletons in the closet (or rather the freezer)."}, {"review_sentiment": 4.0, "review_text": "Good story, but it seemed to have a lot to do with alcoholism."}, {"review_sentiment": 3.0, "review_text": "Set in 1970s Iceland, when Inspector Erlendur is just starting out as a young traffic cop on nights. But when a drunk, whom he's encountered a few times, is found dead in a pond, Erlendur starts investigating on his own account... And finds a second - and apparently non-related - missing person case might be linked to it...In between, we accompany Erlendur and his colleagues on their patrols; often irrelevant to the main story, these tales of drugs, theft, drink and violence may add to the background, but feel rather like padding.An OK read but nothing very outstanding"}, {"review_sentiment": 4.0, "review_text": "I tried this author, it moved a tad slow but enjoyed the read."}, {"review_sentiment": 3.0, "review_text": "Not his best"}, {"review_sentiment": 4.0, "review_text": "It was interesting but slow."}, {"review_sentiment": 5.0, "review_text": "Nordic Noir at its best.  I like these kind of police murder mysteries."}, {"review_sentiment": 3.0, "review_text": "This is the prequel to the Erlandur stories. He's working the nightbeat but spends a lot of time investigating two crimes that he cares about but I didn't. Plodding."}, {"review_sentiment": 4.0, "review_text": "I am a big fan of Indridason.  His character Erlendur is my favorite!!"}, {"review_sentiment": 5.0, "review_text": "Indridason is always excellent. I recommend any of his books"}]}, "authors": ["Arnaldur Indridason"], "isbn": "1250111420", "longitude": -21.9422367, "periods": ["1900s", "Recent Releases"], "title": "Reykjavik Nights: An Inspector Erlendur Novel (An Inspector Erlendur Series)", "word_cloud": "quite different spin usual detective series slippery deep study human western glacier open many skeleton closet rather freezer good story seem lot alcoholism start young traffic cop night drunk encounter time find dead pond start investigate account find second apparently miss person case link accompany colleague patrol often irrelevant main story tale drug theft drink violence rather nothing outstanding try author move tad slow enjoy not best interest slow best like kind police murder mystery prequel stories work night beat spends lot time investigate crime care plod big fan character favorite always excellent recommend", "genres": ["Fiction & Literature", "Mystery & Suspense", "Historical Fiction"], "summary": "In Reykjavik Nights, a stunning prequel to his critically acclaimed Inspector Erlendur series, Arnaldur Indriðason gives his devoted fans a real shock.\r\n\r\nErlendur is a young officer assigned to traffic duties. He is not yet a detective. He works nights. Reykjavík’s nights are full of car crashes, robberies, fights, drinking, and sometimes an unexplained death.\r\n\r\nOne night a homeless man Erlendur knows is found drowned. Then a young woman on her way home from a club vanishes and both cases go cold.\r\n\r\nBut Erlendur’s instincts tell him that the fates of these two victims are worth pursuing. He is inexorably drawn into a world where everyone is either in the dark or on the run.", "asin": "1250111420", "rank": "64319", "city": "Reykjavik", "image": "https://images-na.ssl-images-amazon.com/images/I/51Nz4L186FL.jpg", "country": "Iceland", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}