{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 41.3828939, "ratings": {"num_ratings": 105, "rating": 4.2, "reviews": [{"review_sentiment": 5.0, "review_text": "Amanda Vaill has succeeded where so many accounts of the Spanish war fail. She shows the conflict from three different perspectives--the pseudo-journalistic experiences of Hemingway and the people around him, the artistic efforts of Robert Capa and Gerda Taro, and the gut-wrenching trials of Arturo Barea--a man trapped between love of country and the ideologues threatening to destroy it.Characters spring to life in ways they have seldom been shown before--if ever. Tension is ever-present and tragedy lurks around every corner. It's every bit as engrossing as the best historical fiction while having the scholarship and research of a historian. I found it nearly impossible to put down."}, {"review_sentiment": 5.0, "review_text": "Wonderful book. I highly recommend it for anyone interested in Spain and the lead up to World War ll, because of the U.S. inaction to support those fighting for freedom, thus allowing the Nazi's to dominate Europe. . After reading it, I became even more interested in the characters in the book. I must say that the journalist Martha Gellhorn, Hemingway's girlfriend/wife I found to be more interesting than Hemingway and highly recommend reading her books."}, {"review_sentiment": 5.0, "review_text": "This book is well written and researched.  It's a detailed story of the Spanish Civil War and the expats who gathered there."}, {"review_sentiment": 3.0, "review_text": "I became very interested in Martha Gellhorn after seeing the film about her and Hemingway, and I've read a lot about Hemingway. Learning more about the Spanish Civil War was also enticing, in part because doing so helped understand the involvement of both of them there.However, this book was slow going, the chapters about Cappa of little interest, and the chapters on Gellhorn and Hemingway so poorly written, they did not come alive. The author also included too many extraneous details and people which detracted from the main story. Gellhorn was a fascinating and admirable woman who could have been presented much more deeply so as to better engage readers. (Contrast the historical books by Lynne Olsen - her Citizens of London is so engaging the real-life characters nearly jump off the page).I ended skipping the chapters on Cappa, and then abandoning my reading of Gellhorn and Hemingway about 2/3 of the way through the book. Undoubtedly, there are far more interesting books out about both of them -- I'm searching for them now!"}, {"review_sentiment": 4.0, "review_text": "The personal life stories intertwined with the evolving chronological history of the Spanish Civil war provides an engrossing and informative work. The reader is handicaped by the absence of an additional full page map locating the many villages and towns which are important to the narrative.History and biography with insight and relevance to our modern world."}, {"review_sentiment": 3.0, "review_text": "It's a good book. It's well-written and follows the lives of a few famous authors in the Spanish Civil War. The individuals chronicled are flawed but they share a common theme: the promotion of a democratic Spain with a relationship founded on the war. I had difficulty reading about Ernest Hemingway and Martha Gellhorn.  I especially did not like Hemingway and wanted to hurry past his and Gellhorn's sections in the book. The writing was well done. It's just that I didn't like the characters which made me not enjoy the book so much. I did learn a little bit more about the atmosphere of the Spanish Civil War. Overall, not a fun read but a good book, nonetheless."}, {"review_sentiment": 4.0, "review_text": "I read this book.... and followed it up by watching the film \"Hemingway & Gellhorn.\"  Those two works brought the feel of the Spanish Civil War to life for me."}, {"review_sentiment": 4.0, "review_text": "Terrific read for those interested in the time and lives of the personages involved"}, {"review_sentiment": 5.0, "review_text": "Excellent book. The research put in to this book and the flow that makes it tremendously interesting, is amazing. If you have some knowledge of the Spanish Civil war or you are a Hemingway fan or you are a Capa aficionado, this book will enrich your world."}, {"review_sentiment": 3.0, "review_text": "A mini history of the Spanish civil war with Ernie Hemingway (one had better exclude the many worse and better halves) as the hero with his four wives (!). The story is too complicating, of course, the Spanish civil war itself is complicating, but the readers have to jump from Madrid, New York, Hankow, Prague, and to many other cities virtually around the globe. One thing that deserves mention is the beautiful description of Ernie at Havana Madrid nightclub where he went berserk. One shouldn't miss what Arturo Barea says of Ernie's For Whom the Bell Tolls: Hemingway was always a spectator who wanted to be an actor, and in the end, Ernie failed to live the Spanish civil war. Hemingway's stories are not about Spanish civil war but about himself. Ergo, The Bell Tolled for Ernie, if we follow what is written in the epilogue."}]}, "authors": ["Amanda Vaill"], "isbn": "1250062446", "longitude": 2.1774322, "periods": ["1900s"], "title": "Hotel Florida: Truth, Love, and Death in the Spanish Civil War", "word_cloud": "succeed many account fail show conflict different perspective experience people artistic effort trial man trap country ideologue threaten destroy spring life way seldom show ever tragedy lurks corner bit engross best historical fiction scholarship research historian find nearly impossible put wonderful highly recommend anyone interested lead inaction support fight freedom thus allow nazi dominate read become even interested character journalist find interest highly recommend read well write research detail story expat gather become interested see film lot also entice part help involvement slow go chapter little interest chapter poorly write come alive author also include many extraneous detail people detract main story fascinate admirable woman much deeply better engage reader historical engage character nearly jump page end skip chapter abandon read way undoubtedly far interest search personal life story intertwine evolve chronological history provide engross informative work handicapped absence additional full page map locate many village towns important biography insight relevance modern world good follow live famous author individual chronicle flaw share common theme promotion democratic relationship found difficulty read especially want hurry section writing well do character make enjoy much learn little bit atmosphere fun good nonetheless follow watch film work bring life interested time live personage involve research put flow make tremendously interesting amazing knowledge fan aficionado enrich world mini history better exclude many worse better half hero wive story complicate course complicate reader jump many city virtually globe thing deserve mention beautiful description go miss say always spectator want actor end fail live stories follow write epilogue", "genres": ["Memoir", "Biography", "History", "Spanish Civil War"], "summary": "\"Whether or not you're a history buff, you'll be fully immersed in Vaill's chronicle of the band of journalists―including Ernest Hemingway and Martha Gellhorn―who covered the upheaval of the Spanish Civil War.\"―Entertainment Weekly\r\n\r\nMadrid, 1936. In a city blasted by civil war, six people meet and find their lives changed forever. Ernest Hemingway, his career stalled, his marriage sour, hopes this war will give him fresh material and new romance; Martha Gellhorn, an ambitious novice journalist hungry for love and experience, thinks she will find both with Hemingway in Spain. Robert Capa and Gerda Taro, idealistic young photographers based in Paris, are inventing modern photojournalism as they capture history in the making. And Arturo Barea, Madrid's foreign press chief, and Ilsa Kulcsar, his Austrian deputy, are struggling to balance truth-telling with loyalty to their sometimes compromised cause―a struggle that places both of them in peril. Hotel Florida traces the tangled wartime destinies of these three couples against the backdrop of a critical moment in history.\r\n\r\nFrom the raw material of unpublished letters and diaries, official documents, and recovered reels of film, Amanda Vaill has created a narrative of love and reinvention that is, finally, a story about truth: finding it out, telling it, and living it―whatever the cost.", "asin": "1250062446", "rank": "725994", "city": "Barcelona", "image": "https://images-na.ssl-images-amazon.com/images/I/51nSoE542zL.jpg", "country": "Spain", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}