{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 42.8184538, "ratings": {"num_ratings": 14, "rating": 4.8, "reviews": [{"review_sentiment": 5.0, "review_text": "Excellent read. Author has traveled to Pamplona before and gives great insights into the best ways to navigate one of the most entertaining events on the planet."}, {"review_sentiment": 5.0, "review_text": "Peter Milligan's \"Bulls Before Breakfast\" is an amazing book about the best and safest (if that's even possible) ways to enjoy the Fiesta de San Fermin in Pamplona. It is a riveting personal story of what it's like to run inches away from beasts worthy of respect. I recommend this book for those interested in learning about the history of this event and how to increase the chances of making it back home alive. Not for the weak of heart or stomach."}, {"review_sentiment": 5.0, "review_text": "Bulls before breakfast: running with the bulls and celebrating fiesta de San Fermin in Pamplona, Spain by Peter MilliganFor my 3000 review at Amazon I will be reading:Not sure why this subject intrigues me but I recall black and white film from my grandparents at bull fights in Cuba back in the day...Hemingway had first wrote of this and that's probably why I want to learn more of it. This book is about a man who's run with the bulls many times and why he continues to do it.Last day of the running and the big fiesta is the 14th of July, run is 8 times during July  and my birthday is 14th. I always thought they ran for me when I was younger, in tribute to me. Rockets blare at 8am to signal the start and the day ends in fireworks!Love hearing the details of why they ran and the fear and adrenaline and family experience and so much more. Traditions of brothers who don't know one another.To understand if you have to get down on the streets and experience it for yourself.Step by step instructions all about the roadways and what to expect as far as curves, places to hide, inclines, etc.They make plans a year in advance...crazy to hear of latest technology and taking things for granted...count the bulls!Wow no cameras at all!  So much more to do in the area. the inside tips are enclosed. Love this book for all I learned.I received this book from National Library Service for my BARD (Braille Audio Reading Device)."}, {"review_sentiment": 5.0, "review_text": "My boyfriend wants to go to this event in the near future.  Great book by someone who has lived this and participated in it."}, {"review_sentiment": 5.0, "review_text": "A fantastic book from start to finish. Really captures the essence of fiesta in his writing making this an easy and great fun read. Milligan has built up a huge list of contacts over his years at fiesta and you can tell that each year he squeezes every last drop out of Pamplona and craves his return the next year. Bravo!"}, {"review_sentiment": 5.0, "review_text": "If you've never been to Pamplona Spain, after reading Milligan's account of his adventures there, you'll be packing your bags and booking a trip. This is one of the most detailed books on not only how to run with the bulls, but how to fully enjoy your experience during San Fermin.  He even throws in a little brotherly love for Ari along the way. GREAT READ ... BUY IT!"}, {"review_sentiment": 4.0, "review_text": "Just finished the book - well done!  Comments on the rear dust jacket say it all.  I got a sense of genuine enthusiasm and credibility, without any pretense.  Thank you for that.  Following you on Facebook and making plans for first visit in 2017.  Hope to see you & Ari there."}, {"review_sentiment": 5.0, "review_text": "I just read the last page and closed the book this morning. Bravo! This was such a fun book to read and I learned several details I didn't know about running with the bulls. I also really enjoyed your descriptions about the Basque region around Pamplona. Peter Milligan's writing style made me feel as if I got to be part of the hijinks! My only wish is that you had extended the use of slang (especially British expressions) along with a dictionary at the end of the book. For instance, I know what a \"wanker\" and a\"tosser\" is, but what is the world is a \"yob\"?!?!  Fun and informative book. I highly recommend it."}, {"review_sentiment": 5.0, "review_text": "Well written and a really fun read !Yiu feel like you have experienced Fiesta !"}, {"review_sentiment": 4.0, "review_text": "Comparing my experiences 1991 & 2001 to Milligan's....a little too self centered andmore advice needed...ie stay on opposite side of a curve....the bulls' momentumusually affects their position."}]}, "authors": ["Peter N. Milligan"], "isbn": "1250065739", "longitude": -1.6442556, "periods": ["2000s", "Recent Releases"], "title": "Bulls Before Breakfast: Running with the Bulls and Celebrating Fiesta de San Fermín in Pamplona, Spain", "word_cloud": "excellent travel give great insight best way navigate entertain event planet amaze best safest even possible way enjoy rivet personal story run inch away beasts worthy respect recommend interested learn history event increase chance make back home alive not weak heart stomach breakfast review read not sure subject intrigue recall black white film grandparent fight back day first write probably want learn man many time continue day big run time birthday always think ran younger tribute blare signal start day end firework hearing detail run fear adrenaline family experience much brother know understand street experience step instruction roadway expect far curve place hide incline make plan year advance crazy hear latest technology take thing grant count camera so much area tip enclose receive boyfriend want event future someone live participate fantastic start capture essence write make easy great fun build huge list contact year tell year squeeze last drop crave return next year never read account adventure pack bag book trip detailed run fully enjoy experience even throw little brotherly love way just finish well do dust jacket say get sense genuine enthusiasm credibility pretense follow make plan first visit see last page close morning fun learn several detail know also really enjoyed description region write style make feel get part hi jinks wish extend use slang especially british expression dictionary end instance know wanker tosser world yob informative highly recommend well write really fun feel experienced compare experience little self center anymore advice need ie stay opposite side curve momentum usually affect position", "genres": ["Memoir", "Travel Writing"], "summary": "Ever since Ernest Hemingway popularized the fiesta de San Fermín with the publication of The Sun Also Rises in 1926, the world has been enthralled with the concept of running with the bulls. For millions, running with the bulls remains on their bucket list, and for Hemingway fans it is a lifelong dream. For Peter N. Milligan, it is a way of life. Part memoir and part travel guide, Bulls Before Breakfast recounts Milligan's many adventures in Pamplona, Spain. In his dozen years of visiting the fiesta de San Fermín, Milligan has run with the bulls over 70 times and accumulated stories both thrilling and terrifying.\r\n\r\nBulls Before Breakfast is the definitive guide to Pamplona, its famed fiesta, and the surrounding Kingdom of Navarra. It is also a memoir of two brothers running with the bulls and exploring every corner of the city, the countryside, the mountains, the beaches, and the famed restaurants of the Basque hinterland.\r\n\r\nThe book focuses on local knowledge, and the hidden mysteries of this closed, private culture and community. Milligan has slowly pried open this trove of secrets over the past twelve years, all while refining the art of getting between the horns of a massive, perfect Spanish killing machine, el toro bravo, and running for his life.\r\n\r\n“Milligan projects a sense of grandeur onto the event. . . . A colorful portrait of Pamplona.” Chicago Tribune", "asin": "1250065739", "rank": "503778", "city": "Pamplona", "image": "https://images-na.ssl-images-amazon.com/images/I/51wfR24sClL.jpg", "country": "Spain", "story_arc": ["Oedipus", "Bad luck, followed by promise, ending in a\n                    final fall"]}