{"where_to_read": ["Commuter Train", "Hi ho, hi ho, its off to work we go"], "readability": 0, "latitude": 21.015851, "ratings": {"num_ratings": 0, "rating": 0.0}, "authors": ["Mrs. Peter M. Myers"], "isbn": "1332113281", "longitude": -101.2528698, "periods": ["1800s"], "title": "A City of Dream: Guanajuato (Classic Reprint)", "word_cloud": "", "genres": ["Travel Writing"], "summary": "Excerpt from A City of Dream: Guanajuato\r\n\r\n\"After a sleep of a hundred years, Gunanjuato is waking up,\" an American resident of Mexico city said to me one day, and I tried to think what the old place would be like \"waked up\". Guanajuato - away up in the mountains, sleeping on the hillsides, the most dreamily picturesque city on all the North American continent - waking up! It was like hearing ill tidings of a friend, for the waking up process does not help quaint old Mexican cities, at least not for the idler or artist, or even for the every day tourista. On a former visit there were threatening signs of commercialism, and knowing what American capital and hustle and bustle can do for one of these drowsy places, I hurried away to Guanajuato, as one friend might fly to another in distress.\r\n\r\nIt is a full day's ride from Mexico City, and all the way we watched for some sign of the awakening, for we reasoned that if Guanajuato had waked up, some of the nearer places on the line of the railway must have shared in the catastrophe. At Tula, where the winds on a summer day are like so many breaths from heaven, the same women and children brought the same peppery things to eat, and the same little girls hurried to the car windows with brown jugs of pulque. Up through the beautiful valley of San Juan del Rio all was the same; the same people sold the same wares, and the same blind beggars held up the same dirty sombreros.\r\n", "asin": "1332113281", "rank": "11858619", "city": "Guanajuato City", "image": "https://images-na.ssl-images-amazon.com/images/I/51T79xpfiCL.jpg", "country": "Mexico", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}