{"where_to_read": ["Inter City Train", "Choo-choo!!!"], "readability": 0, "latitude": 45.4371908, "ratings": {"num_ratings": 15, "rating": 3.5, "reviews": [{"review_sentiment": 4.0, "review_text": "This is abridged version, which is perfectly OK for most of us, as much of the  complete version consists of very detailed and hard-to-follow architectural analysis. Some of the writing is brilliant and inspiring. I imagine some will take issue with Ruskin's basic thesis, that art and civilization have been on the decline since somewhere in the early 14th century. A lot of interesting history, well worth the journey."}, {"review_sentiment": 1.0, "review_text": "This edition is a highly abridged version of this classic. Many of Ruskin's best passages have been completely removed. This should have been stated up front in the description of the book, but it is not."}, {"review_sentiment": 5.0, "review_text": "Watch out - extremely Victorian writing style. Many disagree with Ruskin but the fact remains that he delivers an aesthetic algorithm that prepares the reader to think about architecture and other art forms."}, {"review_sentiment": 5.0, "review_text": "This edition of Stones of Venice fills a real need: enough of the whole to give the reader a sense of continuity and arc of Ruskin's argument, but without the countless digressions and details.  We get a good lesson in architecture, especially in the virtues of the gothic arch; we get the historical account of the Byzantine, Gothic, and Renaissance styles; and we see Ruskin's moral and historical purposes, as he tells the story of Venice as a \"rise and fall\" narrative.  There are some surprising omissions, namely, the famous excerpted passage from \"Nature of the Gothic.\"  But the editor, I think, wisely left that out, keeping everything focused on the historical perspective of Venice; and besides, it's so frequently found in collections of Ruskin's writings.  So the immense work is boiled down to about 250 readable and engaging pages."}, {"review_sentiment": 1.0, "review_text": "You can't go two sentences without finding words erroneously mashed together without a space separating them.  The kindle edition isn't worth a dollar for howannoying it isto attempt to read it withall the missingspaces.  Whoever digitized this needs to get their act together."}, {"review_sentiment": 5.0, "review_text": "Ruskin was the foremost art critic of the Victorian era. This Oxonian was a gentleman of universal and unusual talents.In 'The Stones of Venice' he reviews that fertile depository of so different cross currents of arts, the 'Serenissima Republica', which had no better exit than by sea through the Adriatic.When Marcel Proust visited Venice, hand in book as his guide, he walked and saw through the eyes of Ruskin. You should too and your scope of art appreciation will expand towards new frontiers.High art in Venice in particular and in Europe in general are no longer produced because the Spirit has left its carcass, which is rotting and decaying, just as Venice was by the time Ruskin walked its narrow alleys and across its street bridges. And because that Spirit has left Europe it no longer produces geniuses of the caliber of John Ruskin."}, {"review_sentiment": 5.0, "review_text": "An excellent and accessible intro to  ruskins thought.  It makes you see Venice with new eyes.  Buy it now and go see Venice"}, {"review_sentiment": 1.0, "review_text": "a total dud.  not even close, so abridged  it should be called \"the st of v\" or maybe \"just a few  pebbles of venice.\" bought this as i was needing to reference two passages re: giovanni bellini.  you guessed it, neither are in this versionShame on amzn for selling such utter crap with no warning.  Total ripoff!"}, {"review_sentiment": 4.0, "review_text": "This edition of STONES OF VENICE is a lamentably shortened version of the original. Yet is still contains enough of that to provide a clear clue why Socialism has as powerful attraction as it does for the upper class elite as it did back in Ruskin's day.  In The Stones of Venice, John Ruskin creates a parallel between the Gothic style of architecture and the often tangled mixture of various pairs of discrete elements: the architect's mind and the social milieu, the worker's skill and the worker's trade guild, and the need for precision in stone cutting and a need not to overly focus on that precision.  \"The Nature of Gothic\" is a chapter from that book in which he considers the current state of Gothic architecture: \"I shall endeavor to give the reader in this chapter an idea...of the true nature of Gothic architecture, properly so-called; not of that of Venice only, but of universal Gothic.\"  He intends to inform the reader just how \"far Venetian architecture reached the universal or perfect type of Gothic, and how far it either fell short of it or assumed foreign and independent forms.\"  All buildings that are termed Gothic have an essence that Ruskin terms Gothicness, a concept whose abstractness renders a precise definition difficult.  When people refer to this essence they often mention traits like gargoyles, pointed arches, and vaulted roofs.  Ruskin is quick to add that it is misleading to consider them in isolation.  It is further misleading when, even lumping them together, one fails to account for the spirit in which they were both planned and built.  Ruskin suggests that it is only when one considers the external forms (arches, roofs, gargoyles) in a delicate union with the internal forms (the mindset of the builder, the social milieu of the age) that one may only then have a right to call that structure Gothic.  Ruskin writes that for a building to be rightfully called Gothic, that edifice must have a morally centered symmetry of six traits: Savageness, Changefulness, Naturalism, Grotesqueness, Rigidity, and Redundance.  Savageness: Ruskin counters the prevailing stereotype of Gothic as a reference to all that is barbaric or savage.  The term, in his opinion, has unfortunately been applied derogatorily to all buildings that have \"exhibited a degree of sternness and rudeness, which in contradistinction to the character of Southern and Eastern nations, appeared like a perpetual reflection of the contrast between the Goth and the Roman in their first encounter.\"  It is further unfortunate that the architecture of fallen Rome \"became the model for the imitation of civilized Europe.\"  Ruskin is dismayed at the revival of Gothic architecture, a trend based more on the style rather than the substance of the original Gothic builders of the Roman Empire.  The style of savageness that Ruskin so admires in the ancient Gothic buildings was based on the paradox that the obvious perfection of an object lies in the less obvious imperfection of any of its constituent parts.  He draws an analogy between the perfection of a building's lines and the perfection of its builder.  The former seems more nearly perfect because of the clarity and straightness of its lines.  The latter also seems perfect but only because he has sacrificed his humanity to achieve the mindless ability to draw lines and angles.  From this analogy, Ruskin extrapolates that the man can be a tool or the tool a man but one cannot have both.  It is the very imperfection of man that makes his struggle to achieve perfection so glorious.  As a further consequence, he anathematizes brute machines which accelerate the de-evolution of thinking man to soulless tool.  When Ruskin urges his readers to look proudly about them at the clarity and precision of the things which they believe stamp England with immortal beauty, he counters with \"Alas! If read rightly these perfections are signs of slavery in our England a thousand times more bitter and more degrading than that of the scourged African or helot Greek.\"  When he urges these same readers to \"gaze upon the old cathedral front where you have smiled so often at the fantastic ignorance of the old sculptors,\" Ruskin admonishes them not to mock these fronts, \"For they are the signs of the life and liberty of every workman who struck the stone.\"  Thus the savageness of Gothic architecture is more a virtue than a vice.  Changefulness: Ruskin provides \"variety\" as synonymous with \"changefulness.\"  If a worker is free to be imperfect, then it follows that it would be illogical and counterproductive to assume that the output of the imperfect worker must be perfection itself.  Though Ruskin acknowledges that the English love order, it does not follow that \"love of order is love of art.\"  He continues by noting that \"love of order has no more to do with our right enjoyment of architecture or painting than love of punctuality with the appreciation of an opera.\"  The knowledgeable lover of Gothic art sees that the inner beauty of that art lies precisely in its \"restlessness of the dreaming mind that wanders hither and thither among the niches and flickers feverishly around the pinnacles and frets and fades in labyrinthine knots and shadows along wall and roof.\"  Naturalism: Ruskin defines the term as \"the love of natural objects for their own sake.\"  It follows that the artist/builder has the obligation \"to represent them frankly, unconstrained by artistical laws.\"  As noted previously, most workmen can create the fact of a piece or the art of that piece but only the rarest and most gifted can do both.  Ruskin does not suggest that this tri-part division is immutable.  In fact, he adds that all three gently merge into imperceptible gradations.  When any building is visibly and horrendously flawed both in concept and construction, \"we are apt to find fault with the class of workmen, instead of finding fault with the particular abuse which has perverted their action.\"  The original Gothic builders of antiquity were in the group that could do both, but in their case this group was more numerous than in the other two combined.  In Ruskin's day, the ratio has reversed itself, with the ones who could do both in the vanishingly small minority.  Grotesqueness:  Ruskin assumes that his readers will have no difficulty in connecting this term with \"the tendency to delight in fantastic and ludicrous, as well as in sublime, images.\"  Rigidity: For Ruskin, rigidity implies not mere stability but active rigidity.  Stiffness in movement is a desired trait, the purpose of which is to heighten specific qualities, such as presenting \"the fiercest lightning forked rather than curved, and the stoutest oak-branch angular rather than bending.\"  Buildings of the ancient Egyptian and Greek civilizations lacked rigidity, with their stones \"passively incumbent on another.\"  But Gothic edifices possessed sufficient rigidity analogous \"to the bones of a limb or fibers of a tree.\"  Further, ornaments of the former seem to have been merely \"stamped with a seal,\" while those of the latter \"stand out in prickly independence and frosty fortitude.\"  Ruskin connects the freezing temperatures of northern Europe to the understandable if subconscious desire on the part of the northern builders to imbue their creations with the mark of the icicle.  Further, such cold climes force the builders to use materials of the roughest sort, \"compelling the workman to seek for vigor of effect, rather than refinement of texture or accuracy of form.\"  From this, he concludes that it is precisely here that accounts for the stark architectural differences between the low temperatures of the north and the milder temperatures of the south.  Ruskin warns the reader that \"the best Gothic building is not that which is most Gothic.\"  One cannot suffer from an excess of savagery, of changefulness, of naturalism, or even of grotesqueness, but one can surely suffer from a plethora of rigidity.  He compares an oversupply of rigidity to an excessive application of Puritanism.  A little bit of both goes a long way.  Redundance:  Ruskin calls redundance the least essential of the group.  A building is beautiful precisely because its beauty relies \"almost exclusively on loveliness of simple design and grace of uninvolved proportion.\"  Less, he implies, is more.  Humility, rather than braggadocio of design, is key.John Ruskin's relation to art was not limited to one who merely loved art though he did so passionately.  He saw it as his bounden duty in life to proselytize and to moralize so as to convince others of the validity of his vision that life, art, and morality were commingled in an inexorable bear hug from which one could never disengage.  Lying discretely behind this messianic impulse to convert was his Puritan-induced sense of reality.  All of art had to conform to a passionate fidelity of external reality to internalized art.  In \"The Nature of Gothic,\" Ruskin considers how reality impacts on the creation of and the perception of architecture.  It was never enough for Ruskin to look at any aspect of art as \"good\" or \"bad\" or even \"worthwhile.\"  For him, art could not exist independently of that which gave it birth--the mindset of the builder, the milieu behind the builder, the often tangled web of relationships that propped up or destabilized the worker to his trade guild, or even the geography which acted as an unobtrusive canvas for the art and its artist.  Out of all the arts of which man could produce it was architecture that most readily permitted the builder to make an immortal statement less about the artifact and more about himself.  The general thrust of \"The Nature of Gothic\" is to justify the existence of medieval Gothic architects as those who were thoroughly imbued with the spirit of restlessness, motivation, imperfection, yet endlessly creative for all that.  By contrast, this ennobling spirit of brash creativity had slowly fizzled away until by his own century Gothic architecture was no more than a pale reflection of halcyon years.  There were various targets for him to point fingers of blame, the most prominent being what he deemed the soul-destroying power of the Mighty Machine of industrialism.  By 1851, Ruskin was well on his way to accepting the Socialist doctrines then spreading throughout Europe.  Almost certainly, Ruskin was familiar with Marx's Communist Manifesto.  In his Stones of Venice and in many of his later works, Ruskin would rail against creeping capitalism, silk-hatted factory owners, free-market enterprise, and a general lack of appreciation for the lot of the common worker.  Added to these doctrines was his belief that human beings tended to fit a mold and could be counted on to act in pre-determined ways.  Individuality counted far less than collective action.  Where Marx might shout: \"Workers of the world unite; you have nothing to lose but your chains,\" Ruskin might substitute \"architects\" for \"workers.\"  In order for Ruskin to lend credence to his theory that Gothic architecture had suffered an irreversible decline since the Middle Ages, he noted six categories of Gothicism, all of which had to be present for contemporary builders to include in their building designs.  Beginning with savageness, the first criterion, Ruskin waxes pessimistically over the likelihood that current architects will ever regain the deft touches of their forebears.  He does not blame the individual builders for an excess of laziness, stupidity, or greed.  Rather, he blames the social fabric that encouraged the dissolution of formerly high principles of art and life.  If workers, stonecutters, architects, and craftsmen of all types are deficient in the six types of needed traits, then the fault lies with the dehumanization of the worker by the factory system--a key component of Marxist dogma.  Nowhere in any of Ruskin's books does he allow for any other explanation for the decline of art and morality.  If the stones of Venice were indeed broken to create a flawed and ugly environment that matched an equally flawed and ugly soul of society, then Ruskin's claim that the source of all this lay in capitalism may need a more objective view than his."}, {"review_sentiment": 5.0, "review_text": "The Stones of Venice is beautifully written and a must-read for anyone interested in art, architecture, Venice, and Victorian literature. The massive original has been pared down here into a much more manageable volume without sacrificing its brilliant prose and insightful commentary. It'll easily fit in your carry-on luggage for your next trip to Italy."}]}, "authors": ["John Ruskin"], "isbn": "1366513622", "longitude": 12.3345898, "periods": ["1800s"], "title": "Stones of Venice", "word_cloud": "abridged version perfectly ok much complete version consist detailed architectural analysis write brilliant inspiring imagine issue basic thesis art civilization decline somewhere early century lot interest history well worth journey edition highly abridge version classic many best passage completely remove state front description extremely victorian write style many disagree fact remain delivers aesthetic algorithm prepares think architecture art form edition fill real need enough whole give sense continuity arc argument countless digression detail get good lesson architecture especially virtue gothic arch historical account style see moral historical purpose tell story rise fall narrative surprising omission namely famous excerpt passage nature editor think wisely left keep everything focus historical perspective besides frequently find collection writing immense work boil readable engaging page sentence find word erroneously mash together space separate kindle edition dollar how annoying into attempt withal missing spaces digitize need get act together foremost art critic era oxonian gentleman universal unusual review fertile depository different cross current art better exit sea visit hand guide walk saw eye scope art appreciation expand new art general longer produce leave carcass rot decay time walk narrow alley street bridge leave longer produce genius caliber excellent accessible intro buskin think make new eye buy see total dud even close abridge call st v maybe pebbles buy need reference passage giovanni bellini guess version shame amen selling utter crap warn ripoff edition lamentably shorten version original still contain enough clear clue powerful attraction upper class elite back day create parallel style architecture often tangled mixture various pair discrete element architect social milieu worker skill worker trade guild precision stone cut need overly focus precision chapter considers current state architecture give chapter idea true nature architecture properly universal intend inform far venetian architecture reach universal perfect type far either fell short assume foreign independent form building term gothic essence term concept abstractness render precise definition difficult people refer essence often mention trait gargoyle point arch vault roof quick add mislead consider isolation mislead even lump together fail account spirit plan build suggest considers external form arch roof gargoyle union internal form mindset builder social milieu age call structure write build rightfully call edifice morally symmetry trait counter prevail stereotype reference barbaric savage term opinion unfortunately apply derogatorily building exhibit degree sternness rudeness contradistinction character appear perpetual reflection contrast first encounter unfortunate architecture fall become model imitation civilize dismay revival architecture trend base style rather substance original builder empire style savageness admire ancient building base paradox obvious perfection object lie le obvious imperfection constituent part draw analogy perfection building line perfection builder former seem nearly perfect clarity straightness line latter also seem perfect sacrifice humanity achieve mindless ability draw line angle analogy extrapolate man tool tool man imperfection man make struggle achieve perfection glorious consequence brute machine accelerate think man soulless tool urge reader look proudly clarity precision thing believe stamp immortal beauty counter alas rightly perfection sign slavery time bitter degrade scourged helot urge reader gaze old cathedral front smile often fantastic ignorance old sculptor admonishes mock front sign life liberty workman strike stone savageness architecture virtue vice provide variety synonymous changefulness worker free imperfect follow illogical counterproductive assume output imperfect worker acknowledge love order love order art continue note order right enjoyment architecture paint love punctuality appreciation knowledgeable lover art see inner beauty art lie precisely restlessness dream mind wanders hither thither niche flicker feverishly pinnacle fret fade labyrinthine knot shadow wall roof define term natural object sake follow obligation represent frankly unconstrained artistically law noted previously workman create fact piece art piece rarest gift suggest division immutable fact add gently merge imperceptible gradation building visibly horrendously flaw concept construction apt find fault class workman instead find fault particular abuse pervert action original builder antiquity group case group numerous combine day ratio reverse one vanishingly small minority assume reader difficulty connect term tendency delight fantastic ludicrous well sublime image rigidity implies mere stability active rigidity movement desire trait purpose heighten specific quality present fiercest lightning fork rather curve stoutest angular rather bend ancient egyptian greek civilization lack rigidity passively incumbent edifice possess sufficient rigidity analogous bone limb fiber tree further ornament former seem merely stamped seal latter stand prickly independence frosty fortitude connect freezing temperature understandable subconscious desire part northern builder imbue creation icicle cold clime force builder use material roughest sort compel workman seek vigor effect rather refinement texture accuracy form conclude precisely account stark architectural difference low temperature north milder temperature south warn best gothic building suffer excess savagery changefulness naturalism even grotesqueness surely suffer plethora rigidity compare oversupply rigidity excessive application little bit go long way call redundancy least essential group building beautiful precisely beauty relies almost exclusively loveliness simple design grace involved proportion imply rather braggadocio design relation art limit merely loved art passionately saw bounden duty life moralize convince others validity vision life art morality commingle inexorable bear hug never lie discretely messianic impulse convert sense reality art passionate fidelity external reality internalize art consider reality impact creation perception architecture never enough aspect art good bad even worthwhile art independently give birth mindset builder milieu builder often tangle web relationship prop destabilized worker trade guild even geography act unobtrusive canvas art artist art man architecture readily permit builder make immortal statement le general thrust justify existence medieval architects thoroughly imbue spirit restlessness motivation imperfection yet endlessly creative contrast ennoble spirit brash creativity slowly fizzle away century architecture pale reflection halcyon year various target point finger blame prominent deem power industrialism well way accept doctrine spread certainly familiar many later work creep capitalism factory owner enterprise general lack appreciation lot common worker doctrines belief human being tend fit mold act way count far le collective action world unite nothing lose chain architect worker order lend credence theory architecture suffer irreversible decline note category present contemporary builder include building design begin savageness first criterion wax pessimistically likelihood current architect ever regain deft touch forebear blame individual builder excess laziness stupidity greed blame social fabric encourage dissolution formerly high principle art life worker stone cutters architect craftsman type deficient type need trait fault lie dehumanization worker factory system key component marxist dogma explanation decline art morality indeed broken create flaw ugly environment match equally flaw ugly soul society claim source lay capitalism objective view beautifully write anyone interested art architecture literature massive original par much manageable volume sacrifice brilliant prose insightful commentary easily fit luggage next trip", "genres": ["Art & Architecture", "History"], "summary": "The Stones of Venice is a three-volume treatise on Venetian art and architecture by English art historian John Ruskin, first published from 1851 to 1853.\r\n\r\nThe Stones of Venice examines Venetian architecture in detail, describing for example over eighty churches. He discusses architecture of Venice's Byzantine, Gothic and Renaissance periods, and provides a general history of the city. As well as being an art historian, Ruskin was a social reformer. In the chapter \"The Nature of Gothic\" (from volume 2), Ruskin gives his views on how society should be organised.\r\n\r\n\"We want one man to be always thinking, and another to be always working, and we call one a gentleman, and the other an operative; whereas the workman ought often to be thinking, and the thinker often to be working, and both should be gentlemen, in the best sense. As it is, we make both ungentle, the one envying, the other despising, his brother; and the mass of society is made up of morbid thinkers and miserable workers. Now it is only by labour that thought can be made healthy, and only by thought that labour can be made happy, and the two cannot be separated with impunity.\"\r\n\r\nWikipedia", "asin": "1366513622", "rank": "8972241", "city": "Venice", "image": "https://images-na.ssl-images-amazon.com/images/I/411GL2pKYgL.jpg", "country": "Italy", "story_arc": ["Rags_To_Riches", "The story gets better over time"]}