{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 25.7742658, "ratings": {"num_ratings": 47, "rating": 4.1, "reviews": [{"review_sentiment": 5.0, "review_text": "I first read Miami Blues sometime in the eighties - before the 1990 movie - but rereading it now thirty years later, it's hard to read it without picturing the characters as portrayed in the movie.  That there is the power of cinema.  It's still an awesome book even rereading it and knowing full well what's going to happen. It is strikingly different in tone and affect from Willeford's earlier pulp works so much so that you wonder how that could be.What's really remarkable about Miami Blues and its sequels (and no I haven't read the secret unpublished manuscript of the original dark nasty sequel) is how could Willeford really became at storytelling.  Each page and even each paragraph tells a whole story.  There are oddities that he throws in seemingly effortlessly like the Hare Krishna dying of a broken finger or the casual mentions of incest. And then there are these amazing characters like the dimwitted prostitute who wakes up each day as wide-eyed and innocent as the day she was born.  Or the psychopathic killer who decides to become her platonic husband.  Or the homicide detective who is forever losing his chompers (dentures) and lives in a fleabag hotel because he sends every other paycheck for alimony.The actual plot plays second fiddle to all these classic scenes like the ex-con and the cop having dinner together or Junior going to \"work\" at the mall.  Some of what takes place is the gallows humor of the police station but it's do funny you almost forget the one-man crime wave Junior is.An absolutely breathtaking work."}, {"review_sentiment": 5.0, "review_text": "The book that started it all."}, {"review_sentiment": 3.0, "review_text": "Fun, quick read for a rainy day"}, {"review_sentiment": 4.0, "review_text": "Charles Willeford is an underrated crime writer from the 1950s through the 1980s. This book was something of a breakthrough novel for him. With good reason. The book is smoothly written, well plotted and has some wonderful touches of absurdist humor. Like Elmore Leonard, Willeford's best characters are the bad guys and the bad guy in this book is really something. I would highly recommend this book to any fan of modern crime fiction. Good book."}, {"review_sentiment": 5.0, "review_text": "I'm from Florida.  Some people would think he copies Dave Barry.  Maybe but we just want to share the Zika, alligator bites, and rednecks with everyone else."}, {"review_sentiment": 5.0, "review_text": "Hoke Moseley is old school, hard-boiled and hard-wired to distrust change but his Miami world of the late 80's is changing fast.'It used to be a lot different when Hoke was still married. Four or five couples would get together for a barbecue and some beer. Then, after they ate, the women would all sit in the living room and talk about how difficult their deliveries had been, and the men would sit in the kitchen and play poker ... That had been real Florida living, but now all the white families were moving away. There were six different detectives Hoke had known who had left Miami in the last year alone.Hoke looked out at the river, never the same river. He wanted another shot of Early Times, but not at these prices. Hoke left the bar and got his car from the parking ramp... the smell of vomit on the back seat was almost overpowering. When he got to the Eldorado Hotel, he'd get one of the Marielitos who lived there to clean it out.'The 'Marielitos' embody all that has gone wrong in Hoke's mid-life American Nightmare.'Our wimpy ex-President, Jimmy Carter, opened his arms to 125,000 Cubans back in 1980... but Castro also opened his prisons and insane asylums and sent along another 25,000 hardcore criminals, gays and maniacs. They sailed from Mariel, in Cuba, so they call them Marielitos.'Hoke's detective badge and gun are the bulwark against the inevitable fall of civilization as he knows it, his own personal hard headed power amplified by his status as a Miami Homicide Detective. When he falls, beaten to a pulp, badge and gun stolen, it isn't at the hands of a 'Marielito' but to the very white, very American Freddy Frenger Junior - the grotesquely muscled psychopath recently released from San Quentin, intent on pillaging his way to as much cash and high living as he could manage before he would be incarcerated again.In his own way, Junior Frenger sustains his own American Dream just as Hoke's has become tattered and obsolete. Junior is ambitious and will do whatever it takes to reach his goals. He believes that if he really, really, really wants something, all he has to do is go and take it - usually by breaking bones, smashing heads or pumping bullets into a human obstacle.Not that Hoke is in any way a pacifist or shy of applying muscle when he deems fit, but Hoke's code of honor, such as it is, is predicated on his sense of selfless service - he doesn't take bribes, he pays his tab at Irish Mike's bar (reluctantly, and only when Mike demands it), and is loyal to his colleagues, even though he avoids their company.The concept of a hard-bitten, weary cop isn't new, and wasn't new when Willeford created Hoke Moseley, but Moseley stands out as a singular example of the genre. A willing product of his casually racist, misogynistic, macho culture, and honed in the crucible of police dept siege mentality, Hoke Moseley exists on the margins where the sun rising on civil society tomorrow can't be assumed, where the threat of malicious injury or death is always real, and where, even if you fear 'others' as a collective abstract threat, you killer may very well look just like you.'Hoke went to the desk and poured an overflowing jigger of Early Times into his tooth glass. Too much. He poured part of it back into the bottle. His hands shook a little, and he spilled part of his drink. He could hear his heart beat. The more he thought of Mendez, the more afraid he was. This was not paranoia. When a man has beaten you badly and you know that he can do it again, a wholesome fear is a sign of intelligence.'"}, {"review_sentiment": 4.0, "review_text": "Note sure I appreciate a vicious psychopath carrying the name Freddy, but he does and, as the girl he never got around to killing notes \"He does have his good points.\" Book is an interesting time warp, seeing Miami in the 80s with reference on one page to Woolworths, Burdines, and Eckerd Drugs which no longer grace the Florida retail scene, constant smoking anywhere and everywhere by most of the characters, police officers needing to borrow a phone on scene to report in, etc. The story is interesting, if unusual. Short and not so sweet with a most unusual \"hero\", a cop living in a broken down flophouse style hotel, deeply in debt due to a divorce and unable to make much headway as the daughters need braces, and he needing to get his dentures replaced,etc. (Note those dentures play an interesting role in the narrative.) Not sure why the author needed to keep mentioning prices unless it was to tie it to the time period. Still, one of my more interesting reads lately."}, {"review_sentiment": 1.0, "review_text": "It's written in French.I assumed it was in English."}, {"review_sentiment": 5.0, "review_text": "Charles Willeford is one of the very best crime writers out there -- equal to Elmore Leonard (IMHO); a shade better than George V. Higgins. If you haven't read his work (especially the novels featuring his Det. Sgt. Hoke Mosely), you really owe it to yourself."}, {"review_sentiment": 5.0, "review_text": "The great Charles Willeford, after years of writing superior noir in relative obscurity, broke through to the buying public with the four books in the Hoke Moseley series of four books. Unfortunately, he passed away before anymore could be written--a great loss since Moseley was an eminently likable, fallible detective in these books leavened by Willeford's dark brand of humor. Start with this, read the next three and then go back to some of his earlier classics. I was fortunate enough to find a U.K. hardcover \"Charles Willeford Omnibus\" including \"Pick-Up,\" \"Burnt Orange Heresy\" and \"Cock-Fighter\"--three of  his best released after publication of first two Moseley books"}]}, "authors": ["Charles Willeford"], "isbn": "1400032466", "longitude": -80.1936589, "periods": ["1900s"], "title": "Miami Blues", "word_cloud": "first sometime eighty movie reread year later hard picture character portray movie power cinema still even reread know full well go strikingly different tone affect earlier pulp work much wonder really sequel secret unpublished manuscript original dark nasty sequel really become storytelling page even paragraph tell whole story oddities throw seemingly effortlessly die broken finger casual mention incest amazing character dimwitted prostitute wake day innocent day bear psychopathic killer decide become platonic husband homicide detective forever lose chompers dentures life fleabag hotel send paycheck actual plot play second fiddle classic scene cop dinner together go work take place gallows humor police station funny almost crime wave absolutely breathtaking work start quick rainy day underrate crime writer something good reason smoothly write well plot wonderful touch absurdist humor best character bad guy bad guy really something highly fan modern crime fiction people copy want share alligator bite redneck everyone else old school distrust change world late change fast use lot different still marry couple together barbecue beer then ate woman living room talk difficult delivery men play poker real living white family move away different detective hoke know leave last year look river never river want shot early time price leave bar get car parking ramp smell vomit back seat almost overpower get live clean embody go wrong wimpy open arm back also open prison insane asylum send hardcore criminal gays maniac sail detective badge gun bulwark inevitable fall civilization know personal hard head power amplify status fall beat pulp badge gun steal hand white american grotesquely muscle psychopath recently release intent pillage way much cash high living way sustain american tattered obsolete ambitious take reach goal believe really really really want something go take usually break bone smash head pump bullet human way pacifist shy apply muscle deems fit code honor predicate sense selfless service bribe pay tab bar reluctantly demand loyal colleague even avoids concept weary cop new new create stand singular example genre willing product casually racist misogynistic macho culture hone crucible police dept siege mentality exist margin sun rise civil society tomorrow threat malicious injury death always real even fear collective abstract threat killer well go desk pour overflow jigger early tooth glass much pour part back hand shake little spilled part drink heart thought afraid paranoia man beat badly know wholesome fear sign intelligence note sure appreciate vicious psychopath carry name girl never get kill note good point interesting time warp see reference page longer grace retail scene constant smoking anywhere everywhere character police officer need borrow phone scene report etc story interest unusual sweet unusual hero cop live broken flophouse style hotel deeply debt due divorce unable make much headway daughter need brace need get denture replace etc denture play interesting role narrative not sure author need keep mention price tie time period still interesting read lately write assume english best crime writer equal shade better work especially novel feature really owe great year write superior nor relative obscurity break buy public series unfortunately pass anymore write great loss eminently likable fallible detective leaven dark brand humor next go back earlier classic fortunate enough find hardcover include best release publication first", "genres": ["Fiction & Literature", "Mystery & Suspense"], "summary": "After a brutal day investigating a quadruple homicide, Detective Hoke Moseley settles into his room at the un-illustrious El Dorado Hotel and nurses a glass of brandy. With his guard down, he doesn’t think twice when he hears a knock on the door. \r\n\r\nThe next day, he finds himself in the hospital, badly bruised and with his jaw wired shut. He thinks back over ten years of cases wondering who would want to beat him into unconsciousness, steal his gun and badge, and most importantly, make off with his prized dentures. \r\n\r\nBut the pieces never quite add up to revenge, and the few clues he has keep connecting to a dimwitted hooker, and her ex-con boyfriend and the bizarre murder of a Hare Krishna pimp.\r\n\r\nChronically depressed, constantly strapped for money, always willing to bend the rules a bit, Hoke Moseley is hardly what you think of as the perfect cop, but he is one of the the greatest detective creations of all time.\r\n\r\n“Extraordinarily winning. . . . Pure pleasure. . . . Mr. Willeford never puts a foot wrong.” The New Yorker\r\n", "asin": "1400032466", "rank": "389362", "city": "Miami", "image": "https://images-na.ssl-images-amazon.com/images/I/51IQweV1AeL.jpg", "country": "United States of America", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}