{"where_to_read": ["Inter City Bus", "This is gonna be a long ride"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 664, "rating": 4.3, "reviews": [{"review_sentiment": 4.0, "review_text": "A little bit slow"}, {"review_sentiment": 5.0, "review_text": "Beautifully conceived. Beautifully written. This book will be a joy to read for sophisticated readers. Deservedly ranks as a 20th century classic."}, {"review_sentiment": 3.0, "review_text": "I enjoyed the book but I was disappointed It just touched the surface of the main characters. Maybe this is because the last two parts of the book are missing. I did  like how people are portrayed as really being the same in difficult situations, regardless of being enemies un war."}, {"review_sentiment": 4.0, "review_text": "good"}, {"review_sentiment": 1.0, "review_text": "Not what I thought it would be"}, {"review_sentiment": 5.0, "review_text": "Written by a woman who was there, the prose is very evocative of the scene.  You get a real understanding of what France was like in 1940.  Truly a shame the author died before completing part 3."}, {"review_sentiment": 5.0, "review_text": "This story is absolutely covers the gamut of emotions.. mostly sadness and existential.  Also, the book was shipped very quickly! Thank you!"}, {"review_sentiment": 4.0, "review_text": "it was okay"}, {"review_sentiment": 5.0, "review_text": "loved the movie"}, {"review_sentiment": 5.0, "review_text": "The most romantic, bittersweet story I have seen in a long time. Would give it 10 stars if I could. Watch it every chance I get! If only they would come out with a sequel!"}]}, "authors": ["Irène Némirovsky"], "isbn": "1400096278", "longitude": 2.3514992, "periods": ["1900s"], "title": "Suite Française", "word_cloud": "little bit slow beautifully conceive beautifully write joy sophisticate reader deservedly rank century classic enjoy disappoint touch surface main character maybe last part miss people portray really difficult situation enemy un war good not think woman prose evocative scene get real understanding shame author die complete part story absolutely cover gamut mostly sadness existential also ship quickly okay love movie romantic bittersweet story see long time star chance get sequel", "genres": ["Fiction & Literature", "WWII"], "summary": "Beginning in Paris on the eve of the Nazi occupation in 1940. Suite Française tells the remarkable story of men and women thrown together in circumstances beyond their control. As Parisians flee the city, human folly surfaces in every imaginable way: a wealthy mother searches for sweets in a town without food; a couple is terrified at the thought of losing their jobs, even as their world begins to fall apart. \r\n\r\nMoving on to a provincial village now occupied by German soldiers, the locals must learn to coexist with the enemy—in their town, their homes, even in their hearts.When Irène Némirovsky began working on Suite Française, she was already a highly successful writer living in Paris. But she was also a Jew, and in 1942 she was arrested and deported to Auschwitz, where she died. For sixty-four years, this novel remained hidden and unknown.", "asin": "1400096278", "rank": "44959", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/5116zQif8VL.jpg", "country": "France", "story_arc": ["Cinderella", "An initial rise in good fortunes, followed\n                    by a setback, but a happy ending"]}