{"where_to_read": ["Park", "Leaves of grass are all up in my stuff"], "readability": 0, "latitude": 48.8566101, "ratings": {"num_ratings": 90, "rating": 4.4, "reviews": [{"review_sentiment": 2.0, "review_text": "The information is good, but reads like a school text book."}, {"review_sentiment": 5.0, "review_text": "The Paris of 1789 did not simply spring into existence. It was always there, as Alistair Horne explains in his brilliant history of the City of Light. Horne foreshadows the revolution of 1789 by describing various events that shaped the monarchy, the aristocrats and the bourgeoisie into the entities that they were at the start of the revolution. Paris was a place mistrusted by the Kings of France from the day that Henri IV was assassinated there, leading to the establishment of Versailles, so that the king and the aristocrats became isolated from and out of touch with the City. I was a little surprised to see Horne make errors such as identifying Hortense as the sister in law of Josephine (Hortense was her daughter), but overall the book is great, written with style and focus."}, {"review_sentiment": 4.0, "review_text": "A thoroughly enjoyable guided tour of the history of Paris by someone who knows the story hidden in every corner and behind every door."}, {"review_sentiment": 5.0, "review_text": "Great book"}, {"review_sentiment": 5.0, "review_text": "Still reading it, but I love it! It's a very informative book about the history of Paris. At least it is for an amateur historian like myself. Wish that I had read this before my trip there in 2015! I would have understood more of what I was seeing!"}, {"review_sentiment": 5.0, "review_text": "Good product/price/delivery"}, {"review_sentiment": 5.0, "review_text": "Read this book before going to Paris. Read this book if you only dream of going to Paris. A great history."}, {"review_sentiment": 5.0, "review_text": "Well written and authoritative. Read this and you will know more about Paris than the natives."}, {"review_sentiment": 5.0, "review_text": "It felt as if, after reading the book, that I had lived for 800 years in Paris. The author makes reveals the secrets and rumors of Paris like a friend would. If you love Paris, this is the book for you!"}, {"review_sentiment": 5.0, "review_text": "Wonderful book, excusing the intro which compares Paris to a woman -ugh!  (maybe written long ago??)"}]}, "authors": ["Alistair Horne"], "isbn": "1400034469", "longitude": 2.3514992, "periods": ["1600s", "1700s", "1800s", "1900s", "2000s", "1500s"], "title": "Seven Ages of Paris", "word_cloud": "information good read school text simply spring existence always explain brilliant history foreshadow revolution describe various event shape monarchy aristocrat bourgeoisie entity start revolution place mistrust king day assassinate lead establishment king aristocrat become isolated touch little surprised see make error identify sister law daughter overall great write style focus thoroughly enjoyable guide tour history someone know story hidden corner door great still read love informative history least amateur historian trip see good go dream go great history well write authoritative know native felt read live year author make reveals secret rumor friend wonderful excuse intro compare woman maybe write long ago", "genres": ["History"], "summary": "In this luminous portrait of Paris, celebrated historian Alistair Horne gives us the history, culture, disasters, and triumphs of one of the world’s truly great cities. Horne makes plain that while Paris may be many things, it is never boring.\r\n\r\nFrom the rise of Philippe Auguste through the reigns of Henry IV and Louis XIV (who abandoned Paris for Versailles); Napoleon’s rise and fall; Baron Haussmann’s rebuilding of Paris (at the cost of much of the medieval city); the Belle Epoque and the Great War that brought it to an end; the Nazi Occupation, the Liberation, and the postwar period dominated by de Gaulle--Horne brings the city’s highs and lows, savagery and sophistication, and heroes and villains splendidly to life. With a keen eye for the telling anecdote and pivotal moment, he portrays an array of vivid incidents to show us how Paris endures through each age, is altered but always emerges more brilliant and beautiful than ever. The Seven Ages of Paris is a great historian’s tribute to a city he loves and has spent a lifetime learning to know.", "asin": "1400034469", "rank": "74371", "city": "Paris", "image": "https://images-na.ssl-images-amazon.com/images/I/519SC5SR0ML.jpg", "country": "France", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}