{"where_to_read": ["Beach", "IS there any better place to read"], "readability": 0, "latitude": 41.0096334, "ratings": {"num_ratings": 165, "rating": 3.8, "reviews": [{"review_sentiment": 5.0, "review_text": "The book's subtitle, Memories and the City, guided me through the chapters, many of which can stand alone, with themes that weave in and out.  Pamuk questions his own memories from the beginning, with a kind of “double” in another house where he lived briefly as a child, and with his older brother sometimes questioning his accounts of the past.  His portrayal of growing up in a family with three generations in one apartment, even as he escaped into make-believe and games, seems both straightforward and complicated at the same time.Pamuk presents the City of Istanbul as seen through Western European photographs, paintings, and travel writings from the nineteenth century, and from Istanbul artists and writers, including journalists, a century later, after the fall of the Ottoman Empire, as well as from his own experience of walking all over its different neighborhoods. He sees the neighborhoods falling into ruin, the mansions along the Bosphorus burning to the ground one after another, and his own family’s fortunes gradually crumbling.  Against this decline and loss of pride, he sets his early love for painting, begun with a wish for praise and developing into joy of self-expression, and then reveals how he eventually chose to write instead.This book is hard to read straight through because of all the interweaving ideas, stories, and themes.  But various chapters, images and passages echo and invite rereading, and as I reread, I love the book more and more.  I only wish I could enlarge some of the photographs to see them in more detail."}, {"review_sentiment": 1.0, "review_text": "I was really looking forward to reading this book, as I am fond of Pamuk’s writing and have always been intrigued by Istanbul. The overall repetitiveness and boring observations about mundane family life, made this book hard to read and very disappointing."}, {"review_sentiment": 5.0, "review_text": "fabulous. my favorite of Pamuk's books. One of my top 50"}, {"review_sentiment": 4.0, "review_text": "I did received them in perfect condition, Thanks!"}, {"review_sentiment": 5.0, "review_text": "I found this book a delight to read. It is probably my favorite Pamuk (I've also read The Black Book and Snow). While Pamuk embraces a nostalgia for the decline and loss of Ottoman Turkey (there is a specific word for this nostalgia, Huzun if I remember correctly), he manages to explore the complexities of those feelings without romanticizing Ottoman history and culture. The reader gains a beautiful history of Istanbul and the various encounters that the city had with Western travelers alongside an intimate account of Pamuk's childhood. If you are looking explicitly for a history of Istanbul, this is not your book, and you will probably be disappointed, but I think that Pamuk offers something more interesting through providing accounts of various, fascinating historical events and figures (ex an openly gay writer from the 19th century who started an absurdly massive, and exhaustive encyclopedia of the history of Istanbul and everything in it) through the subjective, highly sensitive eyes of an Istanbullu. Reminds me of Sebald, partial because of the amazing photos presented alongside the text undoubtedly, but also for the beauty of the writing."}, {"review_sentiment": 4.0, "review_text": "Took me awhile to read - started it in Europe then Istanbul and finally home in SoCal but enjoyed  the writing,  loved the old pictures and especially the seasonal moods of this exotic and fascinating city"}, {"review_sentiment": 3.0, "review_text": "In the late nineteenth and early twentieth centuries, Mexicans of good class made a mockery of the dandified women of native or mixed blood, who gussied up their clothes and assumed the airs of the foreigner or socialite.  Cartoonist José Guadalupe Posada drew cartoons of them and published them in the local newspapers and prolific and irreverent painter Diego Rivera incorporated them into one of his signature murals, “Memories of a Sunday in the Alameda Park”.  He gave them a name, “catrinas”, and they are still mocked, celebrated, even awarded prizes in costume competitions, during of the “Day of the Dead”, a uniquely Mexican festivity that blends the struggles and pretentions, the sympathy and aspirations, of the existing world, with the conflicts and longing of the departed, from their residence in the Underworld.Something of this bleeds through Pamuk’s continually apologetic and ever dissatisfied view of the post-Ottoman Istanbul of his youth and yearnings, and a persistent conflict with the notions of “modernity” and “westernization”, as if these were some sort of extra-terrestrial invasion.  His self-pity knows no end.  How could “My Name is Red”, so brilliant, have emerged from the same pen as “Istanbul”, which instead of lauding a unique city, spends endless pages deploring the sights, sounds, scents and scenes that make it so remarkable.  Am I just another Westerner, cradling my taste for the exotic?  Forgive my outrage.  Like India, or Mexico, or Uzbekistan, or Peru—you name it—this is not a world that was, it is a world that still is, but different.  It changed.  Everything changes.  One century flows into another, conquests vanish in burocracy, pinnacles becomes nadirs, the unique degenerates, and when has it ever been different?Our author, however, finally relents, if just a notch.  He, and I, like Pierre Lotí in his time, find Eyüp enchanting.  But then, I am a westerner, entranced by the charm of this distant neighborhood, nestled at the very end of the Golden Horn.  Pamuk makes us feel guilty for even turning to look at it."}, {"review_sentiment": 5.0, "review_text": "The book in tact, good quality."}, {"review_sentiment": 5.0, "review_text": "The quality of the services was within my expectation."}, {"review_sentiment": 5.0, "review_text": "Great read"}]}, "authors": ["Orhan Pamuk"], "isbn": "1400033888", "longitude": 28.9651646, "periods": ["1900s"], "title": "Istanbul: Memories and the City", "word_cloud": "subtitle guide chapter many stand alone theme weave question begin kind double house live briefly child brother sometimes question account portrayal grow family generation apartment even escape game seem straightforward complicate present see western european photograph painting travel writing nineteenth century artists writer include journalist century later well experience walk different neighborhood see neighborhood fall ruin mansion burn ground family fortunes gradually crumble decline loss pride set early love painting begin wish praise develop joy reveals eventually choose write hard straight interweave idea story theme various chapter image passage echo invite rereading reread love wish photograph see detail really look forward read fond writing always intrigue overall repetitiveness boring observation mundane family life make hard disappointing fabulous favorite top receive perfect condition thanks find delight probably favorite also embrace nostalgia decline loss specific word remember correctly manage explore complexity feeling romanticize history culture gain beautiful history various encounter western traveler alongside intimate account childhood look explicitly history probably disappoint think offer something interest provide account various fascinate historical event figure ex openly gay writer century start absurdly massive exhaustive encyclopedia history everything subjective highly sensitive eye partial amazing photo present alongside text undoubtedly also beauty write awhile start finally home enjoy write love old picture especially seasonal mood exotic fascinating late nineteenth early twentieth century good class make mockery dandified woman native mixed blood gussied clothes assume air foreigner socialite draw cartoon publish local newspaper prolific irreverent painter incorporate signature mural give name ocarina still mock celebrate even award prize costume competition uniquely mexican festivity blend struggle pretension sympathy aspiration exist world conflict long departed residence bleeds continually apologetic ever dissatisfy view youth yearning persistent conflict notion modernity westernization sort invasion know end brilliant emerge pen instead laud unique spend endless page deplore sight sound scent scene make remarkable cradle taste exotic outrage name world world still different change change century flow conquest vanish burocracy pinnacle become nadir unique degenerate ever different author however finally relents like time eye enchant westerner entranced charm distant neighborhood nestled end make guilty even turn look tact good quality quality service expectation great", "genres": ["Memoir", "History"], "summary": "A shimmering evocation, by turns intimate and panoramic, of one of the world’s great cities, by its foremost writer. Orhan Pamuk was born in Istanbul and still lives in the family apartment building where his mother first held him in her arms. \r\n\r\nHis portrait of his city is thus also a self-portrait, refracted by memory and the melancholy–or hüzün– that all Istanbullus share: the sadness that comes of living amid the ruins of a lost empire. With cinematic fluidity, Pamuk moves from his glamorous, unhappy parents to the gorgeous, decrepit mansions overlooking the Bosphorus; from the dawning of his self-consciousness to the writers and painters–both Turkish and foreign–who would shape his consciousness of his city. \r\n\r\nLike Joyce’s Dublin and Borges’ Buenos Aires, Pamuk’s Istanbul is a triumphant encounter of place and sensibility, beautifully written and immensely moving.", "asin": "B0075L25AK", "rank": "9482557", "city": "Istanbul", "image": "https://images-na.ssl-images-amazon.com/images/I/41nfpzIABOL.jpg", "country": "Turkey", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}