{"where_to_read": ["Plane", "Locked in a metal tube and cart service\n                 stopped"], "readability": 0, "latitude": 0.0, "ratings": {"num_ratings": 33, "rating": 4.7, "reviews": [{"review_sentiment": 5.0, "review_text": "Great product. Great service."}, {"review_sentiment": 4.0, "review_text": "I used it as a guidebook when I was in Provence last week.  It helped  considerably.I felt like I was walking in Mr. Mayle's shoes."}, {"review_sentiment": 5.0, "review_text": "This is a great introduction to \"all things Provence\". Read before you go."}, {"review_sentiment": 5.0, "review_text": "A wonderful book. If you love Provence, as I do, you'll love this book. I'm only sorry that the borders of Peter Mayle's Provence are so limited. I've always viewed Provence from the Italian border to the mouth of the Rhone. He's left out a good part of the Provence that I know best. Nevertheless the part that he covers is filled with interesting places, foods and people.Enjoyable and really worth reading!"}, {"review_sentiment": 5.0, "review_text": "I am excited about my trip to the Provence Region in April of this year!  Peter Mayle is an expert on Provence."}, {"review_sentiment": 5.0, "review_text": "I purchased this for my wife. First off, the book arrived in very good condition, as promised. Almost new, and far better than most used books we've examined. We're looking forward to spending some time in Provence as part of a trip to France in a couple of weeks. Since my wife previously enjoyed reading Peter Mayle's anecdotal tales of life as an Englishman trying to adapt to Provençal culture, weather, and food, this humorous, vivid and useful cataloging of what makes Provence special was a fantastic follow-up! My wife loves it; she says it reads like a novel, not an encyclopedia. Enjoy!"}, {"review_sentiment": 5.0, "review_text": "This book is delightful, charming, and witty! I loved it so much, I ordered all of the author's books about Provence. If you are looking for something easy to read, interesting, and funny, this is it."}, {"review_sentiment": 4.0, "review_text": "Peter Mayle writes his Provencial tales in such a way that one feels as if they are there, in the cafe, surrounded by the characters and geography of this wonderful part of the world. He isn't superfluous and doesn't embellish, but gives just enough detail to make any story quite interesting and colorful."}, {"review_sentiment": 5.0, "review_text": "I really enjoy Peter Mayle's non-ficiton writing.  And, this audio book is no exception.  Peter Mayle's is funny, informative and his love of the time he spent in Provence shines in this book.  The narrator is excellent."}, {"review_sentiment": 5.0, "review_text": "As is usual for a Peter Mayle book, this one was funny and informative. I read this one while in Provence and used some of the info to enrich my experience."}]}, "authors": ["Peter Mayle"], "isbn": "1400095697", "longitude": 0.0, "periods": ["2000s"], "title": "Provence A-Z: A Francophile's Essential Handbook", "word_cloud": "great product service use guidebook last week help walk shoe great introduction thing wonderful love love sorry border limit always view italian border mouth leave good part know best nevertheless part cover fill interesting place food really worth reading excite trip year expert purchase wife arrive good condition promise new far better use examine look forward spending time part trip couple week wife previously enjoy read anecdotal tale life try adapt culture weather food humorous vivid useful cataloging make special fantastic wife love say read encyclopedia delightful charm witty love much order author look something easy interesting funny write tale way feel cafe surround character geography wonderful part world superfluous embellish give enough detail make story quite interesting colorful really writing audio exception funny informative love time spend shin narrator excellent usual funny informative use info enrich experience", "genres": ["Travel Writing"], "summary": "The ultimate “dictionary” for lovers of Provence: Peter Mayle's personal selection of the foods, customs and words he finds most fascinating, curious, delicious, or just plain fun.\r\n\r\nThough organized from A to Z, this is hardly a conventional work of reference. In more than 170 entries, Peter Mayle—bestselling author of A Year in Provence—writes about subjects as wide-ranging as architecture and zingue-zingue-zoun (in the local patois, a word meant to describe the sound of a violin). And, of course, he writes about food and drink: vin rosé, truffles, olives, melons, bouillabaisse, the cheese that killed a Roman emperor, even a cure for indigestion. \r\n\r\nProvence A-Z is a delight for Peter Mayle's ever-growing audience and the perfect complement to any guidebook on Provence, or, for that matter, France.", "asin": "1400095697", "rank": "314316", "city": "Provence", "image": "https://images-na.ssl-images-amazon.com/images/I/51lmieATkhL.jpg", "country": "FR", "story_arc": ["Icarus", "Opens with good fortunes, but doomed to fail"]}