{"where_to_read": ["Commuter Bus", "Stand And Read!"], "readability": 0, "latitude": 18.9321862, "ratings": {"num_ratings": 1141, "rating": 4.4, "reviews": [{"review_sentiment": 5.0, "review_text": "I loved this book, and I'm glad I chose to read it. The story of the real-life \"Emergency\" and the persistent and heartbreaking struggle opened my eyes to what others have experienced. The book is expertly written. Many times I was on the verge of tears, and I was held spellbound in emotion in chapter after chapter."}, {"review_sentiment": 5.0, "review_text": "The book was in very good shape!"}, {"review_sentiment": 4.0, "review_text": "Well-written. Complex story. Not an easy read. I've come back to it over a year later to finish up!"}, {"review_sentiment": 5.0, "review_text": "Religion is sometimes an excuse to mistreat, hurt, and murder. As a Christian, I’m so thankful that I know Jesus Christ as my savior. And that he wiped away religion and gave us a relationship."}, {"review_sentiment": 5.0, "review_text": "It’s a sad and beautiful world. This captures that better than any work in a long time.  Bravo"}, {"review_sentiment": 3.0, "review_text": "This was an interesting but difficult read. The history, the culture and the caste system is difficult for me to understand. The characters were all very colorful each with their own stories."}, {"review_sentiment": 5.0, "review_text": "I read this book several years ago at the suggestion of a coworker from India.  It has stayed with me and I often think about this book.  When I finished reading it, I wanted to go around kicking things yelling \"it's not fair, it's just not fair!\"  Mistry has created characters you feel you know.  And they do live lives in a fine balance.  There is just to much injustice for everyone, so much suspicion, so much graft and greed, and all these people wanted to do was make a living, even a barely subsistence living by trusting each other together. I still feel like kicking things and yelling \"it's not fair?\" when I think of this book.  I probably will try to reread it at some point but I'm not sure I could make it through again without getting so angry I have to quit.  The bad part is that some people probably have lived like this and been unfairly messed up like this.  Makes me a little more grateful to live in a society where things like this don't happen--yet."}, {"review_sentiment": 5.0, "review_text": "Superb. Masterful. Will be added to my all time favorite list. Full range of emotions evoked. Reader be forewarned."}, {"review_sentiment": 3.0, "review_text": "Very depressing!"}, {"review_sentiment": 4.0, "review_text": "Too depressingly realisic"}]}, "authors": ["Rohinton Mistry"], "isbn": "140003065X", "longitude": 72.8308337, "periods": ["1900s"], "title": "A Fine Balance", "word_cloud": "love glad choose story persistent heartbreaking struggle open eye others experience expertly write time verge tear hold spellbound emotion chapter chapter good shape story not easy come back year later finish religion sometimes excuse mistreat hurt murder christian thankful know savior wipe religion give relationship sad beautiful world capture better work long time interesting difficult history culture caste system difficult understand character colorful story several year suggestion coworker stay often think finish read want go kick thing yell fair fair create character know live life much injustice everyone much suspicion much graft greed people want make live even barely subsistence live trust together still feel kick thing yell fair think probably try reread point sure get angry quit bad part people probably live unfairly mess little grateful live society thing happen yet add time favorite list range emotion evoke forewarn very depress depressingly realistic", "genres": ["Fiction & Literature", "Historical Fiction"], "summary": "With a compassionate realism and narrative sweep that recall the work of Charles Dickens, this magnificent novel captures all the cruelty and corruption, dignity and heroism, of India. \r\n\r\nThe time is 1975. The place is an unnamed city by the sea. The government has just declared a State of Emergency, in whose upheavals four strangers--a spirited widow, a young student uprooted from his idyllic hill station, and two tailors who have fled the caste violence of their native village--will be thrust together, forced to share one cramped apartment and an uncertain future. \r\n\r\nAs the characters move from distrust to friendship and from friendship to love, A Fine Balance creates an enduring panorama of the human spirit in an inhuman state.\r\n\r\n\"A serious and important work . . . the product of high intelligence and passionate conviction.\" New York Review of Books\r\n", "asin": "140003065X", "rank": "20409", "city": "Mumbai", "image": "https://images-na.ssl-images-amazon.com/images/I/41-s-Ou8dXL.jpg", "country": "India", "story_arc": ["Person_In_A_Hole", "Fortunes fall, but the protagonist\n                    bounces back"]}